{
  "id": "q4mm68",
  "text": "This is how feminist think we should treat female criminals\n",
  "timestamp": "2021-10-09 14:39:17",
  "score": 612,
  "subreddit": "t5_2zaj2",
  "num_children": 53,
  "author": 171623,
  "replies": [
    {
      "id": "hfzjq3v",
      "text": "Ahh so the same can be said for every man that kills their kids then.\n\nThey do not need punishment.  They must have had a mental breakdown and need help because I suspect this was out of character.\n\nThe hypocrisy is just insane.",
      "timestamp": "2021-10-09 14:51:03",
      "score": 78,
      "num_children": 2,
      "replies": [
        {
          "id": "hfzko6q",
          "text": "Lol, i think scum feminists wont approve you.",
          "timestamp": "2021-10-09 14:58:37",
          "score": 34,
          "num_children": 1,
          "author": 173850,
          "replies": [
            {
              "id": "hfzlo2e",
              "text": "That's what I appreciates about you.  :)",
              "timestamp": "2021-10-09 15:06:19",
              "score": 20,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hg6wv7y",
          "text": "97% of harm done to children is done by the mother.",
          "timestamp": "2021-10-11 04:19:04",
          "score": 1,
          "num_children": 0,
          "author": 402389,
          "replies": []
        }
      ]
    },
    {
      "id": "hfziinj",
      "text": "as a woman, I think it's sexist to treat men and women different for the same crime.",
      "timestamp": "2021-10-09 14:41:30",
      "score": 141,
      "num_children": 5,
      "author": 352305,
      "replies": [
        {
          "id": "hfzu7qh",
          "text": "\"But femINiSm IS AbOuT EqUaLiTy!\"",
          "timestamp": "2021-10-09 16:11:57",
          "score": 72,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hg119se",
          "text": "Stay woke friend! We all wish for true equality and to be better together as humans!",
          "timestamp": "2021-10-09 21:28:37",
          "score": 12,
          "num_children": 1,
          "author": 401007,
          "replies": [
            {
              "id": "hg196fe",
              "text": "You're stupid if you think you can be the equal of a woman. Her superior she will try to retain the attention of, her inferior she will hate and despise. Look into woman psychology, hypergamy and briffault Law",
              "timestamp": "2021-10-09 22:29:45",
              "score": 2,
              "num_children": 1,
              "replies": [
                {
                  "id": "hg1r88b",
                  "text": "You're stupid and were brought up shit if you believe you deserve superiority because of the simple difference of genitalia.",
                  "timestamp": "2021-10-10 00:57:30",
                  "score": 2,
                  "num_children": 1,
                  "author": 401007,
                  "replies": [
                    {
                      "id": "hg1sk9h",
                      "text": "Nature's Law don't care about your make pretend ideas. \n\nInconscious thinking patterns are rooted deep AND.IT.WORKS.THAT.WAY \n\nContinue to deny truth, in the end it'll come back to bite you until you understand. \n\nMen are made to provide a safe environment and ressources in exchange for exclusive reproductive rights. Women are made to provide a home and nurture children in exchange for protection from outside threats. \nIt's been that way for 40.000 years you cannot change that. You have to acknowledge it to make a society that works without conflicts and for the betterment of all !\n\nMen are flawed by polygamy, women with hypergamy. Deal with it and make rules for a society that don't rely on hate against half it's population\n\nContinue to whine, nature care not for those who defy her. \n\nEach time a women gets ANY power, it ends in disaster because she's unable to deal with it rationally due to her brain patterns. Babylon fell from this. Rome. Sumer. Egypt. Victorian England. Tsarist russia. Hysteria, foly, decadence, fall. \n\nNATURE CARE NOT OF YOUR IDEAS. IT PROVIDES ANSWERS THROUGH HISTORY",
                      "timestamp": "2021-10-10 01:08:25",
                      "score": 2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hg2eg3d",
                          "text": "Cry yourself to sleep, I don't give a diddly squat.",
                          "timestamp": "2021-10-10 04:15:58",
                          "score": -4,
                          "num_children": 1,
                          "author": 401007,
                          "replies": [
                            {
                              "id": "hg322ps",
                              "text": "I think you aren't intelligent enough to understand, sadly. \n\nOr too ignorant. \n\nGo study the subject, we'll talk later.",
                              "timestamp": "2021-10-10 09:10:38",
                              "score": 0,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hg33frw",
                                  "text": "The Aggressive stance you have taken is more cringe than empowered, no high horse, playing yourself the victim over something you chose to argue about lmao.",
                                  "timestamp": "2021-10-10 09:28:59",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 401007,
                                  "replies": [
                                    {
                                      "id": "hg3f1c2",
                                      "text": "I don't care for your moral approval, only if you can rationally prove me wrong. \n\nIf you can't, please shut up and learn. \n\nNote that i didn't downvoted your comments, you're making an emotional fool of yourself.",
                                      "timestamp": "2021-10-10 12:02:30",
                                      "score": 0,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hg3n1lb",
                                          "text": "Only a simp would see this conversation and be triggered enough to even be mad at me, you've been a little crybaby since the start and It's really unbecoming of us as civilized personnel..",
                                          "timestamp": "2021-10-10 13:23:54",
                                          "score": 0,
                                          "num_children": 1,
                                          "author": 401007,
                                          "replies": [
                                            {
                                              "id": "hg3nmwi",
                                              "text": "by doing what? Arguments, arguments, not empty words please....",
                                              "timestamp": "2021-10-10 13:29:10",
                                              "score": 0,
                                              "num_children": 0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hjlew1j",
          "text": "Another woman chiming in. I hate lighter sentences for women. \nGender has no place in the courtroom.",
          "timestamp": "2021-11-06 20:46:57",
          "score": 2,
          "num_children": 0,
          "author": 118972,
          "replies": []
        },
        {
          "id": "hg04mkv",
          "text": "how do you deal with your hypergamy and inability to reason without feelings?",
          "timestamp": "2021-10-09 17:28:32",
          "score": -18,
          "num_children": 4,
          "replies": [
            {
              "id": "hg0ihvw",
              "text": "What the fuck dude",
              "timestamp": "2021-10-09 19:10:58",
              "score": 14,
              "num_children": 1,
              "author": 21445,
              "replies": [
                {
                  "id": "hg0tm0h",
                  "text": "ahhh, the white knights. You didn't make me wait very long =)",
                  "timestamp": "2021-10-09 20:33:03",
                  "score": -4,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hg191y6",
                      "text": "Well aww poor me. Guess having a brain mekes me evil.",
                      "timestamp": "2021-10-09 22:28:46",
                      "score": 4,
                      "num_children": 1,
                      "author": 21445,
                      "replies": [
                        {
                          "id": "hg1ezv1",
                          "text": "You're obviously not using it at the moment. I'll let you draw the conclusion once you'll be a bit wiser you'll see i'm right and that all other ways are doomed to fail. I'll ne happy to discuss then but but in the meantime go read about female psycholgy and hypergamy.",
                          "timestamp": "2021-10-09 23:16:33",
                          "score": -3,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hg32p5o",
                              "text": "You are so deep down the rabbit hole. Im actualy worried anout you. What happened?",
                              "timestamp": "2021-10-10 09:19:18",
                              "score": 2,
                              "num_children": 1,
                              "author": 21445,
                              "replies": [
                                {
                                  "id": "hg3epef",
                                  "text": "Trying to patronize someone who try to open your eyes about something is not a good idea. Makes you appear so out or rational arguments that you revert to emotions to try to appear \"winning\" the discussion",
                                  "timestamp": "2021-10-10 11:58:42",
                                  "score": 0,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hg3ftw1",
                                      "text": "Dude. I am not patronising you. You lashed out at random person. Here in this sub we are primarily talking about feminism. Not mgtow and women. There are other subs for that. If you want to talk about hypergamy then go somewhere else, as this in not a space for it.",
                                      "timestamp": "2021-10-10 12:11:32",
                                      "score": 3,
                                      "num_children": 2,
                                      "author": 21445,
                                      "replies": [
                                        {
                                          "id": "hg3g5ol",
                                          "text": "Believe what you belive. But i am going to defend a *person* who is attacked by another person. Regardles of gender. You attacked another person. Thats it for the conversation. Have a nice day",
                                          "timestamp": "2021-10-10 12:15:15",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 21445,
                                          "replies": []
                                        },
                                        {
                                          "id": "hg3nri9",
                                          "text": "I'm not mgtow?\n\nand if you don't include hypergamy when you're talking about females you're talking about a fantazised idea, not actual humans.",
                                          "timestamp": "2021-10-10 13:30:15",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hg0alxu",
              "text": "Thats not a problem as long as the decency to apologise for said behaviour coz of hormones/feelings is there. Even we as men have shortcomings. \n\nProblem is now there is zero accountability for actions. No apologizing for shitty unreasonable.behaviour and its always \"accept me for me\" however a man \"must change for her\".",
              "timestamp": "2021-10-09 18:12:02",
              "score": 4,
              "num_children": 1,
              "replies": [
                {
                  "id": "hg0fkl2",
                  "text": "The behavior must not happen at all. Talibans are right in their ways to deal with women, as were the romans.",
                  "timestamp": "2021-10-09 18:49:10",
                  "score": -7,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hg0kgpx",
                      "text": "Mate im a muslim lol. We are supposed to be patient with that behaviour and understand its part of their nature. \n\nBy this I am not meaning shit like gaslighting or something. Theres certain behaviours that aint harmful more just annoying and all. A wise woman knows her shortcomings and apologises for it. \n\nWe as men aint so perfect either. Its about completing each other.",
                      "timestamp": "2021-10-09 19:25:45",
                      "score": 3,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hg0tgo3",
                          "text": "Of course, i'm not for violent solutions. Now the western men understand more and more and are going to come with solutions of our own. Else, western europe will either be muslim or destroyed. I don't enjoy the idea of such a loss of history and creativity. You have seen the western women? Unless very harsh solutions to get them back to order, the society will colapse. I don't enjoy this idea, but yeah, indeed, you muslims are wiser than us in the treatment of women. My ideal about this would a restauration of roman pater familia right of life and death over his family and the women be barred from possessing more than a few riches for themselves. It worked. It'll work again when our society collapse.\n\nWhy be patient when you can return to what make societies a great place?\n\ni'll quote machiavelli on this, \"it is better to be feared than loved\". Thus, talibans are right in their example.",
                          "timestamp": "2021-10-09 20:31:59",
                          "score": 4,
                          "num_children": 2,
                          "replies": [
                            {
                              "id": "hg14ugy",
                              "text": "The talibans is a bad example tho I have a feeling they do alot of domestic violence in the name of Islam altho its not sanctioned in Islam. A girl who follows the religion will always strive to be good in every way. I made it clear to my wife im the leader of the family and she should respect my decisions given it isn't unreasonable. I would say I am a reasonable dude in giving her leeway lol I let her paint the damn room pink as she wanted haha\n\nStuff like going on one on one hangouts and shit with male friends is a no for me. Either its always a group of friends or no. When we had kids I said its better she wait until she grows up a bit then.she can.go for work again. Didnt have to convince her much on.this since she herself decided its better. Even on hijab, I told her I would like if she wore it, I can even force it but I am not gonna force it since its between her and God and if she doesnt do it from the heart its her who is gonna be held accountable for that. So she wore it on her own as well.\n\nYeah western women...I see that close up pretty well haha. Sucks this feminism bs is even catching in muslim countries as well. I agree with you leadership of a country will be in ruin if you put women in it. As you mentioned giving them free rein has absolutely caused division between men and women as a whole and in other aspects. Good men are always better for leaders hence why its forbidden for a woman to lead the country.",
                              "timestamp": "2021-10-09 21:55:35",
                              "score": 3,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "hg18po4",
                                  "text": "Feminism is a jewish creation. There are documents about it's use against sharia led countries. Watch out for women, you give them a finger they take the arm. I'm looking at the rose paint here. In her mind she now Can make you do things for her. You're slowly being turned into a thing she Can control in her inconscious mind. Once it happens all respect and attirance for you is forfeit and she'll start to hate you and use deception to ruin you. It's what's happening to the west now.",
                                  "timestamp": "2021-10-09 22:26:02",
                                  "score": 7,
                                  "num_children": 2,
                                  "replies": [
                                    {
                                      "id": "hg2jeea",
                                      "text": "Oh I agree about that. They are very selfish. That is why they need the rules set by the religion. \n\nDont worry I was always privvy to their ways luckily. No way they can ever attempt to control me. I make sure that my circle is also safe and its a huge one. Ill know if she has no respect or love. Thats fine. The door is there she can immediately leave lmao ill be good. In the past 10 years I have truly learnt what women are. \n\nNeither are most independent as they claim,they bring nothing to the table and majority are just useless for relationships. They are incapable of maintaining friendships even the girls i thought were popular when I truly got to know.them they said they actually.dont have friends. I have observed my friends parents, my wives friends and.her work mates (the amount of constant bs is unimaginable). I have seen the jealousy within my own.family when my grandmother showed love to my wife. I cut them off after 8 years of putting up with it. \n\nI know what they are now haha. I wont.ever allow myself or my close circle to fall to any of it ever.",
                                      "timestamp": "2021-10-10 05:06:43",
                                      "score": 2,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hg39wv8",
                                          "text": "Yeah, I also found out later in life. Now I understand religion. As I said before there is some truths in it, but a lot is unnecessary. I like to keep my mind clean and free of ideologies, religion and whatnot. I'm all in on science and I'm a scientist at heart. But psychology is a huge part of our lives sadly and a lot of religions did some things right, but science explains why. And that's what I use.",
                                          "timestamp": "2021-10-10 10:57:59",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 96545,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "hg39maf",
                                      "text": "It's worse. Feminism was created and allowed by business owners who thought: How can we have more cheap labor and pay people less. What happened? Women started working, so you have 100% more laborers and labor got cheaper because more people started working.\n\nThat's why rich men and the establishment allowed it to happen. Labor got cheap because of the simple economic rule: Supply and demand.",
                                      "timestamp": "2021-10-10 10:53:52",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 96545,
                                      "replies": [
                                        {
                                          "id": "hg3ewb8",
                                          "text": "Yeah, there was an idea to revert this around 90 years ago in a certain country bordering the rhine, i wonder what happened when those bankers and international clique realized it was a threat to their domination...",
                                          "timestamp": "2021-10-10 12:00:53",
                                          "score": 2,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "hg39f51",
                                  "text": "Yeah, but you forget that Western women don't submit and are not submissive. The women here wouldn't have accept that. If you said to a Western woman that you're the head of the household and the leader of the family (your own words), she would have dumped you or fight you on it.\n\nMy mentality is the same and my parents are Muslim, but I'm not religious or anything. I still think that there is some truth in the doctrine. But Western women are fucked in the head by all sorts of ideological ideas.",
                                  "timestamp": "2021-10-10 10:51:07",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 96545,
                                  "replies": [
                                    {
                                      "id": "hg7rfat",
                                      "text": "Agreed. Thats why I would rather stay single until those conditions are met.",
                                      "timestamp": "2021-10-11 11:02:39",
                                      "score": 1,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hky4j20",
                              "text": "Jesus Christ, your comment history is concerning. Get rid of your bullshit stance and desire to oppress women.",
                              "timestamp": "2021-11-17 04:10:26",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hkz6904",
                                  "text": "Why? Controlling them is the best solution, they are like children, unable to make rational decisions",
                                  "timestamp": "2021-11-17 11:40:59",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hl2uhxp",
                                      "text": "Wow, there’s really grown adults living in the 21st century who still think like this? I feel like I’m talking to a Northern conservative from the 1800s who has travelled in time, is trying to blend in, but can’t keep his biases hidden.  \n\nI took a quick look at your comment history, and it’s espoused with extreme examples of misogyny, like “women are stupid and crazy”, “women are breeding stock for us to use”, “I’ll treat them like objects”, “men are superior”, and you even talk about women like they are products, questioning others as to where you can “buy” a traditional woman. Let me remind you that women are human beings, in case you forgot. \n\nYou’ve likely been told this quite a lot, but are you aware that your views are very similar to those of radical incels? You mentioned that you interact with MGTOW ideologue, which is a particularly unhealthy path to venture down.  \n\nIf you’re someone who is chronically online and consistently surround yourself with toxic communities that exist for the sole purpose of upholding this extreme caricature of an entire gender based on preconceived judgements, then it is expected that the natural outcome of this is that you’ll feed into the prejudice presented before you and wind down the rabbit hole of doctrine. In reality, men within these communities have been hurt in the past and need to seek therapy instead of taking their grievances out on innocent people. I can only suggest you to do the same as an alternative to dedicating your time, which you seem to have too much of, to disseminating conspicuous inflammatory comments that are factually inaccurate towards half of the human population. \n\nI know there’ll be no reasoning with you, but I’m going to convey my argument for the readers and just for that smug satisfaction of seeing you fail to grip onto any factual reasoning beyond bigoted stereotypes and pernicious falsehoods. To address whichever point it is that you’re attempting to convey; it’s sad that I have to explain such simple concepts, but no, women are not incapable of rational thinking or reasoning, neither is oppression in any way justifiable. But by all means, you’re more than welcome to move to the Middle East and see how that works out for you! \n\nI’ll try to explain this as best as I can to ensure that it’s comprehendible on your level. There is an abundance of scientific evidence that demonstrates that women are just as capable, if not more capable, than men. This presumption that women are childish, illogical creatures that are incapable of rational discussion is a misogynistic trope that relies on regressive stereotypes that are factually untrue and is a very reductive viewpoint. I’ve noticed you have the tendency to speak with your feelings and inert trauma as opposed to engaging in discourse from a place of factual reasoning. A lot of your perpetuations are a transparent projection of incompetence that you assert onto women by reversing the roles to convince yourself that you’re a “rational” being, when in reality, you share the same characteristics of those you claim to despise – myopic narrative, inability to engage in intellectual debate, and petulant retaliations.  \n\nOn average women, actually score higher on the IQ scale than men by a few points ([source](https://www.csmonitor.com/Science/2012/0717/IQ-test-Women-are-now-scoring-higher-than-men#:~:text=While%20both%20genders'%20IQ%20scores,been%20seen%20around%20the%20world)), and a Scotland study shows that, in terms of variables, men are more likely than women to score on the lower end of the IQ scale, which accurately represents the positions men hold in society in terms of men more likely to be the bottom and top 10% while women are more likely to sit in the middle ([source](https://www.aei.org/carpe-diem/chart-of-the-day-scottish-iq-test-scores-by-gender-reveal-the-greater-variability-of-male-intelligence/)). Additionally, we have a copious amount of examples of intelligent and successful women who have accomplished a number of scientific achievements despite facing societal pushbacks and an inequality in opportunity due to their gender, such as Marie Curie, Jane Goodall, Katherine Johnson, Rosalind Franklin, Heidi Lamarr, Rachel Carson, Barbara Mcclintock, Rita Levi-Montalicini,Getrude Elion, Florence Rena Sabin, Ada Lovelace, Janaki Ammal, and Chien Shung-Wu. Is this truly a sign of women being incapable of logical thinking? By all means, I invite you to prove me wrong. \n\nThere are also several studies that estimate higher logical thinking in men than women: \n\n- Women have higher processing speed and semantic processing speed (Camareta 2006 and Trofimova 2013). \n\n- Women are better at prophetic processing and can understand words and language better (Majares 1997). \n\n- Women perform better at writing tasks (Olson, hhslander, Keenan, & willcult 2013). \n\nYou also claim that women are incapable of leadership, which is another factually unfounded contention. Many studies demonstrate that women make better leaders during crisis ([source](https://hbr.org/2020/12/research-women-are-better-leaders-during-a-crisis)), and research shows that women score higher in leadership skills due to their ability to reason with others and work with people ([source](https://hbr.org/2019/06/research-women-score-higher-than-men-in-most-leadership-skills?registration=success)). Additionally, female prime ministers rank the highest in leadership in the United Kingdom (Margaret Thatcher), Australia (Julia Gillard), and New Zealand (Jacinda Ardern), which you can see citation of on Wikipedia. Jacinda Ardern particularly, who is also the younger prime minister in the world, ranked number one in leadership in 2021 due to her prolific response to terrorism, the pandemic, and gender equality ([source](https://womensagenda.com.au/latest/the-five-ways-jacinda-arderns-proved-shes-the-worlds-greatest-leader/). We also have renowned powerful women who changed history, such as Mother Teresa, Asoka, Malala Yousafai, Rosa Parks, Maya Angelou, Sojourner Truth, Edith Cowan, Emeline Pankhurst, Amelia Earheart, Jane Austen, and Florence Knightingale. \n\nIn regards to your insistence to connote emotions with a negative connotation; emotions are what makes us human and lead us to make empathetic and morally righteous decisions in times of conflict – especially when dictating a society of people. I’m unsure why you feel the need to attach a negative label to a natural psychological human function. I'm even more perplexed on why you believe that women are more “emotional” than men and therefore shouldn’t be placed in positions of power. I think it stems from the notoriety of conflating “emotional” with “emotional intelligence”. \n\nWomen have a higher emotional intelligence than men, which shouldn’t be confused with being inherently more emotional. What this trait means is that women are more likely to express their emotions in a healthy manner and are equipped to deal with their emotions, whereas men are more likely to exert their emotions through negative course of action, such as violent outbursts. There are plenty of academic papers that demonstrate this through their studies, which I’d be more than happy to link you to upon request. Men are extremely emotional, especially in terms of anger, resentment, envy, and depressiveness. This is why we see that most violent crimes are committed by men, and it’s also exemplified through contextualised circumstances, such as a man murdering his cheating spouse, harassing women who reject him, raping others when sexually frustrated, or resorting to a physical altercation when provoked. \n\nIn conclusion, you habitually propagate a concerning amount of erroneous myths that aren’t based on any factual merit, but rather are used as a weapon to baselessly assert that women are lesser than men while simultaneously providing no substance to the discourse beyond unconscionable sophistry. Of course, I don’t expect a reply that isn’t consistent with your inimical rhetoric, so I’ll leave this here for potential readers that aren’t bound by their hypocritical dogmatism.",
                                      "timestamp": "2021-11-18 03:52:44",
                                      "score": 1,
                                      "num_children": 2,
                                      "replies": [
                                        {
                                          "id": "hl2uj94",
                                          "text": "Beep. Boop. I'm a robot.\nHere's a copy of \n\n###[Heidi]( https://snewd.com/ebooks/heidi/)\n\nWas I a good bot? | [info](https://www.reddit.com/user/Reddit-Book-Bot/) | [More Books](https://old.reddit.com/user/Reddit-Book-Bot/comments/i15x1d/full_list_of_books_and_commands/)",
                                          "timestamp": "2021-11-18 03:53:02",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        },
                                        {
                                          "id": "hl44ijs",
                                          "text": "Wow, a wall of text npc. Long time i haven't seen one of these. \nFor the mgtow analysis, it's not dogmatic, men come willingly in a search for answers. \"Oh you have been hurt poor you go to councelling and keep getting mistreated but learn to like it in the ass please our New society needs you to be exploited with no rebellious tendances\"\n\nWell Fuck you too, i won't. And a growing number of men will no more the more time progress.\n\nMen begin to awaken due to the reality crashing against what lies they've been taught, often by women in education and socialization. Some wants to take back control, others think it's better to let it crumble, and just walk away. But remember that at the slightest hickup of repressive instances of society...",
                                          "timestamp": "2021-11-18 12:46:11",
                                          "score": 1,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "hl8hqrr",
                                              "text": "The wall of text is demonstrated to address each one of your hateful vitriols you disseminate openly throughout this thread and many other communities. Your unfounded claims have been elucidated as nothing more than pseudo-intellectual rhetoric, and the absence of your ability to provide a counterargument corroborates this. \n\nThe MGTOW community lays down a set of principles that are undoubted by their participants. That is the textbook definition of dogmatism. Perpetuating negative stigmatisations against half of the human population based on your unfortunate experiences and asserting that they are true despite being derived from anecdotal experiences that support a selective agenda is scientifically disingenuous. \n\nBut of course, instead of seeking to fix their unhealed wounds, let’s encourage these men to seep in their bitterness and encourage the cultivation of their harmful victim complexes and inimical views towards women. You seem to have fallen victim to that.",
                                              "timestamp": "2021-11-19 09:22:27",
                                              "score": 1,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "hl8nhll",
                                                  "text": "On the contrary mgtow leave you free do do as you please. Monk mode or still dating, your call. Just be aware of what the red pill shows. Keep talking, npc, we know and we won't fall prey no more.",
                                                  "timestamp": "2021-11-19 10:42:18",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hg1chon",
              "text": "I'm sorry, but do we know us? \n\nwhat do you mean with  \"your hypergamy and inability to reason without feelings\"?\n\nYou must have experienced some messed up people  to think that all people from one gender are the same.\n\nas far as I can read from your posts, you seem to be the one lead by feelings of superiority over the female gender.\n\nWhich I think is rather sad.",
              "timestamp": "2021-10-09 22:56:10",
              "score": 2,
              "num_children": 1,
              "author": 352305,
              "replies": [
                {
                  "id": "hg1e91h",
                  "text": "Oh, no, purely logical. Backed by every great thinker from plato to machiavel, schaupenhauer or brizendine. I make generalities of a defined population. You cannot understand because you can only reason in terms of individuals. \n\nFemale cannot reason rationaly, Hence, create narcicistic and failed societies.\n\nTo avoid that, and for a better society for all, they must be kept on a tight leash and not given ANY leeway. No property outside of their paren'ts/husband's and NEVER a position of political or economical power. Radical Islam is right about women as were the ancient romans, greeks, Germans and celts.\n\nExamples for free if you peek outside, everyday, at everytime, on every news Channel or social media",
                  "timestamp": "2021-10-09 23:10:29",
                  "score": 4,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hg1kuqq",
                      "text": "hmmm I see, you know what..\n\nI actually spend some time to check your profile and the posts you made in the past, to understand you.\n\nYou've been through alot..\n\nWhen The One Woman who should protect and love you unconditionally fails you so many times, without seeing her own fault... that must leave a burning imprint in  the mind. Your hatred towards women is even comprehensible...\nLife was not fair to you, not at all. Wanting the feeling of control back, the control over things and a gender that hurt you so much.. still.. it's comprehensible..\n\nIt seems you like to quote the great thinkers of the past... like Plato..\n\nPlato was open to the potential equality of men and women. He believed in metempsychiosis (similar to reincarnation), that the human soul was sexless and could change gender from life to life. It was only logical that, since souls don't change, they bring the same abilities with them from body to body. Accordingly, he said, women should have equal access to education and politics.\n\nIf you have an opinion, you'll always something /someone that is supporting your opinion, no matter if it's facts or not.\n\nI rather build my opinions through scientific, proveable facts. \n\nanyway, where ever you go in your life, I wish you just the best. From human to human.\n\nI'm out.",
                      "timestamp": "2021-10-10 00:04:17",
                      "score": 2,
                      "num_children": 1,
                      "author": 352305,
                      "replies": [
                        {
                          "id": "hg1nrcu",
                          "text": "\"Your hatred towards women is even comprehensible\" \n\nI've ceased to hate the women when i understood their inner workings. I'm just disgusted when i see such bestial instincts unchecked and glorified by the females.\n\nI'm just saddened because the current system gives in too much to their natural tendencies of predation without male strenght to keep it under control and i see no future from where it can not end in disaster. \n\n(Civil War, genocide, etc.... because nefarious people use their stupidity and fuel female hate towards the males of their ethnic group to better dissolve and control their society)\n\nMany men now visceraly hate women for what they've put them through and i agree their hate is justified for hardships, humiliations and pains and the denial of their right to self respect and humanity. Reckoning is coming, and it's going to be bloody. Women destroy the mind, we prefer to kill the body. We're just wired that way. \n\nYeah i have a horrible upbringing but even lonely as i am i won't take it out on others to feel better, if you have read (and thanks, for once somebody with a brain and a heart at the right place) what i've written, it stops with me.\n\nI stand by my words. My proposed solution to deny females the right of property solves hypergamy in a humane way and helps her back in her natural and essentiel roles. As a great man said, the woman is our most precious ally and faithful companion in the fight to avoid the death of our people, but outside of her role, she's just a lesser man.",
                          "timestamp": "2021-10-10 00:28:46",
                          "score": 5,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hg06rh3",
              "text": "The same way we deal with our horniness. They don't.",
              "timestamp": "2021-10-09 17:43:58",
              "score": -6,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hg38xxv",
          "text": "Yeah, but it happens all the time. Especially if they show some of them crocodile tears. Maybe , I should start doing that also? I didn't finish my work on time? Crocodile tears, I'm too late with academic deadlines? Crocodile tears? Ooh, wait, What? It hasn't the same effect for men. If I started doing that I would be laughed at.",
          "timestamp": "2021-10-10 10:44:28",
          "score": 1,
          "num_children": 0,
          "author": 96545,
          "replies": []
        }
      ]
    },
    {
      "id": "hfzlksj",
      "text": "Feminist propaganda media",
      "timestamp": "2021-10-09 15:05:36",
      "score": 41,
      "num_children": 0,
      "author": 215939,
      "replies": []
    },
    {
      "id": "hfzlnz8",
      "text": "Why tf do people jump straight to mental illness in these situations? Why can’t they just accept the fact that people like her deserve to rot in prison?",
      "timestamp": "2021-10-09 15:06:17",
      "score": 120,
      "num_children": 6,
      "replies": [
        {
          "id": "hfzrkfi",
          "text": "That would require agency and accountability. You won't find much of either over in those parts, cowboy.",
          "timestamp": "2021-10-09 15:51:55",
          "score": 61,
          "num_children": 0,
          "author": 389946,
          "replies": []
        },
        {
          "id": "hfzupvg",
          "text": "> Why tf do people jump straight to mental illness in these situations? \n\nAnd by that mindset, why aren't men given the same leeway? comes to mind a man that had brain damage in a fire situation , and one of the paramedic responders was attending the man unconcious at the time, the man pushed his hand up due to brain damage and she filed sexual harassment because he touched her boob. There was video evidence and the man completely in Narnia and pushed up withoput knowing what he was doing, but no patriarchy rape was more important and the boobie was important. The man got charged with rape despite being unconscious.",
          "timestamp": "2021-10-09 16:15:39",
          "score": 38,
          "num_children": 3,
          "replies": [
            {
              "id": "hg1420i",
              "text": "[deleted]",
              "timestamp": "2021-10-09 21:49:33",
              "score": 19,
              "num_children": 1,
              "replies": [
                {
                  "id": "hg1nscw",
                  "text": "> The man had a seizure ffs, \n\ntyvm this is exactly the case  https://www.nbcnewyork.com/news/local/crime-and-courts/man-accused-of-sexually-assaulting-emt-was-suffering-seizure-bronx-da-drops-charges/2865648/",
                  "timestamp": "2021-10-10 00:28:59",
                  "score": 7,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "hg1ahf9",
              "text": "10-15 years back a man walked out of the shower naked, like people do in their own home. A woman saw him through his window, inside his house. Like, she was straight up a Peeping Tom. She called the cops. Ole boy got hit with indecent exposure and was put on the sex offenders list because his bitch neighbor was peeping on him",
              "timestamp": "2021-10-09 22:40:06",
              "score": 14,
              "num_children": 1,
              "replies": [
                {
                  "id": "hg38n9r",
                  "text": "Wtf? She needed to be put on th fucking list. I would have appealed",
                  "timestamp": "2021-10-10 10:40:23",
                  "score": 3,
                  "num_children": 0,
                  "author": 96545,
                  "replies": []
                }
              ]
            },
            {
              "id": "hg0e43d",
              "text": "Holy shit, I need to read the story, did he get convicted??",
              "timestamp": "2021-10-09 18:38:06",
              "score": 6,
              "num_children": 2,
              "author": 31701,
              "replies": [
                {
                  "id": "hg0ocn4",
                  "text": "been trying to find it, it disappeared off the face of google. If someone recognizes the story please post here.",
                  "timestamp": "2021-10-09 19:54:19",
                  "score": 4,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hg1nxn1",
                  "text": "https://www.nbcnewyork.com/news/local/crime-and-courts/man-accused-of-sexually-assaulting-emt-was-suffering-seizure-bronx-da-drops-charges/2865648/",
                  "timestamp": "2021-10-10 00:30:11",
                  "score": 3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hg3v2b9",
                      "text": "Ah, they dropped it. But it should never have appeared in court, what the hell.",
                      "timestamp": "2021-10-10 14:30:22",
                      "score": 1,
                      "num_children": 0,
                      "author": 31701,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hfzp5x0",
          "text": "Electric chair.",
          "timestamp": "2021-10-09 15:33:29",
          "score": 17,
          "num_children": 1,
          "author": 380134,
          "replies": [
            {
              "id": "hfzsqmm",
              "text": "\"Ride the lightning\"",
              "timestamp": "2021-10-09 16:00:55",
              "score": 13,
              "num_children": 0,
              "author": 57743,
              "replies": []
            }
          ]
        },
        {
          "id": "hg2b3no",
          "text": "The worst of this is technically men are more exposed to having a really bad mental health almost always but, well...\n\n_gynocentrism._",
          "timestamp": "2021-10-10 03:46:20",
          "score": 4,
          "num_children": 0,
          "author": 15929,
          "replies": []
        },
        {
          "id": "hfzs1y0",
          "text": "[deleted]",
          "timestamp": "2021-10-09 15:55:39",
          "score": 10,
          "num_children": 2,
          "replies": [
            {
              "id": "hg1in18",
              "text": "The thing is though, that it doesn't matter in the slightest.\n\nThis insane trend, of seeing mental health-issues as some sort of magic hand that controls a person from above, is frankly just disgusting...\n\nI agree that they should get equal treatment... as in, they should be equally treated like the scum they are. (obviously only talking about the dangerous ones here)\n\nMental illnesses is not some spell you put on someone. It IS that person. Their brain is malfunctioning, and while it isn't fair they should NOT get special privileges for it.\n\nThe fact that we're putting more effort in REFORMING EVIL than making sure good succeeds is... well it's disgusting... truly, honestly, absolutely filthy...\n\nIf some one goes too far, they have gone too far... No amount of mental health issues will change that.\n\nIn fact, despite what lies people tell themselves it's actually just all the more reason to get rid of them.",
              "timestamp": "2021-10-09 23:45:58",
              "score": 5,
              "num_children": 0,
              "author": 234812,
              "replies": []
            },
            {
              "id": "hg0g63s",
              "text": "Vindictiveness and revenge are not mental illness. And sometimes they are motivated by great injustice done to them by a corrupt system. Either way, two wrongs do not make a right.\n\n&#x200B;\n\nShe was losing the kids and that's what motivated her. Anything else is an excuse.",
              "timestamp": "2021-10-09 18:53:36",
              "score": 2,
              "num_children": 0,
              "author": 206796,
              "replies": []
            }
          ]
        },
        {
          "id": "hg1k1ay",
          "text": "I don’t mind starting with the illness presumption, as long as it’s equally applied. I also think the victims need to be made whole, equal application again, regardless of illness or not.",
          "timestamp": "2021-10-09 23:57:24",
          "score": 2,
          "num_children": 0,
          "author": 91992,
          "replies": []
        }
      ]
    },
    {
      "id": "hfzth5b",
      "text": "This women should get compassion from the courts.\n\nAnd I mean the exact amount of compassion she showed her child . . .",
      "timestamp": "2021-10-09 16:06:21",
      "score": 33,
      "num_children": 0,
      "author": 138651,
      "replies": []
    },
    {
      "id": "hfzvbrf",
      "text": "Just like the pigs in animal farm, some deserve more equal treatment than others",
      "timestamp": "2021-10-09 16:20:09",
      "score": 14,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hg03q2u",
      "text": "I'm all for rehabilitation, but stabbing a child nine times is abominable, she should definitely go to jail.",
      "timestamp": "2021-10-09 17:21:58",
      "score": 11,
      "num_children": 1,
      "author": 223562,
      "replies": [
        {
          "id": "hg03r8e",
          "text": "[deleted]",
          "timestamp": "2021-10-09 17:22:12",
          "score": -6,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hfzy1w1",
      "text": "Muh “postpartum depression”. If you’re a woman and you murder your child or children, just blame it on postpartum depression and you’ll get a slap on the wrist. \n\nOr if you murder your husband just blame it on “battered woman syndrome” and you’ll get a slap on the wrist.\n\nIt must be so hard to be a woman who’s not held accountable for her own actions.",
      "timestamp": "2021-10-09 16:40:17",
      "score": 31,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hg07ex6",
      "text": "After reading this, I decided that I’m moving into a cave to be away from everyone",
      "timestamp": "2021-10-09 17:48:40",
      "score": 9,
      "num_children": 2,
      "replies": [
        {
          "id": "hg0bosg",
          "text": "Count me in bro",
          "timestamp": "2021-10-09 18:20:06",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hg21lt3",
          "text": "My cave is big and goes down over 1000 feat and has crystals and shit\n\nRent is a cavewood sapling and 100 glowberry seeds quarterly",
          "timestamp": "2021-10-10 02:24:10",
          "score": 4,
          "num_children": 0,
          "author": 361344,
          "replies": []
        }
      ]
    },
    {
      "id": "hfzolwg",
      "text": "“Lets show compassion”\n\nHow about no you fucking idiot",
      "timestamp": "2021-10-09 15:29:17",
      "score": 22,
      "num_children": 0,
      "author": 252622,
      "replies": []
    },
    {
      "id": "hg0d43x",
      "text": "Dr my arse!!! Lock her up and throw away the key. She brutally murdered a helpless little boy that no doubt loved his mother more than anything. Reading this has made my enraged, I want her to suffer and forever know nothing but pain and anguish. Disgusting excuse for a human being.",
      "timestamp": "2021-10-09 18:30:42",
      "score": 7,
      "num_children": 1,
      "replies": [
        {
          "id": "hg1jeuc",
          "text": "But heeey, don't you know you should show love and care for the mentally ill??? She probably just, like, had a bad day or something and is totally not at fault for her own actions... **/S**",
          "timestamp": "2021-10-09 23:52:15",
          "score": 2,
          "num_children": 1,
          "author": 234812,
          "replies": [
            {
              "id": "hg5i705",
              "text": "Makes me want to puke it really does.",
              "timestamp": "2021-10-10 21:27:29",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hfznfcs",
      "text": "This guy is a professor and a renowned expert in punishment.  Yet he thinks this stance will fly with the greater public.  How foolish",
      "timestamp": "2021-10-09 15:20:07",
      "score": 21,
      "num_children": 0,
      "author": 82000,
      "replies": []
    },
    {
      "id": "hfzrnv2",
      "text": "Close women's prisons? We should fill 'em up with feminists.",
      "timestamp": "2021-10-09 15:52:39",
      "score": 25,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hg0fmo4",
      "text": "Feminists: We want more fair sentences.\n\nNormal people: Ok, you do the crime you do the time.\n\nFeminists: NOOOOOO THAT’S NOT FAIR!",
      "timestamp": "2021-10-09 18:49:35",
      "score": 5,
      "num_children": 0,
      "author": 298425,
      "replies": []
    },
    {
      "id": "hg0ti1y",
      "text": "Compassion? More like \"rest in everything but peace once justice reaches her\"",
      "timestamp": "2021-10-09 20:32:16",
      "score": 4,
      "num_children": 0,
      "author": 4762,
      "replies": []
    },
    {
      "id": "hfznl4g",
      "text": "She should spend the rest of her life in jail, unless she was genuinely psychotic in which she should be placed in a secure hospital facility.  I would have the same opinion if a psychotic man harmed someone in this manner.  \n\nNot to mention how horrible this is for a 2 year old boy to die this way, but I feel really terrible for the people out shopping that day and the people working in the supermarket.  No doubt they have some trauma from it.\n\nI think people forget that men have all the same trauma and feel all the same emotions as women but for some reason women are met with far more sympathy when they do terrible things.",
      "timestamp": "2021-10-09 15:21:21",
      "score": 14,
      "num_children": 1,
      "author": 293222,
      "replies": [
        {
          "id": "hfzxuif",
          "text": "Placed in a secure hospital facility until rendered fit to stand trial. You don’t get off for being crazy.",
          "timestamp": "2021-10-09 16:38:45",
          "score": 4,
          "num_children": 2,
          "author": 353438,
          "replies": [
            {
              "id": "hg0f3wm",
              "text": "Yeah. Here where I live claiming crazy it not a good idea because you just go into a mental institute instead, and that will take LONGER than prison. You also have less freedoms there. You're locked up supervised in a room, have to listen to shrinks all the time, can't get out, etc... As opposed to be locked up, mostly unsupervised at least (you have at least some privacy in prison when you are good to your supervisors, etc), being able to work for money, have a social life, not being literally handled like a dum dum brain, etc.\n\nClaiming insane really isn't a get out of jail free card, it just means you need more supervision.",
              "timestamp": "2021-10-09 18:45:40",
              "score": 3,
              "num_children": 2,
              "author": 31701,
              "replies": [
                {
                  "id": "hg14myz",
                  "text": "I think the preferred nomenclature is “donkey brain”.",
                  "timestamp": "2021-10-09 21:54:00",
                  "score": 2,
                  "num_children": 0,
                  "author": 353438,
                  "replies": []
                },
                {
                  "id": "hg1j2pg",
                  "text": "Sounds like you live in a pretty decent place.\n\nI just wish we had learned to simply get rid of scum like this already... If you go too far you go too far... Don't bother trying to fix them, like holy hell just don't... They don't deserve it.",
                  "timestamp": "2021-10-09 23:49:28",
                  "score": 2,
                  "num_children": 0,
                  "author": 234812,
                  "replies": []
                }
              ]
            },
            {
              "id": "hg1uer9",
              "text": "You can technically be sent to a mental facility directly after the crime if you are very obviously psychotic.",
              "timestamp": "2021-10-10 01:23:50",
              "score": 1,
              "num_children": 0,
              "author": 293222,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hg0139s",
      "text": "Always excuses, never accountability.",
      "timestamp": "2021-10-09 17:02:39",
      "score": 3,
      "num_children": 0,
      "author": 193287,
      "replies": []
    },
    {
      "id": "hg02a75",
      "text": "That woman should rot in prison",
      "timestamp": "2021-10-09 17:11:22",
      "score": 3,
      "num_children": 0,
      "author": 175339,
      "replies": []
    },
    {
      "id": "hg0ip05",
      "text": "How could anyone harm their own child?! Just reading about what she did made me ill. This evil piece of trash deserves the death penalty.",
      "timestamp": "2021-10-09 19:12:26",
      "score": 3,
      "num_children": 0,
      "author": 393348,
      "replies": []
    },
    {
      "id": "hfzwnhd",
      "text": "She should be murderer like a bitch on the sidewalk",
      "timestamp": "2021-10-09 16:29:56",
      "score": 4,
      "num_children": 0,
      "author": 213253,
      "replies": []
    },
    {
      "id": "hfzykxy",
      "text": "I actually agree, the prison system should be reformed it has serious issues\n\nThis women needs therapy\n\nBut for fuck sake everyone should still be capable of going to jail for there crimes and this women is still a piece of shit either way, send her to fuckibg azkaban for god sake",
      "timestamp": "2021-10-09 16:44:12",
      "score": 2,
      "num_children": 0,
      "author": 281101,
      "replies": []
    },
    {
      "id": "hfzzb7z",
      "text": "Subheading: Women most affected",
      "timestamp": "2021-10-09 16:49:29",
      "score": 2,
      "num_children": 0,
      "author": 19936,
      "replies": []
    },
    {
      "id": "hg03v81",
      "text": "Yes the women who murder her child does need therapy. Women are getting treated fairly for thier crimes, by going to prison.",
      "timestamp": "2021-10-09 17:22:59",
      "score": 2,
      "num_children": 0,
      "author": 305452,
      "replies": []
    },
    {
      "id": "hg11222",
      "text": "Wait... If they do that then I will start MTF so that I can go on a crime spree and never be arrested (after winning tons of gold medals at the female Olympics)",
      "timestamp": "2021-10-09 21:26:59",
      "score": 2,
      "num_children": 0,
      "author": 81705,
      "replies": []
    },
    {
      "id": "hg187dy",
      "text": "~~nervous~~ psychotic breakdown",
      "timestamp": "2021-10-09 22:22:00",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hg1bb9o",
      "text": "It use to be I had hope in thinking “I’ll just move to another country where people are normal…” but this shit mentality is spreading faster than covid",
      "timestamp": "2021-10-09 22:46:38",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hg21cmx",
      "text": "Posted this to r/feminism",
      "timestamp": "2021-10-10 02:22:03",
      "score": 2,
      "num_children": 0,
      "author": 163522,
      "replies": []
    },
    {
      "id": "hg01rjy",
      "text": "That w0man needs a noose.",
      "timestamp": "2021-10-09 17:07:37",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hfzny7n",
      "text": "Torture is the answer",
      "timestamp": "2021-10-09 15:24:13",
      "score": 4,
      "num_children": 2,
      "replies": [
        {
          "id": "hfzrqs7",
          "text": "That's what feminists say about men.",
          "timestamp": "2021-10-09 15:53:16",
          "score": 5,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hg0781n",
          "text": "Fuck torture.",
          "timestamp": "2021-10-09 17:47:17",
          "score": -2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hfzv0u0",
      "text": "Equality was flushed down the room",
      "timestamp": "2021-10-09 16:17:53",
      "score": 2,
      "num_children": 0,
      "author": 85238,
      "replies": []
    },
    {
      "id": "hfzvd73",
      "text": "That's a troll trying to stir the masses .",
      "timestamp": "2021-10-09 16:20:26",
      "score": 1,
      "num_children": 0,
      "author": 91706,
      "replies": []
    },
    {
      "id": "hg10loy",
      "text": "Equality and women simply don't go together. They don't understand it and don't want it and their thirsty followers will forget about any principle whatever as long as they get a moment's attention.",
      "timestamp": "2021-10-09 21:23:31",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hg14oha",
      "text": "oh please this woman should be burned at the stake",
      "timestamp": "2021-10-09 21:54:19",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hg15ts3",
      "text": "What this bitch needs is a death sentence!",
      "timestamp": "2021-10-09 22:03:03",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hg00a6j",
      "text": "This was likely a sarcastic remark.",
      "timestamp": "2021-10-09 16:56:45",
      "score": 1,
      "num_children": 0,
      "author": 149635,
      "replies": []
    },
    {
      "id": "hg01ztu",
      "text": "This is unbelievable, yes something is terribly wrong with her but she still deserves 20 years",
      "timestamp": "2021-10-09 17:09:15",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "hg0z3mh",
          "text": "More like an electric chair",
          "timestamp": "2021-10-09 21:12:36",
          "score": 5,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hg0uj3v",
      "text": "Meanwhile, everyone still doesn’t talk about Chris Benoit’s mental health after years of continuous brain trauma, they treat him like a monster. \n\nShe shouldn’t go to jail, she should be put on death row and executed.",
      "timestamp": "2021-10-09 20:39:39",
      "score": 1,
      "num_children": 0,
      "author": 153056,
      "replies": []
    },
    {
      "id": "hg111n3",
      "text": "Just goes to show that if there are guys who should suffer the punishment of sterilization for their heinous acts, then so too should women who commit these atrocities.",
      "timestamp": "2021-10-09 21:26:54",
      "score": 1,
      "num_children": 0,
      "author": 401007,
      "replies": []
    },
    {
      "id": "hg1bt8x",
      "text": "Brought to you by the same movement that gave us \"boys will be ~~boys~~ held accountable for their actions.\"",
      "timestamp": "2021-10-09 22:50:40",
      "score": 1,
      "num_children": 0,
      "author": 337482,
      "replies": []
    },
    {
      "id": "hg1ldpj",
      "text": "\"Ex-Porn actress\"\n\nAn example that a promiscuous lifestyle isn't good for you physically & mentally. Still a crime, send her behind bars... Or death.",
      "timestamp": "2021-10-10 00:08:44",
      "score": 1,
      "num_children": 0,
      "author": 84822,
      "replies": []
    },
    {
      "id": "hg1p2mh",
      "text": "Yet if a man dumped his two year old child on a checkout after stabbing the child, life in prison would be the minimum sentence. People need to accept that whether someone is mentally ill or not, anyone who commits a crime like this needs to rot in prison.",
      "timestamp": "2021-10-10 00:39:36",
      "score": 1,
      "num_children": 0,
      "author": 128224,
      "replies": []
    },
    {
      "id": "hg21b5i",
      "text": "I bet she would have a different tone if it wasn't a boy but a girl that got slaughtered by his mother.",
      "timestamp": "2021-10-10 02:21:41",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hg2ge2j",
      "text": "Maybe she was sleepwalking?",
      "timestamp": "2021-10-10 04:35:02",
      "score": 1,
      "num_children": 0,
      "author": 371275,
      "replies": []
    },
    {
      "id": "hg2k9v6",
      "text": "If we shut down women's prisons then every criminal would identify as a women for as long as they required help and counseling",
      "timestamp": "2021-10-10 05:16:49",
      "score": 1,
      "num_children": 0,
      "author": 316486,
      "replies": []
    },
    {
      "id": "hg2q6qw",
      "text": "Ah! Rights not Responsibilities or accountability.",
      "timestamp": "2021-10-10 06:29:34",
      "score": 1,
      "num_children": 0,
      "author": 33695,
      "replies": []
    },
    {
      "id": "hg2qolp",
      "text": "when women kill it goes against their superior nurturing nature so they should be viewed as ill not willful-sarcasm",
      "timestamp": "2021-10-10 06:36:01",
      "score": 1,
      "num_children": 0,
      "author": 9762,
      "replies": []
    },
    {
      "id": "hg2ubo5",
      "text": "The mere nerve of the individuals and platforms to actually publish these despicable views testifies to the truth of what social psychologists call the \"[women-are-wonderful effect](https://en.m.wikipedia.org/wiki/Women-are-wonderful_effect),\" which itself evidently disproves the antiquated, scientifically baseless \"patriarchy\" theory.",
      "timestamp": "2021-10-10 07:23:52",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hg3k8n2",
      "text": "It's actually usually how feminists think we should treat all criminals. It's only misandrists who think only females deserve that treatment.",
      "timestamp": "2021-10-10 12:57:30",
      "score": 1,
      "num_children": 0,
      "author": 260210,
      "replies": []
    },
    {
      "id": "hg3swuj",
      "text": "The comment about her having another kid is just too crazy to be real.",
      "timestamp": "2021-10-10 14:13:18",
      "score": 1,
      "num_children": 0,
      "author": 317142,
      "replies": []
    },
    {
      "id": "hg3t6en",
      "text": "jesus christ this is horrifying",
      "timestamp": "2021-10-10 14:15:28",
      "score": 1,
      "num_children": 0,
      "author": 260289,
      "replies": []
    },
    {
      "id": "hg75a7x",
      "text": "EqUaLiTy",
      "timestamp": "2021-10-11 05:48:48",
      "score": 1,
      "num_children": 0,
      "author": 309376,
      "replies": []
    },
    {
      "id": "hg0nyfl",
      "text": "In my opinion, everyone should be treated like that",
      "timestamp": "2021-10-09 19:51:19",
      "score": -2,
      "num_children": 0,
      "author": 87988,
      "replies": []
    },
    {
      "id": "hg2f1di",
      "text": "Women were supposed to be of nurturing caring and gentle nature that’s why they are the one who give birth and not throw the crying baby out of the window out of anger and frustration. I guess that’s not the case anymore. I wonder what has changed.",
      "timestamp": "2021-10-10 04:21:34",
      "score": 0,
      "num_children": 0,
      "author": 82354,
      "replies": []
    }
  ]
}