{
  "id": "q5txzv",
  "text": "Patience, Grasshopper...\n",
  "timestamp": "2021-10-11 11:37:05",
  "score": 4312,
  "subreddit": "t5_3fdcn",
  "num_children": 24,
  "replies": [
    {
      "id": "hg7u7fe",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2021-10-11 11:37:06",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "hg80zwy",
      "text": "Because the antivax scum get gullible people to parrot their idiotic crap while they themselves get the vaccine. Do you honestly think all the fuckers at Fox News aren't vaccinated. The inbred orange fat fuck is also vaccinated.",
      "timestamp": "2021-10-11 12:48:58",
      "score": 128,
      "num_children": 4,
      "author": 328010,
      "replies": [
        {
          "id": "hga3u0x",
          "text": "Fox News parent company literally has worldwide vaccine mandate in order to work at the office again, also you've had to get your temperature checked and you could only enter with a mask on. This is the best part, they're literally killing their own audience.\n\nHypocrisy at News Corp was and still is a thing. They often film a segment and then laugh about it being so bad yet people will believe it.\n\nMy favourite analogy was that one when Hasan Minhaj told that Fox says bad things against immigrants yet he sees them every day in queue for halal chicken. Take this and extend it to everything they do. They'll scream about the vaccines, but this is just a cover to keep people preoccupied and feeling like they fight some kind of war. This is how right brainwashes people. They tell them that someone wants to take away something from you, even if this wasn't yours to begin with or isn't true at all. Some will die, sure, but they have a captive audience that now believes it's just that everybody else lies and they're the intelligent ones that oppose something evil. In reality, there's no evil.\n\nI mean, look at this. https://theconversation.com/five-things-to-know-about-the-antichrist-148172",
          "timestamp": "2021-10-11 21:59:52",
          "score": 19,
          "num_children": 1,
          "author": 188884,
          "replies": [
            {
              "id": "hgbq5cs",
              "text": "\"He dies in the end\" lol",
              "timestamp": "2021-10-12 06:19:20",
              "score": 1,
              "num_children": 0,
              "author": 49026,
              "replies": []
            }
          ]
        },
        {
          "id": "hg93bjo",
          "text": "And said orange fat fuck admitted it during a rally…and got booed for it. Still boggles my mind.",
          "timestamp": "2021-10-11 17:33:22",
          "score": 5,
          "num_children": 0,
          "author": 264547,
          "replies": []
        },
        {
          "id": "hg9lypu",
          "text": "Yes. Calling out anti-vaxers is to limit the spread of their narcissism &/or mental illness.",
          "timestamp": "2021-10-11 19:44:36",
          "score": 16,
          "num_children": 0,
          "author": 235749,
          "replies": []
        },
        {
          "id": "hgad8zc",
          "text": "Mine is more the fact that they are taking up space in a hospital who’s resources could be better used by people who’s conditions aren’t self inflicted combined with the fact their selfishness affects people who *can’t* get vaccinated for legitimate reasons.",
          "timestamp": "2021-10-11 23:16:15",
          "score": 1,
          "num_children": 0,
          "author": 105256,
          "replies": []
        }
      ]
    },
    {
      "id": "hg84hqo",
      "text": "Because some of us are immunocompromised and can't wait?\n\nEdit: I can't type apparently",
      "timestamp": "2021-10-11 13:20:43",
      "score": 140,
      "num_children": 3,
      "author": 71723,
      "replies": [
        {
          "id": "hg8nthn",
          "text": "And this why I still wear a mask, even if I don’t have to. Well, that, and some people do actually have kids.\n\nThis “you’re just wearing a muzzle, your rights are being suppressed” shit is not true at all. I can be as loud as I fucking want.",
          "timestamp": "2021-10-11 15:46:54",
          "score": 48,
          "num_children": 2,
          "author": 61601,
          "replies": [
            {
              "id": "hg8qnd0",
              "text": "I still wear a mask because I don’t want anyone mistaking me for a conservative.",
              "timestamp": "2021-10-11 16:06:40",
              "score": 47,
              "num_children": 3,
              "author": 275238,
              "replies": [
                {
                  "id": "hg8s5ph",
                  "text": "Ugh. This too. Still get mistaken for a paranoid weirdo though.\n\nEdit: God dammit. Yeah, my last HIV test was negative btw.",
                  "timestamp": "2021-10-11 16:17:18",
                  "score": 8,
                  "num_children": 0,
                  "author": 61601,
                  "replies": []
                },
                {
                  "id": "hg8vgnt",
                  "text": "Except remember when they started wearing masks to protect themselves from \"vaccine shedding\"?",
                  "timestamp": "2021-10-11 16:39:53",
                  "score": 3,
                  "num_children": 0,
                  "author": 215411,
                  "replies": []
                },
                {
                  "id": "hgfkh6v",
                  "text": "Lol that’s hilarious. Politicians aren’t your friends, you’re simply pawns for them.",
                  "timestamp": "2021-10-13 01:53:08",
                  "score": 0,
                  "num_children": 0,
                  "author": 44335,
                  "replies": []
                }
              ]
            },
            {
              "id": "hgb5xym",
              "text": ">This “you’re just wearing a muzzle, your rights are being suppressed” shit is not true at all. I can be as loud as I fucking want.\n\nYeah, I never got the \"muzzle\" bit.  Yes, I can't bite you while I'm wearing a mask, but what the fuck goes on in your mental world that you expect to need to be able to bite people on a moment's notice?  I've never had a problem being loud while wearing a mask.",
              "timestamp": "2021-10-12 03:00:20",
              "score": 2,
              "num_children": 0,
              "author": 73519,
              "replies": []
            }
          ]
        },
        {
          "id": "hgai82f",
          "text": "And, all life is precious. If i can convince someone to save their own life and help save the lives of others, i will.",
          "timestamp": "2021-10-11 23:57:20",
          "score": 2,
          "num_children": 0,
          "author": 195948,
          "replies": []
        },
        {
          "id": "hgbfvjv",
          "text": "There's a difference between can't vax and won't vax though.",
          "timestamp": "2021-10-12 04:22:57",
          "score": 1,
          "num_children": 0,
          "author": 391764,
          "replies": []
        }
      ]
    },
    {
      "id": "hg8hykx",
      "text": "Because she’s my mother and my sister",
      "timestamp": "2021-10-11 15:05:22",
      "score": 17,
      "num_children": 2,
      "author": 206534,
      "replies": [
        {
          "id": "hg8ibb9",
          "text": "How can she be both? Oh, wait.... awkward.",
          "timestamp": "2021-10-11 15:07:54",
          "score": 5,
          "num_children": 1,
          "author": 54810,
          "replies": [
            {
              "id": "hg8idq5",
              "text": "Well one scared the other",
              "timestamp": "2021-10-11 15:08:23",
              "score": 3,
              "num_children": 0,
              "author": 206534,
              "replies": []
            }
          ]
        },
        {
          "id": "hg8id48",
          "text": "[deleted]",
          "timestamp": "2021-10-11 15:08:15",
          "score": 0,
          "num_children": 1,
          "replies": [
            {
              "id": "hg8iln3",
              "text": "Hahahaha no, that’d just be me good sir",
              "timestamp": "2021-10-11 15:09:59",
              "score": 2,
              "num_children": 0,
              "author": 206534,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hg80w72",
      "text": "The thing is, vaccination is not (never has been, never will be) matter of individual choice of weighing whatever odds you believe there will be problems with a vaccine against whatever odds you believe there will be problems with catching the disease, using whatever fucked up sources.\n\nI don't care if anti-vaxxers kick the bucket. The more, the better; the sooner, the better; if you ask me. But the thing is, before kicking the bucket, they'll spread shit. They'll spread polio, they'll spread the rona, they'll spread chicken pox, measles, mumps, rubella and whatnot.\n\nI worry about who they're going to take to the grave with them. The weak, the weary, the immunocompromised. That's why I argue with them.",
      "timestamp": "2021-10-11 12:48:01",
      "score": 81,
      "num_children": 2,
      "author": 65480,
      "replies": [
        {
          "id": "hg84rou",
          "text": "You're absolutely not wrong but the \"weighing individual odds\" between risks inherent in catching it vs risks of getting the vaccine is a litmus test for whether the person(s) involved are even capable of critical thinking.  You have to do some physics-defying mental gymnastics to find \"sources\" that come anywhere near upending the math on that.",
          "timestamp": "2021-10-11 13:23:09",
          "score": 18,
          "num_children": 1,
          "author": 91720,
          "replies": [
            {
              "id": "hg8b45k",
              "text": "I agree, on that, the mental gymnastics is strong with anti vaxxer.\n\nI'll keep trying.\n\nRecently I had someone talked to me at a family gathering about the link  between vaccines and autism, and I managed to debunk every single argument they made. Reminded them that there is exactly ONE study that found a link between the too. That this study is not only fraudulent, it is also unethical. That the study was retracted. And its author lost his license to practice medicine.\n\nIn the end, I didn't convince the person in question. But I did convince the couple who was listening to his bullshit in the first place.\n\nYou won't convince anti-vaxxers. You keep arguing for the sake of bystanders who might stumble upon the argument by chance.",
              "timestamp": "2021-10-11 14:14:47",
              "score": 22,
              "num_children": 1,
              "author": 65480,
              "replies": [
                {
                  "id": "hg8unug",
                  "text": "Is that the one by Wakefield?",
                  "timestamp": "2021-10-11 16:34:23",
                  "score": 3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hg8wj9a",
                      "text": "The very same",
                      "timestamp": "2021-10-11 16:47:11",
                      "score": 3,
                      "num_children": 1,
                      "author": 65480,
                      "replies": [
                        {
                          "id": "hg9vmxn",
                          "text": "Try some of the points from [this](https://www.youtube.com/watch?v=8BIcAZxFfrc) if you want more anti-vax stuff.\n\nBut well done for convincing the folks.",
                          "timestamp": "2021-10-11 20:56:02",
                          "score": 4,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hga03e8",
                              "text": "If you tried posting a link, I think it'missing",
                              "timestamp": "2021-10-11 21:30:33",
                              "score": 2,
                              "num_children": 1,
                              "author": 65480,
                              "replies": [
                                {
                                  "id": "hga90o1",
                                  "text": "Yup, link was missing.  It's there now ;)",
                                  "timestamp": "2021-10-11 22:41:41",
                                  "score": 2,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hg8xbqw",
          "text": "[removed]",
          "timestamp": "2021-10-11 16:52:34",
          "score": -12,
          "num_children": 2,
          "replies": [
            {
              "id": "hg96o56",
              "text": "\n>people don't (want to) use their brains to think and aren't willing to accept that their worldview is possibly wrong.\n\n“If you run into an asshole in the morning, you ran into an asshole. If you run into assholes all day, you're the asshole.” ― Raylan Givens",
              "timestamp": "2021-10-11 17:55:48",
              "score": 6,
              "num_children": 0,
              "author": 275478,
              "replies": []
            },
            {
              "id": "hg95crj",
              "text": "I see several flaws in the first article you posted.\n\nThe 60% vaccination rate quoted for Israel is far below the threshold usually admitted for herd immunity. It is estimated at 70% for the US which is one order of magnitude less densely populated than Israel (36 h/km² versus 400 h/km² respectively).\n\nIt does not explain how it controls for the ethnic differences in vaccination policies (arab israeli and palestinian have been excluded from the vaccination effort). Considering the living condition (especially access to healthcare) in the Gaza strip and the West Bank, this is something that should be accounted for in the methodology.\n\nIt does not explain either how it controls for the relaxation of COVID-19 prevention measures (like, lockdown, quarantine, etc) which happened far too early, given that not enough vaccination occured yet.\n\nMoreover, this is not a peer reviewed paper, but a letter to the editor of the European Journal of Epidemiology, a relatively minor journal in its field.\n\nThis is what I figured by reading it.\n\nIt has been published not two weeks ago, and already I can find plenty of critiques online. This is what I found in about 10 minutes by googling the name of the journal, and the id of the article.\n\nThe limit of time of just seven days of evolution is just... preposterous.\n\nIt does not control for differing policies and testing capacities in countries and US counties.\n\nUltimately, it's not too bad a job of data gathering for a high schooler (which, incidentally, one of author of the article is), but the interpretation is somewhat lacking in substance.\n\nI'm sure there's a simple explanation for this, but the dates used are inconsistent as well. It purport to use data released on Sept 3rd, but the meta-data in the article shows that it has been submitted on August 17th. Oops.\n\nFinally, I'm going to be treading dangerously close to ad-hominem, but I believe that whose support one gets tells a lot about one's work. This article has been peddled online by Didier Raoult (the HQC fiasco guru), a man who is seriously lacking in the ethics department, has been fired from the EJoE about a year ago and is discrediting himself scientifically every time he gives a press conference.\n\nMeanwhile, the Medxriv article you posted has not been peer reviewed, contrary to what you posted. It says so in big bold letters right under the authors' list and above the abstract.",
              "timestamp": "2021-10-11 17:46:53",
              "score": 3,
              "num_children": 0,
              "author": 65480,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hg975z5",
      "text": "I didn't argue with my antivaxxer FIL nor did I ever ask him to please go get vaccinated. \n\nHe died on September 19th. \n\nIt's easy to dismiss this group of morons and just let them die, but they have loved ones.",
      "timestamp": "2021-10-11 17:59:18",
      "score": 5,
      "num_children": 1,
      "author": 68163,
      "replies": [
        {
          "id": "hg98qr1",
          "text": "[deleted]",
          "timestamp": "2021-10-11 18:10:29",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "hg9djl1",
              "text": "Because asking would have started an argument.",
              "timestamp": "2021-10-11 18:44:22",
              "score": 3,
              "num_children": 1,
              "author": 68163,
              "replies": [
                {
                  "id": "hg9evkx",
                  "text": "[deleted]",
                  "timestamp": "2021-10-11 18:53:39",
                  "score": -1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hg9igod",
                      "text": "Well when someone is posting Qanon stuff all over social media and refusing to wear a mask, you keep your distance. Physically he lived on the other side of the country so this would not have been an in person conversation. I sent texts of my vax card and talked about how I couldn't wait to travel and introduce my 5 yr old to his grandparents someday soon. There was gentle encouraging.\n\nI had hoped maybe someday he would get out of the cult but nothing I could have said to him would have convinced him otherwise.\n\nIt would be really great if you could stop trying to make me feel like a piece of shit because I didn't ask my FIL to get the vaccine. He's fucking gone. I can't do anything about this now. Please stop.\n\nEdited to add: I think you're missing the point - that antivaxxers die and their pro-vax loved ones are left with that loss. It's pretty fucked up to have zero empathy for that group that is still living.",
                      "timestamp": "2021-10-11 19:19:18",
                      "score": 2,
                      "num_children": 1,
                      "author": 68163,
                      "replies": [
                        {
                          "id": "hgb2gc5",
                          "text": "I'm sorry to hear about your FIL.  It sucks to be missing a family member.  : (. My MIL died from covid last Dec.  Before the vaccines, but I'm not sure if she would have taken it or not.  She didn't wear a mask to church where the entire choir didn't wear their masks in spite of all of them being sick with covid.\n\nSadly, she was the last one I'd have wanted to see die.  I've got plenty of other q / antivaxx relatives I'd have much rather thrown under the covid bus.  And I feel really guilty about that too!  But she was an adult and made her own (stupid) decisions.  Still sucks though...\n\nAnyway, /hugs from a random person who sympathizes...  : )",
                          "timestamp": "2021-10-12 02:33:42",
                          "score": 2,
                          "num_children": 0,
                          "author": 348315,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hg7ue3o",
      "text": "That’s dark",
      "timestamp": "2021-10-11 11:39:19",
      "score": 19,
      "num_children": 1,
      "author": 40815,
      "replies": [
        {
          "id": "hg86vs0",
          "text": "Actual dark humor instead of the “haha funny racial slur” right wing people like to use.",
          "timestamp": "2021-10-11 13:41:04",
          "score": 31,
          "num_children": 0,
          "author": 223545,
          "replies": []
        }
      ]
    },
    {
      "id": "hg8eysd",
      "text": "I used to use what I called a \"stats and facts\" approach to convincing my co workers to get vaccinated. They aren't political, just stupid and afraid. \n\nLately I've just been telling them (gently of course) you're stupid and you're gonna get your shit fucked up or just die. \n\nI can see it in their faces, it's a better approach.",
      "timestamp": "2021-10-11 14:43:41",
      "score": 10,
      "num_children": 1,
      "author": 182504,
      "replies": [
        {
          "id": "hg8i217",
          "text": "> I can see it in their faces, it's a better approach.\n\nHow many minds have you changed since the vaccines have been released?",
          "timestamp": "2021-10-11 15:06:04",
          "score": 8,
          "num_children": 1,
          "replies": [
            {
              "id": "hg8j8dm",
              "text": "0",
              "timestamp": "2021-10-11 15:14:38",
              "score": 9,
              "num_children": 0,
              "author": 182504,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hgayy5h",
      "text": "There is a subreddit named r/hermaincainaward about this very phenomenon.",
      "timestamp": "2021-10-12 02:07:36",
      "score": 2,
      "num_children": 0,
      "author": 209424,
      "replies": []
    },
    {
      "id": "hg8e0it",
      "text": "Think of it as a rare opportunity to observe evolution in action.",
      "timestamp": "2021-10-11 14:36:38",
      "score": 6,
      "num_children": 2,
      "replies": [
        {
          "id": "hg8i5oo",
          "text": "Seldom as humans do we ever see natural selection happen within our own species. It's been fun to watch. Just remember to send those anti-vaxxers \"thoughts & prayers\".",
          "timestamp": "2021-10-11 15:06:47",
          "score": 8,
          "num_children": 0,
          "author": 42487,
          "replies": []
        },
        {
          "id": "hgbzcag",
          "text": "But wait til they take office and doom us with the their magical kool-aid grape drank..",
          "timestamp": "2021-10-12 08:32:40",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hg9bc7s",
      "text": "/r/HermanCainAward has all the schadenfreude you're looking for",
      "timestamp": "2021-10-11 18:28:50",
      "score": 2,
      "num_children": 0,
      "author": 208268,
      "replies": []
    },
    {
      "id": "hg82s71",
      "text": "Looks like a repost. I've seen this image 1 time.\n\nFirst Seen [Here](https://redd.it/q56lah) on 2021-10-10 100.0% match.\n\nFeedback? Hate? Visit r/repostsleuthbot - *I'm not perfect, but you can help. Report [ [False Positive](https://www.reddit.com/message/compose/?to=RepostSleuthBot&subject=False%20Positive&message={\"post_id\": \"q5txzv\", \"meme_template\": null}) ]*\n\n[View Search On repostsleuth.com](https://www.repostsleuth.com?postId=q5txzv&sameSub=false&filterOnlyOlder=true&memeFilter=true&filterDeadMatches=false&targetImageMatch=86&targetImageMemeMatch=96)\n\n---\n\n**Scope:** Reddit | **Meme Filter:** False | **Target:** 86% | **Check Title:** False | **Max Age:** Unlimited | **Searched Images:** 253,836,015 | **Search Time:** 0.84905s",
      "timestamp": "2021-10-11 13:05:27",
      "score": 2,
      "num_children": 2,
      "author": 182762,
      "replies": [
        {
          "id": "hg83w7y",
          "text": "Does anyone care if it was posted to *another subreddit* before?",
          "timestamp": "2021-10-11 13:15:25",
          "score": 12,
          "num_children": 2,
          "author": 367855,
          "replies": [
            {
              "id": "hg9f6n0",
              "text": "i don’t care if it was reposted on this sub. i may have missed it. if not i just carry on like a grown ass adult and don’t whine about reruns in my free entertainment.",
              "timestamp": "2021-10-11 18:55:49",
              "score": 3,
              "num_children": 0,
              "author": 77185,
              "replies": []
            },
            {
              "id": "hg9c29e",
              "text": "Reposts are the lifeblood of reddit ffs",
              "timestamp": "2021-10-11 18:33:54",
              "score": 1,
              "num_children": 0,
              "author": 208268,
              "replies": []
            }
          ]
        },
        {
          "id": "hg82xwm",
          "text": "Who's a good bot",
          "timestamp": "2021-10-11 13:06:52",
          "score": 2,
          "num_children": 0,
          "author": 389618,
          "replies": []
        }
      ]
    },
    {
      "id": "hg9a1h5",
      "text": " I care about other human beings regardless of their views on vaccines. I don't want hospitals to continue to be overwhelmed. The sooner everyone (or most people) get vaccinated the sooner this will be behind us. It also feeds into the narrative anti-vaxxers have that pro-vaccine people and whatnot want them dead.\n\nThis is kinda dark bruh.",
      "timestamp": "2021-10-11 18:19:43",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "hg9bwz3",
          "text": "It's just so exhausting and ultimately pointless to argue with them. There's nothing you can say to a brainwashed anti-vax idiot that they don't have some insane conspiracy theory answer for. I'm not holding anyone's hand anymore or spoonfeeding them scientific facts that they have willfully ignored up until now. It seems callous but goddamn I just want the plague rats spreading this shit gone one way or another.",
          "timestamp": "2021-10-11 18:32:51",
          "score": 1,
          "num_children": 1,
          "author": 208268,
          "replies": [
            {
              "id": "hg9e18g",
              "text": "Oh I completely understand the frustration, especially with the more hardcore anti-vaxxers. I just don't think it's a completely fruitless effort. There is a kind of a spectrum of intensity when it comes to anti-vaxxers and they are not all the extreme nutjob type.",
              "timestamp": "2021-10-11 18:47:48",
              "score": 2,
              "num_children": 1,
              "replies": [
                {
                  "id": "hg9k8wy",
                  "text": "For sure there are those who are just hesitant who mostly are open to at least a civil discussion. I don't think absolutely everyone is a lost cause, but those who are will definitely let you know quickly. If it comes up in conversation, I'll do my best to explain things, *if* it's going to be an actual conversation and not talking to a brick wall. It's so hard to balance the desire to convince everyone with the exhaustion of fighting them.",
                  "timestamp": "2021-10-11 19:32:11",
                  "score": 2,
                  "num_children": 0,
                  "author": 208268,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hg9g8s0",
      "text": "I would gladly wait patiently but the main problem is these same people are the ones going around maskless and acting as if there's no global pandemic and are the reason other people are getting it and new mutations are inevitable until these cunts suck it up and act like the world revolves around them.",
      "timestamp": "2021-10-11 19:03:21",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hg9mozu",
      "text": "Let’s just watch them walk their own asses to the other side of this—whatever it may be.",
      "timestamp": "2021-10-11 19:49:58",
      "score": 1,
      "num_children": 0,
      "author": 129350,
      "replies": []
    },
    {
      "id": "hg9mz2i",
      "text": "One of my staff went on a rant a couple weeks ago about how vaccines are fake. He's currently in the hospital after getting covid.",
      "timestamp": "2021-10-11 19:52:00",
      "score": 1,
      "num_children": 0,
      "author": 376714,
      "replies": []
    },
    {
      "id": "hg9regw",
      "text": "Because they are getting our children who can’t get vaccinated sick and allowing the virus time to mutate so our vaccines don’t work as well.",
      "timestamp": "2021-10-11 20:24:36",
      "score": 1,
      "num_children": 0,
      "author": 58587,
      "replies": []
    },
    {
      "id": "hgaezyi",
      "text": "If your enemy is making a mistake. Don’t interrupt them.",
      "timestamp": "2021-10-11 23:30:38",
      "score": 1,
      "num_children": 0,
      "author": 38465,
      "replies": []
    },
    {
      "id": "hgb0ttr",
      "text": "It’s tough when that person is my mom :(",
      "timestamp": "2021-10-12 02:21:20",
      "score": 1,
      "num_children": 0,
      "author": 270526,
      "replies": []
    },
    {
      "id": "hgb7l3n",
      "text": "Cause they kill the immunocompromised.",
      "timestamp": "2021-10-12 03:12:59",
      "score": 1,
      "num_children": 0,
      "author": 91284,
      "replies": []
    },
    {
      "id": "hgblgch",
      "text": "Like I tell my youngest, patience Tin-Man. \n\nFirst we get the cut right then we can take something off the top.",
      "timestamp": "2021-10-12 05:21:37",
      "score": 1,
      "num_children": 0,
      "author": 163881,
      "replies": []
    },
    {
      "id": "hga8vv0",
      "text": "Because the virus still \"only\" kills 2% of the time, but it hospitalizes 20% of the time?\n\nThey're surviving, and they're wrecking our healthcare system to do it. They're also massively hurting the economy, and eventually it's going to collapse if we don't sort this shit out soon. \n\nNo man is an island folks.",
      "timestamp": "2021-10-11 22:40:35",
      "score": -4,
      "num_children": 1,
      "author": 20553,
      "replies": [
        {
          "id": "hge589v",
          "text": "Sure, but arguing doesnt help, so the point is still valid.",
          "timestamp": "2021-10-12 19:38:22",
          "score": 1,
          "num_children": 1,
          "author": 47694,
          "replies": [
            {
              "id": "hgf5dh0",
              "text": "Sure it does. Shame works. Social pressure works. Writing people off just leaves them to be picked up by guys like Trump, Tucker Carlson & Alex Jones",
              "timestamp": "2021-10-12 23:56:24",
              "score": 1,
              "num_children": 1,
              "author": 20553,
              "replies": [
                {
                  "id": "hgf6o5i",
                  "text": "Getting presented with data/arguments that contradicts your present worldview makes you hold onto those views HARDER.  The research is counter-intuitive but clear on this.\n\nThere is a really involved and long, personal process to change someone's mind, and neither arguing or shame is it.  Its not shame mostly because these people in particular are incapable of shame.\n\nThere was this muslim filmmaker that managed over the course of years to change ONE MIND.\nhttps://www.theguardian.com/lifeandstyle/2017/dec/04/the-muslim-director-who-filmed-neo-nazis-i-thought-im-not-going-to-make-it-out\n\nThere are some ex-neo-nazis that also are in the field of doing this work but it is painfully slow.\n\nMy position is that the effort vs results doesn't justify it.  Its really a huge lift for marginal gain.  There is an opportunity cost to everything.",
                  "timestamp": "2021-10-13 00:06:28",
                  "score": 1,
                  "num_children": 1,
                  "author": 47694,
                  "replies": [
                    {
                      "id": "hgfm1sn",
                      "text": "That's not shame. Shame is something else entirely. You can't logic your way out of something you didn't logic your way into, but you can be *shamed* out of it.",
                      "timestamp": "2021-10-13 02:05:13",
                      "score": 1,
                      "num_children": 0,
                      "author": 20553,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hg8dvgm",
      "text": "[removed]",
      "timestamp": "2021-10-11 14:35:37",
      "score": -7,
      "num_children": 1,
      "replies": [
        {
          "id": "hg8eqs1",
          "text": "You’re misinformed about so many things and I don’t have the energy to argue with you.  But I’d encourage you to do more reading from reputable sources, and ask these questions of your family doctor.",
          "timestamp": "2021-10-11 14:42:02",
          "score": 10,
          "num_children": 1,
          "author": 290393,
          "replies": [
            {
              "id": "hg8g3y8",
              "text": "[removed]",
              "timestamp": "2021-10-11 14:51:53",
              "score": -12,
              "num_children": 2,
              "replies": [
                {
                  "id": "hg8k78b",
                  "text": "Let me clarify then: there are a million other ways I’d rather spend my energy than arguing with you - misinformed random internet stranger.  And it’s not my job to educate you, but there are people out there who have that job (ex: your family doctor), so go speak with them.",
                  "timestamp": "2021-10-11 15:21:41",
                  "score": 6,
                  "num_children": 1,
                  "author": 290393,
                  "replies": [
                    {
                      "id": "hg8n0g2",
                      "text": "Just remember this:\n\nVoltaire:\n\n>It is difficult to free fools from the chains they revere.\n\n\nMark Twain: \n\n>Never argue with an idiot. They'll drag you down to their level and beat you from experience.\n\nRobert A. Heinlein:\n\n> Never attempt to teach a pig to sing; it wastes your time and annoys the pig.",
                      "timestamp": "2021-10-11 15:41:22",
                      "score": 2,
                      "num_children": 0,
                      "author": 98284,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hg8hmza",
                  "text": "Oh do you don't trust BioNtech, the German institution that made the vaccine Pfizer licensed to sell in the US?\n\nI'd love to share your sweet misguided skepticism to third world parties that are dying to get the vaccine as an example of the privilege you casually flex.",
                  "timestamp": "2021-10-11 15:03:04",
                  "score": 10,
                  "num_children": 0,
                  "author": 387508,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hg9pi08",
      "text": "Y’all still argue with anti vaxers?",
      "timestamp": "2021-10-11 20:10:24",
      "score": -1,
      "num_children": 1,
      "author": 266455,
      "replies": [
        {
          "id": "hgbzhow",
          "text": "Do people actually argue with them in person?.. assuming it's mostly social media.   I've never argued or came across one but I do notice when they quit for mandatory vax for not being vaccinated.",
          "timestamp": "2021-10-12 08:35:02",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    }
  ]
}