{
  "id": "q6ym17",
  "text": "Republicans are freaking crazy.\n",
  "timestamp": "2021-10-12 23:39:28",
  "score": 3722,
  "subreddit": "t5_3fdcn",
  "num_children": 54,
  "author": 57011,
  "replies": [
    {
      "id": "hgf378r",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2021-10-12 23:39:29",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "hgf4jdb",
      "text": "My guess is that he knows this is unconstitutional and will be challenged.  All with the intention of limiting the first amendment.   Fascism is a hell of a drug.",
      "timestamp": "2021-10-12 23:49:50",
      "score": 284,
      "num_children": 5,
      "replies": [
        {
          "id": "hgfn0hs",
          "text": "Supremacy Clause.  No State Law trumps (pardon the term) a Federal Law.  There is a standing Federal Mask Mandate.  A State Mandate cannot countermand a Federal One.\n\nAbbott knows this.  But the goobers don't.  So when they lose this in court, he will call it just more PROOF of the Deep State working to keep Texans dying.\n\nWhich is exactly why the corporations based in Texas, like American Airlines and Southwest Airlines and UPS and others are going \"nope.....mandates stay in place.\"",
          "timestamp": "2021-10-13 02:12:50",
          "score": 81,
          "num_children": 0,
          "author": 271845,
          "replies": []
        },
        {
          "id": "hgfcueh",
          "text": "Didn't the federal proclamation against slavery overrule the states laws allowing slavery, hence the reason for Civil War, not \"the war of northern aggression\".",
          "timestamp": "2021-10-13 00:54:44",
          "score": 95,
          "num_children": 1,
          "author": 205120,
          "replies": [
            {
              "id": "hgftqax",
              "text": "Slavery is still legal. Read that 13th amendment closely.",
              "timestamp": "2021-10-13 03:07:34",
              "score": 85,
              "num_children": 3,
              "replies": [
                {
                  "id": "hggd14t",
                  "text": "Corporations abuse slaves all over the world, like Nestle, and they complain that prices would go up, because god forbid we don't pay the people at the top ungodly stacks of cash so we can continue to profit off slavery. \n\nThis is how I know there isn't a hell, so many of these super rich would care, they know there isn't anything else but they'll claim to follow a religion so they get all those fools to believe they are good people.",
                  "timestamp": "2021-10-13 06:24:32",
                  "score": 42,
                  "num_children": 0,
                  "author": 159749,
                  "replies": []
                },
                {
                  "id": "hgfyhw8",
                  "text": "Prisoners aren’t people still to most Americans - unless they disagree with the law that particular inmate was incarcerated for.\n\nLIke having to have “good” AIDS back in the day…",
                  "timestamp": "2021-10-13 03:49:27",
                  "score": 70,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "hghdvj1",
                      "text": "Yeah, people don't care enough about their fellow citizens to support universal healthcare so prisoners are a far cry from their concerns. \n\nAccording to our legal system, someone can murder 100 people,  hole up in a cabin as law enforcement comes to get them, kill police until they run out of bullets then surrender.  Anything less than seeing that individual apprehended without harm done to them, given a fair trial, and incarcerated in humane and livable conditions is a travesty. \n\nIt doesn't matter if you have done the worst crimes imaginable, the state should not punish you in excess of your sentence. We have a duty to prisoners as a society to treat them better.\n\nIt's just another example of our leaders failing us to a significant degree.",
                      "timestamp": "2021-10-13 13:49:39",
                      "score": 3,
                      "num_children": 1,
                      "author": 153409,
                      "replies": [
                        {
                          "id": "hghqsbx",
                          "text": "Even crazier that a company can be the cause of thousands of people deaths but, “here’s a $100 fine”.",
                          "timestamp": "2021-10-13 15:20:33",
                          "score": 5,
                          "num_children": 1,
                          "author": 163881,
                          "replies": [
                            {
                              "id": "hghy00f",
                              "text": "If the fine is less than the profits, it is a business expense.",
                              "timestamp": "2021-10-13 16:09:51",
                              "score": 2,
                              "num_children": 1,
                              "author": 153409,
                              "replies": [
                                {
                                  "id": "hgi1b6n",
                                  "text": "Convenience fee.",
                                  "timestamp": "2021-10-13 16:32:12",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 163881,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hghdaaf",
                      "text": "I Reddit way too much. I know where you got that line about “good” aids.",
                      "timestamp": "2021-10-13 13:45:13",
                      "score": 1,
                      "num_children": 1,
                      "author": 272842,
                      "replies": [
                        {
                          "id": "hghein3",
                          "text": "Enlighten me, i mean  good aids what the... 😅",
                          "timestamp": "2021-10-13 13:54:30",
                          "score": 2,
                          "num_children": 1,
                          "author": 72543,
                          "replies": [
                            {
                              "id": "hghkn80",
                              "text": "I didn’t see it from this sub but it made the rounds yesterday: https://www.reddit.com/r/yourmomshousepodcast/comments/q1oup0/good_aids_vs_bad_aids/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
                              "timestamp": "2021-10-13 14:38:50",
                              "score": 2,
                              "num_children": 0,
                              "author": 272842,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hgh03dc",
                  "text": "Skip to 1:48 for relevant lyrics:\n\nhttps://m.youtube.com/watch?v=6lIqNjC1RKU",
                  "timestamp": "2021-10-13 11:46:04",
                  "score": 2,
                  "num_children": 0,
                  "author": 390863,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hghiwg8",
          "text": "Fascism is the immune system of capitalism",
          "timestamp": "2021-10-13 14:26:46",
          "score": 4,
          "num_children": 0,
          "author": 282487,
          "replies": []
        },
        {
          "id": "hgfjzg9",
          "text": "[removed]",
          "timestamp": "2021-10-13 01:49:18",
          "score": -29,
          "num_children": 3,
          "replies": [
            {
              "id": "hgfvcvd",
              "text": "There are plenty of regulations on businesses. An equal accommodations law, for example mandates a business must serve blacks. A Muslim owner must accommodate non-Muslims. Chistians must serve gays or women.\n\nOSHA regulations and food service regulations are also legal a d necessary impositions on business by government. And the recent news about what happens when they're not enforced has been demonstrative on why we have those laws in the first place.",
              "timestamp": "2021-10-13 03:21:46",
              "score": 25,
              "num_children": 0,
              "author": 264568,
              "replies": []
            },
            {
              "id": "hgfrjkz",
              "text": "Ehhhh, not really.  Fascism protects corporate power and the two are basically intertwined.  If a business lobbied the government to remove a mask mandate, then that would be more like fascism.  Now that I say that, it kinda sounds like we already have.",
              "timestamp": "2021-10-13 02:49:12",
              "score": 15,
              "num_children": 0,
              "author": 384383,
              "replies": []
            },
            {
              "id": "hgh7gqr",
              "text": "Basic public health regulation has been upheld as not fascism for longer than fascism has been a named thing.",
              "timestamp": "2021-10-13 12:57:20",
              "score": 3,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hgkoka5",
          "text": "Actually what he is doing is constitutional. The tenth amendment directly gives power like this to the states not the federal government. I also don’t see how this is limiting the first amendment",
          "timestamp": "2021-10-14 04:21:02",
          "score": 1,
          "num_children": 0,
          "author": 215883,
          "replies": []
        }
      ]
    },
    {
      "id": "hgff13k",
      "text": "If I was in TX I'd be packing my shit and getting the fuck out of there.",
      "timestamp": "2021-10-13 01:11:21",
      "score": 57,
      "num_children": 5,
      "author": 401871,
      "replies": [
        {
          "id": "hggigx8",
          "text": "[deleted]",
          "timestamp": "2021-10-13 07:40:35",
          "score": 22,
          "num_children": 3,
          "replies": [
            {
              "id": "hghjoq9",
              "text": "Drive through small towns and you'll be amazed at how many trump flags are still flying. I have driven all over the rocky mountain states since the election and will see maybe 1-2 in an entire STATE. In Texas, you'll see it in front of every single home in a small town. I live in Houston, the big cities are supposed to be more liberal, but i still feel like 75% of the people i meet are anti-vax and anti-mask.",
              "timestamp": "2021-10-13 14:32:18",
              "score": 7,
              "num_children": 0,
              "author": 368386,
              "replies": []
            },
            {
              "id": "hggyopd",
              "text": "Similar boat as you. Grew up in Texas, lived in Chicago on and off for about 5 years in my 20s and while it would be great to go back, that’s not where my path in life is taking me right now. Plus I’d rather stay to try to work against the dickheads like Abbott and Patrick. If it comes down to election time and we haven’t made any significant changes in leadership, that’s when I’d see myself trying to get out of here.",
              "timestamp": "2021-10-13 11:30:33",
              "score": 5,
              "num_children": 0,
              "author": 347308,
              "replies": []
            },
            {
              "id": "hghyn17",
              "text": "> I guess I'll have to see how many of my rights get stripped away from me as a woman while I wait for my lease to be up...\n\nBy then, you might not be *allowed* to leave. 😒",
              "timestamp": "2021-10-13 16:14:15",
              "score": 1,
              "num_children": 0,
              "author": 354546,
              "replies": []
            }
          ]
        },
        {
          "id": "hgg59uu",
          "text": "They want this, that will help prevent the otherwise inevitable and eventual blue majority.",
          "timestamp": "2021-10-13 04:53:06",
          "score": 27,
          "num_children": 1,
          "author": 277945,
          "replies": [
            {
              "id": "hgg5p4d",
              "text": "Wouldn't it be something though if every dem that leaves goes to purple states. That'd be pretty interesting.",
              "timestamp": "2021-10-13 04:57:28",
              "score": 20,
              "num_children": 0,
              "author": 401871,
              "replies": []
            }
          ]
        },
        {
          "id": "hghbptq",
          "text": "We're trying, but we're stuck (multiple reasons I'm not comfortable sharing). \n\n\nI believe this vocal, psychotic, corrupt minority in power doesn't represent the majority of reasonable people in this state, but IDK anymore. Abbot's main primary apponent (Allen West) is somehow even worse, and attacks Abbot for not being bat shit enough.",
          "timestamp": "2021-10-13 13:32:52",
          "score": 5,
          "num_children": 0,
          "author": 289814,
          "replies": []
        },
        {
          "id": "hghvaed",
          "text": "Some of us just wanna get our degree and get out. \n\nOut of state tuition fees are outrageous. A lot of people don't even have an option to get out because it's so damn big. Its not like moving from new York to Rhode Island its minimum traveling across 1-2 whole Colorados from any major city in Texas to another major city worth moving to.",
          "timestamp": "2021-10-13 15:51:09",
          "score": 2,
          "num_children": 0,
          "author": 77654,
          "replies": []
        },
        {
          "id": "hgidxy3",
          "text": "I don’t have the ability to move right now, but I’m voting in every election I can while I’m here. I live in a more liberal area and have met a bunch of transplants from more liberal areas who came for work and will continue to vote as before, we need people to try as best as they can to vote these fuckers out. Fingers crossed 2022 we can vote Abbott out.",
          "timestamp": "2021-10-13 17:54:43",
          "score": 2,
          "num_children": 0,
          "author": 20369,
          "replies": []
        }
      ]
    },
    {
      "id": "hgf9w4c",
      "text": "Textbook psychopath.\n\nI predict over the next 10-15 years a number of political science, psychology, and public health doctoral dissertations will be written about the intersection of psychopathy, politics, and public health policy.",
      "timestamp": "2021-10-13 00:31:39",
      "score": 155,
      "num_children": 3,
      "author": 74671,
      "replies": [
        {
          "id": "hgfwocu",
          "text": "If they are allowed to",
          "timestamp": "2021-10-13 03:33:19",
          "score": 52,
          "num_children": 2,
          "author": 365282,
          "replies": [
            {
              "id": "hggeavo",
              "text": "to",
              "timestamp": "2021-10-13 06:41:13",
              "score": 7,
              "num_children": 1,
              "author": 171844,
              "replies": [
                {
                  "id": "hggfe0b",
                  "text": "Fixed",
                  "timestamp": "2021-10-13 06:55:56",
                  "score": 14,
                  "num_children": 0,
                  "author": 365282,
                  "replies": []
                }
              ]
            },
            {
              "id": "hghye0t",
              "text": "> If they are allowed to\n\nThat was my thought too.",
              "timestamp": "2021-10-13 16:12:32",
              "score": 1,
              "num_children": 0,
              "author": 354546,
              "replies": []
            }
          ]
        },
        {
          "id": "hggfyc9",
          "text": "The intersection between corporate executive and psychopath has been well documented, I wouldn't be surprised if politicians skew the same way, if not similarly.",
          "timestamp": "2021-10-13 07:03:48",
          "score": 39,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hgho8dj",
          "text": "Psychopathy isnt even a medical term anymore.",
          "timestamp": "2021-10-13 15:03:01",
          "score": 1,
          "num_children": 0,
          "author": 126283,
          "replies": []
        }
      ]
    },
    {
      "id": "hgf4r3b",
      "text": "Private Businesses? What’s next operating hours, what they can sell or not sell. I have both shots and a booster, imagine if Republicans were against the polio vaccines back in the day.\n\nJust in : Texas governor questioned whether he would outlaw birth control or emergency contraception. WTF YOU BANNED ABORTION",
      "timestamp": "2021-10-12 23:51:32",
      "score": 146,
      "num_children": 4,
      "author": 120825,
      "replies": [
        {
          "id": "hgfb04o",
          "text": "A lot of the same games played out during the Spanish flu go look @ old political cartoons and news papers",
          "timestamp": "2021-10-13 00:40:21",
          "score": 48,
          "num_children": 0,
          "author": 193305,
          "replies": []
        },
        {
          "id": "hghd6kq",
          "text": "Well in Texas, car dealerships can't be open on Saturday AND Sunday (they have to do one or the other) and liquor isn't sold on Sundays. So yes, they already do that",
          "timestamp": "2021-10-13 13:44:26",
          "score": 7,
          "num_children": 1,
          "author": 372064,
          "replies": [
            {
              "id": "hghl15s",
              "text": "Growing up in the south, I know about the liquor laws… but still. That’s ridiculous. And car dealerships? Really?! What is the point of that??",
              "timestamp": "2021-10-13 14:41:29",
              "score": 3,
              "num_children": 1,
              "author": 272900,
              "replies": [
                {
                  "id": "hghmtg5",
                  "text": "Jesus!\n\nLiterally not kidding, the dealership thing was literally to give people enough time to \"observe the Sabbath.\" Like there aren't already laws to allow not working on religious holidays. The liquor thing too because Jesus doesn't want you to drink/buy liquor on Sunday.",
                  "timestamp": "2021-10-13 14:53:29",
                  "score": 2,
                  "num_children": 1,
                  "author": 372064,
                  "replies": [
                    {
                      "id": "hghrbnm",
                      "text": "Guess I’m just a drunkard who will buy enough alcohol for two days.",
                      "timestamp": "2021-10-13 15:24:12",
                      "score": 3,
                      "num_children": 1,
                      "author": 163881,
                      "replies": [
                        {
                          "id": "hgk6ffa",
                          "text": "Right, everyone just buys their liquor in advance. I guess it’s better that way, you get more time to enjoy it that way.",
                          "timestamp": "2021-10-14 01:43:50",
                          "score": 1,
                          "num_children": 1,
                          "author": 272900,
                          "replies": [
                            {
                              "id": "hgkjhvm",
                              "text": "Especially during foosball season.\n\nEhhhhhh!!!",
                              "timestamp": "2021-10-14 03:32:28",
                              "score": 1,
                              "num_children": 0,
                              "author": 163881,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hgfeotg",
          "text": "> what they can sell or not sell\n\nThe governments been doing this forever. Can't just sell crack at the corner store without the pigs getting involved.",
          "timestamp": "2021-10-13 01:08:47",
          "score": 29,
          "num_children": 1,
          "replies": [
            {
              "id": "hghr5gs",
              "text": "They just want their taxes.",
              "timestamp": "2021-10-13 15:23:02",
              "score": 2,
              "num_children": 0,
              "author": 163881,
              "replies": []
            }
          ]
        },
        {
          "id": "hghyhif",
          "text": "> Texas governor questioned whether he would outlaw birth control or emergency contraception.\n\nI bet he won't outlaw *condoms*, though. 😒",
          "timestamp": "2021-10-13 16:13:11",
          "score": 1,
          "num_children": 0,
          "author": 354546,
          "replies": []
        }
      ]
    },
    {
      "id": "hgf6f1g",
      "text": "I think they forget that federal law outranks state law sometimes. Or just try to ignore that fact and hope that no one calls them on it.",
      "timestamp": "2021-10-13 00:04:31",
      "score": 43,
      "num_children": 1,
      "author": 35057,
      "replies": [
        {
          "id": "hgglyxm",
          "text": "I remember thinking this when CO legalized. Not the same thing but its a recent example.\n\n I'm scared now. I don't think I'm gonna be able to live here much longer. I'll at least wait to see if he's voted out.",
          "timestamp": "2021-10-13 08:35:08",
          "score": 7,
          "num_children": 0,
          "author": 129971,
          "replies": []
        }
      ]
    },
    {
      "id": "hgfa226",
      "text": "“I’ll kill my constituents before I listen to Biden”\n\nGo on, I’m listening…",
      "timestamp": "2021-10-13 00:32:58",
      "score": 35,
      "num_children": 2,
      "author": 120084,
      "replies": [
        {
          "id": "hgfytdy",
          "text": "Sadly his constituents will praise him all the more for saying this. They'll say \"oh he's so passionate\" or \"haha what a joker, great guy lol\"",
          "timestamp": "2021-10-13 03:52:23",
          "score": 18,
          "num_children": 1,
          "author": 99631,
          "replies": [
            {
              "id": "hgg5bxs",
              "text": "Yes but it's hard to make out those exact words when they're gurgling through a ventilator.",
              "timestamp": "2021-10-13 04:53:41",
              "score": 16,
              "num_children": 0,
              "author": 277945,
              "replies": []
            }
          ]
        },
        {
          "id": "hgh0os1",
          "text": "As a Texan, fuck Greg Abbott.",
          "timestamp": "2021-10-13 11:52:22",
          "score": 9,
          "num_children": 0,
          "author": 210975,
          "replies": []
        }
      ]
    },
    {
      "id": "hgff3cc",
      "text": "So what happened to small government and keeping government out of business?",
      "timestamp": "2021-10-13 01:11:49",
      "score": 93,
      "num_children": 4,
      "author": 223033,
      "replies": [
        {
          "id": "hggvrdx",
          "text": "\"It's not **what** drugs you're strung out on they care about so much as **whose**.\"\n\n\\-Todd Snider  \n\n\nI mean... metaphorically.",
          "timestamp": "2021-10-13 10:55:25",
          "score": 17,
          "num_children": 0,
          "author": 150379,
          "replies": []
        },
        {
          "id": "hgfw1st",
          "text": "That’s what I want to know too.",
          "timestamp": "2021-10-13 03:27:49",
          "score": 14,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hgfk435",
          "text": "Fascists in the comments love government..",
          "timestamp": "2021-10-13 01:50:17",
          "score": 25,
          "num_children": 1,
          "author": 44335,
          "replies": [
            {
              "id": "hgh7n5x",
              "text": "Actually fascists in the comments love spreading virus and antiva propaganda in equal measure.",
              "timestamp": "2021-10-13 12:58:55",
              "score": 5,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hgi7zn7",
          "text": "They want to do whatever they want however they want whenever they want. They are whatever ideology facilitates that most in the moment.\n\nUp until now, they’ve always benefitted from the concept of free market and limited government. But now that ideology is resulting in them doing stuff they don’t wanna, so they want to change the rules again.",
          "timestamp": "2021-10-13 17:16:42",
          "score": 1,
          "num_children": 0,
          "author": 219225,
          "replies": []
        }
      ]
    },
    {
      "id": "hgfjgv5",
      "text": "Those TX businesses should call his bluff. He wants to puff his chest out to impress Dipshit Donald? Okay. Let him enforce it.",
      "timestamp": "2021-10-13 01:45:16",
      "score": 31,
      "num_children": 1,
      "replies": [
        {
          "id": "hggejuj",
          "text": "Many of them already are.  Ibm and several others included.",
          "timestamp": "2021-10-13 06:44:32",
          "score": 12,
          "num_children": 0,
          "author": 348730,
          "replies": []
        }
      ]
    },
    {
      "id": "hgfezfp",
      "text": "Dog whistles. Wag the dog. How is the power grid fix coming along???  Follow the money and don’t fall for the smoke and mirrors.",
      "timestamp": "2021-10-13 01:11:01",
      "score": 29,
      "num_children": 1,
      "author": 187041,
      "replies": [
        {
          "id": "hgghqyt",
          "text": "[deleted]",
          "timestamp": "2021-10-13 07:29:40",
          "score": 17,
          "num_children": 2,
          "replies": [
            {
              "id": "hgigdkb",
              "text": "This. I’m left hoping it’s not a particularly cold winter because little to nothing will have been done about the energy grid by the time the cold weather rolls around again. We got through it ok last year but I’m still dreading having to go through something like that again. The energy that’s been going towards banning abortions under the guise of being “pro-life” could’ve been spent on getting this fixed but dying to a disease we now have methods to guard against and freezing to death in our homes is a-ok with our shitstain of a governor.",
              "timestamp": "2021-10-13 18:11:05",
              "score": 2,
              "num_children": 0,
              "author": 20369,
              "replies": []
            },
            {
              "id": "hgh82j1",
              "text": "I would check to make sure that by \"fixing\" the grid they aren't dismantling the wind turbines Rick Perry put in to make your power cheap and reliable.",
              "timestamp": "2021-10-13 13:02:37",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hgfk9ya",
      "text": "[deleted]",
      "timestamp": "2021-10-13 01:51:32",
      "score": 26,
      "num_children": 2,
      "replies": [
        {
          "id": "hgfv9ev",
          "text": "They don’t care if any of this makes any kind of sense.",
          "timestamp": "2021-10-13 03:20:55",
          "score": 20,
          "num_children": 0,
          "author": 140910,
          "replies": []
        },
        {
          "id": "hgg6quy",
          "text": "It's all about the stance on any given issue, not consistency between issues.",
          "timestamp": "2021-10-13 05:08:26",
          "score": 12,
          "num_children": 0,
          "author": 201605,
          "replies": []
        }
      ]
    },
    {
      "id": "hgfkbfm",
      "text": "Remember, the people Abbott needs to vote for him are fucking stupid. This kind of action gives them a raging boner. \n\n\"The educated doctors say the vaccine is safe? We don't listen to smart city folk, we listen to our pastor with zero actual qualifications in anything and our buddies who know nothing more than we do.\"\n\n\"Standing up to the libs\" makes them happy",
      "timestamp": "2021-10-13 01:51:51",
      "score": 28,
      "num_children": 0,
      "author": 410685,
      "replies": []
    },
    {
      "id": "hgf7sod",
      "text": "Federal Law overrides it.",
      "timestamp": "2021-10-13 00:15:18",
      "score": 17,
      "num_children": 1,
      "author": 139745,
      "replies": [
        {
          "id": "hgh52p2",
          "text": "States rights can suck it’s dick!",
          "timestamp": "2021-10-13 12:36:08",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hgfc1fi",
      "text": "The biggest pandemic risk? Viral misinformation\nA 2018  prediction  https://www.nature.com/articles/d41586-018-07034-4",
      "timestamp": "2021-10-13 00:48:30",
      "score": 14,
      "num_children": 2,
      "author": 193305,
      "replies": [
        {
          "id": "hgffiw5",
          "text": "So basically Republicans.",
          "timestamp": "2021-10-13 01:15:02",
          "score": 16,
          "num_children": 0,
          "author": 401871,
          "replies": []
        },
        {
          "id": "hgfh87m",
          "text": "That author needs a raise",
          "timestamp": "2021-10-13 01:28:01",
          "score": 9,
          "num_children": 0,
          "author": 295977,
          "replies": []
        }
      ]
    },
    {
      "id": "hgffmy1",
      "text": "the worst of the corrupt and seditious",
      "timestamp": "2021-10-13 01:15:52",
      "score": 12,
      "num_children": 1,
      "author": 7622,
      "replies": [
        {
          "id": "hgg5vrj",
          "text": "Ken Paxton is worse.",
          "timestamp": "2021-10-13 04:59:23",
          "score": 4,
          "num_children": 0,
          "author": 362152,
          "replies": []
        }
      ]
    },
    {
      "id": "hgft69k",
      "text": "Biden: I am not mandating a $15 an hour minimum wage. \n\nGOP: We are not not mandating a $15 an hour minimum wage!",
      "timestamp": "2021-10-13 03:02:56",
      "score": 10,
      "num_children": 0,
      "author": 68695,
      "replies": []
    },
    {
      "id": "hgfw0dj",
      "text": "I dunno about y’all but taking control of private business sounds like “communism” to me.",
      "timestamp": "2021-10-13 03:27:27",
      "score": 9,
      "num_children": 0,
      "author": 295152,
      "replies": []
    },
    {
      "id": "hgfwqob",
      "text": "Hey Tx..\n\nYou have an amazing wonder of the world... an aborted fetus has donned a suit, learned to smile and talk into a mic to the point a lot of you voted it into the role of Governor...\n\nWow!",
      "timestamp": "2021-10-13 03:33:52",
      "score": 7,
      "num_children": 0,
      "author": 291675,
      "replies": []
    },
    {
      "id": "hggh2hr",
      "text": "Who cares anymore? I’m glad Biden did a mandate. Let them go on their merry way then. We have tried every way and if you want to cry like babies every which way about everything, I don’t see how we can ever be United. They will keep bringing us down. There is no “middle ground” just us pandering to lunatics at this point. \n\nFor the future and our kids future and the worlds future, if we are ever going to make it out of this “capitalist nightmare hell scape” we live in, we have to stop pandering and start telling them if they don’t like it, there is the door. That’s it. I want what MOST Americans want; a cleaner earth, sustainable drinking water, better school systems, better gun control so my child can go to a public school and not be scared for their life, mental health resources, police in more limited roles. They keep rigging votes, and playing their game. Ok call them on it. They can have their own nightmare country, on their own. I give them three years at most. It’s so past due already.",
      "timestamp": "2021-10-13 07:19:38",
      "score": 7,
      "num_children": 0,
      "author": 273828,
      "replies": []
    },
    {
      "id": "hgfsoxt",
      "text": "Muh freedumbs",
      "timestamp": "2021-10-13 02:58:50",
      "score": 6,
      "num_children": 0,
      "author": 202121,
      "replies": []
    },
    {
      "id": "hgfwm1l",
      "text": "Ahhh, small government…/s",
      "timestamp": "2021-10-13 03:32:45",
      "score": 5,
      "num_children": 0,
      "author": 365282,
      "replies": []
    },
    {
      "id": "hgg77u7",
      "text": "It's a federal law, can't they just arrest him? Man that would be fun.",
      "timestamp": "2021-10-13 05:13:43",
      "score": 6,
      "num_children": 0,
      "author": 159749,
      "replies": []
    },
    {
      "id": "hgfs0lr",
      "text": "COVID 2.0 gonna have fun.",
      "timestamp": "2021-10-13 02:53:08",
      "score": 4,
      "num_children": 0,
      "author": 399255,
      "replies": []
    },
    {
      "id": "hgg54us",
      "text": "And just about every major employer told him to fuck off",
      "timestamp": "2021-10-13 04:51:45",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hggm5au",
      "text": "There’s the face of a gormless idiot",
      "timestamp": "2021-10-13 08:37:46",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hggtcog",
      "text": "That madness is precisely the \"proof of faith\" the republicans are demanding these days, to evaluate a politician's worthiness; a \"Trump Osculum Infame\" of sorts",
      "timestamp": "2021-10-13 10:24:33",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hggupdf",
      "text": "That feeling when you’re so pro business that you discriminate against businesses.",
      "timestamp": "2021-10-13 10:41:48",
      "score": 4,
      "num_children": 0,
      "author": 139629,
      "replies": []
    },
    {
      "id": "hgh77u9",
      "text": "This seems much more fascistic than the vaccine mandates",
      "timestamp": "2021-10-13 12:55:11",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hgh8sf4",
      "text": "There are two problems here.\n\nThe first is that the Texas Governor has done this, the second is the reason why you think he did.\n\nThere are two possibilities for any conservative governor's shit actions right now. Either they believe their actions are harmless and fully believe the rhetoric they spit at every camera or it's an act and they know full well the consequences and scientific risks of their actions.\n\nEither way, none of these people are crazy. They know what they're doing. It's a lack of care, compassion or a grasp on reality that separates any of it. They're logical just like you and me. The further we push the divide of \"all republicans are just crazy\", the further away we will get from finding common ground. They have a basis for their beliefs and actions.\n\nMy main problem is determining who is evil and self-serving and who is just naive and drinking the conservative bathwater.",
      "timestamp": "2021-10-13 13:08:43",
      "score": 3,
      "num_children": 2,
      "author": 226226,
      "replies": [
        {
          "id": "hghhvrr",
          "text": "Abbott is fully vaccinated and got real treatment as soon as he tested positive. There is no doubt that he is fully aware of how serious covid is. \n\nThe lt. governor said the quiet part out loud last year when he said \"we must not be afraid of sacrificing the weak and elderly for the sake of the economy\" (paraphrasing here). That's the end game for these jackals. They're trying to maintain a sense of normalcy to keep their corporate overlords wealthy, and they've admitted they're perfectly willing to kill their constituents to do so.\n\nAnd the sad thing is, the cowfuckers in Texas will still gladly vote for this guy.",
          "timestamp": "2021-10-13 14:19:29",
          "score": 2,
          "num_children": 0,
          "author": 368386,
          "replies": []
        },
        {
          "id": "hghk90p",
          "text": "The key to solving your dilemma is to have a base standard of ignorance that is acceptable.  For instance, we do not allow people in society to claim that they don't know they're not allowed to smear shit on other people.  We do not allow people to claim ignorance that they're not allowed to walk into other people's businesses, open the cash register and take all the money.\n\nThe kind of lie that the fascists are telling these days falls into this category. Anything that is debunkable by 5 seconds in a Google search needs to fall under the category of willful ignorance.",
          "timestamp": "2021-10-13 14:36:09",
          "score": 2,
          "num_children": 0,
          "author": 215411,
          "replies": []
        }
      ]
    },
    {
      "id": "hgj50ra",
      "text": "Look. If Republicans want to die to “own” me, I’m not going to sit here and pretend to be terrified and/or sad. Just get on with it already.",
      "timestamp": "2021-10-13 20:57:49",
      "score": 3,
      "num_children": 0,
      "author": 82144,
      "replies": []
    },
    {
      "id": "hggh8p2",
      "text": "[deleted]",
      "timestamp": "2021-10-13 07:22:06",
      "score": 4,
      "num_children": 1,
      "replies": [
        {
          "id": "hghc74c",
          "text": "He's a vile, evil, psychotic, corrupt, malignant, piece of shit - but, Do Not resort to ableism. Leave the bigotry to the alt-right.",
          "timestamp": "2021-10-13 13:36:40",
          "score": 0,
          "num_children": 0,
          "author": 289814,
          "replies": []
        }
      ]
    },
    {
      "id": "hgfc0tb",
      "text": "Sadly hilarious.",
      "timestamp": "2021-10-13 00:48:23",
      "score": 2,
      "num_children": 0,
      "author": 411009,
      "replies": []
    },
    {
      "id": "hgfqanj",
      "text": "[hmmmm](https://i.redd.it/fr3pq275e3611.jpg)",
      "timestamp": "2021-10-13 02:38:57",
      "score": 2,
      "num_children": 0,
      "author": 172526,
      "replies": []
    },
    {
      "id": "hgg7vrd",
      "text": "And his constituents are willing to die for him. Death Cult.",
      "timestamp": "2021-10-13 05:21:12",
      "score": 2,
      "num_children": 0,
      "author": 225718,
      "replies": []
    },
    {
      "id": "hggj8rm",
      "text": "But the deaths and industey disruptions are definitely his fault not mine. \n\n/this guy",
      "timestamp": "2021-10-13 07:52:18",
      "score": 2,
      "num_children": 0,
      "author": 11652,
      "replies": []
    },
    {
      "id": "hggopl5",
      "text": "The smiling face of a killer",
      "timestamp": "2021-10-13 09:18:05",
      "score": 2,
      "num_children": 0,
      "author": 186353,
      "replies": []
    },
    {
      "id": "hghxhzf",
      "text": "Lame Trump state of mind.",
      "timestamp": "2021-10-13 16:06:25",
      "score": 2,
      "num_children": 0,
      "author": 129350,
      "replies": []
    },
    {
      "id": "hgfxezd",
      "text": "That's cool. Let the dumb die.",
      "timestamp": "2021-10-13 03:39:53",
      "score": 3,
      "num_children": 1,
      "author": 54010,
      "replies": [
        {
          "id": "hgg8iai",
          "text": "I don't care about those idiots suffering and suffocating in the streets but all the innocents they will take with them...",
          "timestamp": "2021-10-13 05:28:17",
          "score": 7,
          "num_children": 0,
          "author": 8211,
          "replies": []
        }
      ]
    },
    {
      "id": "hgi74ld",
      "text": "Yeah, but who's going to do anything about it? We keep putting up with these crazy conservatives and they keep getting crazier. At what point do we just admit that the current Constitution allows too much power to the conservatives and not enough room for society to grow?",
      "timestamp": "2021-10-13 17:11:00",
      "score": 1,
      "num_children": 0,
      "author": 190087,
      "replies": []
    },
    {
      "id": "hgf7djb",
      "text": "The voters are allowing him to do all of this stuff.",
      "timestamp": "2021-10-13 00:11:59",
      "score": 0,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hgg7yni",
      "text": "Here it is, direct from the horses ass.",
      "timestamp": "2021-10-13 05:22:07",
      "score": 1,
      "num_children": 0,
      "author": 266300,
      "replies": []
    },
    {
      "id": "hggla5r",
      "text": "Death cult death cult death cult death cult death cult death cult",
      "timestamp": "2021-10-13 08:24:21",
      "score": 1,
      "num_children": 0,
      "author": 355988,
      "replies": []
    },
    {
      "id": "hghbfib",
      "text": "He thinks this is going to pay off for him in 2024. But people aren’t going to vote for copycat Trump or copycat DeSantis when they can just vote for the real thing.",
      "timestamp": "2021-10-13 13:30:31",
      "score": 1,
      "num_children": 0,
      "author": 334909,
      "replies": []
    },
    {
      "id": "hghfdqe",
      "text": "The federal government can do something about this, right?",
      "timestamp": "2021-10-13 14:01:03",
      "score": 1,
      "num_children": 2,
      "author": 67292,
      "replies": [
        {
          "id": "hghij5s",
          "text": "The supremacy clause of the Constitution prevents states from defying federal laws by trying to pass their own laws against it. So, this is nothing but grandstanding and a waste of tax money.",
          "timestamp": "2021-10-13 14:24:08",
          "score": 3,
          "num_children": 0,
          "author": 368386,
          "replies": []
        },
        {
          "id": "hghg1bs",
          "text": "All the Red states are trying it.",
          "timestamp": "2021-10-13 14:05:57",
          "score": 2,
          "num_children": 1,
          "author": 57011,
          "replies": [
            {
              "id": "hghg50d",
              "text": "So is that a no?",
              "timestamp": "2021-10-13 14:06:44",
              "score": 1,
              "num_children": 0,
              "author": 67292,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hghfw1r",
      "text": "Isnt he also the one who removed the suicide hotline from the LGBT web page because it would \"make him look bad\" for re-election?",
      "timestamp": "2021-10-13 14:04:51",
      "score": 1,
      "num_children": 0,
      "author": 93778,
      "replies": []
    },
    {
      "id": "hghibt6",
      "text": "He’s so scared of getting primaried from the right and this batshittery is the result. He has to be crazier than the crazies.",
      "timestamp": "2021-10-13 14:22:41",
      "score": 1,
      "num_children": 0,
      "author": 123691,
      "replies": []
    },
    {
      "id": "hghijqn",
      "text": "They don’t care how many of their voters they kill because they’re working to suppress anyone besides their brainwashed base. Their only competition is out groveling and out crazying their primary challengers for the love of Trump and his cult.",
      "timestamp": "2021-10-13 14:24:15",
      "score": 1,
      "num_children": 0,
      "author": 234402,
      "replies": []
    },
    {
      "id": "hghji1k",
      "text": "They are willing to die for their beliefs, and their beliefs are fascism.",
      "timestamp": "2021-10-13 14:30:59",
      "score": 1,
      "num_children": 0,
      "author": 215411,
      "replies": []
    },
    {
      "id": "hghk85t",
      "text": "Big government telling private business and private citizens what they can and cannot do with their lives.\n\nHow fascist of them.",
      "timestamp": "2021-10-13 14:36:00",
      "score": 1,
      "num_children": 0,
      "author": 411069,
      "replies": []
    },
    {
      "id": "hghlwx0",
      "text": "A law that will (and is being) flatly ignored by most businesses and private entities in the state.",
      "timestamp": "2021-10-13 14:47:23",
      "score": 1,
      "num_children": 0,
      "author": 195013,
      "replies": []
    },
    {
      "id": "hghnxad",
      "text": "Even if this were enforceable for Texas based businesses, not sure it’s going to make much of a difference for companies based on other states with employees based on Texas.",
      "timestamp": "2021-10-13 15:00:55",
      "score": 1,
      "num_children": 0,
      "author": 292381,
      "replies": []
    },
    {
      "id": "hghsxb6",
      "text": "Just die already",
      "timestamp": "2021-10-13 15:35:06",
      "score": 1,
      "num_children": 0,
      "author": 240623,
      "replies": []
    },
    {
      "id": "hgfqxw1",
      "text": "Not a republican here. Should not be a mandate.",
      "timestamp": "2021-10-13 02:44:14",
      "score": -22,
      "num_children": 2,
      "author": 247549,
      "replies": [
        {
          "id": "hgj4ajk",
          "text": "You seem to have forgotten the \"or get tested\" option.",
          "timestamp": "2021-10-13 20:52:49",
          "score": 2,
          "num_children": 1,
          "author": 47694,
          "replies": [
            {
              "id": "hgk7d8p",
              "text": "No, not forgotten that. That's the route I'll be taking.",
              "timestamp": "2021-10-14 01:51:21",
              "score": 1,
              "num_children": 0,
              "author": 247549,
              "replies": []
            }
          ]
        },
        {
          "id": "hgib0fg",
          "text": "Vaccine mandates are how we eradicate communicable diseases, such as Polio.",
          "timestamp": "2021-10-13 17:36:09",
          "score": 3,
          "num_children": 1,
          "author": 241246,
          "replies": [
            {
              "id": "hgidcmm",
              "text": "You're absolutely right. Have my upvote.\n\n Polio and Smallpox are deadly to a far greater degree while both still being very contagious. We don't mandate flu vaccines, do we? Influenza kills plenty of people a year. \n\nI wear my mask any day I do have to go into public, I otherwise don't go out, I do outside pickup for all of my necessities, I don't want to mingle with even a small handful of people. I do my part to stop the spread. \n\nThe vaccine doesn't stop the spread because it convinces people that they can go about life normally again and they then spread the virus to each other and point fingers at the unvaccinated. It's another topic of division to demonize another section of society. Just like the elections, just like Blue Lives vs Black Lives, just like etc vs etc.",
              "timestamp": "2021-10-13 17:50:52",
              "score": -1,
              "num_children": 0,
              "author": 247549,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hgg9dk2",
      "text": "Mwahahaha the Dims big, dirty plan of off-ing the alt right is coming together.",
      "timestamp": "2021-10-13 05:38:23",
      "score": -4,
      "num_children": 0,
      "author": 319744,
      "replies": []
    }
  ]
}