{
  "id": "q7k2mj",
  "text": "Here we go Lads. Men are to be blamed because “equality “ is not benefiting them.\n",
  "timestamp": "2021-10-13 20:35:44",
  "score": 614,
  "subreddit": "t5_2zaj2",
  "num_children": 13,
  "author": 344389,
  "replies": [
    {
      "id": "hgj5yon",
      "text": "Not too far from the truth, except it was Rockerfeller who started it. \n\n\"We realised we were only taxing half the adult population. We needed the women to join the workforce so we created the Women's Movement. This had the added benefit, that we could 'mind' their children for them and educate them  our way.\"\n\nThis was a conversation Rockerfeller had with Aaron Russo. You can look it up.",
      "timestamp": "2021-10-13 21:04:23",
      "score": 102,
      "num_children": 5,
      "author": 145931,
      "replies": [
        {
          "id": "hgjwkbz",
          "text": "It’s just consumerism… women drive consumption, about 80% actually, and it makes “sense” to empower them to continue spending money and bring in tax…",
          "timestamp": "2021-10-14 00:24:56",
          "score": 44,
          "num_children": 1,
          "author": 196331,
          "replies": [
            {
              "id": "hgl4dkf",
              "text": "But (most) women engage in superficial, meaningless consumerism anyway so is not like they actually care about enjoying their posessions \n\nAt least when men buy stuff that's non-essential, they buy it for their hobbies or to actually to get the most out of its utilitarian value. Women buy stuff to feel fashionable, men buy stuff to use and utilize.",
              "timestamp": "2021-10-14 07:36:06",
              "score": 10,
              "num_children": 1,
              "author": 264087,
              "replies": [
                {
                  "id": "hgltu7y",
                  "text": "This is the way it should be, but I'm pretty sure it's mostly males buying $5000 Yeezys, unfortunately.",
                  "timestamp": "2021-10-14 13:00:00",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hgjtx9a",
          "text": "I've heard about this. Do you have a good link?",
          "timestamp": "2021-10-14 00:04:02",
          "score": 11,
          "num_children": 1,
          "author": 197950,
          "replies": [
            {
              "id": "hgju029",
              "text": "No I don't have a link. Sorry.",
              "timestamp": "2021-10-14 00:04:39",
              "score": 3,
              "num_children": 1,
              "author": 145931,
              "replies": [
                {
                  "id": "hglacy0",
                  "text": "Not a link but there's a good book you could read for the current time we're living in. It's called \"COVID Operation\" and it dives deep into the corruption and totalitarianism of The Rockefeller Foundation, Gavi, Bill and Melinda Gates, the WHO, Wuhan, the list goes on...\nWritten by two very mainstream folks, Pamela Popper and Shane Prier. All sources cited. All conspiracy, no theory.",
                  "timestamp": "2021-10-14 09:08:09",
                  "score": 4,
                  "num_children": 0,
                  "author": 42874,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hgl9sjc",
          "text": "Yup! And Gloria Steinem was approached by the CIA to write her books. I appreciate you posting this. So many have no idea who is behind their social movements. Most movements are started with good intentions but then taken over by criminals to seed division. It's a good ploy, they use those who already believe very strongly towards an ideology and they lean on them hard pretending it's support and \"a matter of national security\" type garbage, influencing the previously altruistic to become more and more extreme. Proof's all out in the open. All you have to do is go to their own websites or pick up a copy of their books and they'll tell you exactly how they prey upon the public in eloquent detail. Sociopaths and psychopaths love to gloat. The Aaron Russo situation is a famous example.",
          "timestamp": "2021-10-14 08:59:25",
          "score": 4,
          "num_children": 0,
          "author": 42874,
          "replies": []
        },
        {
          "id": "hgjzn74",
          "text": "> You can look it up.\n\nCan you maybe provide a citation? Some of us are kinda busy haha",
          "timestamp": "2021-10-14 00:49:08",
          "score": -5,
          "num_children": 1,
          "replies": [
            {
              "id": "hgk1i2a",
              "text": ">conversation Rockerfeller had with Aaron Russo\n\nI did a search term on this phrase, and came up with an interview on youtube on a fairly infamous show that even mentioning the name of might get me shadowbanned. So take that for what it's worth.\n\nFor context, this is Aaron Russo [https://en.wikipedia.org/wiki/Aaron\\_Russo](https://en.wikipedia.org/wiki/Aaron_Russo)\n\nAnd this is the video httpx://www.youtube.com/watch?v=7gwcQjDhZtI\n\nreplace x with s in httpx.\n\nThe part about feminists happens around the 9 minute mark.",
              "timestamp": "2021-10-14 01:03:51",
              "score": 9,
              "num_children": 2,
              "author": 188188,
              "replies": [
                {
                  "id": "hgknvyl",
                  "text": "damn that's a plot twist I wasn't ready for",
                  "timestamp": "2021-10-14 04:14:22",
                  "score": 3,
                  "num_children": 1,
                  "author": 153989,
                  "replies": [
                    {
                      "id": "hgl39se",
                      "text": "Oh, long nosed tribe. So surprising...",
                      "timestamp": "2021-10-14 07:19:58",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hgk363k",
                  "text": "Wow. Russo is a rabid, politically uneducated, ruthlessly idiotic antisocialist—he literally absurdly claimed that the US is a \"socialist\" country! As an enemy of the working class, he has absolutely no credibility whatsoever in my eyes. 👎",
                  "timestamp": "2021-10-14 01:17:18",
                  "score": -12,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hgkc3wv",
                      "text": "K",
                      "timestamp": "2021-10-14 02:30:05",
                      "score": 7,
                      "num_children": 0,
                      "author": 145931,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hgn8e8u",
          "text": "You failed to mention the part how this is mens fault tho.",
          "timestamp": "2021-10-14 18:59:02",
          "score": 1,
          "num_children": 0,
          "author": 344389,
          "replies": []
        }
      ]
    },
    {
      "id": "hgj8582",
      "text": "About to crop this and put it on r/Feminism\n\nEdit: actually nvm I don’t want them to ban me, then I can’t get myself annoyed off the stupid shit they say lol",
      "timestamp": "2021-10-13 21:19:47",
      "score": 34,
      "num_children": 2,
      "replies": [
        {
          "id": "hgjtzed",
          "text": "We also don't want them to know lol.",
          "timestamp": "2021-10-14 00:04:30",
          "score": 24,
          "num_children": 1,
          "author": 197950,
          "replies": [
            {
              "id": "hgjz9r2",
              "text": "Truuuuuuuu",
              "timestamp": "2021-10-14 00:46:13",
              "score": 8,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hgkqslu",
          "text": "You can still look at posts but you won’t be able to comment/reply or post",
          "timestamp": "2021-10-14 04:43:32",
          "score": 4,
          "num_children": 1,
          "author": 370102,
          "replies": [
            {
              "id": "hglaoif",
              "text": "I unsubscribed cause they banned me. Idk what I did besides respectfully criticizing their rhetoric. Oh well.",
              "timestamp": "2021-10-14 09:13:07",
              "score": 2,
              "num_children": 0,
              "author": 296100,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hgjt1lz",
      "text": "Jesus. They can’t stop blaming men, huh?",
      "timestamp": "2021-10-13 23:57:05",
      "score": 30,
      "num_children": 1,
      "author": 130979,
      "replies": [
        {
          "id": "hgkib2u",
          "text": "In a way, feminism wouldn't have gotten anywhere without men. Women couldn't vote or participate equally in the workforce or in education initially afterall... Men voted for women to have that power. It's also worth noting that feminism actually struggled to gain widespread female support until after they started pushing women into universities and passed a lot of laws that incentivized single motherhood in the 70s.\n\nThat's not to say men are to blame... but it's really not actually a gendered issue, it's a feminists (of both genders) vs everyone else issue.",
          "timestamp": "2021-10-14 03:21:48",
          "score": 14,
          "num_children": 1,
          "author": 215395,
          "replies": [
            {
              "id": "hgn3ri7",
              "text": "> incentivized single motherhood in the 70s\n\nFeminism has glamorized being a single mother.  Women will have a kid and the attitude of \"I don't need men\", and then be championed for being so strong because she is a single mother.  Which if you are trying to shape society, because as women we are the ones who have that power (motherhood), it seems so strange to do something that is statistically overwhelming against what you are trying to change but take power and pride in something that seems to be a big root cause (referring to how it's like 85% or whatever of felons were raised by a single mother).  Like why not have a good man as a role model for your boy to grow up into, wait for it, a good man?  Instead it's single mom power! and telling their boys how shitty they are by proxy telling them how bad men in general are.\n\nWomen, feminism, could literally reshape society in a generation, mothers have that much power (they are the primary teacher to kids), yet they choose to continue to repeat the cycle basically out of spite.  Sometimes I think a lot of feminists want to raise bad men or make men filled with spite, I can't come up with a logical reason why you would be so counter productive to your mission.",
              "timestamp": "2021-10-14 18:27:03",
              "score": 4,
              "num_children": 1,
              "author": 181151,
              "replies": [
                {
                  "id": "hgnj5h2",
                  "text": "At this point I think it's because they don't know any better... single moms raised by other single moms surrounded mostly by broken men their entire lives... they probably don't really think about what their contribution is because the problem just seems to be endemic rather than anything they can fix or change. Not to mention by the time they might cone to terms with their contribution to the issue it's too late.\n\nA guy can clean up his act, get his ducks in a row, and go on to have a better life as late as his 30s or 40s... a woman doesn't have that ability, and certainly not as a single mother. She'll most likely no longer be marketable to find a good partner and fix her home, and without that her kids aren't going to actually learn to appreciate how important fathers are, so the chances they'll listen even if she's warning them are low. \n\nWe need to not only stress the importance of fathers and male role models more, but we need to incentivize men and women to get involved as a community to fix the issue. Not having a good father can be partially overcome by having other reliable male figures around... the mothers need to support and seek out men willing to fill that role even if they're not a marriage partner, and men who want to fix the community should try to make themselves available to bond with and mentor the kids.",
                  "timestamp": "2021-10-14 20:13:02",
                  "score": 2,
                  "num_children": 0,
                  "author": 215395,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hgjnoey",
      "text": "So exactly what their job was before feminism???? \n\nInteresting...",
      "timestamp": "2021-10-13 23:14:53",
      "score": 14,
      "num_children": 0,
      "author": 368594,
      "replies": []
    },
    {
      "id": "hgk6r3c",
      "text": "Her: I use feminism to destroy feminism",
      "timestamp": "2021-10-14 01:46:28",
      "score": 11,
      "num_children": 1,
      "author": 128224,
      "replies": [
        {
          "id": "hhiayt0",
          "text": "“Feminism is a male construct”",
          "timestamp": "2021-10-21 16:32:24",
          "score": 1,
          "num_children": 1,
          "author": 302695,
          "replies": [
            {
              "id": "hhjohad",
              "text": "We can't forget how the big bad patriarchy invented feminism so all the rapist men can be lazy /s.",
              "timestamp": "2021-10-21 22:09:08",
              "score": 2,
              "num_children": 0,
              "author": 128224,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hgktu7p",
      "text": "I know for sure it ain’t men marching the streets protesting and all that.",
      "timestamp": "2021-10-14 05:17:33",
      "score": 3,
      "num_children": 0,
      "author": 344389,
      "replies": []
    },
    {
      "id": "hgl64e3",
      "text": "The thing about most women is they're never happy, as a man this revelation can be quite liberating, as you realise you might as well not bother trying to make her happy, and just do your own thing.",
      "timestamp": "2021-10-14 08:02:34",
      "score": 4,
      "num_children": 1,
      "author": 27702,
      "replies": [
        {
          "id": "hgla4d2",
          "text": "For sure. They put that on you to make them happy. You can give out ur kidney to buy them an expensive ring and they’ll ask why the wedding isn’t extravagant and glamorous.",
          "timestamp": "2021-10-14 09:04:34",
          "score": 1,
          "num_children": 0,
          "author": 344389,
          "replies": []
        }
      ]
    },
    {
      "id": "hglc9jz",
      "text": "They want all the benefits, but none of the responsibilities.",
      "timestamp": "2021-10-14 09:37:32",
      "score": 5,
      "num_children": 1,
      "author": 387991,
      "replies": [
        {
          "id": "hgldvz1",
          "text": "Good thing men are waking up to this nonsense. We’ll sure see who really can do without the other.",
          "timestamp": "2021-10-14 10:02:02",
          "score": 1,
          "num_children": 1,
          "author": 344389,
          "replies": [
            {
              "id": "hglf6fo",
              "text": "No one can do without the other. See men never say \"we don't need women\". But these feminists always say \"we don't need a man\". That's what sets us apart. We respect the contributions made by the women in our lives, and frankly speaking I have never personally heard a woman say \"we don't need men\". But these dumb feminists on the net go out of their way to belittle our contributions.",
              "timestamp": "2021-10-14 10:20:28",
              "score": 1,
              "num_children": 0,
              "author": 387991,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hgk3ch5",
      "text": "Feminists are deranged per the picture - there's no \"real feminism\" when it's just a collection of the most mad delusions of the most mentally ill.\n\nSee paedophilia-evangelist Simone de Beauvoir and her countless followers, for example.",
      "timestamp": "2021-10-14 01:18:46",
      "score": 7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hgnetrv",
      "text": "Hahaha... Anytime I hear feminist talk about how they don't want to stay home with the kids, I always say that as a man I am happy to stay home and spend all day with my children.\n\nNo more commute.\n\nNo more packing shitty lunches.\n\nNo more shaving everyday.\n\nNo more condescending bosses.\n\nNo more being told when I can sit and take a break.\n\nYes to afternoon naps.\n\nYes to playtime with the little ones all day.\n\nYes to managing my own schedule.\n\nYes to putting my children first in this complex and sometimes insane world.\n\nYes to being there after school and never missing school plays or sporting events etc.\n\nYes to shaping my child's life.",
      "timestamp": "2021-10-14 19:43:28",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hgrcw1h",
      "text": "Damn it, they've cracked the code.\n\nThe patrons at my local underground patriarchy meetings will not like this.",
      "timestamp": "2021-10-15 17:02:54",
      "score": 2,
      "num_children": 1,
      "author": 32610,
      "replies": [
        {
          "id": "hgyk1u6",
          "text": "They’re onto us",
          "timestamp": "2021-10-17 07:32:25",
          "score": 1,
          "num_children": 0,
          "author": 344389,
          "replies": []
        }
      ]
    },
    {
      "id": "hic1tqy",
      "text": "Head for the bunker soldier, our cover is blown!!!!",
      "timestamp": "2021-10-28 02:53:01",
      "score": 2,
      "num_children": 0,
      "author": 74628,
      "replies": []
    },
    {
      "id": "hgnoc1m",
      "text": "Y’all are fucked up",
      "timestamp": "2021-10-14 20:48:45",
      "score": -2,
      "num_children": 2,
      "author": 385680,
      "replies": [
        {
          "id": "hgnsm9r",
          "text": "Get counselling. You are dangerously unstable and a midandrist. Who hurt you? Woman up and stop crying.",
          "timestamp": "2021-10-14 21:33:55",
          "score": 7,
          "num_children": 0,
          "author": 145931,
          "replies": []
        },
        {
          "id": "hgnu31i",
          "text": "Anybody else would be if they were put through what men go through everyday, but no one cares to help.  Instead they’re constantly bashed, insulted, humiliated and told the world would be a better place without them.",
          "timestamp": "2021-10-14 21:45:05",
          "score": 4,
          "num_children": 0,
          "author": 344389,
          "replies": []
        }
      ]
    }
  ]
}