{
  "id": "q82w76",
  "text": "Double standards up your arse\n",
  "timestamp": "2021-10-14 16:11:22",
  "score": 684,
  "subreddit": "t5_2zaj2",
  "num_children": 18,
  "author": 14392,
  "replies": [
    {
      "id": "hgmubzc",
      "text": "Bazanji - Fed Up\n\nYou’re welcome.",
      "timestamp": "2021-10-14 17:22:01",
      "score": 43,
      "num_children": 2,
      "replies": [
        {
          "id": "hgnbsue",
          "text": "Ok . But who is that suave MF'r with the cigarette ?",
          "timestamp": "2021-10-14 19:22:43",
          "score": 16,
          "num_children": 1,
          "author": 195850,
          "replies": [
            {
              "id": "hgotp52",
              "text": "He is Rajini Kanth..the super star. most celebrated celebrity of India",
              "timestamp": "2021-10-15 02:16:18",
              "score": 9,
              "num_children": 0,
              "author": 111572,
              "replies": []
            }
          ]
        },
        {
          "id": "hgnmt1g",
          "text": "Ou shit he a legend.",
          "timestamp": "2021-10-14 20:38:12",
          "score": 5,
          "num_children": 1,
          "author": 352789,
          "replies": [
            {
              "id": "hgui7fj",
              "text": "[deleted]",
              "timestamp": "2021-10-16 10:50:19",
              "score": 2,
              "num_children": 1,
              "replies": [
                {
                  "id": "hgui9n9",
                  "text": "He sure does i think i heard him for the first time back in 2017 been hooked ever since.",
                  "timestamp": "2021-10-16 10:51:10",
                  "score": 1,
                  "num_children": 0,
                  "author": 352789,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hgmojzz",
      "text": "What a fucking pig",
      "timestamp": "2021-10-14 16:42:23",
      "score": 70,
      "num_children": 0,
      "author": 35335,
      "replies": []
    },
    {
      "id": "hgmtlxd",
      "text": "Tbh you should stop wearing skinny jeans",
      "timestamp": "2021-10-14 17:17:02",
      "score": 14,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hgovybi",
      "text": "That man there has my respect",
      "timestamp": "2021-10-15 02:33:31",
      "score": 16,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hgmqqq5",
      "text": "Wait did he just call her a feminist lol 😆",
      "timestamp": "2021-10-14 16:57:10",
      "score": 45,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hgmwodu",
      "text": "What a hippocrite lmaoo🦛",
      "timestamp": "2021-10-14 17:38:05",
      "score": 25,
      "num_children": 1,
      "replies": [
        {
          "id": "hgnvhci",
          "text": "hypocrite",
          "timestamp": "2021-10-14 21:55:31",
          "score": -6,
          "num_children": 1,
          "replies": [
            {
              "id": "hgodvk1",
              "text": "Hippo-crite seems rather the right observation",
              "timestamp": "2021-10-15 00:16:10",
              "score": 18,
              "num_children": 1,
              "author": 146422,
              "replies": [
                {
                  "id": "hgp3905",
                  "text": "Lol he didn't get it\n\nr/whoosh",
                  "timestamp": "2021-10-15 03:31:47",
                  "score": 11,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hgnpcns",
      "text": "Lmao. Good for you my guy",
      "timestamp": "2021-10-14 20:55:45",
      "score": 8,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hgp1qdb",
      "text": "legend ahahaha",
      "timestamp": "2021-10-15 03:19:04",
      "score": 8,
      "num_children": 0,
      "author": 282923,
      "replies": []
    },
    {
      "id": "hgn44dz",
      "text": "She’s not yours, it’s just your turn. Men are merchandise to women. MGTOW",
      "timestamp": "2021-10-14 18:29:31",
      "score": 27,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hgn4g1n",
      "text": "She didn’t expect you to have fun with her this way",
      "timestamp": "2021-10-14 18:31:47",
      "score": 11,
      "num_children": 0,
      "author": 266521,
      "replies": []
    },
    {
      "id": "hgnfalz",
      "text": "u/savevideo this is so good",
      "timestamp": "2021-10-14 19:46:38",
      "score": 5,
      "num_children": 1,
      "author": 18159,
      "replies": [
        {
          "id": "hgnfbwr",
          "text": "###[View link](https://redditsave.com/r/antifeminists/comments/q82w76/double_standards_up_your_arse/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/antifeminists/comments/q82w76/double_standards_up_your_arse/) &#32;|&#32; \n [^(reddit video downloader)](https://redditsave.com)",
          "timestamp": "2021-10-14 19:46:53",
          "score": 3,
          "num_children": 0,
          "author": 51572,
          "replies": []
        }
      ]
    },
    {
      "id": "hgot076",
      "text": "Rules for thee not for me",
      "timestamp": "2021-10-15 02:10:59",
      "score": 10,
      "num_children": 0,
      "author": 71820,
      "replies": []
    },
    {
      "id": "hgnb70p",
      "text": "Ask for her weight, N-count, which STEM field she has a degree in, what percentage of her previous relationships weren't \"abusive\", and how much of the cost of her rent, food, utilities and car is subsidized by a man.",
      "timestamp": "2021-10-14 19:18:33",
      "score": 13,
      "num_children": 0,
      "author": 256140,
      "replies": []
    },
    {
      "id": "hgoshq0",
      "text": "If men could adjust their height via diet and nutrition they would. Unfortunately the fact that one can control their width via diet and nutrition seems to be rather offensive to far too many women.",
      "timestamp": "2021-10-15 02:07:06",
      "score": 5,
      "num_children": 0,
      "author": 98725,
      "replies": []
    },
    {
      "id": "hgp5l6g",
      "text": "u/savevideo",
      "timestamp": "2021-10-15 03:52:13",
      "score": 1,
      "num_children": 0,
      "author": 282818,
      "replies": []
    },
    {
      "id": "hhklmex",
      "text": "Fucking chad nice one",
      "timestamp": "2021-10-22 02:28:16",
      "score": 1,
      "num_children": 0,
      "author": 179627,
      "replies": []
    },
    {
      "id": "hi6un5f",
      "text": "tbh I am 5'8 also? but also yeah height at this point of my life not a thing for me i dated someone who was 5'4 and that wasn't a big issue or anything, i actually have no idea why height matters to people so much so they have to be disrespectful.",
      "timestamp": "2021-10-27 01:05:39",
      "score": 1,
      "num_children": 0,
      "author": 189978,
      "replies": []
    },
    {
      "id": "hgn2x53",
      "text": "Once again:\n\nWhat does this have to do with feminism?",
      "timestamp": "2021-10-14 18:21:14",
      "score": -38,
      "num_children": 3,
      "author": 111431,
      "replies": [
        {
          "id": "hgn40j4",
          "text": "To answer your question, I would for you, to direct you attention to r/FemaleDatingStrategy , otherwise known as: FDS.",
          "timestamp": "2021-10-14 18:28:48",
          "score": 30,
          "num_children": 2,
          "author": 147755,
          "replies": [
            {
              "id": "hgn7e84",
              "text": "\"But it's not R E A L feminism!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\"💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅💅",
              "timestamp": "2021-10-14 18:52:04",
              "score": 22,
              "num_children": 2,
              "author": 145066,
              "replies": [
                {
                  "id": "hgpm9oc",
                  "text": "It is real feminism 💅",
                  "timestamp": "2021-10-15 06:54:00",
                  "score": 6,
                  "num_children": 0,
                  "author": 397284,
                  "replies": []
                },
                {
                  "id": "hgo7j1f",
                  "text": "It's not actually (FDS might be, but not this specific example). And I say that as a proud antifeminist. I guarantee you, if you have to target the low hanging fruit and the extremely radical feminists to defend your opposition to feminism, you will become a feminist within a decade.",
                  "timestamp": "2021-10-14 23:26:04",
                  "score": -10,
                  "num_children": 0,
                  "author": 111431,
                  "replies": []
                }
              ]
            },
            {
              "id": "hgo78ee",
              "text": "I know what FDS is. Here's the problem, you have no reason to connect this incident to FDS or any variety of feminism. There always have been and there always will be individual men and women who are so full of themselves that they will have absurd double standards. Feminism isn't required for that. If you really want to go down the route of complaining about all women or all of feminism any time an individual woman does something stupid, and then arrogantly claim ownership over antifeminism, then antifeminism is just a misogynistic joke.",
              "timestamp": "2021-10-14 23:23:45",
              "score": -4,
              "num_children": 0,
              "author": 111431,
              "replies": []
            }
          ]
        },
        {
          "id": "hgndet2",
          "text": "It's called Double Standards where users over in FDS (Female Dating Strategy) feel that they can make up insane requirements when it comes to men; for example: make six figures a year, be a certain height, pay for literally everything no questions asked, have a certain sized package.\n\nAnd when it comes down to cheating they feel that it's 100% acceptable and that the only reason why it happened was because the \"man wasn't providing enough\" and \"the man needs to better themselves, not us (the women we're perfect).\"\n\nThey expect insanely high values while bringing next to nothing while expecting to be spoiled and pampered for their entire life. They feel that it's the mans job to not only be the sole provider but even come home and do everything. Cooking, cleaning, laundry all of it while she just lays there like a sloth.\n\nIn conclusion what they want is a not a man, not a partner, not a husband, but instead a living walking wallet that they can ride while draining it of all resources until there's nothing left as she proceeds to then cheat in order to feel satisfied while pulling the victim card.",
          "timestamp": "2021-10-14 19:33:45",
          "score": 14,
          "num_children": 1,
          "author": 134252,
          "replies": [
            {
              "id": "hgo7psc",
              "text": "Women (or men) having absurd double standards has absolutely nothing to do with feminism. There will always be individual men and women who do stupid things, with or without feminism.",
              "timestamp": "2021-10-14 23:27:33",
              "score": 0,
              "num_children": 1,
              "author": 111431,
              "replies": [
                {
                  "id": "hgoebkh",
                  "text": "Wut? Feminism has pushed for dual mating strategy, a lot of men have had rough relationships, because their partners were never satisfied. \n\nFeminism has told women that they are queens and are entitled to everything, and a man that does not hold up to that standard is deemed subhuman. \n\nSo all of this is very much related to feminism, if you don't see it you have selectively blind I guess.",
                  "timestamp": "2021-10-15 00:19:39",
                  "score": 8,
                  "num_children": 1,
                  "author": 146422,
                  "replies": [
                    {
                      "id": "hgp77sy",
                      "text": ">Feminism has told women that they are queens and are entitled to everything, and a man that does not hold up to that standard is deemed subhuman.\n\nNo, entitlement and arrogance exited long before feminism and will exist long after it. Feminism may be a symptom, but it isn't the cause.",
                      "timestamp": "2021-10-15 04:06:52",
                      "score": 0,
                      "num_children": 1,
                      "author": 111431,
                      "replies": [
                        {
                          "id": "hgpbcft",
                          "text": "I think all of the societal problems that we see nowadays can be directly traced back to 1950s and 60s, with the invention if the contraceptives, the militant feminists pushed for a lot of things that created problems like low total fertility rates, increased rate of divorces, single parent households and other problems that accompany these problems... \n\nFeminism was certainly a catalyst.",
                          "timestamp": "2021-10-15 04:45:07",
                          "score": 3,
                          "num_children": 0,
                          "author": 146422,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hgnr0un",
          "text": "If you don’t like it, unsubscribe.",
          "timestamp": "2021-10-14 21:17:57",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "hgo6wd6",
              "text": "Maybe I will, if antifeminism is just going to be complaining about women doing stupid things, maybe I don't want to be associated with it. That's a bit of a problem, because I still think that feminism is a dangerous ideology that needs opposition. However, I have nothing but contempt for idiots who conflate individual women who do stupid (but harmless) things with feminism or all women, and your misogyny (can't believe I have to say that unironically) only provides ammunition for feminists.\n\nI want an antifeminism that is competent and expresses actual criticisms of the feminist ideology, not an antifeminism that is just about men whining about how much they can't stand women because they saw a few videos of a few spoiled women being narcissistic.\n\nPeople like you will be the death of antifeminism. I hope you understand that. And if you can manage to push me away from antifeminism, then feminists deserve complete control over society. \n\nSince you suggested it, I'll unsubscribe. I hope you are proud. Point feminism.",
              "timestamp": "2021-10-14 23:21:05",
              "score": 1,
              "num_children": 1,
              "author": 111431,
              "replies": [
                {
                  "id": "hgoelgn",
                  "text": "You don’t need a subreddit to believe in a concept. Believing in antifeminism doesn’t even require a name. The community will never be perfect, no community ever is. If you want to make it better you could post some of these criticisms you seem to be a fan of.\n\n>\tPoint feminism. \n\nThe inverse of anti-feminism is no more feminism than the inverse of racism is anti-racism. They’re all their own movements, you can leave one and not have to join the other. No one has a monopoly on anti-antifeminist sentiment.",
                  "timestamp": "2021-10-15 00:21:46",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hgp86js",
                      "text": "> If you want to make it better you could post some of these criticisms you seem to be a fan of.\n\nI mean, I have. Just the other day I posted a long criticism of feminist research on the wage gap and explained how  of the most frequently cited sources (by feminist) on the topic are severely flawed.\n\n>No one has a monopoly on anti-antifeminist sentiment.\n\nTrue, because we don't subscribe to a single ideology. But political organizing is vital for any idea, ideology, or in this case, anti-ideology to spread. If one of our most prominent avenue of organization is corrupted by petty whining about women, then I don't really see the general public even considering siding with us.\n\nTo make matters worse, those of us who are trying to maintain the credibility of this subreddit are being told that if we don't like the direction things are going, we should just leave. The antifeminist subreddit now belongs to the whiners and the misogynists and the low-fruit pickers. By all means, give it your best shot and see how effective this strategy will be at dismantling feminism. I've already given up on people in general, so when you fail miserably, I won't feel like I've lost anything.",
                      "timestamp": "2021-10-15 04:15:53",
                      "score": 0,
                      "num_children": 1,
                      "author": 111431,
                      "replies": [
                        {
                          "id": "hgth9fa",
                          "text": "The chance of antifeminism taking off is effectively zero. Societies just don’t throw favor for women out the window on a whim. That’s why most of these subreddits do not even try — it’s a sysiphean task. There’s no organizing that happens here or in mensrights because there’s no future to look forward to. If feminism ends it will be because of self destruction.",
                          "timestamp": "2021-10-16 03:00:04",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hh1u51n",
                              "text": "We as a species will never give up gynocentrism. That isn't the same as feminism. We can prove to the general public that women are not, not have been oppressed by men without telling them not to care about women, or even not to favor women. Maybe it won't happen in our lifetime, but that just means that we have the crucial task of laying the foundation, and we shouldn't be sloppy about it just out of a defeatist mindset.",
                              "timestamp": "2021-10-18 00:21:27",
                              "score": 1,
                              "num_children": 0,
                              "author": 111431,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}