{
  "id": "q9yn46",
  "text": "Fact!\n",
  "timestamp": "2021-10-17 13:23:11",
  "score": 5546,
  "subreddit": "t5_3fdcn",
  "num_children": 16,
  "author": 57011,
  "replies": [
    {
      "id": "hgzck0s",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2021-10-17 13:23:11",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "hh0qeeg",
      "text": "I have a strong disire to start avoiding news like this. I've stayed informed and disgusted by the tactics of the right and it's taking a toll on my mental health and how I see others around me. I live in a small city that is mostly republican and can't help but think most of the people I associate with are down with what the right is doing. I just can't believe people are so gullible, ignorant, and morally corrupt to follow this man and believe with all their hearts that he is doing what's best for American.\n\nI know there's brainwashing and radicalization happening, but the number of people who have given up their critical thinking is astounding. And worse, there's almost no getting them back their belief in this charade. To many people on the right, I'm the conspiracy theorist and the one who needs to re-think my values to do what's right.\n\nI'm tired of it all, pretending to be part of a family and community where common values and decency to other humans are so misaligned. I don't know if this timeline was inevitable but I'm worried about the future and feel like we're in for bad times ahead.",
      "timestamp": "2021-10-17 19:25:13",
      "score": 76,
      "num_children": 3,
      "author": 340543,
      "replies": [
        {
          "id": "hh2ubl8",
          "text": "This is exactly why I deleted my FB account the second the 2016 election results came down. I have an IG that's set to private (so I can weed out folks that are far-right), that I barely use and this Reddit account. \n\nMy family is very large, and historically speaking on the 'fiscal conservative, social liberal' wagon.  2016 was the first year that the majority of them voted Democrat. They saw right through the bullshit and jumped ship. Of course, there are still a few nutjobs hanging around, but we can't ban them from the dinner table until great-grandma either says so or passes away. \n\nDespite all of that, I'm extremely pessimistic about the future of this country. But that's the thing with being a pessimist; you're either right and prepared, or pleasantly surprised.",
          "timestamp": "2021-10-18 06:00:55",
          "score": 15,
          "num_children": 0,
          "author": 321379,
          "replies": []
        },
        {
          "id": "hh19p0q",
          "text": "I feel you. I don’t even know what good this all does. It’s important to know that they are quickly trying to unravel democracy and impose a fascist regime, but what can we do about it? Not much with so many people brainwashed. Officials rigging voting in Georgia affects us all but I’m powerless to stop it. You have to take a second and take care of yourself and the ones close to you sometimes",
          "timestamp": "2021-10-17 21:41:05",
          "score": 16,
          "num_children": 0,
          "author": 389182,
          "replies": []
        },
        {
          "id": "hh2fhf1",
          "text": "I'm just commenting to let you know I feel everything you typed in my soul. I'm tired.",
          "timestamp": "2021-10-18 03:23:08",
          "score": 7,
          "num_children": 1,
          "author": 317118,
          "replies": [
            {
              "id": "hh3hok5",
              "text": "It's pessimistic of me but I think both sides are tired for a reason. Tired people are cranky people, cranky people want whatever is ailing them to stop regardless of how. It feels that a civil war is being constructed and prepared before our eyes and I just don't get it.\nI have had to disconnect from the news of late because of this sentiment and when I jump in it scares me more than ever. The radical choices and conversations taken place are as frightening as the Florida man we thought was the start of a zombie apocalypse a few years back. \nIt's disgusting to say the least and I think the feelings are mutual across the board. I wish this shit could stop and we see that there isn't two sides or family vs family but roles in control that are damning us. I think the eat the rich ideology is pointed in that direction, but its now led by a democratic ideology and will be shunned effortlessly by radicalized republicans and that's what the powers be want. Great distractions from power moves they make; irreversible and bold slaps in our faces. These conversations and causes of inflation for starters, do we really believe prices will go down when supply chains \"recover\". Fuck no, because you've seen it too, the sheer waste and disposals of goods that major players are doing to prevent people from eating and cutting into profits. It's a sham.\n\nEven my rambling has gotten worse, of course I wanted to really say I agree with the sentiment but add to the idea in the same breathe.",
              "timestamp": "2021-10-18 11:30:47",
              "score": 3,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hgzgs6l",
      "text": "Also lulling democrats into a false sense of security, like the 2016 pre election polls",
      "timestamp": "2021-10-17 13:59:19",
      "score": 408,
      "num_children": 1,
      "author": 361049,
      "replies": [
        {
          "id": "hh03zdx",
          "text": "Let's not overlook that the final 2016 pre-election polls almost matched the breakdown of the final vote.",
          "timestamp": "2021-10-17 16:51:18",
          "score": 121,
          "num_children": 0,
          "author": 373737,
          "replies": []
        }
      ]
    },
    {
      "id": "hh0l7ff",
      "text": "This isn't even Alt Right. This is as mainstream GOP and conservative tactic at this point.",
      "timestamp": "2021-10-17 18:49:24",
      "score": 34,
      "num_children": 0,
      "author": 147148,
      "replies": []
    },
    {
      "id": "hgzhtpk",
      "text": "I got a question 👉👈\n\nHe did say to stay home and he is trying to get the election rigged. Two points I understand and accept.\n\nBut, how does him telling people to stay home equate to him getting local GOP to rig the election? \n\nAs far as I understand, they are already trying this. I'm originally from Georgia and watching in horror as they blatantly rig the future elections.\n\nI saw dingbat saying to stay home as him just running his mouth in an effort to say don't trust the system, to cast doubt, but that actually doesn't change the fact they are already trying to rig the election?\n\nEven if I give him a bone and say it is just to continue casting doubt to be used to justify laws, but they were doing that anyway.\n\nSo, im not saying your wrong, but I am interested in your reasoning on how you got from point A to B.",
      "timestamp": "2021-10-17 14:07:48",
      "score": 145,
      "num_children": 6,
      "author": 329882,
      "replies": [
        {
          "id": "hgzjmcv",
          "text": "He’s threatening to dampen turnout if stories of election fraud don’t stay in the media.\n\nThings like those ceaseless audits must be conducted by state level politicians. Few republican officials are as invested as Trump in the election fraud lies, I’m sure they would rather talk about something more politically favorable to them, like attacking Biden.\n\nTrump is trying to prolong the story as long as possible. He’s telling Republican officials he will make it worse for them politically to move on from this then to continue the narrative.",
          "timestamp": "2021-10-17 14:22:12",
          "score": 176,
          "num_children": 3,
          "author": 217591,
          "replies": [
            {
              "id": "hgzzuvc",
              "text": "I hope it all backfires on them tbh, and their voters lose faith in the system and stop turning out and slowly get repalced by democrat canadiates. \n\nProbably wont but I can dream.",
              "timestamp": "2021-10-17 16:21:44",
              "score": 67,
              "num_children": 4,
              "author": 269087,
              "replies": [
                {
                  "id": "hh0152m",
                  "text": "It would be an ideal scenario but it still might not help. Thanks to gerrymandering, the minority can still win the election even if they lose the popular vote. Wisconsin is a good example of this, republicans only need like 44% of the popular vote to win the election but democrats need 56%. I think the districts were just redrawn again too, so it's probably closer to 60/40 now.",
                  "timestamp": "2021-10-17 16:31:00",
                  "score": 51,
                  "num_children": 2,
                  "author": 5853,
                  "replies": [
                    {
                      "id": "hh02lev",
                      "text": "Texas is doing this right now too.",
                      "timestamp": "2021-10-17 16:41:34",
                      "score": 27,
                      "num_children": 1,
                      "author": 139934,
                      "replies": [
                        {
                          "id": "hh3hx3p",
                          "text": "Yeah did you see the proposal to pay homeowners a stipend just before the 2022 election.",
                          "timestamp": "2021-10-18 11:33:31",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hh3kw5r",
                              "text": "I did not. What's that about?",
                              "timestamp": "2021-10-18 12:05:59",
                              "score": 1,
                              "num_children": 1,
                              "author": 139934,
                              "replies": [
                                {
                                  "id": "hh3lcez",
                                  "text": "https://www.texastribune.org/2021/10/15/texas-house-covid-relief-property-taxes/",
                                  "timestamp": "2021-10-18 12:10:45",
                                  "score": 1,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hh01ldg",
                      "text": "Yuck. That shit is disgusting.",
                      "timestamp": "2021-10-17 16:34:18",
                      "score": 14,
                      "num_children": 0,
                      "author": 269087,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hh1w4zt",
                  "text": "The risk that comes with this scenario is that there’s going to be an insurrection at every level whenever their team doesn’t win. Most of those who have been actually charged are given a prison sentence short enough to guarantee they can come out and be ready to lead the next wave of insurrection in 2020.",
                  "timestamp": "2021-10-18 00:38:03",
                  "score": 11,
                  "num_children": 0,
                  "author": 299048,
                  "replies": []
                },
                {
                  "id": "hh10vjr",
                  "text": "As do I, but Democratic voters need to turn out en masse in 2022 and ‘24.",
                  "timestamp": "2021-10-17 20:38:11",
                  "score": 10,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hh3jhd1",
                      "text": "Maybe if the DNC handed them something better than \"or else you'll get Republicans\" they actually would.",
                      "timestamp": "2021-10-18 11:50:55",
                      "score": 1,
                      "num_children": 0,
                      "author": 53225,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hh1s389",
                  "text": "Well, Trumpism is obviously unpopular (he lost). As GiantKoala said, those local officials would probably rather talk about literally anything BUT Trump’s BS grievances all year. Traditional Republicans would like nothing more than to disassociate themselves from Trump, and not have the GOP become known as the Crazy Party.\n\nBut he’s making it hard on them, and he still has some influence because the MAGA crowd clings to him like a cult leader. He’s happily tearing the party apart.",
                  "timestamp": "2021-10-18 00:04:29",
                  "score": 7,
                  "num_children": 0,
                  "author": 179199,
                  "replies": []
                }
              ]
            },
            {
              "id": "hgzk5a1",
              "text": "Thank you very much for that 😊",
              "timestamp": "2021-10-17 14:26:17",
              "score": 12,
              "num_children": 0,
              "author": 329882,
              "replies": []
            },
            {
              "id": "hh2xb1x",
              "text": "Man I can't believe they wholesale still give that clown power.. he's a nobody now.  His word is worth nothing, his opinion meaningless, even his net worth is questionable and legal status dubious at best.  Republican leaders.. just cunning enough to manipulate the ignorant, but still ignorant in and of themselves.",
              "timestamp": "2021-10-18 06:39:57",
              "score": 1,
              "num_children": 1,
              "author": 387508,
              "replies": [
                {
                  "id": "hh45hb9",
                  "text": "He’s unfortunately still quite powerful, and more likely than not to be the nominee in 2024. His approval ratings are on the rise, and he has a death grip on the Republican Party - half the country.\n\nUnderestimate him at your peril, we’ve already seen how badly that can go.",
                  "timestamp": "2021-10-18 14:58:50",
                  "score": 1,
                  "num_children": 1,
                  "author": 217591,
                  "replies": [
                    {
                      "id": "hh7rcp6",
                      "text": "Republicans are actually the minority - less than half the country.  Even though Democrats have crappy voter turnout, no Republican president aside from Bush Jr's 2nd term has won the popular vote in over thirty years - the electoral college keeps fucking America's true choices over for Republicans.  Trump didn't even win the popular vote against Hillary, which makes it even more hilarious they think Biden won by cheating the popular vote.\n\nBut yeah, it's good to stay frosty and cautiously anticipate anything.",
                      "timestamp": "2021-10-19 09:59:57",
                      "score": 1,
                      "num_children": 1,
                      "author": 387508,
                      "replies": [
                        {
                          "id": "hh98kde",
                          "text": "Voter turnout was above 2/3 of all *elligible* (not registered) voters in 2020. Turnout isn't crappy right now. Furthermore, popular vote margins don't matter at all. Nothing you're saying is anything more than platitudes. We have the system we have, and within it, Trump is still very powerful and an existential threat to democracy.\n\nAlso, Republicans may be less than half the country, but they're still -nearly- half the country, and they're radicalizing quickly. It disturbs me how you're trying to downplay them as a tiny fraction with outsized power. 43% of the nation is becoming increasingly accepting of the idea of overturning democracy itself.\n\nMore has been done with less.",
                          "timestamp": "2021-10-19 17:27:54",
                          "score": 1,
                          "num_children": 1,
                          "author": 217591,
                          "replies": [
                            {
                              "id": "hh9yxvp",
                              "text": "Nothing I'm saying is just platitudes, I'm outlining that they do have too much power for how little the represent the country - the electoral college is a complicit ally.\n\nPlease don't put words in my mouth again, I never said they were \"a tiny fraction with outsized power.\"  They're less than half the country, they only win by rigging everything that they can.  We need due diligence on making sure the next election is fair; just like their obsession with voter fraud, every republican concern is an admission of guilt or projection.",
                              "timestamp": "2021-10-19 20:20:20",
                              "score": 1,
                              "num_children": 0,
                              "author": 387508,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hh03q30",
          "text": "Trump is saying that unless the GOP officials do something to \"fix\" their \"insecure\" elections his people won't show up to vote for them.  And if he continues to push for people not to vote these officials will feel the pressure to do just that.",
          "timestamp": "2021-10-17 16:49:34",
          "score": 27,
          "num_children": 1,
          "author": 112035,
          "replies": [
            {
              "id": "hh0816t",
              "text": "So, it's an ultimatum essentially.\n\nThanks",
              "timestamp": "2021-10-17 17:19:54",
              "score": 21,
              "num_children": 0,
              "author": 329882,
              "replies": []
            }
          ]
        },
        {
          "id": "hh0ddfb",
          "text": "Y'all don't need to try and 5d chess everything. Trump is advocating against democracy and will take advantage of whatever cracks in our institution reveal themselves. He will do anything that gets him power and advocate against anything that diminishes it.",
          "timestamp": "2021-10-17 17:56:06",
          "score": 22,
          "num_children": 2,
          "author": 89813,
          "replies": [
            {
              "id": "hh1xifg",
              "text": "Every move he makes has a \"political mastermind\" theory and an opposing \"bumbling idiot\" theory. It's fascinating, but I don't feel either theory has accurately predicted his behavior.",
              "timestamp": "2021-10-18 00:49:26",
              "score": 7,
              "num_children": 1,
              "author": 159724,
              "replies": [
                {
                  "id": "hh1xt4v",
                  "text": "Hard to predict \"Chaos and opportunism\".",
                  "timestamp": "2021-10-18 00:51:51",
                  "score": 10,
                  "num_children": 0,
                  "author": 89813,
                  "replies": []
                }
              ]
            },
            {
              "id": "hh1zo41",
              "text": "Nah. It’s even simpler than that. He’s a demented, narcissistic old fuck who liked it when he was on the news every night and wants people to keep talking about him.",
              "timestamp": "2021-10-18 01:07:13",
              "score": 6,
              "num_children": 0,
              "author": 5391,
              "replies": []
            }
          ]
        },
        {
          "id": "hgzrtba",
          "text": "That's a good question, honestly.  My guess would be he's making it impossible to win legitimately, so he's forcing the hand of GOP officials to rig the elections in his favor.\n\nMRW: http://e.lvme.me/g3hln6p.jpg",
          "timestamp": "2021-10-17 15:23:59",
          "score": 12,
          "num_children": 1,
          "author": 201921,
          "replies": [
            {
              "id": "hh0czfh",
              "text": "Which the GQP officials will do because they love power more than democracy at this point.",
              "timestamp": "2021-10-17 17:53:27",
              "score": 8,
              "num_children": 0,
              "author": 174461,
              "replies": []
            }
          ]
        },
        {
          "id": "hh12jzk",
          "text": "Trump's 'tweet':\n\n> If we don’t solve the Presidential Election Fraud of 2020 (which we have thoroughly and conclusively documented), Republicans will not be voting in ‘22 or ‘24. It is the single most important thing for Republicans to do.\n\nTranslation:\n\nIf we (trumpublican politicians, propagandaists, etc) don't keep pushing the lie, republican voters will not be voting for us in '22 or '24. Thus, we must keep pushing the lie.\n\nNowhere does that tell anyone not to vote, it's not targeted to voters at all - it's a call to action for the propaganda machine.",
          "timestamp": "2021-10-17 20:49:48",
          "score": 6,
          "num_children": 1,
          "author": 28425,
          "replies": [
            {
              "id": "hh1sght",
              "text": "Yeah but he’s also saying “I control my minions’ votes. I can make them not vote for you if I want.” And he will, too.",
              "timestamp": "2021-10-18 00:07:30",
              "score": 6,
              "num_children": 0,
              "author": 179199,
              "replies": []
            }
          ]
        },
        {
          "id": "hh24wxt",
          "text": "At this point, Trump & his ilk have captivated a large portion of the Republican party. Given that Trump is an unscrupulous businessman, who has extorted & otherwise manipulated people his whole life, is it not plausible he is using that leverage over the GOP to pressure them to continue supporting his asinine claims?",
          "timestamp": "2021-10-18 01:51:02",
          "score": 2,
          "num_children": 0,
          "author": 84723,
          "replies": []
        }
      ]
    },
    {
      "id": "hgzynmt",
      "text": "Well, *duh*.  And we'll be *very* lucky if it doesn't work. 😒",
      "timestamp": "2021-10-17 16:13:08",
      "score": 13,
      "num_children": 0,
      "author": 354546,
      "replies": []
    },
    {
      "id": "hh0mqmi",
      "text": "He and those behind this idea that put this in his head, wants those that would support him to not vote, because he wants them to consider voting to be value-less and not a legitimate means to putting people in power. He and those that are behind Trump doing this, will then increase the anger from those people that see a government that they don't agree with and flame the fires to use any means necessary to \"take back their country\".",
      "timestamp": "2021-10-17 19:00:02",
      "score": 8,
      "num_children": 0,
      "author": 378613,
      "replies": []
    },
    {
      "id": "hh18if8",
      "text": "Possibly. IMO I think it’s a tactic to instill further distrust in the electoral system and encourage them to take power through other, more malicious and violent methods. Like Jan 6 again. \nThat’s assuming the worst of them which I think is fully valid to assume given the behavior we’ve seen so far. Villains gonna villain. \n\nHe can’t go out and just say, fuck the voting system, we won’t win that way anymore so get your pitchforks and assault rifles and let’s try this insurrection thing again. But I think that’s what he’s doing. The crowd is already primed and radicalized. He’s going to try to use that and he obviously doesn’t give a shit about democratic institutions.",
      "timestamp": "2021-10-17 21:32:26",
      "score": 5,
      "num_children": 0,
      "author": 267323,
      "replies": []
    },
    {
      "id": "hh23gw3",
      "text": "This is pretty scary, tbh.",
      "timestamp": "2021-10-18 01:39:00",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh2f2xc",
      "text": "It’s not that I outright don’t believe this, but can you source the information?",
      "timestamp": "2021-10-18 03:19:26",
      "score": 2,
      "num_children": 0,
      "author": 36320,
      "replies": []
    },
    {
      "id": "hh2jryy",
      "text": "Telling them not to vote for any other republican candidate, aka forcing them to endorse his nomination  feels more likely.",
      "timestamp": "2021-10-18 04:01:48",
      "score": 2,
      "num_children": 0,
      "author": 6925,
      "replies": []
    },
    {
      "id": "hh1pbct",
      "text": "Fuckin repost from less than a week ago.",
      "timestamp": "2021-10-17 23:42:08",
      "score": -1,
      "num_children": 1,
      "author": 150592,
      "replies": [
        {
          "id": "hh1wmar",
          "text": "Everybody's a critic.",
          "timestamp": "2021-10-18 00:42:02",
          "score": 1,
          "num_children": 1,
          "author": 57011,
          "replies": [
            {
              "id": "hh2bsca",
              "text": "It's my meme.  \n\n\nhttps://imgur.com/gallery/NS8nMur",
              "timestamp": "2021-10-18 02:50:07",
              "score": 1,
              "num_children": 0,
              "author": 150592,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hh2vput",
      "text": "Correct. When people don’t care about elections they won’t care if you subvert them or  get them to use violence if that doesn’t work.",
      "timestamp": "2021-10-18 06:18:55",
      "score": 1,
      "num_children": 0,
      "author": 278757,
      "replies": []
    },
    {
      "id": "hkt4r0a",
      "text": "Left can’t meme.",
      "timestamp": "2021-11-16 03:25:58",
      "score": 1,
      "num_children": 1,
      "author": 320305,
      "replies": [
        {
          "id": "hkuzwn1",
          "text": "Right can't think.",
          "timestamp": "2021-11-16 15:10:34",
          "score": 1,
          "num_children": 0,
          "author": 57011,
          "replies": []
        }
      ]
    },
    {
      "id": "hh0n6fh",
      "text": "Do you have any evidence that he is trying to rig the next election ? Also why did you say “fact” as the title when at best this is conjecture. Im not saying its not possible, but doesnt spouting conjecture about rigging elections like this make you just as bad as the MAGA people running around shouting about the “stolen election” ?",
      "timestamp": "2021-10-17 19:03:02",
      "score": -21,
      "num_children": 3,
      "author": 77628,
      "replies": [
        {
          "id": "hh13key",
          "text": "It's a plausible theory. And I thought it was fair enough, considering we are - in fact - speaking of the guy who claims the elections were \"rigged\".\n\nOr are you saying that trump lied about the election fraud claims, but is somehow above trying to extort election officials? Like Trump–Raffensperger phone call never happened?",
          "timestamp": "2021-10-17 20:56:45",
          "score": 5,
          "num_children": 0,
          "author": 62871,
          "replies": []
        },
        {
          "id": "hh17qxc",
          "text": "It's not about rigging, it's about his push to make the conservative base think that our democracy doesn't work and that elections are illegitimate. \n\nThe GOP doesn't \"rig\" elections, but they do deny their outcomes, suppress voting in minority neighborhoods and push to make it harder to vote for everybody. If they fear that conservatives won't vote for them, they'll push harder on these measures to make sure that they win anyways and to reassure their base that their elections are \"secure\" (i.e.: conservatives win them)",
          "timestamp": "2021-10-17 21:26:48",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hh3iox5",
          "text": "It is a fact.  He’s already done it in AZ, GA, PA and more.",
          "timestamp": "2021-10-18 11:42:14",
          "score": 1,
          "num_children": 0,
          "author": 277111,
          "replies": []
        }
      ]
    },
    {
      "id": "hh2kvzi",
      "text": "I think its foolish to believe either party says anything that's legit.",
      "timestamp": "2021-10-18 04:12:31",
      "score": -4,
      "num_children": 1,
      "author": 369450,
      "replies": [
        {
          "id": "hh3ilr7",
          "text": "\nGtfoh with that both sides  bullshit.\n\nOne side is clearly worse.",
          "timestamp": "2021-10-18 11:41:15",
          "score": 1,
          "num_children": 1,
          "author": 277111,
          "replies": [
            {
              "id": "hh5865l",
              "text": "The lesser of 2 evils is still evil. Do you think those who govern have our best intentions. Both parties have a mile long list of horrendous and dispicable acts against humanity. The WWE makes money off the simple babyface vs heel just like the media promotes with the right vs left, they are in bed together, both have vested financial interests to bleed us dry.",
              "timestamp": "2021-10-18 19:25:44",
              "score": 1,
              "num_children": 1,
              "author": 369450,
              "replies": [
                {
                  "id": "hh59hcv",
                  "text": "One guy openly steals cars and kills pets.\n\nThe other guy is known to steal a few mangoes from neighboring owners’ trees.\n\nIt’s not even a debate whom you’d want as your neighbor.\n\nGtfoh with that “The lesser of 2 evils is still evil” bullshit.\n\nThere is no comparison.",
                  "timestamp": "2021-10-18 19:34:37",
                  "score": 1,
                  "num_children": 0,
                  "author": 277111,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}