{
  "id": "qaqygi",
  "text": "A Pastor Who Raped and Impregnated a 14-Year-Old Girl Will Face No Jail Time | He also won't have to register as a sex offender\n",
  "timestamp": "2021-10-18 17:03:39",
  "score": 14307,
  "subreddit": "t5_2qh2p",
  "num_children": 221,
  "author": 221311,
  "replies": [
    {
      "id": "hh4rxdt",
      "text": ">In 2008, a youth pastor named Jason Greathouse, then 24, moved into the Alabama home of a family with a 14-year-old girl. Greathouse eventually raped that girl and impregnated her. At the urging of her parents, the two of them got married. It didn’t go well — shocker — and they divorced a year later. \n\n\nYet another example of how religion (rather than being the source of morality) deranges a person's moral instincts. Without religion, there is little chance of her parents reacting this way. \n\nCan you imagine being this poor girl and having to accept being repeatedly violated by this monster, while believing that if you don't allow it, you might go to hell?",
      "timestamp": "2021-10-18 17:34:48",
      "score": 2677,
      "num_children": 28,
      "author": 385934,
      "replies": [
        {
          "id": "hh4xbzv",
          "text": "All the shit I've been reading, apparently she's lucky to be able to be divorced. (Obviously, luck isn't the right word here, piled on top of everything else horrible that happened to her, but apparently once these young girls are married, they're in the weird legal position of not being an adult to be able to have legal status and can get trapped.)\n\nOh, and fuck her parents. What a bunch of shitbags.",
          "timestamp": "2021-10-18 18:11:52",
          "score": 1117,
          "num_children": 10,
          "author": 28665,
          "replies": [
            {
              "id": "hh5d0zh",
              "text": ">Oh, and fuck her parents. What a bunch of shitbags.\n\nOh, and fuck her parents. What a bunch of shitbags.",
              "timestamp": "2021-10-18 19:58:46",
              "score": 95,
              "num_children": 1,
              "author": 160101,
              "replies": [
                {
                  "id": "hh5hm3r",
                  "text": ">> Oh, and fuck her parents. What a bunch of shitbags.\n> \n> Oh, and fuck her parents. What a bunch of shitbags.\n\nOh, and fuck her parents. What a bunch of shitbags.",
                  "timestamp": "2021-10-18 20:30:18",
                  "score": 68,
                  "num_children": 1,
                  "author": 91720,
                  "replies": [
                    {
                      "id": "hh6nen3",
                      "text": "the emphasis was entirely needed, what a bunch of shitbags",
                      "timestamp": "2021-10-19 02:04:03",
                      "score": 32,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hh71hab",
                          "text": "> what a bunch of shitbags\n\nHer parents? Yes, they are shitbags, but so is that \"youth pastor\" piece of shit.\n\nIt's stuff like this that pushes good people into murderous rampages.",
                          "timestamp": "2021-10-19 04:07:29",
                          "score": 25,
                          "num_children": 1,
                          "author": 344996,
                          "replies": [
                            {
                              "id": "hh721q4",
                              "text": "goes without saying, for sure... the guy is a predator and absolutely should be kept from having the ability to harm another soul (figurative soul lol)",
                              "timestamp": "2021-10-19 04:13:21",
                              "score": 2,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hh51b3y",
              "text": "Not to mention that the dirtbag youth predator kept raping the girl after they got married also. I am just amazed daddy didn't just shoot his balls off.",
              "timestamp": "2021-10-18 18:39:04",
              "score": 461,
              "num_children": 3,
              "author": 223053,
              "replies": [
                {
                  "id": "hh62iz6",
                  "text": "Yeah, aren't these conservative southern dads always going on about how they'll shoot a boy just for holding their daughters hand or some shit?",
                  "timestamp": "2021-10-18 23:16:51",
                  "score": 358,
                  "num_children": 7,
                  "author": 283207,
                  "replies": [
                    {
                      "id": "hh62x19",
                      "text": "The old \"I don't want boys treating my daughter like I used to treat girls\" over defensiveness.",
                      "timestamp": "2021-10-18 23:19:59",
                      "score": 309,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "hh6apuy",
                          "text": "Very fucking true.",
                          "timestamp": "2021-10-19 00:22:49",
                          "score": 79,
                          "num_children": 0,
                          "author": 193842,
                          "replies": []
                        },
                        {
                          "id": "hh75fov",
                          "text": "Damn that’s a really astute point I hadn’t thought of it quite like that but it makes perfect sense",
                          "timestamp": "2021-10-19 04:50:12",
                          "score": 40,
                          "num_children": 2,
                          "author": 140214,
                          "replies": [
                            {
                              "id": "hh7lvet",
                              "text": "There is a saying \"we are our fathers daughter s, our husbands wives and then our children's mothers\"\nThe meaning behind this phrase is that women are seen by society as owned by men. And the men who do not fall into these categories see her as nothing. \n\nSuch a harsh view but it holds a sad truth.",
                              "timestamp": "2021-10-19 08:36:50",
                              "score": 43,
                              "num_children": 0,
                              "author": 99449,
                              "replies": []
                            },
                            {
                              "id": "hhh3i07",
                              "text": "We all know those fucking snowflakes are too chicken shit to do a fucking thing.",
                              "timestamp": "2021-10-21 10:24:06",
                              "score": 2,
                              "num_children": 0,
                              "author": 362740,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hh6v9g2",
                      "text": "Right but that's because they see their daughters as their property. The dad was obviously fine to give his property to a pastor. But God forbid a young woman *choose* to have sex with a boyfriend her own age.",
                      "timestamp": "2021-10-19 03:10:23",
                      "score": 85,
                      "num_children": 1,
                      "author": 100432,
                      "replies": [
                        {
                          "id": "hh78j6n",
                          "text": "That's exactly what it is.  Bad enough society has to put up with that crap in the 21st century but for father's in this country to still look at their daughters as nothing but property is disgusting!!!!!!!!!!!!",
                          "timestamp": "2021-10-19 05:27:00",
                          "score": 32,
                          "num_children": 0,
                          "author": 130928,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hh6frhn",
                      "text": "Not if it’s a “good Christian boy”. My exes dad hated my guts for sleeping with her, and then becomes best friends with the next guy to do it because he’s a Christian in the army. Guy turned out to be a possessive and manipulative asshole, but you’ll never hear him say a word about it…",
                      "timestamp": "2021-10-19 01:03:16",
                      "score": 91,
                      "num_children": 0,
                      "author": 406158,
                      "replies": []
                    },
                    {
                      "id": "hh7jnbn",
                      "text": "Maybe they wanted fifty shekels of silver more than they wanted justice. Old Testament you-break-it-you-buy-it policy, and all that.",
                      "timestamp": "2021-10-19 08:02:48",
                      "score": 17,
                      "num_children": 0,
                      "author": 187338,
                      "replies": []
                    },
                    {
                      "id": "hh7andx",
                      "text": "Yes, because her virginity holds virtue. Once she's not a virgin anymore, who gives a fuck? Send her off.",
                      "timestamp": "2021-10-19 05:53:42",
                      "score": 5,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "hh7qr3l",
                      "text": "He wasnt a boy, he was a grown man, so I guess that makes it ok?",
                      "timestamp": "2021-10-19 09:50:59",
                      "score": 1,
                      "num_children": 0,
                      "author": 140038,
                      "replies": []
                    },
                    {
                      "id": "hh85r8t",
                      "text": ">conservative southern dads\n\nI'm just gonna say it - the pastor was White. Had he been a Black man, I'm sure daddy would have killed him. \n\nBesides, he is *Man of God* so it must be OK. /s",
                      "timestamp": "2021-10-19 12:45:09",
                      "score": 1,
                      "num_children": 0,
                      "author": 25969,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hh61gv3",
                  "text": "I'm willing to bet the pastor wasn't the first person I'm that house to molest her...which would be why daddy didn't get so upset that this got swept under the rug...",
                  "timestamp": "2021-10-18 23:08:26",
                  "score": 90,
                  "num_children": 2,
                  "author": 36,
                  "replies": [
                    {
                      "id": "hh6xmmc",
                      "text": "Many families in rural America experience sexual abuse of a minor child that they sweep under the rug… out of embarrassment? Shame? \n\nEither way they support and encourage the behavior that: Men can, and *do*, get away with abusing girls, and women, yet the blame is not theirs. \n\nIt is not talked about much as that only makes America even more hypocritical at what the overly loud minority group claims otherwise.",
                      "timestamp": "2021-10-19 03:30:39",
                      "score": 34,
                      "num_children": 2,
                      "author": 1125,
                      "replies": [
                        {
                          "id": "hh7eeta",
                          "text": "I think if caught they can marry. It is legal to marry underage girls in some states still.  Anyways this is f ed up.  Don't blame just America.  Middle East religious places enforce the full coverage of women for the reason that we entice this behavior from men.  Yes. It's religion. That's the main influence.",
                          "timestamp": "2021-10-19 06:44:13",
                          "score": 1,
                          "num_children": 0,
                          "author": 57215,
                          "replies": []
                        },
                        {
                          "id": "hh784j7",
                          "text": "The blame *is* theirs.\n\nWe *are* talking about it.",
                          "timestamp": "2021-10-19 05:21:52",
                          "score": 0,
                          "num_children": 1,
                          "author": 350709,
                          "replies": [
                            {
                              "id": "hha4pdf",
                              "text": "If that is your take away then my whole post went above your head. \n\nMen are to blame yet sweeping their crimes under the rug—ie. marrying the girl/child—is skirting blame. Talking about it is a start. \n\nEnacting legislation to up age of marriage across America—this should not be a State level concern to legislate.",
                              "timestamp": "2021-10-19 20:58:57",
                              "score": 1,
                              "num_children": 0,
                              "author": 1125,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hh6v4pz",
                      "text": "It's Alabama, after all...",
                      "timestamp": "2021-10-19 03:09:16",
                      "score": 1,
                      "num_children": 0,
                      "author": 262606,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hhb2r06",
                  "text": "I can just imagine that conversation between her rapist and her father:\n\n>  So, you're going to keep raping her after you're married?  \n\n> Well, with your permission, of course.  And god's blessing.\n\n> Of course, who doesn't love a good religion-sanctioned rape?\n\n> I sure do - and it's because your daughter is just so rape-able in the eyes of the lord.",
                  "timestamp": "2021-10-20 01:16:13",
                  "score": 1,
                  "num_children": 0,
                  "author": 148979,
                  "replies": []
                }
              ]
            },
            {
              "id": "hh4zfs0",
              "text": "> Oh, and fuck her parents. What a bunch of shitbags.\n\nI agree but remember, they were just following what the Bible (a supposedly God written book) told them. They had to get her married to her rapist as that was only \"right\" thing to do as far as they understood it. It's incredible to me that a person can be convinced that is the morally correct thing to do but here we are reading about it. \n\n> Deuteronomy 22:28-29 “If a man meets a virgin who is not betrothed, and seizes her and lies with her, and they are found, then the man who lay with her shall give to the father of the young woman fifty shekels of silver, and she shall be his wife, because he has violated her. He may not divorce her all his days.\"",
              "timestamp": "2021-10-18 18:26:20",
              "score": 195,
              "num_children": 14,
              "author": 385934,
              "replies": [
                {
                  "id": "hh50q85",
                  "text": "I doubt the parents received the 50 shekels ($1,600).",
                  "timestamp": "2021-10-18 18:35:09",
                  "score": 103,
                  "num_children": 1,
                  "author": 122028,
                  "replies": [
                    {
                      "id": "hh59kxm",
                      "text": "They apparently also divorced according to the headline. which is explicitly forbidden. I mean, good that she was able to. but it's clear they are picking and choosing what parts of the book they like.",
                      "timestamp": "2021-10-18 19:35:19",
                      "score": 98,
                      "num_children": 2,
                      "author": 184735,
                      "replies": [
                        {
                          "id": "hh5jn88",
                          "text": "Bet they shunned her from the church immediately.",
                          "timestamp": "2021-10-18 20:46:00",
                          "score": 54,
                          "num_children": 2,
                          "author": 270311,
                          "replies": [
                            {
                              "id": "hh5s8wu",
                              "text": "As any good christian should.",
                              "timestamp": "2021-10-18 21:56:34",
                              "score": 36,
                              "num_children": 0,
                              "author": 184735,
                              "replies": []
                            },
                            {
                              "id": "hh7up0x",
                              "text": "lucky for her",
                              "timestamp": "2021-10-19 10:45:59",
                              "score": 3,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hh5euvt",
                          "text": "I'm not sure I'm familiar with this. Divorce is discouraged, as far as I know, but not forbidden. Even the Catholic Church allows divorce, though not remarriage until the original spouse has died.\n\nAm I mistaken?",
                          "timestamp": "2021-10-18 20:11:21",
                          "score": 5,
                          "num_children": 8,
                          "author": 81329,
                          "replies": [
                            {
                              "id": "hh5gw5i",
                              "text": "In the verse mentioned above, the rapist has to a) pay 50 shekels to their father, b) marry the girl, and c) not divorce her for all her days. Sounds like the rapist was 1/3 in this case.\n\nNo matter the circumstances, it's disgusting and it's shameful people still follow any biblical doctrine.",
                              "timestamp": "2021-10-18 20:25:20",
                              "score": 24,
                              "num_children": 2,
                              "author": 79000,
                              "replies": [
                                {
                                  "id": "hh5mu45",
                                  "text": ">  Sounds like the rapist was 1/3 in this case.\n\nsounds like he did his best, give him some mercy, that's what jebus would like.\n\nmassive /s",
                                  "timestamp": "2021-10-18 21:16:16",
                                  "score": 11,
                                  "num_children": 0,
                                  "author": 49287,
                                  "replies": []
                                },
                                {
                                  "id": "hh6uce2",
                                  "text": "he cant divorce her, nothing saying she cant divorce him",
                                  "timestamp": "2021-10-19 03:02:23",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 24320,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hh5hho8",
                              "text": "Judiasm allows divorce but Jesus spoke against it in Matthew 5:32\n\n&#x200B;\n\n>But I say to you, whoever divorces his wife (unless the  \n>  \n>marriage is unlawful) causes her to commit adultery,  \n>  \n>and whoever marries a divorced woman commits adultery.\n\nSo, technically no one is supposed to divorce unless they weren't supposed to get married in the first place.",
                              "timestamp": "2021-10-18 20:29:25",
                              "score": 16,
                              "num_children": 2,
                              "author": 401442,
                              "replies": [
                                {
                                  "id": "hh5ijlj",
                                  "text": "It's also interesting to note that the man makes a decision she pays for, and he is not an adulterer also. Disgusting on so many levels.",
                                  "timestamp": "2021-10-18 20:37:03",
                                  "score": 15,
                                  "num_children": 0,
                                  "author": 262607,
                                  "replies": []
                                },
                                {
                                  "id": "hh5izup",
                                  "text": "So, it's that \"unlawful\" bit that leaves wiggle room, and there is all sorts of debate on what is a lawful marriage. If one spouse is an unbeliever or unbaptized at the time of marriage (Pauline privilege), for example, is an established exception. Were the spouses fully consenting? One might argue a child bride is not. Were the marriage vows taken under duress (i.e. a shotgun wedding)?",
                                  "timestamp": "2021-10-18 20:40:37",
                                  "score": 6,
                                  "num_children": 0,
                                  "author": 81329,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hh5s4z3",
                              "text": "In the case of raping a virgin, Deuteronomy explicitly forbids divorce. \"He may not divorce her all his days.\"\n\nIn ordinary marriages divorce may be allowed, if discouraged, but when it comes to raping a minor... You get to keep her! And because she's a woman, she doesn't get a say in the matter. Just like god intended.",
                              "timestamp": "2021-10-18 21:55:44",
                              "score": 15,
                              "num_children": 1,
                              "author": 184735,
                              "replies": [
                                {
                                  "id": "hh6w946",
                                  "text": "While that is horrible that probably had some thought behind it. The virginity was seen as important; the loss of it meant that the future of the woman was insecure as a house wife (and with it her economical standing) because many men would't marry her. This rule would \"punish\" the rapist sofar that he could not leave her and he would be forever financially responsible for her.\n\nOf course this is weird but I think that this is what they meant, but I'm not sure.",
                                  "timestamp": "2021-10-19 03:18:59",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 210161,
                                  "replies": [
                                    {
                                      "id": "hh6zxzn",
                                      "text": "You are correct.\n\nThe rule had the effect of 'protecting' the woman within the cultural constraints of the time.\n\nIn our own time, where the conditions are vastly different, the rule has the exact opposite effect.",
                                      "timestamp": "2021-10-19 03:51:58",
                                      "score": 2,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hh5su7n",
                              "text": "Old Testament = no divorce\nNew Testament = only for infidelity and even then frowned upon.\n\nMy knowledge of the Catholic church is that divorce is not only frowned upon but will exclude you from some things like getting married in the church to anyone other than your ex.",
                              "timestamp": "2021-10-18 22:01:00",
                              "score": 7,
                              "num_children": 0,
                              "author": 15709,
                              "replies": []
                            },
                            {
                              "id": "hh6jc98",
                              "text": "You are mistaken.      \n\nThe Catholic Church does **not** recognise divorce.       \n\nYou may seek annulment (if you have enough money).",
                              "timestamp": "2021-10-19 01:31:25",
                              "score": 6,
                              "num_children": 0,
                              "author": 383071,
                              "replies": []
                            },
                            {
                              "id": "hh61yu4",
                              "text": "It's an unequal situation. The man may not initiate the divorce in that situation because it is part of his punishment and because he ruined the young woman's chances of getting married he must provide for her and can't weasel out by claiming divorce. It makes sense if you are 1^st century goat herders and are working with that socio-economic paradigm. The woman may be able to initiate a divorce depending on if women are restricted from divorcing her husband but it would be likely she wouldn't until she had secured a new caretaker.",
                              "timestamp": "2021-10-18 23:12:25",
                              "score": 4,
                              "num_children": 0,
                              "author": 185891,
                              "replies": []
                            },
                            {
                              "id": "hh6vekl",
                              "text": "Jesus himself actually specifically forbid divorce, a lot of the modern day Christians just ignore that.",
                              "timestamp": "2021-10-19 03:11:36",
                              "score": 1,
                              "num_children": 0,
                              "author": 217162,
                              "replies": []
                            },
                            {
                              "id": "hh6xvia",
                              "text": "They don’t care anymore. Just file for an annulment (for a fee)",
                              "timestamp": "2021-10-19 03:32:49",
                              "score": 1,
                              "num_children": 0,
                              "author": 67820,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hh5ebkc",
                  "text": "Remember, they have been taught that secularists have no foundation for morality. The only objective morality comes from God and **anything** God tells you to do is moral and right.\n\n\"What if God tells you to murder babies?\"\n\n\"What objective foundation did you use to determine that baby killing is immoral?\"\n\nWhen people are taught to think this way, are immersed in this culture, have it driven into their heads at church, at home, and through their media bubble, it's not hard to fathom how marrying your 14-year-old daughter off to her rapist so she can be raped over and over again can be considered as moral and right.\n\nRemember that many Christians are also taught that rape is not a thing that can happen between a married couple. Christians are also told that human beings are sinful wretches, deserving of hell, with no hope of salvation except as a generous, undeserved **GIFT** from a an infinitely merciful God.\n\n\"Baby killing is obviously immoral.\"\n\n\"Is it immoral for a potter to break his pots?\"\n\nThis is a legit response from a serious Christian. Some pots are made to be broken, is what I've been told. This girl is a pot God specifically made for the sole purpose of breaking to test her parents faith just as Abraham was tested. They should count themselves lucky God hasn't asked them to kill her... yet.",
                  "timestamp": "2021-10-18 20:07:38",
                  "score": 52,
                  "num_children": 5,
                  "author": 81329,
                  "replies": [
                    {
                      "id": "hh5x6wn",
                      "text": "That's when you start talking about how wonderful it is that all those devout Christians in the world listened to god when he said to [murder their children](https://www.independent.co.uk/news/world/americas/god-told-me-to-kill-boys-says-mother-54427.html) or [sibling](https://cbs4indy.com/news/mom-faces-murder-charge-blames-god-for-childs-death/) or [co worker](https://www.chron.com/news/houston-texas/article/Police-Dallas-woman-says-God-led-her-to-kill-1705993.php)",
                      "timestamp": "2021-10-18 22:34:23",
                      "score": 11,
                      "num_children": 0,
                      "author": 96131,
                      "replies": []
                    },
                    {
                      "id": "hh5fe8j",
                      "text": "> \"Is it immoral for a potter to break his pots?\"\n> \n> \n> \n> This is a legit response from a serious Christian. Some pots are made to be broken, is what I've been told. This girl is a pot God specifically made for the sole purpose of breaking to test her parents faith just as Abraham was tested. They should count themselves lucky God hasn't asked them to kill her... yet.\n\nThe danger of bad ideas on display in monstrous form.",
                      "timestamp": "2021-10-18 20:15:05",
                      "score": 26,
                      "num_children": 1,
                      "author": 385934,
                      "replies": [
                        {
                          "id": "hh5rn8a",
                          "text": "Yep. God loved them so much and trusted their faith in Him so much that he decided their daughter needed to be raped, just to see if they loved Him more.  \n\n\nSo loving. Fuck everything about Abrahamic religions, specifically.  \n\n\nAt least most neopagan circles are big on consent and aren't out trying to force their religion on everyone else.",
                          "timestamp": "2021-10-18 21:52:04",
                          "score": 22,
                          "num_children": 1,
                          "author": 66004,
                          "replies": [
                            {
                              "id": "hh88ztf",
                              "text": "There is a passage in the Bible in genesis. Jacob's daughter (sister of the 12 brother's) is kidnapped and raped by an entire town/city. The brother's were angry their sister's honor was stolen. They went to the leaders of the city and said we want you to marry the women in our family and we will share our family's wealth, however our God requires each man be circumcised first. The town agrees, every man was circumcised. About day 4 the brothers return and SLAY everyone. Everyone. They return to their father who is angry and fearing reprisal. The brothers respond (paraphrase) \"our sister is not a harlot\".\n\n My point is these people are monsters, they aren't Christians, they don't know God. They are anathema",
                              "timestamp": "2021-10-19 13:13:26",
                              "score": 1,
                              "num_children": 1,
                              "author": 129414,
                              "replies": [
                                {
                                  "id": "hh8fsfs",
                                  "text": "Except that, for all intents and purposes, they ARE Christians. They go to a Christian church. They espouse belief in Christian dogma.  \n\n\nThis \"no true Scotsman\" defense of \"real\" Christians whenever a \"fake Christian\" does something is bullshit.   \n\n\nAll it does is protect the religion, and not the vulnerable people whose lives are verifiably RUINED by its existence and wall of silence.",
                                  "timestamp": "2021-10-19 14:07:53",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 66004,
                                  "replies": [
                                    {
                                      "id": "hh8nhr8",
                                      "text": "What I was try to communicate is that that bulk majority you speak of, they are \"the depart from me, I never knew you\" crowd. If a group of people are consistently collectively shitty, they aren't christlike. Maybe they are what modern Christianity has become, but it isn't christlike. I'm not giving bulk Christianity a pass. I'm condemning it. Anathema is one if the more severe damnations/declarations. \n\nIn 1st John the writer speaks to a truth, \"men will know there is a God but how we treat each other (Christian to Christian). Jesus said it would be better if someone was drug to the bottom of the ocean by a large stone than lead a \"little one\" astray. Little ones would include all the helpless, forgotten, and forsaken. \n\nThis also ties in to the 2 main mandates of the post-Christ believer. Spread the gospel (not convert) and feed the widows and orphans. Do you love me? Feed my sheep/lambs. Christ directly speaks against the \"thoughts and prayers\" crowd. Hungry people?  Feed them. Thirsty people? Give them water. Cold/naked people? Cloth them. This includes all people. \n\nSounds farcical. I'm sorry it's that way. These people and droves more simply aren't Christ-like. Our mouthes and actions reveal who we are. If there is a problem, an inconsistency, that's because there is. \n\nAlong the way fear mongering hateful greedy people literally capitalized on Christianity and it's been pretty terrible ever since. Someone once told me is Jesus Christ himself ran on the democratic ticket in Tennessee, nobody would vote for him. Likewise Satan himself could run on the republican ticket and everyone would vote for him. There has been a pretty nasty bait and switch.",
                                      "timestamp": "2021-10-19 15:03:24",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 129414,
                                      "replies": [
                                        {
                                          "id": "hh8o6rk",
                                          "text": "I agree wholeheartedly that the current incarnation of the religion is far, far, FAR from what its origins and stated values were.",
                                          "timestamp": "2021-10-19 15:08:20",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 66004,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hh60gqf",
                      "text": "[deleted]",
                      "timestamp": "2021-10-18 23:00:22",
                      "score": 6,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hh631dc",
                          "text": "Thank you for sharing this, but I found it a little frustrating. The author has complete control over the story and is obviously writing the preacher to respond in the direction the conversation is leading him. It all feels very unnatural.\n\nI really didn't find these points convincing and I don't think any Christian would either.\n\nFor example, I was at a Bible study and one of the participants asked us to pray for him, he was having a medical procedure the next day. He had hearing trouble and the doctor was installing a cochlear implant. He said he prayed for God to heal him. God could have chosen to heal him through a miracle, but chose to heal him through technology instead.\n\nA Christian would argue that God would fill an individual with the Holy Spirit and it would guide them in all things, but it doesn't make them perfect people. In fact, God's plan may likely involve mistakes, hardship, and suffering, but we are to trust in the plan. A Christian might find themselves, homeless, friendless, and penniless, but as long as they are right with God, they are the richest person in the world.\n\nSo this fictional conversation may help someone on the outside looking in, but the Christian who is convinced that they have access to a superior source of knowledge provided by the Holy Spirit that we secularists could never understand would likely not be convinced by this dialogue. \n\nThanks anyway. I appreciate your willingness to share something you found interesting.",
                          "timestamp": "2021-10-18 23:20:56",
                          "score": 2,
                          "num_children": 1,
                          "author": 81329,
                          "replies": [
                            {
                              "id": "hh65ttt",
                              "text": "[deleted]",
                              "timestamp": "2021-10-18 23:43:20",
                              "score": 2,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hh67qh3",
                                  "text": "I like Socratic method, too. I enjoy using the current modified version, Street Epistemology.\n\nHowever, while it may result in more pleasant, cordial conversations, I sometimes have to take a minute to vent about how repugnant the beliefs they share can be.",
                                  "timestamp": "2021-10-18 23:58:48",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 81329,
                                  "replies": [
                                    {
                                      "id": "hh681jt",
                                      "text": "[deleted]",
                                      "timestamp": "2021-10-19 00:01:20",
                                      "score": 2,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hh68d7k",
                                          "text": "There’s a web site, a podcast, and a subreddit. Anthony Magnabosco is the master. Look up his YouTube channel for good examples of him using this technique.\n\nAll very enjoyable. I listen to it from time to time to help me decompress.",
                                          "timestamp": "2021-10-19 00:03:59",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 81329,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hh6e80c",
                      "text": "Why do they dislike abortion, then?",
                      "timestamp": "2021-10-19 00:51:02",
                      "score": 2,
                      "num_children": 0,
                      "author": 305535,
                      "replies": []
                    },
                    {
                      "id": "hh62jvl",
                      "text": "> Is it immoral for a potter to break his pots?\"\n> \n> This is a legit response from a serious Christian.\n\nThere's a crack in every pot, that's how the crazy gets in.",
                      "timestamp": "2021-10-18 23:17:04",
                      "score": 1,
                      "num_children": 0,
                      "author": 255322,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hh53188",
                  "text": ">\tI agree but remember, they were just following what the Bible (a supposedly God written book) told them\n\nMakes it only worse to set a book above the well-being of your children.",
                  "timestamp": "2021-10-18 18:50:52",
                  "score": 136,
                  "num_children": 0,
                  "author": 225650,
                  "replies": []
                },
                {
                  "id": "hh53b7c",
                  "text": "They let them divorce, so it's the usual selective hearing. They decided she consented. They did not consider he was a pedophile and that it was rape. Or they think it's more embarrassing to have her be married than try to protect what they can.",
                  "timestamp": "2021-10-18 18:52:47",
                  "score": 17,
                  "num_children": 1,
                  "author": 28665,
                  "replies": [
                    {
                      "id": "hh5sjjc",
                      "text": "The last sentence is literally their thought process. They didn't care that she was raped; they were worried how such an allegation would affect THEM. They worried how the church would look at THEM when their child had a child out of wedlock. (Because I'm sure abortion wasn't even considered.)  \n\n\nThe article even says that the filed the charges \"after she understood more of what happened to her\" - meaning that even IF she thought she had been raped, the preacher and her family (presumably) did everything to convince her that she hadn't been raped. It's reasonable to assume that they told her it was her fault.",
                      "timestamp": "2021-10-18 21:58:47",
                      "score": 7,
                      "num_children": 0,
                      "author": 66004,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hh5i8qu",
                  "text": "It's a legal tradition called bridal capture. The 50 silver was considered a VERY high price to pay for a wife. It was supposed to act as a disincentive to doing this. It's also interesting to note that the Bible specifically mentions getting caught, (by a man, no doubt) as opposed to being accused by the victim.",
                  "timestamp": "2021-10-18 20:34:48",
                  "score": 10,
                  "num_children": 1,
                  "author": 262607,
                  "replies": [
                    {
                      "id": "hh7trol",
                      "text": "> It was supposed to act as a disincentive to doing this.\n\nIt's so funny that with the option of \"eternal punishment by me, god, who this book is supposedly about\" on the table, they jumped instead for a financial penalty.",
                      "timestamp": "2021-10-19 10:33:46",
                      "score": 1,
                      "num_children": 0,
                      "author": 67180,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hh5gu4w",
                  "text": "The Bible is simply too worldly, vengeful, scientifically inaccurate, narrow and filled with absurdities to be written by anything other than man. I’d think the words of a deity with the power to create the universe would be truly revelational. The Bible is anything but.",
                  "timestamp": "2021-10-18 20:24:57",
                  "score": 11,
                  "num_children": 1,
                  "author": 373819,
                  "replies": [
                    {
                      "id": "hh5kf4n",
                      "text": "I agree, but many are deluded and that delusion has really awful real-world consequences",
                      "timestamp": "2021-10-18 20:52:51",
                      "score": 4,
                      "num_children": 1,
                      "author": 385934,
                      "replies": [
                        {
                          "id": "hh5kkzb",
                          "text": "“Those who can make you believe absurdities can also make you commit atrocities.”   \n\\- Voltaire",
                          "timestamp": "2021-10-18 20:54:21",
                          "score": 9,
                          "num_children": 0,
                          "author": 373819,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hh5wt34",
                  "text": "As though I didn't need another reason to believe Abrahamic religions are trash. \n\nAny decent woman with working brain cells should be able to determine that this is absolute bullshit.",
                  "timestamp": "2021-10-18 22:31:25",
                  "score": 4,
                  "num_children": 0,
                  "author": 381133,
                  "replies": []
                },
                {
                  "id": "hh55tlj",
                  "text": "Oh so rape a woman you covet because then she has to marry you. Got it. Thanks The Bible!\n\n/s",
                  "timestamp": "2021-10-18 19:09:47",
                  "score": 14,
                  "num_children": 0,
                  "author": 4226,
                  "replies": []
                },
                {
                  "id": "hh5y5kv",
                  "text": "> and they are found\n\nOnly counts if they're caught apparently..",
                  "timestamp": "2021-10-18 22:41:55",
                  "score": 3,
                  "num_children": 0,
                  "author": 67303,
                  "replies": []
                },
                {
                  "id": "hh56h9k",
                  "text": "I watched a movie once that said I could kill anyone I wanted for 24 hours with no conveniences. Can I use that to legally justify my actions?",
                  "timestamp": "2021-10-18 19:14:16",
                  "score": 6,
                  "num_children": 1,
                  "author": 199255,
                  "replies": [
                    {
                      "id": "hh56zc2",
                      "text": "No. \n\nBut are there more than a billion people in the world who believe that movie was written by the creator of the universe as a way of guiding human behavior? If so, I'd really like to hear about it.",
                      "timestamp": "2021-10-18 19:17:41",
                      "score": 5,
                      "num_children": 1,
                      "author": 385934,
                      "replies": [
                        {
                          "id": "hh57oqq",
                          "text": "But in the end it shouldn’t  matter how many people believe it. It’s still just as much make believe as Bugs Bunny and should carry the same amount of weight.",
                          "timestamp": "2021-10-18 19:22:29",
                          "score": 5,
                          "num_children": 1,
                          "author": 199255,
                          "replies": [
                            {
                              "id": "hh58jzh",
                              "text": "Except that when something is widely adhered to, it more understandable that someone hasn't made the effort to think it through for themselves. Maybe the parents themselves were brainwashed into this belief by their own parents for example.\n\nAlso, I think it's reasonable to assume that absent the horrible bible teachings, her parents would have reacted very differently. This is precisely why it's so important for these horrible belief systems to be challenged, because they are powerful and do a lot of damage. Blaming individuals for falling for it isn't very useful.",
                              "timestamp": "2021-10-18 19:28:20",
                              "score": 3,
                              "num_children": 1,
                              "author": 385934,
                              "replies": [
                                {
                                  "id": "hh59xbs",
                                  "text": "Who I blame is the government. It is supposed to be there to ensure that teh stupid doesn’t infect everyone else and they’re failing horribly. \n\nUnfortunately, until the day comes when the majority either laugh at or pity the religious, it’s not gonna change.",
                                  "timestamp": "2021-10-18 19:37:43",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 199255,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hh5mp4h",
                  "text": "I hope this shithead father truly revels in his 50 shekels.  he can use it to buy a rope to put around his neck",
                  "timestamp": "2021-10-18 21:15:04",
                  "score": 1,
                  "num_children": 0,
                  "author": 49287,
                  "replies": []
                },
                {
                  "id": "hh6rkhv",
                  "text": "If the rapist doesn’t so much lie “with” her, but more “on” her, does this passage still apply?",
                  "timestamp": "2021-10-19 02:39:02",
                  "score": 1,
                  "num_children": 0,
                  "author": 25727,
                  "replies": []
                },
                {
                  "id": "hh7tnwi",
                  "text": "> and they are found\n\nSo if no other people discover what you've done, you're in the clear! No mention of how, in this book that supposedly demonstrates the existence of an all-seeing authority, *said authority* knows you've done it and so you should \"pay\" for your crime anyway. Nah. Nobody finds you? Keep doing it!",
                  "timestamp": "2021-10-19 10:32:22",
                  "score": 1,
                  "num_children": 0,
                  "author": 67180,
                  "replies": []
                },
                {
                  "id": "hher633",
                  "text": "I remember reading that passage and was shocked. Made me wanna burn my bible.",
                  "timestamp": "2021-10-20 20:51:38",
                  "score": 1,
                  "num_children": 0,
                  "author": 315843,
                  "replies": []
                }
              ]
            },
            {
              "id": "hh69amg",
              "text": "We sit here (in America) and look down our noses at these little villages in middle eastern countries that are primarily Muslim and have the sort of Old Testament traditions like this: a girl is raped and can either be killed by her family for \"bringing shame\" or forced to marry her rapist yet....... Alabama.  We hear the same stories here in this oh-so advanced country.  \n\nThe fanaticals here aren't really any different than those \"over there\".  We just have Netflix",
              "timestamp": "2021-10-19 00:11:26",
              "score": 28,
              "num_children": 4,
              "author": 206848,
              "replies": [
                {
                  "id": "hh83nbi",
                  "text": "Oh and it's not just Alabama. It happens in a lot of states. Almost all have an exception for pregnancy. It's ridiculous.",
                  "timestamp": "2021-10-19 12:25:29",
                  "score": 3,
                  "num_children": 1,
                  "author": 28665,
                  "replies": [
                    {
                      "id": "hh84046",
                      "text": "True. We like to shit on Alabama and Mississippi here in the south because it makes us feel better, but the rural areas (especially) in most states are this way.",
                      "timestamp": "2021-10-19 12:28:54",
                      "score": 4,
                      "num_children": 1,
                      "author": 206848,
                      "replies": [
                        {
                          "id": "hh8gcxz",
                          "text": "I moved to Georgia 25 years ago from Northern California, and I've lived in upstate New York for a bit and had a traveling job going to powerplants in most the western states. Rural folks are pretty much the same everywhere, especially conservatives and more religious people. \n\nHilariously while I had that job (and maybe in answer to your question), I had the older guys at the plants trying to set me up with their sons for the same reasons. \"She makes good money son, think about it.\" While I sit there like, I didn't sign up to be packaged as the reliable bargain, thanks, I'm not a granola bar. So maybe it does happen to guys too.",
                          "timestamp": "2021-10-19 14:12:15",
                          "score": 3,
                          "num_children": 0,
                          "author": 28665,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hh83it0",
                  "text": "I knew this has to be the US. Just checking where. What a messed up place.",
                  "timestamp": "2021-10-19 12:24:18",
                  "score": 1,
                  "num_children": 0,
                  "author": 255116,
                  "replies": []
                },
                {
                  "id": "hh87mgn",
                  "text": "They probably have Netflix there too.",
                  "timestamp": "2021-10-19 13:01:40",
                  "score": 1,
                  "num_children": 0,
                  "author": 330921,
                  "replies": []
                },
                {
                  "id": "hh8sv6m",
                  "text": "You misspelled Alabamistan.",
                  "timestamp": "2021-10-19 15:41:02",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "hh5ymhd",
              "text": "She’s an adult now which is why. The baby is 13ish and mom would be 27ish. \n\nBut yes. There’s parental consent for underage marriage but not divorce. You’re stuck until you are of age. Also, domestic violence shelters won’t take teenage wives and youth shelters often send kids back to the parents that married them off",
              "timestamp": "2021-10-18 22:45:40",
              "score": 9,
              "num_children": 1,
              "author": 263869,
              "replies": [
                {
                  "id": "hh84cp2",
                  "text": "And they dropped her case because she was trying to get custody of said child. Makes you think her idiot parents have the kid. Or her rapist ex.",
                  "timestamp": "2021-10-19 12:32:13",
                  "score": 4,
                  "num_children": 0,
                  "author": 28665,
                  "replies": []
                }
              ]
            },
            {
              "id": "hh5qrjr",
              "text": "Oh, thats heartbreaking...",
              "timestamp": "2021-10-18 21:45:35",
              "score": 3,
              "num_children": 0,
              "author": 149510,
              "replies": []
            },
            {
              "id": "hh5mqo3",
              "text": "Is that true? I thought you were automatically legally emancipated if you got married.",
              "timestamp": "2021-10-18 21:15:26",
              "score": 1,
              "num_children": 0,
              "author": 202533,
              "replies": []
            },
            {
              "id": "hh78c9i",
              "text": "WOW I don't know if I could go back and live with my parents if they did that to me.  I wish she had someone who could and would help her out.",
              "timestamp": "2021-10-19 05:24:30",
              "score": 1,
              "num_children": 0,
              "author": 130928,
              "replies": []
            },
            {
              "id": "hh8hele",
              "text": "Frankly, I want someone to ask the girl which, if any, of the three she wants left alive. Then make it happen.",
              "timestamp": "2021-10-19 14:20:09",
              "score": 1,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hh9k35v",
              "text": "Exactly. Poor Girl if she's able to should cut both them and her rapist out of her life for good.",
              "timestamp": "2021-10-19 18:43:21",
              "score": 1,
              "num_children": 0,
              "author": 164148,
              "replies": []
            }
          ]
        },
        {
          "id": "hh4xrjh",
          "text": "The saddest part about this is the parents. On the rapist vs victim angle, they sided with the rapist instead of their own daughter.  My guess would be they didn't want to embarrass the pastor or the church in front of the community so they did what they did. I hope that girl got far away from all of them.",
          "timestamp": "2021-10-18 18:14:51",
          "score": 120,
          "num_children": 1,
          "author": 300996,
          "replies": [
            {
              "id": "hh521f6",
              "text": ">Religion is an insult to human dignity. With or without it you would have good people doing good things and evil people doing evil things. But for good people to do evil things, that takes religion.\n\n\\-Steven Weinberg\n\nWhat else could possibly convince parents to side with their daughter's rapist.....smh",
              "timestamp": "2021-10-18 18:44:02",
              "score": 72,
              "num_children": 1,
              "author": 227874,
              "replies": [
                {
                  "id": "hh55t4w",
                  "text": "Steven Weinberg is my favorite but I'm a physics geek. I've read  probably all of his pop-sci books. Not for beginner geeks. I admire his integrity and wisdom as a physicist and outside of the world of physics.",
                  "timestamp": "2021-10-18 19:09:42",
                  "score": 7,
                  "num_children": 1,
                  "author": 19830,
                  "replies": [
                    {
                      "id": "hh8jou0",
                      "text": "Ever read any Feynmann? Now there's a wise dude.",
                      "timestamp": "2021-10-19 14:36:29",
                      "score": 1,
                      "num_children": 0,
                      "author": 40915,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hh4ux8u",
          "text": "I don't want to imagine how traumatized that poor girl must be.",
          "timestamp": "2021-10-18 17:55:23",
          "score": 41,
          "num_children": 0,
          "author": 267779,
          "replies": []
        },
        {
          "id": "hh5hq5z",
          "text": "Her parents should go to prison too.",
          "timestamp": "2021-10-18 20:31:06",
          "score": 23,
          "num_children": 1,
          "author": 343634,
          "replies": [
            {
              "id": "hh5khms",
              "text": "Too would suggest the rapist is going to jail, sadly he isn’t.",
              "timestamp": "2021-10-18 20:53:30",
              "score": 16,
              "num_children": 1,
              "author": 385934,
              "replies": [
                {
                  "id": "hh5mjyk",
                  "text": "No, I'm implying he *should* go to jail. I'm aware he sadly isn't.",
                  "timestamp": "2021-10-18 21:13:45",
                  "score": 9,
                  "num_children": 0,
                  "author": 343634,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hh553hj",
          "text": "\"With or without religion, good people can behave well and bad people can do evil; but for good people to do evil - that takes religion.\"",
          "timestamp": "2021-10-18 19:04:56",
          "score": 22,
          "num_children": 1,
          "author": 314394,
          "replies": [
            {
              "id": "hh7pz1r",
              "text": "Should we actually be calling these people 'good'.  It's  not like all racist, xenophobic and homicidal assholes are born that way from the womb.  These people clearly acquire a portion of their morality/immorality as they grow up.  So, why call these cunts  'good'. Why give such consideration only for the religiously indoctrinated.",
              "timestamp": "2021-10-19 09:39:23",
              "score": 1,
              "num_children": 0,
              "author": 168625,
              "replies": []
            }
          ]
        },
        {
          "id": "hh6isk8",
          "text": "I was forced to marry the 21 year old guy that raped me and got me pregnant when I was 14. In 1997, in New Mexico. This is actually still perfectly legal in most states.",
          "timestamp": "2021-10-19 01:27:08",
          "score": 10,
          "num_children": 1,
          "author": 104678,
          "replies": [
            {
              "id": "hh6ntxj",
              "text": "I’m sorry that happened to you, you didn’t deserve that.",
              "timestamp": "2021-10-19 02:07:35",
              "score": 5,
              "num_children": 0,
              "author": 385934,
              "replies": []
            }
          ]
        },
        {
          "id": "hh54ov7",
          "text": "If it was back in the Old Testament times that girl would also have to marry him.",
          "timestamp": "2021-10-18 19:02:15",
          "score": 5,
          "num_children": 2,
          "author": 183586,
          "replies": [
            {
              "id": "hh5x22m",
              "text": "She did marry him for a year apparently.",
              "timestamp": "2021-10-18 22:33:21",
              "score": 8,
              "num_children": 0,
              "author": 304000,
              "replies": []
            },
            {
              "id": "hh6f3fx",
              "text": "Yeah, but wouldn't the parents get paid, at least? In this case they didn't get *any* shekels!",
              "timestamp": "2021-10-19 00:57:55",
              "score": 1,
              "num_children": 0,
              "author": 311039,
              "replies": []
            }
          ]
        },
        {
          "id": "hh5ulfl",
          "text": "Her parents are equally brainwashed to pile horror upon horror.\n\nI'm sure religion had nothing to do with that. /s",
          "timestamp": "2021-10-18 22:14:18",
          "score": 4,
          "num_children": 0,
          "author": 140374,
          "replies": []
        },
        {
          "id": "hh64i9j",
          "text": "Religion precludes morality.  I've said this a couple of times on this sub, but; \n\n\nReligion supercedes an individuals moral compass and moral decisions with its own.   It gives a set of rules you MUST follow, whether they happen to line up with the 'best' action available in context or not.  And more importantly, it blackmails you into following its rules over your own with its infinite pain vs infinite pleasure heaven hell reward \n\n\nIf you give up company secrets, or rob a bank becaue they're going to murder your family (or a whole bunch of strangers) if you don't, is your crime really on you?  Well Christianity has that same gun to everyone's head.",
          "timestamp": "2021-10-18 23:32:43",
          "score": 2,
          "num_children": 0,
          "author": 221452,
          "replies": []
        },
        {
          "id": "hh77n2s",
          "text": "Stuff like this happens outside of religion all the same. I know of a guy who was 30 years old, impregnated a 14 yr old, and now they're married 20 some years later with 3 kids. Neither him, the girl, or her parents were religious. Dumb parents and pedos are everywhere.",
          "timestamp": "2021-10-19 05:16:04",
          "score": 2,
          "num_children": 0,
          "author": 313269,
          "replies": []
        },
        {
          "id": "hh54qya",
          "text": "Because of this sort of shit, I'm really inclined to investigate how to start an international vigilante group to indiscriminately go after rapist and pedophiles worldwide starting with the Vatican than India then worldwide. Bounties for the heads of rapist and pedophiles. Blatantly published on the front page of the national newspaper. 1 head of rapist US$10,000. 1 head of rapist pedophile US$15,000 + Diplomatic immunity.",
          "timestamp": "2021-10-18 19:02:39",
          "score": 5,
          "num_children": 1,
          "author": 292612,
          "replies": [
            {
              "id": "hh5rtfl",
              "text": "You would just get a bunch of Qanon shitbrains trying to turn in the heads of democrats.",
              "timestamp": "2021-10-18 21:53:19",
              "score": 7,
              "num_children": 0,
              "author": 194015,
              "replies": []
            }
          ]
        },
        {
          "id": "hh5z35q",
          "text": "Wait, her family was OKAY with it? Uhh.",
          "timestamp": "2021-10-18 22:49:18",
          "score": 1,
          "num_children": 0,
          "author": 371823,
          "replies": []
        },
        {
          "id": "hh68yba",
          "text": "What is going through those parents heads?",
          "timestamp": "2021-10-19 00:08:40",
          "score": 1,
          "num_children": 0,
          "author": 261313,
          "replies": []
        },
        {
          "id": "hh6l1xu",
          "text": "Their solution is literally in the Bible. \n\n> If a man happens to meet a virgin who is not pledged to be married and rapes her and they are discovered,(A) 29 he shall pay her father fifty shekels[a] of silver. He must marry the young woman, for he has violated her. He can never divorce her as long as he lives.\n\n> Deuteronomy 22:28-29",
          "timestamp": "2021-10-19 01:45:01",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hh6mky6",
          "text": "I swear this is from an episode L&O SVU that I saw years ago.",
          "timestamp": "2021-10-19 01:57:15",
          "score": 1,
          "num_children": 0,
          "author": 205205,
          "replies": []
        },
        {
          "id": "hh6oi13",
          "text": "I know someone who impregnated a 15 year old when they were 23. Her parents invited him to move in. CPS  investigated and did nothing.",
          "timestamp": "2021-10-19 02:13:22",
          "score": 1,
          "num_children": 0,
          "author": 10578,
          "replies": []
        },
        {
          "id": "hh6wrlx",
          "text": "Hope when she's 18 she sues them into the poor house, I would. Seriously, her parents are fucking vile humans who literally gave their daughter to a predator, WILLINGLY",
          "timestamp": "2021-10-19 03:23:21",
          "score": 1,
          "num_children": 0,
          "author": 159749,
          "replies": []
        },
        {
          "id": "hh7duad",
          "text": "Is why i vow to deestablish the christian religion before i die. Any \"good\" christan i have met is a shit person who doesnt care about anything outside of how to benefit themselves. The bible literally tells those who are fortunate to help tho who are not. Donald is a christan who banned immigration to a country built upon immigration due to his own beleifs. Anyone who says America should reject people seeking a better life is not an American, but a cultist of hatred.",
          "timestamp": "2021-10-19 06:36:19",
          "score": 1,
          "num_children": 0,
          "author": 331624,
          "replies": []
        },
        {
          "id": "hh7fsws",
          "text": "Not only that, what kind of shitty legal system would then not get in jail someone after that?! In my country he would be 100% on jail and probably, if he's  not on a special prison for pedofiles and rapist, he would be killed by other inmates. In Madrid, for example, in one prison they have what is called \" The fountain of the rapist\" and you can imagine that the name is not because they want to conmemorate this inmates.",
          "timestamp": "2021-10-19 07:04:16",
          "score": 1,
          "num_children": 0,
          "author": 216886,
          "replies": []
        },
        {
          "id": "hh7giw2",
          "text": "I bet these same people scream when they see anyone remotely brown because SHARIA LAW!",
          "timestamp": "2021-10-19 07:14:57",
          "score": 1,
          "num_children": 0,
          "author": 15321,
          "replies": []
        },
        {
          "id": "hh7hdgo",
          "text": "Don't worry, he got his religious exemption",
          "timestamp": "2021-10-19 07:27:43",
          "score": 1,
          "num_children": 0,
          "author": 100798,
          "replies": []
        },
        {
          "id": "hh7i06h",
          "text": ">Alabama home of a family with a 14-year-old girl. Greathouse eventually raped that girl and impregnated her. At the urging of her parents, the two of them got married.\n\nAnd there's some idiots out there that believe child marriage doesn't exist anymore",
          "timestamp": "2021-10-19 07:37:15",
          "score": 1,
          "num_children": 0,
          "author": 24310,
          "replies": []
        },
        {
          "id": "hh8h96u",
          "text": "Time for people to take out the trash. The only question is if parents should go with him.",
          "timestamp": "2021-10-19 14:19:02",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hh8nb5d",
          "text": "Joseph Smith.",
          "timestamp": "2021-10-19 15:02:06",
          "score": 1,
          "num_children": 0,
          "author": 319570,
          "replies": []
        },
        {
          "id": "hh8u69u",
          "text": "How the fuck can you get legally consent to marriage when you are too young to legally consent to sex? What?",
          "timestamp": "2021-10-19 15:50:07",
          "score": 1,
          "num_children": 1,
          "author": 133844,
          "replies": [
            {
              "id": "hh8vuw2",
              "text": "I believe that in some states the minimum marriage age is 14 but if you are under 18/16 you need parental consent. Some places may have an additional step of judicial review of that parental consent.\n\nIt looks like Alabama sets a hard minimum age of 16 though so maybe the \"marriage\" was done in another state or was only a religious ceremony rather than a legal marriage.\n\nhttps://theamm.org/marriage-laws/alabama",
              "timestamp": "2021-10-19 16:01:53",
              "score": 1,
              "num_children": 0,
              "author": 385934,
              "replies": []
            }
          ]
        },
        {
          "id": "hh8utc4",
          "text": "This is exactly the kind of shit Hitch was talking about when he said, \"religion poisons everything\".\n\nReligion is what made these parents invite a 24y.o. man into their home with their 14y.o. daughter and trust him alone with her and what made them think forced marriage was the proper response to his raping her.\n\nI just can't anymore with these fucking people, man.",
          "timestamp": "2021-10-19 15:54:35",
          "score": 1,
          "num_children": 0,
          "author": 103163,
          "replies": []
        },
        {
          "id": "hktvd3s",
          "text": "Honestly Christian or not that’s effed up! I don’t care if he’s a pastor any pedo deserves to serve time if not snipped.",
          "timestamp": "2021-11-16 07:52:32",
          "score": 1,
          "num_children": 1,
          "author": 162331,
          "replies": [
            {
              "id": "hkusjv8",
              "text": "Yes, but without her parents religious beliefs, she would not have been forced to \"marry\" her rapist. Having to \"marry\" him meant he was able to continue abusing her with her parents blessing; which obviously made the whole thing far worse.",
              "timestamp": "2021-11-16 14:15:40",
              "score": 2,
              "num_children": 1,
              "author": 385934,
              "replies": [
                {
                  "id": "hkuswxx",
                  "text": "That’s wild, is he still a pastor?",
                  "timestamp": "2021-11-16 14:18:34",
                  "score": 1,
                  "num_children": 0,
                  "author": 162331,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hh6eqmh",
          "text": "This goes beyond religion. This is **catastrophic** failure of law and order and the civil government intended to keep it in place.",
          "timestamp": "2021-10-19 00:55:04",
          "score": 0,
          "num_children": 1,
          "author": 274869,
          "replies": [
            {
              "id": "hh6lbap",
              "text": "While yes, there is more that failed this girl here than religion, the parents solution is literally in the Bible",
              "timestamp": "2021-10-19 01:47:08",
              "score": 3,
              "num_children": 1,
              "replies": [
                {
                  "id": "hh6ltyl",
                  "text": "OK, but I don't want anyone looking to the Bible for legal recourse or solutions. The whole point of civil, secular government is to protect us from endless homespun reinterpretations of what the Bible says.",
                  "timestamp": "2021-10-19 01:51:11",
                  "score": 1,
                  "num_children": 0,
                  "author": 274869,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hh4tgkv",
      "text": "JASON GREATHOUSE, is that his name? What was it again, JASON GREATHOUSE",
      "timestamp": "2021-10-18 17:45:31",
      "score": 737,
      "num_children": 11,
      "author": 412488,
      "replies": [
        {
          "id": "hh5nos4",
          "text": "[deleted]",
          "timestamp": "2021-10-18 21:23:03",
          "score": 356,
          "num_children": 4,
          "replies": [
            {
              "id": "hh5wsfi",
              "text": "Please, everyone, let's get this going along with the Brock \"the rapist\" Turner thing!",
              "timestamp": "2021-10-18 22:31:17",
              "score": 126,
              "num_children": 1,
              "author": 132390,
              "replies": [
                {
                  "id": "hh699gm",
                  "text": "You mean the Jason Greathouse who moved in with a family with the (likely) express intention to rape and impregnate their 14y/o daughter? *That* Jason Greathouse?\n\n(did I do it right?)",
                  "timestamp": "2021-10-19 00:11:11",
                  "score": 131,
                  "num_children": 3,
                  "author": 308243,
                  "replies": [
                    {
                      "id": "hh7ggoa",
                      "text": "Perfect",
                      "timestamp": "2021-10-19 07:14:04",
                      "score": 11,
                      "num_children": 0,
                      "author": 15321,
                      "replies": []
                    },
                    {
                      "id": "hh85kau",
                      "text": "Yes, the rapist Jason Greathouse",
                      "timestamp": "2021-10-19 12:43:25",
                      "score": 1,
                      "num_children": 0,
                      "author": 56548,
                      "replies": []
                    },
                    {
                      "id": "hh8h7si",
                      "text": "I feel a sudden urge to design a special advertisement poster for the one and only child rapist  THE JASON GREATHOUSE and distribute it on the streets (and in religious conventions of course)",
                      "timestamp": "2021-10-19 14:18:44",
                      "score": 1,
                      "num_children": 1,
                      "author": 232179,
                      "replies": [
                        {
                          "id": "hhee85s",
                          "text": "Like that one guy says in almost every Adam Sandler movie: do eeeeeeet.",
                          "timestamp": "2021-10-20 19:27:12",
                          "score": 1,
                          "num_children": 0,
                          "author": 308243,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hh7yyij",
              "text": "Wait, are we talking about the pedophile Jason Greathouse? That rapy Greathouse?",
              "timestamp": "2021-10-19 11:37:06",
              "score": 13,
              "num_children": 1,
              "replies": [
                {
                  "id": "hh8frqi",
                  "text": "Yep, THAT Jason Greathouse. The pedophile pastor who raped a 14 year old and impregnated her. Pure definition of 'hide yo' wife, hide yo' kids' right here.",
                  "timestamp": "2021-10-19 14:07:44",
                  "score": 9,
                  "num_children": 0,
                  "author": 160989,
                  "replies": []
                }
              ]
            },
            {
              "id": "hh7rppn",
              "text": "I wonder if the rapist Jason Greathouse knows the rapist Brock Turner",
              "timestamp": "2021-10-19 10:05:13",
              "score": 4,
              "num_children": 0,
              "author": 156752,
              "replies": []
            },
            {
              "id": "hh8a2pi",
              "text": "Jason \"chestor\" greathouse?",
              "timestamp": "2021-10-19 13:22:31",
              "score": 2,
              "num_children": 0,
              "author": 52621,
              "replies": []
            }
          ]
        },
        {
          "id": "hh5yuxa",
          "text": "Holy shit, I went to college with a Jason Greathouse. He's 40, but still, what a shitty person to get mistaken for.",
          "timestamp": "2021-10-18 22:47:30",
          "score": 52,
          "num_children": 1,
          "author": 191191,
          "replies": [
            {
              "id": "hh83yn5",
              "text": "Holy shit, I went to elementary school with a Jason House.   He wasn’t very great, in fact I think he’s in a dead end job at Walmart right now, was a good guy though.",
              "timestamp": "2021-10-19 12:28:30",
              "score": 5,
              "num_children": 1,
              "author": 210382,
              "replies": [
                {
                  "id": "hh8nlnq",
                  "text": "Jason Goodhouse",
                  "timestamp": "2021-10-19 15:04:09",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hh4zwud",
          "text": "It sounds like the name of a human being, but apparently anything can be named that.",
          "timestamp": "2021-10-18 18:29:34",
          "score": 100,
          "num_children": 0,
          "author": 385934,
          "replies": []
        },
        {
          "id": "hh7gfmc",
          "text": "Child rapist Jason Greathouse?",
          "timestamp": "2021-10-19 07:13:37",
          "score": 19,
          "num_children": 1,
          "author": 15321,
          "replies": [
            {
              "id": "hh7q2cn",
              "text": "Jason Greathouse, the child rapist?? That guy? The guy who raped a 14 year old and got away with it? That Jason Greathouse, the child rapist???",
              "timestamp": "2021-10-19 09:40:45",
              "score": 18,
              "num_children": 0,
              "author": 287747,
              "replies": []
            }
          ]
        },
        {
          "id": "hh5qeij",
          "text": "I'd bet money that's not his original last name.",
          "timestamp": "2021-10-18 21:42:58",
          "score": 13,
          "num_children": 1,
          "author": 207011,
          "replies": [
            {
              "id": "hh6gtbh",
              "text": "You mean GREATHOUSE? That last name?",
              "timestamp": "2021-10-19 01:11:36",
              "score": 19,
              "num_children": 2,
              "author": 412488,
              "replies": [
                {
                  "id": "hh7fdrx",
                  "text": "Full name Greathouse The Child Rapist. As in Jason Greathouse The Child Rapist.",
                  "timestamp": "2021-10-19 06:58:03",
                  "score": 6,
                  "num_children": 0,
                  "author": 300827,
                  "replies": []
                },
                {
                  "id": "hh7mldd",
                  "text": "Who, JASON? JASON GREATHOUSE?",
                  "timestamp": "2021-10-19 08:47:54",
                  "score": 2,
                  "num_children": 0,
                  "author": 55131,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hh7rsoe",
          "text": "Yes the Christian pedophile child molesting rapist. Be a damn shame if someone were to beat his ass",
          "timestamp": "2021-10-19 10:06:19",
          "score": 9,
          "num_children": 1,
          "replies": [
            {
              "id": "hh8012b",
              "text": "Not looking for violence, but we need a registry for when it doesn’t happen the way it should",
              "timestamp": "2021-10-19 11:48:33",
              "score": 0,
              "num_children": 1,
              "author": 412488,
              "replies": [
                {
                  "id": "hh80fwe",
                  "text": "Its called registering as a sex offender and the state sponsored judge sparing him of that inconvenience. Right because rape isn’t the most violent thing you can do to someone. He should be spared violence, as he was spared jail. And the neighborhood he lives in is spared his sex offense registration. Spare Me.",
                  "timestamp": "2021-10-19 11:52:53",
                  "score": 3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hh92nbz",
                      "text": "Exactly. Ugh.",
                      "timestamp": "2021-10-19 16:48:03",
                      "score": 1,
                      "num_children": 0,
                      "author": 412488,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hh5uto0",
          "text": "I could've sworn I read it was Jason Rapedick",
          "timestamp": "2021-10-18 22:16:03",
          "score": 21,
          "num_children": 0,
          "author": 247399,
          "replies": []
        },
        {
          "id": "hh6q8ah",
          "text": "Guess someone’s gonna have to find and kill the sack of shit",
          "timestamp": "2021-10-19 02:27:49",
          "score": 12,
          "num_children": 1,
          "author": 25302,
          "replies": [
            {
              "id": "hh8052y",
              "text": "Not looking for violence. We are just providing the sex offenders registry so others are protected.",
              "timestamp": "2021-10-19 11:49:44",
              "score": 0,
              "num_children": 0,
              "author": 412488,
              "replies": []
            }
          ]
        },
        {
          "id": "hh6i66m",
          "text": "Mr Greathouse, that’s his name, that name again is Mr Greathouse.",
          "timestamp": "2021-10-19 01:22:20",
          "score": 1,
          "num_children": 0,
          "author": 117285,
          "replies": []
        },
        {
          "id": "hh812vz",
          "text": "Can we get a rolling school of names going across the bottom of every post so all can be remembered in their desired glory forever. Amen.",
          "timestamp": "2021-10-19 11:59:35",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hh8nau1",
          "text": "JASON GREATHOUSEGUEST",
          "timestamp": "2021-10-19 15:02:02",
          "score": 1,
          "num_children": 0,
          "author": 124342,
          "replies": []
        }
      ]
    },
    {
      "id": "hh4nfz0",
      "text": "What the fuck",
      "timestamp": "2021-10-18 17:04:02",
      "score": 441,
      "num_children": 5,
      "replies": [
        {
          "id": "hh4ode1",
          "text": "Don't you know that being able to fuck 14-year-old girls is a \"deeply-held\" belief that warrants a religious exemption? Get with the program, dude!",
          "timestamp": "2021-10-18 17:10:24",
          "score": 263,
          "num_children": 3,
          "author": 260820,
          "replies": [
            {
              "id": "hh6g932",
              "text": "Mormons are with that program!",
              "timestamp": "2021-10-19 01:07:04",
              "score": 26,
              "num_children": 0,
              "author": 219877,
              "replies": []
            },
            {
              "id": "hh6vxof",
              "text": "Lol it's the core reason many religions exist. \"I get to fuck your daughter because God says so\" basically.",
              "timestamp": "2021-10-19 03:16:11",
              "score": 8,
              "num_children": 1,
              "replies": [
                {
                  "id": "hh8oqem",
                  "text": "Now don't forget to pay your tithes and offerings to me,  er, god.",
                  "timestamp": "2021-10-19 15:12:10",
                  "score": 3,
                  "num_children": 0,
                  "author": 266408,
                  "replies": []
                }
              ]
            },
            {
              "id": "hh8bm69",
              "text": "I mean, isn't it?",
              "timestamp": "2021-10-19 13:35:13",
              "score": 1,
              "num_children": 0,
              "author": 52730,
              "replies": []
            }
          ]
        },
        {
          "id": "hh55vvw",
          "text": "What the fuck is right.",
          "timestamp": "2021-10-18 19:10:13",
          "score": 20,
          "num_children": 0,
          "author": 19830,
          "replies": []
        },
        {
          "id": "hh5xeg0",
          "text": "Alabama",
          "timestamp": "2021-10-18 22:36:00",
          "score": 15,
          "num_children": 1,
          "author": 123696,
          "replies": [
            {
              "id": "hh6co59",
              "text": "Where laws are actually just suggestions.",
              "timestamp": "2021-10-19 00:38:40",
              "score": 4,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hh5fkzu",
          "text": "What the ACTUAL FUCK!",
          "timestamp": "2021-10-18 20:16:23",
          "score": 13,
          "num_children": 0,
          "author": 164327,
          "replies": []
        },
        {
          "id": "hh6oa6g",
          "text": "It’s Alabama, standard bearer for shittiest state in the US, typically with Missouri and West Virginia. Roll tide.",
          "timestamp": "2021-10-19 02:11:29",
          "score": 1,
          "num_children": 0,
          "author": 64605,
          "replies": []
        }
      ]
    },
    {
      "id": "hh4umtk",
      "text": "OMG the parents force her to marry him too!!",
      "timestamp": "2021-10-18 17:53:27",
      "score": 284,
      "num_children": 8,
      "author": 162187,
      "replies": [
        {
          "id": "hh6pd0o",
          "text": "First, they invite a child rapist to live with them. Granted, they probably didn't know that at the time. But then, their child is raped and impregnated. So they force her to marry her rapist, as if the primary concern is birthing a child outside of marriage rather than the fact that their daughter was raped.\n\nSo, so fucked up.",
          "timestamp": "2021-10-19 02:20:33",
          "score": 39,
          "num_children": 1,
          "author": 126726,
          "replies": [
            {
              "id": "hh982dj",
              "text": "that is part of the highly religious culture in the southern US",
              "timestamp": "2021-10-19 17:24:32",
              "score": 6,
              "num_children": 0,
              "author": 162187,
              "replies": []
            }
          ]
        },
        {
          "id": "hh56jl6",
          "text": "Not the brightest bunch.",
          "timestamp": "2021-10-18 19:14:43",
          "score": 72,
          "num_children": 4,
          "author": 252753,
          "replies": [
            {
              "id": "hh5qmzr",
              "text": "this reminds me of a saying (not agreeing with arson but...)\n\n\"the church that illuminates the most is a church in flames\"",
              "timestamp": "2021-10-18 21:44:41",
              "score": 41,
              "num_children": 0,
              "author": 162187,
              "replies": []
            },
            {
              "id": "hh5c0vl",
              "text": "Inhumane asshole more like.  \n\nBut also not bright.",
              "timestamp": "2021-10-18 19:51:54",
              "score": 61,
              "num_children": 0,
              "author": 169379,
              "replies": []
            },
            {
              "id": "hh5ks6s",
              "text": "Sleep well knowing they out reproduce us.",
              "timestamp": "2021-10-18 20:56:11",
              "score": 10,
              "num_children": 2,
              "replies": [
                {
                  "id": "hh7idxg",
                  "text": "I used to worry about that but they also die at a far greater rate. Especially recently.",
                  "timestamp": "2021-10-19 07:43:09",
                  "score": 1,
                  "num_children": 0,
                  "author": 20339,
                  "replies": []
                },
                {
                  "id": "hh7tsz8",
                  "text": "Well yeah. Who the fuck would want to bring a child into a world where THAT THING resides in and is allowed to roam free?\n\nBesides other THINGS like THAT THING.",
                  "timestamp": "2021-10-19 10:34:13",
                  "score": 1,
                  "num_children": 0,
                  "author": 241674,
                  "replies": []
                }
              ]
            },
            {
              "id": "hh5zc6o",
              "text": "Alabama was it?",
              "timestamp": "2021-10-18 22:51:17",
              "score": 1,
              "num_children": 0,
              "author": 364326,
              "replies": []
            }
          ]
        },
        {
          "id": "hh63vz6",
          "text": "Child marriage is legal in a majority of the states. And those that made it illegal did so recently. This country is a damn 3rd world backwards country in so many scary ways.",
          "timestamp": "2021-10-18 23:27:47",
          "score": 12,
          "num_children": 2,
          "author": 242458,
          "replies": [
            {
              "id": "hh8ner2",
              "text": "This definitely wouldn't fly in Virginia. I don't know all the legality, but it's a \"strict liability\" state for statutory, meaning no matter the excuse, it's illegal. I think there is some sort of close -age exemption (so a guy who just turned 18 last week won't go to jail of his girlfriend is 17), but 24 & 14 would be inexcusable.",
              "timestamp": "2021-10-19 15:02:49",
              "score": 1,
              "num_children": 0,
              "author": 48442,
              "replies": []
            },
            {
              "id": "hh8pdr9",
              "text": "Okay, but are there places in the world where this has been illegal for a very long time? Say, over 100 years?",
              "timestamp": "2021-10-19 15:16:43",
              "score": 1,
              "num_children": 1,
              "author": 266408,
              "replies": [
                {
                  "id": "hh97wkj",
                  "text": "your point? it is still happening on a 1st world country.",
                  "timestamp": "2021-10-19 17:23:28",
                  "score": 1,
                  "num_children": 1,
                  "author": 162187,
                  "replies": [
                    {
                      "id": "hh9cssy",
                      "text": "That's it's a human problem that has plagued people throughout history. It's horrific but sadly, it's also normal.",
                      "timestamp": "2021-10-19 17:55:45",
                      "score": 1,
                      "num_children": 0,
                      "author": 266408,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hh6pelm",
          "text": "They are really following Deuteronomy 22:28-29",
          "timestamp": "2021-10-19 02:20:55",
          "score": 7,
          "num_children": 1,
          "author": 153547,
          "replies": [
            {
              "id": "hh9882b",
              "text": "yup\n\nbecause women has no agency in traditional christianity",
              "timestamp": "2021-10-19 17:25:35",
              "score": 1,
              "num_children": 0,
              "author": 162187,
              "replies": []
            }
          ]
        },
        {
          "id": "hh5x2wv",
          "text": "Was about to post something like \"Now we play the waiting game until one of the parents kill him\", but saw this... I dont think that is happening any time soon.",
          "timestamp": "2021-10-18 22:33:32",
          "score": 4,
          "num_children": 1,
          "author": 254040,
          "replies": [
            {
              "id": "hh97g0p",
              "text": "no, also the woman is now in her late 20's",
              "timestamp": "2021-10-19 17:20:25",
              "score": 2,
              "num_children": 0,
              "author": 162187,
              "replies": []
            }
          ]
        },
        {
          "id": "hh7k7oi",
          "text": "Didnt want her to have the baby out of wedlock obviously.",
          "timestamp": "2021-10-19 08:11:28",
          "score": 2,
          "num_children": 0,
          "author": 250456,
          "replies": []
        },
        {
          "id": "hh5xdar",
          "text": "Lol... I thought only muslims are that brain damaged this days...\nIts like a contest of religions it seems",
          "timestamp": "2021-10-18 22:35:45",
          "score": 5,
          "num_children": 1,
          "author": 329600,
          "replies": [
            {
              "id": "hh7tkdv",
              "text": "You're a real big \"generalizer\" aren't ya? Jews, Muslims, Austrians. You got a stereotype for them all. \n\nBTW arranged/forced marriage isn't exclusive to the Quran at all. It's pretty big in any given Christian cult as well.",
              "timestamp": "2021-10-19 10:31:01",
              "score": 0,
              "num_children": 2,
              "author": 255732,
              "replies": [
                {
                  "id": "hh97kff",
                  "text": "you are correct, there are still laws in the US that allow this type of marriages",
                  "timestamp": "2021-10-19 17:21:14",
                  "score": 1,
                  "num_children": 0,
                  "author": 162187,
                  "replies": []
                },
                {
                  "id": "hh7u103",
                  "text": "yeah.... looks like you dont understand propositional logic.\n\nDon't mind, a lot of people dont ;)",
                  "timestamp": "2021-10-19 10:37:06",
                  "score": -1,
                  "num_children": 1,
                  "author": 329600,
                  "replies": [
                    {
                      "id": "hh7ue9i",
                      "text": "Lmao you're so pretentious\n\nYour answer doesn't provide anything of value but trying to use big math words in your tiny primate brain and then turn around and instantly insult and assume to make yourself seem so much more intelligent and on the higher ground and it's comical. Go practice sword fight in the backyard, neckbeard.",
                      "timestamp": "2021-10-19 10:42:01",
                      "score": 1,
                      "num_children": 0,
                      "author": 255732,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hh7kg4t",
          "text": "No fucking way!",
          "timestamp": "2021-10-19 08:15:03",
          "score": 1,
          "num_children": 1,
          "author": 84929,
          "replies": [
            {
              "id": "hh98dsv",
              "text": "that is what the article says",
              "timestamp": "2021-10-19 17:26:40",
              "score": 1,
              "num_children": 0,
              "author": 162187,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hh4p4mc",
      "text": "he do be workin in mysterious ways",
      "timestamp": "2021-10-18 17:15:35",
      "score": 90,
      "num_children": 1,
      "author": 221493,
      "replies": [
        {
          "id": "hh4r761",
          "text": "And his jeans do be tight",
          "timestamp": "2021-10-18 17:29:52",
          "score": 23,
          "num_children": 0,
          "author": 58707,
          "replies": []
        }
      ]
    },
    {
      "id": "hh5e7cv",
      "text": "\"Plea deal in bizarre rape case\"This isn't a bizarre rape case. This is a fking classic rape case, where once again the \"man of God\" gets away with horrific crimes, when the rapist should have been buried under the full weight of the law. Instead, he was protected and the girl's horrific pain is deemed \"bizarre\" or \"unusual\". It happens CONSTANTLY. All pastors should be treated like high-risk individuals.",
      "timestamp": "2021-10-18 20:06:49",
      "score": 83,
      "num_children": 1,
      "author": 16878,
      "replies": [
        {
          "id": "hh5kkoc",
          "text": "At least they used the word, rape but I don't know why it's bizarre either.",
          "timestamp": "2021-10-18 20:54:16",
          "score": 15,
          "num_children": 1,
          "author": 401442,
          "replies": [
            {
              "id": "hh8pkd1",
              "text": "Bizarre because instead of dealing with parents who want to kill the guy, they're like here, go get married.",
              "timestamp": "2021-10-19 15:18:00",
              "score": 3,
              "num_children": 1,
              "author": 266408,
              "replies": [
                {
                  "id": "hh8utoq",
                  "text": "Deuteronomy 22:28–\n28 If a man happens to meet a virgin who is not pledged to be married and rapes her and they are discovered, 29 he shall pay her father fifty shekels of silver. He must marry the young woman, for he has violated her. He can never divorce her as long as he lives.\n\n\nNot bizarre or uncommon enough for people to still have this mindset, it seems.",
                  "timestamp": "2021-10-19 15:54:39",
                  "score": 4,
                  "num_children": 1,
                  "author": 133844,
                  "replies": [
                    {
                      "id": "hh9491r",
                      "text": "No, still bizarre.",
                      "timestamp": "2021-10-19 16:58:48",
                      "score": 1,
                      "num_children": 0,
                      "author": 266408,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hh53jkm",
      "text": "You know how the Q tips think the world is run by a powerful cabal of pedophiles? What if they're right but it's the Christian leadership?",
      "timestamp": "2021-10-18 18:54:23",
      "score": 222,
      "num_children": 7,
      "author": 169836,
      "replies": [
        {
          "id": "hh5gbmi",
          "text": "Precisely why they project so loudly...",
          "timestamp": "2021-10-18 20:21:25",
          "score": 123,
          "num_children": 1,
          "author": 210343,
          "replies": [
            {
              "id": "hh61i3c",
              "text": "They also care so deeply about abused children that they use whataboutism to defend their chosen pedophiles",
              "timestamp": "2021-10-18 23:08:42",
              "score": 24,
              "num_children": 0,
              "author": 261939,
              "replies": []
            }
          ]
        },
        {
          "id": "hh5dxaj",
          "text": "It is.",
          "timestamp": "2021-10-18 20:04:55",
          "score": 66,
          "num_children": 0,
          "author": 106494,
          "replies": []
        },
        {
          "id": "hh6e88j",
          "text": "[deleted]",
          "timestamp": "2021-10-19 00:51:05",
          "score": 16,
          "num_children": 1,
          "replies": [
            {
              "id": "hh6eje4",
              "text": "I'm sure it's happened. I can't place when it was though",
              "timestamp": "2021-10-19 00:53:31",
              "score": 5,
              "num_children": 1,
              "author": 169836,
              "replies": [
                {
                  "id": "hh79fsg",
                  "text": "I believe the year was 19 odd 6, I remember because I paid a nickel to take the ferry that year to visit the worlds fair in Brussels. It was also the year I received a delightful comment from my stagecoach driver regarding the onion on my belt, which was the style at the time.",
                  "timestamp": "2021-10-19 05:38:13",
                  "score": 2,
                  "num_children": 0,
                  "author": 63035,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hh5go2u",
          "text": "https://youtube.com/watch?v=7Tu8Y5g8pXg&t=39",
          "timestamp": "2021-10-18 20:23:48",
          "score": 15,
          "num_children": 1,
          "author": 274542,
          "replies": [
            {
              "id": "hh5h4la",
              "text": "Louis CK is still a POS, but this video really is on point",
              "timestamp": "2021-10-18 20:26:56",
              "score": 7,
              "num_children": 1,
              "author": 169836,
              "replies": [
                {
                  "id": "hh613fc",
                  "text": "I forgot he was canceled.",
                  "timestamp": "2021-10-18 23:05:26",
                  "score": -2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hh6i1r3",
                      "text": "[deleted]",
                      "timestamp": "2021-10-19 01:21:19",
                      "score": -1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hh6k9qr",
                          "text": "Umm.  [No.](https://www.vulture.com/2019/11/louis-c-k-accuser-speaks-out-on-consent.html) That's completely wrong.",
                          "timestamp": "2021-10-19 01:38:44",
                          "score": 3,
                          "num_children": 1,
                          "author": 169836,
                          "replies": [
                            {
                              "id": "hh6katq",
                              "text": "It seems that your comment contains 1 or more links that are hard to tap for mobile users. \nI will extend those so they're easier for our sausage fingers to click!\n\n\n[Here is link number 1 - Previous text \"No.\"](https://www.vulture.com/2019/11/louis-c-k-accuser-speaks-out-on-consent.html)\n\n\n\n----\n^Please ^PM ^[\\/u\\/eganwall](http://reddit.com/user/eganwall) ^with ^issues ^or ^feedback! ^| ^[Code](https://github.com/eganwall/FatFingerHelperBot) ^| ^[Delete](https://reddit.com/message/compose/?to=FatFingerHelperBot&subject=delete&message=delete%20hh6katq)",
                              "timestamp": "2021-10-19 01:38:58",
                              "score": 1,
                              "num_children": 0,
                              "author": 325436,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hh80wvn",
          "text": "It took about 24 hours for the Q-Nuts to decide that when Trump said he wished Ghislaine Maxwell well it was a secret code where he meant the opposite. They picked pedophilia because it's an easy thing to oppose but deep down they literally don't care about child rape one bit.",
          "timestamp": "2021-10-19 11:57:50",
          "score": 2,
          "num_children": 0,
          "author": 212033,
          "replies": []
        },
        {
          "id": "hh6ff4m",
          "text": "So, this is kinda random and off subject to some extent, but if you would be so kind to oblige. I’ve been trying to look around and can’t find a direct answer, you seem like you may be more in tune to the crazy Q stuff(I try to avoid it). \n\nDo you know what white hat means? I’m only aware of the term in computer hacking. \n\nFor context to my question I ran into a guy I hadn’t seen in a couple years today and he said something like “yeah, we’re winning man, you know us white hatters” and proceeds to tell me about how Biden hasn’t stepped foot in the White House or DC for fear of being arrested, everything he does is filmed on a set in California, the military won’t let him in the White House and they’re having secret military tribunals in there. And apparently everyone is going to be surprised when this whole thing flips. That is an extremely condensed version and hit the main parts, and of course everything he said he heard directly from direct sources high up in the military.",
          "timestamp": "2021-10-19 01:00:31",
          "score": 1,
          "num_children": 3,
          "author": 410161,
          "replies": [
            {
              "id": "hh6h4pw",
              "text": "Honestly, I stopped following anything to do with them a while ago. Occasionally the really outlandish stuff like Mike Flynn saying they were putting the COVID vaccine in salad dressing breaks through, and that was just for laughs",
              "timestamp": "2021-10-19 01:14:06",
              "score": 2,
              "num_children": 0,
              "author": 169836,
              "replies": []
            },
            {
              "id": "hh6y49m",
              "text": "White hat is a general term that just means the good guys who are fighting against the bad guys (and the bad guys are the black hats.) It's a term used in a lot of contexts and fictional works. Q just uses white hat to mean the people who are fighting against the supposed evil global Satanist pedophile cabal. The people who do nothing but read about the conspiracy online also consider themselves warriors who are doing important work to fight against the cabal so they consider themselves white hats along with all the Republicans in the government and military that are supposedly fighting to expose and eliminate this evil cabal.",
              "timestamp": "2021-10-19 03:34:57",
              "score": 2,
              "num_children": 1,
              "author": 217162,
              "replies": [
                {
                  "id": "hh6z857",
                  "text": "Thanks. That helped explain it and kinda what I’ve been able to gather. I was just thrown off by his usage because kinda fitting your description this guy isn’t somebody making any kind of difference and I didn’t even realize during the convo he was full Q Anon, just thought he’s a delusional Conservative.",
                  "timestamp": "2021-10-19 03:45:09",
                  "score": 2,
                  "num_children": 0,
                  "author": 410161,
                  "replies": []
                }
              ]
            },
            {
              "id": "hh76qcb",
              "text": "also colored hats have kinda been a thing in politics lately.  It's not uncommon to call trump supporters \"red hats\" or yang supporters \"blue hats\"",
              "timestamp": "2021-10-19 05:05:13",
              "score": 1,
              "num_children": 0,
              "author": 248511,
              "replies": []
            }
          ]
        },
        {
          "id": "hh6yhhk",
          "text": "Confession is how they find out who to add to the club.\n\nI might be killed for this but it's okay I'd just come back again*.",
          "timestamp": "2021-10-19 03:38:17",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hh4qgym",
      "text": "Rules for thee not for me.",
      "timestamp": "2021-10-18 17:24:53",
      "score": 56,
      "num_children": 0,
      "author": 329888,
      "replies": []
    },
    {
      "id": "hh595aw",
      "text": "Something similar happened when I was a kid. We had a church school and my unemployed uncle was the “principal” because my grandfather was the preacher. Uncle was routinely raping a 14 year old who thought he was her boyfriend. He was a grown man with 2 sons. When the story broke, the girl’s parents didn’t even leave the church. Uncle kept his job. My sister and cousin, who revealed the situation by passing notes to each other, were punished. That uncle gave my 8th grade sister first grade work in retaliation. Dad & uncle made her feel like she was stupid and rebellious. She has 2 master’s degrees and still feels like she wasn’t very smart.",
      "timestamp": "2021-10-18 19:32:18",
      "score": 54,
      "num_children": 1,
      "author": 322339,
      "replies": [
        {
          "id": "hh5umn4",
          "text": "Did this ever get investigated by authorities?",
          "timestamp": "2021-10-18 22:14:33",
          "score": 10,
          "num_children": 1,
          "author": 207011,
          "replies": [
            {
              "id": "hh5xkz4",
              "text": "No, of course not. No one in the situation believed anything was wrong. Not the girl, her parents, or my dad’s family. It was just a bunch of hyperreligious people abusing children and raping them and screwing up our brains for life. (I was in 4th grade and was taught that my dad and his family spoke for god and no questioning was allowed. This was beaten into me for enough years that I turned off my brain for anything but books. High IQ, negative EQ.)",
              "timestamp": "2021-10-18 22:37:23",
              "score": 32,
              "num_children": 1,
              "author": 322339,
              "replies": [
                {
                  "id": "hh6165i",
                  "text": "Jesus. I'm so sorry you had to go through this shit.",
                  "timestamp": "2021-10-18 23:06:03",
                  "score": 10,
                  "num_children": 1,
                  "author": 207011,
                  "replies": [
                    {
                      "id": "hh61hen",
                      "text": "Thank you. I’ve recently realized I was raised in a cult and it’s effing with my current mental health. I feel like such an idiot for believing for so long, but abuse does that to you. My dad’s pet name for me was Useless. And he “spoke for god.”",
                      "timestamp": "2021-10-18 23:08:33",
                      "score": 11,
                      "num_children": 1,
                      "author": 322339,
                      "replies": [
                        {
                          "id": "hh61xw4",
                          "text": "You cannot blame yourself for being manipulated, brainwashed, and abused. You were a kid. And a victim.",
                          "timestamp": "2021-10-18 23:12:13",
                          "score": 12,
                          "num_children": 1,
                          "author": 207011,
                          "replies": [
                            {
                              "id": "hh63bl0",
                              "text": "Thank you. That helps.",
                              "timestamp": "2021-10-18 23:23:14",
                              "score": 7,
                              "num_children": 0,
                              "author": 322339,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hh4w839",
      "text": "How is it even legal that he married her?",
      "timestamp": "2021-10-18 18:04:14",
      "score": 58,
      "num_children": 3,
      "author": 350791,
      "replies": [
        {
          "id": "hh4wvt8",
          "text": "Many states allow child-marriage. All the parents have to do is give consent. Or, a judge can decide it's in the minor's \"best interests\". \n\nReligion is the driving force behind these laws. One of the many, many reasons I'm an Atheist.",
          "timestamp": "2021-10-18 18:08:44",
          "score": 118,
          "num_children": 4,
          "author": 184484,
          "replies": [
            {
              "id": "hh4xaq8",
              "text": "Before replying with \"Jesus America, get your shit together\" I quickly googled what the minimum age is in my country. It's 18.\n\nJesus America, get your shit together!",
              "timestamp": "2021-10-18 18:11:37",
              "score": 61,
              "num_children": 1,
              "author": 350791,
              "replies": [
                {
                  "id": "hh4yeam",
                  "text": "Only 4 states forbid a minor to get married. The rest hold the line @ around 15 for females and 16 for males. Some states require parental consent and judicial consent. Other restrictions include maxium number of years between parties and only one state explicitly refuses permission for anyone over 21 to marry a minor. \n\nSource: https://www.findlaw.com/family/marriage/state-by-state-marriage-age-of-consent-laws.html",
                  "timestamp": "2021-10-18 18:19:14",
                  "score": 35,
                  "num_children": 1,
                  "author": 184484,
                  "replies": [
                    {
                      "id": "hh5lfzy",
                      "text": "I find it very confusing that according to the list you provided, people can marry before they reach the age of consent. What? How? Why?!",
                      "timestamp": "2021-10-18 21:02:33",
                      "score": 15,
                      "num_children": 1,
                      "author": 38110,
                      "replies": [
                        {
                          "id": "hh6453r",
                          "text": "In TX, children as young as 14 can marry if they have parental consent. I taught an 8th grader who was being married off to a 21 year old man and forced to drop out of school. She wasn’t pregnant, and her parents were literally making her get married. But she told DCFS she wanted to, so no abuse was found. They cared more about her dropping out than about her getting married.",
                          "timestamp": "2021-10-18 23:29:48",
                          "score": 14,
                          "num_children": 1,
                          "author": 322339,
                          "replies": [
                            {
                              "id": "hh6fs9y",
                              "text": "It’s astounding to me that a judicial system can see no wrong with allowing marriage to people who are legally unable to consent. It’s right up there with people under 18 being allowed to serve in the military.",
                              "timestamp": "2021-10-19 01:03:26",
                              "score": 7,
                              "num_children": 0,
                              "author": 38110,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hh5ofo4",
              "text": "But even if it's \"legal\" to marry a 14 year old, isn't 14 still too young to give consent for sex? Wouldn't that be statutory rape? Either way that kids going to need a good amount of therapy which is the sad part. Knowing a young girl is going to have a hard life and having the ability to do something about it and choosing not too.",
              "timestamp": "2021-10-18 21:28:38",
              "score": 16,
              "num_children": 2,
              "author": 74421,
              "replies": [
                {
                  "id": "hh5p6r5",
                  "text": "Oh I agree completely. 14 is too young to make her own medical decisions, work, drive, drink, or smoke buutt she's old enough for sex, motherhood, and marriage?? \n\nReligion ruins so much.",
                  "timestamp": "2021-10-18 21:34:05",
                  "score": 25,
                  "num_children": 1,
                  "author": 184484,
                  "replies": [
                    {
                      "id": "hh99qiq",
                      "text": "When my daughter was 8 yrs old, the doctors clinic told me I could not get information on her Healthcare due to HIPAA laws. I said, \"she's relying on me for transportation and to pay her medical bills. The only thing I want to know is what time her appointment is so I can get her there on time\" they wouldn't tell me because she had made her own appointment. Crazy stuff happens when you least expect it. Apparently, at the age of 8, kids can make their own medical decisions in Minnesota.",
                      "timestamp": "2021-10-19 17:35:39",
                      "score": 1,
                      "num_children": 0,
                      "author": 34813,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hh6yf20",
                  "text": "Legally once you marry, age of consent laws no longer apply. So it's not illegal to have sex with a kid as long as you're legally married to the kid.",
                  "timestamp": "2021-10-19 03:37:41",
                  "score": 2,
                  "num_children": 1,
                  "author": 217162,
                  "replies": [
                    {
                      "id": "hh8885o",
                      "text": "You got a source on that? I can't find anything in reference when searching.",
                      "timestamp": "2021-10-19 13:06:55",
                      "score": 1,
                      "num_children": 0,
                      "author": 74421,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hh74ng2",
              "text": "> Or, a judge can decide it's in the minor's \"best interests\".\n\nIf a judge can't figure out the correct and moral way to handle a case like this, *they are not qualified to be judging anyone.*",
              "timestamp": "2021-10-19 04:41:18",
              "score": 3,
              "num_children": 1,
              "author": 259635,
              "replies": [
                {
                  "id": "hh759ph",
                  "text": "I agree.",
                  "timestamp": "2021-10-19 04:48:20",
                  "score": 1,
                  "num_children": 0,
                  "author": 184484,
                  "replies": []
                }
              ]
            },
            {
              "id": "hh765g4",
              "text": "Religions all seem to shield pedophiles, so to me, they are all pro-pedophile. No one should take any children anywhere near churches. There really isn't any reason for anyone to go unless you just want to feel controlled and abused.",
              "timestamp": "2021-10-19 04:58:29",
              "score": 1,
              "num_children": 0,
              "author": 159749,
              "replies": []
            }
          ]
        },
        {
          "id": "hh5fqkb",
          "text": "At one point, in Kentucky, there was no age limit on marriage if the bride is pregnant. That may have changed recently. There was a case of a female teacher, I think Mary Kay Letourneau, who married her 6th grade student before going to prison under this law.",
          "timestamp": "2021-10-18 20:17:27",
          "score": 13,
          "num_children": 1,
          "author": 81329,
          "replies": [
            {
              "id": "hh5y0qm",
              "text": "She's in Washington, not Kentucky. But if you really want her she's all yours",
              "timestamp": "2021-10-18 22:40:51",
              "score": 6,
              "num_children": 2,
              "author": 66360,
              "replies": [
                {
                  "id": "hh5y6qg",
                  "text": "I think the marriage was in Kentucky because the state law allowed her to marry a minor if she was pregnant. I could be mistaken. It could have been another teacher impregnated by her minor student.",
                  "timestamp": "2021-10-18 22:42:10",
                  "score": 7,
                  "num_children": 1,
                  "author": 81329,
                  "replies": [
                    {
                      "id": "hh67glj",
                      "text": "They married at a winery in Washington, so you must be thinking of another story",
                      "timestamp": "2021-10-18 23:56:33",
                      "score": 3,
                      "num_children": 0,
                      "author": 66360,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hh64a0i",
                  "text": "She’s deceased.",
                  "timestamp": "2021-10-18 23:30:53",
                  "score": 2,
                  "num_children": 1,
                  "author": 322339,
                  "replies": [
                    {
                      "id": "hh66w15",
                      "text": "I guess with Covid that story suddenly wasn't interesting anymore. KY can still claim story rights though",
                      "timestamp": "2021-10-18 23:51:53",
                      "score": 2,
                      "num_children": 0,
                      "author": 66360,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hh64dck",
          "text": "https://en.wikipedia.org/wiki/Child_marriage_in_the_United_States\n\nIt is really really fucking bad. Yet neither political party seems to want to change it on a federal level and very few on a state level. \n\nALL driven by religion.",
          "timestamp": "2021-10-18 23:31:37",
          "score": 1,
          "num_children": 0,
          "author": 242458,
          "replies": []
        }
      ]
    },
    {
      "id": "hh5u8hn",
      "text": "Sounds like this sick fuck needs a visit from the murder fairy",
      "timestamp": "2021-10-18 22:11:32",
      "score": 37,
      "num_children": 1,
      "replies": [
        {
          "id": "hh5w2k8",
          "text": "aaaaaand follow. wanna be friends?",
          "timestamp": "2021-10-18 22:25:40",
          "score": 7,
          "num_children": 0,
          "author": 100955,
          "replies": []
        }
      ]
    },
    {
      "id": "hh4okdb",
      "text": "Alabama ... what a shock",
      "timestamp": "2021-10-18 17:11:45",
      "score": 159,
      "num_children": 2,
      "author": 83020,
      "replies": [
        {
          "id": "hh5edri",
          "text": "Pastor ... what a shock",
          "timestamp": "2021-10-18 20:08:03",
          "score": 94,
          "num_children": 0,
          "author": 259680,
          "replies": []
        },
        {
          "id": "hh5uuom",
          "text": "Seriously giving /r/floridaman a run for his money",
          "timestamp": "2021-10-18 22:16:16",
          "score": 17,
          "num_children": 2,
          "author": 115155,
          "replies": [
            {
              "id": "hh70ojz",
              "text": "Bamaman is Floridaman on a mission from GAWD.\n\nFloridaman will burn your house down. Bamaman will burn your house down then tell you it’s your fault because the wage of sin is death an you’re going to HAIL.\n\n(Yeah it may be time for me to move.)",
              "timestamp": "2021-10-19 03:59:21",
              "score": 2,
              "num_children": 0,
              "author": 155500,
              "replies": []
            },
            {
              "id": "hh8im2f",
              "text": "This happened in Dothan AL, which is like 10 minutes from Florida lol",
              "timestamp": "2021-10-19 14:28:48",
              "score": 2,
              "num_children": 0,
              "author": 175017,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hh52m01",
      "text": "And people wonder why Atheists say that religion is dangerous and predatory. This right here is why I detest religion and tell people to go eat shit when they witness to me. Why would I worship a deity that allows such scumbags to go to heaven? It's like I say: all the murderers and rapists that found \"God\" while in prison will be in heaven according to their religion.",
      "timestamp": "2021-10-18 18:47:58",
      "score": 77,
      "num_children": 1,
      "author": 43450,
      "replies": [
        {
          "id": "hh64vok",
          "text": "wE'rE aLl SiNnErS sO tHe ImPoRtAnT tHiNg Is agreeing with us when we say the words we all say the words together say the words (not a cult).",
          "timestamp": "2021-10-18 23:35:41",
          "score": 11,
          "num_children": 0,
          "author": 373708,
          "replies": []
        }
      ]
    },
    {
      "id": "hh5hlxn",
      "text": "There are people who are on the sex offender list for taking a piss in bushes because the port-a-potty line was too long. And this piece of shit gets off scot-free.",
      "timestamp": "2021-10-18 20:30:15",
      "score": 24,
      "num_children": 0,
      "author": 343634,
      "replies": []
    },
    {
      "id": "hh5l0a0",
      "text": "Why do we even have statutory rape laws? Dude admitted to raping a 14 yo. There is no such thing as consent in that situation. What is there for the jury to debate?",
      "timestamp": "2021-10-18 20:58:17",
      "score": 21,
      "num_children": 1,
      "author": 260534,
      "replies": [
        {
          "id": "hh6f55i",
          "text": "[deleted]",
          "timestamp": "2021-10-19 00:58:18",
          "score": 9,
          "num_children": 1,
          "replies": [
            {
              "id": "hh8hfyb",
              "text": "So did some sane human being make that decision or do they randomly toss a coin to decide the charges these days?",
              "timestamp": "2021-10-19 14:20:26",
              "score": 1,
              "num_children": 0,
              "author": 232179,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hh51pid",
      "text": "This is the sort of miscarriage of justice that drives people to vigilantism.",
      "timestamp": "2021-10-18 18:41:46",
      "score": 19,
      "num_children": 0,
      "author": 35275,
      "replies": []
    },
    {
      "id": "hh5eql6",
      "text": "Yea, extreme Christianity starts to resemble extreme Islam.",
      "timestamp": "2021-10-18 20:10:32",
      "score": 17,
      "num_children": 1,
      "author": 239847,
      "replies": [
        {
          "id": "hh5vn5f",
          "text": "I'm surprised the parents didn't try and trade her for something.",
          "timestamp": "2021-10-18 22:22:23",
          "score": 3,
          "num_children": 1,
          "author": 219540,
          "replies": [
            {
              "id": "hhatoiq",
              "text": "They should of at least got their 50 sheckles of silver.",
              "timestamp": "2021-10-20 00:04:51",
              "score": 2,
              "num_children": 0,
              "author": 367584,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hh5bhb3",
      "text": "I want to skin him, drown him in a tub of salt and lemon and pop a nail in his toes and fingertips and watch him rot. People like these are the reason they make me go \"Fuck religion\". Seriously, fuck this shit.",
      "timestamp": "2021-10-18 19:48:14",
      "score": 14,
      "num_children": 0,
      "author": 260819,
      "replies": []
    },
    {
      "id": "hh4xq20",
      "text": "Religion is one hell of a drug.",
      "timestamp": "2021-10-18 18:14:34",
      "score": 39,
      "num_children": 1,
      "author": 216152,
      "replies": [
        {
          "id": "hh544mv",
          "text": "I prefer to call it stupidity",
          "timestamp": "2021-10-18 18:58:24",
          "score": 12,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hh4ryeo",
      "text": "This is just really sad",
      "timestamp": "2021-10-18 17:35:01",
      "score": 12,
      "num_children": 0,
      "author": 69421,
      "replies": []
    },
    {
      "id": "hh4xgoq",
      "text": "So, is he still working in the ministry?",
      "timestamp": "2021-10-18 18:12:46",
      "score": 9,
      "num_children": 1,
      "author": 28665,
      "replies": [
        {
          "id": "hh51ydm",
          "text": "Why you curious? You need some ministering to? (I'm being sarcastic, obviously, idiot youth pastor should have been tarred and feathered, driven out of town on a rail)",
          "timestamp": "2021-10-18 18:43:27",
          "score": 7,
          "num_children": 1,
          "author": 223053,
          "replies": [
            {
              "id": "hh53qa4",
              "text": "It says he's in Tennessee too, so I assume he had to flee to where he was less known. I just read so many stories of these rapists just moving to a new town. You think they'd be watching the Catholic church woes and try to be a little better.",
              "timestamp": "2021-10-18 18:55:40",
              "score": 9,
              "num_children": 0,
              "author": 28665,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hh5h308",
      "text": "Her parents should be in jail for child abuse too.",
      "timestamp": "2021-10-18 20:26:37",
      "score": 12,
      "num_children": 0,
      "author": 401442,
      "replies": []
    },
    {
      "id": "hh5ldxn",
      "text": "I live in Alabama. I'm from here. I was raised southern Baptist. Obviously I'm not anymore. \n\nThis entire state is a detriment to this country. We should light the entire state on fire.\n\nSame with southern baptism. Insular communities protect rapists and child abusers",
      "timestamp": "2021-10-18 21:01:58",
      "score": 10,
      "num_children": 0,
      "author": 79493,
      "replies": []
    },
    {
      "id": "hh5knzx",
      "text": "Runs for U.S. Congress in 3 ... 2 ... 1.",
      "timestamp": "2021-10-18 20:55:07",
      "score": 9,
      "num_children": 0,
      "author": 178165,
      "replies": []
    },
    {
      "id": "hh4v410",
      "text": "Fuk Alabama you Ignorant fuckers!",
      "timestamp": "2021-10-18 17:56:40",
      "score": 32,
      "num_children": 1,
      "author": 149334,
      "replies": [
        {
          "id": "hh7v75c",
          "text": "Hey now, there's dozens of us here who disagree with how things are handled. You try undoing decades of racism and hyper religious idiocy in 400,000 people. \n\n\nIt's really a shitshow, please send help.",
          "timestamp": "2021-10-19 10:52:30",
          "score": 1,
          "num_children": 0,
          "author": 50229,
          "replies": []
        }
      ]
    },
    {
      "id": "hh5kex1",
      "text": "What cowardly, disgusting politicians made this abhorrent shit possible?\n\n**Pastor Jason Greathouse** was (is? And if so, WHY?) a fucking pastor. That's a position of trust in the community. He abused that position to get his fckn rocks off. Not only do I say he should be added immediately to the sex offender list, he should immediately get 10 years stapled onto his pious ass for abusing a position of public trust. Make this smarmy little creep rot in prison\n\nI mean otherwise, America's justice system is a sick fckn joke",
      "timestamp": "2021-10-18 20:52:48",
      "score": 8,
      "num_children": 0,
      "author": 396601,
      "replies": []
    },
    {
      "id": "hh6fi91",
      "text": "Religion is the one of the main reasons this world is fucked. Fuck the Bible, Quran and every other book and fuck religion.",
      "timestamp": "2021-10-19 01:01:13",
      "score": 7,
      "num_children": 0,
      "author": 67833,
      "replies": []
    },
    {
      "id": "hh51poh",
      "text": "Somebody knock his ass out and tattoo 'child rapist' on his forehead. Ffs 🤦",
      "timestamp": "2021-10-18 18:41:48",
      "score": 20,
      "num_children": 1,
      "author": 107736,
      "replies": [
        {
          "id": "hh5ntlc",
          "text": "No, no, no. . . That’s not right at all. . . We need to go full Inglorious Basterds on him; a few guys hold him down while someone else carves “Child Rapist” into his forehead, except I suggest a dull butter knife instead a sharp Bowie knife, just gotta make sure you push hard enough that it cuts deep enough to permanently scar, we don’t want it going away anytime soon.",
          "timestamp": "2021-10-18 21:24:03",
          "score": 4,
          "num_children": 1,
          "author": 128748,
          "replies": [
            {
              "id": "hh64kws",
              "text": "Hmmmm I’d love to go Girl With the Dragon Tattoo on him.",
              "timestamp": "2021-10-18 23:33:19",
              "score": 4,
              "num_children": 0,
              "author": 322339,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hh5r5zo",
      "text": "Continuing proof that you can be a good person, or you can be a good Evangelical, but not both.",
      "timestamp": "2021-10-18 21:48:33",
      "score": 6,
      "num_children": 0,
      "author": 66004,
      "replies": []
    },
    {
      "id": "hh59rlr",
      "text": "Why isn't Qanon up in arms about this? They're whole modus operandi protecting kid's isn't it?",
      "timestamp": "2021-10-18 19:36:37",
      "score": 20,
      "num_children": 2,
      "author": 10873,
      "replies": [
        {
          "id": "hh652lo",
          "text": "...no.  It's picking the absolute most unacceptable criminal behavior and assigning it to their political enemies in a mouthbreather-attempt at garnering support and signaling to one another.",
          "timestamp": "2021-10-18 23:37:15",
          "score": 6,
          "num_children": 0,
          "author": 373708,
          "replies": []
        },
        {
          "id": "hh7559g",
          "text": "Dudes in prison",
          "timestamp": "2021-10-19 04:46:52",
          "score": 0,
          "num_children": 1,
          "replies": [
            {
              "id": "hhabeto",
              "text": "Um, no, he was let off with no prison time.",
              "timestamp": "2021-10-19 21:46:00",
              "score": 1,
              "num_children": 0,
              "author": 10873,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hh5elnb",
      "text": "Why is it so hard for MAGA tards to find the pedophiles? They literally see them every Sunday.",
      "timestamp": "2021-10-18 20:09:35",
      "score": 16,
      "num_children": 0,
      "author": 156749,
      "replies": []
    },
    {
      "id": "hh5it67",
      "text": "Disgusting. Here we have a man set free from rape and yet a woman was charged and convicted of manslaughter for having a miscarriage. \n\nThis is a terrible timeline.",
      "timestamp": "2021-10-18 20:39:08",
      "score": 7,
      "num_children": 0,
      "author": 252452,
      "replies": []
    },
    {
      "id": "hh50ay8",
      "text": "Alabama you say? No surprise there.",
      "timestamp": "2021-10-18 18:32:16",
      "score": 5,
      "num_children": 0,
      "author": 124740,
      "replies": []
    },
    {
      "id": "hh50m22",
      "text": "It's time we keep kids away from clerics",
      "timestamp": "2021-10-18 18:34:23",
      "score": 3,
      "num_children": 0,
      "author": 369347,
      "replies": []
    },
    {
      "id": "hh5e7xl",
      "text": "Here's a solution: Put both the pastor and that judge in jail for a term of no less than 25 years and both should live in the same cell for that long. That way they can trade blow-jobs and forgive each other afterwards and the rest of us can enjoy a better society.",
      "timestamp": "2021-10-18 20:06:56",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh5h217",
      "text": "*God works in mysterious ways*",
      "timestamp": "2021-10-18 20:26:26",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh5pg0e",
      "text": "And that's why we need to bring back vigilante justice.\n\nOr Dexter Morgan.\n\nI'd be happy with either.",
      "timestamp": "2021-10-18 21:35:56",
      "score": 4,
      "num_children": 1,
      "author": 372525,
      "replies": [
        {
          "id": "hh5zrer",
          "text": ">Or Dexter Morgan.\n\nHe is coming back in November.",
          "timestamp": "2021-10-18 22:54:42",
          "score": 1,
          "num_children": 1,
          "author": 125289,
          "replies": [
            {
              "id": "hh8giei",
              "text": "I meant in real-life. We need a real-life Dexter Morgan.",
              "timestamp": "2021-10-19 14:13:25",
              "score": 1,
              "num_children": 0,
              "author": 372525,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hh5u3qi",
      "text": "God watches kiddie porn in mysterious ways.",
      "timestamp": "2021-10-18 22:10:31",
      "score": 6,
      "num_children": 0,
      "author": 114516,
      "replies": []
    },
    {
      "id": "hh61als",
      "text": "**bUT chriSTiaNs are oppResSed.**\n\n*Give me a fucking break.*",
      "timestamp": "2021-10-18 23:07:02",
      "score": 5,
      "num_children": 0,
      "author": 9953,
      "replies": []
    },
    {
      "id": "hh7w3n3",
      "text": "Sadly, not an isolated incident. Hundreds, perhaps thousands of young girls are married to adult males every year in the U.S., often to protect the men from rape charges.\n\nFrom a 2017 NYT article: [11 Years Old, a Mom, and Pushed to Marry Her Rapist in Florida](https://www.nytimes.com/2017/05/26/opinion/sunday/it-was-forced-on-me-child-marriage-in-the-us.html):\n\n>Johnson, the former 11-year-old unwitting bride who is now fighting for Florida to set a minimum marriage age (there is none now), says that her family attended a conservative Pentecostal church and that other girls of a similar age periodically also married. Often, she says, this was to hide rapes by church elders.\n\n>She says she was raped by both a minister and a parishioner and gave birth to a daughter when she was just 10 (the birth certificate confirms that). ***A judge approved the marriage to end the rape investigation***, she says, telling her, *“What we want is for you to get married.”*\n\n>“*It was a terrible life*,” Johnson recalls, recounting her years as a child raising children. She missed school and remembers spending her days changing diapers, arguing with her husband and struggling to pay expenses. She ended up with pregnancy after pregnancy — nine children in all — while her husband periodically abandoned her.\n\n>***“They took the handcuffs from handcuffing him,”*** she says, referring to the risk he faced of arrest for rape, ***“to handcuffing me, by marrying me without me knowing what I was doing.”***\n\nIn nearly half the U.S. states there is no statutory minimum marriage age despite repeated attempts to legislate one because of [political pressure](https://www.salon.com/2018/03/11/banning-child-marriage-in-america-an-uphill-fight-against-evangelical-pressure/) mostly from Evangelicals and Orthodox Jews.\n\n - March 2019: [This bill would have ended child marriage for those under age in Idaho. The House voted it down](https://www.idahostatesman.com/news/politics-government/state-politics/article226944034.html)\n\n - June 2019 [Louisiana lawmakers reject bill to set a minimum marriage age](https://www.nbcnews.com/politics/politics-news/louisiana-lawmakers-reject-bill-set-minimum-marriage-age-n1013356)",
      "timestamp": "2021-10-19 11:03:56",
      "score": 4,
      "num_children": 1,
      "author": 404371,
      "replies": [
        {
          "id": "hh8aews",
          "text": "Thanks... But damn, that is horrendous",
          "timestamp": "2021-10-19 13:25:18",
          "score": 1,
          "num_children": 0,
          "author": 65733,
          "replies": []
        }
      ]
    },
    {
      "id": "hh8awgh",
      "text": "Where is Dexter when you need him?",
      "timestamp": "2021-10-19 13:29:19",
      "score": 5,
      "num_children": 0,
      "author": 219071,
      "replies": []
    },
    {
      "id": "hh5is8z",
      "text": "That's some Talibama shit right there.",
      "timestamp": "2021-10-18 20:38:56",
      "score": 13,
      "num_children": 0,
      "author": 128323,
      "replies": []
    },
    {
      "id": "hh4ouhp",
      "text": "I used to support that sex offender registry but I think it’s a pile of bull shit these days. Our judicial system is in a mess and I suspect with the way things are going it’s not going to get any better anytime soon. \n\nOh and fuck your religions.",
      "timestamp": "2021-10-18 17:13:40",
      "score": 25,
      "num_children": 0,
      "author": 229296,
      "replies": []
    },
    {
      "id": "hh5lwo7",
      "text": "And this is why if someone is a \"Youth Pastor\", I just assume they're a child rapist.",
      "timestamp": "2021-10-18 21:07:07",
      "score": 13,
      "num_children": 0,
      "author": 200280,
      "replies": []
    },
    {
      "id": "hh4z9wc",
      "text": "Seems the system failed, time for him to accidentally fall under a lawn mower..",
      "timestamp": "2021-10-18 18:25:12",
      "score": 6,
      "num_children": 0,
      "author": 251368,
      "replies": []
    },
    {
      "id": "hh5t6jt",
      "text": "No need for jail for raping a child. It is not like he had an ounce of marijuana on him or something really bad like that.\n\nAnd I am sure he feels really bad about raping her.",
      "timestamp": "2021-10-18 22:03:34",
      "score": 5,
      "num_children": 0,
      "author": 111057,
      "replies": []
    },
    {
      "id": "hh5x8po",
      "text": "My bet is that she was raped by the father or siblings/other relatives as well and that would come out in court, so they settled.",
      "timestamp": "2021-10-18 22:34:46",
      "score": 4,
      "num_children": 0,
      "author": 66360,
      "replies": []
    },
    {
      "id": "hh64xso",
      "text": "If course it’s Alabama.",
      "timestamp": "2021-10-18 23:36:10",
      "score": 4,
      "num_children": 0,
      "author": 157578,
      "replies": []
    },
    {
      "id": "hh6f2a2",
      "text": "Snakes can't talk and Jesus can suck it. American Christians are some of the worst people on earth.",
      "timestamp": "2021-10-19 00:57:40",
      "score": 4,
      "num_children": 0,
      "author": 266549,
      "replies": []
    },
    {
      "id": "hh6wih1",
      "text": "Going to be downvoted into oblivion…\n\nTerrible result but the plea deal may have been reasonable. It seems that defense would have used a divorce and the child custody issues as a way to damage the witnesses credibility. If the jury decides that the witness is not credible than the whole case goes to nothing anyway. I think that the result here is more pragmatism than anything else. \n\nMoreover if the parents are very complicit they may in fact appear on behalf of the pastor against their daughter. \n\nIn this case a misdemeanor is better than an acquittal",
      "timestamp": "2021-10-19 03:21:17",
      "score": 4,
      "num_children": 0,
      "author": 257198,
      "replies": []
    },
    {
      "id": "hh7htv2",
      "text": "One of the things that stuck with me from the theory classes at law school is that for a legal system to be ‘fair’: justice must be done, and justice must be SEEN to be done. \n\nAmerica is heading further and further along a dark path.",
      "timestamp": "2021-10-19 07:34:38",
      "score": 4,
      "num_children": 0,
      "author": 285458,
      "replies": []
    },
    {
      "id": "hh7sbt9",
      "text": "What kind of parents elect child marriage instead of a police report. Talk about failure to protect a child. I would seriously be on trial for murder.",
      "timestamp": "2021-10-19 10:13:59",
      "score": 4,
      "num_children": 0,
      "author": 175765,
      "replies": []
    },
    {
      "id": "hh7vtar",
      "text": "Forcing your daughter to marry her youth pastor rapist that’s living in your home at 14 sounds like a joke you’d make about Alabama. Holy shit I feel bad for that girl",
      "timestamp": "2021-10-19 11:00:25",
      "score": 4,
      "num_children": 0,
      "author": 229879,
      "replies": []
    },
    {
      "id": "hh5nqxx",
      "text": "Then you have a case of a 18 year old having sex with his 16 year old gf consensually. The guy has to go to jail for 20 years because it is statutory rape since the girl's parents didnt like the guy.",
      "timestamp": "2021-10-18 21:23:30",
      "score": 11,
      "num_children": 0,
      "author": 84121,
      "replies": []
    },
    {
      "id": "hh5pjjx",
      "text": "If I ever, ever fuck up in my life, I want this guy's lawyer.",
      "timestamp": "2021-10-18 21:36:39",
      "score": 7,
      "num_children": 0,
      "author": 408345,
      "replies": []
    },
    {
      "id": "hh4vvlf",
      "text": "That sucks.",
      "timestamp": "2021-10-18 18:01:52",
      "score": 3,
      "num_children": 0,
      "author": 69901,
      "replies": []
    },
    {
      "id": "hh4vyhx",
      "text": "F that shit.",
      "timestamp": "2021-10-18 18:02:24",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh5dimw",
      "text": "Another glaring example of how religion rots the brain. Well, two, the parents in this case.",
      "timestamp": "2021-10-18 20:02:06",
      "score": 3,
      "num_children": 0,
      "author": 188650,
      "replies": []
    },
    {
      "id": "hh5eu1v",
      "text": "Jesus gives him the right to rape a minor. A pastor's sin is a holy sin, hence no sin at all.",
      "timestamp": "2021-10-18 20:11:11",
      "score": 3,
      "num_children": 0,
      "author": 218663,
      "replies": []
    },
    {
      "id": "hh5s9p9",
      "text": "This makes my blood boil. Unbelievable.",
      "timestamp": "2021-10-18 21:56:44",
      "score": 3,
      "num_children": 0,
      "author": 413015,
      "replies": []
    },
    {
      "id": "hh63bk3",
      "text": "At this rate, the judge and the jury would probably hail him a hero and suck him off if he murdered her. What a fucking monster",
      "timestamp": "2021-10-18 23:23:14",
      "score": 3,
      "num_children": 0,
      "author": 245799,
      "replies": []
    },
    {
      "id": "hh68188",
      "text": "How very Taliban of The Americans.",
      "timestamp": "2021-10-19 00:01:15",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh7twor",
      "text": "Correction: the DA has decided that justice must occur outside of the courtroom.",
      "timestamp": "2021-10-19 10:35:32",
      "score": 3,
      "num_children": 0,
      "author": 241062,
      "replies": []
    },
    {
      "id": "hh845m5",
      "text": "Of course this was in Alabama.",
      "timestamp": "2021-10-19 12:30:21",
      "score": 3,
      "num_children": 0,
      "author": 25329,
      "replies": []
    },
    {
      "id": "hh4w121",
      "text": "Dead in a week.",
      "timestamp": "2021-10-18 18:02:53",
      "score": 6,
      "num_children": 0,
      "author": 175439,
      "replies": []
    },
    {
      "id": "hh50fuh",
      "text": "These people need to be removed from society. I don't care by what means, but imo sick fucks like this deserve to be six feet under in an unmarked grave. It boggles my mind religiosity can somehow grant exemption from punishment for such absolute vile acts. One can only hope a vigilante takes things into their own hands in cases like this. Just goes to show how much their so called religious morality is really just a fucking load of shit and an illusion mean to protect disgusting wastes of human life.",
      "timestamp": "2021-10-18 18:33:12",
      "score": 5,
      "num_children": 0,
      "author": 45878,
      "replies": []
    },
    {
      "id": "hh4vw3p",
      "text": "Protected by the Holy Ghost!",
      "timestamp": "2021-10-18 18:01:57",
      "score": 2,
      "num_children": 0,
      "author": 154441,
      "replies": []
    },
    {
      "id": "hh50pin",
      "text": "Screams in maddening frustration while pulling my hair out. Jesus fuck, this shit fucking drives me insane.",
      "timestamp": "2021-10-18 18:35:02",
      "score": 2,
      "num_children": 0,
      "author": 249,
      "replies": []
    },
    {
      "id": "hh5blqz",
      "text": "What State, Florida?",
      "timestamp": "2021-10-18 19:49:04",
      "score": 2,
      "num_children": 1,
      "author": 162008,
      "replies": [
        {
          "id": "hh5cfz3",
          "text": "Alabama - Flordia's drunk, dumbass cousin",
          "timestamp": "2021-10-18 19:54:44",
          "score": 8,
          "num_children": 0,
          "author": 265666,
          "replies": []
        }
      ]
    },
    {
      "id": "hh5ep9b",
      "text": "And they have the gall to claim religious privilege doesn’t exist.",
      "timestamp": "2021-10-18 20:10:16",
      "score": 2,
      "num_children": 0,
      "author": 231031,
      "replies": []
    },
    {
      "id": "hh5gsl3",
      "text": "Fucking Alabama.",
      "timestamp": "2021-10-18 20:24:39",
      "score": 2,
      "num_children": 0,
      "author": 360347,
      "replies": []
    },
    {
      "id": "hh5gt43",
      "text": "Well come on now...he was only following Gods wishes.",
      "timestamp": "2021-10-18 20:24:45",
      "score": 2,
      "num_children": 0,
      "author": 146435,
      "replies": []
    },
    {
      "id": "hh5kf36",
      "text": "is this why they call it land of the free, cause there are so many people who don't go to prison?",
      "timestamp": "2021-10-18 20:52:50",
      "score": 2,
      "num_children": 0,
      "author": 278817,
      "replies": []
    },
    {
      "id": "hh5kq46",
      "text": "Only in the USA.",
      "timestamp": "2021-10-18 20:55:40",
      "score": 2,
      "num_children": 1,
      "author": 47500,
      "replies": [
        {
          "id": "hh63t89",
          "text": "We are tame in comparison to some places. Still fucking terrible, but this shit happen times 10 in other places.",
          "timestamp": "2021-10-18 23:27:11",
          "score": 2,
          "num_children": 0,
          "author": 128390,
          "replies": []
        }
      ]
    },
    {
      "id": "hh5q91h",
      "text": "Without clicking the article link, I’m going to indulge in a little guesswork and say this happened in either Alabama or Mississippi.",
      "timestamp": "2021-10-18 21:41:51",
      "score": 2,
      "num_children": 0,
      "author": 235309,
      "replies": []
    },
    {
      "id": "hh5s2jk",
      "text": "Aaaaand let me guess his views on rape and abortion...",
      "timestamp": "2021-10-18 21:55:14",
      "score": 2,
      "num_children": 0,
      "author": 150592,
      "replies": []
    },
    {
      "id": "hh5wiik",
      "text": "The Lord works in mysterious ways /s",
      "timestamp": "2021-10-18 22:29:08",
      "score": 2,
      "num_children": 0,
      "author": 297040,
      "replies": []
    },
    {
      "id": "hh5z0mi",
      "text": "Excuse me?...",
      "timestamp": "2021-10-18 22:48:46",
      "score": 2,
      "num_children": 0,
      "author": 371823,
      "replies": []
    },
    {
      "id": "hh5z699",
      "text": "I hooe someone cuts his dick off and feeds it to him",
      "timestamp": "2021-10-18 22:49:59",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh5zosa",
      "text": "This is why people get murdered",
      "timestamp": "2021-10-18 22:54:07",
      "score": 2,
      "num_children": 0,
      "author": 270092,
      "replies": []
    },
    {
      "id": "hh6bib4",
      "text": "If the guy wasn't a pastor he would have been at least sentenced to prison for a long while.",
      "timestamp": "2021-10-19 00:29:19",
      "score": 2,
      "num_children": 0,
      "author": 220749,
      "replies": []
    },
    {
      "id": "hh6buau",
      "text": "[removed]",
      "timestamp": "2021-10-19 00:31:59",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "hh7x54l",
          "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\n\n* This comment has been removed for breaking site-wide [reddit rules](http://www.reddit.com/rules). Removals of this type may also include subreddit bans and/or suspensions from the whole site depending on the severity of the offense.\n\n--\n\n\n\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
          "timestamp": "2021-10-19 11:16:35",
          "score": 1,
          "num_children": 0,
          "author": 122319,
          "replies": []
        }
      ]
    },
    {
      "id": "hh6f1va",
      "text": "This is why street justice was invented.",
      "timestamp": "2021-10-19 00:57:34",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh6jqs9",
      "text": "Excuse me, what the fuck?! \n\nYeah... if that was my child... yeah... just gonna leave that thought to myself.\n\nThis is disgusting",
      "timestamp": "2021-10-19 01:34:33",
      "score": 2,
      "num_children": 1,
      "author": 127095,
      "replies": [
        {
          "id": "hh6mkmw",
          "text": "Her parent made her MARRY the rapist.  That’s what kind of parents she has.",
          "timestamp": "2021-10-19 01:57:11",
          "score": 3,
          "num_children": 1,
          "author": 182154,
          "replies": [
            {
              "id": "hh6n527",
              "text": "What the what the fuck?! I missed that part,  so fuck everyone in this story except the victim. Gotcha. I don't wanna live on this planet anymore",
              "timestamp": "2021-10-19 02:01:53",
              "score": 3,
              "num_children": 0,
              "author": 127095,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hh6m9br",
      "text": "First thought in my head. \" let me guess, Alabama?\" And sure as fucking shit",
      "timestamp": "2021-10-19 01:54:36",
      "score": 2,
      "num_children": 1,
      "author": 324203,
      "replies": [
        {
          "id": "hh6n0lo",
          "text": "My first thought was weird child marriage. And look at that first paragraph.",
          "timestamp": "2021-10-19 02:00:49",
          "score": 3,
          "num_children": 1,
          "author": 205165,
          "replies": [
            {
              "id": "hh6nxmx",
              "text": "Now that is good intuition. \nThat was just another curveball to me.",
              "timestamp": "2021-10-19 02:08:28",
              "score": 2,
              "num_children": 1,
              "author": 324203,
              "replies": [
                {
                  "id": "hh6qvlf",
                  "text": "I've read too many articles like this and it always turns out to be a religious thing. Happens in Florida a lot also.",
                  "timestamp": "2021-10-19 02:33:16",
                  "score": 1,
                  "num_children": 0,
                  "author": 205165,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hh6o7mg",
      "text": "When are these damn parents going to stop trusting their kids to be unsupervised with any pastors, priests, clergymen, etc? Parent's seem terrified of letting their kids even play outside nowadays, yet allow their kids to be alone with a grown man?",
      "timestamp": "2021-10-19 02:10:52",
      "score": 2,
      "num_children": 0,
      "author": 97125,
      "replies": []
    },
    {
      "id": "hh6oqd1",
      "text": "Why is it that religious people are the ones most likely to rape?",
      "timestamp": "2021-10-19 02:15:18",
      "score": 2,
      "num_children": 0,
      "author": 254115,
      "replies": []
    },
    {
      "id": "hh6ruvu",
      "text": "This sounds like a case for The Boondock Saints",
      "timestamp": "2021-10-19 02:41:22",
      "score": 2,
      "num_children": 0,
      "author": 173857,
      "replies": []
    },
    {
      "id": "hh6uqva",
      "text": "I want that guy jailed for the rest of his life in a 4x4 in solitary confinement and his dick cut off no anesthesia with a machete",
      "timestamp": "2021-10-19 03:05:53",
      "score": 2,
      "num_children": 0,
      "author": 59700,
      "replies": []
    },
    {
      "id": "hh725f3",
      "text": "Isn’t being registered as a Paster the same thing?\n\n/s",
      "timestamp": "2021-10-19 04:14:26",
      "score": 2,
      "num_children": 0,
      "author": 265160,
      "replies": []
    },
    {
      "id": "hh735a7",
      "text": "For the 100th time, I'm sure the Q Cucks Clan will be right on it! Save the children right?",
      "timestamp": "2021-10-19 04:24:55",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh771is",
      "text": "Conservatism in a nutshell.  Hate women and children, love pedophiles, religious hypocrites, rarely ever pay for their crimes.",
      "timestamp": "2021-10-19 05:08:53",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh779f0",
      "text": "Wow. He groomed her and then raped her and she was forced to marry her rapist. As a fucking child. What the actual hell?? And he gets to walk scot free? 🤬",
      "timestamp": "2021-10-19 05:11:30",
      "score": 2,
      "num_children": 0,
      "author": 408200,
      "replies": []
    },
    {
      "id": "hh7a7jg",
      "text": "The same people who ban us trans people from public bathrooms because \"I don't want perverts in the bathroom with my kids\" also don't bat an eye at this shit.",
      "timestamp": "2021-10-19 05:48:04",
      "score": 2,
      "num_children": 0,
      "author": 92735,
      "replies": []
    },
    {
      "id": "hh7aen5",
      "text": "I am more amazed such parents exist",
      "timestamp": "2021-10-19 05:50:33",
      "score": 2,
      "num_children": 0,
      "author": 115835,
      "replies": []
    },
    {
      "id": "hh7byv0",
      "text": "What the fuck does this have to do with Atheism?\n\nWhy is literally every single post on this Atheism sub about Christianity?",
      "timestamp": "2021-10-19 06:11:05",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "hheoc6n",
          "text": "Perhaps because Christianity is the dominant religion of the countries where the majority of Redditors live, dominates the government of huge regions of the home country of Reddit, and is well on its way to taking over its national government.",
          "timestamp": "2021-10-20 20:33:19",
          "score": 1,
          "num_children": 0,
          "author": 380279,
          "replies": []
        }
      ]
    },
    {
      "id": "hh7f7gc",
      "text": "I generally abhor vigilantism, but this is a situation that requires a generous dose of mob justice.",
      "timestamp": "2021-10-19 06:55:29",
      "score": 2,
      "num_children": 0,
      "author": 264367,
      "replies": []
    },
    {
      "id": "hh7ifah",
      "text": "Seems about right. Probably used the defence that Mary was 14 when \"God\" impregnated her with Jesus. People defend David Koresh (of the Branch David and/tragedy at Waco, TX) even though he also had sex with, and married, a 14 year old girl.",
      "timestamp": "2021-10-19 07:43:44",
      "score": 2,
      "num_children": 0,
      "author": 310528,
      "replies": []
    },
    {
      "id": "hh7ik2c",
      "text": "My daughter is 13, so I can picture this situation.\n\nI would be in jail for a very long time for murder if someone did this to my daughter. But at least she would have closure.",
      "timestamp": "2021-10-19 07:45:48",
      "score": 2,
      "num_children": 0,
      "author": 280492,
      "replies": []
    },
    {
      "id": "hh7j005",
      "text": "Rope. Tree. Some assembly required.",
      "timestamp": "2021-10-19 07:52:42",
      "score": 2,
      "num_children": 0,
      "author": 187338,
      "replies": []
    },
    {
      "id": "hh7o16s",
      "text": "Why the fuck they didn't turned him to a registered sex offender? Looks like his influence in the court is strong af.",
      "timestamp": "2021-10-19 09:09:52",
      "score": 2,
      "num_children": 0,
      "author": 251589,
      "replies": []
    },
    {
      "id": "hh7ogn9",
      "text": "This would be a great case for Dexter, anyone?",
      "timestamp": "2021-10-19 09:16:29",
      "score": 2,
      "num_children": 0,
      "author": 193142,
      "replies": []
    },
    {
      "id": "hh7r6px",
      "text": "Feel like the parents should face some jail time. What the fuck?!",
      "timestamp": "2021-10-19 09:57:28",
      "score": 2,
      "num_children": 0,
      "author": 381432,
      "replies": []
    },
    {
      "id": "hh86sf2",
      "text": "14?  That's the same age Mary was when God raped her.",
      "timestamp": "2021-10-19 12:54:20",
      "score": 2,
      "num_children": 1,
      "author": 172429,
      "replies": [
        {
          "id": "hh8a3li",
          "text": "Really?",
          "timestamp": "2021-10-19 13:22:44",
          "score": 1,
          "num_children": 1,
          "author": 65733,
          "replies": [
            {
              "id": "hhao55p",
              "text": "That is the age most theological historians have estimated.  \n\n>While unproven, some apocryphal accounts state that at the time of her betrothal to Joseph, Mary was 12–14 years old. According to ancient Jewish custom, Mary could have been betrothed at about 12. Hyppolitus of Thebes says that Mary lived for 11 years after the death of her son Jesus, dying in 41 AD.",
              "timestamp": "2021-10-19 23:22:23",
              "score": 1,
              "num_children": 1,
              "author": 172429,
              "replies": [
                {
                  "id": "hhaqgm7",
                  "text": "FFS... Better than some other religions...",
                  "timestamp": "2021-10-19 23:40:12",
                  "score": 1,
                  "num_children": 0,
                  "author": 65733,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hh88mbs",
      "text": "Religion, the great destroyer.",
      "timestamp": "2021-10-19 13:10:17",
      "score": 2,
      "num_children": 0,
      "author": 257477,
      "replies": []
    },
    {
      "id": "hh8a4xd",
      "text": "Her parents insisted they marry?\n\nWtf?",
      "timestamp": "2021-10-19 13:23:02",
      "score": 2,
      "num_children": 0,
      "author": 65733,
      "replies": []
    },
    {
      "id": "hh8f0zn",
      "text": "Find him… kill him…",
      "timestamp": "2021-10-19 14:02:03",
      "score": 2,
      "num_children": 0,
      "author": 92400,
      "replies": []
    },
    {
      "id": "hh8udjp",
      "text": "You are talking about the convicted child rapist Jason Greathouse?",
      "timestamp": "2021-10-19 15:51:31",
      "score": 2,
      "num_children": 0,
      "author": 279875,
      "replies": []
    },
    {
      "id": "hh66i4l",
      "text": "Another ubiquitous cult45er.",
      "timestamp": "2021-10-18 23:48:45",
      "score": 2,
      "num_children": 0,
      "author": 404115,
      "replies": []
    },
    {
      "id": "hh6kfk2",
      "text": "Doing the Lord's work there.",
      "timestamp": "2021-10-19 01:40:01",
      "score": 2,
      "num_children": 0,
      "author": 330608,
      "replies": []
    },
    {
      "id": "hh7b90o",
      "text": "Trumps mate?",
      "timestamp": "2021-10-19 06:01:36",
      "score": 2,
      "num_children": 0,
      "author": 316498,
      "replies": []
    },
    {
      "id": "hh7h389",
      "text": "Don’t worry guys, god works in mysterious ways. I’m sure the best thing to do in this scenario is absolutely nothing.",
      "timestamp": "2021-10-19 07:23:26",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh61axe",
      "text": "Find and execute him. No further discussion required.",
      "timestamp": "2021-10-18 23:07:06",
      "score": -1,
      "num_children": 1,
      "author": 161589,
      "replies": [
        {
          "id": "hh65e7u",
          "text": "That sort of sounds like something a fundie would say. No due process, no rehabilitation. Just gods wrath.",
          "timestamp": "2021-10-18 23:39:51",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "hh6eglz",
              "text": "Child rapists don't rehabilitate. While I'm not a fan of the death penalty, it should be an automatic life sentence. They should never be given the chance to be around minors ever again, period. Lock them all away and throw out the key.",
              "timestamp": "2021-10-19 00:52:55",
              "score": 7,
              "num_children": 1,
              "author": 196171,
              "replies": [
                {
                  "id": "hh8nblc",
                  "text": "1 in 7 children in the us experiences abuse, meaning at least 47,000,000 adults are abusers. Is it more practical to house these people in prison, or address the issues that are causing them to offend in the first place? \n\nIf you treat abusers like supernatural boogeymen, you empower them. If you accept that abusers are human, like your neighbour, school gymnastics coach, brother, father, uncle, etc, they become much less powerful in a sense. You can’t fix a monster, but you can influence people.\n\nOur approach to solving child abuse by viewing abusers as inalterable monsters has thus far failed miserably imo. All the killing or imprisonment in the world will not stop the next victim from being abused, as we have seen.\n\nWhat is needed is a more nuanced approach that encourages people to talk about these problems more. Both the victims and the abusers, being as the two groups have overlap and feedback loops.\n\nThe solution to these problems involves deep societal change in both how we think of abusers and the abused, and how we attempt to treat both groups. As long as our solution is to lock the problem out of sight and attempt to forget about it, we are essentially creating more victims.\n\nDisclaimer: I’m not suggesting abandoning punitive models all together, just that it’s ideal place in solving abuse is way smaller relative to the whole.",
                  "timestamp": "2021-10-19 15:02:11",
                  "score": 0,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hha8kfy",
                      "text": "You're forgetting that abusers have a strong tendency to have multiple victims.\n\nIf someone is affected by pedophilia but hasn't offended, I strongly believe there needs to be therapy and other forms of support to prevent them from harming anyone.\n\nBut once a child is harmed, that's it. No redemption. They crossed the line once, they'll do it again. Maybe look up how many child rapists do the exact same thing again as soon as they get out of prison, seeing as the current system locks them away for a few years maximum.\n\nThese people are human, but they are also monsters. Humans make the worst monsters. Allowing them to be around children again after such actions is directly creating more victims. Once someone has completely destroyed a child's life in the worst way possible, they should NOT be allowed another chance.",
                      "timestamp": "2021-10-19 21:25:43",
                      "score": 1,
                      "num_children": 0,
                      "author": 196171,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hh6qkji",
      "text": "I thought this was a twisted, opinionated article based on the URL, but nope. Absolute insanity. [Here](https://www.google.com/amp/s/metro.co.uk/2019/05/13/pastor-raped-daughter-14-gets-light-prison-sentence-man-god-9515582/amp/) is another, and in my opinion better, article as it states more specifics on the case.",
      "timestamp": "2021-10-19 02:30:40",
      "score": 1,
      "num_children": 2,
      "author": 230548,
      "replies": [
        {
          "id": "hh8gi0j",
          "text": "That’s a different case, it happened in Tenn, this case was Bama. Also your case is own daughter vs. non family member.",
          "timestamp": "2021-10-19 14:13:20",
          "score": 2,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hh750c7",
          "text": "So it is opinionated trash as the dude got 14 years?",
          "timestamp": "2021-10-19 04:45:18",
          "score": -1,
          "num_children": 1,
          "replies": [
            {
              "id": "hh7tlei",
              "text": "I thought the dude got nothing, I'm confused here.",
              "timestamp": "2021-10-19 10:31:25",
              "score": 2,
              "num_children": 0,
              "author": 230548,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hh875vl",
      "text": "Can we burn these judges",
      "timestamp": "2021-10-19 12:57:37",
      "score": 1,
      "num_children": 0,
      "author": 144889,
      "replies": []
    },
    {
      "id": "hh50w3u",
      "text": "Which sane-in-the-head father would take a 24-yr old boarder cocksmith when you have a teenage girl running around? It's just plain stupid, the situation just begged to happen, there was no other possible outcome.",
      "timestamp": "2021-10-18 18:36:14",
      "score": -2,
      "num_children": 2,
      "author": 223053,
      "replies": [
        {
          "id": "hh581ng",
          "text": "[deleted]",
          "timestamp": "2021-10-18 19:24:54",
          "score": 16,
          "num_children": 1,
          "replies": [
            {
              "id": "hh8pu44",
              "text": "Maybe they were relatives, you're right.",
              "timestamp": "2021-10-19 15:19:51",
              "score": 2,
              "num_children": 0,
              "author": 223053,
              "replies": []
            }
          ]
        },
        {
          "id": "hh5l008",
          "text": ">Which sane-in-the-head father would take a 24-yr old boarder cocksmith when you have a teenage girl running around?\n\nAnd doesn't turn the guys penis into a penisn't upon finding out?",
          "timestamp": "2021-10-18 20:58:13",
          "score": 7,
          "num_children": 0,
          "author": 293583,
          "replies": []
        }
      ]
    },
    {
      "id": "hh674nr",
      "text": "So we kill him right? If the law fails us that means we are obligated as a community to kill him…",
      "timestamp": "2021-10-18 23:53:50",
      "score": 1,
      "num_children": 0,
      "author": 331420,
      "replies": []
    },
    {
      "id": "hh54jod",
      "text": "Sheeesh.",
      "timestamp": "2021-10-18 19:01:16",
      "score": 1,
      "num_children": 0,
      "author": 208592,
      "replies": []
    },
    {
      "id": "hh5eqkw",
      "text": "I wish I had the money to post on a billboard outrageous bible scriptures.",
      "timestamp": "2021-10-18 20:10:32",
      "score": 1,
      "num_children": 0,
      "author": 291818,
      "replies": []
    },
    {
      "id": "hh5hynn",
      "text": "Beyond disgusting",
      "timestamp": "2021-10-18 20:32:46",
      "score": 1,
      "num_children": 0,
      "author": 304608,
      "replies": []
    },
    {
      "id": "hh5jtot",
      "text": "SWEET HOME ALABAMA",
      "timestamp": "2021-10-18 20:47:30",
      "score": 1,
      "num_children": 1,
      "author": 19273,
      "replies": [
        {
          "id": "hh6mpu8",
          "text": "Except there is no sweet.",
          "timestamp": "2021-10-19 01:58:21",
          "score": 1,
          "num_children": 0,
          "author": 369869,
          "replies": []
        }
      ]
    },
    {
      "id": "hh5nzp6",
      "text": "Fuck alabama.",
      "timestamp": "2021-10-18 21:25:19",
      "score": 1,
      "num_children": 0,
      "author": 246027,
      "replies": []
    },
    {
      "id": "hh5p5k2",
      "text": "this is just disgusting i cant belive people like this exist",
      "timestamp": "2021-10-18 21:33:51",
      "score": 1,
      "num_children": 0,
      "author": 64661,
      "replies": []
    },
    {
      "id": "hh5p85z",
      "text": "This is beyond fucked up.",
      "timestamp": "2021-10-18 21:34:22",
      "score": 1,
      "num_children": 0,
      "author": 125827,
      "replies": []
    },
    {
      "id": "hh5potp",
      "text": "How is this not a federal crime?",
      "timestamp": "2021-10-18 21:37:44",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh5qieo",
      "text": "WTF!",
      "timestamp": "2021-10-18 21:43:45",
      "score": 1,
      "num_children": 0,
      "author": 73017,
      "replies": []
    },
    {
      "id": "hh5rrb9",
      "text": "Have we reached peak Alabama yet?",
      "timestamp": "2021-10-18 21:52:53",
      "score": 1,
      "num_children": 0,
      "author": 19883,
      "replies": []
    },
    {
      "id": "hh5vnc6",
      "text": "Sheeee Alabama am i right...woof",
      "timestamp": "2021-10-18 22:22:25",
      "score": 1,
      "num_children": 0,
      "author": 98418,
      "replies": []
    },
    {
      "id": "hh5w6y1",
      "text": "the judge should have blocked this plea deal.  that is fucked up",
      "timestamp": "2021-10-18 22:26:38",
      "score": 1,
      "num_children": 0,
      "author": 398779,
      "replies": []
    },
    {
      "id": "hh5xnq9",
      "text": "And why not?",
      "timestamp": "2021-10-18 22:38:00",
      "score": 1,
      "num_children": 1,
      "author": 103981,
      "replies": [
        {
          "id": "hh6n6qk",
          "text": "God's will be done, on earth as it is in heaven\n- God probably",
          "timestamp": "2021-10-19 02:02:16",
          "score": 1,
          "num_children": 0,
          "author": 369869,
          "replies": []
        }
      ]
    },
    {
      "id": "hh5xvti",
      "text": "I don't know why the father didn't murder him on the spot. I would",
      "timestamp": "2021-10-18 22:39:46",
      "score": 1,
      "num_children": 2,
      "author": 199584,
      "replies": [
        {
          "id": "hh6dxyf",
          "text": "They had him marry her.",
          "timestamp": "2021-10-19 00:48:46",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hh6mzmb",
              "text": "It was either that or they would have to execute her and her rapist.  It’s in the Bible after all, so it has to be good...",
              "timestamp": "2021-10-19 02:00:35",
              "score": 2,
              "num_children": 0,
              "author": 182154,
              "replies": []
            }
          ]
        },
        {
          "id": "hh6nqr3",
          "text": "Because most of these Christians think it's the child's fault because why would a man of God do such a thing",
          "timestamp": "2021-10-19 02:06:50",
          "score": 1,
          "num_children": 1,
          "author": 369869,
          "replies": [
            {
              "id": "hh8tiw4",
              "text": "Fuck that is twisted and sickening",
              "timestamp": "2021-10-19 15:45:37",
              "score": 1,
              "num_children": 1,
              "author": 199584,
              "replies": [
                {
                  "id": "hh9etyx",
                  "text": "It is and the worst part is most of the kids start believing it, which can cause some serious mental health issues",
                  "timestamp": "2021-10-19 18:09:11",
                  "score": 1,
                  "num_children": 0,
                  "author": 369869,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hh5y3n1",
      "text": "A shotgun wedding wouldn't have been my solution to this, more like a shotgun funeral. Here's a shovel buddy, start digging.",
      "timestamp": "2021-10-18 22:41:29",
      "score": 1,
      "num_children": 0,
      "author": 27840,
      "replies": []
    },
    {
      "id": "hh5zd53",
      "text": "Something something turn the other cheek",
      "timestamp": "2021-10-18 22:51:30",
      "score": 1,
      "num_children": 0,
      "author": 176244,
      "replies": []
    },
    {
      "id": "hh67jcw",
      "text": "G O D made me rape....\n\nYou cant register G O D as a rapist or lock HIM up....\n\nI should use this excuse too when I go on my CrAZy rampage....",
      "timestamp": "2021-10-18 23:57:11",
      "score": 1,
      "num_children": 0,
      "author": 291675,
      "replies": []
    },
    {
      "id": "hh68kfp",
      "text": "Religion will die someday and people like this too",
      "timestamp": "2021-10-19 00:05:35",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "hh6nue1",
          "text": "Unfortunately I don't think that day will ever come",
          "timestamp": "2021-10-19 02:07:41",
          "score": 1,
          "num_children": 0,
          "author": 369869,
          "replies": []
        }
      ]
    },
    {
      "id": "hh6bi6f",
      "text": "Yes",
      "timestamp": "2021-10-19 00:29:17",
      "score": 1,
      "num_children": 0,
      "author": 112727,
      "replies": []
    },
    {
      "id": "hh6czl6",
      "text": "If there was to be no jail time at all, then it should have only been because he was dragged out into the woods somewhere to never be seen or heard from again.",
      "timestamp": "2021-10-19 00:41:11",
      "score": 1,
      "num_children": 0,
      "author": 228309,
      "replies": []
    },
    {
      "id": "hh6d8qk",
      "text": "Somewhere there are Christians going \"See how persecuted we Christians are - now they're accusing us of rape after the devil causes a pastor's 14 year old bride to divorce him.  We need laws to protect our religion from atheists, Satanists, Muslims, Buddhists, . . .\"",
      "timestamp": "2021-10-19 00:43:15",
      "score": 1,
      "num_children": 0,
      "author": 327193,
      "replies": []
    },
    {
      "id": "hh6eu04",
      "text": "Fuck this piece of shit",
      "timestamp": "2021-10-19 00:55:49",
      "score": 1,
      "num_children": 0,
      "author": 81211,
      "replies": []
    },
    {
      "id": "hh6gvnn",
      "text": "Absolute bullshit, he belongs in jail for the rest of his predatory life.",
      "timestamp": "2021-10-19 01:12:06",
      "score": 1,
      "num_children": 0,
      "author": 404389,
      "replies": []
    },
    {
      "id": "hh6hp1o",
      "text": "Well, you know, religion",
      "timestamp": "2021-10-19 01:18:33",
      "score": 1,
      "num_children": 0,
      "author": 144485,
      "replies": []
    },
    {
      "id": "hh6i06q",
      "text": "In the article it is stated that it’s an equivalent to buying a minor alcohol a relative of mine who took a plea deal on just such a charge actually did six months jail time so no this is not equivalent it is less",
      "timestamp": "2021-10-19 01:20:59",
      "score": 1,
      "num_children": 0,
      "author": 349221,
      "replies": []
    },
    {
      "id": "hh6ixjb",
      "text": "Disgusting but that is how America operates - no need to be religious this is hell on earth.",
      "timestamp": "2021-10-19 01:28:13",
      "score": 1,
      "num_children": 0,
      "author": 44346,
      "replies": []
    },
    {
      "id": "hh6ki37",
      "text": "I'm genuinely confused about something though. \n\nWhat prevents a random individual as \"registering\" this Jason Greathouse, yes this rapist Jason Greathouse, in the sex offenders registry?",
      "timestamp": "2021-10-19 01:40:35",
      "score": 1,
      "num_children": 2,
      "author": 138373,
      "replies": [
        {
          "id": "hh6mgbb",
          "text": "You can’t. Courts order your name entered.  There’s nothing stopping you from putting up signs all over his home town warning people about this child molester and rapist.  But you can’t just enter a name into the database.  If you want to stay up all night, log onto your local sex offender list.  Be prepared to research all the terms used.  A lot of what the list can do is muted by people being added simply for engaging in consensual sex work.",
          "timestamp": "2021-10-19 01:56:11",
          "score": 1,
          "num_children": 1,
          "author": 182154,
          "replies": [
            {
              "id": "hh6xc5n",
              "text": "Got it. Thanks for the info. 😊",
              "timestamp": "2021-10-19 03:28:09",
              "score": 1,
              "num_children": 0,
              "author": 138373,
              "replies": []
            }
          ]
        },
        {
          "id": "hh6uiar",
          "text": "It's not a dating app, Susan. You don't register yourself and make your profile.",
          "timestamp": "2021-10-19 03:03:48",
          "score": 1,
          "num_children": 1,
          "author": 34143,
          "replies": [
            {
              "id": "hh6xabf",
              "text": "Hehe. Got it. Thanks.",
              "timestamp": "2021-10-19 03:27:43",
              "score": 1,
              "num_children": 0,
              "author": 138373,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hh6m2si",
      "text": "I'm pretty sure that's how the courts give someone motive for murder.",
      "timestamp": "2021-10-19 01:53:08",
      "score": 1,
      "num_children": 0,
      "author": 270514,
      "replies": []
    },
    {
      "id": "hh6ne6d",
      "text": "Sounds about white (...Christian male)",
      "timestamp": "2021-10-19 02:03:57",
      "score": 1,
      "num_children": 0,
      "author": 45404,
      "replies": []
    },
    {
      "id": "hh6p5t4",
      "text": "Burn the fucking church",
      "timestamp": "2021-10-19 02:18:54",
      "score": 1,
      "num_children": 0,
      "author": 62187,
      "replies": []
    },
    {
      "id": "hh6p8k5",
      "text": "Fuck the parents, what a bunch of shit bags!",
      "timestamp": "2021-10-19 02:19:31",
      "score": 1,
      "num_children": 0,
      "author": 298669,
      "replies": []
    },
    {
      "id": "hh6s6ty",
      "text": "Ugh. Always demoralizing to read shit like this when pedos get off. Especially when you find out that (shockingly) religion was once again used to hide the fact that it happened to begin with.",
      "timestamp": "2021-10-19 02:44:09",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh6seci",
      "text": "Of course its a pastor and he faces no jail time",
      "timestamp": "2021-10-19 02:45:51",
      "score": 1,
      "num_children": 0,
      "author": 118077,
      "replies": []
    },
    {
      "id": "hh6txq4",
      "text": "According to his holy book, he just has to marry her and it's all good.",
      "timestamp": "2021-10-19 02:58:53",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "hh6uy1f",
          "text": "The article says they did get married, at the request of her parents. Divorced a little over a year later. His \"book\" basically tells him he can do anything he wants and get away with it by asking for forgiveness from his imaginary friend in the sky.",
          "timestamp": "2021-10-19 03:07:41",
          "score": 1,
          "num_children": 0,
          "author": 292493,
          "replies": []
        }
      ]
    },
    {
      "id": "hh6vfls",
      "text": "Did Jason promise her mama and her daddy a visitation from Jesus in exchange for not pressing charges?",
      "timestamp": "2021-10-19 03:11:51",
      "score": 1,
      "num_children": 0,
      "author": 357261,
      "replies": []
    },
    {
      "id": "hh6wme1",
      "text": "Well, can't we register him, for him?",
      "timestamp": "2021-10-19 03:22:11",
      "score": 1,
      "num_children": 0,
      "author": 159749,
      "replies": []
    },
    {
      "id": "hh6ws6r",
      "text": "Why fat skins always wearing athleisure? Lmfao goddamn",
      "timestamp": "2021-10-19 03:23:29",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh6xi92",
      "text": "How the fuck does this old sicko get no punishment for this disgusting crap it makes my blood boil.",
      "timestamp": "2021-10-19 03:29:36",
      "score": 1,
      "num_children": 0,
      "author": 395785,
      "replies": []
    },
    {
      "id": "hh6yfdv",
      "text": "Pastor? Rape? Colour me shocked!",
      "timestamp": "2021-10-19 03:37:46",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh6z0uz",
      "text": "Fuck da Jesus.",
      "timestamp": "2021-10-19 03:43:15",
      "score": 1,
      "num_children": 0,
      "author": 325952,
      "replies": []
    },
    {
      "id": "hh6zl3c",
      "text": "Jason Greathouse, child rapist.",
      "timestamp": "2021-10-19 03:48:33",
      "score": 1,
      "num_children": 0,
      "author": 181879,
      "replies": []
    },
    {
      "id": "hh73eri",
      "text": "Add this guy's name to the wall along the lines of Brock Turner the rapist.",
      "timestamp": "2021-10-19 04:27:44",
      "score": 1,
      "num_children": 0,
      "author": 84121,
      "replies": []
    },
    {
      "id": "hh7888f",
      "text": "Someone should execute him.",
      "timestamp": "2021-10-19 05:23:07",
      "score": 1,
      "num_children": 0,
      "author": 40224,
      "replies": []
    },
    {
      "id": "hh78bnp",
      "text": "People like this don't deserve another secure feeling for the rest of their lives. They should be flayed and tattooed with \"rapist\" on their forehead. They should be forced to live the rest of their life in agony and humiliation. Punishment fits the crime.",
      "timestamp": "2021-10-19 05:24:18",
      "score": 1,
      "num_children": 0,
      "author": 262911,
      "replies": []
    },
    {
      "id": "hh78z0x",
      "text": "If some man gets my 14 year old daughter pregnant and I some how have the will power to let the courts decide his fate and he gets off I can assure you he will die screaming. I’ll let his “god” sort it out after I arrange the meeting",
      "timestamp": "2021-10-19 05:32:25",
      "score": 1,
      "num_children": 0,
      "author": 95046,
      "replies": []
    },
    {
      "id": "hh79y1i",
      "text": "If the justice system wont work against people like this, maybe vigilantes are the answer",
      "timestamp": "2021-10-19 05:44:38",
      "score": 1,
      "num_children": 1,
      "author": 270136,
      "replies": [
        {
          "id": "hh7b0dz",
          "text": "According to the article it looks like the defense has/had a pretty good defense in terms of the victim likely bringing this up because of a custody battle going on. The defense would likely say that the only reason that she decided to come forward was to defame their client and use it as leverage in a custody case. The odds of mistrial or not guilty by nullification would be pretty high so they'd rather get him a guilty plea than no conviction at all.  \n\n\nThe system works, the parents should have filed charges when the crime happened instead of forcing them to get married, but religious people are dumb and usually care more about how others perceive their commitment to god over what is the right thing to do.",
          "timestamp": "2021-10-19 05:58:25",
          "score": 2,
          "num_children": 0,
          "author": 311082,
          "replies": []
        }
      ]
    },
    {
      "id": "hh7akkj",
      "text": "What in the Secured, Contained, Protected fuck?",
      "timestamp": "2021-10-19 05:52:39",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh7bqg4",
      "text": "It’s not about what you know, it’s about what you can prove in court",
      "timestamp": "2021-10-19 06:07:57",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh7c4cq",
      "text": "I don't want to incite violence or anything but I can't help but feel a murderous rage at the moment.",
      "timestamp": "2021-10-19 06:13:06",
      "score": 1,
      "num_children": 0,
      "author": 100078,
      "replies": []
    },
    {
      "id": "hh7clwg",
      "text": "Time to violate the shit out of that Pastor. Make sure he dont go hell either Mother Fucker!",
      "timestamp": "2021-10-19 06:19:33",
      "score": 1,
      "num_children": 0,
      "author": 91778,
      "replies": []
    },
    {
      "id": "hh7e1ao",
      "text": "The only way I would be okay with this “sentencing” is if he was immediately executed.",
      "timestamp": "2021-10-19 06:39:00",
      "score": 1,
      "num_children": 0,
      "author": 150977,
      "replies": []
    },
    {
      "id": "hh7g14t",
      "text": "The only possible extenuating circumstances would be a negative paternity test. Otherwise, the entire case is open and shut. \n\n>Here's a young woman, here's her birth certificate; here's her child, here's the child's birth certificate; here's the DNA test showing that the accused is the father of the child. On this whiteboard I put the calculations showing how old the victim was at the time of the statutory rape.\n\nWTF sort of pussy is the DA that he worries he couldn't get a conviction?",
      "timestamp": "2021-10-19 07:07:34",
      "score": 1,
      "num_children": 0,
      "author": 279422,
      "replies": []
    },
    {
      "id": "hh7h462",
      "text": "God's will",
      "timestamp": "2021-10-19 07:23:50",
      "score": 1,
      "num_children": 0,
      "author": 101158,
      "replies": []
    },
    {
      "id": "hh7irci",
      "text": "Could this David Harrison, practicing in Alabama where this case took place, be the pastor's attorney?\n\nhttps://legalschnauzer.blogspot.com/2017/05/lawyer-david-j-harrison-whose-sketchy.html",
      "timestamp": "2021-10-19 07:49:02",
      "score": 1,
      "num_children": 0,
      "author": 61159,
      "replies": []
    },
    {
      "id": "hh7j1le",
      "text": "No jury would possibly convict her for setting things right.",
      "timestamp": "2021-10-19 07:53:24",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh7lk09",
      "text": "What the actual fuck?!?",
      "timestamp": "2021-10-19 08:32:05",
      "score": 1,
      "num_children": 0,
      "author": 102245,
      "replies": []
    },
    {
      "id": "hh7nvf5",
      "text": "Dumpster country",
      "timestamp": "2021-10-19 09:07:26",
      "score": 1,
      "num_children": 0,
      "author": 175360,
      "replies": []
    },
    {
      "id": "hh7o38v",
      "text": "He raped their daughter and the parents urged them to get married!\n\nWTF???",
      "timestamp": "2021-10-19 09:10:45",
      "score": 1,
      "num_children": 1,
      "author": 404635,
      "replies": [
        {
          "id": "hh7spu7",
          "text": "Well, that is literally what the bible teaches on the topic, so I guess we have a case where it would have actually been much better if they'd been religious hypocrites rather than observing the text of their repulsive holy book.",
          "timestamp": "2021-10-19 10:19:30",
          "score": 1,
          "num_children": 0,
          "author": 154419,
          "replies": []
        }
      ]
    },
    {
      "id": "hh7qnnp",
      "text": "Do you believe his charge being dropped has to do with his position in the clergy?\n\nOk so looking at the article it seems like some bullshit plea deal, but who the hell knows.",
      "timestamp": "2021-10-19 09:49:37",
      "score": 1,
      "num_children": 0,
      "author": 407178,
      "replies": []
    },
    {
      "id": "hh7sgav",
      "text": "Joseph Smith reincarnated.",
      "timestamp": "2021-10-19 10:15:45",
      "score": 1,
      "num_children": 0,
      "author": 303752,
      "replies": []
    },
    {
      "id": "hh7z6mu",
      "text": "Execution. Slowly. And painfully.\n\nCruel but not unusual. The Constitution bans cruel *and* unusual punishment, though given how little attention as paid to Article the Third separating church and state, I think we can safely ignore Article the Tenth too.",
      "timestamp": "2021-10-19 11:39:33",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh7zhw9",
      "text": "You know how we're currently going through this phase where slavers 50 to 200 years oh the past are having their names in history re-written to be representive of the scum they were? Yeah, the 23rd and 24th century is going to be just like that for paedophile priests and other horrible things the church has done, once society becomes enlightened enough to purge this kind of crap from giving out free passes to their sick friends.",
      "timestamp": "2021-10-19 11:42:55",
      "score": 1,
      "num_children": 0,
      "author": 105771,
      "replies": []
    },
    {
      "id": "hh81gx2",
      "text": "This is America, shit hole of the West, Talabani by another name, same religious crap, hope they burn in their own hell.",
      "timestamp": "2021-10-19 12:03:41",
      "score": 1,
      "num_children": 0,
      "author": 2580,
      "replies": []
    },
    {
      "id": "hh8205r",
      "text": "This is a justice system being broken and a church allowing a child predator. This isn't a religion wide issue. Don't worry, we hate these people too",
      "timestamp": "2021-10-19 12:09:08",
      "score": 1,
      "num_children": 0,
      "author": 36460,
      "replies": []
    },
    {
      "id": "hh82nna",
      "text": "So the case is dismissed because they think it's vindictive or blackmail to get her kid back, but they never say who has the kid. Either her parents or the rapist. Either way, after her parents did what they did to her, why would she want them raising another child?",
      "timestamp": "2021-10-19 12:15:46",
      "score": 1,
      "num_children": 0,
      "author": 28665,
      "replies": []
    },
    {
      "id": "hh82oqg",
      "text": "Disgusting",
      "timestamp": "2021-10-19 12:16:04",
      "score": 1,
      "num_children": 0,
      "author": 201413,
      "replies": []
    },
    {
      "id": "hh840ci",
      "text": "This is perfectly just and fine, the judge must've ordered a castration and total removal of genitalia to let him off jail and the list. Right? RIGHT?\n\nI miss justice.",
      "timestamp": "2021-10-19 12:28:57",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh87dn0",
      "text": "This is why I wanted to check out of life. Fuck this cunt, Jason Greathouse",
      "timestamp": "2021-10-19 12:59:30",
      "score": 1,
      "num_children": 0,
      "author": 133639,
      "replies": []
    },
    {
      "id": "hh87kup",
      "text": "This is a church thing with pastors. Town around me had a FBI sting on a child predator and the newspaper just printed the final article where he was finally sentenced to like 15 years and guess who wrote a letter to the judge saying he was a good guy? His fucking pastor.\nEdit. Me saying 15 years kinda just pissed me off cause any case involving a child should be instant life or worse. Maybe drop em all on a island in the middle of the ocean with nothing and let nature take take over.",
      "timestamp": "2021-10-19 13:01:16",
      "score": 1,
      "num_children": 0,
      "author": 223075,
      "replies": []
    },
    {
      "id": "hh8896d",
      "text": "It was Gods plan",
      "timestamp": "2021-10-19 13:07:09",
      "score": 1,
      "num_children": 0,
      "author": 184264,
      "replies": []
    },
    {
      "id": "hh88m0e",
      "text": "This judical system is a fucking joke.",
      "timestamp": "2021-10-19 13:10:13",
      "score": 1,
      "num_children": 0,
      "author": 185938,
      "replies": []
    },
    {
      "id": "hh88ydl",
      "text": "Someone needs to castrate this guy…not a fan of the short eyes….😈",
      "timestamp": "2021-10-19 13:13:06",
      "score": 1,
      "num_children": 0,
      "author": 262676,
      "replies": []
    },
    {
      "id": "hh8cesy",
      "text": "Wow this is totally fucked up. I hope this pastor gets hit by a truck while on Unsupervised probation for 2 years… that’s all that’s all he’s getting for raping a 14 year old girl, when he was 24. Fucking disgusting, putrid, vile, grimy sick shit.",
      "timestamp": "2021-10-19 13:41:32",
      "score": 1,
      "num_children": 0,
      "author": 233778,
      "replies": []
    },
    {
      "id": "hh8ggnj",
      "text": "Praise Jesus and his mercy. Lol nah fuck that guy.",
      "timestamp": "2021-10-19 14:13:03",
      "score": 1,
      "num_children": 0,
      "author": 134311,
      "replies": []
    },
    {
      "id": "hh8gqat",
      "text": "There should be a billboard campaign.  Like, GOT JESUS, touching you inappropriately call 1-800-xxx-xxxx",
      "timestamp": "2021-10-19 14:15:05",
      "score": 1,
      "num_children": 0,
      "author": 134311,
      "replies": []
    },
    {
      "id": "hh8hvzx",
      "text": "Her parents consigned that bullshit. They are as disgusting as him.",
      "timestamp": "2021-10-19 14:23:38",
      "score": 1,
      "num_children": 0,
      "author": 384883,
      "replies": []
    },
    {
      "id": "hh8j8zl",
      "text": "This happened a lot in Turkey among Muslim Imams too",
      "timestamp": "2021-10-19 14:33:21",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh8jthb",
      "text": "Psssst\n\n&#x200B;\n\n^(I guess all that praying he did must have worked)\n\n^(lol)",
      "timestamp": "2021-10-19 14:37:23",
      "score": 1,
      "num_children": 0,
      "author": 339233,
      "replies": []
    },
    {
      "id": "hh8k9u1",
      "text": "So, in short\n He got treaded like a female sex offender?",
      "timestamp": "2021-10-19 14:40:38",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hh8lovd",
      "text": "Jason Greathouse is a Christian rapist. What's the good book say Jason, you reap what you sow",
      "timestamp": "2021-10-19 14:50:39",
      "score": 1,
      "num_children": 0,
      "author": 155683,
      "replies": []
    },
    {
      "id": "hh8lvoa",
      "text": "I think I’d rather go to hell (fake, but it gets the point across) than have to live like this",
      "timestamp": "2021-10-19 14:52:00",
      "score": 1,
      "num_children": 0,
      "author": 341951,
      "replies": []
    },
    {
      "id": "hh8mhr7",
      "text": "How do these guys get away like this? Real question, I don’t have a lot of time to read about it. Like what loophole exists for this shit?",
      "timestamp": "2021-10-19 14:56:19",
      "score": 1,
      "num_children": 0,
      "author": 111138,
      "replies": []
    },
    {
      "id": "hh8mubn",
      "text": "More trash for the incinerator. If they won't burn in hell than burn them in real life.",
      "timestamp": "2021-10-19 14:58:46",
      "score": 1,
      "num_children": 0,
      "author": 281828,
      "replies": []
    },
    {
      "id": "hh8nrdq",
      "text": "Here she is at 24 https://www.instagram.com/p/CVJYJaJPHwG/?utm_medium=copy_link",
      "timestamp": "2021-10-19 15:05:17",
      "score": 1,
      "num_children": 0,
      "author": 124342,
      "replies": []
    },
    {
      "id": "hh8obey",
      "text": "WHAT THE FUCK",
      "timestamp": "2021-10-19 15:09:14",
      "score": 1,
      "num_children": 0,
      "author": 278688,
      "replies": []
    },
    {
      "id": "hh8rjze",
      "text": "Things like this make me have zero issues advocating for violence. This “youth pastor” deserves anything that might come his way.\n\nEdit: would prefer the irony of dude getting raped in prison repeatedly, but that ship has sailed.",
      "timestamp": "2021-10-19 15:31:56",
      "score": 1,
      "num_children": 0,
      "author": 201026,
      "replies": []
    },
    {
      "id": "hh8vdl8",
      "text": "Just chop his balls off, and serve baked to her parents while forcing the pastor to watch while his balls are consumed, the parents are just as bad.",
      "timestamp": "2021-10-19 15:58:29",
      "score": 1,
      "num_children": 0,
      "author": 98202,
      "replies": []
    },
    {
      "id": "hh8wdxf",
      "text": "The only real reason for him not to be in jail or on the registry is that he would be 6 feet under.",
      "timestamp": "2021-10-19 16:05:38",
      "score": 1,
      "num_children": 0,
      "author": 254950,
      "replies": []
    },
    {
      "id": "hh95wkl",
      "text": "Honest want to throw up just reading this news.",
      "timestamp": "2021-10-19 17:10:05",
      "score": 1,
      "num_children": 0,
      "author": 82245,
      "replies": []
    },
    {
      "id": "hh96qdc",
      "text": "Religious people strikes again, shit like this would never end if people keep blindly follow fucktard leaders like this",
      "timestamp": "2021-10-19 17:15:40",
      "score": 1,
      "num_children": 0,
      "author": 7281,
      "replies": []
    },
    {
      "id": "hhaju5o",
      "text": "Of all evil it may have caused, at least Christianity doesn't believe that a pedophile can be a prophet.",
      "timestamp": "2021-10-19 22:48:30",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "hhakbl5",
          "text": "And this, my children is why out of christianity there arose civilisation; constant childhood trauma would have inhibited similar in certain religions.",
          "timestamp": "2021-10-19 22:52:07",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hhcc74o",
      "text": "Tbh God gets proxies to impregnate young girls too. Seems normal.",
      "timestamp": "2021-10-20 09:34:33",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hhh3b0g",
      "text": "Strange.  I would have given him the literal hardest sentence I could fucking throw at rapist Jason Greathouse.  Sent the parents to be mentally evaluated.  Like how is it even possible that this man isn’t being turned into some bigger prisoners pocket pussy.",
      "timestamp": "2021-10-21 10:21:22",
      "score": 1,
      "num_children": 0,
      "author": 362740,
      "replies": []
    },
    {
      "id": "hhp31wn",
      "text": "There are people who pretend to be good people because they have good titles but not all pastors are like this the internet spread so much of this one thing but the don’t spread the truth ik what this man did was evil but not all pastors do this to children",
      "timestamp": "2021-10-23 02:02:27",
      "score": 1,
      "num_children": 0,
      "author": 162324,
      "replies": []
    },
    {
      "id": "hhphuxn",
      "text": "What the actual fuck?? What kinda bizarro world bullshit is this?",
      "timestamp": "2021-10-23 04:22:05",
      "score": 1,
      "num_children": 0,
      "author": 243189,
      "replies": []
    },
    {
      "id": "hi1df93",
      "text": "Nothing new to see here folks. This is how the act in private",
      "timestamp": "2021-10-25 21:42:24",
      "score": 1,
      "num_children": 0,
      "author": 326246,
      "replies": []
    },
    {
      "id": "hibrqjz",
      "text": "I just can't stop picturing what their marriage was like and how hard it must have been for her to leave him. If her parents response to her being raped was to marry her to the rapist they wouldn't have been a big help. So you have 14 year old who's pregnant and now living with her rapist. A 14 who was probably always taught to obey authority, preachers, her husband, etc. A 14 year old who couldn't work, get a lease on an apartment, who couldn't drive, who didn't have any money, who wouldn't know how to do taxes, open a bank account on her own, manage her own life. The power dynamics in that marriage... married to a man who enjoys forcing himself on young girls. Who still to this day has access to his child and other peoples children....\n\nWhat was that year of marriage like?",
      "timestamp": "2021-10-28 01:37:26",
      "score": 1,
      "num_children": 0,
      "author": 376112,
      "replies": []
    },
    {
      "id": "hj7j95z",
      "text": "WTF",
      "timestamp": "2021-11-03 22:24:52",
      "score": 1,
      "num_children": 0,
      "author": 104854,
      "replies": []
    },
    {
      "id": "hkk49kt",
      "text": "Objective morality lmao",
      "timestamp": "2021-11-14 06:41:03",
      "score": 1,
      "num_children": 0,
      "author": 339110,
      "replies": []
    },
    {
      "id": "hh6qtqp",
      "text": "this subreddit could also be called “negative things about religion”",
      "timestamp": "2021-10-19 02:32:50",
      "score": -17,
      "num_children": 3,
      "author": 104604,
      "replies": [
        {
          "id": "hh7uikj",
          "text": "Wait, there are positives?",
          "timestamp": "2021-10-19 10:43:34",
          "score": 10,
          "num_children": 0,
          "author": 117253,
          "replies": []
        },
        {
          "id": "hh8d328",
          "text": "So you think we shouldn’t speak about the fact that there are hundreds of thousands of rape and molestation victims where the perpetrators were priests and other prominent church members?",
          "timestamp": "2021-10-19 13:46:53",
          "score": 6,
          "num_children": 1,
          "author": 78,
          "replies": [
            {
              "id": "hh8f3a4",
              "text": "lmao thats not what im saying at all",
              "timestamp": "2021-10-19 14:02:31",
              "score": -5,
              "num_children": 1,
              "author": 104604,
              "replies": [
                {
                  "id": "hhcb0f5",
                  "text": "Well i mean this is atheism. Atheist don’t believe in religions and we do highly dislike people who use their position of power **within a religion** to abuse people",
                  "timestamp": "2021-10-20 09:16:29",
                  "score": 3,
                  "num_children": 0,
                  "author": 78,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hh9d6b6",
          "text": "Tell me you support the pastor who raped a 14year old without telling me you support the pastor who raped a 14 year old ^^",
          "timestamp": "2021-10-19 17:58:11",
          "score": 1,
          "num_children": 0,
          "author": 168425,
          "replies": []
        }
      ]
    },
    {
      "id": "hh5pkin",
      "text": "I'm just trying to understand what happened and not defending this pos or justifying the lack of punishment but when they say he raped her, was it forcible rape or rape in the sense that it was with a minor? \n\nI ask because my mind is trying to grasp this extra layer of fucked-up-ness that if it was forcible rape, that the parents still thought marriage was the right way to go.",
      "timestamp": "2021-10-18 21:36:51",
      "score": -20,
      "num_children": 1,
      "author": 228234,
      "replies": [
        {
          "id": "hh5q2ev",
          "text": "A minor cannot consent.",
          "timestamp": "2021-10-18 21:40:31",
          "score": 19,
          "num_children": 1,
          "replies": [
            {
              "id": "hh5qh8j",
              "text": "That's not what I asked but ty. I was already aware of that.",
              "timestamp": "2021-10-18 21:43:31",
              "score": -19,
              "num_children": 2,
              "author": 228234,
              "replies": [
                {
                  "id": "hh5rmtn",
                  "text": "Sex with a minor is therefore always forcible. You obviously didn't understand that.",
                  "timestamp": "2021-10-18 21:51:58",
                  "score": 14,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hh7i6rm",
                      "text": "No, you obviously don't understand the question. As in did he groom her or just walk in her room in the middle of the night and force himself on her? Asking about the specifics of the crime is a problem?",
                      "timestamp": "2021-10-19 07:40:04",
                      "score": -4,
                      "num_children": 1,
                      "author": 228234,
                      "replies": [
                        {
                          "id": "hh8lkbh",
                          "text": "Yes. Because it's irrelevant. Weirdo.",
                          "timestamp": "2021-10-19 14:49:46",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hh8yyin",
                              "text": "Got it. Posting about a crime...good. Asking about said crime... bad. Makes perfect sense.",
                              "timestamp": "2021-10-19 16:23:17",
                              "score": 1,
                              "num_children": 0,
                              "author": 228234,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hh5vpat",
                  "text": "You're not going to get anything other than those responses on here.  If I knew the answer I'd tell you, but I intentionally avoid reading the details of these types of stories.",
                  "timestamp": "2021-10-18 22:22:50",
                  "score": -8,
                  "num_children": 1,
                  "author": 192489,
                  "replies": [
                    {
                      "id": "hh7i9jk",
                      "text": "Yea, I figured that. I was curious about the specifics but apparently that's frowned upon.",
                      "timestamp": "2021-10-19 07:41:16",
                      "score": 1,
                      "num_children": 0,
                      "author": 228234,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hh57ejz",
      "text": "México 24/7",
      "timestamp": "2021-10-18 19:20:35",
      "score": -27,
      "num_children": 1,
      "author": 181254,
      "replies": [
        {
          "id": "hh9djdn",
          "text": "But this is in conservative America…",
          "timestamp": "2021-10-19 18:00:33",
          "score": 1,
          "num_children": 0,
          "author": 168425,
          "replies": []
        }
      ]
    },
    {
      "id": "hh6mbz5",
      "text": "But you gotta show proof of taking an experimental drug to go to a sporting event, restaurant or bar.",
      "timestamp": "2021-10-19 01:55:13",
      "score": -20,
      "num_children": 1,
      "author": 258346,
      "replies": [
        {
          "id": "hh6ufo9",
          "text": "What are you talking about?",
          "timestamp": "2021-10-19 03:03:10",
          "score": 9,
          "num_children": 1,
          "author": 34143,
          "replies": [
            {
              "id": "hh8mv9x",
              "text": "Anti-vaxxer bullshit",
              "timestamp": "2021-10-19 14:58:58",
              "score": 2,
              "num_children": 0,
              "author": 83959,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hh7er64",
      "text": "[removed]",
      "timestamp": "2021-10-19 06:49:03",
      "score": -6,
      "num_children": 1,
      "replies": [
        {
          "id": "hh8dkg7",
          "text": "I mean there are hundreds, if not thousands, of priests who were guilty of molestation or sexual assault/harassment that got off scot free. And not all of them were even kicked out of the church. \n\nAdmit it or not the Church has a lot of political and financial power and they use it to protect it their workers. \n\nAlso religious aspect: it seems he did it whilst in his job/used his position of authority against the child.",
          "timestamp": "2021-10-19 13:50:41",
          "score": 2,
          "num_children": 1,
          "author": 78,
          "replies": [
            {
              "id": "hh8u8ed",
              "text": "So no answer about the actual question? There are some horrible people who “are Christian,” but this story seems saltier than the Red Sea towards Christianity. Shouldn’t we be up in arms about the justice system instead? Bad people will do bad things and we need a justice system that protects the innocent. It seems like that’s what’s wrong. The prosecutors accepted the plea deal… so obviously there is more to the story that should be shared.",
              "timestamp": "2021-10-19 15:50:31",
              "score": 0,
              "num_children": 2,
              "author": 95716,
              "replies": [
                {
                  "id": "hh9dh2c",
                  "text": "I’m sure the judge would have given the same slap on the wrist to a Muslim, atheist or satanist in the same situation… /s",
                  "timestamp": "2021-10-19 18:00:08",
                  "score": 1,
                  "num_children": 1,
                  "author": 168425,
                  "replies": [
                    {
                      "id": "hha63b6",
                      "text": "[removed]",
                      "timestamp": "2021-10-19 21:08:26",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hhaduw1",
                          "text": "Ohh so he didn’t get a free pass to rape a 14 year old because of Christianity? ‘Soy boys’ stand up for 14 year old victim and alpha(you) excuses it…",
                          "timestamp": "2021-10-19 22:03:49",
                          "score": 1,
                          "num_children": 1,
                          "author": 168425,
                          "replies": [
                            {
                              "id": "hhbgp1f",
                              "text": "Wtf are you talking about? I’m saying that dude is a horrible human being and should be in jail if he did that and that we should be focused on the justice system which let him out rather than him being a Christian. If any random person did this they should be in jail. I just don’t get the fascination of him being a “Christian.” The article makes a bigger deal about his religion than how messed up the system is that let him out. How is that productive for society? And then ppl like you trying to ostracize me for saying we should fix the system? Great logic…",
                              "timestamp": "2021-10-20 03:08:42",
                              "score": 1,
                              "num_children": 0,
                              "author": 95716,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hhcawsm",
                  "text": "Some? Dude haven’t you seen the news or statistics of how many priests have **abused their position within the church to molest and sexually abuse people**?",
                  "timestamp": "2021-10-20 09:14:53",
                  "score": 1,
                  "num_children": 1,
                  "author": 78,
                  "replies": [
                    {
                      "id": "hhddxa9",
                      "text": "Why don’t you enlighten me on the statistics then since you have it readily available since you clearly are either too stubborn to admit the justice system is the real problem or too salty at organized religion. What percentage of Christian priests/pastors have been found guilty of rape/molestation? Quote your source with actual statistics and court records since this is where you want to go…",
                      "timestamp": "2021-10-20 15:26:28",
                      "score": 1,
                      "num_children": 1,
                      "author": 95716,
                      "replies": [
                        {
                          "id": "hhgirab",
                          "text": "https://www.iicsa.org.uk/reports-recommendations/publications/investigation/roman-catholic-church/part-i-reporting-child-sexual-abuse-cases/i2-reporting-statistics\n\nhttp://www.notinourchurch.com/statistics.html\n\nhttps://www.abuselawsuit.com/church-sex-abuse/\n\nhttps://www.nytimes.com/2021/10/05/world/europe/france-catholic-church-abuse.amp.html\n\nhttps://www.researchgate.net/profile/Karen-Terry-3/publication/247523934_Understanding_the_Sexual_Abuse_Crisis_in_the_Catholic_Church_Challenges_with_Prevention_Policies/links/56a8020f08ae997e22bc2a65/Understanding-the-Sexual-Abuse-Crisis-in-the-Catholic-Church-Challenges-with-Prevention-Policies.pdf?origin=publication_detail\n\n”\"The majority of accused priests in the United States (55.7%) had one formal allegation of abuse made against them, 26.4% had two or three allegations, 17.8% had four to nine allegations, and 3.5% had ten or more allegations.\" A major aggravating factor was the actions of Catholic bishops to keep these crimes secret ...”\n\nhttps://en.m.wikipedia.org/wiki/Catholic_Church_sex_abuse_cases_in_the_United_States \n\nAnd you can google resources in different countries",
                          "timestamp": "2021-10-21 05:25:05",
                          "score": 2,
                          "num_children": 1,
                          "author": 78,
                          "replies": [
                            {
                              "id": "hhi1to5",
                              "text": "So you take this long just to put together a data dump with data I didn’t ask for? Seriously… what are you getting out of this? I specifically asked for priests who have been found guilty, not allegations against them, and what % of total priests have been accused? If you plan to just skirt around my direct questions when you’re the one who wanted to bring up statistics, just stop wasting your own time.",
                              "timestamp": "2021-10-21 15:30:29",
                              "score": 1,
                              "num_children": 1,
                              "author": 95716,
                              "replies": [
                                {
                                  "id": "hhi49hq",
                                  "text": "Yeah it’s called the church covering it up, hiding evidence. You’re so faithful you’re blind. \n\nThere’s a lot of news of the churches covering up abuse allegations and church has money therefore they can invest ridiculous amounts of money to support their priests. Guess how many priests caught and accused of pedophilia and rape have been kicked out of the church? Not many. \n\nTrust me the justice system is an issue and it’s even more an issue when the guilty party has money. \n\nBut this isn’t about the justice system, this is about priests abusing their position in the church to rape fucking children.",
                                  "timestamp": "2021-10-21 15:47:21",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 78,
                                  "replies": [
                                    {
                                      "id": "hhifoiu",
                                      "text": "I’m so faithful I’m blind? I’m agnostic… why would my faith in agnostic beliefs make me blind towards Christian abuse? The fact is I asked for specific statistics, a topic you criticized me for not knowing, and you failed to present me those statistics. You then use terms like “not many” and “ridiculous amounts of money” with 0 evidence or source or statistical quantification… and you’re the one who wanted to talk statistics… If you actually thought critically for a moment, you’d realize your stats actually prove my point… all these allegations and no guilty verdicts.",
                                      "timestamp": "2021-10-21 17:03:09",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 95716,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}