{
  "id": "qen92z",
  "text": "Gender roles for thee, but not for me\n",
  "timestamp": "2021-10-24 07:23:29",
  "score": 758,
  "subreddit": "t5_2zaj2",
  "num_children": 25,
  "author": 217413,
  "replies": [
    {
      "id": "hhu5jn4",
      "text": "Well if she had to take out the trash she would have to take herself out",
      "timestamp": "2021-10-24 07:31:25",
      "score": 120,
      "num_children": 1,
      "author": 241440,
      "replies": [
        {
          "id": "hhu6945",
          "text": "Yep. KilL tEh MeNz (c)",
          "timestamp": "2021-10-24 07:41:03",
          "score": 31,
          "num_children": 1,
          "author": 394886,
          "replies": [
            {
              "id": "hhu6d1y",
              "text": "If ThE MeNZ DiE sOciEtY cOLLaPsEs",
              "timestamp": "2021-10-24 07:42:31",
              "score": 21,
              "num_children": 1,
              "author": 241440,
              "replies": [
                {
                  "id": "hhu6jy8",
                  "text": "that's not what feminist ~~prophets~~ advocates state will happen",
                  "timestamp": "2021-10-24 07:45:12",
                  "score": 20,
                  "num_children": 1,
                  "author": 394886,
                  "replies": [
                    {
                      "id": "hhu6nif",
                      "text": "They too blind to see , if every man were to disappear rn , they would realise how wrong they were",
                      "timestamp": "2021-10-24 07:46:34",
                      "score": 21,
                      "num_children": 1,
                      "author": 241440,
                      "replies": [
                        {
                          "id": "hhu6wlr",
                          "text": "man i'm just fooling around here\n\nif every men disappeared right now they'll only increase their whining because suddenly all the jobs with high wages would be theirs but they had and would have zero desire to do them\n\nbut menz would still be bad, this time because they all died off like cowards",
                          "timestamp": "2021-10-24 07:50:11",
                          "score": 21,
                          "num_children": 1,
                          "author": 394886,
                          "replies": [
                            {
                              "id": "hhu7jsd",
                              "text": "* collapses in the weight of responsibility *",
                              "timestamp": "2021-10-24 07:59:23",
                              "score": 14,
                              "num_children": 1,
                              "author": 241440,
                              "replies": [
                                {
                                  "id": "hhu7ny6",
                                  "text": "exactly",
                                  "timestamp": "2021-10-24 08:00:59",
                                  "score": 7,
                                  "num_children": 0,
                                  "author": 394886,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hhurov1",
      "text": "It’s framed as cute, but this is what men are dealing with. Women won’t do their own traditional roles or news ones.",
      "timestamp": "2021-10-24 12:28:55",
      "score": 57,
      "num_children": 3,
      "replies": [
        {
          "id": "hhuum44",
          "text": "Well, that will force them to teach their cats to do it! 🤣",
          "timestamp": "2021-10-24 12:57:29",
          "score": 18,
          "num_children": 0,
          "author": 67617,
          "replies": []
        },
        {
          "id": "hhylqz7",
          "text": "[deleted]",
          "timestamp": "2021-10-25 07:33:30",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "hhylrqq",
              "text": "[deleted]",
              "timestamp": "2021-10-25 07:33:46",
              "score": -2,
              "num_children": 3,
              "replies": [
                {
                  "id": "hhyls7a",
                  "text": "Hey GenderNeutralBot, listen up.\n\nThe words Human and Mankind, derive from the Latin word humanus, which is gender neutral and means \"people of earth\".\nIt's a mix of the words Humus (meaning earth) and Homo (gender neutral, meaning Human or People).\nThus words like Fireman, Policeman, Human, Mankind, etc are not sexist in of it self.\nThe only sexism you will find here is the one you yourself look upon the world with.\n\n-----\n\n^(I am a bot, downvoting will not remove this reply.)\n\n^(\"Two things are infinite: the universe and human stupidity, and I’m not sure about the universe.\" -Albert Einstein)",
                  "timestamp": "2021-10-25 07:33:57",
                  "score": 5,
                  "num_children": 0,
                  "author": 280125,
                  "replies": []
                },
                {
                  "id": "hhylsa7",
                  "text": "Hey /u/GenderNeutralBot\n\nI want to let you know that you are being very obnoxious and everyone is annoyed by your presence.\n\n^(I am a bot. Downvotes won't remove this comment. If you want more information on gender-neutral language, just know that nobody associates the \"corrected\" language with sexism.)\n\n_^(People who get offended by the pettiest things will only alienate themselves.)_",
                  "timestamp": "2021-10-25 07:33:58",
                  "score": 3,
                  "num_children": 0,
                  "author": 147503,
                  "replies": []
                },
                {
                  "id": "hhylt24",
                  "text": "Lol no",
                  "timestamp": "2021-10-25 07:34:16",
                  "score": 2,
                  "num_children": 0,
                  "author": 351530,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hi2vn3m",
          "text": "Lol more women right now are doing both roles than ever, as are more men. Don’t know where you’re getting the idea that all women are sitting around on their asses",
          "timestamp": "2021-10-26 05:06:45",
          "score": -1,
          "num_children": 0,
          "author": 99239,
          "replies": []
        }
      ]
    },
    {
      "id": "hhupash",
      "text": "But she’s a strong independent woman/s",
      "timestamp": "2021-10-24 12:03:20",
      "score": 31,
      "num_children": 0,
      "author": 312365,
      "replies": []
    },
    {
      "id": "hhum2i8",
      "text": "lol so then she doesn't believe that gender role are bad then.",
      "timestamp": "2021-10-24 11:24:46",
      "score": 24,
      "num_children": 0,
      "author": 302075,
      "replies": []
    },
    {
      "id": "hhv28aj",
      "text": "Wait until a man says \" I am not cooking and cleaning in a house where a woman lives.\"",
      "timestamp": "2021-10-24 14:05:42",
      "score": 14,
      "num_children": 0,
      "author": 227605,
      "replies": []
    },
    {
      "id": "hhuwpib",
      "text": "Good thing there’s this orange border, otherwise I wouldn’t know what I am supposed to look at",
      "timestamp": "2021-10-24 13:17:37",
      "score": 11,
      "num_children": 1,
      "author": 254345,
      "replies": [
        {
          "id": "hhxbz1k",
          "text": "Yeah it was hard to pick out, amongst all the other text.",
          "timestamp": "2021-10-24 23:50:20",
          "score": 4,
          "num_children": 0,
          "author": 145931,
          "replies": []
        }
      ]
    },
    {
      "id": "hhvqs0q",
      "text": "I know gender roles are bad, but i'm never doing dishes or vacuuming in a house where a woman lives.",
      "timestamp": "2021-10-24 17:04:13",
      "score": 8,
      "num_children": 0,
      "author": 24042,
      "replies": []
    },
    {
      "id": "hhvjuck",
      "text": "you have to loose them fancy nails to do those first.",
      "timestamp": "2021-10-24 16:17:54",
      "score": 5,
      "num_children": 0,
      "author": 280069,
      "replies": []
    },
    {
      "id": "hhuvpr6",
      "text": "\"I know gender roles are bad\"\n\nYou know Wrong lol",
      "timestamp": "2021-10-24 13:08:11",
      "score": 12,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hhvpnl9",
      "text": "Dude if you dont like grass you can modify your yard.",
      "timestamp": "2021-10-24 16:56:29",
      "score": 3,
      "num_children": 0,
      "author": 305452,
      "replies": []
    },
    {
      "id": "hhvugzi",
      "text": "nice title",
      "timestamp": "2021-10-24 17:29:15",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hhxpxop",
      "text": "\"I know gender roles are bad, but misandry is perfectly acceptable!\"\n\n—this bish",
      "timestamp": "2021-10-25 01:48:04",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hi47usj",
      "text": "My mom has no issue to do these things and my dad likes to cook. Maybe Bc they aren’t whiny feminists and just do what they gotta do.",
      "timestamp": "2021-10-26 14:17:21",
      "score": 3,
      "num_children": 0,
      "author": 402180,
      "replies": []
    },
    {
      "id": "hhurn4v",
      "text": "Zero turn mowers are fun. Ijs 😂\n Even I've taken out the trash 🤣🤣",
      "timestamp": "2021-10-24 12:28:25",
      "score": 3,
      "num_children": 1,
      "author": 91706,
      "replies": [
        {
          "id": "hhvi356",
          "text": "Yard work is great exercise too!",
          "timestamp": "2021-10-24 16:05:52",
          "score": 4,
          "num_children": 1,
          "author": 339351,
          "replies": [
            {
              "id": "hhvj7th",
              "text": "We plant a garden every year.  It's rewarding work .",
              "timestamp": "2021-10-24 16:13:34",
              "score": 4,
              "num_children": 0,
              "author": 91706,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hhwbfyr",
      "text": "r/uselessredcircle but orange",
      "timestamp": "2021-10-24 19:22:03",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hhwu0j6",
      "text": "r/facepalm",
      "timestamp": "2021-10-24 21:29:38",
      "score": 2,
      "num_children": 0,
      "author": 94187,
      "replies": []
    },
    {
      "id": "hhwwtt5",
      "text": "Don't you guys think men who don't follow gender roles are pathetic losers? You call men who don't beta males and soyboys",
      "timestamp": "2021-10-24 21:50:21",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hhx6gbc",
      "text": "or leave the toilet seat up.",
      "timestamp": "2021-10-24 23:04:47",
      "score": 2,
      "num_children": 0,
      "author": 9762,
      "replies": []
    },
    {
      "id": "hhxsz4q",
      "text": "Then you'd better be lucky to find a man with low standards.",
      "timestamp": "2021-10-25 02:14:05",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hi2xune",
      "text": "How incompetent do you to have to be to not AT LEAST take out the trash.",
      "timestamp": "2021-10-26 05:33:20",
      "score": 2,
      "num_children": 0,
      "author": 288118,
      "replies": []
    },
    {
      "id": "hilmh89",
      "text": "Man fuck gender roles , chores are a 2 way street idc who does it when as long as it's done before bed .",
      "timestamp": "2021-10-30 03:22:25",
      "score": 2,
      "num_children": 0,
      "author": 127352,
      "replies": []
    },
    {
      "id": "hhxscwd",
      "text": "How to say 'don't let me move in' without actually saying it.\n\nNo matter how well you ring her bell you ain't gettin' waffles the next morning.",
      "timestamp": "2021-10-25 02:08:48",
      "score": 1,
      "num_children": 0,
      "author": 98725,
      "replies": []
    },
    {
      "id": "hi19nld",
      "text": "Yeah, I don't think a lot of people understand that equality means equal responsibilities as well.",
      "timestamp": "2021-10-25 21:15:45",
      "score": 1,
      "num_children": 0,
      "author": 287344,
      "replies": []
    },
    {
      "id": "hi8tawx",
      "text": "This isn’t a feminist viewpoint though.",
      "timestamp": "2021-10-27 13:27:23",
      "score": 1,
      "num_children": 1,
      "author": 290043,
      "replies": [
        {
          "id": "hi8tpmc",
          "text": "They hate gender roles but aren't so enthusiaastic about fighting against the ones that harm men. This person in the post says the quiet part out loud",
          "timestamp": "2021-10-27 13:30:36",
          "score": 3,
          "num_children": 3,
          "author": 217413,
          "replies": [
            {
              "id": "hi8u6vl",
              "text": "I know what they are saying. What I am saying, is that this person is not a feminist, because that is not a feminist viewpoint.",
              "timestamp": "2021-10-27 13:34:25",
              "score": 1,
              "num_children": 0,
              "author": 290043,
              "replies": []
            },
            {
              "id": "hi8ujrr",
              "text": "This is not what feminism stands for, I am a feminist, I hugely disagree with the statement. They are saying gender roles are bad, and then contradicting themselves to reinforce gender roles - which in turn is not a feminist viewpoint. You’re right to be mad at this, but don’t mistake it for standing for feminism, because it definitely doesn’t.",
              "timestamp": "2021-10-27 13:37:14",
              "score": 0,
              "num_children": 1,
              "author": 290043,
              "replies": [
                {
                  "id": "hi95hoh",
                  "text": "From all I can see, feminism does stand for exclusively ending male privileges and not giving a damn about female privileges. \n\nYou may claim otherwise, but the actions of the movement show exactly that. \n\nI can say that about almost every issue.. at the start of the movement, women couldn't vote and men were forced to go to war. Feminists advocated for women's voting rights successfully but have done absolutely nothing to end the draft which still exists.\n\nFeminists protest so much when women's bodily autonomy is hurt in the few states with abortion bans however men have no bodily autonomy because of things like child support(even if the man got raped), circumcision, inability to get vasectomy without spousal consent and much more in so many states, but so much autonomy violation of men somehow doesn't get any amount of protest from the feminists- the people who are supposed to support gender equality.\n\nDuring the MeToo movement, literally nothing was done about the fact that the UK law doesn't even acknowledge male rape victims. The MeToo movement completely ignored male rape victims and moreover gave empowered many false accusations by women.\n\nThe Boko Haram kidnappings... 300 little girls were kidnapped in and feminists made a hashtag \"bring our girls back\" which got worldwide support and even got the support of then-first-lady of the US. However the same terrorist group kidnapped, tortured and burnt 6000 boys alive and feminists talked nowhere near as much about it.\n\nPresident Barrack Obama is probably the most powerful person to ever have called themselves a feminist, he even talked about the wage gap and was often supporting women's rights. Meanwhile, his administration made a war policy to assume every man as a combatant and check for innocence only after killing them. His administration's policy was literally to kill men for being men and he was still supported by feminist organizations.\n\nFeminists in India successfully protested the gender neutralization of rape laws twice.\n\nThe organization Women's March allowed a woman called Donna Hylton to be a leader at their big event and gave her a big voice to speak. Donna was literally convicted of gang-raping an old gay man, torturing and burning him. Feminists tolerated her allowed her to speak at their big event. \n\nMany feminists have no problem using the phrase \"the future is female\" which was the title of a text by a woman called Sally Miller Gearhard. In this text, Gearhard suggested that the male population needs to be reduced to 10% through sex selective abortions. This is the same woman who set up the first feminist and gender studies curriculums in Universities. \n\nA feminist called Mary Koss has designed the Duluth Model of domestic abuse which erases male victims.\n\nFeminists protested against Cassie Jaye's movie about men's issues in Australia and even got it banned.\n\nIntersectional feminists talk so much about the anti black police bias. However I've never ever seen one talk about the anti male bias in policing...almost all police brutality victims are men, they get longer sentences.. it's one of the most egregious forms of discrimination yet you don't here a peep out of the supposed equal rights supporters.\n\nFGM gets much more feminist attention than circumcision even though the percentage of FGM victims are a fraction of the circumcised men.\n\nHow many more examples of feminists focussing solely on women's rights while completely neglecting men's disadvantages do we need to see, before you acknowledge how much biased the movement is towards one gender? I know that you aren't sexist and probably care equally about men's and women's issues. But there are enough biased people in the movement that it has only had female positive results over the decades and all the anti-male discrimination seemingly gets zero attention from them. \n\nThe woman's views are exactly what feminists have been doing forever. Claiming to hate sexism to end male privilege but showing zero interest in wanting to end female privilege.\n\nI know I we're just arguing on the internet but I still thank you a lot for coming on here to interact with people who disagree with you and might be hostil to you. I really appreciate your will to get other perspectives. <3",
                  "timestamp": "2021-10-27 14:56:14",
                  "score": 3,
                  "num_children": 1,
                  "author": 217413,
                  "replies": [
                    {
                      "id": "hi9x93s",
                      "text": "That’s quite a list there! I’m not going to go through and reply to the whole thing. What I will say, is a few things:\n\n1. You will always find examples to back your argument if you look for them, it’s called confirmation bias. What your examples don’t show, is an overall picture, just handpicked examples that back your argument. When presenting an argument, one must always present supporting and opposing evidence to their viewpoint. So I urge you to search for facts and figures that oppose your view that feminists don’t care about gender equality.\n\n2. Those who actually DO identify as feminists but actually believe in women in charge - that’s matriarchy. And that is not feminism.\n\n3. The most recent BLM movement in 2020 was literally sparked by the George Floyd murder, so I do have to disagree on that point. Also, you now know a feminist who has talked about the anti male bias in policing - me! :) \n\n4. What female privilege are you referring to? Would just like more context here.\n\n5. UK law doesn’t really even acknowledge female rape victims. Only 1.6% of rapes reported lead to convictions. And that’s just the reported ones! So many rapes go unreported. The percentage of women raped by men vastly outweighs the percentage of men raped by women. That’s why rape is systemically a women’s problem. Men raped by women is an entirely different issue, and a very important one, but it is not a valid argument against female victims of rape or feminism.\n\nThere’s loads more that I could say, but I’ll be here forever! I get the feeling from your comments, that you and I agree on more than we might initially think. We both agree that genders should be equal. These days the world is more divided than it ever has been, and some of us don’t realise we’re on the same side. \n\nIf you want something to blame, the answer is the patriarchy. The patriarchy negatively affects us all. \n\nThank you to you too for an interesting discussion and your civility in getting your points across.",
                      "timestamp": "2021-10-27 18:00:59",
                      "score": 1,
                      "num_children": 1,
                      "author": 290043,
                      "replies": [
                        {
                          "id": "hiac0j2",
                          "text": "1. Well those are not handpicked examples. I have them from top of my head. For almost every female issue that feminists adress, they ignore and neglect an equivalent male issue. The best analogy AND example would be the boy scouts and the girl scouts. The boy scouts didn't allow girls so they had to change their policies to accomodate girls too and had to change their name to Scouts. This seems good on surface until you realise how noone bothered to do anything about girl scouts which excluded boys so now you have one scout for both and one scout exclusively for girls. This is exactly the type of results the feminist movement has produced. \n\nThere are so many things that are much better for women in the west now than they used to be back in 1800s. They can now vote, it's normalized for them to work, they're going to college at higher rates than men, marital rape is illegal, FGM is illegal at almost every place in the world, women are allowed in politics, they have abortion rights in most states of the U.S. All of this makes you think that feminism as a movement has produced great results until you realise that men are still expected to go to war, they are still treated much harsher by the police, get longer sentences, it's still nowhere near as normalized for them to be housemakers as it is for women to earn, they are still expected to earn more, a woman can have sex with a man without his consent and many american states don't consider it rape neither does the UK, genital mutilation of men is legal in every place, domestic violence laws still favour women even in situations where they are the abuser, over 99% of DV shelters don't even accept male victims and much more. The sexism against women has decreased so much over the last century as pointed by my examples whereas sexism against men is still as bad as men still have all the disadvantages they used have.\n\nWhy is it that all the instances of sexism that feminists have fought against with varying degrees fo success are anti-women whereas all instances of sexism thag feminists haven't addressed are anti-men? Why does feminism as a movement prioritize female disadvantages much more than male disadvantages?\n\n3. I'm glad to have finally met one I guess! But it goes to show a lot that the anti male policing bias gets much less attention among the intersectional feminists than anti black policing bias even though the anti male bias is much stronger(cuz remember george floyd was a man, just like most of the other victims). Speaking against anti black bias we get so many feminist celebrities, activist pages with millions of followers, organizations and much more whereas speaking against anti male policing and court bias, I just have you lol. Also feminists have also made the situation worse by supporting false accusers e.g Amber Heard because of whom Johnny Depp faced charges, had his career opportunities ruined meanwhile Amber gets to act as if she's some empowering figure standing up to abuse. Other example is \n\n4. I'm referring to all the privileges women have just for the virtue of being women.. and how feminists have no interest in ending them anywhere near as they have in ending male privilege.\n\n5. My point about male rape victims isn't against female ones. It's that feminists only ever talk about female victims. This is why the female celebrities who sexually abused men weren't criticized nowhere near as much as the male ones. Biggest example: Donna Hylton. She was literally honored and allowed to speak at the feminist event Women's March even though she raped and tortured an old gay man for days. It's one of the biggest feminist organizations and they have no problem with honoring a convicted rapist just because the victim was a man and you still can't empathize with the viewpoint that the movement is biased towards women. \n\nOf course we agree on how things should be between men, women and the other genders. You don't hate men and I don't hate women and we believe in gender equality it seems. We just disagree on the role the feminist movement plays in that.",
                          "timestamp": "2021-10-27 19:36:17",
                          "score": 3,
                          "num_children": 0,
                          "author": 217413,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hi8uu6a",
              "text": "But also understand that everyone is always learning and unlearning, and that sometimes people get it wrong. She might identify as a feminist, but doesn’t understand the internalised misogyny that has been ingrained into her through the patriarchy - this is where the unlearning part comes in, and it’s a journey.",
              "timestamp": "2021-10-27 13:39:30",
              "score": 0,
              "num_children": 1,
              "author": 290043,
              "replies": [
                {
                  "id": "hi8yi1q",
                  "text": "I don't understand how the things she says is mysoginist? It's enforcing stuff on men so it's more like misandry",
                  "timestamp": "2021-10-27 14:07:10",
                  "score": 3,
                  "num_children": 1,
                  "author": 217413,
                  "replies": [
                    {
                      "id": "hi93fk3",
                      "text": "Because she’s minimising the value of women by stating that those are jobs for men. When in reality, women are fully capable to cut grass and take out the trash.",
                      "timestamp": "2021-10-27 14:42:13",
                      "score": 0,
                      "num_children": 1,
                      "author": 290043,
                      "replies": [
                        {
                          "id": "hi95tgz",
                          "text": "So if a man doesn't wanna do a traditionally woman's job, would that be misandry since he's minimizing the value of men by stating those things are for women?",
                          "timestamp": "2021-10-27 14:58:27",
                          "score": 3,
                          "num_children": 1,
                          "author": 217413,
                          "replies": [
                            {
                              "id": "hi9tr56",
                              "text": "More likely toxic masculinity which I see as more closely linked with internalised misogyny than misandry. Both these things are bad, and both a product of the patriarchy!",
                              "timestamp": "2021-10-27 17:38:43",
                              "score": -1,
                              "num_children": 1,
                              "author": 290043,
                              "replies": [
                                {
                                  "id": "hiachal",
                                  "text": "Why is it called \"toxic masculinity\" instead of \"internalized misandry\" when men do it? And why is it called \"internalized mysoginy\" instead of \"toxic femininity\" when women do it? \n\nWe're talking about essentially the same thing in both cases aren't we? Why is it that the focus is on MASCULINITY when men do it but MISOGYNY when women do it?",
                                  "timestamp": "2021-10-27 19:39:17",
                                  "score": 3,
                                  "num_children": 2,
                                  "author": 217413,
                                  "replies": [
                                    {
                                      "id": "himnvlh",
                                      "text": "because feminists choose their terms in a way that everything can be blame on men. calling it \"toxic femininity\" will pass the idea that women can be awful too, and feminists don't want that",
                                      "timestamp": "2021-10-30 10:52:40",
                                      "score": 3,
                                      "num_children": 0,
                                      "replies": []
                                    },
                                    {
                                      "id": "hiaymfb",
                                      "text": "Because women are the gender that is systemically oppressed. We do not have privilege. So hatred from women towards other women, is internalised misogyny.\n\nMen are not systemically oppressed, and misandry is not systemically a problem. \n\nHowever, there are still negative implications of the patriarchy that affect men, regardless of privilege.\n\nTo explain in the simplest terms:\n- if a man was to display ‘too much’ emotion, who would be policing that? Women? Or men? I think we can all agree that men are the ones who make other men feel like they are unable to show emotion? That is toxic masculinity. \n- if a woman was to show ‘too much’ emotion, who would be policing that? Men...but also women. We are branded as too emotional over and over again by men (misogyny). But we also have the issue of women wanting to brand themselves as not falling into this category of too emotional - internalised misogyny.\n\nI have used a very specific example here for the sake of explanation. I am not saying that every situation can be explained in this way, as it is not so black and white. I’m simply trying to demonstrate the way in which misogyny is systemically an issue, whereas misandry is not.",
                                      "timestamp": "2021-10-27 22:03:13",
                                      "score": 0,
                                      "num_children": 3,
                                      "author": 290043,
                                      "replies": [
                                        {
                                          "id": "hic9yow",
                                          "text": "How is misandry not systemic? There are literal systems in place that discriminate against men systrmatically. Please look at [this](https://www.instagram.com/p/CHN7tqQA-MS/?utm_medium=copy_link) post. How come laws, judicia SYSTEMS, school SYSTEMS etc discrimnate against men and you still believe that all this is not systemic?\n\nUmm no there's plenty of evidence that women police that behaviour in men too. Mothers play a huge role in discouraging boys from that behavior and telling them to man up. Women often say that it's unattractive and feminine. You have to go out of your way to avoid things that women do to prevent men from showing emotions. There are many women who complain about having to do too much \"emotional labor\" for men, who find it funny when guys cry, who use their insecurities against them.",
                                          "timestamp": "2021-10-28 04:02:53",
                                          "score": 3,
                                          "num_children": 1,
                                          "author": 217413,
                                          "replies": [
                                            {
                                              "id": "hjnxwvv",
                                              "text": "Just from the phrase that \"misandry is not a problem\" you can understand how incoherent and sexist feminists are",
                                              "timestamp": "2021-11-07 12:11:35",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 282441,
                                              "replies": [
                                                {
                                                  "id": "hjpjz74",
                                                  "text": "I didn’t say it’s not a problem. I said it’s not systemic. There’s a difference.",
                                                  "timestamp": "2021-11-07 19:14:57",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 290043,
                                                  "replies": [
                                                    {
                                                      "id": "hjsktia",
                                                      "text": "It is, but feminists don't consider it because they only cares about women",
                                                      "timestamp": "2021-11-08 11:50:40",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "author": 282441,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "himo4en",
                                          "text": "absolutely false, I don't give a shit if other men doesn't consider me manly, but I do when my female friend tell me \"to be a man\". women are the primary enforcer of toxic masculinity.",
                                          "timestamp": "2021-10-30 10:55:49",
                                          "score": 2,
                                          "num_children": 0,
                                          "replies": []
                                        },
                                        {
                                          "id": "hjnx3un",
                                          "text": "Women are more oppressed? Then why the majority of suicides are from men? Why the majority of homeless person are men? Come on explain. Misandry is not a problem? That's pretty sexist but what i could expect from a feminist. Bodyshaming only protects women, if a women beats a man people will laugh but if the men hit her back the men will be in jail. To not talk about divorce where most men were forced to live in a car after that",
                                          "timestamp": "2021-11-07 12:02:51",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 282441,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hjqda4x",
      "text": "I'm not cooking, cleaning, doing laundry, or childcare where a women lives.\n\nBut if you say that then you'll be so vilified you'll have to move to another city and start a new life. Gender roles shouldn't be enforced regardless of gender. Women shouldn't be forced to work as nurses and maids, but men shouldn't be forced to work as a trash driver, or a lawnmower.",
      "timestamp": "2021-11-07 22:29:51",
      "score": 1,
      "num_children": 0,
      "author": 60810,
      "replies": []
    }
  ]
}