{
  "id": "qgy0nr",
  "text": "TPUSA 🧻\n",
  "timestamp": "2021-10-27 14:31:27",
  "score": 5315,
  "subreddit": "t5_3fdcn",
  "num_children": 76,
  "author": 287278,
  "replies": [
    {
      "id": "hi91wca",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2021-10-27 14:31:27",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "hi9bsxp",
      "text": "Charlie responded with \"oh no don't get violent, that's playing into their hand...\" all the while calling for the overthrowal of our government. He basically just admitted to everyone in the crowd and watching that he doesn't truly believe what he's saying.",
      "timestamp": "2021-10-27 15:38:49",
      "score": 375,
      "num_children": 2,
      "author": 266587,
      "replies": [
        {
          "id": "hi9lpfn",
          "text": "It's more than telling that his only concern is that it is \"playing into their hand\" and not something like \"Hey, murder is bad mkay?\".",
          "timestamp": "2021-10-27 16:45:33",
          "score": 151,
          "num_children": 1,
          "author": 8211,
          "replies": [
            {
              "id": "hidros9",
              "text": "Charlie Kirk is a literal domestic terrorist who has been openly plotting to overthrow the government for almost a year.\n\nThe fact that he is not in prison awaiting trial, along with hundreds of other GQP, tells you exactly what you need to know about the American oligarchy. **They want fascism to succeed**, and to be free from the risk that democracy represents to their wealth and power.",
              "timestamp": "2021-10-28 14:06:00",
              "score": 12,
              "num_children": 0,
              "author": 38324,
              "replies": []
            }
          ]
        },
        {
          "id": "hi9sl3b",
          "text": "Bold of you to assume they have critical thinking skills",
          "timestamp": "2021-10-27 17:31:03",
          "score": 46,
          "num_children": 0,
          "author": 312511,
          "replies": []
        }
      ]
    },
    {
      "id": "hi92daj",
      "text": "Christ... feels like these people are a powder keg. I feel like it's only going to take one alt-right maniac with a gun to go on a shooting spree for these people to start acting up. It's like there waiting for one person to start all this",
      "timestamp": "2021-10-27 14:34:46",
      "score": 954,
      "num_children": 14,
      "author": 90489,
      "replies": [
        {
          "id": "hi9fabk",
          "text": "Nah, it's going to be a bunch of low level events like the school shootings we've become accustomed to",
          "timestamp": "2021-10-27 16:02:44",
          "score": 519,
          "num_children": 5,
          "author": 380670,
          "replies": [
            {
              "id": "hi9ftgk",
              "text": "OKC bombing was basically 1 guy and a couple useful idiots. Turned into the deadliest domestic terror attack in US history.",
              "timestamp": "2021-10-27 16:06:19",
              "score": 328,
              "num_children": 4,
              "author": 138887,
              "replies": [
                {
                  "id": "hi9gles",
                  "text": "It was, but it also had zero impact. \n\nThe problem here is these people have a well funded, well connected leadership structure in the form of people like Roger Stone, Steve Bannon, MANY, MANY congressmen, and the Kremlin. They are also deeply entrenched in law enforcement. \n\nThey also own Facebook and Fox News, which means their propaganda has substantial reach.\n\nThis is an organized movement, and people like this guy are the foot soldiers who are willing to murder on command.\n\nThey're not going to squander their position by popping off with random acts of terror. They are going to plan a second insurrection only when the pieces they need to succeed are in place.",
                  "timestamp": "2021-10-27 16:11:35",
                  "score": 311,
                  "num_children": 6,
                  "author": 169109,
                  "replies": [
                    {
                      "id": "hi9nw0q",
                      "text": "That or they can just keep lining their pockets with the rubes' money, while dismissing any act of violence as a \"lone wolf\". \n\nThoughts and prayers, we're mourning so don't play politics! Now throw another $20 our way so we can stop the steal!",
                      "timestamp": "2021-10-27 16:59:53",
                      "score": 159,
                      "num_children": 0,
                      "author": 114160,
                      "replies": []
                    },
                    {
                      "id": "hi9nhga",
                      "text": "All these \"leaders\" almost instantly eat each other's faces for no good reason.   [https://www.newsweek.com/trump-allies-lin-wood-marjorie-taylor-greene-attack-each-other-1637345](https://www.newsweek.com/trump-allies-lin-wood-marjorie-taylor-greene-attack-each-other-1637345)\n\nRevolutions/civil wars require true believers who are willing to kill but more importantly, revolutions require tons of people to  DIE  for the cause.  and none of these people are going to be willing to die for the cause.",
                      "timestamp": "2021-10-27 16:57:14",
                      "score": 126,
                      "num_children": 3,
                      "author": 280620,
                      "replies": [
                        {
                          "id": "hi9sw9j",
                          "text": "They’ll die for the cause as long as it isn’t too much of an inconvenience and traffic isn’t too bad.",
                          "timestamp": "2021-10-27 17:33:08",
                          "score": 105,
                          "num_children": 2,
                          "author": 323369,
                          "replies": [
                            {
                              "id": "hi9vlaj",
                              "text": "Or if there’s a shot or cloth face mask wearing.\n\nThen, they’re DONE.",
                              "timestamp": "2021-10-27 17:50:23",
                              "score": 76,
                              "num_children": 1,
                              "author": 1380,
                              "replies": [
                                {
                                  "id": "hicqgv4",
                                  "text": "Literally, you could undo their attempted coup just by putting Trump in charge of their field hospitals….",
                                  "timestamp": "2021-10-28 07:10:23",
                                  "score": 6,
                                  "num_children": 0,
                                  "author": 113076,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hibgjvd",
                              "text": "Honestly, its the defenders of democracy that I feel are getting put off by some traffic and a bit of inconvenience. The insurrectionists are obsessed to the point that they'll go to any end to make an impact. Let's make our impact bigger! Defend democracy!!",
                              "timestamp": "2021-10-28 00:15:11",
                              "score": 11,
                              "num_children": 1,
                              "author": 289224,
                              "replies": [
                                {
                                  "id": "hid5kgm",
                                  "text": "I agree completely.  We have to face the facts. They are better organized, louder and more passionate than the left. Plus, they are willing to do Anything to win. Does the Left have that? And, regardless of how evil and idiotic Trump is, he has enough charisma to turn almost half the country into mindless zombies.\nDo we have anyone on the Left the could rally people into rally? And would any liberals go? By mere fact the we are individualists, for us to start holding regular rallies would be like trying to herd cats. Many of us aren't followers.",
                                  "timestamp": "2021-10-28 10:42:33",
                                  "score": 5,
                                  "num_children": 0,
                                  "author": 221638,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hiae1dp",
                          "text": "I mean, the insurrection was stopped with a single 9mm round. One of them got shot and they all lost their spines lol",
                          "timestamp": "2021-10-27 19:49:15",
                          "score": 52,
                          "num_children": 1,
                          "author": 354006,
                          "replies": [
                            {
                              "id": "hiapsc9",
                              "text": "I don't think these people actually mean \"kill politicians/people in power\", because secret service or any arm of the military will hunt them down or put them down. (Although I'm sure there is nut jobs willing to try)\n\nI think they just want to let out their frustrations on a neighbor they hate, or a POC who embodies all the hatred they've amassed from media and built up biases and ignorance. They just wanna shoot someone as long as they can make an excuse of being patriotic or whatever.",
                              "timestamp": "2021-10-27 21:03:54",
                              "score": 42,
                              "num_children": 3,
                              "author": 286730,
                              "replies": [
                                {
                                  "id": "hicbrq9",
                                  "text": "Killing the rich and powerful is much more likely to have serious consequences. There may be some die-hard crazies willing to do anything, but most of the people killed in any conflict are relatively defenseless",
                                  "timestamp": "2021-10-28 04:19:33",
                                  "score": 5,
                                  "num_children": 1,
                                  "author": 373083,
                                  "replies": [
                                    {
                                      "id": "hien7ly",
                                      "text": "Yeah it'll hurt the innocent more than those guilty of keeping the capitalist system going full throttle.",
                                      "timestamp": "2021-10-28 17:36:13",
                                      "score": 3,
                                      "num_children": 0,
                                      "author": 286730,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "hicx1u1",
                                  "text": "The people screaming \"HANG MIKE PENCE\" don't have murderous intentions? Riiiiight.....",
                                  "timestamp": "2021-10-28 08:44:41",
                                  "score": 3,
                                  "num_children": 1,
                                  "author": 333285,
                                  "replies": [
                                    {
                                      "id": "hien3tt",
                                      "text": "Judging by the last couple years and all the dog whistling, they want to kill their liberal neighbors, immigrants and LGBTQ people they find on the street.\n\n They wouldn't actually hang Mike Pence, maybe if they could get their hands on someone from the squad tho. That's their dream of a more \"Christian\" America.",
                                      "timestamp": "2021-10-28 17:35:32",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 286730,
                                      "replies": [
                                        {
                                          "id": "hig3pap",
                                          "text": "Um they would",
                                          "timestamp": "2021-10-28 23:40:04",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 333285,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "hiba3pr",
                                  "text": "That's not better. I don't think you were saying it was, by the way.",
                                  "timestamp": "2021-10-27 23:26:56",
                                  "score": 10,
                                  "num_children": 0,
                                  "author": 291897,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hiahpb2",
                          "text": "They’re already dying for the cause, have you seen the Herman Cain awards?",
                          "timestamp": "2021-10-27 20:12:33",
                          "score": 33,
                          "num_children": 0,
                          "author": 371360,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hia16u9",
                      "text": "It’s crazy though because they’re all morons to a man. \n\nOnce they “succeed” there will be the biggest financial catastrophe the world has ever seen and ‘Murica!!!! Will have the front row seats where you get all wet and splashed. \n\nNew York and California will 100% successfully repel the attacks and declare that they are fucking not putting up with it. \n\nAll the Billionaires, including the greedy idiots sponsoring this will see their equity get wiped the fuck out overnight… guys like Elon who have far more of their billions in assets versus actual liquidity will be flabbergasted and panicked. \n\nThe Global Economy will NOPE the fuck out of any current, ongoing or future investment in the USA. \n\nWhere they gonna go? I dunno, the USA is 6% of the global population… we will find other investments and locations for HQs and they already offshore their money. \n\nThe USA under ‘Murica!!! Will quickly realize that the thin pretence of tolerance for Trump and the Alt-Right is fucking over once it’s not just bluster and show for the idiots and just not fucking deal with the idiot puppets that try and take the helm. \n\nAmericans will kill each other assuredly en mass as both sides have people just dying to kill the other side and no country is going to want to get involved or risk their future relationships while the two sides duke it out. \n\nIt will be without question the Global Death Stroke to Americas relevance… they’ll have threats of nuclear attacks just like how Russia and China ect already and always have had but that won’t get investments going or reliable import/exports. \n\nIt will be the most spectacular collapse ever and way too many of the shithead 1% will die in the crossfire and those Thiel and Mercer types will at first think “awesome!” And then quickly and too late think “ahhh shit no!!”",
                      "timestamp": "2021-10-27 18:26:18",
                      "score": 40,
                      "num_children": 2,
                      "author": 345249,
                      "replies": [
                        {
                          "id": "hiaifw5",
                          "text": "We’re blundering ass backwards into a civil war, because the Biden Administration doesn’t want to appear partisan by punishing traitors.\n\nI genuinely don’t think the older politicians can even conceive of the threat. That their colleagues in the House, and maybe the Senate want to murder them, and would happily watch it happen, or even do it themselves.\n\nThat a large chunk of the right is creaming their pants at a fantasy of a civil war, and a large chunk of the left has accepted it’s happening.\n\nIn either the 2022 midterms or the 2024 election, a state legislature will nullify results they don’t like. Instead of arresting the lot of them for rebellion and flying them to Gitmo, the Dems will sue, and the GOP Supreme Court will uphold it.\n\nAt that point, you’ll never have another democrat president. And a civil war will start as blue states refuse to accept the death of democracy.",
                          "timestamp": "2021-10-27 20:17:14",
                          "score": 48,
                          "num_children": 5,
                          "replies": [
                            {
                              "id": "hibp3ev",
                              "text": "I'm a Liberal, and a gun owner. It would be better if more Lefties familiarized themselves with, and embraced, firearms. We already outnumber them and have more money than they do. I don't think they would like it very much if they knew we were buying up the guns and ammo.",
                              "timestamp": "2021-10-28 01:17:54",
                              "score": 26,
                              "num_children": 5,
                              "author": 102847,
                              "replies": [
                                {
                                  "id": "hibwld2",
                                  "text": "I hope some of that has happened.\n\nIt’s a big piece of why if something is going to kick off, it would be better for it to happen when the left has political power and legitimacy. \n\nBecause if the military will follow lawful orders, it would be over fast.",
                                  "timestamp": "2021-10-28 02:13:20",
                                  "score": 12,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hicmctv",
                                      "text": "It worries me though, because on average both the police as well as the military tend to be populated by conservative leaning people, and some of those aren't just conservative leaning but full on Y'allqueda far right extremists.  I just hate how the main stream media represents Q people as regular right people, how they represent progressives as extremists and people like Manchin and Sinema as moderates.\n\nSeriously, if Biden's bill gets too watered down I think I would get so pissed off and frustrated that I'd stop voting for Democrats as well, and just support Progressives going their own party even if it means we lose.  Like, this is basically our ONLY chance to make any real legistative change, and \\*now\\* we've being stopped by DINOs?  Fucking shit it just blows my mind, since if the right gets their way they can always undo some of the changes we want.  \n\nPlus it blows my mind that Sinema and Manchin say they want bipartisanship when Obama was beat with the very olive branch he was extending to the right?  Whatever happened to \"bipartisanship\" then?  Seriously though, why the fuck should I vote for people who won't make changes that their side has wanted for years if not decades?",
                                      "timestamp": "2021-10-28 06:16:27",
                                      "score": 6,
                                      "num_children": 0,
                                      "author": 123189,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "hiclwbx",
                                  "text": "I'm not sure how much it is happening, but it \\*is\\* happening to some extent.  Come join us at /r/liberalgunowners if you haven't already.  Personally I'm trying to get/restore/fix my 2A rights but unfortunately that will take a long time.  I have some non-lethal solutions finally in place, but it isn't any sort of parity whatsoever.  If shit totally hits the fan I'll totally be outgunned, and likely out trained and probably out numbered.  It sucks.",
                                  "timestamp": "2021-10-28 06:10:42",
                                  "score": 4,
                                  "num_children": 0,
                                  "author": 123189,
                                  "replies": []
                                },
                                {
                                  "id": "hid6e74",
                                  "text": "I agree completely! I plan on getting some firearms ( I have zero right now) but I think we all see the direction that this country is going. We need to me much better armed and organized. And, we need a way to communicate with eachother without being censored.",
                                  "timestamp": "2021-10-28 10:52:40",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 221638,
                                  "replies": []
                                },
                                {
                                  "id": "hicrpot",
                                  "text": "r/SocialistRA",
                                  "timestamp": "2021-10-28 07:27:46",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 54205,
                                  "replies": []
                                },
                                {
                                  "id": "hie4pc9",
                                  "text": "I'm pretty sure most leftists are pro 2a.",
                                  "timestamp": "2021-10-28 15:35:45",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 381669,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hibjuf5",
                              "text": "Not punishing traitors is how we got into this mess",
                              "timestamp": "2021-10-28 00:39:11",
                              "score": 18,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hibjzxi",
                                  "text": "Absolutely. And I see almost no chance we’ll do any real punishment.",
                                  "timestamp": "2021-10-28 00:40:18",
                                  "score": 9,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hibsbx6",
                              "text": "Ya know, I already felt this way and have said as much to people irl. But seeing a couple comments from others just makes me feel like the writing is on the wall so much more. This shit is truly terrifying and even more so because so many others just seem asleep at the wheel. My step dad and quite a few other family members are just one step away from full on Q crisis actors and shit.",
                              "timestamp": "2021-10-28 01:41:48",
                              "score": 9,
                              "num_children": 2,
                              "author": 222071,
                              "replies": [
                                {
                                  "id": "hibyki7",
                                  "text": "I feel like there’s a gap where people just won’t think about it, simply refuse to conceive of it as a possibility. Intelligent reasonable people who think about politics.\n\nI think a lot of it is a generation gap. Which is odd, because my parents and grandparents saw far more political assassinations.\n\nBut plenty of people just don’t want to think about what it means.\n\nLike you can lay out the road there, and the steps along it that are already happening, and they don’t have a counter argument.\n\nI’m not certain it’ll happen, but that may be because Democratic governors refuse to fight after a presidential election is blatantly stolen.",
                                  "timestamp": "2021-10-28 02:28:18",
                                  "score": 6,
                                  "num_children": 2,
                                  "replies": [
                                    {
                                      "id": "hibzq11",
                                      "text": "Yeah I feel the same way, it's not like you can 100% guarantee that this is going to happen but all the signs from history are right there so even if people refuse to acknowledge it, it's a strong possibility. Are you familiar with the concept of Negative Peace? Because I really feel like that what's going on with the majority of people.",
                                      "timestamp": "2021-10-28 02:37:00",
                                      "score": 5,
                                      "num_children": 0,
                                      "author": 222071,
                                      "replies": []
                                    },
                                    {
                                      "id": "hicmso9",
                                      "text": "Not just that, but I think a lot of people just have had better luck than other people.  Like I'm an Asian-American, but my brother isn't really worried about any of the news.  He says there is just more coverage and all of this shit is normal and was always underneath the surface.  \n\nHis life experiences have been different than mine as well.  He didn't get beat up throughout elementary and middle school for looking different.  He didn't get rocks thrown at or have people following you on their bikes when you walk home.  He's a bit younger so I think the racist shit was dialed back by then.  \n\nActually I've spoken a lot of gen Z people BIPOCs and they said for the most part they haven't experienced real overt racism.  I think that is great, but I'm worried they will be unprepared by some of our countrymen that dare see themselves as patriots all the while they are eroding all the foundations of a peaceful and democratic society.  \n\nI mean, if you can't make change with your votes, what other options do you have?  Especially when you are a part of a group that is angry, perceives themselves to be victims, have billionaires and media empires propping up their thoughts, have the military training and military equipment to slaughter us all?  They're going to start killing us, that is what.  People are just starting to say what they're thinking more and more.",
                                      "timestamp": "2021-10-28 06:21:59",
                                      "score": 6,
                                      "num_children": 0,
                                      "author": 123189,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "hid6non",
                                  "text": "I'm with you brother. My wife is a Republican, my brother is a a very far right republican. Other than myself, I don't know one other Liberal.",
                                  "timestamp": "2021-10-28 10:55:55",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 221638,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hibacjj",
                              "text": "Joe Biden is pulling a combination of the James Buchanan and Andrew Johnson administrations, and look how well those turned out.",
                              "timestamp": "2021-10-27 23:28:50",
                              "score": 5,
                              "num_children": 0,
                              "author": 291897,
                              "replies": []
                            },
                            {
                              "id": "hid629z",
                              "text": "I couldn't agree more! Well put my friend. The writing is on the wall ( even though they misspelled half the words).",
                              "timestamp": "2021-10-28 10:48:40",
                              "score": 2,
                              "num_children": 0,
                              "author": 221638,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hic8cnv",
                          "text": "Great write up!\n\nThe Right & Trump will absolutely crash the economy. Which sets the stage just like before the Nazis rose to power, the right wants to mirror this.",
                          "timestamp": "2021-10-28 03:48:20",
                          "score": 2,
                          "num_children": 0,
                          "author": 50235,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hiap8wt",
                      "text": "Zero impact?",
                      "timestamp": "2021-10-27 21:00:20",
                      "score": 2,
                      "num_children": 1,
                      "author": 37470,
                      "replies": [
                        {
                          "id": "hiasiv8",
                          "text": "Yes. Zero impact on the government or the way our country functions. Whatever his goals were, he accomplished nothing.\n\nWholesale different from a fascist organization literally trying to end democracy in America.",
                          "timestamp": "2021-10-27 21:22:09",
                          "score": 9,
                          "num_children": 0,
                          "author": 169109,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hibh0xx",
                      "text": "I agree with this entirely but you hint towards a simple solution... don't let the the pieces fall into place! Resist!!!",
                      "timestamp": "2021-10-28 00:18:38",
                      "score": 1,
                      "num_children": 0,
                      "author": 289224,
                      "replies": []
                    },
                    {
                      "id": "hicc2pz",
                      "text": "Concur.  Between these types o nutsacks and...probably a decent %age of law enforcement, these people seem to be just looking for an excuse to kill someone.  Like the \"hange mike pence\" crowd.  Dude, the shitbag wont even have a conversation 1v1 with a woman privately that aint his wife!  Mike pence is a god honest conservative piece of shit.  But he's trumps dirty whore for being his #2.  (Yeah, not gonna lie, completely got sidetracked.)  \n\nYou ever wonder that the reason we as leftists dont seem to go anywhere is that we actually give a fuck about each others lives outside of martyrdom?  (Ok, i really cant articulate correctly, so ima duck out...stupid wine.)  Basically we'd like all of us to see the world get better, and i dont want to trade lives to do it?...apologies.",
                      "timestamp": "2021-10-28 04:22:22",
                      "score": 1,
                      "num_children": 0,
                      "author": 340881,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hiaf20q",
                  "text": "I seem to recall an American who struck terror into the hearts of 80 million people... a fear of science, logic and reason... and resulted in 700,000 deaths...",
                  "timestamp": "2021-10-27 19:55:46",
                  "score": 15,
                  "num_children": 0,
                  "author": 164955,
                  "replies": []
                },
                {
                  "id": "hiau34y",
                  "text": ">OKC bombing was basically 1 guy and a couple useful idiots\n\nI'm pretty sure McVeigh was the useful idiot and he had a white supremacist faction behind him. I am not personally an expert, but this is the intepretation I have gotten from books I've read and docs I've watched/listened to.",
                  "timestamp": "2021-10-27 21:32:27",
                  "score": 1,
                  "num_children": 0,
                  "author": 38690,
                  "replies": []
                },
                {
                  "id": "hi9v0ap",
                  "text": "When you say “domestic” are you talking about the people that did the attack, or where it took place? Because, I’m pretty sure the “deadliest domestic terror attack in US history” belongs to 9/11. And yes, the guys weren’t home grown so to speak.",
                  "timestamp": "2021-10-27 17:46:44",
                  "score": -4,
                  "num_children": 3,
                  "author": 232564,
                  "replies": [
                    {
                      "id": "hi9vplw",
                      "text": "Domestic Terrorists",
                      "timestamp": "2021-10-27 17:51:08",
                      "score": 26,
                      "num_children": 0,
                      "author": 1380,
                      "replies": []
                    },
                    {
                      "id": "hi9yn2a",
                      "text": "I think they meant at the time. Obviously 9/11 is bigger. It could also mean, homegrown domestic terrorists instead of people coming from Saudi Arabia where trump did this [$500 million weapons deal](https://www.washingtonpost.com/national-security/trump-administration-saudi-weapons-deal/2020/12/23/657cdc72-4565-11eb-8deb-b948d0931c16_story.html?outputType=amp)\n\nJust like Florida Senator Rick Scott was the CEO of a healthcare organization that (at the time) committed the largest medicare fraud.",
                      "timestamp": "2021-10-27 18:09:58",
                      "score": 11,
                      "num_children": 1,
                      "author": 145620,
                      "replies": [
                        {
                          "id": "hi9z006",
                          "text": "Makes sense. I was just wanted clarification. Thanks!",
                          "timestamp": "2021-10-27 18:12:17",
                          "score": 5,
                          "num_children": 0,
                          "author": 232564,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hiahwp2",
                      "text": "Domestic terrorism or homegrown terrorism is a form of terrorism in which victims \"within a country are targeted by a perpetrator with the same citizenship\" as the victims.",
                      "timestamp": "2021-10-27 20:13:52",
                      "score": 3,
                      "num_children": 0,
                      "author": 15806,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hi9tkhu",
              "text": "White men go on killing sprees as a form of self care",
              "timestamp": "2021-10-27 17:37:29",
              "score": 34,
              "num_children": 0,
              "author": 207151,
              "replies": []
            },
            {
              "id": "hi9tcgd",
              "text": "The fact that that’s now “low level” is the list depressing thing I’ve heard this week and a family member just went into surgery to remove a tumor. God damn this world is fucked.",
              "timestamp": "2021-10-27 17:36:04",
              "score": 15,
              "num_children": 1,
              "author": 30097,
              "replies": [
                {
                  "id": "hiaivvg",
                  "text": "I had the same visceral reaction reading the “low level” thing. Like, goddamn. I was in middle school when the Columbine shooting took place it was absolutely terrifying and shattered us. We couldn’t even fully grasp it because it was a horror we never thought possible. To know how this is common place now and “low level” is beyond fucked.",
                  "timestamp": "2021-10-27 20:20:01",
                  "score": 12,
                  "num_children": 1,
                  "author": 15806,
                  "replies": [
                    {
                      "id": "hiexjcn",
                      "text": "yeah. I'm pretty young so I wasn't in school for Columbine but I remember going through school as all the others happened. When I was an elementary schooler it was \"why are they adding all this bid doors and crazy locks?\" \"why do we have to hide in the corner with the lights off, what kind of drill is this?\" and we were just kept in the dark. Of course our parents started to explain it all because when you put blast doors in an elementary school some kid is going to start demanding answers. In middle school it became guards with tasers and phones in every classroom that had a button that connected you right to 911. My aunt was good friends with the parents of one of the kids who died in Sandy Hook and I just remember my aunt breaking down every time she saw a gun real or fake. I played with nerf guns as a kid and when she came over to visit she just started crying and I had no idea why. It's one of those things that is so hard to explain to a kid and growing up hearing each shooting on the news and each new security measure installed in your school just builds this sense of dread. I remember thinking \"when will my school be next?\" \"when will someone pull a gun on us all?\". The fact that it's normalized now because we're all so desensitized to news stories on mass shootings breaks my heart. No one should ever have to fear for their life when going to school.",
                      "timestamp": "2021-10-28 18:43:04",
                      "score": 2,
                      "num_children": 0,
                      "author": 30097,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hibhndk",
              "text": "Step 1 was that shitstain Rittenhouse",
              "timestamp": "2021-10-28 00:23:06",
              "score": 14,
              "num_children": 0,
              "author": 179892,
              "replies": []
            },
            {
              "id": "hiaptd6",
              "text": "The fact that school shootings have gone down in our collective consciousness to \"low level\" says a lot about this country",
              "timestamp": "2021-10-27 21:04:05",
              "score": 8,
              "num_children": 2,
              "author": 60595,
              "replies": [
                {
                  "id": "hiaw995",
                  "text": "I don't mean to imply that school shootings or bombing federal buildings aren't horrific acts, but they aren't the siege of a city or carpet bombing of a population\n...but we have got used to the horrific",
                  "timestamp": "2021-10-27 21:46:57",
                  "score": 1,
                  "num_children": 0,
                  "author": 380670,
                  "replies": []
                },
                {
                  "id": "hibpdv5",
                  "text": "/#NoNewNormal",
                  "timestamp": "2021-10-28 01:20:05",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hia00uw",
          "text": "They already treat Kyle Rittenhouse like a hero because he killed unarmed liberals.",
          "timestamp": "2021-10-27 18:18:53",
          "score": 42,
          "num_children": 0,
          "author": 404114,
          "replies": []
        },
        {
          "id": "hi9jgct",
          "text": "And six months later at trial: “..your honor, I meant METAPHORICALLY.  I OBVIOUSLY meant, “kill them with the guns of our mind.”",
          "timestamp": "2021-10-27 16:30:38",
          "score": 35,
          "num_children": 1,
          "author": 310069,
          "replies": [
            {
              "id": "hia5x0i",
              "text": "\"In Minecraft\".",
              "timestamp": "2021-10-27 18:56:49",
              "score": 7,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hi9yp0m",
          "text": ">STANDING BY: RIGHT-WING MILITIA GROUPS & THE US ELECTION\n\n* https://acleddata.com/2020/10/21/standing-by-militias-election/\n\n>How Right Wing Militias Pose A Challenge To America And Its Leaders\n\n* https://www.forbes.com/sites/sethcohen/2020/10/10/how-right-wing-militias-pose-a-challenge-to-america-and-its-leaders/\n\n>‘We Are Being Eaten From Within.’ Why America Is Losing the Battle Against White Nationalist Terrorism\n\n* https://time.com/5647304/white-nationalist-terrorism-united-states/\n\n>U.S. Law Enforcement Failed to See the Threat of White Nationalism. Now They Don’t Know How to Stop It.\n\n* https://www.nytimes.com/2018/11/03/magazine/FBI-charlottesville-white-nationalism-far-right.html\n\n\nAnd add to that the flames fanned by TurningPointUSA / OANN / FauxNews / Social Media echo chambers and here we are.\n\nReminder: Charlie Kirk bussed \"80+ busses\" of people to the Jan 6th Riots\n\n* https://www.dailydot.com/debug/charlie-kirk-delete-tweet-buses-capitol/\n* https://www.businessinsider.com/man-charged-capitol-riot-went-dc-bus-turning-point-usa-2021-3",
          "timestamp": "2021-10-27 18:10:20",
          "score": 29,
          "num_children": 0,
          "author": 88521,
          "replies": []
        },
        {
          "id": "hi9jpgu",
          "text": "Because they are. That’s literally what this dude is asking.",
          "timestamp": "2021-10-27 16:32:21",
          "score": 18,
          "num_children": 0,
          "author": 390470,
          "replies": []
        },
        {
          "id": "hialntb",
          "text": "This happened in Boise ID, the day of (or day after?) a fatal shooting at the mall.  Obviously the shooter was a crazy right winger.  But you know how it is.  Idaho gonna Idaho.",
          "timestamp": "2021-10-27 20:37:28",
          "score": 16,
          "num_children": 0,
          "author": 128211,
          "replies": []
        },
        {
          "id": "hiarise",
          "text": "The reality is the 2024 election is a potential jump off to a civil war. I believe when Trump runs and loses again he will openly call for violence and it will be like Jan 6th was a dress rehearsal",
          "timestamp": "2021-10-27 21:15:28",
          "score": 17,
          "num_children": 0,
          "author": 23465,
          "replies": []
        },
        {
          "id": "hiad1td",
          "text": "They've been convinced by their politicians that their democracy and country are under threat by greedy, Satan loving pedophiles that happen to simply reside on the other side of the political spectrum. Of course they're a powder keg; they've been fed lies and misinformation that makes the left look like literal demons to them. It's actual insanity.",
          "timestamp": "2021-10-27 19:42:56",
          "score": 12,
          "num_children": 1,
          "author": 286373,
          "replies": [
            {
              "id": "hib93l7",
              "text": "And not one GOP leader will denounce them or try and settle them down. The sensible conservatives are getting voted out as RINOS and people like Greene and Boebert are in charge. And they are stirring up a civil war for Instagram likes.",
              "timestamp": "2021-10-27 23:19:19",
              "score": 9,
              "num_children": 0,
              "author": 395020,
              "replies": []
            }
          ]
        },
        {
          "id": "hiah3tv",
          "text": "America today is powderkeg... and the politicians are like men smoking in an arsenal. A single spark will set off an explosion that will consume us all. I cannot tell you when this explosion will occur, but I can you where: some damn fool thing in the polls will set it all off.",
          "timestamp": "2021-10-27 20:08:45",
          "score": 12,
          "num_children": 0,
          "author": 12038,
          "replies": []
        },
        {
          "id": "hi9jket",
          "text": "Why do I feel the Balkans just before world War 1",
          "timestamp": "2021-10-27 16:31:23",
          "score": 26,
          "num_children": 1,
          "author": 52797,
          "replies": [
            {
              "id": "hi9nw90",
              "text": "Or the Balkans circa 1992",
              "timestamp": "2021-10-27 16:59:56",
              "score": 22,
              "num_children": 0,
              "author": 122843,
              "replies": []
            }
          ]
        },
        {
          "id": "hiawppt",
          "text": "The dream of most of them is to *become* that one guy who starts a war. They think it will make them a hero.",
          "timestamp": "2021-10-27 21:50:07",
          "score": 9,
          "num_children": 0,
          "author": 376884,
          "replies": []
        },
        {
          "id": "hiaygy2",
          "text": "It's probably going to be a mask protest or something similar. It gets too big. National Guard gets called in. One guy pulls the trigger. The rest think they were shot at. Bloody Sunday:American Edition, just in time for Troubles: American Edition.",
          "timestamp": "2021-10-27 22:02:09",
          "score": 5,
          "num_children": 0,
          "author": 138007,
          "replies": []
        },
        {
          "id": "hidko02",
          "text": "like the fucker in charleston? or the piece of shit from pittsburgh?? or do you mean one alt-right maniac like an out-of-state fucking 17 year old with an ar-15 'protecting' the streets???\n\nsurely you don't mean a bunch of these whack jobs taking over bird sanctuaries or stockpiling sniper rifles on top of buildings on portland....\n\nthe kind of fucking lunatic that drives his car into a crowd of people in charlottesville??? ...or the moron who fucking mailed 'bombs' to half the dem leadership and msnbc??\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nthese fascist fucks have been trying to light this powder keg for fucking YEARS!\n\n(and fuck using their names, they don't deserve to have their names spoke aloud)",
          "timestamp": "2021-10-28 13:12:20",
          "score": 3,
          "num_children": 0,
          "author": 373673,
          "replies": []
        },
        {
          "id": "hi9k1v7",
          "text": "Always has been.",
          "timestamp": "2021-10-27 16:34:38",
          "score": 4,
          "num_children": 0,
          "author": 212341,
          "replies": []
        }
      ]
    },
    {
      "id": "hi9g900",
      "text": "Looking forward to the subsequent /r/leapoardsatemyface post when this piece of shit gets doxxed and loses his job.",
      "timestamp": "2021-10-27 16:09:14",
      "score": 124,
      "num_children": 1,
      "author": 114160,
      "replies": [
        {
          "id": "hi9n177",
          "text": "Hasn't happened yet, therefore it prolly won't happen at all.",
          "timestamp": "2021-10-27 16:54:16",
          "score": -23,
          "num_children": 1,
          "author": 361937,
          "replies": [
            {
              "id": "hia04ow",
              "text": "Have you...been to that sub? It happens all the time, sometimes it just takes time.\n\nAlso check out r/ByeByeJob",
              "timestamp": "2021-10-27 18:19:33",
              "score": 45,
              "num_children": 1,
              "author": 25153,
              "replies": [
                {
                  "id": "hia9doi",
                  "text": "And yet in this case, it ain't. Gonna. Happen.",
                  "timestamp": "2021-10-27 19:19:26",
                  "score": -28,
                  "num_children": 2,
                  "author": 361937,
                  "replies": [
                    {
                      "id": "hib06xx",
                      "text": "Why not?",
                      "timestamp": "2021-10-27 22:14:12",
                      "score": 4,
                      "num_children": 1,
                      "author": 409479,
                      "replies": [
                        {
                          "id": "hib1he6",
                          "text": "Strong Hunch says so is why.",
                          "timestamp": "2021-10-27 22:23:13",
                          "score": -17,
                          "num_children": 1,
                          "author": 361937,
                          "replies": [
                            {
                              "id": "hicja4m",
                              "text": "Source: Me",
                              "timestamp": "2021-10-28 05:39:02",
                              "score": 9,
                              "num_children": 0,
                              "author": 16451,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hics6ik",
                      "text": "https://vm.tiktok.com/TTPdYyF2N8/",
                      "timestamp": "2021-10-28 07:34:21",
                      "score": 2,
                      "num_children": 0,
                      "author": 267984,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hi9c5ne",
      "text": "Do they really not know that the right is actually the one trying to steal elections? That’s wild.",
      "timestamp": "2021-10-27 15:41:11",
      "score": 255,
      "num_children": 5,
      "author": 10425,
      "replies": [
        {
          "id": "hi9mlxx",
          "text": "I think that the leaders, the politicians, know that Trump is an incompetent liar (and more; I could go on) and they know the truth of things. They know that they are trying to destroy democracy to keep brown people from voting. They know that the vaccines are safe and that Trump lost. It’s their followers that are duped and the politicians are happily playing their tune in order to get re-elected.",
          "timestamp": "2021-10-27 16:51:27",
          "score": 71,
          "num_children": 3,
          "author": 83386,
          "replies": [
            {
              "id": "hi9vymd",
              "text": "Yep, guy in the vid fully believes election was stolen. The leaders really don’t give a fuck they’re leading us into extremely dangerous times. Fuck them",
              "timestamp": "2021-10-27 17:52:43",
              "score": 36,
              "num_children": 0,
              "author": 227332,
              "replies": []
            },
            {
              "id": "hi9w7e3",
              "text": "And it’s the politicians greedy, power tripping pandering to voters that will destroy our country and cause a global power shift to China or Russia. America will collapse and so will the dollar because these politicians aren’t capable at looking ahead and only care about their own interests.",
              "timestamp": "2021-10-27 17:54:17",
              "score": 15,
              "num_children": 0,
              "author": 99277,
              "replies": []
            },
            {
              "id": "hq6yvtw",
              "text": "100%. I did some work in a state legislature and know for certain all the Republican members (minus one or two actual nut jobs) are vaccinated yet they still take the side of anti-vax AND, worst yet, have publicly lied about being vaccinated to save face with their voters. I watched them get jabbed in the Capitol because I was there to help administer shots to state employees and members",
              "timestamp": "2021-12-27 21:09:37",
              "score": 2,
              "num_children": 0,
              "author": 335019,
              "replies": []
            }
          ]
        },
        {
          "id": "hi9o8tu",
          "text": "Every accusation is a confession",
          "timestamp": "2021-10-27 17:02:16",
          "score": 19,
          "num_children": 0,
          "author": 122843,
          "replies": []
        },
        {
          "id": "hi9d4w7",
          "text": "They do, and see that now everyone else knows it too, and are getting really scared and threatened. It's a cling to the last threads of power they have.",
          "timestamp": "2021-10-27 15:48:19",
          "score": 74,
          "num_children": 1,
          "author": 232326,
          "replies": [
            {
              "id": "hi9vsm8",
              "text": "I ***really*** hope you are right. I for one am terrified by their behavior and worry about my future. I don’t like the DNC either, but one side is ***DEFINITELY*** worst than the other, and that side is the GOP. They have completely lost it. They do not deserve to be in any sector of government until they can come back from the far right fascist and racist ideologies. \n\nI have never been so disgusted by a political side’s behavior than I have the past 6-8 years. These people are insane and unstable and all it takes is being at the wrong place at the wrong time, around one of these mentally unhinged extremists people, and then boom you or your loved ones are gone with the bang of a gun. \n\nI really hope this is the far right party’s last cry; their death rattle so to speak. But I fear this is just the beginning of more fascist, far right extremism to come. I fear millions of peoples’ lives will be at risk simply for existing because they won’t fit their narrative of what’s right. \n\nIn other words, people who are transgender; gay or bisexual; non Christian; not white; not men; not Republicans or conservatives will have their lives at risk. And that thought is terrifying to me.",
              "timestamp": "2021-10-27 17:51:39",
              "score": 35,
              "num_children": 1,
              "author": 99277,
              "replies": [
                {
                  "id": "hiaohbg",
                  "text": "I am scared as well. I am feeling like they are escalating which usually leads to them getting worse, not better.",
                  "timestamp": "2021-10-27 20:55:23",
                  "score": 8,
                  "num_children": 1,
                  "author": 148015,
                  "replies": [
                    {
                      "id": "hid7t41",
                      "text": "I couldn't agree more. And, they have access to voting records.",
                      "timestamp": "2021-10-28 11:09:23",
                      "score": 2,
                      "num_children": 0,
                      "author": 221638,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hi9p6bh",
          "text": "They do, they just lie about it because it gets them more success.",
          "timestamp": "2021-10-27 17:08:25",
          "score": 8,
          "num_children": 0,
          "author": 47094,
          "replies": []
        },
        {
          "id": "hiaobqn",
          "text": "For real and the ones trying to force their authority on everyone and take away civil liberties.",
          "timestamp": "2021-10-27 20:54:24",
          "score": 4,
          "num_children": 0,
          "author": 148015,
          "replies": []
        }
      ]
    },
    {
      "id": "hi9fr2u",
      "text": "This is where misinformation and lies lead. These people truly believe an election was stolen, that Democrats are preparing for a takeover, etc. So much trouble can be avoided just by entities like TPUSA not existing. Why are we so free-speech absolutist as to let this happen? You wouldn’t even need to touch much except blatant lies in commercial media (vs someone’s Facebook page).",
      "timestamp": "2021-10-27 16:05:51",
      "score": 79,
      "num_children": 3,
      "author": 286113,
      "replies": [
        {
          "id": "hia5cjf",
          "text": "As they say, “if you can get people to believe absurdities, you can get them to commit atrocities”",
          "timestamp": "2021-10-27 18:53:07",
          "score": 20,
          "num_children": 0,
          "author": 96958,
          "replies": []
        },
        {
          "id": "hia6mp5",
          "text": "Why would the Dems want a takeover? Dont they already believe the Radical Left is the mainstream elite already?  Have we taken over or haven't we?  WHICH IS IT?",
          "timestamp": "2021-10-27 19:01:29",
          "score": 11,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hiau09t",
          "text": "Do they truly believe it or do they just not really care and Just say whatever they need to say in service of bringing the outcome they want?",
          "timestamp": "2021-10-27 21:31:55",
          "score": 2,
          "num_children": 0,
          "author": 206739,
          "replies": []
        }
      ]
    },
    {
      "id": "hi9cwlu",
      "text": "PLOT TWIST: Liberals own guns too.",
      "timestamp": "2021-10-27 15:46:47",
      "score": 112,
      "num_children": 5,
      "author": 142073,
      "replies": [
        {
          "id": "hi9d4lu",
          "text": "Right?  It’s always baffling that they think the left isnt armed.",
          "timestamp": "2021-10-27 15:48:16",
          "score": 64,
          "num_children": 2,
          "author": 408169,
          "replies": [
            {
              "id": "hi9e9m2",
              "text": "Heck the only reason I own guns is to protect my family from rabid RepubliQans...",
              "timestamp": "2021-10-27 15:55:53",
              "score": 38,
              "num_children": 1,
              "author": 211119,
              "replies": [
                {
                  "id": "hia9h13",
                  "text": "Me too!!! Literally only reason I’m holding onto my guns is for when the far right attack.",
                  "timestamp": "2021-10-27 19:20:02",
                  "score": 10,
                  "num_children": 0,
                  "author": 297441,
                  "replies": []
                }
              ]
            },
            {
              "id": "hi9p981",
              "text": "I no longer bother reminding them of this.\nLet them fuck around and find out.",
              "timestamp": "2021-10-27 17:08:58",
              "score": 39,
              "num_children": 1,
              "author": 325739,
              "replies": [
                {
                  "id": "hi9x1b6",
                  "text": "That’s how I see it. I feel like it will be a huge advantage to us if shit does hit the fan. Pride comes before the fall, after all.",
                  "timestamp": "2021-10-27 17:59:36",
                  "score": 18,
                  "num_children": 1,
                  "author": 99277,
                  "replies": [
                    {
                      "id": "hiaoix4",
                      "text": "Yep. They can brag about their guns all they like, just means that if/when SHTF they're going to be pre-identified, while those of us who *don't* fellate our firearms will be relatively anonymous, and already well aware of who to watch out for and where they'll be coming from.",
                      "timestamp": "2021-10-27 20:55:40",
                      "score": 9,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hi9fmc2",
          "text": "There's an upside down bell curve of guns\n  \nFar right - Hella guns\n  \n\nCentrists = Some guns\n  \n\nLiberals = No guns\n  \n\nSocdems = Some guns\n  \n\nLeftists = Hella guns",
          "timestamp": "2021-10-27 16:04:59",
          "score": 76,
          "num_children": 2,
          "author": 353720,
          "replies": [
            {
              "id": "hi9jshz",
              "text": "Now, every bone in my body is telling me to drop everything and create that graphic, but I'm gonna have to deny myself.  I've got other sit to do.  I shouldn't even be here.",
              "timestamp": "2021-10-27 16:32:54",
              "score": 33,
              "num_children": 2,
              "author": 74671,
              "replies": [
                {
                  "id": "hi9pgfr",
                  "text": "Oh come on, stay true to your username!",
                  "timestamp": "2021-10-27 17:10:19",
                  "score": 11,
                  "num_children": 0,
                  "author": 29863,
                  "replies": []
                },
                {
                  "id": "hi9x789",
                  "text": "Don’t do it! Let them fuck around and find out. It gives people who are being marginalized and attacked by far right wing extremists the upper hand.",
                  "timestamp": "2021-10-27 18:00:39",
                  "score": 5,
                  "num_children": 0,
                  "author": 99277,
                  "replies": []
                }
              ]
            },
            {
              "id": "hicaghi",
              "text": "“Hella” guns. This is a Californian lol.",
              "timestamp": "2021-10-28 04:07:12",
              "score": 4,
              "num_children": 1,
              "author": 50235,
              "replies": [
                {
                  "id": "hicq0lj",
                  "text": "Nah not at all it's just a good word",
                  "timestamp": "2021-10-28 07:04:10",
                  "score": 2,
                  "num_children": 0,
                  "author": 353720,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hi9xytn",
          "text": "Yup. Many do. And we can read and write, too. We must be like superhumans to them.",
          "timestamp": "2021-10-27 18:05:37",
          "score": 8,
          "num_children": 0,
          "author": 1380,
          "replies": []
        },
        {
          "id": "hi9wy82",
          "text": "Right? This blows my mind. My fiancé and I are huge gun owners. Just because we vote differently doesn’t mean we don’t own guns. Just because we think there should be reasonable gun laws and safety measures put in place, doesn’t mean we are anti-2A.\n\nIt just goes to show how extremist they are. If guns don’t give you a raging boner then you’re a liberal snowflake who is anti-gun lol.",
          "timestamp": "2021-10-27 17:59:03",
          "score": 14,
          "num_children": 0,
          "author": 99277,
          "replies": []
        },
        {
          "id": "hibc4gy",
          "text": "I say bring it on. If you go far enough to the left, you get your guns back. :)",
          "timestamp": "2021-10-27 23:42:12",
          "score": 1,
          "num_children": 0,
          "author": 125671,
          "replies": []
        }
      ]
    },
    {
      "id": "hi9gvit",
      "text": "What a frightening mentality. \n\nDon't call yourself a patriot if all you seek to do is kill or maim your fellow Americans. Shameful.",
      "timestamp": "2021-10-27 16:13:29",
      "score": 26,
      "num_children": 1,
      "author": 114969,
      "replies": [
        {
          "id": "hibaaag",
          "text": "They have ruined the words “freedom”, “hero” and “patriot”",
          "timestamp": "2021-10-27 23:28:22",
          "score": 6,
          "num_children": 0,
          "author": 1380,
          "replies": []
        }
      ]
    },
    {
      "id": "hi9a9ho",
      "text": "I’m real curious what that response was…",
      "timestamp": "2021-10-27 15:28:34",
      "score": 22,
      "num_children": 1,
      "author": 176218,
      "replies": [
        {
          "id": "hi9blwk",
          "text": "He was told to NOT use his guns because that's what the Left wants.",
          "timestamp": "2021-10-27 15:37:29",
          "score": 32,
          "num_children": 2,
          "author": 129148,
          "replies": [
            {
              "id": "hi9kbcf",
              "text": "Yes, we're trying to take their guns away because we want them to use their guns. Makes perfect sense when your brain is a baked potato.",
              "timestamp": "2021-10-27 16:36:22",
              "score": 31,
              "num_children": 0,
              "author": 368574,
              "replies": []
            },
            {
              "id": "hi9dz5m",
              "text": "Isn't the whole 2a argument hinged on overthrowing tyrannical govt? \n\nThat guy asked a ~~legitimate~~ expected  or inevitable introspective question.\n\n(edited for clarity; thanks for the correction, u/That_Guy_Red)",
              "timestamp": "2021-10-27 15:53:55",
              "score": -31,
              "num_children": 6,
              "author": 60025,
              "replies": [
                {
                  "id": "hi9m1rk",
                  "text": "His question was predicated on a blatant lie about stolen elections. That's not a legitimate question. \n\nIt wouldn't be a legitimate question if I asked you *when do you plan on stopping your habitual accosting of goats?* Presumably, you don't habitually accost goats. So, wording a question in a way that implies that you do isn't exactly legitimate.",
                  "timestamp": "2021-10-27 16:47:50",
                  "score": 21,
                  "num_children": 2,
                  "author": 226168,
                  "replies": [
                    {
                      "id": "hi9n1p8",
                      "text": "I habitually accost goats.  And I don’t plan on stopping.  So there, friend.",
                      "timestamp": "2021-10-27 16:54:21",
                      "score": 7,
                      "num_children": 1,
                      "author": 369471,
                      "replies": [
                        {
                          "id": "hi9stwm",
                          "text": "r/Goatparkour",
                          "timestamp": "2021-10-27 17:32:42",
                          "score": 3,
                          "num_children": 0,
                          "author": 226168,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hi9sny9",
                      "text": "It has to do with a lot more than \"stolen\" elections. They're concerned about quarantines and limited speech and gun control and a general perceived loss of opportunity. \n\nThey're people who are preparing themselves physically and mentally to fight. He wants to know when they're going to act. What is the moment they're preparing for?",
                      "timestamp": "2021-10-27 17:31:35",
                      "score": -8,
                      "num_children": 5,
                      "author": 60025,
                      "replies": [
                        {
                          "id": "hi9y2yp",
                          "text": "I think the moment will be if Trump or another major GOP backed player loses the next election. But that’s a big IF. Biden isn’t doing so well in the polls, for many reasons. \n\nIt’s a tough time for everyone and they aren’t coping well. They see theirselves as the only victims here, when the truth is, we ALL are suffering. It’s not a left verses right thing anymore. It is a poor versus wealthy (and by wealthy, I mean the extremely wealthy, who are buying up all our politicians).",
                          "timestamp": "2021-10-27 18:06:21",
                          "score": 4,
                          "num_children": 1,
                          "author": 99277,
                          "replies": [
                            {
                              "id": "hiadcef",
                              "text": "Well said. There's a lot of hurt, a lot of bad information and manipulation. People are getting frustrated and looking to weild the limited, tangible power they have and understand.",
                              "timestamp": "2021-10-27 19:44:48",
                              "score": 0,
                              "num_children": 0,
                              "author": 60025,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hi9ubdq",
                          "text": "Fuck is wrong with you?",
                          "timestamp": "2021-10-27 17:42:20",
                          "score": 4,
                          "num_children": 0,
                          "author": 241169,
                          "replies": []
                        },
                        {
                          "id": "hi9w9h2",
                          "text": "This screenshot also doesn’t elaborate on *who* he wants to start killing. Is he rising up against a tyrannical government and planning to attack federal officials? Is he rising up and attacking election day volunteers who hold no power? Is he talking about ordinary citizens he personally feels are to blame? None of which are ok but from this *we don’t know who hes looking for permission to kill*. That should be fuking terrifying not I dunno let’s hear him out.",
                          "timestamp": "2021-10-27 17:54:39",
                          "score": 2,
                          "num_children": 0,
                          "author": 176218,
                          "replies": []
                        },
                        {
                          "id": "hia1kmz",
                          "text": "Do you think democrats want to come and take your guns from your home? That’s never going to happen. There’s a very big difference in implementing gun control policy, e.g. concealed carry in NY for legitimate reasons, and a full blown “take away my guns.” Further, is anyone in the U.S. government preventing you from your right to free speech? Because that is what the first amendment does. If you think the private company twitter censoring its platform is limiting free speech under the constitution, then just try to under stand it! Are you saying the “stolen” election fight is just a proxy for these arguments that you’ve made up? People on the right could have more credibility if you cut the wild shit and focused on things that matter.",
                          "timestamp": "2021-10-27 18:28:46",
                          "score": 2,
                          "num_children": 0,
                          "author": 77058,
                          "replies": []
                        },
                        {
                          "id": "hi9wkin",
                          "text": "He directly referenced stolen elections as a reason to start killing innocent people. Stop defending stochastic terrorism and sit down.",
                          "timestamp": "2021-10-27 17:56:36",
                          "score": 2,
                          "num_children": 0,
                          "author": 226168,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hi9kmnw",
                  "text": "Shoving your head up your own ass doesn't count as introspection.",
                  "timestamp": "2021-10-27 16:38:27",
                  "score": 15,
                  "num_children": 0,
                  "author": 385483,
                  "replies": []
                },
                {
                  "id": "hi9iqhw",
                  "text": "\"when can we start killing them?\" Is a LEGITIMATE question? Are you fucking serious?",
                  "timestamp": "2021-10-27 16:25:49",
                  "score": 30,
                  "num_children": 1,
                  "author": 268234,
                  "replies": [
                    {
                      "id": "hi9nftq",
                      "text": "Yes, following the logic of people who are entertaining the idea of violent revolution. They've got the gear and and anger. They're just looking for mobilization.",
                      "timestamp": "2021-10-27 16:56:56",
                      "score": 3,
                      "num_children": 3,
                      "author": 60025,
                      "replies": [
                        {
                          "id": "hi9x9br",
                          "text": "You're 100% right. This is actually why Trump is personally responsible for the capitol riot. If you tell people that \"they're taking over your government\" and that there's no legal or peaceful way to stop them, the only logical conclusion is that violence is needed.",
                          "timestamp": "2021-10-27 18:01:01",
                          "score": 11,
                          "num_children": 0,
                          "replies": []
                        },
                        {
                          "id": "hi9vrjd",
                          "text": "I think what you mean, hopefully, is that it's an *expected* question. It is in no way legitimate, since there is no true way that anyone could expect an answer other than \"we don't kill others\" to that question.",
                          "timestamp": "2021-10-27 17:51:28",
                          "score": 6,
                          "num_children": 1,
                          "author": 268234,
                          "replies": [
                            {
                              "id": "hia7aa3",
                              "text": "That's probably the better word choice. Considering the idolization of this country's revolutionary roots, it's difficult to say \"we don't kill.\" I'm willing to settle for \"we're nowhere near the point of killing\" instead of the answer the guy actually got. Because it's unlikely he's done looking for that answer.",
                              "timestamp": "2021-10-27 19:05:47",
                              "score": 3,
                              "num_children": 0,
                              "author": 60025,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hi9v7jq",
                          "text": "That should be a problem tho if they’re looking to mobilize new friends to kill people with. \n\nIf it were another country we’d call that radicalizing terrorists.",
                          "timestamp": "2021-10-27 17:48:01",
                          "score": 4,
                          "num_children": 1,
                          "author": 176218,
                          "replies": [
                            {
                              "id": "hia84md",
                              "text": "That's 100% what it could turn into. I really hope not.\n\nI once had a conversation / argument with someone who believed a successful rebellion could be carried out by a few thousand people hiding in the woods with guns. \n\nI tried to explain the only marginally effective strategy for that kind of scenario would look a lot more like terrorism than \"freedom fighting\" and involve attacking innocent people.",
                              "timestamp": "2021-10-27 19:11:18",
                              "score": 4,
                              "num_children": 1,
                              "author": 60025,
                              "replies": [
                                {
                                  "id": "hiat86p",
                                  "text": "my dad told me stories about getting bricks of hash stamped with \"SUPPORT THE FREEDOM FIGHTERS OF AFGANISTAN\" during the 80s...",
                                  "timestamp": "2021-10-27 21:26:44",
                                  "score": 2,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hi9gowy",
                  "text": "This is how I feel, too. Obviously this guy is misguided and very likely wants to use his guns for all the wrong reasons, but I'm very interested in knowing where that line is, both for us and for them.",
                  "timestamp": "2021-10-27 16:12:15",
                  "score": 15,
                  "num_children": 1,
                  "author": 194458,
                  "replies": [
                    {
                      "id": "hi9m97j",
                      "text": " Right. What kind of propaganda constitutes as the tipping point? These are people that have convinced themselves and each other that the US is rapidly approaching a state of being too far gone to be redeemed with anything other than violence.",
                      "timestamp": "2021-10-27 16:49:09",
                      "score": 7,
                      "num_children": 1,
                      "author": 60025,
                      "replies": [
                        {
                          "id": "hi9vlvj",
                          "text": "If we’re at the point of when can I start killing people we’re past the point of having a sit down chat to hear them out. Especially so when their “concerns” are largely no longer rooted in reality. You can’t appease terrorists and you can’t reason with the unreasonable.",
                          "timestamp": "2021-10-27 17:50:29",
                          "score": 3,
                          "num_children": 1,
                          "author": 176218,
                          "replies": [
                            {
                              "id": "hi9y2ys",
                              "text": "Are we really at that point, though? I've seen hate be overthrown by honest conversation. \n\n[Stories like this](https://www.vox.com/world/2019/1/14/18151799/extremism-white-supremacy-jihadism-deeyah-khan) have me convinced there's a way through.",
                              "timestamp": "2021-10-27 18:06:22",
                              "score": 1,
                              "num_children": 1,
                              "author": 60025,
                              "replies": [
                                {
                                  "id": "hia2ftn",
                                  "text": "When people are openly discussing murder as a solution without pushback because it’s now normalized I think we are at that point. Your article is hopeful but it puts the work of stopping this on the backs of PoC. It’s also from early 2019 and radicalization, domestic terrorist attacks, and hate crimes have skyrocketed since then. I hope you’re right and there is hope. I would prefer to be wrong here. But I worry I might not be.",
                                  "timestamp": "2021-10-27 18:34:20",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 176218,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hi9l4w3",
                  "text": "You know what, if you remove all context and ties to reality it’s a legitimate question.\n\nBut seeing how the grievances he brought up are imaginary I think we can say it’s not a legitimate question and people like you who feign ignorance to say it is are part of the problem.",
                  "timestamp": "2021-10-27 16:41:48",
                  "score": 8,
                  "num_children": 1,
                  "author": 330251,
                  "replies": [
                    {
                      "id": "hi9p05v",
                      "text": "I'm not feigning ignorance. Their position has to do with much more than \"stolen\" elections. \n\nOnce you convince yourself you need the resources to fight against a tyrannical government, and once you procure those resources, it makes sense to ask when the government becomes tyrannical enough to use them.",
                      "timestamp": "2021-10-27 17:07:16",
                      "score": 5,
                      "num_children": 1,
                      "author": 60025,
                      "replies": [
                        {
                          "id": "hi9pp51",
                          "text": "Again, you’re pretending their grievances are legitimate. You’re part of the problem.",
                          "timestamp": "2021-10-27 17:11:56",
                          "score": 2,
                          "num_children": 1,
                          "author": 330251,
                          "replies": [
                            {
                              "id": "hi9uxwu",
                              "text": "No I'm not. I'm pointing out the internal logic, faulty though it may be, ends with the question this guy is asking. It has less to do with any specific narrative of \"wrongs\" and more to do with being prepared to fight.",
                              "timestamp": "2021-10-27 17:46:19",
                              "score": 2,
                              "num_children": 0,
                              "author": 60025,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hi9uy1q",
                  "text": "You guys already tried that in January didn’t ya?",
                  "timestamp": "2021-10-27 17:46:20",
                  "score": 1,
                  "num_children": 1,
                  "author": 176218,
                  "replies": [
                    {
                      "id": "hia24xs",
                      "text": ">you guys\n\nNot me",
                      "timestamp": "2021-10-27 18:32:22",
                      "score": 1,
                      "num_children": 0,
                      "author": 60025,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hi92bkg",
      "text": "Can we talk about criminalizing stochastic terrorism?",
      "timestamp": "2021-10-27 14:34:26",
      "score": 157,
      "num_children": 3,
      "author": 52797,
      "replies": [
        {
          "id": "hi9mnjf",
          "text": "[deleted]",
          "timestamp": "2021-10-27 16:51:45",
          "score": 25,
          "num_children": 1,
          "replies": [
            {
              "id": "hia6i05",
              "text": "Just specify the law until it can only be interpreted in a certain way. For example, it can be specified to “blatant misinformation that can be proven in the court of law using formal Aristotelian logic backed up by peer reviewed evidence [above an arbitrary but sane threshold of approval], wherein this law is only applicable to misinformation relayed through commercial endeavors or entities exempting the world wide web”. Something like that would leave most things alone, including fucking Stormfront, but would get in the way of public broadcasting of lies to the appropriate demographic it affects the most within a reasonable threshold of evidence-needed to enforce. Even if applied after said lie is said on the air, it gives a public avenue to prove without a lick of doubt that a falsehood is false. Eventually it would be preventative. A lawyer could also blow up what I said into many pages of hyper-specification AND in a way that wouldn’t need a 1st amendment amendment, I’m gonna guess.",
              "timestamp": "2021-10-27 19:00:37",
              "score": 2,
              "num_children": 0,
              "author": 27902,
              "replies": []
            }
          ]
        },
        {
          "id": "hi9ikx4",
          "text": "Hate speech, inciting violence especially, should be illegal.",
          "timestamp": "2021-10-27 16:24:49",
          "score": 42,
          "num_children": 2,
          "author": 268234,
          "replies": [
            {
              "id": "hi9m1ah",
              "text": "[deleted]",
              "timestamp": "2021-10-27 16:47:44",
              "score": 27,
              "num_children": 1,
              "replies": [
                {
                  "id": "hi9xjrs",
                  "text": "Exactly! Great point. It’s like how the “war” on drugs have only had negative affects on actually treating people with drug addiction, and putting in more power to the hands of the cartel, DEA, and drug dealers.",
                  "timestamp": "2021-10-27 18:02:56",
                  "score": 11,
                  "num_children": 0,
                  "author": 99277,
                  "replies": []
                }
              ]
            },
            {
              "id": "hi9nitb",
              "text": "It is",
              "timestamp": "2021-10-27 16:57:29",
              "score": 9,
              "num_children": 3,
              "author": 313386,
              "replies": [
                {
                  "id": "hi9t77w",
                  "text": "Hate speech isn’t, not in the US.",
                  "timestamp": "2021-10-27 17:35:07",
                  "score": 6,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hi9u1rf",
                  "text": "Only in sane parts of the world",
                  "timestamp": "2021-10-27 17:40:36",
                  "score": 6,
                  "num_children": 0,
                  "author": 380670,
                  "replies": []
                },
                {
                  "id": "hi9vtu7",
                  "text": "Not in the US it's not, man.",
                  "timestamp": "2021-10-27 17:51:52",
                  "score": 5,
                  "num_children": 1,
                  "author": 268234,
                  "replies": [
                    {
                      "id": "hi9x8cm",
                      "text": "https://www.law.cornell.edu/uscode/text/18/373",
                      "timestamp": "2021-10-27 18:00:51",
                      "score": 4,
                      "num_children": 1,
                      "author": 313386,
                      "replies": [
                        {
                          "id": "hi9xejq",
                          "text": "That's the thing though, that's in regards to direct threats. This isn't that. It's all theoretical situations and what-ifs. Loophole.",
                          "timestamp": "2021-10-27 18:01:59",
                          "score": 6,
                          "num_children": 0,
                          "author": 268234,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hib2va8",
          "text": "Giving more punitive power to the criminal in-justice system seems like a bad move.",
          "timestamp": "2021-10-27 22:33:08",
          "score": 1,
          "num_children": 0,
          "author": 412406,
          "replies": []
        }
      ]
    },
    {
      "id": "hi9mmqx",
      "text": "Why has this motherfucker not been ID'ed yet?",
      "timestamp": "2021-10-27 16:51:37",
      "score": 19,
      "num_children": 1,
      "author": 361937,
      "replies": [
        {
          "id": "hiahg7b",
          "text": "Because Jesus/S",
          "timestamp": "2021-10-27 20:10:55",
          "score": 5,
          "num_children": 0,
          "author": 114810,
          "replies": []
        }
      ]
    },
    {
      "id": "hi9l961",
      "text": "Hoping multiple people have referred this video to the FBI…",
      "timestamp": "2021-10-27 16:42:35",
      "score": 18,
      "num_children": 0,
      "author": 120084,
      "replies": []
    },
    {
      "id": "hi9twu5",
      "text": "do they realize plenty of people who are not right wing kooks have guns ? Just cuz we dont cosplay a soldier on weekends doesnt mean they gonna roll over us.",
      "timestamp": "2021-10-27 17:39:45",
      "score": 16,
      "num_children": 0,
      "author": 179709,
      "replies": []
    },
    {
      "id": "hia5ods",
      "text": "Hello, F.B.I. I would like to submit a tip about a terror organization.",
      "timestamp": "2021-10-27 18:55:15",
      "score": 16,
      "num_children": 0,
      "author": 294130,
      "replies": []
    },
    {
      "id": "hi9m0sx",
      "text": "You know what's funny?  A lot of my buddies are left leaning and have actually served in the military.  I'm a vet, I'm a gun owner, and I'm left leaning.  So these dipshits think that they can take on the US military and people who have actually served while they can't go a month without Arby's and a haircut?",
      "timestamp": "2021-10-27 16:47:39",
      "score": 42,
      "num_children": 3,
      "author": 66506,
      "replies": [
        {
          "id": "hiaou9n",
          "text": "Fellow left leaning, veteran, gun owner here.",
          "timestamp": "2021-10-27 20:57:41",
          "score": 14,
          "num_children": 0,
          "author": 249238,
          "replies": []
        },
        {
          "id": "hibar7y",
          "text": "Retired Police Officer, trained on handguns and the AR15.\n\nI own plenty of firearms. It’s not a RW thing. They think we will all sing kumbaya as they use us for target practice.\n\nAlso, if they want their little “civil war” they’ll have to fight, ya know, the REAL military.",
          "timestamp": "2021-10-27 23:31:55",
          "score": 12,
          "num_children": 0,
          "author": 1380,
          "replies": []
        },
        {
          "id": "hibm3ek",
          "text": "These people have convinced themselves because the left don't like the necessity of owning a firearm, we don't. It goes to show you just how small the box is where their mindset resides.",
          "timestamp": "2021-10-28 00:55:38",
          "score": 5,
          "num_children": 0,
          "author": 318186,
          "replies": []
        }
      ]
    },
    {
      "id": "hia481w",
      "text": "These people would be cowards in an actual gunfight",
      "timestamp": "2021-10-27 18:45:51",
      "score": 14,
      "num_children": 1,
      "author": 399363,
      "replies": [
        {
          "id": "hiacbwu",
          "text": "They would be trying to play COD while snipers thin  them out. Then the 19K and 11B go full Sherman's March to the sea on their ass.",
          "timestamp": "2021-10-27 19:38:20",
          "score": 4,
          "num_children": 1,
          "author": 114810,
          "replies": [
            {
              "id": "hib0iak",
              "text": "The only thing Sherman did wrong is stop",
              "timestamp": "2021-10-27 22:16:24",
              "score": 5,
              "num_children": 1,
              "author": 389436,
              "replies": [
                {
                  "id": "hibc7nh",
                  "text": "Whole technically correct the rest looked much better.",
                  "timestamp": "2021-10-27 23:42:51",
                  "score": 1,
                  "num_children": 0,
                  "author": 114810,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hia6p99",
      "text": "Hey guys it’s no longer the “alt right.” This is the mainstream right wing everyday thinking",
      "timestamp": "2021-10-27 19:01:57",
      "score": 14,
      "num_children": 0,
      "author": 109503,
      "replies": []
    },
    {
      "id": "hiamf3w",
      "text": "Rittenhouse being found innocent will open the floodgates.",
      "timestamp": "2021-10-27 20:42:16",
      "score": 14,
      "num_children": 1,
      "author": 328954,
      "replies": [
        {
          "id": "hiay7ix",
          "text": "Dude the riots that kick off when that kid gets acquitted...it feels like they're gonna be the worst yet",
          "timestamp": "2021-10-27 22:00:21",
          "score": 5,
          "num_children": 1,
          "author": 141076,
          "replies": [
            {
              "id": "hibnbpq",
              "text": "The judge not allowing the word \"Victim\" but saying \"Rioters or Looters\" is acceptable. This is blatant tainting on the use of language in favor of one side. \nBut either way to not expect violence is naive.",
              "timestamp": "2021-10-28 01:04:43",
              "score": 5,
              "num_children": 1,
              "author": 114810,
              "replies": [
                {
                  "id": "hidncsy",
                  "text": "Yeah I’ve been following the trial closely and the other thing is that the prosecution tried to not allow as evidence the fact that the cops welcomed the crazy right wing weirdos and gave them water and shit like that. The defense is going to argue that they were part of the peacekeeping force. And when Rittenhouse is acquitted it’s going to validate that kind of behavior",
                  "timestamp": "2021-10-28 13:33:29",
                  "score": 4,
                  "num_children": 0,
                  "author": 328954,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hi9oa0r",
      "text": "Glad there will be some surveillance on Captain I-Wanna-Kill-Someone-Real-Bad now…..",
      "timestamp": "2021-10-27 17:02:29",
      "score": 13,
      "num_children": 0,
      "author": 72978,
      "replies": []
    },
    {
      "id": "hi9nqho",
      "text": "If you feel your life is in imminent danger, you have the right to defend yourself.\n\nIf you kill someone because of your delusional belief that they are doing something illegal and you chose murder instead of calling authorities...you die in prison.",
      "timestamp": "2021-10-27 16:58:52",
      "score": 11,
      "num_children": 1,
      "author": 111573,
      "replies": [
        {
          "id": "hiaozr1",
          "text": "Or you die bleeding on the ground because you mistakenly assumed that gun ownership is the exclusive domain of the political right, and are sorely unprepared for your victims to be every bit as armed and prepared as you, if not more so.",
          "timestamp": "2021-10-27 20:58:40",
          "score": 6,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hia1azv",
      "text": "FBI should investigate that guy",
      "timestamp": "2021-10-27 18:27:03",
      "score": 12,
      "num_children": 0,
      "author": 328367,
      "replies": []
    },
    {
      "id": "hia2hmg",
      "text": "Getting angry at one's own delusions just seems like poor practice to me. \n\nGetting angry enough to contemplate murder over one's own delusions is insanity.",
      "timestamp": "2021-10-27 18:34:39",
      "score": 10,
      "num_children": 0,
      "author": 320075,
      "replies": []
    },
    {
      "id": "hia6tb1",
      "text": "Reminds me of the woman who was panicked when asking about Obama being a \"secret Muslim terrorist\" and John McCain had to cut through all the propaganda and told her straight to her face that Obama was a good Christian and decent human.\n\nBut now there's no more John McCain, and nobody with remotely as much integrity in the Republican Party.",
      "timestamp": "2021-10-27 19:02:42",
      "score": 10,
      "num_children": 1,
      "author": 25414,
      "replies": [
        {
          "id": "hiagwdj",
          "text": "We got Kristian Sienna after McCain passed for AZ.. Not sure if Ted Cruz is still the most hated person in the Senate.",
          "timestamp": "2021-10-27 20:07:26",
          "score": 3,
          "num_children": 0,
          "author": 114810,
          "replies": []
        }
      ]
    },
    {
      "id": "hi9ghds",
      "text": "r/liberalgunowners\n\nr/SocialistRA\n\nStart preparing your mind for the possibility you might need to be involved in Community Defense.",
      "timestamp": "2021-10-27 16:10:50",
      "score": 52,
      "num_children": 1,
      "author": 49460,
      "replies": [
        {
          "id": "hi9jkzb",
          "text": "We protect Us.",
          "timestamp": "2021-10-27 16:31:30",
          "score": 18,
          "num_children": 1,
          "author": 47550,
          "replies": [
            {
              "id": "hi9k9kb",
              "text": "It’s the only way.",
              "timestamp": "2021-10-27 16:36:02",
              "score": 10,
              "num_children": 0,
              "author": 49460,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hi9lg18",
      "text": "This should not be taken lightly",
      "timestamp": "2021-10-27 16:43:50",
      "score": 9,
      "num_children": 0,
      "author": 160397,
      "replies": []
    },
    {
      "id": "hia7e9c",
      "text": "This is totally something  a normal good guy would say, not someone who enjoys human suffering and revenge, nope.",
      "timestamp": "2021-10-27 19:06:31",
      "score": 9,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hia9w0t",
      "text": "Two of the stupidest groups on the planet are Christians and Republicans. Coincidence that they are one in the same",
      "timestamp": "2021-10-27 19:22:42",
      "score": 9,
      "num_children": 1,
      "replies": [
        {
          "id": "hiaskob",
          "text": "Christians and CONSERVATIVES, to be more accurate.\n\nThe ideology behind the modern Republican Party and formerly the Democratic Party before the party switch.",
          "timestamp": "2021-10-27 21:22:29",
          "score": 4,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hi9ieun",
      "text": "the best part is that there are so many informants embedded in this \"group\" that they've all been ID'd with face scan technology. Their cell phones have been logged. Welcome to the machine, assholes.",
      "timestamp": "2021-10-27 16:23:41",
      "score": 23,
      "num_children": 1,
      "author": 124883,
      "replies": [
        {
          "id": "hi9tveq",
          "text": "Room is also probably full of cops, completely on his side.",
          "timestamp": "2021-10-27 17:39:29",
          "score": 19,
          "num_children": 0,
          "author": 207151,
          "replies": []
        }
      ]
    },
    {
      "id": "hi9ek4f",
      "text": "Jesus fucking Hell",
      "timestamp": "2021-10-27 15:57:49",
      "score": 7,
      "num_children": 0,
      "author": 284562,
      "replies": []
    },
    {
      "id": "hi9skjr",
      "text": "How have these motherfuckers not been charged with any sort of crime for advocating for this shit yet? Fuckin’A.",
      "timestamp": "2021-10-27 17:30:57",
      "score": 7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hiabi6s",
      "text": "Let's be honest with ourselves. This is part of the ramping up for the next 2 election cycles. The last guy was steering his base toward this. Some of Jan 6 terrorists and their supporters are encouraging future armed conflict. There is a reason many of my LGBTQ friends are arming themselves and training. Better to be prepared for something that didn't happen then not ready to defend themselves.",
      "timestamp": "2021-10-27 19:33:02",
      "score": 7,
      "num_children": 0,
      "author": 114810,
      "replies": []
    },
    {
      "id": "hiabrlq",
      "text": "If you are a minority or ardently against Trump and you don't own a gun, you need to wake the fuck up. You need to own a gun and learn how to use it.",
      "timestamp": "2021-10-27 19:34:43",
      "score": 7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hiblvqi",
      "text": "I purchased a handgun for home defense. Not against all the things the right tells us to fear, but against literal republican terrorists.",
      "timestamp": "2021-10-28 00:54:04",
      "score": 6,
      "num_children": 0,
      "author": 318186,
      "replies": []
    },
    {
      "id": "hi9a2iu",
      "text": "Sick.",
      "timestamp": "2021-10-27 15:27:17",
      "score": 7,
      "num_children": 0,
      "author": 190442,
      "replies": []
    },
    {
      "id": "hi9rm07",
      "text": "“Get to”?",
      "timestamp": "2021-10-27 17:24:40",
      "score": 6,
      "num_children": 0,
      "author": 23717,
      "replies": []
    },
    {
      "id": "hia5zu4",
      "text": "Definitely needs the Feds on his ass.",
      "timestamp": "2021-10-27 18:57:19",
      "score": 6,
      "num_children": 0,
      "author": 411241,
      "replies": []
    },
    {
      "id": "hia6uyp",
      "text": "Has that right-wing terrorist been identified yet?",
      "timestamp": "2021-10-27 19:03:00",
      "score": 7,
      "num_children": 1,
      "author": 77620,
      "replies": [
        {
          "id": "hiagbn1",
          "text": "T***P IMO. He has Oath Keepers, PB and violent religious zealots.",
          "timestamp": "2021-10-27 20:03:50",
          "score": 3,
          "num_children": 0,
          "author": 114810,
          "replies": []
        }
      ]
    },
    {
      "id": "hia7b5f",
      "text": "This is extremely dangerous to our democracy",
      "timestamp": "2021-10-27 19:05:57",
      "score": 7,
      "num_children": 1,
      "author": 187836,
      "replies": [
        {
          "id": "hiasmlv",
          "text": "Not just yours, but ALL civilization",
          "timestamp": "2021-10-27 21:22:50",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hic71cv",
      "text": "Hey, flip side of this: how many more statements like this before we start taking these lunatics at their word?",
      "timestamp": "2021-10-28 03:36:36",
      "score": 7,
      "num_children": 0,
      "author": 372059,
      "replies": []
    },
    {
      "id": "hiabfn4",
      "text": "Ah yes. The family values, Sunday morning best, pro-life party. Exactly my cup of tea. 🙃",
      "timestamp": "2021-10-27 19:32:34",
      "score": 4,
      "num_children": 0,
      "author": 83677,
      "replies": []
    },
    {
      "id": "hi9qeue",
      "text": "They are all nuts and need to be in a loony bin. They believe in conspiracies and Facebook posts but ignore any factual information or science. They say the science is wrong...yeah your Facebook and Google knowledge of 15 mins makes you smarter than people that dedicate their lives to science. Makes sense.",
      "timestamp": "2021-10-27 17:16:45",
      "score": 12,
      "num_children": 0,
      "author": 414,
      "replies": []
    },
    {
      "id": "hiaf7od",
      "text": "Violent resolution always results in a better government than the previous establishment. \n\n- Nobody ever.",
      "timestamp": "2021-10-27 19:56:46",
      "score": 4,
      "num_children": 0,
      "author": 297095,
      "replies": []
    },
    {
      "id": "hiaxem5",
      "text": "They already started calling this guy antifa and a plant",
      "timestamp": "2021-10-27 21:54:49",
      "score": 4,
      "num_children": 1,
      "author": 9902,
      "replies": [
        {
          "id": "hiayzb0",
          "text": "Of course they did. I don’t expect finesse from a group headed up by a community college washout.",
          "timestamp": "2021-10-27 22:05:39",
          "score": 5,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hibcoku",
      "text": "Did he just make a threat against government officials? Pretty sure that's illegal. Wonder if our spineless gov't will do anything about it?",
      "timestamp": "2021-10-27 23:46:23",
      "score": 4,
      "num_children": 1,
      "author": 54010,
      "replies": [
        {
          "id": "hic1nqw",
          "text": "I think Merrick Garland has already answered that question in the negative.",
          "timestamp": "2021-10-28 02:51:44",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hic4cek",
      "text": "😬 eek..if they use theirs, does that mean we can use ours?",
      "timestamp": "2021-10-28 03:13:34",
      "score": 5,
      "num_children": 1,
      "author": 293142,
      "replies": [
        {
          "id": "hih1ilp",
          "text": "Yep, castle doctrine, fear for bodily harm and turn about is fair play.",
          "timestamp": "2021-10-29 04:07:39",
          "score": 2,
          "num_children": 0,
          "author": 114810,
          "replies": []
        }
      ]
    },
    {
      "id": "hialwvz",
      "text": "The truly perverse thing is they're the ones preparing to steal elections, while also establishing the stealing of an election as the basis for killing. So they're arguing that they should be killed. Meanwhile, they argue against safety during a pandemic, and so that pandemic is disproportionately impacting their voting base. If I was into conspiracy theories I'd be wondering who was actually manufacturing this victimhood and failure. The answer is they are doing it to themselves.",
      "timestamp": "2021-10-27 20:39:05",
      "score": 3,
      "num_children": 0,
      "author": 289440,
      "replies": []
    },
    {
      "id": "hiar19o",
      "text": "Yeah... Shitheads are going to get a lot more violent in the years ahead",
      "timestamp": "2021-10-27 21:12:13",
      "score": 3,
      "num_children": 1,
      "author": 5507,
      "replies": [
        {
          "id": "hiat3ou",
          "text": "Here is my thought process is going; The Jan 6th is like the  Beerhall Putsch. Almost no penalties along with Hitler's pardon brought a new boldness.  Does that sound like Agent Orange?",
          "timestamp": "2021-10-27 21:25:55",
          "score": 4,
          "num_children": 0,
          "author": 114810,
          "replies": []
        }
      ]
    },
    {
      "id": "hiaul3h",
      "text": "If someone stole an election, lets see some evidence...you freaky, nutcases.",
      "timestamp": "2021-10-27 21:35:46",
      "score": 3,
      "num_children": 0,
      "author": 292443,
      "replies": []
    },
    {
      "id": "hibeb6f",
      "text": "if there is a civil war do these clowns think the US army will be on their side?\n\nIf they secede it will be the US army VS rednecks in pickup trucks",
      "timestamp": "2021-10-27 23:58:39",
      "score": 3,
      "num_children": 0,
      "author": 369180,
      "replies": []
    },
    {
      "id": "hibgcj7",
      "text": "The only question is will the Boomers die before the Republicans end democracy.\n\nBecause the left wing doesn't have the votes to stop them until the Boomers stop voting.\n\nAnd we're not going to change tactics (e.g. drop gun control, drop social justice, focus on economy and civil rights (yes, there's a difference) and stop following everything the GOP tells us to do on abortion and call it criminalization). \n\nWe'll keep following that 1960s playbook that stopped working in the 80s. If to boomers are gone before democracy we might see a correction, but other than that I think we're screwed.",
      "timestamp": "2021-10-28 00:13:40",
      "score": 3,
      "num_children": 1,
      "author": 20553,
      "replies": [
        {
          "id": "hiblfb3",
          "text": "Based on Covid-19 vaccine rates amongst the older  who may have preexisting conditions and religious objections will  decimate their own voter base. \nA piece from [NPR](https://www.wpr.org/gop-men-are-most-likely-say-theyll-refuse-covid-19-vaccine)\ngoes over the numbers.",
          "timestamp": "2021-10-28 00:50:46",
          "score": 1,
          "num_children": 1,
          "author": 114810,
          "replies": [
            {
              "id": "higeeq1",
              "text": "It's really only in deep red districts where that's happening, so it's not moving the needle. It might have an impact on the presidential election, but nothing else.",
              "timestamp": "2021-10-29 01:03:44",
              "score": 1,
              "num_children": 1,
              "author": 20553,
              "replies": [
                {
                  "id": "hih13do",
                  "text": "That is 100% incorrect sir. Local school board members, town or city council along with state level officials are important.",
                  "timestamp": "2021-10-29 04:03:45",
                  "score": 1,
                  "num_children": 0,
                  "author": 114810,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hibnrv7",
      "text": "So they're advocating we execute the Jan 6th traitors via firing squad? I can get behind that.",
      "timestamp": "2021-10-28 01:08:04",
      "score": 3,
      "num_children": 0,
      "author": 284179,
      "replies": []
    },
    {
      "id": "hib3971",
      "text": "Religion is a lie. \nIf you believe that lie, you’ll believe any lie that suits you.",
      "timestamp": "2021-10-27 22:35:56",
      "score": 6,
      "num_children": 2,
      "author": 399342,
      "replies": [
        {
          "id": "hib8d82",
          "text": "The mental gymnastics needed to accept religion is an alternative reality. My mind broke free from it when  i learned a out how the scientific method works. Once I applied it to both the texts and actions of \"the religious \" there was no way it worked. That was was one of the most freeing moments of my life.  Years of shame just rolled off my back.",
          "timestamp": "2021-10-27 23:13:46",
          "score": 5,
          "num_children": 0,
          "author": 114810,
          "replies": []
        },
        {
          "id": "hic1ra1",
          "text": "you are a liar.",
          "timestamp": "2021-10-28 02:52:29",
          "score": -1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hi9llrs",
      "text": "[I think I saw that guy on The Simpsons](https://youtu.be/cRLVgFNTnIg)",
      "timestamp": "2021-10-27 16:44:54",
      "score": 2,
      "num_children": 0,
      "author": 391349,
      "replies": []
    },
    {
      "id": "hial49w",
      "text": "And Charlie only “condemned it” because apparently it’s what the left wants them to do",
      "timestamp": "2021-10-27 20:34:05",
      "score": 2,
      "num_children": 2,
      "replies": [
        {
          "id": "hiasbih",
          "text": "Because they spoke the quiet part out loud.\n\nHis public excuse is a smokescreen",
          "timestamp": "2021-10-27 21:20:47",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hib10u8",
          "text": "Isn't he one of the people who bussed in some of the Jan 6 terrorists?",
          "timestamp": "2021-10-27 22:20:01",
          "score": 1,
          "num_children": 0,
          "author": 404389,
          "replies": []
        }
      ]
    },
    {
      "id": "hib0s9m",
      "text": "And the crowd loudly cheered him for it too. In fact the only person who seemed hesitant to endorse that kind of behavior was the guy taking questions.",
      "timestamp": "2021-10-27 22:18:21",
      "score": 2,
      "num_children": 0,
      "author": 275753,
      "replies": []
    },
    {
      "id": "hibh6z2",
      "text": "They're just going to cry that he was a Democrat plant, at the same time they are silently nodding their heads in agreement",
      "timestamp": "2021-10-28 00:19:50",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hibyt4r",
      "text": "I guess I’d be mad too If I was cheating hard as I could and still kept on losing every election.",
      "timestamp": "2021-10-28 02:30:10",
      "score": 2,
      "num_children": 0,
      "author": 334706,
      "replies": []
    },
    {
      "id": "hic1bdo",
      "text": "Merrick Garland, hello?",
      "timestamp": "2021-10-28 02:49:05",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "hj6jvjj",
          "text": "Garland is an empty suit. We're in trouble come 2024. Last night was a bad start.",
          "timestamp": "2021-11-03 18:35:07",
          "score": 2,
          "num_children": 1,
          "author": 23465,
          "replies": [
            {
              "id": "hjbx3hz",
              "text": "That guy did t deserve any political ballyhoo. Obama picked him because he thought he was amenable to republicans. Hate that smarmy guy Obama.",
              "timestamp": "2021-11-04 20:49:41",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hic3yfl",
      "text": "Someone out there certified this dude as sane enough to have weapons",
      "timestamp": "2021-10-28 03:10:18",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hicbdy9",
      "text": "We'll see his sorry ass again in 2024 as a congressional candidate.",
      "timestamp": "2021-10-28 04:15:52",
      "score": 2,
      "num_children": 0,
      "author": 377897,
      "replies": []
    },
    {
      "id": "hicn0b0",
      "text": "This people might as well shout \"sieg hiel\" at this point.",
      "timestamp": "2021-10-28 06:24:44",
      "score": 2,
      "num_children": 1,
      "author": 411069,
      "replies": [
        {
          "id": "hiefbao",
          "text": "That Richard Spencer [Nazi](https://www.irishtimes.com/news/world/us/hail-trump-video-shows-us-white-nationalists-making-nazi-salute-1.2877735) from a few years ago. His side not as shy as they used to be.",
          "timestamp": "2021-10-28 16:45:10",
          "score": 2,
          "num_children": 0,
          "author": 114810,
          "replies": []
        }
      ]
    },
    {
      "id": "hid3j06",
      "text": "I wish we could just break away from these people and have a separate country. But, then again, who would want to be a neighboring country.  It would be like living next to Nazi Germany.",
      "timestamp": "2021-10-28 10:16:39",
      "score": 2,
      "num_children": 0,
      "author": 221638,
      "replies": []
    },
    {
      "id": "hid4ck2",
      "text": "They will win they will win the mid-term elections and the the Whitehouse again. At that point, they will be running congress, the white house and they already have the Supreme Court. It will make 2016 -2020 look like a cake walk. Eventually,  their Nazi mentality will infect the local levels (if it hasn't already). \nWhen this started happening in Germany in the 1930s, the intellectuals saw the writing on the wall and got the fuck out of the country because it's almost impossible to stop without violence.",
      "timestamp": "2021-10-28 10:27:18",
      "score": 2,
      "num_children": 0,
      "author": 221638,
      "replies": []
    },
    {
      "id": "hi9kxm0",
      "text": "This is a Guarantee that the next election will be America's last election.",
      "timestamp": "2021-10-27 16:40:28",
      "score": 3,
      "num_children": 0,
      "author": 26344,
      "replies": []
    },
    {
      "id": "hiair4p",
      "text": "So what kind of answer did he get?  I mean, there's an election coming up on Tuesday in PA.",
      "timestamp": "2021-10-27 20:19:12",
      "score": 1,
      "num_children": 0,
      "author": 399361,
      "replies": []
    },
    {
      "id": "hiasy3z",
      "text": "Well the wealth divide is already worse than it was during the French Revolution. The \"taxation without representation\" thing is pretty apparent at this point (from their perspective at least). \n\nMy money is on the idea that they are just LARPers and are never actually going to do shit in any kind of organized or meaningful way. \n\nIf the second amendment was going to come into play it already would have IMO.",
      "timestamp": "2021-10-27 21:24:56",
      "score": 1,
      "num_children": 0,
      "author": 167408,
      "replies": []
    },
    {
      "id": "hiavxlc",
      "text": "I’m all-for using the guns… but I’m a left libertarian. I don’t think they’ll want me using the guns.",
      "timestamp": "2021-10-27 21:44:48",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hibc072",
      "text": "I kinda went off on an anti-gun rant on another sub, but this kinda shit just makes me hope they fucking try. I dare them.",
      "timestamp": "2021-10-27 23:41:18",
      "score": 1,
      "num_children": 1,
      "author": 125671,
      "replies": [
        {
          "id": "hibgbna",
          "text": "Right? I’d rather some major violence went down and we addressed it, than continuing to listen to this and slip slowly further into fascism.",
          "timestamp": "2021-10-28 00:13:30",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "hiblfh8",
              "text": "Maybe if the USA is destabilized by a civil war then the rest of the world could step in and either save us from ourselves or at least save themselves from us once and for all. Obviously I vastly prefer a non-violent solution as I hope everyone does, but that seems more and more like a pipe dream with each passing day.",
              "timestamp": "2021-10-28 00:50:48",
              "score": 1,
              "num_children": 0,
              "author": 125671,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hibyk1m",
      "text": "Legally speaking...can this guy get in trouble for this?",
      "timestamp": "2021-10-28 02:28:12",
      "score": 1,
      "num_children": 0,
      "author": 163881,
      "replies": []
    },
    {
      "id": "hic84qj",
      "text": "https://youtu.be/nincTqwmxxo",
      "timestamp": "2021-10-28 03:46:17",
      "score": 1,
      "num_children": 0,
      "author": 58698,
      "replies": []
    },
    {
      "id": "hics56z",
      "text": "Found a tiktok related to this.\n\nhttps://vm.tiktok.com/TTPdYyF2N8/",
      "timestamp": "2021-10-28 07:33:51",
      "score": 1,
      "num_children": 0,
      "author": 267984,
      "replies": []
    },
    {
      "id": "hid2ltw",
      "text": "I love watching them fight the cops",
      "timestamp": "2021-10-28 10:04:11",
      "score": 1,
      "num_children": 0,
      "author": 254756,
      "replies": []
    },
    {
      "id": "hkt4usw",
      "text": "Post the clip.",
      "timestamp": "2021-11-16 03:26:46",
      "score": 1,
      "num_children": 0,
      "author": 320305,
      "replies": []
    },
    {
      "id": "hibgudk",
      "text": "Just a friendly reminder that the US government actively assassinates anybody who seriously suggests trading oil in anything other than dollars.\n\nGetting angry when it comes to your own corrupt system is suddenly unheard of?\n\nAmericans at large will apparently support the petro-commies until they start knocking on their doors demanding papers.\nOh wait.. didn't that kind of already happen?\n\nGuess it's over, long live Zhao Baiden.",
      "timestamp": "2021-10-28 00:17:17",
      "score": -7,
      "num_children": 1,
      "replies": [
        {
          "id": "hid10ft",
          "text": "You say that as if these people have a problem with that lmao. This dude is talking about murdering people over an election that in no way has been proven to be rigged",
          "timestamp": "2021-10-28 09:41:54",
          "score": 3,
          "num_children": 1,
          "author": 300828,
          "replies": [
            {
              "id": "hid2zxo",
              "text": "They are mad at how easily China can bully their own government and how they're seemingly trying to align with Beijing.\n\nI get that nobody in the USA wants this war, but the current government are doing a bad job at informing idiots like these about their stance on china.\n\nCCP are techno-commies while BidenCo. are petrocommies.\nWhat the TurdingPoo idiots are trying to convey to americans as a whole is the conflict ahead and HOW COMMUNIST usa should be allowed to BECOME.\n\nJust because they're idiots doesn't mean they're blind. They're trying to point out things which they are intellectually incapable of breaking down.\n\nUSA is a republic currently run by semi-commie Patricians, and the free Plebeians are now rattling their tools in protest.\n\nThe transparency demanded by TPusa, is also transparency that the CCP desperately seeks.\nThis is a global clash between the ruling class and working class, and is the inevitable result of globalization.\n\nI agree that they're dumb, but it's not entirely unwarranted.",
              "timestamp": "2021-10-28 10:09:30",
              "score": -3,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hi9rs2m",
      "text": "[removed]",
      "timestamp": "2021-10-27 17:25:46",
      "score": -20,
      "num_children": 3,
      "replies": [
        {
          "id": "hi9unyh",
          "text": "> The second amendment states that should tyranny arise, our firearms might be the only hope we have to reclaim our freedoms and Constitutional Rights.\n\nThis is not what the 2nd states, have you read it before?\n\nAlso, there is no protection of 'free speech' from private businesses. It only relates to the government. You're just a straight up moron.",
          "timestamp": "2021-10-27 17:44:33",
          "score": 18,
          "num_children": 1,
          "author": 241169,
          "replies": [
            {
              "id": "hi9vlos",
              "text": "Do you think most people, regardless of political leaning, have read it other than the phrase \"right to bear arms\"? Granted, it seems more left leaning people have actually read the whole 2 sentences or so of it, but there's a lot of people who are just really dumb",
              "timestamp": "2021-10-27 17:50:27",
              "score": 8,
              "num_children": 3,
              "author": 95734,
              "replies": [
                {
                  "id": "hi9vth2",
                  "text": "Nope, they don't read it at all.",
                  "timestamp": "2021-10-27 17:51:48",
                  "score": 8,
                  "num_children": 0,
                  "author": 241169,
                  "replies": []
                },
                {
                  "id": "hia42ye",
                  "text": "It's the same with the Bible",
                  "timestamp": "2021-10-27 18:44:55",
                  "score": 7,
                  "num_children": 1,
                  "author": 26344,
                  "replies": [
                    {
                      "id": "hia5246",
                      "text": "Oh absolutely",
                      "timestamp": "2021-10-27 18:51:16",
                      "score": 5,
                      "num_children": 0,
                      "author": 95734,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hiaemhw",
                  "text": "Reading the part where it says \"Well regulated militia\"\nis a big lift for some people.  Full disclosure my home is protected by firearms but we embrace reforms wholeheartedly.",
                  "timestamp": "2021-10-27 19:52:59",
                  "score": 4,
                  "num_children": 0,
                  "author": 114810,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hi9y8n3",
          "text": "\"Sham elections\"\n\nProve it.",
          "timestamp": "2021-10-27 18:07:22",
          "score": 11,
          "num_children": 1,
          "author": 167270,
          "replies": [
            {
              "id": "hia4tej",
              "text": "Trump said.. after losing 84 court cases , zero wins and all his lawyers are sanctioned...",
              "timestamp": "2021-10-27 18:49:44",
              "score": 10,
              "num_children": 0,
              "author": 26344,
              "replies": []
            }
          ]
        },
        {
          "id": "hia4c5o",
          "text": "Free speech has absolutely nothing to do with private businesses, maybe read about it sometime along with the 2nd amendment , hell why no just go nuts and read the entire constitution... for a change be informed instead of influenced.",
          "timestamp": "2021-10-27 18:46:35",
          "score": 4,
          "num_children": 1,
          "author": 26344,
          "replies": [
            {
              "id": "hiadnar",
              "text": "Citizens United was the worst decision by the SC in my lifetime.",
              "timestamp": "2021-10-27 19:46:45",
              "score": 4,
              "num_children": 0,
              "author": 114810,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hibjrpe",
      "text": "Say when...",
      "timestamp": "2021-10-28 00:38:39",
      "score": 0,
      "num_children": 0,
      "author": 138455,
      "replies": []
    }
  ]
}