{
  "id": "qmosnu",
  "text": "\"A little learning is a dangerous thing.\" -Alexander Pope.\n",
  "timestamp": "2021-11-04 16:43:28",
  "score": 7656,
  "subreddit": "t5_3fdcn",
  "num_children": 18,
  "replies": [
    {
      "id": "hjavazv",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2021-11-04 16:43:28",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "hjblcgh",
      "text": "\"Dad why is grandma in my history book yelling at a black woman for going to college?\"",
      "timestamp": "2021-11-04 19:33:17",
      "score": 155,
      "num_children": 0,
      "author": 163881,
      "replies": []
    },
    {
      "id": "hjbtw96",
      "text": "I recently saw a thing with a BUNCH of examples of people who had identified old men from crowds of nazis today, and tracked down pictures of them as young men opposing the civil rights movement.  Wish I could find it again.",
      "timestamp": "2021-11-04 20:28:56",
      "score": 147,
      "num_children": 4,
      "author": 215411,
      "replies": [
        {
          "id": "hjc8w99",
          "text": "Please look for this, I would love it!!",
          "timestamp": "2021-11-04 22:08:53",
          "score": 33,
          "num_children": 0,
          "author": 50512,
          "replies": []
        },
        {
          "id": "hjcq2kj",
          "text": "I would love to see this if you find it again",
          "timestamp": "2021-11-05 00:10:27",
          "score": 18,
          "num_children": 0,
          "author": 278578,
          "replies": []
        },
        {
          "id": "hjd98er",
          "text": "Birth of a subreddit? Please.",
          "timestamp": "2021-11-05 02:33:46",
          "score": 8,
          "num_children": 1,
          "author": 249696,
          "replies": [
            {
              "id": "hjdlkrz",
              "text": "Were I able to find it, I would start and post it at /r/nazisofyesternow",
              "timestamp": "2021-11-05 04:21:42",
              "score": 14,
              "num_children": 0,
              "author": 215411,
              "replies": []
            }
          ]
        },
        {
          "id": "hjcxurc",
          "text": "!Remind me! Two days",
          "timestamp": "2021-11-05 01:07:19",
          "score": 6,
          "num_children": 0,
          "author": 285164,
          "replies": []
        }
      ]
    },
    {
      "id": "hjb6fv9",
      "text": "\"I was on the wrong side of history, but I don't want my grandkids to know that.\"",
      "timestamp": "2021-11-04 17:55:25",
      "score": 310,
      "num_children": 4,
      "author": 24559,
      "replies": [
        {
          "id": "hjbf1ob",
          "text": "\"I was on the wrong side of history, and goddamit, I'm staying there!!\"",
          "timestamp": "2021-11-04 18:51:50",
          "score": 139,
          "num_children": 0,
          "author": 271845,
          "replies": []
        },
        {
          "id": "hjc2m2z",
          "text": "“I don’t want my grandkids to think it was wrong for some reason. Don’t tear down my statues or teach their context!”",
          "timestamp": "2021-11-04 21:26:21",
          "score": 40,
          "num_children": 0,
          "author": 331671,
          "replies": []
        },
        {
          "id": "hjcq9vd",
          "text": "Probably should learn that grandpa was an asshat to people. Learn not to emulate him.",
          "timestamp": "2021-11-05 00:11:56",
          "score": 22,
          "num_children": 0,
          "author": 410685,
          "replies": []
        },
        {
          "id": "hjd3qae",
          "text": "Honestly it's not that those people don't want their children to know about *their* bigotry specifically that angers me. Not wanting to show your flaws to people you want to look up to you is a human impulse, even if you don't admit they're flaws. It's \"I don't want my grandkids to know that, so I can avoid confronting my failures by teaching them to be on the wrong side of history too\" that's happening, and *that* angers me",
          "timestamp": "2021-11-05 01:50:48",
          "score": 15,
          "num_children": 1,
          "author": 38343,
          "replies": [
            {
              "id": "hjdywiv",
              "text": "German here, so that attitude kinda hits home. My grandparents served in WWII and were obviously on the wrong side of history (Or well... on the wrong side in general). While my grandfather was fairly upfront about his time in russia; being wounded; being in captivity; all that war stuff - the topic was a very big taboo when I was younger, because of grandma. She was in full denial to have done anything wrong during that period. Being a party member and working as a nurse was \"mandatory\" but had nothing to do with anything. No self-reflection AT ALL. To be fair, the part of the country where they lived was and is very rural, but even in that region synagogues burned to the ground.\n\nIts a shamefull mindset to not face your own past and go on full denial instead of teaching your kids to do better.",
              "timestamp": "2021-11-05 07:04:33",
              "score": 15,
              "num_children": 1,
              "author": 126045,
              "replies": [
                {
                  "id": "hkwk44i",
                  "text": "I was looking forward to the replies and discussion to be had from your post here, only to see that nobody has replied. So I just wanted to thank you for sharing your experience here. Such an interesting historical viewpoint, so thank you. It is a sad thing to not confront the past, or even the present, but then we are shown by human behaviour all the time that the easy option is to Not confront, Not challenge, Not think ... \nBeing English, I can never understand another nation's history, indeed my own nation has taken a wild turn to the weird and nationalist (/fascist) lately. I expect to read about it in future when I hope it will all be consogned to history. Thank you for telling your story because stories help us to understand.",
                  "timestamp": "2021-11-16 21:20:38",
                  "score": 2,
                  "num_children": 0,
                  "author": 71197,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hjb7gmy",
      "text": "Virginia enters the chat",
      "timestamp": "2021-11-04 18:02:02",
      "score": 95,
      "num_children": 3,
      "author": 285270,
      "replies": [
        {
          "id": "hjbxtyu",
          "text": "I'm going to say this preemptive of anything truly horrible, but FUCK GLENN YOUNGKIN.",
          "timestamp": "2021-11-04 20:54:31",
          "score": 52,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hjcl073",
          "text": "\"Let's never teach CRT\" from the state that fought against integration so much, they shut down entire counties",
          "timestamp": "2021-11-04 23:33:49",
          "score": 34,
          "num_children": 1,
          "author": 36960,
          "replies": [
            {
              "id": "hjdl1so",
              "text": "Yeah I mean let’s take the eastern shore for example. They have shitty public schools and one shitty private school and the reason is because instead of integrating they built a private school for white kids and they are the people who don’t want kids to learn about critical race theory. Lmaoooooo fuckkk all the redneck idiots in va, you know who you are you fucking morons",
              "timestamp": "2021-11-05 04:16:26",
              "score": 11,
              "num_children": 1,
              "replies": [
                {
                  "id": "hjeq702",
                  "text": "I went to that private school, and my graduating year was the 40th celebration of the schools founding.",
                  "timestamp": "2021-11-05 12:50:38",
                  "score": 3,
                  "num_children": 0,
                  "author": 36960,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hjcbbge",
          "text": "North Dakota is about to vote on making critical race theory illegal to teach in school.",
          "timestamp": "2021-11-04 22:25:35",
          "score": 14,
          "num_children": 1,
          "author": 316902,
          "replies": [
            {
              "id": "hje636l",
              "text": "\"Oh this? No, this isn't Critical Race Theory. This is just unedited history. I wouldn't teach CRT, because that would be *illegal.*\"",
              "timestamp": "2021-11-05 08:52:46",
              "score": 6,
              "num_children": 0,
              "author": 142060,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hjc1nt4",
      "text": "Education is toxic to conservative ideologies.",
      "timestamp": "2021-11-04 21:19:57",
      "score": 55,
      "num_children": 0,
      "author": 46590,
      "replies": []
    },
    {
      "id": "hjbu8qs",
      "text": "Same people who protest that taking down of confederate statues because \"it's part of our history\"",
      "timestamp": "2021-11-04 20:31:11",
      "score": 21,
      "num_children": 1,
      "author": 107867,
      "replies": [
        {
          "id": "hn2q5e5",
          "text": "Yeah ppl trying to do \"gotchas\" but we're way past that. Irony is dead. This is just racism. They're not embarrassed old white people. They're racists who want to shut the door entirely on teaching any Black struggles/history.",
          "timestamp": "2021-12-03 15:17:44",
          "score": 2,
          "num_children": 1,
          "author": 274168,
          "replies": [
            {
              "id": "hn4egez",
              "text": "[I fully agree, because there are also people like this](https://youtube.com/shorts/H9OUYehT_pw?feature=share)",
              "timestamp": "2021-12-03 22:12:05",
              "score": 1,
              "num_children": 0,
              "author": 107867,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hjbo3vi",
      "text": "Credit goes to: https://www.facebook.com/TheDailyDon",
      "timestamp": "2021-11-04 19:51:16",
      "score": 9,
      "num_children": 0,
      "author": 190373,
      "replies": []
    },
    {
      "id": "hjc1g7c",
      "text": "Are you a lawyer? Critical Race Theory is only really taught in law schools. Republicans and the right just think it sounds scary enough to scare white people. \n\nAnd what do you believe the “true” history is?",
      "timestamp": "2021-11-04 21:18:31",
      "score": 27,
      "num_children": 3,
      "author": 56446,
      "replies": [
        {
          "id": "hjcyzwt",
          "text": "Here’s the story about how a conservative activist invented the CRT “outrage.” https://www.newyorker.com/news/annals-of-inquiry/how-a-conservative-activist-invented-the-conflict-over-critical-race-theory",
          "timestamp": "2021-11-05 01:15:47",
          "score": 14,
          "num_children": 0,
          "author": 371927,
          "replies": []
        },
        {
          "id": "hjcgw35",
          "text": "White people still need to be scared, pick up where gangsta rap left off.  Very healthy thing to let bootlickers know to stfu.",
          "timestamp": "2021-11-04 23:04:34",
          "score": 10,
          "num_children": 2,
          "replies": [
            {
              "id": "hjclh8f",
              "text": "The fear of Critical Race Theory isn’t the same type of fear as what you’re describing. Fear of CRT isn’t making white people cross the street, lock their doors or stay out of certain neighborhoods. It’s making them vote. Run for school boards. Run for local office. It’s making them get involved so that they can fight against a perceived threat. \n\nRepublicans saw their voter base shrink last election, they saw people becoming disillusioned with voting, and they saw that their voters WILL vote for the other party if they aren’t motivated enough. \n\nThat’s what the fight against CRT is. It’s not because the Republicans in charge actually think it’s bad for our children. Children don’t even learn it. Most college students don’t study it. The Republicans in office know this but they know the majority done. All the rage around CRT is is a way for the Republican Party to get voters in the booth so that they can pass their tax breaks and draconian laws.",
              "timestamp": "2021-11-04 23:37:13",
              "score": 23,
              "num_children": 2,
              "author": 56446,
              "replies": [
                {
                  "id": "hjcmfc3",
                  "text": "I see.  That's very eye opening. And so much worse.",
                  "timestamp": "2021-11-04 23:43:52",
                  "score": 10,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hjdk4wt",
                      "text": "It really is terrifying. That’s why the left needs to change its messaging. Right now everyone is defending CRT, and they should, but that doesn’t help the actual cause at all. What the left needs to do is reframe what we’re saying about CRT. \n\nThe left should be on every tv channel, social media website, radio station and whatever asking why Republicans are worried about something that’s taught in university. \n\nWe need to be acting as if their rhetoric is laughable and not worth any time we focus on it. We need people on social media making fucking memes mocking republicans for not knowing what they’re upset about. We need to meet their bullshit with the response it deserves. Laughter. \n\nThe left getting defensive about it only solidifies the fears that white people are having. \n\n\nWhy else would they argue and defend it so much if it wasn’t exactly what republicans said?\n\nInstead, we need to, clearly and without hesitation, demonstrate that we care about the lessons actually taught in school. We need to make it obvious that we don’t even find their remarks worth any response besides dumbfounded laughter and a remark of \n\n> “I’m not sure why they think 7 year olds will be in college but that’s where this theory is taught. Maybe they’re not familiar enough with our public education system?”",
                      "timestamp": "2021-11-05 04:07:24",
                      "score": 5,
                      "num_children": 2,
                      "author": 56446,
                      "replies": [
                        {
                          "id": "hjdxghx",
                          "text": "Hmm, you raise interesting and valid points.",
                          "timestamp": "2021-11-05 06:43:49",
                          "score": 3,
                          "num_children": 0,
                          "replies": []
                        },
                        {
                          "id": "hjevxfq",
                          "text": "Sorry to tell ya, but the majority of white people vote FOR racism. Look at the numbers for Trump. They knew what he was and STILL voted for him twice. This isn't a messaging issue. White people like \"sheets\" or covers that they can hide their racism behind and feign ignorance. CRT is just the newest cover. \n\nMany will argue for hours that they never thought Trump  was racist, while deep down they know that's exactly why they voted for him. Studies have shown this. Until sane white people accept the fact that MOST white people WANT to oppress others, the problem will only grow. The white vs white/others civil war is coming.",
                          "timestamp": "2021-11-05 13:36:38",
                          "score": 1,
                          "num_children": 1,
                          "author": 47090,
                          "replies": [
                            {
                              "id": "hjf137b",
                              "text": "> Sorry to tell ya, but the majority of white people vote FOR racism. Look at the numbers for Trump. They knew what he was and STILL voted for him twice. \n\nThat’s true but we saw those numbers drop significantly last year and Trump lost while other Republicans one. This is a scary scenario for the GOP because it shows their mental stranglehold on their voters isn’t as strong as they thought. It shows that they won’t always vote red. \n\n\n> This isn't a messaging issue. White people like \"sheets\" or covers that they can hide their racism behind and feign ignorance. CRT is just the newest cover.\n\nDefinitely. Dog whistles have been used forever to try and “hide” racism. CRT is just the newest and loudest dog whistle. \n\n> Many will argue for hours that they never thought Trump  was racist, while deep down they know that's exactly why they voted for him. Studies have shown this. Until sane white people accept the fact that MOST white people WANT to oppress others, the problem will only grow. The white vs white/others civil war is coming.\n\nI don’t believe a civil war is imminent. Not because the makings of one aren’t there. Our country is a powder keg and theirs book of matches 3 feet away.  But mainly because of the people in our country, our military and the fact that we don’t have defined borders like we did previously. \n\nI think we will see acts of domestic terrorism committed by white peoples sky rocketing. I’m terrified of that. I live in a blue city surrounded by red and there have already been issues. \n\n> Until sane white people accept the fact that MOST white people WANT to oppress others, the problem will only grow.\n\nFor the sake of honesty and clarity, I’m  white af. Like, John Mulaney white but without the addiction. I grew up in a racist household, in racist towns and among racist people. I knew slurs that most people didn’t before middle school. I didn’t fall into that because I was exposed to non-racist communities online and found the truth. \n\nThis is why I don’t agree that the majority of them  want to oppress people. They’re ignorant and fearful and politicians fight to make sure that doesn’t change. It’s why they’re against better education programs and free college. Knowledge helps kill that fear.  \n\nPoliticians play up that fear knowing it’ll drive people to the polls. They use things like CRT to convince ignorant white people that their fake enemy is going to try and oppress anyone them. I heard numerous conversations growing up about how POC weren’t fighting for equality. They were fighting for superiority. \n\nThat’s not true but media tells them it is. That’s why they believe that Black Lives Matter means ONLY Black Lives Matter. It’s why they love to say stupid shit like “I believe everyone should be equal. No one deserves special privileges just because of their skin color”\n\nFor most people, if they could snap their fingers and everything would be equal and perfect for everyone then they would snap their fingers like Thanos.\n\nNow, this isn’t all to say there isn’t a huge chunk of the white American population that would love to return to the old days where there was no question of who or who wasn’t at risk of being oppressed. They have been fed bullshit their entire lives by friends, family and Fox. \n\nThose people exist and they like to be heard. Unfortunately. \n\nBut the others, which I feel make up the majority, are just stupid and afraid. That’s why the GOP focuses on non-college educated poor people.  They know that they can convince them that “scary POC want to take over and make you their slave and teach your children you’re evil” and they’ll believe it and vote. They believe them when they say that they too can become rich but it’s POC that are keeping them from that.\n\nBesides doing the things that are needed to make things truly equal, such as criminal justice reform, tax reform, reparations, and, you know, essentially recreating our entire racist ass legal system, we also need to invest heavily in education. \n\nIf we could get free pre-k and free college, we could have a huge effect on the number of racists in this country. There would still be a lot, of course, but it would drop significantly. \n\nOh, and yeah. I agree. The majority of white people are dense as fuck and don’t realize that there is a population of people who don’t want equality.",
                              "timestamp": "2021-11-05 14:14:39",
                              "score": 2,
                              "num_children": 0,
                              "author": 56446,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hjcqsog",
                  "text": "Even most of the draconian laws are just about riling up religious lunatics, even those aren't the real point. Even racism itself isn't quite at the heart of the matter. Even money isn't quite it.  \n\n\nIt's power for its own sake. That's it, that's all it is. These people would be wannabe Stalins if we were under a different system, capitalism and traditionalism just happen to be how you get power here and now.",
                  "timestamp": "2021-11-05 00:15:47",
                  "score": 5,
                  "num_children": 0,
                  "author": 194801,
                  "replies": []
                }
              ]
            },
            {
              "id": "hjd2kjw",
              "text": "And it works, but it's not just white people.  There are a ton of low information people who are easily swayed if something fits a preconceived narrative of theirs.",
              "timestamp": "2021-11-05 01:42:10",
              "score": 2,
              "num_children": 1,
              "author": 35603,
              "replies": [
                {
                  "id": "hjewvlp",
                  "text": "Oh definitely. I am guilty of believing things far too quickly purely because it agreed with me. And that’s honestly the heart of it. It’s wealthy people exploiting emotions to keep people separated and fighting amongst themselves. Whether it be black people vs white people, Mexican people vs white people, Asian people vs white people, or Republican vs Democrat.  It’s all manufactured by the wealthy to exploit people’s most intense emotions. Fear, anger, jealousy, doubt and many more. \n\nThe fight for equality really isn’t black vs white. It’s everyone vs the wealthy. This isn’t to say that black people aren’t having to fight harder for equality than most because they definitely do. But it’s the wealthy who intentionally exacerbate racial tensions amongst groups for political and financial gain. \n\nThey know that they have to keep everyone fighting and from truly uniting and seeing the capitalistic machine for what it is. For seeing their lies for what they are. From realizing that we really do have the power to change this all if we decided to.",
                  "timestamp": "2021-11-05 13:43:51",
                  "score": 2,
                  "num_children": 0,
                  "author": 56446,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hje1no1",
          "text": "This is the most correct comment in the thread, and is somehow near the top for controversial.  By and large, gradeschool students are *not* being taught \"critical race theory,\" so conservatives protesting it and progressives supporting it without fully understanding it are both fucking stupid.  [Critical Race Theory](https://en.wikipedia.org/wiki/Critical_race_theory) is not teaching students that being enslaved really sucked, nor is it about teaching students that white people are *pure evil*.",
          "timestamp": "2021-11-05 07:45:17",
          "score": 1,
          "num_children": 1,
          "author": 152307,
          "replies": [
            {
              "id": "hje1oh8",
              "text": "**[Critical race theory](https://en.wikipedia.org/wiki/Critical_race_theory)** \n \n >Critical race theory (CRT) is a body of legal scholarship and an academic movement of civil-rights scholars and activists who seek to examine the intersection of race and law in the United States and to challenge mainstream American liberal approaches to racial justice. CRT examines social, cultural, and legal issues primarily as they relate to race and racism in the U.S.. A tenet of CRT is that racism and disparate racial outcomes are the result of complex, changing, and often subtle social and institutional dynamics, rather than explicit and intentional prejudices of individuals.\n \n^([ )[^(F.A.Q)](https://www.reddit.com/r/WikiSummarizer/wiki/index#wiki_f.a.q)^( | )[^(Opt Out)](https://reddit.com/message/compose?to=WikiSummarizerBot&message=OptOut&subject=OptOut)^( | )[^(Opt Out Of Subreddit)](https://np.reddit.com/r/Fuckthealtright/about/banned)^( | )[^(GitHub)](https://github.com/Sujal-7/WikiSummarizerBot)^( ] Downvote to remove | v1.5)",
              "timestamp": "2021-11-05 07:45:38",
              "score": 1,
              "num_children": 0,
              "author": 358107,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hjeyz1b",
      "text": "I’ve always thought that Progressives in this country don’t understand Conservatives and how to talk to them. \n\nInstead of calling it “Critical Race Theory” they should’ve called it “Patriotic Jesus AR-15 Love Theory” and American conservatives would be falling over each other to insist their kids spend no fewer than 6 hours a day learning about it. \n\nIt’s a messaging issue.",
      "timestamp": "2021-11-05 13:59:31",
      "score": 2,
      "num_children": 0,
      "author": 82144,
      "replies": []
    },
    {
      "id": "hjdrhqw",
      "text": "Sure, maybe we don't teach this to five year old kids who wouldn't understand, but a high school aged kid is more than capable of understanding it. I still love my grandparents even though they have some fucked up old people opinions, and I don't hate myself for being White even though I know White people did and still do some pretty not okay stuff.\n\nRACISM IS BAD AND HURTS EVERYONE.",
      "timestamp": "2021-11-05 05:26:01",
      "score": 1,
      "num_children": 0,
      "author": 35057,
      "replies": []
    },
    {
      "id": "hjb1euc",
      "text": "[removed]",
      "timestamp": "2021-11-04 17:22:51",
      "score": -24,
      "num_children": 4,
      "replies": [
        {
          "id": "hjb6ueu",
          "text": "> But which is it?\n\nDefine \"CRT\" - are you talking about the graduate level legal theory framework or *basic* history?\n\nIt's when laws restricting history lessons are passed that we start to have a problem.",
          "timestamp": "2021-11-04 17:58:03",
          "score": 40,
          "num_children": 1,
          "author": 59942,
          "replies": [
            {
              "id": "hjb86re",
              "text": "[removed]",
              "timestamp": "2021-11-04 18:06:48",
              "score": -23,
              "num_children": 3,
              "replies": [
                {
                  "id": "hjb8sgz",
                  "text": "What are you trying to accomplish with your criticism of CRT?\n\nEdit: also, name calling is rude and unpersuasive. You here just to troll?",
                  "timestamp": "2021-11-04 18:10:48",
                  "score": 29,
                  "num_children": 0,
                  "author": 59942,
                  "replies": []
                },
                {
                  "id": "hjbafoy",
                  "text": "[Texas House Bill 3979](https://www.texastribune.org/2021/10/15/Texas-critical-race-theory-law-confuses-educators/)",
                  "timestamp": "2021-11-04 18:21:39",
                  "score": 17,
                  "num_children": 0,
                  "author": 367855,
                  "replies": []
                },
                {
                  "id": "hjbaobv",
                  "text": "TX HB 3979",
                  "timestamp": "2021-11-04 18:23:15",
                  "score": 15,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hjb8pjq",
          "text": "CRT is college level stuff but echoes of it are and have been taught in schools. Teaching elementary kids how past racism is still present in our laws and societal norms is too complex for them, but teaching them about that past racism isn’t and is in fact necessary for teaching them the complicated stuff later on. Opponents of CRT are typically opposed to teaching students anything about America’s race problems",
          "timestamp": "2021-11-04 18:10:16",
          "score": 21,
          "num_children": 1,
          "author": 381930,
          "replies": [
            {
              "id": "hjbbobk",
              "text": "Many (most) southern states are still teaching that \"The war between the states was about states rights.   The Plantation owners had many people working for them, and they were fed and clothed and were happy in their work.\" kind of stuff.\n\nI mean, to many of these goobers, even admitting they were slaves (let alone starved, beaten, whipped, children sold off, or killed) is CRT.",
              "timestamp": "2021-11-04 18:29:51",
              "score": 21,
              "num_children": 1,
              "author": 271845,
              "replies": [
                {
                  "id": "hjbfeyu",
                  "text": "https://fredericksburg.com/news/education/happy-slaves-the-peculiar-story-of-three-virginia-school-textbooks/article\\_654822fc-37fb-50dd-a6e5-80d077d0cb70.html",
                  "timestamp": "2021-11-04 18:54:16",
                  "score": 8,
                  "num_children": 0,
                  "author": 271845,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hjbaemz",
          "text": "‘*Is this CRT?*’",
          "timestamp": "2021-11-04 18:21:28",
          "score": 9,
          "num_children": 1,
          "replies": [
            {
              "id": "hjbbrzc",
              "text": "CRT is the tube in your grandparents TV.",
              "timestamp": "2021-11-04 18:30:30",
              "score": 7,
              "num_children": 0,
              "author": 271845,
              "replies": []
            }
          ]
        },
        {
          "id": "hjb36nj",
          "text": "It's a nuanced issue. Some teachers subscribe to the CRT as a lens to view our history, laws, and culture and are using it to shape their curriculum. Some states require that history classes include material/subject discussion that aligns with CRT methodology, but many leave it to the teacher as long as they pass standardized testing. So it's a little of both, because the USA is massive.",
          "timestamp": "2021-11-04 17:34:23",
          "score": 14,
          "num_children": 1,
          "author": 315153,
          "replies": [
            {
              "id": "hjb3uae",
              "text": "[removed]",
              "timestamp": "2021-11-04 17:38:39",
              "score": -21,
              "num_children": 2,
              "replies": [
                {
                  "id": "hjb92ws",
                  "text": "There are plenty that quite literally do not know anything about it but oppose it because they are told to.\n\n[This man voted](https://twitter.com/zoostationaz/status/1455861075660836864)",
                  "timestamp": "2021-11-04 18:12:43",
                  "score": 10,
                  "num_children": 0,
                  "author": 44994,
                  "replies": []
                },
                {
                  "id": "hjb6b6w",
                  "text": "I can't speak for anyone else but there are a few details I've been able to sift out of the embellishments and lies some opponents use, and I kinda agree with them.\n\n\nWe shouldn't be physically delineating children based on their \"privilege score\" or whatever. It only drives to create unnecessary distinctions in the child's mind, and could produce the opposite intended effect. Instead we should strengthen the other parts of their education so they can have a greater understanding of abstract concepts. Then when we do introduce them to things like privilege, they aren't immediately going home saying \"well Dad, Mrs Simmons says Timmy's life is better than mine cause he's white/cis/het/etc. Why can't I be XYZ like Timmy!?!\" Or \"Mom, are we bad people? Teacher says our family went out and killed Sarah's great-great-grandparents for land/religion.\"\n\n\nHowever, things like Segregation, the Tulsa Massacre, the Chinese Exclusionary Act, Trail of Tears, etc etc should absolutely remain a facet of American history classes. We are a nation of exiled immigrants on stolen land, and that legacy should be a grave reminder for our citizenry to always act with wisdom, rather than courage or strength. Acting rashly out of fear has never benefitted the men and women of America, and will continue to harm us unless we find a way to unite.\n\nI understand the concern of a parent, however if parents cannot re-examine their own motives and self-reflect on the possibility they may be racist, then they might be racist. I don't think every opponent to CRT is racist, just that a lot of fearmongering occurs and people lash out over things they aren't being told the whole story about.",
                  "timestamp": "2021-11-04 17:54:33",
                  "score": 6,
                  "num_children": 1,
                  "author": 315153,
                  "replies": [
                    {
                      "id": "hjb849p",
                      "text": "[removed]",
                      "timestamp": "2021-11-04 18:06:21",
                      "score": -6,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hjb98g0",
                          "text": "It's very obvious you came here to agenda-post, and you don't need my response to do that. Just type all this passive-aggressive shit in your first comment and save us the trouble. I thought we were having a respectful back and forth, but I see that your sensitivity to the issue prevents you from being cordial.\n\nYou say it is not the job of the government to police the ideologies of its citizens, yet is this not the purpose of the public school? To engender the youth with a productive outlook that will further the interests of the state? If you are against the government teaching, perhaps your next hill to die on will be the abolition of the public school system. Have a good day.",
                          "timestamp": "2021-11-04 18:13:43",
                          "score": 12,
                          "num_children": 0,
                          "author": 315153,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hjdlpeq",
      "text": "You know, my dad would say he was supportive of Loving v Virginia at the time, and is now a Youngkin voter",
      "timestamp": "2021-11-05 04:23:01",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hjed7bu",
      "text": "The part I never understood is why these kinds of folks arent upset at European history?",
      "timestamp": "2021-11-05 10:34:56",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hjexej3",
      "text": "The then was only like a month ago",
      "timestamp": "2021-11-05 13:47:48",
      "score": 1,
      "num_children": 0,
      "author": 96536,
      "replies": []
    },
    {
      "id": "hjb5574",
      "text": "[removed]",
      "timestamp": "2021-11-04 17:46:59",
      "score": -30,
      "num_children": 7,
      "replies": [
        {
          "id": "hjb5pi1",
          "text": "Even ignoring that much of what you wrote is various shades of demonstrably untrue and deliberately misleading, do you think we worship the Democratic Party here on what? Do you think anybody here sees them as anything more but the lesser evil, and so often equally screwed? You’re funny.",
          "timestamp": "2021-11-04 17:50:38",
          "score": 37,
          "num_children": 1,
          "author": 283187,
          "replies": [
            {
              "id": "hjb6it5",
              "text": "[removed]",
              "timestamp": "2021-11-04 17:55:57",
              "score": -17,
              "num_children": 1,
              "replies": [
                {
                  "id": "hjbbj0k",
                  "text": "What is your argument? What behavior would you like changed?",
                  "timestamp": "2021-11-04 18:28:53",
                  "score": 20,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hjb95ly",
          "text": "See the issues here are \n\n1) You don’t understand that Democrats were once a Conservative party with most of their base in the south. The party changed when the dixiecrats (who would later become Republican voters) splintered off around WW2.\n\n2) You assume progressives and leftists are all loyal Democrats, when for most of us it’s simply the choice out of two that aligns closest with our values",
          "timestamp": "2021-11-04 18:13:12",
          "score": 32,
          "num_children": 1,
          "author": 381930,
          "replies": [
            {
              "id": "hjczi5r",
              "text": "Dixiecrats left in 1964, after LBJ signed the Civil Rights and Voting Rights Acts.",
              "timestamp": "2021-11-05 01:19:35",
              "score": 1,
              "num_children": 0,
              "author": 371927,
              "replies": []
            }
          ]
        },
        {
          "id": "hjb861e",
          "text": "If even any of this shit was true, why would teaching kids about it be a bad thing?",
          "timestamp": "2021-11-04 18:06:40",
          "score": 22,
          "num_children": 1,
          "author": 254510,
          "replies": [
            {
              "id": "hjbd5gg",
              "text": "[removed]",
              "timestamp": "2021-11-04 18:39:31",
              "score": -2,
              "num_children": 1,
              "replies": [
                {
                  "id": "hjbddag",
                  "text": "Answer the question.",
                  "timestamp": "2021-11-04 18:40:57",
                  "score": 18,
                  "num_children": 1,
                  "author": 254510,
                  "replies": [
                    {
                      "id": "hjbdrub",
                      "text": "[removed]",
                      "timestamp": "2021-11-04 18:43:33",
                      "score": -2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hjbdw2y",
                          "text": "Lmao",
                          "timestamp": "2021-11-04 18:44:19",
                          "score": 12,
                          "num_children": 0,
                          "author": 254510,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hjbdq54",
          "text": "\"Truth hurts...\" As you type misleading or flat out factually incorrect information like it's some truth bomb. As someone's already mentioned Democrats are not worshiped here. They're much more moderate, maybe slightly left leaning depending on the individual. Not sure what your point is. FUCK THE ALT RIGHT, and FUCK you if you enable their bullshit.",
          "timestamp": "2021-11-04 18:43:15",
          "score": 21,
          "num_children": 1,
          "author": 13855,
          "replies": [
            {
              "id": "hjbejro",
              "text": "Love it when they get destroyed and proven wrong by the community at large and just **need** to throw in that little edit to \"save face\" (but only in their sad little minds).",
              "timestamp": "2021-11-04 18:48:35",
              "score": 11,
              "num_children": 1,
              "replies": [
                {
                  "id": "hjbrqrq",
                  "text": "And then delete soon after. What must you think of your own opinions if some disagreement leads to you deleting your comment? Either you're in bad faith, or a bot. A true believer would not delete.",
                  "timestamp": "2021-11-04 20:15:01",
                  "score": 9,
                  "num_children": 0,
                  "author": 139913,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hjb93o5",
          "text": "Are you referring to the days when southern conservatives made up a sizeable component of the Democratic Party?\n\nCool. Just checking.",
          "timestamp": "2021-11-04 18:12:51",
          "score": 19,
          "num_children": 1,
          "author": 373737,
          "replies": [
            {
              "id": "hjcrete",
              "text": "I love how, every once in a while, someone rolls straight off a turnip truck and watches those Prager U videos that completely decontextualize the fact that the Democrats used to be racist.  \n\n\nNo shit genius. That completely ignores the southern strategy and all the rest of the details. It's not quite as simple as \"the parties switched,\" but it's actually not far off from that, either. For a fun exercise, check the political party membership of the KKK in 2021 and see if it's still full of Democrats. Lotta Obama votes in that crowd, right? ;)  \n\n\nIt also ignores the fact the the Democrats are solidly \"lesser of two evils.\" We all know they suck. If the Republicans didn't exist as a constant existential threat I'd never vote Democrat.",
              "timestamp": "2021-11-05 00:20:16",
              "score": 9,
              "num_children": 0,
              "author": 194801,
              "replies": []
            }
          ]
        },
        {
          "id": "hjb5i8u",
          "text": "https://en.m.wikipedia.org/wiki/Southern_strategy\n\nDo your own research lol",
          "timestamp": "2021-11-04 17:49:20",
          "score": 39,
          "num_children": 1,
          "author": 352920,
          "replies": [
            {
              "id": "hjb5t4d",
              "text": "[removed]",
              "timestamp": "2021-11-04 17:51:16",
              "score": -14,
              "num_children": 1,
              "replies": [
                {
                  "id": "hjb64le",
                  "text": "Hey it's like old white people are just fucking racist.\n\nBiden is only one year younger than Emmett Till would be if he wasn't lynched, so I'm not surprised at all.\n\nPeople can change, even George Fucking Wallace had the highest number of Black people in his administration in Alabama history probably outside of Reconstruction while being the biggest proponent of desegregation before the SCOTUS stepped in.",
                  "timestamp": "2021-11-04 17:53:21",
                  "score": 26,
                  "num_children": 1,
                  "author": 352920,
                  "replies": [
                    {
                      "id": "hjbczm5",
                      "text": "[removed]",
                      "timestamp": "2021-11-04 18:38:28",
                      "score": -2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hjbfa9g",
                          "text": "He’s not currently using his position to actively promote racist attitudes, in a country that’s also supposed to belong to the recipients of those attitudes. \n\nThat’s better than the last guy\n\nIt ain’t fuckin hard, ace.",
                          "timestamp": "2021-11-04 18:53:25",
                          "score": 10,
                          "num_children": 1,
                          "author": 223952,
                          "replies": [
                            {
                              "id": "hjblnvh",
                              "text": "Guy willingly let a black guy be his boss which is kinda the opposite of a bunch of white supremacist ideas, not ya know, proliferating a conspiracy about the boss' birth certificate.",
                              "timestamp": "2021-11-04 19:35:23",
                              "score": 7,
                              "num_children": 0,
                              "author": 352920,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hjbf97r",
          "text": "Someone never heard of the Southern Strategy.",
          "timestamp": "2021-11-04 18:53:14",
          "score": 11,
          "num_children": 0,
          "author": 277957,
          "replies": []
        }
      ]
    },
    {
      "id": "hjc7zrr",
      "text": "[removed]",
      "timestamp": "2021-11-04 22:02:39",
      "score": -12,
      "num_children": 1,
      "replies": [
        {
          "id": "hjcgpri",
          "text": "Better a theory than an out and out lie like \"the Civil War was about states rights\"",
          "timestamp": "2021-11-04 23:03:22",
          "score": 11,
          "num_children": 1,
          "author": 15766,
          "replies": [
            {
              "id": "hjcl1r9",
              "text": "Oh don’t worry. The ~~slaves~~ unpaid workers were just unpaid workers.\n\n^/s",
              "timestamp": "2021-11-04 23:34:08",
              "score": 3,
              "num_children": 0,
              "author": 91379,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hjbq3y3",
      "text": "[removed]",
      "timestamp": "2021-11-04 20:04:24",
      "score": -11,
      "num_children": 2,
      "replies": [
        {
          "id": "hjbs3bp",
          "text": "Yes indeed the man depicted here doesnt know what crt means, or he knows it and doesnt want people to know he was part of the problem",
          "timestamp": "2021-11-04 20:17:13",
          "score": 19,
          "num_children": 0,
          "author": 152572,
          "replies": []
        },
        {
          "id": "hjbw4xq",
          "text": "Tell me what you think CRT is",
          "timestamp": "2021-11-04 20:43:30",
          "score": 11,
          "num_children": 1,
          "author": 362544,
          "replies": [
            {
              "id": "hjefx6b",
              "text": "Critical Race Theory is a discussion on how the social system is biased, and rhis bias is about race and on how racism was the result of intricate and continuosly changing institutional context, which then influenced the public",
              "timestamp": "2021-11-05 11:08:21",
              "score": 2,
              "num_children": 0,
              "author": 152572,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}