{
  "id": "qrfyns",
  "text": "Systemic racism wins again.\n",
  "timestamp": "2021-11-11 07:39:17",
  "score": 4263,
  "subreddit": "t5_3fdcn",
  "num_children": 50,
  "author": 26930,
  "replies": [
    {
      "id": "hk6f8h2",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2021-11-11 07:39:17",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "hk7c0gx",
      "text": "[deleted]",
      "timestamp": "2021-11-11 14:07:55",
      "score": 142,
      "num_children": 3,
      "replies": [
        {
          "id": "hk7o4yu",
          "text": "the judge is trumpy as fuck and was basically his defense attourney yesterday.\n\nShould have been a mistrial after the juror was dismissed. That way all that money spent bribing the jurors goes to shit. allegedly.",
          "timestamp": "2021-11-11 15:39:03",
          "score": 104,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hk7eeai",
          "text": "Wasn't it obvious when they disallowed referring to the people he shot as victims by the prosecution, but could be called looters, rioters, etc. Innocent until proven guilty amiright?\n\nThe one who survived isn't even being charged.",
          "timestamp": "2021-11-11 14:26:42",
          "score": 108,
          "num_children": 1,
          "author": 373543,
          "replies": [
            {
              "id": "hk7mddr",
              "text": "In self defense proceedings that’s normal.",
              "timestamp": "2021-11-11 15:26:14",
              "score": -21,
              "num_children": 1,
              "author": 323307,
              "replies": [
                {
                  "id": "hk7mts0",
                  "text": "The irony is that the only person being charged here is the one claiming self defense. The child that traveled to the town while illegally being in possession of a firearm.\n\nEdit: also want to add, generally I'd think a majority of self defense cases that make it to court probably involve home invasion or maybe mugging, where the supposed \"victim\" had already committed a crime directly involving the person who had to defend themselves, breaking and entering or assault.",
                  "timestamp": "2021-11-11 15:29:36",
                  "score": 36,
                  "num_children": 0,
                  "author": 373543,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hk7r50v",
          "text": "His phone went off in court and the ring tone was something Trump plays at his rallies.",
          "timestamp": "2021-11-11 16:00:35",
          "score": 43,
          "num_children": 0,
          "author": 117194,
          "replies": []
        }
      ]
    },
    {
      "id": "hk7aakz",
      "text": "Man, this shit is so fucked. I saw a video of the events on publicfreakout, I think, and all that was on my mind was \"fuck my life how is anyone defending this?\" and then at the end he just walks off past the police and they don't even arrest the guy walking down the street with a massive gun what.... then I went to the comments. Fuck me dead. It really seems like most people are on his side. I don't understand how people were saying \"well he's obviously going to walk\" from the footage as if what he was doing wasn't totally insane. I think you need to be American to understand this shit.... I guess?",
      "timestamp": "2021-11-11 13:54:07",
      "score": 564,
      "num_children": 10,
      "author": 292509,
      "replies": [
        {
          "id": "hk7juqj",
          "text": "Allegedly those that were running after him were threatening him harm, putting this into the category of self-defense...\n\n...however...\n\n...that's if you exclude the evidence leading up to the events like Rittenhouse posing with proud boys, saying outside of CVS he would shoot looters, and being driven across state lines with a loaded firearm to commit anti-demonstration exercises...\n\n...which the judge did.",
          "timestamp": "2021-11-11 15:07:46",
          "score": 370,
          "num_children": 5,
          "replies": [
            {
              "id": "hk7kxrs",
              "text": "Rittenhouse was also agitating and harassing people prior the events as well which also went ignored.",
              "timestamp": "2021-11-11 15:15:47",
              "score": 162,
              "num_children": 2,
              "author": 411069,
              "replies": [
                {
                  "id": "hk7lxhx",
                  "text": "This is a fundamental gap in our legal system. \n\nDuring the height of the BLM protests, you could find countless videos of redneck technicals driving through protesters. The trucks were either loaded with people in the back with paintball guns and cosplay gear, or had the typical fascist flags (gadsden, thin blue line, trump, confederate etc) hanging from the tailgate.\n\nThese weren't people who had to go to the store for a carton of milk and then got hung up by protesters blocking their way.\n\nThese are people that DELIBERATELY showed up at the protests to antagonize the protesters, push through them to trigger a response, and the instant a protester slapped the hood of the truck, the sped off at full speed running people over, which is how they claim self defense. \n\nThat is EXACTLY what Rittenhouse did. \n\nWe have a giant gaping hole in our legal system that allows crucial context like this to be left out of these cases. Rittenhouse wasn't going for a stroll down his neighborhood. He DELIBERATELY drove across state lines to act as a vigilante. \n\nHe had no business being there in the first place.\n\nAnd may I remind you that leaving a bad situation and coming back to it eliminates your grounds of self defense. \n\nAnyone remember the Michael Giles case? \n\nhttps://famm.org/stories/michael-giles-no-ordinary-defendant/\n\n1. Was in a violent situation (not participating in the violence).\n2. Left the situation to go to a rental car to look for his friends.\n3. Didn't find his friends. Grabbed a gun he had there in case he needed it.\n4. *Went back into the violent situation* to look for his friends. \n5. Ended up needing to use the gun in self defense\n6. Currently serving 25 years *even though he was acquitted of the murder charge*. \n\nIf you deliberately put yourself in a risky situation in which you end up having to use lethal force to defend yourself, your ability to claim self defense takes a massive hit (well, if you're black anyway). \n\nIf we applied the same standards of the Michael Giles case to George Zimmerman, the redneck fucks that chased down and murdered Ahmaud Arbery, and Rittenhouse, they should all be going to prison for a very, very long time.",
                  "timestamp": "2021-11-11 15:23:03",
                  "score": 192,
                  "num_children": 1,
                  "author": 169109,
                  "replies": [
                    {
                      "id": "hk7o2k4",
                      "text": "[removed]",
                      "timestamp": "2021-11-11 15:38:34",
                      "score": -28,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hk7pnpt",
                          "text": "Well you're a shitty attorney then as per state of Wisconsin gun laws, nobody [under the age of 18](https://gunlawsuits.org/gun-laws/wisconsin/open-carry/) can open carry a firearm which Kyle Rittenhouse was doing thus breaking the law. \n\nHe also had no right to be there as Kenosha has a [curfew](https://www.kenosha.org/departments/police/public-information/frequently-asked-questions) for anyone under the age of 18.",
                          "timestamp": "2021-11-11 15:49:53",
                          "score": 59,
                          "num_children": 3,
                          "author": 411069,
                          "replies": [
                            {
                              "id": "hk84zvq",
                              "text": "While true, it would be a tragedy of justice to stick him with such a minor charge (no doubt a misdemeanor) when there are two people who are dead by his hand. ***He fucking murdered two people simply because he showed up***. Those people would be alive if he didn't even put himself in that position in the first place. \n\nMakes me so fucking angry I'm having a hard time even stomaching it.\n\nAnd let's not forget the precedent this will set. Even if we *did* slap him with such a minor charge, the message of his acquittal on murder charges will be heard loud and clear by the people who are [actively chomping at the bit to act as a death squad](https://www.washingtonpost.com/politics/2021/10/27/when-do-we-get-use-guns-ongoing-danger-false-fraud-claims/). \n\nThis will embolden people to carry out assassinations of protesters. It will be full blown domestic terrorism committed by unofficial gestapo-like squads of losers.\n\nThe government cannot truly prohibit protests (even though they try), but what they can do is *stand aside* and let murderous psychopaths keep protests in check. That is the message a Rittenhouse acquittal will send. Protesters better get ready for a dramatic increase in armed conflict.",
                              "timestamp": "2021-11-11 17:32:51",
                              "score": 13,
                              "num_children": 0,
                              "author": 169109,
                              "replies": []
                            },
                            {
                              "id": "hk7tgyj",
                              "text": "There was some loop hole I think he found to get around that charge. I forgot the term but you should be able to find it. It's talked about when people talk about what they could actually stick him with",
                              "timestamp": "2021-11-11 16:16:48",
                              "score": 1,
                              "num_children": 0,
                              "author": 277716,
                              "replies": []
                            },
                            {
                              "id": "hk7rknm",
                              "text": "[removed]",
                              "timestamp": "2021-11-11 16:03:37",
                              "score": -14,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hk7rpst",
                                  "text": "Then you probably shouldn't comment on the law in other states then.",
                                  "timestamp": "2021-11-11 16:04:37",
                                  "score": 19,
                                  "num_children": 1,
                                  "author": 411069,
                                  "replies": [
                                    {
                                      "id": "hk7spqj",
                                      "text": "[removed]",
                                      "timestamp": "2021-11-11 16:11:35",
                                      "score": -19,
                                      "num_children": 2,
                                      "replies": [
                                        {
                                          "id": "hk7t4xb",
                                          "text": "Everyone has been saying so. That's the point of this entire post. I don't think anyone ever thought he'd actually serve time for his crimes, because America.",
                                          "timestamp": "2021-11-11 16:14:32",
                                          "score": 16,
                                          "num_children": 1,
                                          "author": 10285,
                                          "replies": [
                                            {
                                              "id": "hk7tu9i",
                                              "text": "My point is that there very well may be valid legal reasons for the judge's rulings, and his being found not guilty (if that is what happens).",
                                              "timestamp": "2021-11-11 16:19:15",
                                              "score": -6,
                                              "num_children": 0,
                                              "author": 8151,
                                              "replies": []
                                            }
                                          ]
                                        },
                                        {
                                          "id": "hk7t88i",
                                          "text": "I fully expect Kyle Rittenhouse to be found not guilty. Doesn't change the fact you're a shitty attorney who couldn't even do their due diligence and look up gun laws and curfew laws.",
                                          "timestamp": "2021-11-11 16:15:11",
                                          "score": 14,
                                          "num_children": 1,
                                          "author": 411069,
                                          "replies": [
                                            {
                                              "id": "hk7tkv0",
                                              "text": "Oh for goodness sakes, chill out.  If you think I'm going to do legal research for a drive by post on reddit, you're crazy.  Have a nice day.",
                                              "timestamp": "2021-11-11 16:17:31",
                                              "score": -4,
                                              "num_children": 2,
                                              "author": 8151,
                                              "replies": [
                                                {
                                                  "id": "hk7yapj",
                                                  "text": "Then don't fucking declare you're an attorney if you're going to use zero attorney skills.",
                                                  "timestamp": "2021-11-11 16:48:39",
                                                  "score": 10,
                                                  "num_children": 0,
                                                  "author": 299010,
                                                  "replies": []
                                                },
                                                {
                                                  "id": "hk7ud6c",
                                                  "text": "And thus continuing to prove you are an absolutely shitty attorney.",
                                                  "timestamp": "2021-11-11 16:22:45",
                                                  "score": 9,
                                                  "num_children": 0,
                                                  "author": 411069,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hk80one",
                  "text": ">Rittenhouse was also agitating and harassing people prior the events as well which also went ignored.\n\nDidn't know about that, yet he was also offering first aid to people...",
                  "timestamp": "2021-11-11 17:04:18",
                  "score": -28,
                  "num_children": 2,
                  "author": 357309,
                  "replies": [
                    {
                      "id": "hk85u6b",
                      "text": "What a joke.\n\nHe.is.a.murderer.\n\nYou are defending a murderer.",
                      "timestamp": "2021-11-11 17:38:24",
                      "score": 14,
                      "num_children": 1,
                      "author": 116385,
                      "replies": [
                        {
                          "id": "hk9ptac",
                          "text": "Not defending him at all, watch WaPo’s vid on him and you will see",
                          "timestamp": "2021-11-12 00:13:32",
                          "score": -1,
                          "num_children": 0,
                          "author": 357309,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hk826ip",
                      "text": "You didn't know that because you only get 1/4 of the full story from conservative media outlets.",
                      "timestamp": "2021-11-11 17:14:18",
                      "score": 15,
                      "num_children": 1,
                      "author": 411069,
                      "replies": [
                        {
                          "id": "hk9pj2k",
                          "text": "Never said I watched FNC nor CNN all day",
                          "timestamp": "2021-11-12 00:11:15",
                          "score": -4,
                          "num_children": 1,
                          "author": 357309,
                          "replies": [
                            {
                              "id": "hk9rz1m",
                              "text": "lol, okay Libertarian.",
                              "timestamp": "2021-11-12 00:30:31",
                              "score": 4,
                              "num_children": 0,
                              "author": 411069,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hk7mgez",
              "text": "I think the fact has also been ignored that if you see a well armed white teenager anywhere, the rational thing to do is to try to disarm them. The way this kid showed up he matched the profile of every mass shooter of the last ten years so I think trying to tackle him is pretty reasonable.\n\nNext time a mass shooter shows up at a school, do people have to wait until he shoulders his gun and starts shooting before throwing a book at him or trying to stop him in anyway?\n\nOf course this whole thing could have been avoided if the cops had done their jobs. the cops basically funneled the protestors towards the heavily armed proud boys so that they could shoot them since the cops couldn’t. I don’t really feel any sympathy for this kid, but it is fucked up that this idiot 17 year old is on trial and not the police ground commander there or the proud boys leadership. People literally created a situation where someone would be dumb enough to do this. They knew he might go to jail, but it looks like he licked out and will probably speak at the 2024 GOP convention.",
              "timestamp": "2021-11-11 15:26:52",
              "score": 91,
              "num_children": 1,
              "author": 326667,
              "replies": [
                {
                  "id": "hk8fwue",
                  "text": "republicans in murica rn don't care about school shootings",
                  "timestamp": "2021-11-11 18:44:29",
                  "score": 22,
                  "num_children": 0,
                  "author": 141140,
                  "replies": []
                }
              ]
            },
            {
              "id": "hk7k6xm",
              "text": "I've heard that too. do you know what the basis for the exclusion was on legal grounds? besides rhe obvious bias and what do you even do when the judge is showing bias like this",
              "timestamp": "2021-11-11 15:10:15",
              "score": 83,
              "num_children": 1,
              "author": 285324,
              "replies": [
                {
                  "id": "hk7ndrg",
                  "text": "This isnt on the judge. Judge's rulings have been relatively fair from what I've seen. This is on an incompetent prosecutor.",
                  "timestamp": "2021-11-11 15:33:38",
                  "score": -40,
                  "num_children": 4,
                  "author": 350965,
                  "replies": [
                    {
                      "id": "hk7t5rk",
                      "text": "I’d say being prohibited from calling victims victims is a interesting flourish of legal artistry",
                      "timestamp": "2021-11-11 16:14:42",
                      "score": 75,
                      "num_children": 2,
                      "author": 74381,
                      "replies": [
                        {
                          "id": "hk83ocp",
                          "text": "Nah man the judge’s rationale for this is sound. He says that someone is only a victim if a crime has been committed, and this trial is to determine whether or not Rittenhouse is guilty of a crime.",
                          "timestamp": "2021-11-11 17:24:15",
                          "score": -32,
                          "num_children": 3,
                          "author": 216120,
                          "replies": [
                            {
                              "id": "hk8566s",
                              "text": "I would say that the definition is a little wider than that. Someone who dies in a fire or a car accident is still a victim. Those killed by Rittenhouse will certainly be counted as victims of gun violence. I understand the judge feels that the term might create bias but calling a demonstrator/protester a rioter or looter does the very same thing.  \n\n\nI think when the Judge's phone accidentally played Trumps walk-on song, we all understood where the bias was in that courtroom.",
                              "timestamp": "2021-11-11 17:33:59",
                              "score": 38,
                              "num_children": 2,
                              "author": 338881,
                              "replies": [
                                {
                                  "id": "hk86quf",
                                  "text": ">I think when the Judge's phone accidentally played Trumps walk-on song, we all understood where the bias was in that courtroom.\n\nWhat the flying fuck, I didn't hear about that.",
                                  "timestamp": "2021-11-11 17:44:11",
                                  "score": 23,
                                  "num_children": 1,
                                  "author": 235695,
                                  "replies": [
                                    {
                                      "id": "hk8bf3q",
                                      "text": "1) Fuck trump\n\n2) it's a popular song, that goes \"... And I'm proud to be an American; Where at least I know I'm free... \"  that's been pretty popular during my childhood at least. It's predates trump for a while, so a boomer American judge having this as his ringtone isn't really a surprise.\n\nEdit: formatting",
                                      "timestamp": "2021-11-11 18:14:37",
                                      "score": -8,
                                      "num_children": 0,
                                      "author": 184485,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "hk878ko",
                                  "text": "Oh I still the judge is personally biased. I just think his rulings are considerably more fair when taken with context. The \"rioter/looter\" would be terrible in isolation, but the context is that the judge only allows those descriptions if the defense can prove that the people were actually rioting and looting, which they weren't so they can't.",
                                  "timestamp": "2021-11-11 17:47:20",
                                  "score": -4,
                                  "num_children": 0,
                                  "author": 216120,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hk8qyw4",
                              "text": "That is absolutely bullshit. I've literally been on the stand as a victim in an attempted murder trial. Victim is the legally appropriate term, this judge is clearly biased and it almost seems like the prosecution is hoping for a mistrial so they can get another chance at him with a different judge.",
                              "timestamp": "2021-11-11 19:59:35",
                              "score": 10,
                              "num_children": 0,
                              "author": 364088,
                              "replies": []
                            },
                            {
                              "id": "hk8boy0",
                              "text": "Somewhere in the afterlife, Johnnie Cochran smiles.",
                              "timestamp": "2021-11-11 18:16:26",
                              "score": 2,
                              "num_children": 0,
                              "author": 97114,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hk7w8vo",
                          "text": "Look i think this guy is a piece of shit human being every bit as much as you do. But one of the \"victims\" admitted to pointing his gun at Kyle first.  Thats when kyle pulled the trigger. \n\nIf i point a gun at someone and then they shoot me for fear of being murdered, that doesnt make me a victim.",
                          "timestamp": "2021-11-11 16:35:13",
                          "score": -38,
                          "num_children": 5,
                          "author": 350965,
                          "replies": [
                            {
                              "id": "hk81bhg",
                              "text": "Actually in the legal world this usually does constitute a victim. A victim is generally just whoever the action was done against.",
                              "timestamp": "2021-11-11 17:08:35",
                              "score": 11,
                              "num_children": 0,
                              "author": 300419,
                              "replies": []
                            },
                            {
                              "id": "hk7xa0e",
                              "text": "This is after Kyle had killed an unarmed person and a crowd was yelling that he was basically an active shooter.",
                              "timestamp": "2021-11-11 16:41:58",
                              "score": 50,
                              "num_children": 2,
                              "author": 262460,
                              "replies": [
                                {
                                  "id": "hk80v7y",
                                  "text": "Yeah I honestly don’t understand this part. If he had dropped his gun, okay, he was no longer a threat. But like if this was a school shooting, would the courts really just say “well we can’t say for sure he was going to go shoot someone again so you shouldn’t have tried to defend the crowd”. In a home invasion they couldn’t chase Kyle out of the house and then shoot him but he just shot and killed two people out in public. Where does the public space end?",
                                  "timestamp": "2021-11-11 17:05:32",
                                  "score": 19,
                                  "num_children": 0,
                                  "author": 300419,
                                  "replies": []
                                },
                                {
                                  "id": "hk8c2cl",
                                  "text": "An unarmed person doesn't mean they're cuddly; he continued to pursue and attack Rittenhouse after Rittenhouse tried to deter him.",
                                  "timestamp": "2021-11-11 18:18:55",
                                  "score": -12,
                                  "num_children": 0,
                                  "author": 184485,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hk8h07a",
                              "text": "If you’d just shot someone, wouldn’t you realize that someone pointing a gun at YOU is a rational response? If not you, then the judge certainly should have.",
                              "timestamp": "2021-11-11 18:51:44",
                              "score": 6,
                              "num_children": 0,
                              "replies": []
                            },
                            {
                              "id": "hk80ugt",
                              "text": "This is mostly false.  He also testified that he didn’t point his gun at Kyle until he realized Kyle was re-racking his rifle to shoot him.  In other words, Kyle was trying to shoot him the entire time and managed to shoot first after all.  Despite what the media reports for clicks, the jury has to consider all testimony.",
                              "timestamp": "2021-11-11 17:05:23",
                              "score": 10,
                              "num_children": 0,
                              "author": 180038,
                              "replies": []
                            },
                            {
                              "id": "hk801hi",
                              "text": "Ah, so what you’re saying is that the victim should have just shot Rittenhouse, the active shooter who had already murdered a person, am I understanding you right? Maybe the right wing assholes are onto something with this Black Flag/No Quarter bullshit, death to fascists.",
                              "timestamp": "2021-11-11 17:00:02",
                              "score": 7,
                              "num_children": 0,
                              "author": 116977,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hk8341e",
                      "text": "This. It was never going to be a slam dunk trial but the prosecuter is an absolute moron. There are so many points like the one above he's failed to bring up and seems to actively let the defense walk all over him.",
                      "timestamp": "2021-11-11 17:20:29",
                      "score": 13,
                      "num_children": 0,
                      "author": 269087,
                      "replies": []
                    },
                    {
                      "id": "hk7ni6m",
                      "text": "definitely bringing that other guy to the stand with the story he told was ludicrous",
                      "timestamp": "2021-11-11 15:34:32",
                      "score": 34,
                      "num_children": 0,
                      "author": 285324,
                      "replies": []
                    },
                    {
                      "id": "hk89t14",
                      "text": "I don’t think the judge is great but you are right about the prosecutor. He’s throwing it, they don’t want to prosecute and they never did they just wanted the rioting to stop. I genuinely think they are trying to get a mistrial to push the blame of the DA and onto the judge.",
                      "timestamp": "2021-11-11 18:03:54",
                      "score": 7,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hk7lmon",
              "text": "I don't even get the self-defense bit. It seems he approached someone with his gun and they went to push it away/grab the barrel and he shot them dead, then people are like \"wtf this fucking guy just shot someone stop him!!\" and people try to stop him. He got hit a couple of times and then fired his fucking gun at them. Oh no, not an owie. If you can owie me then I can kill you, wtf. He was marching down the street clearly in shock from what he had done already and just couldn't handle the pressure. He should have stopped and put the gun down but he didn't, and that's why people tried to stop him - because he looked like he was on a crazed mission which is exactly the apparent truth from the footage. The armed guy that got shot in the arm was self-defense, I can give him that (in the same way that shooting a cop trying to shoot you is self-defense). But everything else was absolutely not.",
              "timestamp": "2021-11-11 15:20:49",
              "score": 29,
              "num_children": 0,
              "author": 292509,
              "replies": []
            },
            {
              "id": "hk96155",
              "text": "There's literally video of it. Try and watch it and think for yourself if your feeble mind is even capable of it. Learn some critical thinking you fucking moron.",
              "timestamp": "2021-11-11 21:42:55",
              "score": -5,
              "num_children": 1,
              "author": 326109,
              "replies": [
                {
                  "id": "hk9lwt1",
                  "text": "...the fuck?",
                  "timestamp": "2021-11-11 23:39:13",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hk7lqfk",
          "text": "He went there wanting to shoot BLM protestors. He got his wish. And unfortunately a lot of people like the idea of shooting BLM protestors.",
          "timestamp": "2021-11-11 15:21:35",
          "score": 123,
          "num_children": 2,
          "replies": [
            {
              "id": "hk7ly9b",
              "text": "I have a feeling pretty soon they're going to know they've got a green light to do exactly that.",
              "timestamp": "2021-11-11 15:23:13",
              "score": 69,
              "num_children": 2,
              "author": 292509,
              "replies": [
                {
                  "id": "hk7nh6j",
                  "text": "They pretty much do here in FL, think it was late 2020 they added a thing to stand your ground that included coverage for rioters etc.",
                  "timestamp": "2021-11-11 15:34:20",
                  "score": 37,
                  "num_children": 2,
                  "author": 26687,
                  "replies": [
                    {
                      "id": "hk9pen7",
                      "text": "And letting ppl RUN OVER protesters that are in the street.",
                      "timestamp": "2021-11-12 00:10:13",
                      "score": 6,
                      "num_children": 0,
                      "author": 303770,
                      "replies": []
                    },
                    {
                      "id": "hk9t8gl",
                      "text": "r/morbidreality :/",
                      "timestamp": "2021-11-12 00:40:29",
                      "score": 5,
                      "num_children": 0,
                      "author": 331449,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hk8v83e",
                  "text": "I guess we really are the country of freedom.  Free for fascists to pick and choose if they want to kill us by vehicle or by firearms.",
                  "timestamp": "2021-11-11 20:28:46",
                  "score": 21,
                  "num_children": 1,
                  "author": 123189,
                  "replies": [
                    {
                      "id": "hk9cz3e",
                      "text": "[deleted]",
                      "timestamp": "2021-11-11 22:32:04",
                      "score": 9,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "hk9iek2",
                          "text": "[removed]",
                          "timestamp": "2021-11-11 23:11:53",
                          "score": -3,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hk9y0zu",
                              "text": "Interesting when it’s actually you white supremacy kkkunts who are actually burning things to the ground.",
                              "timestamp": "2021-11-12 01:17:48",
                              "score": 7,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hk9z7g9",
                                  "text": "Hey since it's just us I gotta ask, do you actually believe it when you call me a \"white supremacist kkkunt\" or is that just hyperbole? It's funny either way but I just want to know.",
                                  "timestamp": "2021-11-12 01:27:04",
                                  "score": -4,
                                  "num_children": 1,
                                  "author": 380899,
                                  "replies": [
                                    {
                                      "id": "hl122b8",
                                      "text": "What I know is you’re a scumbag piece of shit and you deserve the Babbitt treatment.",
                                      "timestamp": "2021-11-17 20:01:05",
                                      "score": 1,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hk9jntx",
                          "text": "Cringe takes",
                          "timestamp": "2021-11-11 23:21:24",
                          "score": -1,
                          "num_children": 0,
                          "author": 124069,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hk90eaf",
              "text": "Most notably, the judge.",
              "timestamp": "2021-11-11 21:04:17",
              "score": 12,
              "num_children": 0,
              "author": 340680,
              "replies": []
            }
          ]
        },
        {
          "id": "hk80hzv",
          "text": "you should also see the post about the kid in r/ActualPublicFreakouts, as most redditors are saying he has PTSD/Depression.",
          "timestamp": "2021-11-11 17:03:04",
          "score": 13,
          "num_children": 2,
          "author": 357309,
          "replies": [
            {
              "id": "hk83i0s",
              "text": "Yeah for real, he fucked people up man. I don't know how anyone could do that and not be fucked up in the head before and/or after, but even if he isn't from that he most certainly would be out of fear of being incarcerated for the rest of his life. Tough shit.",
              "timestamp": "2021-11-11 17:23:03",
              "score": 11,
              "num_children": 0,
              "author": 292509,
              "replies": []
            },
            {
              "id": "hk9mu47",
              "text": "No he doesn't, he is a bullshit actor who's mentally not right (not meaning ptsd but like a racist white kid with imposter syndrome)",
              "timestamp": "2021-11-11 23:46:44",
              "score": 1,
              "num_children": 0,
              "author": 328336,
              "replies": []
            }
          ]
        },
        {
          "id": "hk7k145",
          "text": "yeah its fucked but in America, lawyers can argue that it was self defense and there is a probability this argument will be accepted in court. tragedy of justice. nobody should had to have died.",
          "timestamp": "2021-11-11 15:09:04",
          "score": 28,
          "num_children": 1,
          "author": 285324,
          "replies": [
            {
              "id": "hk7ls29",
              "text": "America is a frothing cauldron of vomit",
              "timestamp": "2021-11-11 15:21:55",
              "score": 56,
              "num_children": 2,
              "author": 292509,
              "replies": [
                {
                  "id": "hk90pxn",
                  "text": "I wouldn’t visit if someone paid me these days. It’s like the mental asylum of the world.",
                  "timestamp": "2021-11-11 21:06:29",
                  "score": 7,
                  "num_children": 0,
                  "author": 223941,
                  "replies": []
                },
                {
                  "id": "hkbsrec",
                  "text": "Some of us are sane and are trapped in this frothing cauldron of vomit. We’d love to leave this country forever. Unfortunately we don’t make enough money to do so. We can barely keep ourselves housed and fed with the shit income we get. Fuck this place. It’s so dumb and extremely dangerous here. Fuck it all.",
                  "timestamp": "2021-11-12 13:00:15",
                  "score": 2,
                  "num_children": 0,
                  "author": 15806,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hk87ku7",
          "text": "People aren't saying he's gonna walk because they're on his side. They're saying it because the justice system is a farce both in general and in this case in particular.",
          "timestamp": "2021-11-11 17:49:32",
          "score": 16,
          "num_children": 1,
          "author": 318278,
          "replies": [
            {
              "id": "hk90j0t",
              "text": "It irritates me how much I get called a fascist for pointing out it is \\_legally correct\\_ that he walks on the charges they brought.",
              "timestamp": "2021-11-11 21:05:12",
              "score": 0,
              "num_children": 0,
              "author": 340680,
              "replies": []
            }
          ]
        },
        {
          "id": "hk9qhrh",
          "text": "American? No no no, these are”PATRIOTS”",
          "timestamp": "2021-11-12 00:18:52",
          "score": 3,
          "num_children": 0,
          "author": 192848,
          "replies": []
        },
        {
          "id": "hk9li82",
          "text": "I guess you do, because as a Canadian, I think it’s completely insane.",
          "timestamp": "2021-11-11 23:36:02",
          "score": 2,
          "num_children": 0,
          "author": 395817,
          "replies": []
        },
        {
          "id": "hk9sjry",
          "text": "Any threads on publicfreakout about him are being brigaded to fucking hell and back by these Fascist fuckwads. Look at a single one of those guys who are making comments. They all frequent PCM, kotakuinaction and other shithole right-wing subs.",
          "timestamp": "2021-11-12 00:35:05",
          "score": 1,
          "num_children": 0,
          "author": 12254,
          "replies": []
        },
        {
          "id": "hk9wg1b",
          "text": "We see it. Unfortunately they missed the part where the cops tossed him bottled water.  They definitely set the score.  I am pissed as well.",
          "timestamp": "2021-11-12 01:05:22",
          "score": 1,
          "num_children": 0,
          "author": 261548,
          "replies": []
        },
        {
          "id": "hk7t9p1",
          "text": "Maybe the police thought he was defending himself?",
          "timestamp": "2021-11-11 16:15:27",
          "score": -5,
          "num_children": 0,
          "author": 198392,
          "replies": []
        }
      ]
    },
    {
      "id": "hk7eqgp",
      "text": "I'm surprised the judge didn't bar that picture from being shown at the trial seeing is how it puts his golden boy in a bad light",
      "timestamp": "2021-11-11 14:29:20",
      "score": 303,
      "num_children": 4,
      "author": 145360,
      "replies": [
        {
          "id": "hk8ia8z",
          "text": "The judge did bar these pictures from being presented.",
          "timestamp": "2021-11-11 19:00:22",
          "score": 142,
          "num_children": 2,
          "author": 26930,
          "replies": [
            {
              "id": "hk8iidt",
              "text": "Shocking. If you bar every ounce of evidence against a person from appearing in trial, they look pretty damn squeaky clean. I'm surprised the prosecution didn't immediately demand a mistrial upon hearing all these qualifications and exclusions. The judge is clearly biased as fuck",
              "timestamp": "2021-11-11 19:01:53",
              "score": 126,
              "num_children": 2,
              "author": 145360,
              "replies": [
                {
                  "id": "hk8omez",
                  "text": "I’ve got a feeling that the prosecutor is a secret fan as well.",
                  "timestamp": "2021-11-11 19:43:31",
                  "score": 60,
                  "num_children": 3,
                  "replies": [
                    {
                      "id": "hk8ws2v",
                      "text": "[deleted]",
                      "timestamp": "2021-11-11 20:39:27",
                      "score": 29,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hk98qhx",
                          "text": "So sorry, can someone ELI5 this a bit? Not quite sure what the prosecution should have hammered him for...",
                          "timestamp": "2021-11-11 22:01:42",
                          "score": 3,
                          "num_children": 1,
                          "author": 35603,
                          "replies": [
                            {
                              "id": "hk9asm0",
                              "text": "The situation that requires a full round to be ejected only happens in .0000004 percent of cases.  The situation that DOES happen almost 100% of the time does not cause what the defense claims it does.",
                              "timestamp": "2021-11-11 22:16:16",
                              "score": 7,
                              "num_children": 1,
                              "author": 340680,
                              "replies": [
                                {
                                  "id": "hk9k2xm",
                                  "text": "Appreciate it, cleared that up for me!",
                                  "timestamp": "2021-11-11 23:24:37",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 35603,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hk8p3y6",
                      "text": "That or he's a call of duty player that got teabagged one too many times, and his real goal is to take a griefer off the streets.",
                      "timestamp": "2021-11-11 19:46:54",
                      "score": 19,
                      "num_children": 0,
                      "author": 145360,
                      "replies": []
                    },
                    {
                      "id": "hk8xowe",
                      "text": "This is not the only hearing in the US court systems that are serving to indict the whole thing as a racket to create the color of justice without the substance.\n\nOf course, if this were _not_ true, that judges could mete justice through pure reason and fairness without their own biases, the GOP wouldn't have gone to such lengths to stack the Supreme Court of the United States with _Federalist Society_ jurists who abide by the _originalist_ legal theory that essentially lets them rule as they want -- and handed George W. Bush the 2000 General Election as a favor to the family.",
                      "timestamp": "2021-11-11 20:45:44",
                      "score": 6,
                      "num_children": 1,
                      "author": 264568,
                      "replies": [
                        {
                          "id": "hk8y3bw",
                          "text": "Yeah the Ahmaud Arbery trial opener is telling me that the prosecution is planning on dropping the ball as well.",
                          "timestamp": "2021-11-11 20:48:29",
                          "score": 12,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hk8znhq",
                  "text": "smells like the fbi kavanaugh investigation...surprise! when we don't look for evidence we don't find any!",
                  "timestamp": "2021-11-11 20:59:09",
                  "score": 11,
                  "num_children": 0,
                  "author": 7622,
                  "replies": []
                }
              ]
            },
            {
              "id": "hk8p1he",
              "text": "Judge Fash also claims to not know what the Proud Boys are, and the OK hand symbol is just something he is familiar with from a Chef Boyardee can. So obviously none of this is relevant as this is not a political trial. He just said that today. It absolutely is political from start to finish. And yes I understand that he is on trial for murder and not his beliefs.",
              "timestamp": "2021-11-11 19:46:26",
              "score": 30,
              "num_children": 0,
              "author": 172359,
              "replies": []
            }
          ]
        },
        {
          "id": "hk7vfgb",
          "text": "Didn't he bar some of these pictures on the basis of not understanding how pictures, pixels and any of that stuff work?",
          "timestamp": "2021-11-11 16:29:51",
          "score": 113,
          "num_children": 1,
          "author": 211869,
          "replies": [
            {
              "id": "hk7vy4a",
              "text": "I guess that's what happens when retirement time came 30 years ago",
              "timestamp": "2021-11-11 16:33:16",
              "score": 97,
              "num_children": 0,
              "author": 145360,
              "replies": []
            }
          ]
        },
        {
          "id": "hk8pqy5",
          "text": "At this point I'm surprised the judge hasn't asked for an autograph yet",
          "timestamp": "2021-11-11 19:51:15",
          "score": 22,
          "num_children": 1,
          "author": 364088,
          "replies": [
            {
              "id": "hk8s1fe",
              "text": "Pretty sure he’s the local chapter leader of the fan club.",
              "timestamp": "2021-11-11 20:06:49",
              "score": 9,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hk94vxc",
          "text": "This may sound dumb but is this fucker 21 yet?",
          "timestamp": "2021-11-11 21:35:04",
          "score": 1,
          "num_children": 0,
          "author": 295612,
          "replies": []
        }
      ]
    },
    {
      "id": "hk752me",
      "text": "That smile only infuriates me more!!! This is so f**king disgusting!!!! This right-wing dipsh*t murdered two people, and has the audacity to smile afterwards! WTF!!!",
      "timestamp": "2021-11-11 13:09:48",
      "score": 104,
      "num_children": 3,
      "replies": [
        {
          "id": "hk797ik",
          "text": ">This is so f**king disgusting!!!!\n\nRepublican",
          "timestamp": "2021-11-11 13:45:20",
          "score": 42,
          "num_children": 1,
          "author": 301211,
          "replies": [
            {
              "id": "hk79ku5",
              "text": "How am I a republican?",
              "timestamp": "2021-11-11 13:48:22",
              "score": -1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hk7a62p",
                  "text": "No, I am saying its faster to just say republican",
                  "timestamp": "2021-11-11 13:53:06",
                  "score": 27,
                  "num_children": 1,
                  "author": 301211,
                  "replies": [
                    {
                      "id": "hk7ai24",
                      "text": "Sorry, it’s early here. You’re right.. I mean left, Republican would be a better insult.",
                      "timestamp": "2021-11-11 13:55:48",
                      "score": 19,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hkc8gxv",
          "text": "I can’t imagine how awful it is for the families of the victims.  The victims being the ones shot to death & injured by that right wing Nazi fuckface",
          "timestamp": "2021-11-12 15:06:44",
          "score": 2,
          "num_children": 0,
          "author": 309665,
          "replies": []
        },
        {
          "id": "hk9ozbx",
          "text": "Okay, I am well aware that this is probably going to come across wrong, but I don’t think you can shit on somebody for smiling. He’s drinking with the proud boys, that’s incriminating as all hell as it is. \nCritiquing people for smiling in the weeks and months after a tragedy or crime, as if expressing a normal human emotion somehow implies a lack of remorse or sadness, is something that I think we can leave to the right wing when they’re harassing school shooting victims. Depressed, guilt wracked, and traumatized people can smile, too.",
          "timestamp": "2021-11-12 00:06:41",
          "score": 0,
          "num_children": 1,
          "author": 7713,
          "replies": [
            {
              "id": "hk9qjeh",
              "text": "I understand what you’re saying. However considering what the proud boys stand for, and the potential subject matter that was probably discussed in this particular setting (I’m hitting at extreme racist ideologies), this smile is disgusting. Smiling usually means that a particular individual is showing signs of happiness. To know that this man is showing signs of happiness is absolutely disgusting! This person is drinking with individuals and wearing a t-shirt that supports the oppression of a certain group of ethnic people, due to the colour of their skin. He is also making a white power symbol with his hands in this photo. This is a person that literally murdered two people, due to his discriminatory beliefs. So yeah, I think he and his smile is disgusting, because of his actions.\n\nEdit: He decided to join this particular group of people. I understand that right-wing groups pray on “outcasts”, but ultimately he made the decision to support this disgusting ideology.\n\nLDR: the intent behind the smile is disturbing",
              "timestamp": "2021-11-12 00:19:13",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hk7872c",
      "text": "If he was not a monster before, he will be now. The judge proved to him that the law does not apply to white boys.",
      "timestamp": "2021-11-11 13:36:50",
      "score": 243,
      "num_children": 1,
      "replies": [
        {
          "id": "hk7ah99",
          "text": "The judge had the Trump song as his ringtone and it went off in court. That has got to be a dog-whistle.",
          "timestamp": "2021-11-11 13:55:37",
          "score": 172,
          "num_children": 2,
          "author": 292509,
          "replies": [
            {
              "id": "hk7i8l2",
              "text": "What's the trump song?",
              "timestamp": "2021-11-11 14:55:41",
              "score": 38,
              "num_children": 1,
              "author": 134341,
              "replies": [
                {
                  "id": "hk7ioe3",
                  "text": "God Bless The USA by Lee Greenwood, played at all the rallies iirc",
                  "timestamp": "2021-11-11 14:59:03",
                  "score": 74,
                  "num_children": 0,
                  "author": 292509,
                  "replies": []
                }
              ]
            },
            {
              "id": "hk7maxn",
              "text": "I’m sorry but this is just a stretch made by Reddit. “God Bless the USA” isn’t solely a trump song.",
              "timestamp": "2021-11-11 15:25:45",
              "score": -56,
              "num_children": 2,
              "author": 323307,
              "replies": [
                {
                  "id": "hk7misl",
                  "text": "It's not a reddit thing at all. I googled it to get the song title and there are literally hundreds of articles on it from every major global news source.",
                  "timestamp": "2021-11-11 15:27:20",
                  "score": 60,
                  "num_children": 1,
                  "author": 292509,
                  "replies": [
                    {
                      "id": "hk7mpzt",
                      "text": "Ok, but does trump own that song?",
                      "timestamp": "2021-11-11 15:28:50",
                      "score": -53,
                      "num_children": 2,
                      "author": 323307,
                      "replies": [
                        {
                          "id": "hk80fjt",
                          "text": "Frankly irrelevant. The way the alt right operates is by coopting preciously innocuous symbols or utilizing subtle in-references, like the “ok” gesture and Pepe. It doesn’t matter if the song’s creator signed off on this, it’s been claimed by the nazis. Even if it isn’t a definite sign, it merits wariness and in conjunction with other evidence can be damning. \nSee Innuendo Studios’ videos on the alt right playbook.",
                          "timestamp": "2021-11-11 17:02:36",
                          "score": 34,
                          "num_children": 1,
                          "author": 67679,
                          "replies": [
                            {
                              "id": "hk8unjk",
                              "text": "No point in arguing, u/SeniorWilson44's goalpost is on wheels",
                              "timestamp": "2021-11-11 20:24:49",
                              "score": 6,
                              "num_children": 1,
                              "author": 200225,
                              "replies": [
                                {
                                  "id": "hk8v0aj",
                                  "text": "What evidence was given that nullifies my point exactly? That a bunch of articles note that it’s played at Trump rallies? That’s not evidence.",
                                  "timestamp": "2021-11-11 20:27:16",
                                  "score": -6,
                                  "num_children": 1,
                                  "author": 323307,
                                  "replies": [
                                    {
                                      "id": "hk92a8u",
                                      "text": "It's not *solely* a Trump song, and he obviously doesn't own it, but neither of those have to be true for u/db214's first claim to have merit. If you don't think \"God Bless the USA\" is a notably Trumpian song you're fooling yourself. It's 100% okay to listen to the song without caring about its social connotation, enjoying music isn't inherently biased, but symbols retain their symbolism regardless of your opinions on them.\n\nFor your everyday Joe Shmoe, having it as your ringtone is innocuous. However, this is a judge in a court of law. The fact that the song has a notable partisan connotation should be enough of a reason for someone who should want to appear as unbiased as possible to not have it as their ringtone. There are also some missteps leading up to a judge's phone going off in court, including not having their phone on silent and having it up loud enough to be audible. Wisconsin court rule CR02-9 states, \"all court proceedings shall be free from interruption by the sounding of electronic devices such as cell phones, pagers, beepers, and electronic watches.\" The judge can waive this requirement, but I'd hope a judge would want to hold himself to the rules he enforces in his own court, and I'd *especially* hope he wasn't expecting an important enough call to waive that requirement for himself during such an obviously high-profile case. All this being the case, the possibility that the ringtone is a far-right dogwhistle has merit, and if it's not true, the fact that the judge let it happen is *very* crass.\n\nBut that's all irrelevant since you've already proven your requirements for argument change when presented with anything valid. You started by saying it's a stretch to say \"God Bless the USA\" is a Trump song, but when you were presented with evidence showing the song has a known Trump connotation, you changed your requirement to be that Trump owns the song. Now someone's trying to argue that Trump owning the song is irrelevant to the argument and provided a well-written response with examples of why that is, and instead of arguing that, you're requiring that your point be nullified for arguments against it to be valid. That's moving the goalposts.\n\nAlso, requiring absolute defense is a shitty way to argue in general and impossible to actually achieve in a subjective argument. Your first claim was fine, but tacking on concrete requirements to a subjective argument completely protects you from having to actually defend your point. You need \"God Bless the USA\" to *solely* be a Trump song, and you need Trump to own the song, the former of which is literally impossible to prove either way and neither are necessary for something with symbolism to act as a dogwhistle. Add in that you require your claim to be nullified, and you have a completely inarguable point that protects you from the possibility of being wrong. Again, shitty way to argue.",
                                      "timestamp": "2021-11-11 21:17:02",
                                      "score": 8,
                                      "num_children": 1,
                                      "author": 200225,
                                      "replies": [
                                        {
                                          "id": "hk93rr5",
                                          "text": "I’m not reading all that",
                                          "timestamp": "2021-11-11 21:27:14",
                                          "score": -3,
                                          "num_children": 1,
                                          "author": 323307,
                                          "replies": [
                                            {
                                              "id": "hk94t6n",
                                              "text": "Yeah I should've expected that",
                                              "timestamp": "2021-11-11 21:34:32",
                                              "score": 8,
                                              "num_children": 1,
                                              "author": 200225,
                                              "replies": [
                                                {
                                                  "id": "hk9kqb2",
                                                  "text": "Eloquence is rarely an effective response to ignorance.",
                                                  "timestamp": "2021-11-11 23:29:45",
                                                  "score": 5,
                                                  "num_children": 0,
                                                  "author": 67679,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hk7o8sa",
                          "text": "Errr unlikely, why?",
                          "timestamp": "2021-11-11 15:39:48",
                          "score": 18,
                          "num_children": 0,
                          "author": 292509,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hk8u6da",
                  "text": "No idea how “god bless the USA” is labeled a trump song on this sub lmfao",
                  "timestamp": "2021-11-11 20:21:30",
                  "score": -2,
                  "num_children": 0,
                  "author": 61806,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hk7wrx5",
      "text": "When I went to the comment section of the Kyle Rittenhouse trial, I saw so many people defending him. Literally, what the fuck?",
      "timestamp": "2021-11-11 16:38:41",
      "score": 31,
      "num_children": 3,
      "replies": [
        {
          "id": "hk92361",
          "text": "They need him to be acquitted so they have a green light to do the same thing. There is going to be protests when he is found not guilty, I think a bunch of copy cats will also come out and bring their guns. I hope not though.",
          "timestamp": "2021-11-11 21:15:41",
          "score": 12,
          "num_children": 1,
          "replies": [
            {
              "id": "hk93dns",
              "text": "Let us hope.",
              "timestamp": "2021-11-11 21:24:34",
              "score": 3,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hk91hb7",
          "text": "He's morally wrong but legally correct.  The laws themselves are what suck.",
          "timestamp": "2021-11-11 21:11:32",
          "score": 4,
          "num_children": 0,
          "author": 340680,
          "replies": []
        },
        {
          "id": "hka9k1w",
          "text": "[deleted]",
          "timestamp": "2021-11-12 02:46:43",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hkbgyuh",
              "text": "Yep.",
              "timestamp": "2021-11-12 10:44:33",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hk6xsnb",
      "text": "[deleted]",
      "timestamp": "2021-11-11 11:54:37",
      "score": 147,
      "num_children": 6,
      "replies": [
        {
          "id": "hk6yf19",
          "text": "That only applies to right wingers, not not anyone even slightly to the left of Hernan fucking Goring.",
          "timestamp": "2021-11-11 12:01:59",
          "score": 62,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hk755w5",
          "text": "It will be the signal the brownshirts have been waiting for that they no longer need to carry *paintball* guns.",
          "timestamp": "2021-11-11 13:10:38",
          "score": 27,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hk7eln5",
          "text": "I'm reminded of Mark and Patricia McCloskey who threatened protestors with guns and not only were not shot dead, but we're celebrated and brought to Republican conventions to speak.",
          "timestamp": "2021-11-11 14:28:17",
          "score": 22,
          "num_children": 1,
          "author": 374931,
          "replies": [
            {
              "id": "hk89e0k",
              "text": "Well after this legal precedent - if he gets away with it - you could argue that murdering them in front of a crowd would’ve been justified if you felt threatened",
              "timestamp": "2021-11-11 18:01:10",
              "score": 6,
              "num_children": 1,
              "replies": [
                {
                  "id": "hk89s39",
                  "text": "I desperately wish that were true, but we both know we'd be shot dead in the exact same situation if it were flipped for the same reason BLM protests exist. White Christian Republicans are above the law and we're below it.",
                  "timestamp": "2021-11-11 18:03:44",
                  "score": 6,
                  "num_children": 1,
                  "author": 374931,
                  "replies": [
                    {
                      "id": "hk8bmp0",
                      "text": "Thered only one way to test out the imbalance of the system\n\nAre we supposed to just accept this degree of hypocrisy? Are these double standards representative of an America that should be dismantled? Time will tell",
                      "timestamp": "2021-11-11 18:16:02",
                      "score": 3,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hk8dzem",
                          "text": "Agreed. Protest, show your presence, vote! Attack from every angle, but know that the laws created and the police aren't here to protect you. The cards are stacked, so be careful out there!",
                          "timestamp": "2021-11-11 18:31:40",
                          "score": 5,
                          "num_children": 0,
                          "author": 374931,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hk700bs",
          "text": "If someone on the left did that, it would be fucking disgusting behavior and I'd want him brought to justice.  But I suppose that's the difference between the left and the right.  The left are about accountability, and the right are about loyalty.  Fuck loyalty, and fuck anyone who defends Rittenhouse.",
          "timestamp": "2021-11-11 12:19:45",
          "score": 98,
          "num_children": 1,
          "author": 201921,
          "replies": [
            {
              "id": "hk70t4p",
              "text": "[deleted]",
              "timestamp": "2021-11-11 12:28:22",
              "score": 24,
              "num_children": 1,
              "replies": [
                {
                  "id": "hk77ukp",
                  "text": "We do have a mirror case actually, his name was Michael Reinoehl.\n\nFuckers can cross three state lines in a motorcade to \"own the libs\", but when one of their own dies the police pull up unannounced while your enjoying a nice cone and put 30 holes in you without any accountability.\n\nWhen officials thought Rittenhouse bounced it was learned the pigs fucking helped them. \n\nPrecedent only counts when you can make it to court.",
                  "timestamp": "2021-11-11 13:33:58",
                  "score": 47,
                  "num_children": 1,
                  "author": 10742,
                  "replies": [
                    {
                      "id": "hk78dza",
                      "text": "> when you can make it count\n\nHonestly this sounds like a challenge\n\nI kid. The absurdity of the situation isn’t lost on me",
                      "timestamp": "2021-11-11 13:38:28",
                      "score": 9,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hk7ldyt",
          "text": "Yeah seriously. I wonder, if I, a Hispanic, showed up to a MAGA rally fully armed and began to harass and agitate people, putting myself into a very hostile situation where I am attacked and need to \"defend\" myself if the same conservatives would champion me, or would they say I deserve the death penalty.\n\nI think we all know how they would feel and react.",
          "timestamp": "2021-11-11 15:19:05",
          "score": 19,
          "num_children": 0,
          "author": 411069,
          "replies": []
        },
        {
          "id": "hk7m34x",
          "text": "Dude fitted a gun 8 times into a crowd killing two people, and then people act surprised that others tried too so him.",
          "timestamp": "2021-11-11 15:24:12",
          "score": 6,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hk8pbtu",
      "text": "Fucking hate that the ok sign has turned into a white power symbol",
      "timestamp": "2021-11-11 19:48:22",
      "score": 18,
      "num_children": 0,
      "author": 139006,
      "replies": []
    },
    {
      "id": "hk6gzxo",
      "text": "It's gonna be *hilarious* when all these right-wing cunts are done using him as a political pawn and ghost his bitch-ass. That should happen about 5 seconds after the trial is over. Lol! There's absolutely no loyalty on that side whatsoever. The way they left their traitor buddies from Jan. 6th twisting in the wind proved that.This little coward has fucked his entire life up.",
      "timestamp": "2021-11-11 08:03:07",
      "score": 191,
      "num_children": 6,
      "author": 188474,
      "replies": [
        {
          "id": "hk6lrpb",
          "text": ">That should happen about 5 seconds after the trial is over.\n\nBut only if he's convicted. If he's aquitted, he has good chances to start a political career. Presidency in 2044 or so is absolutely possible for him, if the political system of the US survives that long.",
          "timestamp": "2021-11-11 09:10:36",
          "score": 150,
          "num_children": 4,
          "author": 112228,
          "replies": [
            {
              "id": "hk6ze58",
              "text": "I don't know about a *political* career.  I mean come on, he's got to have at *least* 5 sexual assault cases against him under his belt before they'll let him primary for the GOP.",
              "timestamp": "2021-11-11 12:13:01",
              "score": 113,
              "num_children": 2,
              "author": 201921,
              "replies": [
                {
                  "id": "hk75fp7",
                  "text": "I don't think that's going to be a problem for him.",
                  "timestamp": "2021-11-11 13:13:06",
                  "score": 53,
                  "num_children": 0,
                  "author": 112228,
                  "replies": []
                },
                {
                  "id": "hk81zhv",
                  "text": "Hey, don't forget they all have to be underaged! Wouldn't be on the true spirit of the GOP of he wasn't sexually assaulting children.",
                  "timestamp": "2021-11-11 17:13:00",
                  "score": 8,
                  "num_children": 0,
                  "author": 193813,
                  "replies": []
                }
              ]
            },
            {
              "id": "hk77t70",
              "text": "> … if the political system of the US survives that long.\n\nNarrator: it won’t",
              "timestamp": "2021-11-11 13:33:39",
              "score": 35,
              "num_children": 0,
              "author": 9824,
              "replies": []
            },
            {
              "id": "hk7she1",
              "text": "Nah hes really too dumb for politics.  He'll go back to being a regular redneck.",
              "timestamp": "2021-11-11 16:09:57",
              "score": 10,
              "num_children": 3,
              "author": 100124,
              "replies": [
                {
                  "id": "hk9cjmv",
                  "text": "Marjorie Taylor Greene was \"too dumb for politics\" too.",
                  "timestamp": "2021-11-11 22:28:55",
                  "score": 5,
                  "num_children": 1,
                  "author": 206887,
                  "replies": [
                    {
                      "id": "hk9hfzr",
                      "text": "She is wealthy though.",
                      "timestamp": "2021-11-11 23:04:46",
                      "score": 2,
                      "num_children": 0,
                      "author": 100124,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hk83x1y",
                  "text": "Yes. Undoubtedly this.",
                  "timestamp": "2021-11-11 17:25:48",
                  "score": 2,
                  "num_children": 0,
                  "author": 188474,
                  "replies": []
                },
                {
                  "id": "hk9nuy9",
                  "text": "Have you seen politicians lately",
                  "timestamp": "2021-11-11 23:57:19",
                  "score": 1,
                  "num_children": 0,
                  "author": 7713,
                  "replies": []
                }
              ]
            },
            {
              "id": "hk8511r",
              "text": "If he's acquitted I'd give him 6mo to a year before they throw him on the trash heap with the others. You guys are giving this dummy & the loyalty of the alt-right way too much credit. Lol!",
              "timestamp": "2021-11-11 17:33:04",
              "score": 3,
              "num_children": 0,
              "author": 188474,
              "replies": []
            }
          ]
        },
        {
          "id": "hk6jfm9",
          "text": "I wish I could believe that, but I don't. When he skates, they're going to keep bringing him back as an example of the \"corrupt left\" trying to smear and defame cherubic conservatives.",
          "timestamp": "2021-11-11 08:36:32",
          "score": 67,
          "num_children": 2,
          "author": 10285,
          "replies": [
            {
              "id": "hk6vjcs",
              "text": "He will probably get a slap on the wrist.",
              "timestamp": "2021-11-11 11:27:04",
              "score": 25,
              "num_children": 2,
              "replies": [
                {
                  "id": "hk6vqsb",
                  "text": "He'll probably be awarded money for damages and feted as a hero.",
                  "timestamp": "2021-11-11 11:29:38",
                  "score": 35,
                  "num_children": 3,
                  "author": 10285,
                  "replies": [
                    {
                      "id": "hk7av60",
                      "text": "> He'll probably be awarded money for damages and feted as a hero.\n\nYep.  He'll get at job at Faux News and then in a few years he'll launch his political career. 😒",
                      "timestamp": "2021-11-11 13:58:45",
                      "score": 18,
                      "num_children": 0,
                      "author": 354546,
                      "replies": []
                    },
                    {
                      "id": "hk87tws",
                      "text": "He'll get *destroyed* in civil court if he gets off.",
                      "timestamp": "2021-11-11 17:51:08",
                      "score": 2,
                      "num_children": 1,
                      "author": 188474,
                      "replies": [
                        {
                          "id": "hk9147l",
                          "text": "WHEN he gets off.\n\n...but your statement is also true.  he will be found like 90% civilly culpable for what happened.  Fox \"News\" will shore up his bank accounts soon enough that it won't hurt him financially.",
                          "timestamp": "2021-11-11 21:09:10",
                          "score": 3,
                          "num_children": 0,
                          "author": 340680,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hk7jmt2",
                      "text": "Like Jacob Blake?",
                      "timestamp": "2021-11-11 15:06:09",
                      "score": 1,
                      "num_children": 1,
                      "author": 370179,
                      "replies": [
                        {
                          "id": "hk7jt1b",
                          "text": "...that guy was killed, what the hell are you talking about?\n\nEdit: my bad, was thinking of a different guy. Blake was paralysed, not killed.",
                          "timestamp": "2021-11-11 15:07:26",
                          "score": 6,
                          "num_children": 1,
                          "author": 10285,
                          "replies": [
                            {
                              "id": "hk7jy1t",
                              "text": "He’s alive, George Floyd was killed",
                              "timestamp": "2021-11-11 15:08:26",
                              "score": 2,
                              "num_children": 1,
                              "author": 370179,
                              "replies": [
                                {
                                  "id": "hk7k5to",
                                  "text": "Yeah, I just edited my comment when I remembered which one the many dudes we were talking about.\n\nStill not sure what your point is, though - as with Floyd, nobody has tried to claim that Blake was a hero, just that their shootings were completely unacceptable abuses of police power.",
                                  "timestamp": "2021-11-11 15:10:01",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 10285,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hk7734d",
                  "text": "I disagree.\nHe's going to walk.",
                  "timestamp": "2021-11-11 13:27:32",
                  "score": 8,
                  "num_children": 0,
                  "author": 325739,
                  "replies": []
                }
              ]
            },
            {
              "id": "hk6kxg2",
              "text": "You think he’s going to get off? I hope not. He needs to be held responsible. \n\nThe number of murderers in this country who aren’t held responsible is sickening.",
              "timestamp": "2021-11-11 08:58:03",
              "score": 17,
              "num_children": 4,
              "author": 313554,
              "replies": [
                {
                  "id": "hk6l4ia",
                  "text": ">You think he’s going to get off?\n\nAbsolutely no question about it. It's been a given right from the start that he's going to walk.",
                  "timestamp": "2021-11-11 09:00:56",
                  "score": 34,
                  "num_children": 1,
                  "author": 10285,
                  "replies": [
                    {
                      "id": "hk6l7xs",
                      "text": "I disagree. There is no given here.",
                      "timestamp": "2021-11-11 09:02:19",
                      "score": -16,
                      "num_children": 1,
                      "author": 313554,
                      "replies": [
                        {
                          "id": "hk6lg79",
                          "text": "The judge refused to allow evidence that showed his motivations - the photos of him drinking and celebrating with Proud Boys, the recording of him fantasizing about having his gun so he could murder \"criminals\" - into the court. That was a pretty clear signal.",
                          "timestamp": "2021-11-11 09:05:43",
                          "score": 45,
                          "num_children": 4,
                          "author": 10285,
                          "replies": [
                            {
                              "id": "hk6zudb",
                              "text": "[deleted]",
                              "timestamp": "2021-11-11 12:18:00",
                              "score": 28,
                              "num_children": 5,
                              "replies": [
                                {
                                  "id": "hk892x6",
                                  "text": "It was also played at my high school baseball game. Good to know a judge supports my athletic venture",
                                  "timestamp": "2021-11-11 17:59:11",
                                  "score": 1,
                                  "num_children": 0,
                                  "replies": []
                                },
                                {
                                  "id": "hk879qn",
                                  "text": "> The judge's ringtone is apparently \"Proud to be an American\" which was played at the Trump rallies.  The judge is probably a huge Trump supporter.\n\nThis is your brain on Reddit.",
                                  "timestamp": "2021-11-11 17:47:33",
                                  "score": 0,
                                  "num_children": 0,
                                  "replies": []
                                },
                                {
                                  "id": "hk7qaqa",
                                  "text": "[removed]",
                                  "timestamp": "2021-11-11 15:54:25",
                                  "score": -6,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hk7v9tb",
                                      "text": "[deleted]",
                                      "timestamp": "2021-11-11 16:28:50",
                                      "score": -1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hk7vj7u",
                                          "text": "[removed]",
                                          "timestamp": "2021-11-11 16:30:31",
                                          "score": 0,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "hk7xaow",
                                              "text": "He's literally the authority here, he will be proceeding the case.  If he's biased or prejudiced in some way, that's entirely relevant to the discussion of \"whether or not he's a Trump supporter.\"\n\nI'm not the one that called the judge a white supremacist and corrupt.",
                                              "timestamp": "2021-11-11 16:42:05",
                                              "score": 1,
                                              "num_children": 2,
                                              "author": 201921,
                                              "replies": [
                                                {
                                                  "id": "hk839oa",
                                                  "text": "[removed]",
                                                  "timestamp": "2021-11-11 17:21:32",
                                                  "score": 2,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "hk84i2c",
                                                      "text": "Yes, I'm aware.  Are you aware that the judge can do a number of things to hinder or help the prosecution?  Don't act like bias plays no factor.",
                                                      "timestamp": "2021-11-11 17:29:37",
                                                      "score": 3,
                                                      "num_children": 0,
                                                      "author": 201921,
                                                      "replies": []
                                                    }
                                                  ]
                                                },
                                                {
                                                  "id": "hk7y9ne",
                                                  "text": "> If he's biased or prejudiced in some way, that's entirely relevant to the discussion of \"whether or not he's a Trump supporter.\"\n\nHow in the right fuck can you throw a “biased” accusation about a judge loving his country. The country isn’t on trial, ritten is. Quite frankly, he didn’t do nothing wrong. The earth is short of a angry pedo and a domestic abuser, he should be given a fucking award.",
                                                  "timestamp": "2021-11-11 16:48:28",
                                                  "score": -1,
                                                  "num_children": 1,
                                                  "author": 125568,
                                                  "replies": [
                                                    {
                                                      "id": "hk82yg5",
                                                      "text": "I didn't say he was biased *because* he \"loves his country.\"  \n\nGet the fuck out with these bad faith arguments.  If you don't want to take the time to acknowledge my *actual* point, don't bother replying to them.   Anybody can misconstrue a comment, but for the record, I didn't say he did anything wrong, I didn't say he was biased because he \"loves his country\", I didn't say he didn't love his country, and I for sure didn't say the fucking *country* is on trial.  Now you can fuck off, thanks.",
                                                      "timestamp": "2021-11-11 17:19:29",
                                                      "score": 2,
                                                      "num_children": 1,
                                                      "author": 201921,
                                                      "replies": [
                                                        {
                                                          "id": "hk8578n",
                                                          "text": "> I didn't say he was biased because he \"loves his country.\"\n\n> he's literally the authority here, he will be deciding the case. If he's biased or prejudiced in some way, that's entirely relevant to the discussion of \"whether or not he's a Trump supporter.\"\n\nYou implied more heavily then when pol pot said he wasn’t to fond of the Cambodian university of excellence. The fact that the judge loves his country is totally irrelevant to this case as this case is nothing to do with the us vs ritten. It’s about ritten vs a mob of rioters, and as we have seen in a literal multi layered analysis of various angles (including a fucking heat map provided by the fbi) he was obviously and blatantly defending himself.\n\nOr is this because you are apart of the neoliberal brigade seething because it really is a open and shut case of self defence, clutching at any and all straws that you can to try to get the young lad in jail.",
                                                          "timestamp": "2021-11-11 17:34:11",
                                                          "score": 0,
                                                          "num_children": 0,
                                                          "author": 125568,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "hk892h7",
                                  "text": "I'm a registered Democrat and I'm damn proud of my country, despite its faults. Let's not go there, please.\n\nI've been to Democrat rallies where that tune was played too. I love my country and I want to see it improve.",
                                  "timestamp": "2021-11-11 17:59:06",
                                  "score": 1,
                                  "num_children": 0,
                                  "replies": []
                                },
                                {
                                  "id": "hk78nfs",
                                  "text": "[removed]",
                                  "timestamp": "2021-11-11 13:40:39",
                                  "score": -13,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hk7bq7z",
                                      "text": "Then that *Democrat* fucked up.  See?  Accountability isn't hard..",
                                      "timestamp": "2021-11-11 14:05:42",
                                      "score": 17,
                                      "num_children": 1,
                                      "author": 201921,
                                      "replies": [
                                        {
                                          "id": "hk7qp4k",
                                          "text": "[removed]",
                                          "timestamp": "2021-11-11 15:57:24",
                                          "score": -5,
                                          "num_children": 2,
                                          "replies": [
                                            {
                                              "id": "hk7rpw0",
                                              "text": "It’s bit about the ring tone. Look at what he’s doing in the trial and you’ll figure it out. But it’s obviously impossible for you to look at something from more than one angle.",
                                              "timestamp": "2021-11-11 16:04:38",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 297909,
                                              "replies": [
                                                {
                                                  "id": "hk7uw2c",
                                                  "text": "[removed]",
                                                  "timestamp": "2021-11-11 16:26:17",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "hk7wx46",
                                                      "text": "[deleted]",
                                                      "timestamp": "2021-11-11 16:39:38",
                                                      "score": 0,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "hk7z3zk",
                                                          "text": ">He goes cross-state with an assault rifle\n\nHe didn't. The rifle has never been outside the state of Wisconsin.\n\nStop getting your news from Reddit.",
                                                          "timestamp": "2021-11-11 16:53:56",
                                                          "score": -1,
                                                          "num_children": 0,
                                                          "author": 351470,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "hk7v1h0",
                                              "text": ">If a Democrat fucked up by putting a judge in that actually likes America\n\nLet me stop you right there.  You know what I'm implying by what I said.  Just because you pretend you can't wrap your head around the fact that the song might imply he were a Trump supporter doesn't mean you can decide the reason why I said a Democrat fucked up to put him there must not be for that reason..\n\nTo be clear, I don't mean to say a Democrat fucked up to make him judge because he *likes* America..\n\nI'm happy to have a discussion with you, but it can't start with a bad faith argument.",
                                              "timestamp": "2021-11-11 16:27:18",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 201921,
                                              "replies": [
                                                {
                                                  "id": "hk7vo9l",
                                                  "text": "[removed]",
                                                  "timestamp": "2021-11-11 16:31:28",
                                                  "score": 0,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "hk7xl6k",
                                                      "text": ">A bad faith argument? \n\nIf you think I've made one too, then all the more reason not to start a pointless discussion.  You've only proven my point further, thanks.",
                                                      "timestamp": "2021-11-11 16:43:59",
                                                      "score": -1,
                                                      "num_children": 0,
                                                      "author": 201921,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hk75ltv",
                              "text": "The judge seems more like his supportive grandpa who believes those antifa looters got what they deserved.",
                              "timestamp": "2021-11-11 13:14:38",
                              "score": 16,
                              "num_children": 2,
                              "author": 385712,
                              "replies": [
                                {
                                  "id": "hk7a5mi",
                                  "text": "And I'm sure we are all very shocked by this.",
                                  "timestamp": "2021-11-11 13:52:59",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 10285,
                                  "replies": []
                                },
                                {
                                  "id": "hk7aw3o",
                                  "text": "[removed]",
                                  "timestamp": "2021-11-11 13:58:57",
                                  "score": -9,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hk7bazs",
                                      "text": "…and if he had shot Kyle in the chaos of thinking he was an active shooter with an assault rifle, what kind of trial would have followed?",
                                      "timestamp": "2021-11-11 14:02:21",
                                      "score": 7,
                                      "num_children": 1,
                                      "author": 385712,
                                      "replies": [
                                        {
                                          "id": "hk7bfz5",
                                          "text": "[removed]",
                                          "timestamp": "2021-11-11 14:03:28",
                                          "score": -10,
                                          "num_children": 2,
                                          "replies": [
                                            {
                                              "id": "hk7ek6j",
                                              "text": "Then how was he the third guy shot",
                                              "timestamp": "2021-11-11 14:27:58",
                                              "score": 7,
                                              "num_children": 1,
                                              "author": 147731,
                                              "replies": [
                                                {
                                                  "id": "hk7kryo",
                                                  "text": "…my point exactly. Two people shot, shooter still active. Two supposed “good guys” with guns and rifle boy gets his shot off first.",
                                                  "timestamp": "2021-11-11 15:14:35",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "author": 385712,
                                                  "replies": []
                                                }
                                              ]
                                            },
                                            {
                                              "id": "hk7ksdl",
                                              "text": "I love when people make up their own timelines.  It's an epidemic among right wingers.",
                                              "timestamp": "2021-11-11 15:14:40",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 47550,
                                              "replies": [
                                                {
                                                  "id": "hk7l7jj",
                                                  "text": "[removed]",
                                                  "timestamp": "2021-11-11 15:17:47",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "hk7sdm6",
                                                      "text": "Yea, he admitted to threatening Kyle AFTER HE ALREADY KILLED SOMEONE. Also, Gaige testified that his hands were up, the entry wound of the bullet matches that story.  Just because he pointed a gun at Kyle doesn't mean that's when Kyle shot.  Watch the video.  \n  \nAlso, I didn't call you a right winger, I said it's an epidemic among right wingers.  You're just.using their talking points.",
                                                      "timestamp": "2021-11-11 16:09:14",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 47550,
                                                      "replies": [
                                                        {
                                                          "id": "hk7wpwc",
                                                          "text": "[removed]",
                                                          "timestamp": "2021-11-11 16:38:18",
                                                          "score": 0,
                                                          "num_children": 1,
                                                          "replies": [
                                                            {
                                                              "id": "hk8397p",
                                                              "text": "The first shooting was not self defense, at least not by WI law.  \n  \nHe testified in court that his hands were up and if you watch the video, you can see him throw his hands up before he gets shot.  \n  \nCalm down?  Maybe you should get out more if you think I'm not calm.  This is reddit, there's nothing here worth getting worked up about.  6ou should probably take your own advice...",
                                                              "timestamp": "2021-11-11 17:21:27",
                                                              "score": 1,
                                                              "num_children": 0,
                                                              "author": 47550,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hk7rflx",
                              "text": "[removed]",
                              "timestamp": "2021-11-11 16:02:39",
                              "score": -4,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hk7rjb4",
                                  "text": "Try and keep up, bud.",
                                  "timestamp": "2021-11-11 16:03:22",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 10285,
                                  "replies": [
                                    {
                                      "id": "hk7rvfc",
                                      "text": "[removed]",
                                      "timestamp": "2021-11-11 16:05:43",
                                      "score": -6,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hk7sfol",
                                          "text": "Wow. The most low-effort troll attempt I've seen all day. Congratulations, I guess? The bar was low, and you still managed not to reach it, which in a strange way is almost an achievement.",
                                          "timestamp": "2021-11-11 16:09:37",
                                          "score": 3,
                                          "num_children": 0,
                                          "author": 10285,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hk877o2",
                              "text": "[deleted]",
                              "timestamp": "2021-11-11 17:47:10",
                              "score": 0,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hk87j30",
                                  "text": "No, the recording was from *before* the event. His affiliation with domestic terrorist groups became public *after*, and neither paint a good picture.",
                                  "timestamp": "2021-11-11 17:49:13",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 10285,
                                  "replies": [
                                    {
                                      "id": "hk88t5y",
                                      "text": "[removed]",
                                      "timestamp": "2021-11-11 17:57:24",
                                      "score": 1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hk896c7",
                                          "text": "[This](https://apnews.com/article/trials-f19acb6b4f1e4128610d2078105db1ce)",
                                          "timestamp": "2021-11-11 17:59:47",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 10285,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hk7bdpz",
                  "text": "I'm British and the fact this little prick was allowed to buy an AR-15 (actually an AR -16 or 17 I believe) blows my fucking mind. He shouldn't have been allowed to buy a catapult. Trigger happy prick.",
                  "timestamp": "2021-11-11 14:02:58",
                  "score": 19,
                  "num_children": 3,
                  "author": 189580,
                  "replies": [
                    {
                      "id": "hk7enpz",
                      "text": "He wasn’t allowed to buy one, he committed a felony straw man purchase to get it",
                      "timestamp": "2021-11-11 14:28:44",
                      "score": 21,
                      "num_children": 0,
                      "author": 147731,
                      "replies": []
                    },
                    {
                      "id": "hk7l9zl",
                      "text": "As the other user said, he didn't purchase it, it was purchased for him.\n  \nIt was just an AR-15, the AR-16 was never mass produced and only 1200 AR-17s we're produced.  The rifle he first was chambered in .223/5.56 meaning it was an AR-15.  The AR-16 is chambered in 7.62x51 and the AR-17 is a 12 gauge shotgun.",
                      "timestamp": "2021-11-11 15:18:17",
                      "score": 5,
                      "num_children": 1,
                      "author": 47550,
                      "replies": [
                        {
                          "id": "hk7lkbc",
                          "text": "Ahh thanks. Misinformed by the News. We don't have  those sort of weapons on the street over here, thank god.",
                          "timestamp": "2021-11-11 15:20:21",
                          "score": 7,
                          "num_children": 0,
                          "author": 189580,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hk9xa0p",
                      "text": "As you know, he didn’t purchase it, but the fact he had it in his possession boggles. I’m in full agreement with your sentiment. I’m Canadian and the attitude about guns in this country (I’m currently in the USA) is insane.",
                      "timestamp": "2021-11-12 01:11:58",
                      "score": 2,
                      "num_children": 0,
                      "author": 313554,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hk84zx2",
                  "text": "He will. The whole trial has been a shit show from the start. From incompetent prosecutors to the judge being obviously and ridiculously bias from the start there was no chance.\n\nJust the very fact that prosecutors we're going for murder 1 out of the gate would have been the cards stacked against them from the start",
                  "timestamp": "2021-11-11 17:32:52",
                  "score": 3,
                  "num_children": 1,
                  "author": 138592,
                  "replies": [
                    {
                      "id": "hk9z4ux",
                      "text": "Time will tell. \n\nA civil case won’t be so easy to dodge.",
                      "timestamp": "2021-11-12 01:26:30",
                      "score": 1,
                      "num_children": 0,
                      "author": 313554,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hk7dz9f",
                  "text": ">You think he’s going to get off?\n\nYes, because murder is hard to prove in court, and when the prosecutor's own witness testifies in favor of the defendant, and when it turns out one of the guys killed was a child rapist saying \"fuck you\" to a minor then reaching for his weapon, those things hurt the prosecution.",
                  "timestamp": "2021-11-11 14:23:29",
                  "score": -10,
                  "num_children": 1,
                  "author": 34355,
                  "replies": [
                    {
                      "id": "hk9yjjp",
                      "text": "You think Rittenhouse knew that? Give me a fucking break. No matter who these people were/are doesn’t give this fucked up kid the right to be an executioner.",
                      "timestamp": "2021-11-12 01:21:48",
                      "score": 2,
                      "num_children": 1,
                      "author": 313554,
                      "replies": [
                        {
                          "id": "hka381o",
                          "text": "No, and he didn't need to know it. He saw imminent threat to his life. The fact that he killed a child rapist isn't part of the self defense calculus, just an unintended benefit.",
                          "timestamp": "2021-11-12 01:58:23",
                          "score": 0,
                          "num_children": 1,
                          "author": 34355,
                          "replies": [
                            {
                              "id": "hkaizhu",
                              "text": "An imminent threat to his life. Come on. He shot and killed someone who had a skateboard! He was afraid of getting his ass kicked. This should never have happened. He had absolutely no business being there. NONE. And I can GUARANTEE you that if he gets off, he’s going to kill again. It’s going to happen.",
                              "timestamp": "2021-11-12 04:01:16",
                              "score": 1,
                              "num_children": 1,
                              "author": 313554,
                              "replies": [
                                {
                                  "id": "hkam3v8",
                                  "text": "Yes, a threat to his life. A skateboard that hit him twice already, dangerously close to his head. A skateboard when used in that manner can be a deadly blunt force weapon.\n\nTell me, who had business being there that night?",
                                  "timestamp": "2021-11-12 04:27:02",
                                  "score": 0,
                                  "num_children": 1,
                                  "author": 34355,
                                  "replies": [
                                    {
                                      "id": "hkan8gb",
                                      "text": "Sure as fuck not some 17 year old kid with a messiah complex. \n\nThose who were protesting peacefully had EVERY right to do so and be there. SMH",
                                      "timestamp": "2021-11-12 04:36:41",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 313554,
                                      "replies": [
                                        {
                                          "id": "hkap8v9",
                                          "text": "You conflate 'had business' with 'had the right'. Kyle also had every right to be there. If only those protesting peacefully had business being there, then the three violent felons he shot had no business being there.\n\nBut 'had business' doesn't matter because liberty isn't about somebody's viewpoint of what your business ought or ought not be.",
                                          "timestamp": "2021-11-12 04:54:22",
                                          "score": 0,
                                          "num_children": 1,
                                          "author": 34355,
                                          "replies": [
                                            {
                                              "id": "hkauoko",
                                              "text": "No, he had no right to be there. Where do you get that messed up idea?\n\nViolent felons??? Dude, you need to reevaluate. I could see that for two, but not for all. And what makes you think they weren’t there peacefully? You are trying to justify this twisted kid’s murders. That’s what they were. Had these 3 been law-abiding citizens their entire lives what would be your justification? It’s disgusting that you are devaluing life in the way you have. That messed up kid had no business there and as for right? He was a juvenile NOT an adult. You think minors can do whatever the fuck they want? Think again.",
                                              "timestamp": "2021-11-12 05:47:25",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 313554,
                                              "replies": [
                                                {
                                                  "id": "hkbye9m",
                                                  "text": ">Violent felons???\n\nJoseph Rosenbaum, convicted child rapist. Chasing Kyle Rittenhouse, yelled \"fuck you\" and reached for Rittenhouse's weapon when shot. Violent felon.\n\nGaige Paul Grosskreutz, charged with burglary, prowling, criminally convicted for weapons possession while intoxicated. Not a felon. Admitted in court that Rittenhouse did not shoot when Grosskreutz had hands up, admitted in court that Rittenhouse shot after Grosskreutz pointed his handgun at Rittenhouse. Definitely violent.\n\nAnthony Huber, convicted domestic abuser. Convicted of strangulation and suffocation, false imprisonment, use of a deadly weapon in domestic abuse. Shot after violent assault on Rittenhouse.\n\nKyle Rittenhouse, no criminal history. Cleaned up graffiti, extinguished fires, rendered medical aid the night of the shooting.\n\nIf the argument is about intent or state of mind at all, which it must be to convict Rittenhouse of murder, then it's fair to examine the historical disposition of all involved.\n\n>And what makes you think they weren’t there peacefully?\n\nAll three committed assault on Rittenhouse before they were shot that night. That's not peaceful.\n\n>Had these 3 been law-abiding citizens their entire lives what would be your justification?\n\nHad they never broken any laws, Rittenhouse would not have needed to defend himself.\n\n>You think minors can do whatever the fuck they want? Think again.\n\nMinors have the right of self defense. I hope you aren't arguing that a child's presence caused three peaceful protesters to go mad and turn violent, and that they were only willing to cause harm because they saw the boy. Well, maybe that's true about Rosenbaum who died the way he lived, trying to touch an unwilling minor.",
                                                  "timestamp": "2021-11-12 13:49:34",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "author": 34355,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hk84xr7",
          "text": ">It's gonna be   \n>  \n>hilarious  \n>  \n> when all these right-wing cunts are done using him as a political pawn and ghost his bitch-ass.\n\nHe will have some position in the next Trump government the way things go in the US.",
          "timestamp": "2021-11-11 17:32:28",
          "score": 6,
          "num_children": 1,
          "author": 345935,
          "replies": [
            {
              "id": "hk857ku",
              "text": "Yep. And all the previous low-level first term Trump appointees are doing so well now! Lol.",
              "timestamp": "2021-11-11 17:34:14",
              "score": 1,
              "num_children": 0,
              "author": 188474,
              "replies": []
            }
          ]
        },
        {
          "id": "hk6japx",
          "text": "Or he will get his own show.",
          "timestamp": "2021-11-11 08:34:37",
          "score": 18,
          "num_children": 3,
          "author": 306904,
          "replies": [
            {
              "id": "hk7oni9",
              "text": "shit, he's running for congress next",
              "timestamp": "2021-11-11 15:42:46",
              "score": 1,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hk84o5t",
              "text": "Nah. This kids too dumb for that even.",
              "timestamp": "2021-11-11 17:30:43",
              "score": 1,
              "num_children": 1,
              "author": 188474,
              "replies": [
                {
                  "id": "hk86d99",
                  "text": "Are you familiar with the Travon Martin case?\n\n[Here is a video](https://youtu.be/PE84fH_Pc9c) explaining how a guy got away with using \"Self Defense\" after stalking a kid thru a neighborhood.\n\nThe guy who got away with it, George Michael Zimmerman is still around.",
                  "timestamp": "2021-11-11 17:41:46",
                  "score": 0,
                  "num_children": 1,
                  "author": 306904,
                  "replies": [
                    {
                      "id": "hk87knr",
                      "text": "I've always said there's a good chance he'll get off. The system is incredibly corrupt and gets a *huge* boner everytime a white guy kills a black guy.",
                      "timestamp": "2021-11-11 17:49:30",
                      "score": 2,
                      "num_children": 1,
                      "author": 188474,
                      "replies": [
                        {
                          "id": "hk8jwpq",
                          "text": "Also the prosecutor seems to be bungling what should be the easiest case of his career.",
                          "timestamp": "2021-11-11 19:11:15",
                          "score": 2,
                          "num_children": 1,
                          "author": 104712,
                          "replies": [
                            {
                              "id": "hk8kio3",
                              "text": "The judge is aggressively on the side of the defense here, almost comically so. His words and actions seem like an SNL skit they're so ridiculously over-the-top biased towards the defendant.\n\nBut even so, the prosecution seems like they're purposefully throwing the fight here.",
                              "timestamp": "2021-11-11 19:15:24",
                              "score": 2,
                              "num_children": 0,
                              "author": 188474,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hk6kxur",
              "text": "Not likely.",
              "timestamp": "2021-11-11 08:58:13",
              "score": -8,
              "num_children": 1,
              "author": 313554,
              "replies": [
                {
                  "id": "hk6vfd8",
                  "text": "He will be on Rogan & Fox as a commentator. Maybe even shack up with Candace Owens. Then start selling pillows with you know who. He has a bright future.",
                  "timestamp": "2021-11-11 11:25:40",
                  "score": 21,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hk7h7uy",
          "text": "Pff, this kid's gonna show up as a guest speaker at every Republican/GOP convention to thunderous applause. I'd bet he runs for office.",
          "timestamp": "2021-11-11 14:48:07",
          "score": 7,
          "num_children": 1,
          "author": 41641,
          "replies": [
            {
              "id": "hk83saz",
              "text": "Sounds about white.",
              "timestamp": "2021-11-11 17:24:55",
              "score": 8,
              "num_children": 0,
              "author": 188474,
              "replies": []
            }
          ]
        },
        {
          "id": "hk7d6zv",
          "text": "[removed]",
          "timestamp": "2021-11-11 14:17:26",
          "score": -13,
          "num_children": 1,
          "replies": [
            {
              "id": "hk849fa",
              "text": "He ruined his life forever, lol! It's going to be glorious watching this cowardly little shit downward spiral.",
              "timestamp": "2021-11-11 17:28:02",
              "score": 1,
              "num_children": 0,
              "author": 188474,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hk7zxqm",
      "text": "this pissant fuckhead is gonna be a Fox correspondent and/or a Republican politician soon, I'd bank on it.",
      "timestamp": "2021-11-11 16:59:21",
      "score": 12,
      "num_children": 0,
      "author": 175656,
      "replies": []
    },
    {
      "id": "hk7a6po",
      "text": "He'd better keep those PB friends close. Kyle will likely require a full-time security detail if he walks free, gonna be spendy unless he can \"use\" volunteer facists. Those trained urban warriors (/s) will have to be on their toes, for sure.",
      "timestamp": "2021-11-11 13:53:15",
      "score": 39,
      "num_children": 2,
      "author": 276301,
      "replies": [
        {
          "id": "hk7b54q",
          "text": "He'll be fine.  He'll probably carry a gun at all times, and he'll probably get to murder more people \"in self defense\". 😒",
          "timestamp": "2021-11-11 14:01:02",
          "score": 46,
          "num_children": 2,
          "author": 354546,
          "replies": [
            {
              "id": "hk7d3y4",
              "text": "[removed]",
              "timestamp": "2021-11-11 14:16:47",
              "score": 13,
              "num_children": 1,
              "replies": [
                {
                  "id": "hk7hoen",
                  "text": "That would be fine with me!",
                  "timestamp": "2021-11-11 14:51:31",
                  "score": 4,
                  "num_children": 0,
                  "author": 354546,
                  "replies": []
                }
              ]
            },
            {
              "id": "hk7deag",
              "text": "I hadn't thought of that. Nothing like acquittal to embolden a vigilante.",
              "timestamp": "2021-11-11 14:19:03",
              "score": 12,
              "num_children": 1,
              "author": 276301,
              "replies": [
                {
                  "id": "hk7hnb2",
                  "text": "Absolutely.\n\nAlso, he'll have a promising career ahead of him, first as a pundit on Faux News (or maybe even his own show!) and then as a politician! 😒",
                  "timestamp": "2021-11-11 14:51:18",
                  "score": 11,
                  "num_children": 0,
                  "author": 354546,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hk8eaya",
          "text": "[deleted]",
          "timestamp": "2021-11-11 18:33:46",
          "score": -2,
          "num_children": 1,
          "replies": [
            {
              "id": "hk99r3m",
              "text": "Just because someone is proven innocent doesnt mean theyre innocent, and just because someone is proven guilty doesnt mean theyre guilty. Tons of black men have been found guilty by the American system for crimes they did not commit, and were proven innocent decades later.",
              "timestamp": "2021-11-11 22:08:57",
              "score": 2,
              "num_children": 0,
              "author": 145407,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hk8cexq",
      "text": "The right love to talk about how we don't need to have stricter gun laws because criminals will find a way to get them anyways. Here is that exact scenario but since he killed people they already felt deserve to die they dgaf and are defending him. \n\nThis county is so fucked up and this will only embolden other bloodthirsty nut jobs. Idk how they don't see that they are the ones to be afraid of and that they are the problem. Tbh it scares me and I can only see more people dying due to this case if (when) he walks. I also won't be surprised if he pulls this shit again",
      "timestamp": "2021-11-11 18:21:14",
      "score": 13,
      "num_children": 0,
      "author": 270946,
      "replies": []
    },
    {
      "id": "hk8nl60",
      "text": "He needs to be treated the same way as Brock Turner the rapist when he gets let off.  Anytime his name is mentioned, it should end with “domestic terrorist”",
      "timestamp": "2021-11-11 19:36:26",
      "score": 13,
      "num_children": 0,
      "author": 174461,
      "replies": []
    },
    {
      "id": "hk7qte7",
      "text": "What’s fucked up is the judge in this case. He’s so bias. He ruled these photos couldn’t be shown in court and also that the victims couldn’t be called victims. So fucked up. Fuck that judge. He’s had it out for the prosecution too.",
      "timestamp": "2021-11-11 15:58:18",
      "score": 30,
      "num_children": 0,
      "author": 297690,
      "replies": []
    },
    {
      "id": "hk7ktj3",
      "text": "It's just incredible to me how the supposed \"pro life\" conservative crowd seem to champion people who are murderers.",
      "timestamp": "2021-11-11 15:14:55",
      "score": 22,
      "num_children": 0,
      "author": 411069,
      "replies": []
    },
    {
      "id": "hk8k4ps",
      "text": "Shittenhouse needs to be locked up.",
      "timestamp": "2021-11-11 19:12:45",
      "score": 6,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hk8azqw",
      "text": "Sadly not allowed to be entered into evidence. He’s going to be acquitted on the grounds of self defense. Prosecutors did a horrible job.",
      "timestamp": "2021-11-11 18:11:46",
      "score": 7,
      "num_children": 0,
      "author": 11696,
      "replies": []
    },
    {
      "id": "hk88v5d",
      "text": "Disappointed but not surprised",
      "timestamp": "2021-11-11 17:57:46",
      "score": 5,
      "num_children": 0,
      "author": 363972,
      "replies": []
    },
    {
      "id": "hk8u2yw",
      "text": "Didn’t realize he was popping the white power symbol either.",
      "timestamp": "2021-11-11 20:20:53",
      "score": 5,
      "num_children": 0,
      "author": 74406,
      "replies": []
    },
    {
      "id": "hk84r9m",
      "text": "Only in America you can go somewhere to start shit and then get away with self-defense. Some George Zimmerman vibes.",
      "timestamp": "2021-11-11 17:31:17",
      "score": 11,
      "num_children": 0,
      "author": 345935,
      "replies": []
    },
    {
      "id": "hk7fj2h",
      "text": "He crossed state lines with an illegally obtained gun, driven by his mommy. He went hunting. He should die in prison and so should the scum that spawned him.",
      "timestamp": "2021-11-11 14:35:29",
      "score": 17,
      "num_children": 1,
      "author": 344158,
      "replies": [
        {
          "id": "hk9blr0",
          "text": "He picked up the illegally purchased gun in Wisconsin, so it didn't go across state lines. \n\nThe rest of what you said it true though.",
          "timestamp": "2021-11-11 22:22:02",
          "score": 4,
          "num_children": 1,
          "author": 228977,
          "replies": [
            {
              "id": "hk9sdbr",
              "text": "Imho that is worse. Premeditated.",
              "timestamp": "2021-11-12 00:33:40",
              "score": 1,
              "num_children": 0,
              "author": 344158,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hk8my8t",
      "text": "That's worse acting than in bad christian movies",
      "timestamp": "2021-11-11 19:32:05",
      "score": 4,
      "num_children": 0,
      "author": 312169,
      "replies": []
    },
    {
      "id": "hk7b8r9",
      "text": "It's really unfortunate that he is being used and misguided by so many people.  His mother who drove him, these d-bags, Republican talking heads.\n\nAnd just to clear, I believe he should face consequences for killing two people.  I just think this is a young person who could have taken a much different path, but is being used by so many.",
      "timestamp": "2021-11-11 14:01:50",
      "score": 14,
      "num_children": 1,
      "author": 23315,
      "replies": [
        {
          "id": "hk7hawg",
          "text": "Extremism is best for those with very malleable minds",
          "timestamp": "2021-11-11 14:48:45",
          "score": 10,
          "num_children": 0,
          "author": 199429,
          "replies": []
        }
      ]
    },
    {
      "id": "hk7gl0c",
      "text": "He is VERY ugly, damn",
      "timestamp": "2021-11-11 14:43:23",
      "score": 9,
      "num_children": 0,
      "author": 395604,
      "replies": []
    },
    {
      "id": "hk9h604",
      "text": "The whole court wants him to walk ,even the prosecutor wants him to walk...it's all rigged",
      "timestamp": "2021-11-11 23:02:42",
      "score": 2,
      "num_children": 0,
      "author": 180715,
      "replies": []
    },
    {
      "id": "hka7v7q",
      "text": "This judge is a prime example of systemic racism in action.",
      "timestamp": "2021-11-12 02:33:50",
      "score": 2,
      "num_children": 0,
      "author": 26930,
      "replies": []
    },
    {
      "id": "hk7on52",
      "text": "[removed]",
      "timestamp": "2021-11-11 15:42:41",
      "score": 0,
      "num_children": 2,
      "replies": [
        {
          "id": "hk7q583",
          "text": "So, the basic timeline:\n\n1) 4chan thinks it would be funny to start rumours that innocuous gesture is actually a sign used by racists, to upset the left\n\n2) White supremacists hear the rumours, adopt the sign themselves without irony\n\n3) People point out what they're doing, but are shouted down because \"omg I can't believe you feel for a dumb 4chan joke!\"",
          "timestamp": "2021-11-11 15:53:21",
          "score": 32,
          "num_children": 1,
          "author": 10285,
          "replies": [
            {
              "id": "hk7qjiw",
              "text": "[removed]",
              "timestamp": "2021-11-11 15:56:09",
              "score": -7,
              "num_children": 2,
              "replies": [
                {
                  "id": "hk821ha",
                  "text": "Not sure how you've missed it, but yes they do it frequently and there are pictures of it all over the internet.  An entire senior class did it as a \"prank\" in their class photo last year.",
                  "timestamp": "2021-11-11 17:13:22",
                  "score": 5,
                  "num_children": 2,
                  "author": 160806,
                  "replies": [
                    {
                      "id": "hk8egyx",
                      "text": "[deleted]",
                      "timestamp": "2021-11-11 18:34:54",
                      "score": -1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hk8lho3",
                          "text": "No I don't think the entire class are white supremacists. I do think some were just acting like edgy d-bags, and I also believe some of them are indeed budding white supremacists.",
                          "timestamp": "2021-11-11 19:22:00",
                          "score": 2,
                          "num_children": 0,
                          "author": 160806,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hk8525p",
                      "text": "[removed]",
                      "timestamp": "2021-11-11 17:33:16",
                      "score": 0,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "hk88383",
                          "text": "Why blame the people telling you what's happening rather than the white supremacists who think they're being oh-so-clever and \"triggering the libs\"? by doing it?",
                          "timestamp": "2021-11-11 17:52:47",
                          "score": 3,
                          "num_children": 2,
                          "author": 10285,
                          "replies": [
                            {
                              "id": "hk89jfn",
                              "text": "Because he has to show off his radical centrist superiority and \"muh both sides\", which means giving the right wingers a free pass and accusing the left of being the problem because we call out this bullshit.\n\nChances are he is a closet redhat pretending to be a libertarian or centrist.",
                              "timestamp": "2021-11-11 18:02:09",
                              "score": 3,
                              "num_children": 1,
                              "author": 160806,
                              "replies": [
                                {
                                  "id": "hk89z78",
                                  "text": "Most likely. He's tried making the \"white supremacists drink water!\" argument and everything.\n\nI can't imagine the level of delusion required to have all these things happen in front of your face and still go \"nah, don't see it, I think you guys are overblowing it. The guys on January 6th were just excited. Charlottesville was just boys being boys\"",
                                  "timestamp": "2021-11-11 18:05:01",
                                  "score": 4,
                                  "num_children": 1,
                                  "author": 10285,
                                  "replies": [
                                    {
                                      "id": "hk8aiyo",
                                      "text": "Yep, they know they are coming across as ignorant, and intentionally missing the point.  Purposely misinterpreting the issues is all part of the game to them.   They never argue from a genuine position, always in bad faith.",
                                      "timestamp": "2021-11-11 18:08:39",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 160806,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hk89kn3",
                              "text": "[removed]",
                              "timestamp": "2021-11-11 18:02:23",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hk8bblf",
                                  "text": "> I don't think white supremacists are trying to \"trigger the ...\"\n\nA professor of sociology who is an expert in white supremacy testified today in _Sines v Kessler_ that they are explicitly trying to \"trigger the ...\". \n\nhttps://twitter.com/UR_Ninja/status/1458836432559218697?s=20",
                                  "timestamp": "2021-11-11 18:13:58",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 176442,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hk88zfp",
                          "text": "Are you playing ignorant, or are you actually this misinformed?  Yes it started out as a \"joke\" on 4chan, and then the alt-right actually started doing it unironically.  But yeah, go ahead and both sides it and blame the left for \"making something out of nothing\".",
                          "timestamp": "2021-11-11 17:58:32",
                          "score": 1,
                          "num_children": 1,
                          "author": 160806,
                          "replies": [
                            {
                              "id": "hk89ynn",
                              "text": "[removed]",
                              "timestamp": "2021-11-11 18:04:55",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hk8b0z1",
                                  "text": "And you're intentionally ignoring the \"actually started using the gesture for white power part\".  The BS devil's advocate game you're playing is so transparent, you are just here to distract from the fact you've decided to align with fascists.",
                                  "timestamp": "2021-11-11 18:12:00",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 160806,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hk81emo",
                  "text": "Seems you are indeed too dumb to understand. The explanation couldn’t have been more clear and correct. Soooooo shocking to see more bad faith engagement from right wingers.",
                  "timestamp": "2021-11-11 17:09:11",
                  "score": 5,
                  "num_children": 1,
                  "author": 160303,
                  "replies": [
                    {
                      "id": "hk843qp",
                      "text": "[removed]",
                      "timestamp": "2021-11-11 17:27:00",
                      "score": -1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hk89fvm",
                          "text": "Yeah, groups adopt symbols. Crazy thought, right?",
                          "timestamp": "2021-11-11 18:01:30",
                          "score": 2,
                          "num_children": 0,
                          "author": 160303,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hk859h5",
          "text": "Since you put it this way at the very least you seem to be too dumb to google basic stuff.\n\n[https://www.adl.org/education/references/hate-symbols/okay-hand-gesture](https://www.adl.org/education/references/hate-symbols/okay-hand-gesture)",
          "timestamp": "2021-11-11 17:34:36",
          "score": 5,
          "num_children": 0,
          "author": 345935,
          "replies": []
        }
      ]
    },
    {
      "id": "hk7muwj",
      "text": "Both can be real.",
      "timestamp": "2021-11-11 15:29:50",
      "score": 1,
      "num_children": 0,
      "author": 35193,
      "replies": []
    },
    {
      "id": "hk9gpx5",
      "text": "y'all realize the \"ok\" symbol got dubbed as a white surpemcay sign on 4chan as a troll? granted in this context im 99% sure thats kyles intentions. but can we stop pretending that the ok symbol is and always has been a white power thing. cause it never was. you got trolled by some neckbeard on 4chan who wanted to create more controversy",
      "timestamp": "2021-11-11 22:59:22",
      "score": -3,
      "num_children": 0,
      "author": 399466,
      "replies": []
    },
    {
      "id": "hk8135j",
      "text": "Wait what'd I miss? Did that bastard go free?",
      "timestamp": "2021-11-11 17:07:00",
      "score": 0,
      "num_children": 1,
      "author": 183041,
      "replies": [
        {
          "id": "hk8khhn",
          "text": "Not yet but with how the shitshow trial is going I wouldn't be surprised if he did. It's OJ levels of bad.",
          "timestamp": "2021-11-11 19:15:11",
          "score": 5,
          "num_children": 0,
          "author": 104712,
          "replies": []
        }
      ]
    },
    {
      "id": "hk9cn4u",
      "text": "Since when is ok a White supremacy symbol?",
      "timestamp": "2021-11-11 22:29:37",
      "score": -4,
      "num_children": 0,
      "author": 145098,
      "replies": []
    },
    {
      "id": "hk7jhh7",
      "text": "Regardless of feelings or political beliefs, he was clearly defending himself according to the law. You can hate him, but he did what he had to do to avoid “great bodily harm.”",
      "timestamp": "2021-11-11 15:05:05",
      "score": -37,
      "num_children": 4,
      "author": 370179,
      "replies": [
        {
          "id": "hk827xv",
          "text": "Maybe he could’ve stayed in his own home state to avoid “great bodily harm”. Or not brought an AR15 to a protest. He went looking for a fight and found one.",
          "timestamp": "2021-11-11 17:14:34",
          "score": 10,
          "num_children": 1,
          "author": 160303,
          "replies": [
            {
              "id": "hk96c9n",
              "text": "Or maybe they shouldn’t attack someone with a gun or they’d still be alive",
              "timestamp": "2021-11-11 21:44:59",
              "score": -1,
              "num_children": 1,
              "author": 370179,
              "replies": [
                {
                  "id": "hk9dev8",
                  "text": "Literally victim blaming. What is wrong with you?",
                  "timestamp": "2021-11-11 22:35:18",
                  "score": 3,
                  "num_children": 1,
                  "author": 160303,
                  "replies": [
                    {
                      "id": "hk9t5yi",
                      "text": "Victims don’t attack people with skateboards and guns",
                      "timestamp": "2021-11-12 00:39:56",
                      "score": -1,
                      "num_children": 1,
                      "author": 370179,
                      "replies": [
                        {
                          "id": "hka02rm",
                          "text": "Yeah, why would they believe right wing terrorism is a thing? Not like January 6 ever happened. Or Charlottesville. Or Heather Heyer. Or Proud Boys with guns on Portland rooftops. Or literally any of the other shit you dog whistling chuds do and pretend like it’s not inching toward the end goal of your whole ideology. Can’t win in a battle of rhetoric or ideas so you have to bring your guns and disinformation, just like the soft-chinned coward in question. Pathetic.",
                          "timestamp": "2021-11-12 01:33:58",
                          "score": 1,
                          "num_children": 0,
                          "author": 160303,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hk7l1uu",
          "text": "It’s not self defense if you go out and intimidate and threaten people after you’ve made it clear on video you intend to shoot and murder protestors.",
          "timestamp": "2021-11-11 15:16:37",
          "score": 19,
          "num_children": 1,
          "replies": [
            {
              "id": "hk7ml70",
              "text": "Wisconsin law allows you to actually be an instigator and still claim self defense. It also says you don’t have to run first.",
              "timestamp": "2021-11-11 15:27:51",
              "score": -6,
              "num_children": 0,
              "author": 323307,
              "replies": []
            }
          ]
        },
        {
          "id": "hk7kvm6",
          "text": "[deleted]",
          "timestamp": "2021-11-11 15:15:20",
          "score": 15,
          "num_children": 1,
          "replies": [
            {
              "id": "hk80vfc",
              "text": "I don’t think the evidence presented backs up this narrative.\n\nAlso, why the accusation of racism? Has race played a role in this trial? I apologize if I’m misinformed, but I haven’t read mention of anyone involved being “brown folk” to use your words",
              "timestamp": "2021-11-11 17:05:34",
              "score": -6,
              "num_children": 0,
              "author": 267401,
              "replies": []
            }
          ]
        },
        {
          "id": "hk7k7xn",
          "text": "Bullshit.  Right wingers will always side with people like Kyle and fabricate their own reality.  \n  \nAccording to WI law he didn't meet his duty to flee before firing at his first victim.  You also don't get to claim self defense when you're an active shooter.  Nice try though, maybe go back with the morons in the crowder sub.",
          "timestamp": "2021-11-11 15:10:27",
          "score": 20,
          "num_children": 1,
          "author": 47550,
          "replies": [
            {
              "id": "hk8esq0",
              "text": "[deleted]",
              "timestamp": "2021-11-11 18:37:04",
              "score": -7,
              "num_children": 1,
              "replies": [
                {
                  "id": "hk8ki57",
                  "text": "What did I say that was a lie?  KR had enough area to keep running,.according to the footage you mentioned.",
                  "timestamp": "2021-11-11 19:15:18",
                  "score": 5,
                  "num_children": 1,
                  "author": 47550,
                  "replies": [
                    {
                      "id": "hk8n7y9",
                      "text": "[deleted]",
                      "timestamp": "2021-11-11 19:33:55",
                      "score": -4,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hk8ncd1",
                          "text": "Kyle wasn't on his back until after he had already killed someone, but nice try though. Why lie?",
                          "timestamp": "2021-11-11 19:34:46",
                          "score": 5,
                          "num_children": 0,
                          "author": 47550,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hk9l9md",
      "text": "Look, the argument over whether the \"OK\" hand signal is a white supremacist secret salute or not doesn't really matter. The notion that it *is*, originated as a 4chan prank intended to discredit the mainstream media, and as soon as one reporter took the bait, a bunch of white nationalists started doing it in photos and using the emoji. So the \"OK\" thing is a wash. The fact that Kyle is using it in that photo is meant to be a general flex. I mean, he's also probably meaning the white power thing too, but mostly flexing on the fact that he's walking around free in a bar after shooting protesters.",
      "timestamp": "2021-11-11 23:34:18",
      "score": -1,
      "num_children": 0,
      "author": 331605,
      "replies": []
    },
    {
      "id": "hk99cue",
      "text": "That little shit didn’t learn his lesson",
      "timestamp": "2021-11-11 22:06:08",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hk9vqk6",
      "text": "I hate that guy and I hope it is a mistrial and he gets a new trial with a legitimate judge. But I think the hand symbol is OK.",
      "timestamp": "2021-11-12 00:59:49",
      "score": 1,
      "num_children": 0,
      "author": 63770,
      "replies": []
    },
    {
      "id": "hkgi88o",
      "text": "This is not good for our social sanity or our countries very soul. F these fascists.",
      "timestamp": "2021-11-13 14:11:53",
      "score": 1,
      "num_children": 0,
      "author": 275910,
      "replies": []
    },
    {
      "id": "hk8mu3z",
      "text": "To be fair he did shoot in self defence. However he did everything he could to get into that situation. He’s a sick fuck",
      "timestamp": "2021-11-11 19:31:16",
      "score": -8,
      "num_children": 1,
      "author": 375165,
      "replies": [
        {
          "id": "hk9p4t3",
          "text": "He basically admitted in court that the first person he killed wasn't in self-defense, because he lied IMMEDIATELY to bystanders claiming the guy he just killed had a gun. He know that he didn't have a gun when he shot him, and knew it was wrong to shoot an unarmed man, so he lied.\n\nAnd THEN he went on to \"defend himself\" because the crowd was trying to stop a 'bad guy with a gun.' Open and shut, imho, but he's going to be cleared of all charges, even the ones nobody disputes.",
          "timestamp": "2021-11-12 00:07:57",
          "score": 5,
          "num_children": 1,
          "author": 158650,
          "replies": [
            {
              "id": "hk9pc4m",
              "text": "I might’ve read the case wrong. I thought a witness said the first person he killed had pointed a gun at him",
              "timestamp": "2021-11-12 00:09:38",
              "score": 2,
              "num_children": 0,
              "author": 375165,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hk8j68p",
      "text": "Seemed to have forgotten 4chan trolled corporate media into saying that ok symbol is a hate symbol like they trolled them into believing Q was a thing.",
      "timestamp": "2021-11-11 19:06:15",
      "score": -9,
      "num_children": 1,
      "replies": [
        {
          "id": "hk90war",
          "text": "It may have started as a joke, but has been co-opted by actual white supremacists. As well it's obvious that Q is real to a bunch of dumbasses (and not the just the media, regular people) when they seriously wait for JFK Jr. to show up in Texas. Seems like that right wing idiots got trolled into it more than \"corporate media\" since they take it more serious than anyone else.",
          "timestamp": "2021-11-11 21:07:40",
          "score": 9,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hk8skxm",
      "text": "[deleted]",
      "timestamp": "2021-11-11 20:10:34",
      "score": -4,
      "num_children": 2,
      "replies": [
        {
          "id": "hk909h9",
          "text": "Yes and no. Depends on the context it's being used in and who is doing it. Usually people don't just pose for pictures with the OK symbol? Saying OK to nothing? I'd say 9 times out of 10 a picture with somebody putting that symbol up is doing it as a white power symbol.",
          "timestamp": "2021-11-11 21:03:23",
          "score": 8,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hk906qc",
          "text": "Oh blessed summer child",
          "timestamp": "2021-11-11 21:02:51",
          "score": 6,
          "num_children": 0,
          "author": 298535,
          "replies": []
        }
      ]
    },
    {
      "id": "hk8gpx4",
      "text": "[removed]",
      "timestamp": "2021-11-11 18:49:51",
      "score": -4,
      "num_children": 2,
      "replies": [
        {
          "id": "hk8ie5r",
          "text": "This is an ethical dilemma that people often struggle with, so no judgement here.\n\nIf you grab a gun, say \"I'm gonna kill a random person today\", and then go do it, you're a bad person. You don't retroactively become a good person if it turns out the person you shot was bad.",
          "timestamp": "2021-11-11 19:01:06",
          "score": 9,
          "num_children": 0,
          "author": 38690,
          "replies": []
        },
        {
          "id": "hk8l2rv",
          "text": "1) he did not know about their history when he shot them\n\n2) even if he did, vigilantism is illegal\n\n3) I have no sympathy for pedophiles or abusers, but it sounds like you and all the other people I hear saying shit like that don't actually care about justice, you just want a socially acceptable way to wish for people's violent deaths.",
          "timestamp": "2021-11-11 19:19:11",
          "score": 8,
          "num_children": 0,
          "author": 104712,
          "replies": []
        }
      ]
    },
    {
      "id": "hk89ruj",
      "text": "Murder? I’m sorry—has he been convicted of anything yet? I haven’t seen.",
      "timestamp": "2021-11-11 18:03:41",
      "score": -9,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hk7miml",
      "text": "[removed]",
      "timestamp": "2021-11-11 15:27:18",
      "score": -14,
      "num_children": 1,
      "replies": [
        {
          "id": "hk7n9w2",
          "text": "Just because you have accepted Saint Kyle as your personal role model doesn’t mean sane people have to do the same. \n\nHe will be found innocent of the charges, but that’s nowhere near the same thing as actually being innocent.",
          "timestamp": "2021-11-11 15:32:52",
          "score": 11,
          "num_children": 0,
          "author": 147442,
          "replies": []
        }
      ]
    },
    {
      "id": "hk7j4rh",
      "text": "[removed]",
      "timestamp": "2021-11-11 15:02:28",
      "score": -22,
      "num_children": 2,
      "replies": [
        {
          "id": "hk7lg80",
          "text": "https://imgur.com/a/wWWygZs\n\nIncorrect, placement doesn't really matter much",
          "timestamp": "2021-11-11 15:19:31",
          "score": 13,
          "num_children": 0,
          "author": 287431,
          "replies": []
        },
        {
          "id": "hk7pen4",
          "text": "Dickhead",
          "timestamp": "2021-11-11 15:48:07",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "hk7svx8",
              "text": "[removed]",
              "timestamp": "2021-11-11 16:12:48",
              "score": -1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hk7tspb",
                  "text": "Bitter cuz you can't get hard.",
                  "timestamp": "2021-11-11 16:18:57",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hk7ku45",
      "text": "[removed]",
      "timestamp": "2021-11-11 15:15:02",
      "score": -11,
      "num_children": 3,
      "replies": [
        {
          "id": "hk7nfif",
          "text": "There’s a patch of grass in Dallas some of your friends been standing on for a few days. Field enough for ya?",
          "timestamp": "2021-11-11 15:33:59",
          "score": 12,
          "num_children": 0,
          "author": 147442,
          "replies": []
        },
        {
          "id": "hk7p27r",
          "text": "Sit down, tough guy.",
          "timestamp": "2021-11-11 15:45:40",
          "score": 8,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hk7pqsk",
          "text": "Ooo somebody's been whipped by daddy Trump.",
          "timestamp": "2021-11-11 15:50:30",
          "score": 6,
          "num_children": 0,
          "author": 181613,
          "replies": []
        }
      ]
    },
    {
      "id": "hk986x8",
      "text": "Man you guys are borderline delusional.",
      "timestamp": "2021-11-11 21:57:51",
      "score": -9,
      "num_children": 0,
      "author": 148932,
      "replies": []
    },
    {
      "id": "hk96rqj",
      "text": "How is this a display of systemic racism?",
      "timestamp": "2021-11-11 21:47:57",
      "score": -6,
      "num_children": 0,
      "author": 20195,
      "replies": []
    },
    {
      "id": "hkcb08n",
      "text": "1. Thats the ok symbol\n\n2. How do you know that this is a proud boy?\n\n3. Whats that thing on the shirt in the photo, the blue covering the word “fuck” it looks like a bad photoshop\n\n4. Self defence ≠ murder",
      "timestamp": "2021-11-12 15:24:53",
      "score": -1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hkt5ocp",
      "text": "If you believe that’s a hand gesture for white supremacy. Then get trolled.",
      "timestamp": "2021-11-16 03:33:10",
      "score": 0,
      "num_children": 0,
      "author": 320305,
      "replies": []
    },
    {
      "id": "hkt6anf",
      "text": "I’d buy him a drink.",
      "timestamp": "2021-11-16 03:37:54",
      "score": 0,
      "num_children": 0,
      "author": 320305,
      "replies": []
    }
  ]
}