{
  "id": "qsokkv",
  "text": "Spot on\n",
  "timestamp": "2021-11-13 00:08:10",
  "score": 4442,
  "subreddit": "t5_3fdcn",
  "num_children": 46,
  "replies": [
    {
      "id": "hkecd4a",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2021-11-13 00:08:11",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "hkenps0",
      "text": "That's literally what they want. They want to start killing people in response.",
      "timestamp": "2021-11-13 01:40:44",
      "score": 560,
      "num_children": 2,
      "author": 285833,
      "replies": [
        {
          "id": "hkfiueb",
          "text": "They want to \"justify\" their actions, and responding to them with violence would give them the \"evil left\" they always shout from the rooftops about.",
          "timestamp": "2021-11-13 06:32:18",
          "score": 188,
          "num_children": 4,
          "author": 183041,
          "replies": [
            {
              "id": "hkg0j3e",
              "text": "Thing is, motives can be found regardless. They are literally already shooting black people, leftists, black people, gay people, black people, children, and even black people, all for absolutely no reason, all excused by the smallest statements imaginable, and all glorified afterwards in a completely obvious way. Who cares if they have \"clear reasons\" or not? In the end, actually being armed and showing an opposition would at least protect their targets from immediate harm.",
              "timestamp": "2021-11-13 10:43:51",
              "score": 50,
              "num_children": 1,
              "replies": [
                {
                  "id": "hkgn4xi",
                  "text": "> In the end, actually being armed and showing an opposition would at least protect their targets from immediate harm.\n\nThis is what I needed to hear. I am all for armed defense, but actively being the aggressor, at least for me, is too much.",
                  "timestamp": "2021-11-13 14:54:26",
                  "score": 17,
                  "num_children": 0,
                  "author": 183041,
                  "replies": []
                }
              ]
            },
            {
              "id": "hkgmgsg",
              "text": "Can you actually imagine if leftists did anything remotely like Jan 6th?\n\nAmerica would be a dictatorship by April",
              "timestamp": "2021-11-13 14:48:43",
              "score": 48,
              "num_children": 2,
              "replies": [
                {
                  "id": "hkgnvma",
                  "text": "Very true.",
                  "timestamp": "2021-11-13 15:00:40",
                  "score": 12,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hkj5qpe",
                  "text": "They would've carpet bombed the Capitol without thinking twice.",
                  "timestamp": "2021-11-14 01:51:45",
                  "score": 1,
                  "num_children": 0,
                  "author": 320546,
                  "replies": []
                }
              ]
            },
            {
              "id": "hkfvayu",
              "text": "We really need to stop to pretend all acts of \"violence\" are the same. There are good reasons and there are bad reasons. Maybe the left needs to show some teeth now and than.",
              "timestamp": "2021-11-13 09:25:21",
              "score": 61,
              "num_children": 3,
              "author": 157417,
              "replies": [
                {
                  "id": "hkfyz75",
                  "text": "Oh buddy, we're getting there. If you want subs and tips, dm me.",
                  "timestamp": "2021-11-13 10:20:47",
                  "score": 12,
                  "num_children": 0,
                  "author": 146803,
                  "replies": []
                },
                {
                  "id": "hkhans2",
                  "text": "Won’t the right spin the smallest act out of proportion?  I feel like more violent responses will only encourage more violent responses.  If violence gets quiet, the Rittenhouse case will amplify for the atrocity it is.  If there is more violence that case will be forgotten, especially if it’s violence from the left, then the right will likely say “look, rittenhouse is justified because leftists are violent”.\n\nSure, it’s infuriating, it’s insane, illogical, but why would we be more illogical?  Keep calm and be more intelligent, and fucking vote and get out the vote.",
                  "timestamp": "2021-11-13 17:48:20",
                  "score": 0,
                  "num_children": 3,
                  "author": 353741,
                  "replies": [
                    {
                      "id": "hkhe2wg",
                      "text": "They do that already.",
                      "timestamp": "2021-11-13 18:12:31",
                      "score": 7,
                      "num_children": 1,
                      "author": 21146,
                      "replies": [
                        {
                          "id": "hm0g8zk",
                          "text": "That’s what I mean more of the same",
                          "timestamp": "2021-11-25 08:05:52",
                          "score": 1,
                          "num_children": 0,
                          "author": 353741,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hkhp61h",
                      "text": "The right is fighting imaginary demonic lizard predators while they wait for JFK to resurrect, change parties, and tell them America (the country not the corporation) is 40 years old and thus is not responsible in any regard for the vast damage America (the corporation) has inflicted on earth and humanity.\n\nDon't bother with the kid gloves or we're going to be in a civil war.",
                      "timestamp": "2021-11-13 19:32:33",
                      "score": 4,
                      "num_children": 1,
                      "author": 227707,
                      "replies": [
                        {
                          "id": "hm0g7lk",
                          "text": "Hmmph",
                          "timestamp": "2021-11-25 08:05:24",
                          "score": 1,
                          "num_children": 0,
                          "author": 353741,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hm9yual",
                      "text": "I will start by saying i am in favor of \"soft\" methods, i am deeply impressed with people who are able to maintain love for people i have nothing but contempt for, i absolutely do wish for myself to be this positive BUT i just can't deny the need for violence to a certain extend. \n\nIf i look at history, did overall peaceful protest really accomplish as much as we wish it did? Or is it more one important aspect of the movement. I feel like we look back at violent acts in the past and are able to understand their importance for the movement but seem to be convinced there can't be a legitimate reason here and now.  I just listened to the stonewall uprising on Your wrong about and i think we have to agree the \"violence\" here was more than justified and did not hurt the movement. \n\nIn my home country the socialist workers party and the conservative economics party did fight actual war, if the socialists wouldn't have had resorted to violence than, we maybe wouldn't have the social democracy we have now with their strong worker protection and strong social welfare.\n\nI feel like the left needs to let go of their idealism a little. I admire that people on the left are truly convinced about what they believe in and avoid hypocritical behavior but this weakens the movement overall.\n\nIt doesn't really matter how this makes the left look, do you see people ACTUALLY care about violence? They pretend to care bc they don't like the lefts ideals. We are already painted as an equal threat although the left has not even close the same amount of violent behavior.\n\nIn the end what is most important is how to most effectively get rid of the alt right ideology. \n\nSome people can be reached through discourse but not everyone, if they feel comfortable sharing their ideas the ideas get more mainstream, some people will not listen to reason and need to be reminded that the narrative of the weak left is not true. Fascism needs time to grow and is just constantly testing the limits, if they don't listen to reason violence is at least on the table. The right is fueled by this idea that they are superior in every way to the left and they don't condemn violence.\n\nIf you believe in peaceful protest all the way down, good for you but just like the \"peaceful\" right is not criticizing the \"violent\" right we shouldn't either, it is just derailing the conversation into nothing.",
                      "timestamp": "2021-11-27 14:27:28",
                      "score": 2,
                      "num_children": 0,
                      "author": 157417,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hkg7yro",
                  "text": "This",
                  "timestamp": "2021-11-13 12:25:07",
                  "score": -2,
                  "num_children": 0,
                  "author": 295124,
                  "replies": []
                }
              ]
            },
            {
              "id": "hkfyhnp",
              "text": "If you believe that protecting black lives, queer lives, disabled lives et al is not worth shooting some Nazis over, then you don't actually give a shit.",
              "timestamp": "2021-11-13 10:13:33",
              "score": 74,
              "num_children": 0,
              "author": 303540,
              "replies": []
            }
          ]
        },
        {
          "id": "hkg3teg",
          "text": "I’m more of a Berniecrat than right. But yeah, I think it would be fine for armed black folks to go to a white power rally to exercise their second amendment rights. And if somebody violently attacks them then they would be justified to use force. It goes both ways. Assault is bad. Open carry is fine. We don’t have rights so that we can use them exclusively in non-confrontational situations that nobody cares about. We have rights so that we can be uppity.",
          "timestamp": "2021-11-13 11:30:48",
          "score": 12,
          "num_children": 2,
          "replies": [
            {
              "id": "hkgaqwg",
              "text": "You're missing a crucial part in your scenario when you use the word \"justified\". There are multiple systems of justice that are not congruent with how they are applied to reality. The system will smile upon Kyle for killing black people but will not allow for the kyles to be killed by a black person. Black people will not be allowed to exercise second amendment rights en mass the way white people do.",
              "timestamp": "2021-11-13 12:57:48",
              "score": 20,
              "num_children": 1,
              "author": 285833,
              "replies": [
                {
                  "id": "hkhomzo",
                  "text": "Without commenting on who the justice system will actually allow to exercise their rights unmolested, all I have to say is that I would like everybody to be able to exercise those rights.",
                  "timestamp": "2021-11-13 19:28:44",
                  "score": -1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "hkie4ig",
              "text": "man please, a group of black people  would have been stopped and executed by police for even attempting something like this before they got to the destination. The black panthers just trying a form of community policing with weapons ended Open carry in California and ofc many of their members where shot or jailed on trumped up charges for decades.  The MOVE building housing black activists in the mid 1980's was fucking bombed when they had a hunch they might have firearms cache on the premises.  [https://www.vox.com/the-highlight/2019/8/8/20747198/philadelphia-bombing-1985-move](https://www.vox.com/the-highlight/2019/8/8/20747198/philadelphia-bombing-1985-move)\n\nThere's no way a bunch of armed black people on the left would make it to such an event without being gunned down by police.",
              "timestamp": "2021-11-13 22:29:33",
              "score": 5,
              "num_children": 1,
              "author": 120473,
              "replies": [
                {
                  "id": "hkigj6g",
                  "text": "You seem to be of the impression that I don’t agree with everything you just said…? I’m just saying that if they could, I’d support their right to do so.",
                  "timestamp": "2021-11-13 22:46:54",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hkectdr",
      "text": "If it wasn't for double standards they'd have no standards at all.",
      "timestamp": "2021-11-13 00:11:47",
      "score": 361,
      "num_children": 3,
      "author": 46883,
      "replies": [
        {
          "id": "hkecvq1",
          "text": "Did they ever have any?",
          "timestamp": "2021-11-13 00:12:20",
          "score": 118,
          "num_children": 1,
          "replies": [
            {
              "id": "hkgpswa",
              "text": "Yeah: ‘Us Good, Them Bad’.",
              "timestamp": "2021-11-13 15:16:04",
              "score": 20,
              "num_children": 1,
              "author": 383238,
              "replies": [
                {
                  "id": "hkh1yi0",
                  "text": "The “standard” was ignorance and narcissism",
                  "timestamp": "2021-11-13 16:47:04",
                  "score": 7,
                  "num_children": 0,
                  "author": 38324,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hkfro3y",
          "text": "lol just saw this on the ancap sub (which i lurk on, defs not an ancap), it's hilarious (and grim) how completely partisan they are while claiming to be objective.\n\nthey were responding like \"no! self-defence is self-defence and we would stand up for that too\" but you knooooow that if this kid actually were black and shot a cop or something their hyper-conservative antennae would start tingling and they'd start getting all \"black crime is out of control!\"",
          "timestamp": "2021-11-13 08:31:42",
          "score": 33,
          "num_children": 2,
          "author": 174550,
          "replies": [
            {
              "id": "hkfz738",
              "text": "I remember when I was a feeble minded 7th grader (about 15 years ago) thinking about being an ancap lmfao.",
              "timestamp": "2021-11-13 10:24:02",
              "score": 11,
              "num_children": 0,
              "author": 146803,
              "replies": []
            },
            {
              "id": "hkgzplw",
              "text": "I saw that too, wtaf",
              "timestamp": "2021-11-13 16:30:47",
              "score": 2,
              "num_children": 0,
              "author": 172060,
              "replies": []
            }
          ]
        },
        {
          "id": "hkfbp7x",
          "text": "r/conservative likes to use this phrase out of context any opportunity they can. \n\nMaybe let’s not use it, since they’ve co opted it and it’s just doing to be a “yell at the sky” phrase going forward.",
          "timestamp": "2021-11-13 05:12:24",
          "score": 37,
          "num_children": 3,
          "author": 210335,
          "replies": [
            {
              "id": "hkfjva3",
              "text": "No, we should continue to use it. Don’t let the right get away with their BS.",
              "timestamp": "2021-11-13 06:44:57",
              "score": 31,
              "num_children": 2,
              "replies": [
                {
                  "id": "hkfkfs7",
                  "text": "I mean sure go ahead but my point is if everyone says it after everything, it loses any meaning. \n\nDon’t we all remember how much “gaslighting,” was going on last year? Nope. Because everyone used the term out of context to fuck all and now it’s meaningless. \n\nThe Right is dissolving real concepts by diluting them into catch phrases and hoping both sides yell it loud enough so that it annoys us all. And they’re doing a realllllly good job at that. Kinda frighteningly so… \n\nThey cling to buzzwords more than anyone on the left is, and it’s on purpose. It’s to annoy and dilute. That’s the goal.",
                  "timestamp": "2021-11-13 06:52:10",
                  "score": 12,
                  "num_children": 0,
                  "author": 210335,
                  "replies": []
                },
                {
                  "id": "hkj652j",
                  "text": "I'm still pissed at them for ruining Norse and Celtic iconography.",
                  "timestamp": "2021-11-14 01:54:44",
                  "score": 2,
                  "num_children": 1,
                  "author": 320546,
                  "replies": [
                    {
                      "id": "hkjshu3",
                      "text": "Fuck 'em. We should take it back.",
                      "timestamp": "2021-11-14 04:50:28",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hkff7sw",
              "text": "Any opportunity they can and spam it then upvote it with a few sock puppets and the hive mind does the rest of the upvoting for them",
              "timestamp": "2021-11-13 05:49:38",
              "score": 14,
              "num_children": 0,
              "author": 147731,
              "replies": []
            },
            {
              "id": "hkh392c",
              "text": "I'd give this idea the 👌sign but we let them have that too. Anything else we can give to these pieces of shit so that we're too busy self-policing what the right has co-opted to focus on the actual issues?",
              "timestamp": "2021-11-13 16:56:23",
              "score": 2,
              "num_children": 1,
              "author": 244520,
              "replies": [
                {
                  "id": "hkhd08f",
                  "text": "So I take it you’re unable to simultaneously walk and chew bubble gum?",
                  "timestamp": "2021-11-13 18:04:55",
                  "score": -2,
                  "num_children": 1,
                  "author": 210335,
                  "replies": [
                    {
                      "id": "hkirhg4",
                      "text": "It is certainly a lot harder when you have someone nipping at your heels saying \"You shouldn't chew gum because conservatives chew gum!\"",
                      "timestamp": "2021-11-14 00:04:35",
                      "score": 1,
                      "num_children": 1,
                      "author": 244520,
                      "replies": [
                        {
                          "id": "hkirumf",
                          "text": "You actively go seek comments to reply to, but yeah it’s others who are nipping at your heels… ok.",
                          "timestamp": "2021-11-14 00:07:12",
                          "score": -1,
                          "num_children": 0,
                          "author": 210335,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hkfg4cu",
      "text": "The fucked up concepts is majority of the Gravy seals think a civil war would be like a video game, go out play army and come home on Sunday and watch Football. \n\nIf there is a Civil war , there will be no electricity, running water, cell service, fuel for vehicles and trumps favorite fast food.  The landscape would look like Yugoslavia in the 90s and current areas of Syria. A bunch fucken warlords raping and pillaging as they go. \n\nFucken Red Dawn syndrome.",
      "timestamp": "2021-11-13 05:59:49",
      "score": 46,
      "num_children": 2,
      "replies": [
        {
          "id": "hkfpivh",
          "text": "+Pharmaceuticals used to treat chronic conditions \n\nIdk if we'd end up losing more legs to bullets or diabetes.",
          "timestamp": "2021-11-13 08:01:00",
          "score": 16,
          "num_children": 1,
          "replies": [
            {
              "id": "hkgowv3",
              "text": "Judging by the state of your healthcare system to begin with, my bet goes to the diabetes and other preventable causes",
              "timestamp": "2021-11-13 15:09:01",
              "score": 4,
              "num_children": 0,
              "author": 107630,
              "replies": []
            }
          ]
        },
        {
          "id": "hkgl6li",
          "text": "extremely quotable comment here",
          "timestamp": "2021-11-13 14:37:40",
          "score": 1,
          "num_children": 0,
          "author": 201611,
          "replies": []
        }
      ]
    },
    {
      "id": "hkedfvd",
      "text": "They’re definitely cool with it because they’re itching for the opportunity to start a war.",
      "timestamp": "2021-11-13 00:16:47",
      "score": 206,
      "num_children": 6,
      "author": 60365,
      "replies": [
        {
          "id": "hkf9s41",
          "text": "As a ex Nationalist - you are absolutely correct my fathers generation has been fantasizing this since the late 60s, they handed down their perceived injustice to my generation and then handed down to the millennials and being handed down to the Zoomers. \n\nThis all started from Vietnam era conservatives who are still bitter over how the liberals treated them when they came back from the Vietnam War. \n\nBut what is even more fucked up is they chose a complete douchbag as their leader that was able to get draft deferments to avoid the same War they fought in. So he can fuck ex communist chicks from Hungary, Yugoslavia, Russia and so on. \n\nWelcome to the Fucken twilight zone.",
          "timestamp": "2021-11-13 04:52:58",
          "score": 115,
          "num_children": 2,
          "replies": [
            {
              "id": "hkfbykb",
              "text": "[deleted]",
              "timestamp": "2021-11-13 05:15:05",
              "score": 62,
              "num_children": 2,
              "replies": [
                {
                  "id": "hkffeqo",
                  "text": "Where’s my parade?\n\nHomer just pay the $4 🤦‍♀️",
                  "timestamp": "2021-11-13 05:51:43",
                  "score": 30,
                  "num_children": 1,
                  "author": 147731,
                  "replies": [
                    {
                      "id": "hkfhhgs",
                      "text": "Have you notice majority of the veterans wearing I served hats are from the Vietnam War. Wanting u to thank them for killing women and children and waging a war against a nation that just wanted end colonialism. Thats why the fucken French got out. Ho Chi Minh attempted to reach out to us twice before turning to the Russians and Chinese. \n\nThe instruments of Genocide always follows the same road, their leaders create a perceived injustice, they are doing Gods work, and they have derogatory pets names for their enemies and view them as sub human vermin. And thats how you get ordinary people to murder unarmed men, Women and children in masse in the name of Nationalism.",
                      "timestamp": "2021-11-13 06:15:58",
                      "score": 64,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hkftzos",
                          "text": "I saw a documentary focused mainly on one veteran's account of the events shortly after he returned from Vietnam who was involved with intelligence.  They talked about hitting some village, and being new, he mentions how it would necessarily help win the war.  After the meeting, his friend pulls him aside and says to NEVER say such things again, that he hasn't been there long and he doesn't understand the hatred they have against them.\n\nIt really puts things into perspective how the American soldiers were quickly put into a mindset of hating all of them, not just the enemy.  I'm not against the veterans, but I think I would have been against that war, and I can see how the two might easily be confused by the vets who came home from the war.",
                          "timestamp": "2021-11-13 09:05:53",
                          "score": 18,
                          "num_children": 0,
                          "author": 201921,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hkgymmn",
                  "text": "> which, by the way, was largely a fiction.\n\nTell that to my husband. 😒\n\nAnd no, he was never a conservative and going to Vietnam wasn't his idea *at all*.",
                  "timestamp": "2021-11-13 16:22:52",
                  "score": 1,
                  "num_children": 0,
                  "author": 354546,
                  "replies": []
                }
              ]
            },
            {
              "id": "hkfmlxm",
              "text": "Idk if you would know, but who exactly would they be fighting in this potential war? Will they require people to wear a badge and make them pick à political side? Or are they just after minorities? Or do they want to kill the politicians?? It just confuses me the and I havent really seen anyone spell it out, at least not on reddit. It makes 0 sense to me and comes of as confused and paranoid and the thought of that is scary",
              "timestamp": "2021-11-13 07:20:32",
              "score": 1,
              "num_children": 2,
              "author": 270946,
              "replies": [
                {
                  "id": "hkhik9q",
                  "text": "This is how the Third Reich put their enemies in buckets and physically labeled them. This was the system between 1933 and 1945 inside Germany. \n\nOnce the final resolution was declared in 1941 that’s  when Jews and Soviet POWs were sent to Poland and liquidated en masse first at Sobibor, Chelmno, Treblinka and Belzec,and then primarily at Auschwitz / Birkenau  \n\n2 yellow triangles one inverted to form 6 pointed star of david. \n\nThe following were inverted triangle patches. \n\nRed triangle – political prisoners: social democrats, liberals, socialists, communists, anarchists, gentiles who assisted Jews; trade unionists and Freemasons.\n\nGreen triangle – convicts and criminals \n\nBlue triangle – foreign forced laborers and emigrants. This category included apatrides, Spanish refugees from Francoist Spain, whose citizenship was revoked and emigrants to countries which were occupied by Nazi Germany or were under German sphere of influence.\n\nPurple triangle – primarily Jehovah's Witnesses (over 99%) as well as members of other small pacifist religious groups. \n\nPink triangle – primarily homosexual men and those identified as such (e.g., bisexual men, trans women)and sexual offenders as well as paedophiles and zoophiles.\n\nBlack triangle – people who were deemed asocial elements (asozial) and work-shy (arbeitsscheu), including the following:\nRoma and Sinti. They wore the black triangle with a Z notation (for Zigeuner, meaning Gypsy) to the right of the triangle's point.Male Romani were later assigned a brown triangle. Female Romani were still deemed asocials as they were stereotyped as petty criminals (prostitutes, kidnappers and fortune tellers).\nMentally ill and mentally disabled. Their triangles were inscribed with the word Blöd, meaning stupid.\nAlcoholics and drug addicts.\nVagrants and beggars.\nPacifists and conscription resisters.\nProstitutes.\nLesbians.\n\nBrown triangle – Romani males.\n\nUninverted red triangle – an enemy POW (Sonderhäftling, meaning special detainee), a spy or traitor (Aktionshäftling, meaning activities detainee), or a military deserter or criminal (Wehrmachtsangehöriger, meaning service member).",
                  "timestamp": "2021-11-13 18:44:48",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hkhfw0n",
                  "text": "The answer to that is very complicated. The perceived enemies in the mind of the Alt Right or I call White American Nationalists is a broad spectrum. In their mind like it was in mine everyone is put in generalized buckets. Definitely the Government when it is controlled by the Democrats, Democrat politicians, inner city people, Hollywood, liberal Universities, the mainstream Media, anyone perceived as a illegal alien, the LGBTQ community, the Muslim community, obviously Antifa which not sure how they identify them other than when they clash at protests who are really self described Anarchists. Only a small fraction like the Neo Nazis would consider Jews in this group. \n\nBut you’re right no way to truly identify.",
                  "timestamp": "2021-11-13 18:25:30",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hkedq3k",
          "text": "[I’m your huckleberry ](https://youtu.be/plD1MbOGLfQ)\n\nbeing underestimated gives one a good advantage.",
          "timestamp": "2021-11-13 00:19:02",
          "score": 39,
          "num_children": 2,
          "replies": [
            {
              "id": "hkew0sy",
              "text": "It's a temporary advantage. You gotta hit them as hard as you can before they can get up. Make them actually feel the repercussions of their behavior.",
              "timestamp": "2021-11-13 02:48:58",
              "score": 23,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hkevr1a",
              "text": "Val Kilmer was the best Doc Holiday. I'll die on that hill..",
              "timestamp": "2021-11-13 02:46:42",
              "score": 25,
              "num_children": 1,
              "author": 189580,
              "replies": [
                {
                  "id": "hkf9wc7",
                  "text": "Fitting, because so did Doc Holiday",
                  "timestamp": "2021-11-13 04:54:10",
                  "score": 16,
                  "num_children": 0,
                  "author": 135650,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hkgu7ds",
          "text": "As usual they're divided between people who simply want the rules only to apply to them and the actively malicious who want to burn down the society that did nothing to them but sometimes tell them they didn't have special standing.",
          "timestamp": "2021-11-13 15:50:25",
          "score": 4,
          "num_children": 0,
          "author": 150427,
          "replies": []
        },
        {
          "id": "hkenury",
          "text": "Right? Chuds would start shooting on sight",
          "timestamp": "2021-11-13 01:41:54",
          "score": 12,
          "num_children": 0,
          "author": 208242,
          "replies": []
        },
        {
          "id": "hkfistk",
          "text": "I'm probably going to regret posting this here, but here goes. \n\nAs someone who votes Dem but owns guns, and sees this trial as something people are calling for blood over without actually thinking about the law and the case, it's absolutely crazy to me that anyone on the left would fight against gun rights. \n\nAside from the absolute nutjobs (hint, there really aren't a whole lot of), no one wants a civil war. \n\nAlso, if we take a look at protests where the citizens were armed, vs those that were not, the difference in treatment from the law is staggering. \n\nThe 2nd ammendment is for EVERYONE, and the past few years has shown us that EVERYONE should be exercising their right to the 2nd just as much as we are with the 1st.",
          "timestamp": "2021-11-13 06:31:44",
          "score": 8,
          "num_children": 4,
          "author": 409523,
          "replies": [
            {
              "id": "hkfns1d",
              "text": "Lots of actual gun policy proposals are popular on both sides of the aisle, even amongst conservative gun owners. It's not a matter of being \"against gun rights\", it's that there's a huge amount of middle ground that people agree on but which conservative media paints as being unpopular and extremist.\n\nThat's kind of the way that modern conservative propaganda works in general - make policy ideas seem dangerous and unpopular to keep their base scared enough to fight tooth and nail against pretty much anything, because once something actually passes and turns out not to be the disaster they claimed, they lose an avenue of control.",
              "timestamp": "2021-11-13 07:36:21",
              "score": 20,
              "num_children": 1,
              "author": 10221,
              "replies": [
                {
                  "id": "hkfptri",
                  "text": "The issue here is, the right has historically passed more national gun control legislation than the left has, yet keeps their base yelling at the dems about gun control. \n\nAgain, ill probably regret posting this, but I think we need to repeal the current gun laws, and focus on Healthcare as a means of combating gun violence.",
                  "timestamp": "2021-11-13 08:05:18",
                  "score": 8,
                  "num_children": 2,
                  "author": 409523,
                  "replies": [
                    {
                      "id": "hkh7j6a",
                      "text": "\"Repeal the current gun laws\" is incredibly vague...\n\nThe GOP won't be placated, either, because their goal isn't actually any particular policy but rather whatever power allows them to further corporate interests and control. Giving in to them outright will just embolden them to push harder on other fronts. That's aside from how such a capitulation would undermine the Democrat's own voter base.",
                      "timestamp": "2021-11-13 17:26:26",
                      "score": 2,
                      "num_children": 1,
                      "author": 10221,
                      "replies": [
                        {
                          "id": "hkhj460",
                          "text": "I mean, repeal the current gun laws. Full stop. \n\nIf you think democrats are not also doing whatever they can to further their power and interests, you're in for a rude awakening. Politicians are NOT on our side.",
                          "timestamp": "2021-11-13 18:48:48",
                          "score": 1,
                          "num_children": 1,
                          "author": 409523,
                          "replies": [
                            {
                              "id": "hkhkcm2",
                              "text": "So you think that *literally every law* that has anything to do with guns should be repealed? Almost no one on a national scale actually wants such an outcome, including conservatives, so why would anyone ever do that?\n\nAnd I'm fully aware that the Democrats are doing what they can to further their power and interests, I'm also aware that the GOP is orders of magnitude worse in this regard. The parties aren't even vaguely equivalent to one another, despite lots of corruption existing across the spectrum.",
                              "timestamp": "2021-11-13 18:57:54",
                              "score": 2,
                              "num_children": 1,
                              "author": 10221,
                              "replies": [
                                {
                                  "id": "hkhl2v5",
                                  "text": "Yes, repeal every gun law there is. Start from scratch. Have universal Healthcare be our number one gun control measure. \n\nAside from Trump, I'd argue both sides are equally corrupt.",
                                  "timestamp": "2021-11-13 19:03:14",
                                  "score": -2,
                                  "num_children": 1,
                                  "author": 409523,
                                  "replies": [
                                    {
                                      "id": "hkhnsu2",
                                      "text": "Yeah... starting from scratch isn't how any broad system can ever actually work in practice without enormous problems arising... This is pure fantasy and you haven't actually thought out how this would actually work, especially if implemented *in that order* (before even taking into account that healthcare isn't going to be a cure-all for all potential crime).\n\nThe \"both sides are the same\" argument has always been incredibly weak and reliant on either not/selectively paying attention to details, assuming that all failures to pass policy are purposeful acts of pre-planned sabotage, and/or that even newer progressive members are meaningless.",
                                      "timestamp": "2021-11-13 19:22:42",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 10221,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hkh7h68",
                      "text": "/r/liberalgunowners if you go far enough left you get your guns back :)",
                      "timestamp": "2021-11-13 17:26:03",
                      "score": 1,
                      "num_children": 0,
                      "author": 43602,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hkftfeu",
              "text": ">Aside from the absolute nutjobs (hint, there really aren't a whole lot of), no one wants a civil war. \n\nI was under the impression that being pro civil war was a mainstream republican position. Why do they constantly refer to wanting to do it if it's some obscure wingnut belief?\n\nI think the main difference between how the law treats a protest is left vs right. People who arent far right have been harassed for having guns at protests by cops. \n\nHowever, for exactly these reasons, I think everyone should be arming themselves just like the right have. I think they should practice with guns too. The right has training camps all across the country, the least you can do is spend some time at the shooting range.",
              "timestamp": "2021-11-13 08:57:31",
              "score": 9,
              "num_children": 1,
              "author": 79908,
              "replies": [
                {
                  "id": "hkhi8pq",
                  "text": "Man....wherever you're getting news about training camps and the right having a mainstream belief of civil war, maybe chill a bit on that.",
                  "timestamp": "2021-11-13 18:42:27",
                  "score": 0,
                  "num_children": 1,
                  "author": 409523,
                  "replies": [
                    {
                      "id": "hktvaxb",
                      "text": "As far as training camps go, the base, attomwaffen division are rise above are a few.  I'm not going to bother getting into the various militias.\n\nAs far as calls for civil war, there's elected officials like Trump, Madison Cawthorn, Matt Gaetz, Michael Flynn, Steve King and Marjorie Taylor Greene has said some stuff that seems to allude to it, I suppose you could argue against that, but when you consider the environment it seems like the only thing they could be talking about. There's a reason Ben Shapiros weird cringy wish fulfilment novel was about someone joining a terrorist militia.",
                      "timestamp": "2021-11-16 07:51:47",
                      "score": 1,
                      "num_children": 1,
                      "author": 79908,
                      "replies": [
                        {
                          "id": "hktvbk8",
                          "text": "I saw that you mentioned Ben Shapiro. In case some of you don't know, Ben Shapiro is a grifter and a hack. If you find anything he's said compelling, you should keep in mind he also says things like this:\n\n>Since nobody seems willing to state the obvious due to cultural sensitivity... I’ll say it: rap isn’t music\n\n\n*****\n\n^(I'm a bot. My purpose is to counteract online radicalization. You can summon me by tagging thebenshapirobot. Options: healthcare, civil rights, sex, feminism, etc.)\n\n\n\n[^More ^About ^Ben ](https://np.reddit.com/r/AuthoritarianMoment/wiki/index) ^| [^Feedback ^& ^Discussion: ^r/AuthoritarianMoment ](https://np.reddit.com/r/AuthoritarianMoment) ^| [^Opt ^Out ](https://np.reddit.com/r/AuthoritarianMoment/comments/olk6r2/click_here_to_optout_of_uthebenshapirobot/)",
                          "timestamp": "2021-11-16 07:52:00",
                          "score": 2,
                          "num_children": 0,
                          "author": 280326,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hkfur0w",
              "text": "I don't want to remove guns from everyone, I would just like a bit of gun control, personally.  If you say you want everyone to be able to purchase a gun, then that includes ex-felons getting out of prison for attempted murder on their ex-wives to be able to go to any store and purchase one and try to finish the job.  I don't think that's unreasonable to want to prevent that.  If you prove to not be able to use a gun responsibly or you're too young, guns should be off limits for you.\n\nI think most people who own guns are responsible gun owners, *including* conservatives. That is to say, they might keep a gun on them, but it is unloaded or at least with the safety on and behind a safe under lock and key.\n\nPeople get these wild slippery slope dystopian fantasies where if we check if a person is a felon before giving them a gun, next week we'll be breaking into their houses and forcing everyone to give up their weapons.  That is most definitely not what I want, and I think most on the left wouldn't want that as well.\n\nThat said, owning a gun assumes the owner is responsible.  What happens if Trump on live TV says the right will wage war against the left and to kill your liberal neighbors?  40% have said they are willing to resort to violence if need-be to \"make things right\" for this past election.  The fact that we all have guns is a literal nightmare waiting to happen on the scale of \"The Purge\".  Even if 5% of that 40% willing to resort to violence actually commits acts of violence, the country is on its knees.\n\nAt the very least, we need to ensure the crazies don't get guns..",
              "timestamp": "2021-11-13 09:17:14",
              "score": 6,
              "num_children": 0,
              "author": 201921,
              "replies": []
            },
            {
              "id": "hkfo8ld",
              "text": "Exactly. \n\nI’m not a liberal by any means, but I am a ultra anti religious Nationalist. Whether it is Christian Nationalist or a sharia law islamist. \n\nJust like Russia and China are kept in check because we all have nukes. \n\nThe one thing people on the left or ultra left need to realize, Guns are not going away, there is 130 million gun owners , that own 393 million firearms in circulation. \n\nThe US Government will never be able to disarm that many gun owners. Even if you tasked every single police officer, Federal law enforcement agent, the US military and National Guard that number combined is less than 3.5 million to disarm 130 million gun owners. That is just the logistical part of it. Not including what it takes to get rid of a constitutional Amendment from a law perspective.",
              "timestamp": "2021-11-13 07:42:52",
              "score": -10,
              "num_children": 4,
              "replies": [
                {
                  "id": "hkfri2x",
                  "text": ">Just like Russia and China are kept in check because we all have nukes.\n\ndafuq",
                  "timestamp": "2021-11-13 08:29:17",
                  "score": 7,
                  "num_children": 0,
                  "author": 174550,
                  "replies": []
                },
                {
                  "id": "hkgb83w",
                  "text": "So what you’re essentially saying here is that mutually assured destruction is a sound basis to build a society on. Wow.",
                  "timestamp": "2021-11-13 13:02:52",
                  "score": 4,
                  "num_children": 1,
                  "author": 132389,
                  "replies": [
                    {
                      "id": "hkgjfui",
                      "text": "I didn’t say it was right. As long as there are selfish evil greedy narcissistic men and Woman in this world there needs to be a deterrent. The wicked prey on the defenseless \n\nA thief does not plan to break into a house that has a lethal defense whether the owner is armed, or has a dog or whatever.",
                      "timestamp": "2021-11-13 14:22:35",
                      "score": -4,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hkgm2mt",
                  "text": "jingoist bullshit, mate. that's what you're on about with all the nuke nonsense",
                  "timestamp": "2021-11-13 14:45:24",
                  "score": 3,
                  "num_children": 1,
                  "author": 201611,
                  "replies": [
                    {
                      "id": "hkgmtdz",
                      "text": "Go away Jason.",
                      "timestamp": "2021-11-13 14:51:43",
                      "score": -2,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "hkgnybz",
                          "text": "No, you, Major",
                          "timestamp": "2021-11-13 15:01:16",
                          "score": 2,
                          "num_children": 0,
                          "author": 201611,
                          "replies": []
                        },
                        {
                          "id": "hkgo1tu",
                          "text": "i do really like your username, though. it's pretty damn good",
                          "timestamp": "2021-11-13 15:01:58",
                          "score": 1,
                          "num_children": 1,
                          "author": 201611,
                          "replies": [
                            {
                              "id": "hkgol1k",
                              "text": "Reddit picked it. \n\nIt wouldn’t let me have Fuck off Trump.",
                              "timestamp": "2021-11-13 15:06:20",
                              "score": 2,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hkme0mk",
                  "text": "280M gun owners would be 85% of Americans. Gallup says it's only 32%.\n\nhttps://news.gallup.com/poll/264932/percentage-americans-own-guns.aspx",
                  "timestamp": "2021-11-14 19:04:59",
                  "score": 2,
                  "num_children": 1,
                  "author": 236550,
                  "replies": [
                    {
                      "id": "hkmffu3",
                      "text": "You are correct , the statistic I found was 130 million with 393 million in circulation. I edited my comment, not into spreading disinformation.",
                      "timestamp": "2021-11-14 19:13:34",
                      "score": 2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hkpirxt",
                          "text": "Thank you.",
                          "timestamp": "2021-11-15 11:32:09",
                          "score": 1,
                          "num_children": 0,
                          "author": 236550,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hkgm3ds",
          "text": "And they know which side the cops will side with each time.",
          "timestamp": "2021-11-13 14:45:35",
          "score": 1,
          "num_children": 0,
          "author": 158115,
          "replies": []
        }
      ]
    },
    {
      "id": "hkex5ak",
      "text": "“No, cuz that’s..like..different” -trump trash",
      "timestamp": "2021-11-13 02:58:28",
      "score": 37,
      "num_children": 0,
      "author": 194894,
      "replies": []
    },
    {
      "id": "hkem7pc",
      "text": "Of course the alt-right, gun toting vigilantes are not OK with that. They are the ones who are \"allowed\" to carry assault weapons. They are the true self-appointed militia after all. /s",
      "timestamp": "2021-11-13 01:28:22",
      "score": 77,
      "num_children": 2,
      "author": 252900,
      "replies": [
        {
          "id": "hkf7yny",
          "text": "No, I think they really do want the left to shoot back. It’ll give them justification for the civil war they want so badly. It’s all accelerationism.",
          "timestamp": "2021-11-13 04:34:56",
          "score": 56,
          "num_children": 3,
          "author": 308801,
          "replies": [
            {
              "id": "hkftguj",
              "text": "It's like the left and the right have gone rock climbing, and the right not only slipped, they purposefully let go and the left is the only one keeping both of them from falling into the abyss below.  \n\nStart carrying your weight, conservatives.  Trust me, you may think you want civil war, but you will change your opinion once it begins.  War is hell, and if that's what ultimately comes from it, don't think I won't arm myself.",
              "timestamp": "2021-11-13 08:58:06",
              "score": 14,
              "num_children": 0,
              "author": 201921,
              "replies": []
            },
            {
              "id": "hkfxnjg",
              "text": ">No, I think they really do want the left to shoot back. It’ll give them justification for the civil war they want so badly.\n\nOnly in the pathetic excuse for a brain that lies in the skull of a conservative could that be a justification, when they're the ones who shot first (literally).",
              "timestamp": "2021-11-13 10:00:49",
              "score": 5,
              "num_children": 0,
              "author": 294866,
              "replies": []
            },
            {
              "id": "hkgytdv",
              "text": "They might think they do, but they're all cowards. Look how quickly the chuds scattered when one of them got shot at the capitol. Look at how the [proud boys piss their pants and pile into their pickup truck](https://i.redd.it/lfemgci2b4g71.jpg) for a quick retreat as soon as they encounter the least resistance.",
              "timestamp": "2021-11-13 16:24:15",
              "score": 5,
              "num_children": 0,
              "author": 26699,
              "replies": []
            }
          ]
        },
        {
          "id": "hkg4koh",
          "text": "you mean “ OF COUURSEEEEEE”",
          "timestamp": "2021-11-13 11:41:13",
          "score": 3,
          "num_children": 0,
          "author": 281805,
          "replies": []
        }
      ]
    },
    {
      "id": "hkf1wzg",
      "text": "That kid is messed up: left or right ( politically), if you can't see that, there is something seriously wrong with you.\n\nMy take is he saw himself as \"heroic\", vigilante figure who thought it would be \"cool\" to kill any law breakers, and he was clearly looking for *any* opportunity.\n\nThe party of \"Law&Order\", doesn't seem to realize whole point of police system is to have trained, physically *and* mentally, people who are more capable of handling these situations, in a way that doesn't further more violence. And especially not leave it in hands of teenagers.\n\nTwo weeks prior he even said how he'd love to kill some petty shoplifters..I work/ed as security guard in similar situations and never caught myself thinking: \"*Wouldn't it be wonderful if I could just* ***kill*** *them\".*\n\nAnd that PTSD breakdown ( I think some people are deluding themselves by thinking he's faking it) is what happens when they realize real life violence is a bit different than killing npcs in a video game.",
      "timestamp": "2021-11-13 03:39:56",
      "score": 56,
      "num_children": 2,
      "author": 110290,
      "replies": [
        {
          "id": "hkfo40d",
          "text": "They should have charged him (and the others in his group) with acting as unlicensed security, since that's the thing that was actually the root of the sequence of events and is what the state would presumably want to prevent.",
          "timestamp": "2021-11-13 07:41:03",
          "score": 7,
          "num_children": 0,
          "author": 10221,
          "replies": []
        },
        {
          "id": "hkfc2zn",
          "text": "Except the mature adults in this situation left it to the teenagers… because as it turns out, our law enforcement is woefully inadequate in both maturity and procedural training. \n\nThis is what we get when we think 55-60k per year for people tasked with upholding law and order is adequate payment. \n\nWe get the dude who was a pissed off ex high school football star.",
          "timestamp": "2021-11-13 05:16:23",
          "score": 24,
          "num_children": 1,
          "author": 210335,
          "replies": [
            {
              "id": "hkfhjzh",
              "text": "True, but with promotions, overtime, holiday pay, and skimming off the drug dealer piles, most of them make 100k plus.",
              "timestamp": "2021-11-13 06:16:48",
              "score": 13,
              "num_children": 1,
              "author": 101920,
              "replies": [
                {
                  "id": "hkfi9wk",
                  "text": "Which reinforces the point lol. \n\nYou don’t pay them enough to not do bullshit, they’ll resort to bullshit to make up the pay they feel they’re owed.\n\nI personally believe that a fully trained beat-cop should be making 75k, full bennies, at a minimum. Hell, I’d consider the role if that was the base pay.\n\nI would feel personally more comfortable knowing I had people being paid 100k+, but were absolutely qualified, versus “fuck it cheeks in the seats,” attitude going on now, for pennies on the dollar.",
                  "timestamp": "2021-11-13 06:25:24",
                  "score": 2,
                  "num_children": 2,
                  "author": 210335,
                  "replies": [
                    {
                      "id": "hkfizw7",
                      "text": "You’re point is correct in the sense that people should be paid well for the jobs that they manage. I would argue that our current system of capitalism doesn’t recognize that. How would we determine the basis of well trained? How do we factor in their necessity? Just rambling but I feel like it’s food for thought.",
                      "timestamp": "2021-11-13 06:34:08",
                      "score": 5,
                      "num_children": 1,
                      "author": 239144,
                      "replies": [
                        {
                          "id": "hkfjnil",
                          "text": "Of course those are great questions, and it’s hard to say how public metrics should be accounted for versus say an individual at a private firm. \n\nSo for an officer, I don’t know what the current “metrics,” are. I’m sure it varies wildly jurisdiction to jurisdiction, which makes it difficult to really give a quality score to individual officers and even individual precincts. Beyond that, if the metrics were standardized they would be unfair for different demographics. Downtown Los Angeles will be a different situation than rural Alabama. So clearly even standards would need to be unique to different situations. \n\nBasically, there’s a ton of nuance and a lot of armchair generals. We need to focus on opening our minds as a society, rather than doubling down on preconceived notions.",
                          "timestamp": "2021-11-13 06:42:15",
                          "score": 2,
                          "num_children": 0,
                          "author": 210335,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hkfv2gs",
                      "text": "There is reason to believe that no money in the world is able to end corruption. I mean look at politicians, they have already more than enough and still partake in corruption.\n\nMany jobs that don't generate more money should still be payed adequatly but the problems with police go much much further than that. Don't you think that a major reason for the corruption in the police force is due to the non existence of consequences as well as the far right infiltrating those branches ?",
                      "timestamp": "2021-11-13 09:21:52",
                      "score": 2,
                      "num_children": 1,
                      "author": 157417,
                      "replies": [
                        {
                          "id": "hkhcnab",
                          "text": "I think that’s one factor, among many, yes.",
                          "timestamp": "2021-11-13 18:02:27",
                          "score": 1,
                          "num_children": 0,
                          "author": 210335,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hkfcpfb",
      "text": "Clearly not because Daniel Baker, a guy advocating for an armed counter-protest in *defense* of the government in Florida, was arrested and sentenced to 44 months in prison.",
      "timestamp": "2021-11-13 05:22:45",
      "score": 16,
      "num_children": 0,
      "author": 112035,
      "replies": []
    },
    {
      "id": "hkezwd2",
      "text": "Stop trying to trap them with logic.\n\nThey don't care.",
      "timestamp": "2021-11-13 03:22:07",
      "score": 22,
      "num_children": 1,
      "author": 306904,
      "replies": [
        {
          "id": "hkj26rs",
          "text": "how is this a trap? the answer to his question is yes. wheres the trap?",
          "timestamp": "2021-11-14 01:24:59",
          "score": 0,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hkesbaz",
      "text": "💯",
      "timestamp": "2021-11-13 02:18:26",
      "score": 8,
      "num_children": 0,
      "author": 379809,
      "replies": []
    },
    {
      "id": "hkf33nq",
      "text": "Based Uncle",
      "timestamp": "2021-11-13 03:50:19",
      "score": 6,
      "num_children": 0,
      "author": 276396,
      "replies": []
    },
    {
      "id": "hkfgo9f",
      "text": "Because that worked well for Daniel Baker.\n\nDon’t get me wrong: I’d love to see hoards of armed anti-fascists turn up to counter protest. But these white supremacists are itching for the opportunity to empty every single magazine on their kit at the slightest sign of one of us attempting to defend ourselves. They’ve been bloodlusting for a very long time and it has only increased with each passing year.",
      "timestamp": "2021-11-13 06:06:14",
      "score": 7,
      "num_children": 1,
      "author": 144451,
      "replies": [
        {
          "id": "hkgzb23",
          "text": "If they encountered any armed opposition they wouldn't be emptying anything but their [bladders](https://i.redd.it/lfemgci2b4g71.jpg).",
          "timestamp": "2021-11-13 16:27:50",
          "score": 2,
          "num_children": 0,
          "author": 26699,
          "replies": []
        }
      ]
    },
    {
      "id": "hkfxg9x",
      "text": "Cenk is _against it?_ \n\nPersonally, I'm in favour of conservatives meeting the consequences of their actions as soon as possible. And if that means things go down a certain way... so be it. 🐸☕",
      "timestamp": "2021-11-13 09:57:42",
      "score": 7,
      "num_children": 1,
      "author": 294866,
      "replies": [
        {
          "id": "hkh3k9s",
          "text": "I don't understand why a leftist would be against self defense?",
          "timestamp": "2021-11-13 16:58:39",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hkif85k",
              "text": "Cenk isn’t really a leftist. He’s progressive and much more so than in the past but still very much a convinced capitalist democrat. It makes sense that he has this take. \n(BTW I’m not trying to pull a *he‘s not a true leftist* here)",
              "timestamp": "2021-11-13 22:37:18",
              "score": 2,
              "num_children": 0,
              "author": 13259,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hkfyegk",
      "text": "[removed]",
      "timestamp": "2021-11-13 10:12:15",
      "score": 8,
      "num_children": 1,
      "replies": [
        {
          "id": "hkgg1uo",
          "text": "All for it, till it turns into a semi-civil war which we, at the moment, could not win.",
          "timestamp": "2021-11-13 13:51:55",
          "score": 2,
          "num_children": 1,
          "author": 321403,
          "replies": [
            {
              "id": "hkgntun",
              "text": "[deleted]",
              "timestamp": "2021-11-13 15:00:17",
              "score": 0,
              "num_children": 1,
              "replies": [
                {
                  "id": "hkgpd71",
                  "text": "Har har",
                  "timestamp": "2021-11-13 15:12:35",
                  "score": 1,
                  "num_children": 1,
                  "author": 321403,
                  "replies": [
                    {
                      "id": "hkhta1b",
                      "text": "Well fuck you too then. Looks like _you_ won’t be getting access to one. Not for free, not for sale. You’ve forfeited that chance.",
                      "timestamp": "2021-11-13 20:01:55",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hkfoahd",
      "text": "I pointed that out to someone earlier and they said it was a “straw man.” Lol ok. But then I went in their comment history and they’re a full-blown COVID conspiracy theorist.",
      "timestamp": "2021-11-13 07:43:36",
      "score": 6,
      "num_children": 1,
      "author": 239862,
      "replies": [
        {
          "id": "hkgkxr6",
          "text": "\"straw man\" = pseudo-intellectual redditors' favorite term to throw around in debates they know they can't win",
          "timestamp": "2021-11-13 14:35:33",
          "score": 2,
          "num_children": 0,
          "author": 201611,
          "replies": []
        }
      ]
    },
    {
      "id": "hkesv72",
      "text": "I love Cenk. Idgaf what anyone says.",
      "timestamp": "2021-11-13 02:22:56",
      "score": 31,
      "num_children": 3,
      "author": 203081,
      "replies": [
        {
          "id": "hkfbsun",
          "text": "He has his moments where I’m like “ok man, dial that one back,” but overall I’d say 95% of the time I’m with him.",
          "timestamp": "2021-11-13 05:13:25",
          "score": 15,
          "num_children": 1,
          "author": 210335,
          "replies": [
            {
              "id": "hkfl607",
              "text": "I mean he was really the brains behind Justice Democrats. In 2018 the work of Justice Democrats led to the election of 7 current congresspersons, including AOC, Omar, Tlaib, Pressley and Khanna.",
              "timestamp": "2021-11-13 07:01:30",
              "score": 10,
              "num_children": 0,
              "author": 203081,
              "replies": []
            }
          ]
        },
        {
          "id": "hkf35r9",
          "text": "Cenk gang rise up!",
          "timestamp": "2021-11-13 03:50:51",
          "score": 13,
          "num_children": 0,
          "author": 276396,
          "replies": []
        },
        {
          "id": "hkg5265",
          "text": "I voted for him. He lost my district by a lot unfortunately.",
          "timestamp": "2021-11-13 11:47:50",
          "score": 1,
          "num_children": 0,
          "author": 223016,
          "replies": []
        }
      ]
    },
    {
      "id": "hkfgnl7",
      "text": "That’s already happen. Tiny got shot.",
      "timestamp": "2021-11-13 06:06:00",
      "score": 4,
      "num_children": 0,
      "author": 384550,
      "replies": []
    },
    {
      "id": "hkfmlm0",
      "text": "I suspect they're depending on bias within the legal system. The police unions are closely aligned with the transnational white power movement of which MAGA and QAnon and Proud Boys are a part, and they're hoping that Antifa will be shot by law enforcement or arrested where their own people will not. In Portland there have been a _lot_ of reports of harassment and violence by Proud Boys to which the City of Portland Police Bureau have turned a blind eye.\n\nBLM is adhering closely to a pacifistic doctrine similar to the strategy used by Dr. Martin Luther King Jr. but there are black militants such as the [NFAC](https://en.wikipedia.org/wiki/Not_Fucking_Around_Coalition) that may interpret Rittenhouse' acquittal to adjust their own rules of engagement.",
      "timestamp": "2021-11-13 07:20:25",
      "score": 4,
      "num_children": 0,
      "author": 264568,
      "replies": []
    },
    {
      "id": "hkf04ow",
      "text": "I'd love to see socialists show up to right wing protests armed to the teeth. Nothing would make me happier. Show those right wing fucks we wont be bullied into submission. But the right wingers also are allowed to do the same. The same laws SHOULD apply equally to everyone.",
      "timestamp": "2021-11-13 03:24:08",
      "score": 22,
      "num_children": 1,
      "replies": [
        {
          "id": "hkfc9bp",
          "text": "They claim the left is simultaneously weak soyboy snowflakes living in moms basement, but also some “blac-block” capable of upending the world as we know it via Antifa overrunning every metro area. \n\nWhich is it?!?",
          "timestamp": "2021-11-13 05:18:13",
          "score": 24,
          "num_children": 1,
          "author": 210335,
          "replies": [
            {
              "id": "hkfkjad",
              "text": "Ah, the classic fascist tactic of the enemy being overwhelming powerful and pathetically weak at the same time.",
              "timestamp": "2021-11-13 06:53:23",
              "score": 18,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hkf2ow1",
      "text": "[deleted]",
      "timestamp": "2021-11-13 03:46:40",
      "score": 9,
      "num_children": 1,
      "replies": [
        {
          "id": "hkfu1s2",
          "text": "Hopefully we can get some libs onto the left",
          "timestamp": "2021-11-13 09:06:43",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hkfwtta",
      "text": "Literally yes",
      "timestamp": "2021-11-13 09:48:17",
      "score": 3,
      "num_children": 0,
      "author": 80740,
      "replies": []
    },
    {
      "id": "hkg0gmr",
      "text": "There was the one antifa guy that did the same as Rittenhouse but he was shot by the feds under suspicious circumstances circumstances.",
      "timestamp": "2021-11-13 10:42:51",
      "score": 3,
      "num_children": 0,
      "author": 72631,
      "replies": []
    },
    {
      "id": "hkgdg5j",
      "text": "I find it interesting that a lot of his defenders are using the criminal records of those he shot as a reason why it was fine. It's so akin to \"Floyd was no hero. He was a career criminal.\" Those things can be true while it's also no ok to take a gun to a protest and manage to be the only person to find your way into a life threatening situation that requires bullets to solve. Bullets you conveniently brought with you.",
      "timestamp": "2021-11-13 13:26:10",
      "score": 3,
      "num_children": 1,
      "author": 46762,
      "replies": [
        {
          "id": "hkgmf8j",
          "text": "Yeah, like… his victims were both reformed cons. In a past life they did things due to psychological issues, but those things have been proven curable. And they were. Those two that were killed were there that night defending freedom from the fash that came to disturb shit. And a third, their friend (from one of the initial stories I read that night), was also shot but luckily survived. \n\nKyle needs to be executed for his crimes, the same as that other white supremacist (the one recently given the death sentence). He took two lives, meaning to take them, while meaning to cause terror and harm freedom-seeking citizens of the Earth.",
          "timestamp": "2021-11-13 14:48:20",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hkg3e75",
      "text": "\"Your proposal is acceptable.\"",
      "timestamp": "2021-11-13 11:25:01",
      "score": 2,
      "num_children": 0,
      "author": 202099,
      "replies": []
    },
    {
      "id": "hkgg92h",
      "text": "Yes",
      "timestamp": "2021-11-13 13:53:46",
      "score": 2,
      "num_children": 0,
      "author": 271847,
      "replies": []
    },
    {
      "id": "hkh96ps",
      "text": "RWNJs literally ~~jack off~~ brick in their boxers thinking about this exact scenario.",
      "timestamp": "2021-11-13 17:37:55",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "hkh99jn",
          "text": "Cum",
          "timestamp": "2021-11-13 17:38:28",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hkfq2bo",
      "text": "The thing is that doesn’t scare them because they know it doesn’t work that way. If a black teen went to Charlottesville, for example, brandishing a weapon. And if one of those racists got angry at him, and he shot the white racist. The black teen would either have been killed by the crowd or a police officer. But if he survived to be arrested he would almost definitely get life in prison or the death penalty. No matter how much it may or may not have been self defense.",
      "timestamp": "2021-11-13 08:08:39",
      "score": 5,
      "num_children": 0,
      "author": 207146,
      "replies": []
    },
    {
      "id": "hkh6duw",
      "text": "I don't support anyone being heavily armed at a riot. It is moronic.\n\nThat being said, if person A provokes person B to the extent that person A feels they present an imminent and credible threat to their life and this can be determined in court, person A would be legally absolved from a murder charge upon shooting them.\n\nIf someone began chasing me unprovoked during a midnight riot and then lunged for my firearm, I think it is reasonable to assume in the moment that they present a credible threat to my life.\n\nIt is down to the prosecution to show that either Rosembaum did not present such a threat or that Rittemhouse goaded him into chasing him. Neither has been demonstrated. Rittenhouse is going to walk on homicide, without a doubt, as he should.",
      "timestamp": "2021-11-13 17:18:28",
      "score": -2,
      "num_children": 0,
      "author": 93980,
      "replies": []
    },
    {
      "id": "hkg3z0s",
      "text": "Ummm, I just want to point out there's a slight difference between provocation and deadly assault. Just saying.",
      "timestamp": "2021-11-13 11:32:59",
      "score": -7,
      "num_children": 0,
      "author": 378992,
      "replies": []
    },
    {
      "id": "hkft4t6",
      "text": "This cases outcome may teach people that it’s ok to use any weapon, that you may own or be carrying illegally, to kill someone you don’t know personally as long as it falls in the vague area of “self defense”.",
      "timestamp": "2021-11-13 08:53:10",
      "score": 1,
      "num_children": 0,
      "author": 206962,
      "replies": []
    },
    {
      "id": "hkg0obc",
      "text": "I think that's fair, the more under privileged individuals take up arms and display force passively, the better chances they have of being respected in the USA. It's the only language the intolerant listen to, and if they're practicing proper gun discipline, they would have no just complaint! Alternatively, perhaps it would trigger an increase in gun law reform and lead to people not being able to open carry automatic weapons. I'm no accelarationist, but it does appear there needs to be something the greater public does to resist against the bigoted vocal minority no? At the very least, being a presence and being in direct opposition to conservatism and \"traditional\" values would have more of an effect than bravely walking the picket line hoping that cops or white nationalists don't declare you a traitor and open fire.",
      "timestamp": "2021-11-13 10:46:03",
      "score": 1,
      "num_children": 0,
      "author": 142321,
      "replies": []
    },
    {
      "id": "hkgh0ng",
      "text": "I think they would like that. Give it a try.",
      "timestamp": "2021-11-13 14:00:55",
      "score": 1,
      "num_children": 0,
      "author": 202793,
      "replies": []
    },
    {
      "id": "hkguym2",
      "text": "fuck cenk but hes right on this",
      "timestamp": "2021-11-13 15:56:07",
      "score": 1,
      "num_children": 0,
      "author": 241502,
      "replies": []
    },
    {
      "id": "hkh3n5o",
      "text": "Good take buy Cenk is ehhhhh not so good",
      "timestamp": "2021-11-13 16:59:15",
      "score": 1,
      "num_children": 0,
      "author": 304115,
      "replies": []
    },
    {
      "id": "hkh4eyv",
      "text": "That is exactly what I believe though. I believe everyone has the right to defend themselves when threatened so while it isn’t a good idea to end up at a protest with a gun but if you happen to be in that situation and someone attacks you you shouldn’t allow yourself to die.\n\nIf I had been at the Jan 6 insurrection as a counter rioter with a gun and some maga hat dude pointed a gun at me I would definitely shoot him before allowing myself to be shot",
      "timestamp": "2021-11-13 17:04:36",
      "score": 1,
      "num_children": 0,
      "author": 212038,
      "replies": []
    },
    {
      "id": "hkh4o27",
      "text": "Balkanization of the USA only serves the goals of our foreign adversaries",
      "timestamp": "2021-11-13 17:06:23",
      "score": 1,
      "num_children": 0,
      "author": 69756,
      "replies": []
    },
    {
      "id": "hkhjjga",
      "text": "THANKS FOR WATCHING YOUNG TURKS. REALLY APPRECIATE IT. ANOTHER WAY TO SUPPORT US IS THROUGH YOUTUBE MEMBERSHIPS. YOU GET EMOJIS…\n\ndon’t hate TYT. \n\nJust hate the closing message on every video. Drives me crazy.",
      "timestamp": "2021-11-13 18:51:51",
      "score": 1,
      "num_children": 0,
      "author": 12917,
      "replies": []
    },
    {
      "id": "hkhoi86",
      "text": "Rittenhouse was looking for a fight, he showed up with a gun, he started that shit, he might walk because he is claiming self defense for a fight he started. A shooting that made him famous with his white Supremacist friends. \n\nI have been saying for awhile, that if ANTIFA (whatever that really is) and minorities started showing up fully armed to all of their rallies, Congress would pass Gun Control legislation the next day.",
      "timestamp": "2021-11-13 19:27:49",
      "score": 1,
      "num_children": 0,
      "author": 242413,
      "replies": []
    },
    {
      "id": "hkk0h7b",
      "text": "I'm totally cool with that!!! If someone attacks another no matter their political ideals should be legally allowed to defend themselves.",
      "timestamp": "2021-11-14 06:02:20",
      "score": 1,
      "num_children": 0,
      "author": 251861,
      "replies": []
    },
    {
      "id": "hkt5cdf",
      "text": "Is this an invitation to war?",
      "timestamp": "2021-11-16 03:30:31",
      "score": 1,
      "num_children": 0,
      "author": 320305,
      "replies": []
    },
    {
      "id": "hkt5fuv",
      "text": "Do it. Laughs will no doubt ensue.",
      "timestamp": "2021-11-16 03:31:17",
      "score": 1,
      "num_children": 1,
      "author": 320305,
      "replies": [
        {
          "id": "hkt5sil",
          "text": "Do what? Same shit your kind does? Show up at protests Armed to intimidate people?",
          "timestamp": "2021-11-16 03:34:03",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hkudxmi",
      "text": "When someone not from the far right does it, the US Marshals send a hit squad.\n\nhttps://www.nytimes.com/2020/10/13/us/michael-reinoehl-antifa-portland-shooting.html",
      "timestamp": "2021-11-16 12:02:11",
      "score": 1,
      "num_children": 0,
      "author": 184533,
      "replies": []
    },
    {
      "id": "hlwyvzf",
      "text": "personally I support arming the poor and keeping eachother safe with everything going on but i know thats a rather unpopular opinion on the left. after this bullshit though we gotta be cautious",
      "timestamp": "2021-11-24 16:16:30",
      "score": 1,
      "num_children": 0,
      "author": 244699,
      "replies": []
    },
    {
      "id": "hkemrcx",
      "text": "Cenk is right about this. He’s also a racist Armenian genocide denier, so fuck him.",
      "timestamp": "2021-11-13 01:32:48",
      "score": -56,
      "num_children": 4,
      "author": 21471,
      "replies": [
        {
          "id": "hkesx0x",
          "text": "Demonstrably false. Lmao.",
          "timestamp": "2021-11-13 02:23:20",
          "score": 29,
          "num_children": 0,
          "author": 203081,
          "replies": []
        },
        {
          "id": "hkfcd6y",
          "text": "Bro, I’m not a die hard Cenk fan, but you’re so wrong it’s hilariously stupid. You read an article once and stuck with it. Go get learnt.",
          "timestamp": "2021-11-13 05:19:17",
          "score": 15,
          "num_children": 1,
          "author": 210335,
          "replies": [
            {
              "id": "hkg9kpb",
              "text": "His show is literally named after the architects of the Armenian genocide. He may have finally come around to admitting he was wrong, but seriously. Would you be defending a former neo-nazi who admits they were wrong but still runs a podcast called “the third reich”?",
              "timestamp": "2021-11-13 12:44:34",
              "score": -4,
              "num_children": 0,
              "author": 21471,
              "replies": []
            }
          ]
        },
        {
          "id": "hkfklsp",
          "text": "Nice propaganda you’ve got there mate.",
          "timestamp": "2021-11-13 06:54:15",
          "score": 12,
          "num_children": 1,
          "replies": [
            {
              "id": "hkg9dvx",
              "text": "Until somewhat recently, this was true (someone linked a video I had not previously seen). Still, his show is named after the architects of the Armenian genocide.",
              "timestamp": "2021-11-13 12:42:22",
              "score": -4,
              "num_children": 1,
              "author": 21471,
              "replies": [
                {
                  "id": "hkgxdpz",
                  "text": "More fake news BS. Yawn.",
                  "timestamp": "2021-11-13 16:13:46",
                  "score": 3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hkgzi9h",
                      "text": "Fake news that the Young Turks (the political group, not the show) orchestrated the Armenian genocide?",
                      "timestamp": "2021-11-13 16:29:18",
                      "score": 0,
                      "num_children": 0,
                      "author": 21471,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hkeqdqr",
          "text": "Why do people keep spreading this lie? He denounced his conservatives views on the Armenian genocide years ago, more than once.\n\nhttps://youtu.be/KI2aZBe3MCY",
          "timestamp": "2021-11-13 02:02:41",
          "score": 49,
          "num_children": 1,
          "author": 245078,
          "replies": [
            {
              "id": "hkg8o5k",
              "text": "Ok. This is the first time I’ve seen him clearly state that it was a genocide, because just a few years ago he defended his college paper. \n\nNow, why hasn’t he renamed the show? It’s tantamount to saying that you think slavery is bad after years of arguing for slavery and having a show called “The Confederacy”.",
              "timestamp": "2021-11-13 12:33:48",
              "score": -6,
              "num_children": 0,
              "author": 21471,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hkfatbo",
      "text": "[removed]",
      "timestamp": "2021-11-13 05:03:25",
      "score": -31,
      "num_children": 3,
      "replies": [
        {
          "id": "hkfcrt9",
          "text": "Basic premise: if he never showed up, carrying a gun he wasn’t legally allowed to carry, would any of this have happened? \n\nRosenbaum was an ass. Nobody doubts that. Shady past, not a good dude. But if Kyle wasn’t there, and someone else was, would this whole even have even taken place?\n\nRational people can see that Kyle, and his actions, caused this. The first person he shot was unarmed. Period. This is established by Kyle himself. He had no reason to fear for his life, yet he took a life. The subsequent events only existed because of what HE did. \n\nSo, to summarize, fuck you. Sympathizing with a murderer. \n\nWhat if I showed up to your place of business, with no reason or vested interest, and just stood outside with a gun deciding who was a threat or not? You’d kick me out in two fucking seconds. Why does Kyle get a pass? Because he’s a sobbing piece of shit? Fuck that. He killed people. People are DEAD because of HIS actions, period.",
          "timestamp": "2021-11-13 05:23:27",
          "score": 34,
          "num_children": 0,
          "author": 210335,
          "replies": []
        },
        {
          "id": "hkfujwu",
          "text": "This is not what anyone is saying. The question is if you are fine with Antifaschists doing the exact same thing.",
          "timestamp": "2021-11-13 09:14:20",
          "score": 4,
          "num_children": 0,
          "author": 157417,
          "replies": []
        },
        {
          "id": "hkfkpee",
          "text": "Way to defend a murderer there mate. How’s it feel to lick Nazi boot?",
          "timestamp": "2021-11-13 06:55:32",
          "score": 9,
          "num_children": 0,
          "replies": []
        }
      ]
    }
  ]
}