{
  "id": "qvcbx3",
  "text": "As easy as that\n",
  "timestamp": "2021-11-16 16:57:48",
  "score": 4039,
  "subreddit": "t5_3fdcn",
  "num_children": 29,
  "author": 398010,
  "replies": [
    {
      "id": "hkvftuq",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2021-11-16 16:57:48",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "hkw6nu4",
      "text": "I want to thank you for all the users I was able to block.  My front page just got significantly more relevant.",
      "timestamp": "2021-11-16 19:52:38",
      "score": 123,
      "num_children": 1,
      "author": 228409,
      "replies": [
        {
          "id": "hkxnnch",
          "text": "[removed]",
          "timestamp": "2021-11-17 02:01:28",
          "score": 22,
          "num_children": 2,
          "replies": [
            {
              "id": "hkxubzb",
              "text": "Behold the 12 nationalities man!",
              "timestamp": "2021-11-17 02:50:31",
              "score": 7,
              "num_children": 0,
              "author": 314426,
              "replies": []
            },
            {
              "id": "hkxq0ky",
              "text": "This isn’t the America that was advertised using all those lies presented in our youth.  It’s like watching your teenager break your heart.",
              "timestamp": "2021-11-17 02:18:44",
              "score": 9,
              "num_children": 1,
              "author": 228409,
              "replies": [
                {
                  "id": "hky3p5w",
                  "text": "We definitely have to find a way to take it into our own hands and reclaim America to be what it was advertised to be. Otherwise things will only continue to get worse. As impossible as that task may seem…",
                  "timestamp": "2021-11-17 04:03:39",
                  "score": -3,
                  "num_children": 1,
                  "author": 331996,
                  "replies": [
                    {
                      "id": "hkzcu1y",
                      "text": "Oh yes king, bring us back to the 1900’s when robber barons ruled the world and people threw shit into the streets /j",
                      "timestamp": "2021-11-17 12:50:49",
                      "score": 5,
                      "num_children": 1,
                      "author": 10096,
                      "replies": [
                        {
                          "id": "hkzdpd9",
                          "text": "Who said anything about bringing us back to any age? America was never what it promised itself to be, the closest we got was when the Radical Republicans ruled the nation, but even with literal military occupation of the dixies, America still fucked it up and somehow became worse. So yeah no, there is no “make America great again” sort of thing here. There’s only make the USA great in the first place by making it align with what its advertised ideals are. This is something I strongly believe in because America is absolute shit, but what it tries indoctrinate you with by making you believe since childhood that it already is the land of the free and protector of liberty… all that is actually fairly great stuff. Too bad only ignorant fucking fascists truly adopt the iconography because they fully buy into it and then get to choose what the meaning of that all stuff is to suit their selfish desires",
                          "timestamp": "2021-11-17 12:59:07",
                          "score": 0,
                          "num_children": 1,
                          "author": 331996,
                          "replies": [
                            {
                              "id": "hkzdvdv",
                              "text": "It was a joke, but I’m glad I gave you an outlet",
                              "timestamp": "2021-11-17 13:00:40",
                              "score": 2,
                              "num_children": 0,
                              "author": 10096,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hkvr80b",
      "text": "But that’s not how it works in the Reich-wing mind. Casual dehumanization is Step One in the playbook: “Police killed that black guy, but he \\[checks notes\\] had outstanding parking tickets! He *deserved* to die!!!\"",
      "timestamp": "2021-11-16 18:11:19",
      "score": 142,
      "num_children": 3,
      "author": 136696,
      "replies": [
        {
          "id": "hkwfueg",
          "text": "‘He was no angel. I saw him hold a beer once’",
          "timestamp": "2021-11-16 20:52:39",
          "score": 61,
          "num_children": 1,
          "author": 97067,
          "replies": [
            {
              "id": "hkwv24m",
              "text": "Have you seen how he comes his hair!? It's DIFFICULT!",
              "timestamp": "2021-11-16 22:33:55",
              "score": 19,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hkylfd2",
          "text": "He was selling cigarettes!!!!",
          "timestamp": "2021-11-17 07:00:17",
          "score": 4,
          "num_children": 0,
          "author": 191141,
          "replies": []
        },
        {
          "id": "hkz6emb",
          "text": "Ever been to a libertarian sub? He's their hero and they can't wait for him to kill more people.",
          "timestamp": "2021-11-17 11:42:48",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hkw0dcj",
      "text": "OP is about to get a lot of shitty comments from dumbass LARPers who wish they'd thought of getting strapped to shoot people in the streets.",
      "timestamp": "2021-11-16 19:11:01",
      "score": 116,
      "num_children": 1,
      "author": 197203,
      "replies": [
        {
          "id": "hkxc6i9",
          "text": "The LARPing is absurd. So many 'leftists' defending him.",
          "timestamp": "2021-11-17 00:37:09",
          "score": 9,
          "num_children": 1,
          "replies": [
            {
              "id": "hkynza7",
              "text": "\"I'm a leftist but Kyle is a hero\"",
              "timestamp": "2021-11-17 07:32:24",
              "score": 3,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hkwc6pb",
      "text": "I love how no one cares to bring up the main issue: why was he there. If he’s already breaking one law (curfew) he shouldn’t of been there, and him not being there would’ve led to no one dying",
      "timestamp": "2021-11-16 20:28:59",
      "score": 78,
      "num_children": 4,
      "author": 309099,
      "replies": [
        {
          "id": "hkwjjjx",
          "text": "I've brought that up before on Reddit and people jumped on me saying that that's like telling a woman who was raped that she deserved it because of how she was dressed. It's pretty gross they'll say shit like that in defense of him.\n\nTo me, that metaphor only works if the woman went to a really bad part of town armed with an illegal assault rifle hoping some rapists would jump out so she could drop them and claim self defense, all thay two weeks after telling her friends that she wished she could go to the bad part of town and shoot potential rapists. It's just planning a shooting with a few extra steps.",
          "timestamp": "2021-11-16 21:16:54",
          "score": 65,
          "num_children": 5,
          "author": 124962,
          "replies": [
            {
              "id": "hkwp209",
              "text": "Yeah, I also stated the obvious in much bigger threads and these lunatics jumped at me calling me names. I didn't expect a murderer to have so many defenders on Reddit.",
              "timestamp": "2021-11-16 21:53:20",
              "score": 18,
              "num_children": 1,
              "author": 2962,
              "replies": [
                {
                  "id": "hkx2a22",
                  "text": "I live very close to Antioch. \nIt's not just reddit that harbors supporters.\nIn fact I'm surprised the dude near my workplace with a \"let's go brandon\" and \"fuck pritzker\" sign in his front yard doesn't have a free Kyle one in the mix.",
                  "timestamp": "2021-11-16 23:25:07",
                  "score": 7,
                  "num_children": 0,
                  "author": 176020,
                  "replies": []
                }
              ]
            },
            {
              "id": "hkwt1fg",
              "text": "Yeah as far as I know, you’re not allowed to engineer or seek out circumstances where you feel your life will be threatened and thusly justified in shooting",
              "timestamp": "2021-11-16 22:20:17",
              "score": 35,
              "num_children": 1,
              "author": 207151,
              "replies": [
                {
                  "id": "hkxhl4u",
                  "text": "Well for one, you're just wrong on a legal level and if you'd watch the trial you'd have known that but two, how far does this logic extend in your mind? Should people quarantine themselves for the rest of their lives? Because stepping out onto the street immediately raises their chances of dying. The right to assemble is protected by the constitution. Counter protests are just as valid as protests. If a girl goes to a bar it's not on her if she gets roofied. She wasn't agitating people and there's no video evidence Kyle was either. He was putting out a fire and yelling \"friendly\". If that's provoking a situation then so is going to that bar and ordering a drink -\\_-",
                  "timestamp": "2021-11-17 01:17:12",
                  "score": -20,
                  "num_children": 1,
                  "author": 218101,
                  "replies": [
                    {
                      "id": "hkxivj5",
                      "text": "It’s okay to protest but it’s stupid to bring a fire arm to one. Protests are very very high tension situations, and although there are plenty of responsible gun owners, there are plenty of dumb ones too and all it takes it one dumbass to freak out and shoot someone..like kyle. He is 17  (at the time) I don’t expect a 17 year old to make the best decisions in that situation which is why they shouldn’t even be in that situation with a firearm",
                      "timestamp": "2021-11-17 01:26:43",
                      "score": 15,
                      "num_children": 1,
                      "author": 309099,
                      "replies": [
                        {
                          "id": "hkxk5q2",
                          "text": ">It’s okay to protest but it’s stupid to bring a fire arm to one\n\nObviously not, probably saved his life that night. Rosenbaum only attacked him because Kyle was putting out the fire they started. Also, we know that at least three of the rioters that night had firearms. Gaige had one, illegally. The first shooter who fired before Kyle did had one. And the third shooter, who fired after Kyle did had one. Seems to me like a classic example of Game Theory.\n\n&#x200B;\n\n>Protests are very very high tension situations, and although there are plenty of responsible gun owners, there are plenty of dumb ones too and all it takes it one dumbass to freak out and shoot someone..like kyle\n\nThe entire point of the second amendment is to protect one's life which is how it was used. It's not Kyle's fault an insane pedophile screaming the N word and saying he wanted to eat peoples' hearts decided to assault him. Your chance of being raped increases exponentially when you go to the bar, does that mean bar patrons aren't allowed to defend themselves from rapists either?\n\n&#x200B;\n\n>I don’t expect a 17 year old to make the best decisions in that situation which is why they shouldn’t even be in that situation with a firearm\n\nThe gun possession charges were waived.",
                          "timestamp": "2021-11-17 01:36:12",
                          "score": -14,
                          "num_children": 1,
                          "author": 218101,
                          "replies": [
                            {
                              "id": "hkxs8h9",
                              "text": "I guess you didn’t hear me because you were in the back, HE DID NOT NEED TO BE THERE. He had no connections to the businesses and none of the businesses asked anyone to come and protect them. There was a curfew. What parent would let their 17 year old go to a highly charged event like that with an AR? \n\nSo let’s ignore all the reasons he made many choices that led up to himself being put in that position and still go with the “he was defending himself”. If he was black there’s noooooo fucking way this would’ve went down how it went down and people wouldn’t be his defense. I mean fuck this kid, he has no remorse, he flashes white power signs, he hangs out with racists, like really? Fuck him.",
                              "timestamp": "2021-11-17 02:34:54",
                              "score": 12,
                              "num_children": 0,
                              "author": 309099,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hkwuuoq",
              "text": "Dude literally followed the mass shooters play book. Held a grudge against a group of people, showed a desire to commit acts of violence against said group, got egged on by his piers online and irl, purchased a firearm illegally, travelled to an area with a lot of \"targets\"\n\nThis is like if the Columbine people got a self defense ruling because \"the people they shot were bullies who made the shooter fear for his life\"",
              "timestamp": "2021-11-16 22:32:29",
              "score": 29,
              "num_children": 1,
              "author": 67423,
              "replies": [
                {
                  "id": "hkxits6",
                  "text": "You must not be following the trial. That's his town so the whole \"cRoSSed sTATe lINeS\" angle is thoroughly idiotic at this point. His gun possession charges were also waived so you can't say he had it illegally. He didn't initiate any conflicts that night based on the video evidence of which there is a lot of. He was legally allowed to be there, they even waived his curfew charge. He was putting out a fire with a fire extinguisher when he was assaulted by Rosenbaum. Gaige testified that Kyle only opened fire when Gaige pointed his gun at him. The whole idiotic spin MSNBC is going with now is that Kyle shot Rosenbaum in the back as he was trying to run. Go watch the video, Kyle shot 4 times in 0.75 seconds. He shot him in the chest/shoulder area which caused him to spin around on the 4th shot. Nobody on the planet is able to make conscious decisions within the time span of 0.75 seconds, especially in those conditions. All the talking points about Kyle are crumbling. The only thing people have left is that video where Kyle is bragging to his friends about wanting to shoot two people who were brazenly robbing a store right in front of him a couple weeks earlier. However, if you want to submit that as evidence then you have to take into account that everyone who assaulted Kyle had much worse histories of violence. That's the reason it wasn't admitted as evidence and why the judge got upset when the prosecutor broke the rules and tried to bring it up. It's called propensity character evidence and it doesn't apply because it was agreed upon beforehand that the events of that night weren't initiated by Kyle based on the videos.",
                  "timestamp": "2021-11-17 01:26:21",
                  "score": -8,
                  "num_children": 0,
                  "author": 218101,
                  "replies": []
                }
              ]
            },
            {
              "id": "hkxcfym",
              "text": "Someone said in defense of the Judge saying they couldn't call the victims \"victims\" that it's like if a rapist was murdered by the victim would the rapist be a victim?",
              "timestamp": "2021-11-17 00:39:06",
              "score": 6,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hkxh53p",
              "text": "Nonsense, you're assuming intent which even the prosecution has failed to prove. Without proof of premeditated intent you're just victim blaming. There's no video evidence that day showing he was actively agitating anyone. Meanwhile Rosenbaum is on video screaming the N word and saying he's going to eat peoples' hearts lol",
              "timestamp": "2021-11-17 01:13:55",
              "score": -5,
              "num_children": 1,
              "author": 218101,
              "replies": [
                {
                  "id": "hkxiujc",
                  "text": "> you're assuming intent \n\nYou know what, you're right, next time someone starts marching around a violent, chaotic area armed with an assault rifle, I'm just going to assume they're there on a nice evening stroll.",
                  "timestamp": "2021-11-17 01:26:31",
                  "score": 15,
                  "num_children": 1,
                  "author": 124962,
                  "replies": [
                    {
                      "id": "hkxkv4w",
                      "text": "It wasn't violent and chaotic because of Kyle. He was attacked for trying to put out a fire with an extinguisher. I'm not going to praise him like a hero because he has obvious character flaws but I do believe his intention was deterrence and protecting his town. He brought medical supplies, a fire extinguisher, and graffiti removal supplies. He definitely had a hero complex but I don't consider that a punishable offence. You can quote \"In Defence of Looting\" if you want but I'm not going to demonize him for being there and removing graffiti / putting out fires when people from out of town that day came in with illegal firearms and tried to trash the place.",
                      "timestamp": "2021-11-17 01:41:16",
                      "score": -1,
                      "num_children": 1,
                      "author": 218101,
                      "replies": [
                        {
                          "id": "hkyzy2n",
                          "text": "He admitted on the stand his only “medical supply” was some gauze. But he did make sure he had 30 rounds of full metal jacket and an AR. He never wore a red cross which most medics do. He didn’t “bring” a fire extinguisher. He grabbed one from CarMax and was parading around with it yet he never put out any fires. Kenosha is not “his town”. His dad lives there who he has not seen in almost 2 years. Nor did he know anyone there beyond the two people he was there with. He had no business being there.",
                          "timestamp": "2021-11-17 10:18:07",
                          "score": 4,
                          "num_children": 1,
                          "author": 393864,
                          "replies": [
                            {
                              "id": "hkz89qe",
                              "text": "Note to self: in case I ever feel the need to go on a premeditated killing spree like this little prick, I’ll just make sure to bring some “medical supplies” and a fire extinguisher to remove all doubt as to my intentions of murdering people",
                              "timestamp": "2021-11-17 12:04:03",
                              "score": 6,
                              "num_children": 0,
                              "author": 409111,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hkxcsfc",
          "text": "The \"why was he there\" part is completely glossed over by the right-wing drones because they don't care why he was there as they support the outcome.\n\nThey have a \"doesn't matter, had sex\" bro attitude towards violence against their political enemies. So to that end it doesn't matter that Rittenhouse is a misguided kid. It doesn't matter that he had a firearm that he was clearly too young and irresponsible to use. It doesn't matter that he inserted himself into a violent situation because he thought he was some sort of freedom fighter or hero. And it doesn't matter that he shot people and, in fact, to the people who defend him that's a feature not a bug. \n\nIn their minds everything leading up to Rittenhouse shooting somebody is immaterial because they think everyone that got shot deserved to get shot and the ends justify the means. \n\nThat's why they largely get into the weeds of the argument with the \"Well, *actually*...\" details instead of just outright saying \"Fuck those people, I'd shoot them myself\" because the \"Well, *actually*...\" beating of the details to death is a handy mask to cover up their big boner for fascist behavior and violence.",
          "timestamp": "2021-11-17 00:41:39",
          "score": 14,
          "num_children": 0,
          "author": 31004,
          "replies": []
        },
        {
          "id": "hkyzk3h",
          "text": "And the fact that out of all the armed people there ( from both sides) Cryle is the only one who murdered people.",
          "timestamp": "2021-11-17 10:12:30",
          "score": 2,
          "num_children": 0,
          "author": 393864,
          "replies": []
        },
        {
          "id": "hkwgnwz",
          "text": "That same logic applies to the people he shot.",
          "timestamp": "2021-11-16 20:57:57",
          "score": -22,
          "num_children": 6,
          "author": 274997,
          "replies": [
            {
              "id": "hkwspg3",
              "text": "Last I checked, ‘being in the wrong place at the wrong time’ does not carry a sentence of summary execution. Mind you, I live in a civilised-ish-for-now country; maybe things are different in the USA.",
              "timestamp": "2021-11-16 22:18:03",
              "score": 25,
              "num_children": 1,
              "author": 207343,
              "replies": [
                {
                  "id": "hkxj509",
                  "text": ">Last I checked, ‘being in the wrong place at the wrong time’ does not carry a sentence of summary execution\n\nSo why aren't you extending this courtesy to Kyle, the one who didn't even initiate any of the violence? Also \"being in the wrong place at the wrong time\" makes it seem like they were just passing by lol. Rosenbaum was out on the street hours earlier yelling the N word at people and saying he wanted to eat their hearts -\\_-",
                  "timestamp": "2021-11-17 01:28:40",
                  "score": -1,
                  "num_children": 1,
                  "author": 218101,
                  "replies": [
                    {
                      "id": "hkxkhoa",
                      "text": "*Because he murdered two people*, after *commuting* to do so",
                      "timestamp": "2021-11-17 01:38:33",
                      "score": 14,
                      "num_children": 1,
                      "author": 207343,
                      "replies": [
                        {
                          "id": "hkxlfye",
                          "text": "No evidence of murder and the way the trial is going you're not going to see those convictions either. The \"commute\" was to the town he worked in and where his father lived. It was \\~15 minutes drive. The nearest subway station where I live is the same distance. That's not a meaningful separation lol. W/e, you're just being unreasonable. It's hard to talk to people who don't even want to address what happened on video but would rather talk about the inane subject of how they thought he shouldn't of been there that night as if that hasn't been addressed a hundred times lol. They even waived his curfew charges -\\_-",
                          "timestamp": "2021-11-17 01:45:26",
                          "score": -1,
                          "num_children": 1,
                          "author": 218101,
                          "replies": [
                            {
                              "id": "hkxnkff",
                              "text": "Right, so that's at least fifteen minutes of thinking 'should I really be heading out with my situation-escalation device?' that he had to have done. Not exactly selling your side of the story. The first guy that he murdered was unarmed and just trying to get the deadly weapon out of the situation when he got shot four times for his trouble.\n\nHe shouldn't have been there. The gun shouldn't have been there.",
                              "timestamp": "2021-11-17 02:00:52",
                              "score": 12,
                              "num_children": 1,
                              "author": 207343,
                              "replies": [
                                {
                                  "id": "hkxp7at",
                                  "text": "This line of reasoning keeps popping up. What kind of psychopath are you that thinks a gun is a \"situation-escalating device\" and not a deterrent? You'll notice the only people who attacked Kyle were crazy assholes with criminal backgrounds to reinforce that point. And the first guy wasn't just \"trying to get the deadly weapon out of the situation\", he was yelling at people that he'd eat their hearts that day, it's on video lol\n\n&#x200B;\n\n>He shouldn't have been there. The gun shouldn't have been there.\n\nHe had every right to be there and so did the gun. Both the weapons charge and the curfew charge were dropped.",
                                  "timestamp": "2021-11-17 02:12:46",
                                  "score": -3,
                                  "num_children": 1,
                                  "author": 218101,
                                  "replies": [
                                    {
                                      "id": "hkxrgmd",
                                      "text": "The sort of psychopath who knows the science behind how guns influence situations i.e. that they don't deter anything except reasonable discussion? There's a pretty clear correlation between owning a gun and being involved in a violent crime; almost as if the threat of immediate death makes the person holding it more cocky and the person having it pointed at them more anxious.",
                                      "timestamp": "2021-11-17 02:29:08",
                                      "score": 9,
                                      "num_children": 0,
                                      "author": 207343,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hkwluo4",
              "text": "Okay fine. Kyle gets the same treatment as them. Murdered",
              "timestamp": "2021-11-16 21:32:05",
              "score": 21,
              "num_children": 1,
              "author": 286990,
              "replies": [
                {
                  "id": "hkxd9ie",
                  "text": "had he not shoot back, and let them take the rifle, then yes he'll probably be ded too",
                  "timestamp": "2021-11-17 00:45:08",
                  "score": -11,
                  "num_children": 1,
                  "author": 216139,
                  "replies": [
                    {
                      "id": "hkxe9pr",
                      "text": "Had he not had the rifle at all none of it would have even started. Kyle shot first.",
                      "timestamp": "2021-11-17 00:52:38",
                      "score": 12,
                      "num_children": 2,
                      "author": 286990,
                      "replies": [
                        {
                          "id": "hkxj8nn",
                          "text": "How do you know, all three of the people he shot had violent criminal backgrounds. There was also a history of people being assaulted/murdered at other riots.",
                          "timestamp": "2021-11-17 01:29:25",
                          "score": 0,
                          "num_children": 1,
                          "author": 218101,
                          "replies": [
                            {
                              "id": "hkxk70u",
                              "text": "[removed]",
                              "timestamp": "2021-11-17 01:36:27",
                              "score": 7,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hkxlxny",
                                  "text": "[removed]",
                                  "timestamp": "2021-11-17 01:49:00",
                                  "score": 0,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hkxmjwd",
                                      "text": "You got your numbers backwards. \n\nhttps://time.com/5886348/report-peaceful-protests/\n\nhttps://www.radcliffe.harvard.edu/news-and-ideas/black-lives-matter-protesters-were-overwhelmingly-peaceful-our-research-finds\n\nhttps://www.cnn.com/2020/09/04/us/blm-protests-peaceful-report-trnd/index.html\n\nhttps://www.washingtonpost.com/politics/2021/10/12/critics-claim-blm-was-more-violent-than-1960s-civil-rights-protests-thats-just-not-true/\n\nhttps://www.csmonitor.com/USA/Politics/2021/0708/BLM-and-Floyd-protests-were-largely-peaceful-data-confirms\n\nhttps://www.wshu.org/news/2020-10-19/uconn-study-at-least-96-of-black-lives-matter-protests-were-peaceful\n\nhttps://www.theguardian.com/world/2020/sep/05/nearly-all-black-lives-matter-protests-are-peaceful-despite-trump-narrative-report-finds\n\nhttps://www.usatoday.com/in-depth/news/nation/2020/10/24/trump-claims-blm-protests-violent-but-majority-peaceful/3640564001/\n\nhttps://www.davisvanguard.org/2021/09/despite-reactionary-response-study-shows-most-blm-protests-peaceful-but-alt-right-actions-not/\n\nhttps://thehill.com/homenews/state-watch/515082-over-90-percent-of-protests-this-summer-were-peaceful-report-shows",
                                      "timestamp": "2021-11-17 01:53:26",
                                      "score": 3,
                                      "num_children": 0,
                                      "author": 286990,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hkxefyu",
                          "text": "Yes so it’s his fault. He bring the rifle, and he’s at the wrong place. So automaticaly he has no right of sefldefence and derserve to be beaten to dead or shot dead with his own weapon. Ok",
                          "timestamp": "2021-11-17 00:53:57",
                          "score": -10,
                          "num_children": 1,
                          "author": 216139,
                          "replies": [
                            {
                              "id": "hkxfdpi",
                              "text": "Do you even hear yourself? Reverse the roles \n\nSo you agree the other guy shouldn't have been shot and therefore Kyle is a murderer. Great, thanks for the talk.",
                              "timestamp": "2021-11-17 01:00:57",
                              "score": 11,
                              "num_children": 1,
                              "author": 286990,
                              "replies": [
                                {
                                  "id": "hkxfwt5",
                                  "text": "Absolutely. He carry a gun at a place he shouldn’t be. So therefore he has to be eliminated. And we - the 3  judges of the street will bring justice upon him. (Unfortunately 2 of the judges was shot dead)",
                                  "timestamp": "2021-11-17 01:04:51",
                                  "score": -6,
                                  "num_children": 0,
                                  "author": 216139,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hkxajd6",
              "text": "They got killed for that, while Kyle got a hero's welcome in right wing circles. See the difference? The people he murdered didn't benefit from the presumption of innocence, because a *very special* 17 year old high school dropout decided to take the law into his own hands.",
              "timestamp": "2021-11-17 00:25:10",
              "score": 11,
              "num_children": 1,
              "author": 154171,
              "replies": [
                {
                  "id": "hkxjit7",
                  "text": "Presumption of innocence? There's video evidence of them initiating the conflicts you dick. Why is everyone here just ignoring everything that happened that night. You guys want to talk about the video from weeks ago, you want to talk about how he shouldn't have been there, you want to talk about Kyle posing with the Proud Boys, but nobody here wants to address the actual facts that transpired that night because you know it completely exonerates him.",
                  "timestamp": "2021-11-17 01:31:29",
                  "score": -1,
                  "num_children": 1,
                  "author": 218101,
                  "replies": [
                    {
                      "id": "hkyqqkj",
                      "text": "Do you know what presumption of innocence means in the context of the American legal system? It means having the right to a fair trial. Why are you ignoring the video evidence of  Kyle instigating the conflict? Why are you ignoring the video evidence of Kyle lying to the police about why he was there? You're so excited by one of your heros living out this wet dream of shooting up liberals that you've lost track of the facts.",
                      "timestamp": "2021-11-17 08:08:30",
                      "score": 3,
                      "num_children": 0,
                      "author": 154171,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hkwn2cu",
              "text": "Yes, and...?",
              "timestamp": "2021-11-16 21:40:09",
              "score": 6,
              "num_children": 0,
              "author": 10221,
              "replies": []
            },
            {
              "id": "hkxiije",
              "text": "Either because Kyle was allowed to be there then so should the protestors or you have to agree that if the protestors weren’t allowed to be there (and it being a law that was across all citizens not just protestors) the Kyle shouldn’t of been either. Kyle doesn’t get special rights that make him exempt from the law if the the protestors aren’t",
              "timestamp": "2021-11-17 01:24:03",
              "score": 2,
              "num_children": 1,
              "author": 309099,
              "replies": [
                {
                  "id": "hkymmhn",
                  "text": "Yes, and?",
                  "timestamp": "2021-11-17 07:15:06",
                  "score": -2,
                  "num_children": 0,
                  "author": 274997,
                  "replies": []
                }
              ]
            },
            {
              "id": "hkwksgx",
              "text": "huh",
              "timestamp": "2021-11-16 21:25:06",
              "score": 2,
              "num_children": 0,
              "author": 309767,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hkx6aax",
      "text": "I heard a right wing podcast refer to one of his victims as a child-rapist.\n\nI’m pretty sure that is never used against their glorious one-term President",
      "timestamp": "2021-11-16 23:53:59",
      "score": 30,
      "num_children": 1,
      "author": 36586,
      "replies": [
        {
          "id": "hkxjnp6",
          "text": "Rosenbaum sexually assaulted 5 boys, not sure if it was rape",
          "timestamp": "2021-11-17 01:32:31",
          "score": -24,
          "num_children": 4,
          "author": 218101,
          "replies": [
            {
              "id": "hkynyfw",
              "text": "And how would Rittenhouse have known this? Secret information from Trump? From Q?",
              "timestamp": "2021-11-17 07:32:06",
              "score": 9,
              "num_children": 0,
              "author": 8270,
              "replies": []
            },
            {
              "id": "hkxuy6u",
              "text": "Ok, so moving forward we say sexual-predator Rosenbaum & sexual predator Donald Trump in all instances?\n\nI guess that works",
              "timestamp": "2021-11-17 02:55:05",
              "score": 21,
              "num_children": 0,
              "author": 36586,
              "replies": []
            },
            {
              "id": "hkxxwn7",
              "text": "So what? In America we put folks who do bad things on trial you anti-American scum.",
              "timestamp": "2021-11-17 03:17:31",
              "score": 9,
              "num_children": 0,
              "author": 354168,
              "replies": []
            },
            {
              "id": "hkzw4nc",
              "text": "If this was known information at the time, Kyle is going to prison  for premeditated murder... you do understand that is not a defense right...",
              "timestamp": "2021-11-17 15:25:23",
              "score": 2,
              "num_children": 0,
              "author": 26344,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hkwbi35",
      "text": "[deleted]",
      "timestamp": "2021-11-16 20:24:29",
      "score": 39,
      "num_children": 1,
      "replies": [
        {
          "id": "hkxgqh5",
          "text": "Same shit with Floyd. They love to bring up his prior convictions and also use that to attack the memorials to him, and they’re missing the whole point (so that they can justify extrajudicial executions)",
          "timestamp": "2021-11-17 01:10:56",
          "score": 15,
          "num_children": 0,
          "author": 1105,
          "replies": []
        }
      ]
    },
    {
      "id": "hkx4f2e",
      "text": "I think there's a name for such executions. Lynching. No indictment, no trial. On the spot.",
      "timestamp": "2021-11-16 23:40:34",
      "score": 11,
      "num_children": 1,
      "author": 341093,
      "replies": [
        {
          "id": "hkyh61m",
          "text": "That's what they were trying to do to him. Seriously, you need a mob for lynching. Defending yourself from such mob is the opposite of lynching.",
          "timestamp": "2021-11-17 06:11:23",
          "score": -5,
          "num_children": 0,
          "author": 253197,
          "replies": []
        }
      ]
    },
    {
      "id": "hkxqsyu",
      "text": "Also, they talk about those guys' arrest records with this tone implying that Kyle Rittenhouse was some kind of avenging angel, sent by God to execute them since the justice system wouldn't",
      "timestamp": "2021-11-17 02:24:22",
      "score": 7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hkxdtlp",
      "text": "Only three people shot in the disturbance and Kyle did the shooting.",
      "timestamp": "2021-11-17 00:49:18",
      "score": 5,
      "num_children": 0,
      "author": 228459,
      "replies": []
    },
    {
      "id": "hkwz9wi",
      "text": "Idk. Yall don't feel like there's any legal grey area here? Seems like it to me. \n\nI would never get caught dead defending rittenhouse. He sucks. Hilarious that these scumbags hitched their wagon to him.",
      "timestamp": "2021-11-16 23:03:24",
      "score": 8,
      "num_children": 0,
      "author": 38376,
      "replies": []
    },
    {
      "id": "hkxywcr",
      "text": "He was there to kill people. Period. The only reason this wasn’t yet another mass shooting tragedy is because of his victims. \nKyle was the ‘bad guy with a gun.’\nHIS VICTIMS Were heros.",
      "timestamp": "2021-11-17 03:25:06",
      "score": 7,
      "num_children": 1,
      "author": 160031,
      "replies": [
        {
          "id": "hkydiqa",
          "text": "That doesn’t make sense. If he was there to a commit a mass shooting then it would have happened regardless of the actions of those who were shot that night seeing as how none of them managed to actually neutralize/stop Rittenhouse. If Rittenhouse went there to conduct a mass shooting then I would question why his targets were only those that presented an immediate threat to him. I would also like to know how Rosenbaum, specifically, is a hero.",
          "timestamp": "2021-11-17 05:33:28",
          "score": -7,
          "num_children": 0,
          "author": 247320,
          "replies": []
        }
      ]
    },
    {
      "id": "hky567e",
      "text": "This analogy only works if Rittenhouse shot the guy for being a pedo. That’s not what happened. Rittenhouse didn’t take the law into his hands to punish the guy for said crimes.",
      "timestamp": "2021-11-17 04:15:52",
      "score": 2,
      "num_children": 0,
      "author": 291759,
      "replies": []
    },
    {
      "id": "hkygxfk",
      "text": "the difference is that what he did is what his stans *want* to do but are too cowardly to do, so he is a hero to them. there is no logic or justice in the spheres of hate.",
      "timestamp": "2021-11-17 06:08:47",
      "score": 2,
      "num_children": 0,
      "author": 32066,
      "replies": []
    },
    {
      "id": "hky7ves",
      "text": "I don't agree with what he did bringing the assault rifle which he claimed was for protection. I don't buy that. He was hoping to get into some shit. However that's not how the law works and according to the evidence he acted in self defense. He was not an attacker but a victim who was also happened to be well armed, in the eyes of the law. I do agree we can work on the law but that's what it is. You shouldn't try to attack someone with an assault rifle if they aren't actively threatening anyone with it. Getting hit in the head with a skateboard and having a gun pointed at you justifies your defending yourself. Unfortunately, I feel like that's what Rittenhouse wanted. I don't agree with his actions to subtlety invite and incite the violence towards him but the law is what it is. Because he's a douchebag idiot fuck twat, two people died. He can go fuck himself but we have laws like this in place for a reason and the ones enforcing it need to abide by it. It's on the prosecution to prove beyond a shadow of a doubt and the prosecution failed immensely in this case to do so.",
      "timestamp": "2021-11-17 04:39:35",
      "score": 3,
      "num_children": 1,
      "author": 369160,
      "replies": [
        {
          "id": "hkyniep",
          "text": "Are you telling me that in America, a country where more people have guns than do not, a country where people will openly carry guns all the time to defend themselves, that this case is different? \n\nI argue that he took the gun in *anticipation* of defending himself.",
          "timestamp": "2021-11-17 07:26:19",
          "score": 1,
          "num_children": 1,
          "author": 123544,
          "replies": [
            {
              "id": "hkyxmf4",
              "text": "The very first three sentences of my comment, say exactly what you said in the last sentence of your comment but with more words. Did you read my full comment or just pick what you wanted to respond to?\n\nI agree that he invited it and believe he hoped to use it. It doesn't change the evidence and how the law looks at it. Whether I agree he should be put away forever or not, it is what the legal system works off of, whether we agree or not.",
              "timestamp": "2021-11-17 09:44:55",
              "score": -1,
              "num_children": 0,
              "author": 369160,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hkyakti",
      "text": "TikTok was THE WORST place to watch that trial. One of the news stations did a live of it on there and I stumbled upon it, the comments have made me decide to move to mars",
      "timestamp": "2021-11-17 05:04:46",
      "score": 1,
      "num_children": 0,
      "author": 376714,
      "replies": []
    },
    {
      "id": "hkxri3f",
      "text": "Rittenhouse only shot the people that presented an imminent amd credible threat to his life.\n\nYou are not entitled to a trial if you chase someone down without provocation and then lunge for their firearm while they repeatedly yell \"friendly\".\n\nIf you look at this absent of all context and fact, I would agree with the content of this post however, once you aggress upon an innocent person and escalate the violence to the point where they fear for their life, you lose your right to a trial.\n\nA victim of sexual assault would not be convicted for killing her attempted rapist, the same applies for physical assault too. \n\nThis was clear self-defense. I suggest anyone still claiming the opposite go watch the footage again or read [this article](https://www.reuters.com/world/us/how-kyle-rittenhouse-went-cleaning-graffiti-shooting-3-people-2021-11-11/) from Reuters.",
      "timestamp": "2021-11-17 02:29:26",
      "score": -3,
      "num_children": 0,
      "author": 93980,
      "replies": []
    },
    {
      "id": "hkxb83d",
      "text": "[removed]",
      "timestamp": "2021-11-17 00:30:11",
      "score": -16,
      "num_children": 1,
      "replies": [
        {
          "id": "hkxkiso",
          "text": "Those guys were performing righteous attacks, they were only attacking to stop an active shooter from actively shooting everyone in his path.",
          "timestamp": "2021-11-17 01:38:47",
          "score": 2,
          "num_children": 2,
          "author": 17727,
          "replies": [
            {
              "id": "hkxnahn",
              "text": "[removed]",
              "timestamp": "2021-11-17 01:58:50",
              "score": -5,
              "num_children": 1,
              "replies": [
                {
                  "id": "hkxpr52",
                  "text": "None. Literally that entire night is on film. I don't understand how self defense is something that even has to be argued. He literally only shot at people that were \"making friendly contact\" with him. He is a fucking moron for putting himself in that situation, but to call him an active shooter/mass murderer is just... Yeah. Not sure how to argue with that.",
                  "timestamp": "2021-11-17 02:16:49",
                  "score": 0,
                  "num_children": 1,
                  "author": 17727,
                  "replies": [
                    {
                      "id": "hkxqtyx",
                      "text": "[removed]",
                      "timestamp": "2021-11-17 02:24:33",
                      "score": -1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hkxr6px",
                          "text": "I was being sarcastic. Anyone that has seen the video evidence knows he did not shoot anyone in his path randomly. There was nothing random about what happened that night.",
                          "timestamp": "2021-11-17 02:27:07",
                          "score": 0,
                          "num_children": 1,
                          "author": 17727,
                          "replies": [
                            {
                              "id": "hkxrihm",
                              "text": "[removed]",
                              "timestamp": "2021-11-17 02:29:31",
                              "score": -1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hkxsgo0",
                                  "text": "Well, I believe most sensible people can differentiate between the legal aspect, and their personal dislike of Kyle.  You can both dislike Kyle and the stupidity of choices, and at the same time agree that based on the abundance of video detail, he tried to run away the very second he realized shit was getting serious. If you try to avoid conflict by literally running away, but said conflict chases you... Armed, unarmed... All become irrelevant. I bet if he did not run and straight up shot the first victim, they would have argued he could have tried to run away.",
                                  "timestamp": "2021-11-17 02:36:33",
                                  "score": 0,
                                  "num_children": 1,
                                  "author": 17727,
                                  "replies": [
                                    {
                                      "id": "hkxtc0s",
                                      "text": "[removed]",
                                      "timestamp": "2021-11-17 02:43:04",
                                      "score": 1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hkxtrkn",
                                          "text": "You hit the nail on the head. I feel the same.",
                                          "timestamp": "2021-11-17 02:46:19",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 17727,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hl1zofp",
              "text": "Third party fired a gun while they chased Kyle. He shot only when they were to close to him. You can literaly see the video by yourself",
              "timestamp": "2021-11-17 23:55:55",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hl3xpf8",
                  "text": "I agree, I was being sarcastic.",
                  "timestamp": "2021-11-18 11:32:46",
                  "score": 1,
                  "num_children": 0,
                  "author": 17727,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hkxgyih",
      "text": "They literally already have been convicted. What planet is this",
      "timestamp": "2021-11-17 01:12:35",
      "score": -8,
      "num_children": 1,
      "author": 2567,
      "replies": [
        {
          "id": "hkzmuzl",
          "text": "Did Kyle know that before killing them?",
          "timestamp": "2021-11-17 14:17:37",
          "score": 1,
          "num_children": 0,
          "author": 205481,
          "replies": []
        }
      ]
    },
    {
      "id": "hkx0k5k",
      "text": "[deleted]",
      "timestamp": "2021-11-16 23:12:43",
      "score": -5,
      "num_children": 2,
      "replies": [
        {
          "id": "hkxd5as",
          "text": "Ok but what their past crimes were are non sequitur because he couldn’t have possibly known those details about their lives prior. And if he had then that would have made their killings. premeditated. Which would make his actions absolutely murder. Your argument is false.",
          "timestamp": "2021-11-17 00:44:16",
          "score": 14,
          "num_children": 1,
          "author": 239144,
          "replies": [
            {
              "id": "hkxevgm",
              "text": "[deleted]",
              "timestamp": "2021-11-17 00:57:10",
              "score": 1,
              "num_children": 2,
              "replies": [
                {
                  "id": "hkxkxey",
                  "text": "I don’t think you were though. You made a direct comment based on the post which was explicitly about talking about their past crimes, not what they did at the time of the crime. You are sowing dissension on the case online to throw doubt into the average persons mind about how this should trial should be handled. Like I said, their past crimes are not a part of this trial because he should not have known about those crimes at the time.",
                  "timestamp": "2021-11-17 01:41:44",
                  "score": 4,
                  "num_children": 0,
                  "author": 239144,
                  "replies": []
                },
                {
                  "id": "hkxgigq",
                  "text": "You’re right and legally I think there is enough grey area here to legitimately argue self-defence. My issue with this case is that there should never have been a legal leg to stand on to begin with. He should never have had access to the gun, he shouldn’t have been able to take it across state lines, he shouldn’t have been exempted from curfew by the police and self-defence shouldn’t be admissible in the first shooting where the guy didn’t have a weapon. This case is a symptom of a sick society.",
                  "timestamp": "2021-11-17 01:09:17",
                  "score": 6,
                  "num_children": 0,
                  "author": 202723,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hkxrhf0",
          "text": "Sooooo.... You think this guy was sexually assaulting children as he ran towards Rittenhouse? You do realize anything he did wrong was before this incident, and Kyle would have had no knowledge of his past as he was shooting him.",
          "timestamp": "2021-11-17 02:29:18",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hkychob",
      "text": "False. Rosenbaum was crazy, off his meds and attacking Rittenhouse while shouting racial slurs and literally asking to be shot",
      "timestamp": "2021-11-17 05:23:10",
      "score": -6,
      "num_children": 1,
      "author": 273870,
      "replies": [
        {
          "id": "hkzn87y",
          "text": "So asking to be shot makes it okay to do so?",
          "timestamp": "2021-11-17 14:20:30",
          "score": 1,
          "num_children": 1,
          "author": 205481,
          "replies": [
            {
              "id": "hl1zu5f",
              "text": "No, but being 2 meters from a person who chased you while someone fired from a gun is okay",
              "timestamp": "2021-11-17 23:57:05",
              "score": 0,
              "num_children": 1,
              "replies": [
                {
                  "id": "hl21kgf",
                  "text": "What?\nThat's a joke right?",
                  "timestamp": "2021-11-18 00:10:21",
                  "score": 1,
                  "num_children": 1,
                  "author": 205481,
                  "replies": [
                    {
                      "id": "hl21xce",
                      "text": "Yes. But shooting someone who points gun at you isnt",
                      "timestamp": "2021-11-18 00:13:08",
                      "score": 0,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hkyy1av",
      "text": "Actions of there's that were relevant: if they were an immediate danger to someone's life at that moment  \n\nliterally anything else is irrelevant since we are not trying to judge if if they were good people but if it was murder, and those are the only scenarios in which killing someone is legal, especially because Kyle was unaware of it(and even if he was somehow aware of it and that was related to why he killed them that would just be vigilantism, also known as \"cool motive, still murder\")",
      "timestamp": "2021-11-17 09:50:51",
      "score": 1,
      "num_children": 0,
      "author": 92676,
      "replies": []
    },
    {
      "id": "hkzg847",
      "text": "I definitely agree with John, the kid is guilty as hell.",
      "timestamp": "2021-11-17 13:22:47",
      "score": 1,
      "num_children": 0,
      "author": 325621,
      "replies": []
    },
    {
      "id": "hl1giqp",
      "text": "Lol they got a trial😂 some of them were already convicted",
      "timestamp": "2021-11-17 21:38:54",
      "score": 1,
      "num_children": 0,
      "author": 71626,
      "replies": []
    },
    {
      "id": "hkvtnsg",
      "text": "[removed]",
      "timestamp": "2021-11-16 18:27:03",
      "score": -55,
      "num_children": 3,
      "replies": [
        {
          "id": "hkw800r",
          "text": "He had absolutely zero business being there. You can’t claim self defense when you put yourself into a hostile environment with the intent to add to the hostility.",
          "timestamp": "2021-11-16 20:01:23",
          "score": 35,
          "num_children": 2,
          "author": 15659,
          "replies": [
            {
              "id": "hkwa1pn",
              "text": "You can and he will. Successfully.\n\nWhat he should be convicted of is reckless endangerment and he should see the inside of a jail cell for it too.",
              "timestamp": "2021-11-16 20:14:55",
              "score": 6,
              "num_children": 1,
              "author": 298709,
              "replies": [
                {
                  "id": "hkwfb4p",
                  "text": "He can legally claim it and succeed in his legal claim. But legality doesn’t make it ethically or morally sound. \n\nEspecially considering the level of corruption in the judicial system/government in general. \n\nEthically/morally, it wasn’t self defense. Period.",
                  "timestamp": "2021-11-16 20:49:13",
                  "score": 10,
                  "num_children": 0,
                  "author": 15659,
                  "replies": []
                }
              ]
            },
            {
              "id": "hkwgss6",
              "text": "How did he have any less business than anyone else involved?",
              "timestamp": "2021-11-16 20:58:50",
              "score": -7,
              "num_children": 2,
              "author": 274997,
              "replies": [
                {
                  "id": "hkwh6r6",
                  "text": "Illegal possession of a firearm, attending a rally that is not in his community with documented, MALICIOUS, intent. Lying to police officers, need i go on?",
                  "timestamp": "2021-11-16 21:01:22",
                  "score": 7,
                  "num_children": 2,
                  "author": 15659,
                  "replies": [
                    {
                      "id": "hkwhvf5",
                      "text": "Except he was very definitely allowed to possess the firearm, he was 15 miles away from where his parents live, and was documented rendering medical aid and putting fires. I get that his political ideology is garbage and people are going to take away the wrong lesson when he gets acquitted, but you could at least try to present claims that weren't disproven a month ago.",
                      "timestamp": "2021-11-16 21:05:53",
                      "score": -10,
                      "num_children": 2,
                      "author": 274997,
                      "replies": [
                        {
                          "id": "hkxaymj",
                          "text": "If he was allowed to possess the firearm then why did he have his friend buy it for him? And, why did he lie about being an EMT? And, why did he lie about the \"owner\" of an abondoned storefront asking him to \"protect\" it? For someone who did nothing wrong he sure seems to go to great lengths to obfuscate the truth.",
                          "timestamp": "2021-11-17 00:28:16",
                          "score": 9,
                          "num_children": 1,
                          "author": 154171,
                          "replies": [
                            {
                              "id": "hkxf2ge",
                              "text": "He’s buried under a pile of bullshit so high I’m astonished that anyone can even imply he had good and lawful intent to be at that protest",
                              "timestamp": "2021-11-17 00:58:38",
                              "score": 7,
                              "num_children": 0,
                              "author": 15659,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hkwjg5j",
                          "text": "It’s documented he “fled the state of Wisconsin with the intent to avoid prosecution for that offense”. Usually not done by people who are assured they acted legally/morally correct. \n\nHe had to be driven by an irresponsible parent nearly half an hour to the location, a location he had no productive reason to be at, as a minor/child. Repeat, he’s a kid. \n\nNot only that but he was seen wearing a shirt that says “we don’t have non lethal weapons”. Why not? The police are using non lethal weapons to handle the protesters, why were untrained citizens using lethal weaponry? not even to protect human life but to protect property? (And mostly Property that didn’t even belong to them).\n\nThe two people who were in pursuit of Kyle saw him shoot and kill someone, them attempting to capture him was a reasonable response that shouldn’t have been met with lethal weaponry. \n\nThe fb group that he/his friends were a part of actively incited violence/spread misinformation/making claims about the protesters without substantiation in the form of dehumanizing protesters.\n\n—————-\n\nIf he was an adult carrying a firearm and part of a productive counter protest with no violent propaganda against the protesters then yeah, he would have have been justified in being there.\n\n[Also to your claim he was definitely allowed to be in possession of that firearm](https://www.politifact.com/factchecks/2020/aug/28/facebook-posts/did-kyle-rittenhouse-break-law-carrying-assault-st/)",
                          "timestamp": "2021-11-16 21:16:17",
                          "score": 6,
                          "num_children": 0,
                          "author": 15659,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hkwnc8g",
                      "text": "[removed]",
                      "timestamp": "2021-11-16 21:41:57",
                      "score": -10,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hkznkmx",
                          "text": "Another shitty argument.\n\nTwo wrongs don't make a right, FFS.",
                          "timestamp": "2021-11-17 14:23:11",
                          "score": 1,
                          "num_children": 1,
                          "author": 205481,
                          "replies": [
                            {
                              "id": "hkzoj3p",
                              "text": "Well I see you are ignoring the fact that Kyles rifle was not illegally in his possession. \n\nBut regardless, my point is that both of them have a right to be there. Neither of them forfeit their right to self defence just because they went somewhere that was dangerous, what a ridiculous thing to imply.",
                              "timestamp": "2021-11-17 14:30:33",
                              "score": 0,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hkzp9le",
                                  "text": "They were both in the wrong so neither was right, how is that ridiculous?",
                                  "timestamp": "2021-11-17 14:36:09",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 205481,
                                  "replies": [
                                    {
                                      "id": "hkzpvwu",
                                      "text": "Because, as I just explained, nothing of what you said is relevant to the question of whether or not it was self-defence, which it was.\n\nStill not acknowledging the misinformation you’re spreading about his rifle being in his possession illegally, I see.",
                                      "timestamp": "2021-11-17 14:40:45",
                                      "score": 0,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hkzskgr",
                                          "text": ">Still not acknowledging the misinformation you’re spreading about his rifle being in his possession illegally, I see.\n\nDid I say that?\n\nAlso, how is self defense when you start the problem, he brought it on himself, no sympathy from me.",
                                          "timestamp": "2021-11-17 15:00:14",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 205481,
                                          "replies": [
                                            {
                                              "id": "hkzwd4a",
                                              "text": "He didnt start the problem, he was attacked.\n\nBeing somewhere with a weapon is not starting something.",
                                              "timestamp": "2021-11-17 15:27:00",
                                              "score": 0,
                                              "num_children": 0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hkznh2o",
                  "text": "What a shitty argument.\n\nTwo wrongs don't make a right, FFS.",
                  "timestamp": "2021-11-17 14:22:25",
                  "score": 1,
                  "num_children": 0,
                  "author": 205481,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hkvz70x",
          "text": "How is this in any way relevant to what the tweet is saying?",
          "timestamp": "2021-11-16 19:03:13",
          "score": 35,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hkvw8p8",
          "text": "But when a cop shows up and shoots someone all of a sudden the cops the bad guy.",
          "timestamp": "2021-11-16 18:43:58",
          "score": -39,
          "num_children": 3,
          "author": 301988,
          "replies": [
            {
              "id": "hkw8l42",
              "text": "Yes, and?",
              "timestamp": "2021-11-16 20:05:14",
              "score": 23,
              "num_children": 0,
              "author": 11684,
              "replies": []
            },
            {
              "id": "hkwezrm",
              "text": "Showing up anywhere and shooting anyone is bad. Solved that for ya. Doesn't matter if they have a title or not, deadly force is almost never the answer.",
              "timestamp": "2021-11-16 20:47:13",
              "score": 13,
              "num_children": 0,
              "author": 147222,
              "replies": []
            },
            {
              "id": "hky4p4d",
              "text": "Fuck the police",
              "timestamp": "2021-11-17 04:11:50",
              "score": 4,
              "num_children": 0,
              "author": 52133,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hkvzng4",
      "text": "[removed]",
      "timestamp": "2021-11-16 19:06:16",
      "score": -28,
      "num_children": 2,
      "replies": [
        {
          "id": "hkw55ij",
          "text": "They were not and have not  been charged with anything, nor will they be.  Cause they're dead, dumbass.",
          "timestamp": "2021-11-16 19:42:36",
          "score": 35,
          "num_children": 0,
          "author": 323353,
          "replies": []
        },
        {
          "id": "hkw6610",
          "text": "They don't even get a chance to defend themselves in court.",
          "timestamp": "2021-11-16 19:49:23",
          "score": 25,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hkw0itj",
      "text": "[removed]",
      "timestamp": "2021-11-16 19:12:01",
      "score": -22,
      "num_children": 2,
      "replies": [
        {
          "id": "hkw7pk5",
          "text": "He had absolutely zero business being there. You can’t claim self defense when you put yourself into a hostile environment with the intent to add to the hostility.",
          "timestamp": "2021-11-16 19:59:29",
          "score": 34,
          "num_children": 1,
          "author": 15659,
          "replies": [
            {
              "id": "hkwa7id",
              "text": "[removed]",
              "timestamp": "2021-11-16 20:16:00",
              "score": -7,
              "num_children": 1,
              "replies": [
                {
                  "id": "hkwf5jj",
                  "text": "“Hostile environment or not, he was asked to go there by his friend”\n\nHe could have simply, *not gone*",
                  "timestamp": "2021-11-16 20:48:15",
                  "score": 12,
                  "num_children": 0,
                  "author": 15659,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hkw8wvh",
          "text": "He was \"taking the law into his hands\" \\*because\\* he went to the riots, fully armed, and looking to shoot protestors.",
          "timestamp": "2021-11-16 20:07:23",
          "score": 30,
          "num_children": 1,
          "author": 11684,
          "replies": [
            {
              "id": "hkw9ghi",
              "text": "[removed]",
              "timestamp": "2021-11-16 20:11:00",
              "score": -9,
              "num_children": 1,
              "replies": [
                {
                  "id": "hkwc6iw",
                  "text": "[deleted]",
                  "timestamp": "2021-11-16 20:28:57",
                  "score": 15,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hkwi1aj",
                      "text": "[deleted]",
                      "timestamp": "2021-11-16 21:06:58",
                      "score": -12,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hkwj58c",
                          "text": "[deleted]",
                          "timestamp": "2021-11-16 21:14:15",
                          "score": 8,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hkwkh5d",
                              "text": "[deleted]",
                              "timestamp": "2021-11-16 21:23:00",
                              "score": -5,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hkwg7o4",
      "text": "[removed]",
      "timestamp": "2021-11-16 20:55:01",
      "score": -9,
      "num_children": 1,
      "replies": [
        {
          "id": "hkwlqhx",
          "text": "So Kyle killed him. Premeditated murder it is.",
          "timestamp": "2021-11-16 21:31:19",
          "score": 12,
          "num_children": 0,
          "author": 286990,
          "replies": []
        }
      ]
    },
    {
      "id": "hkypk78",
      "text": "If he was a pedo (not sure what to believe about this case anymore) then he’s better of dead and anyone who disagrees is probably a pedophile.",
      "timestamp": "2021-11-17 07:52:52",
      "score": -6,
      "num_children": 0,
      "replies": []
    }
  ]
}