{
  "id": "qzijk8",
  "text": "oof\n",
  "timestamp": "2021-11-22 10:31:08",
  "score": 709,
  "subreddit": "t5_2zaj2",
  "num_children": 11,
  "replies": [
    {
      "id": "hlmr236",
      "text": "Can’t talk about a woman’s body unless it’s positive and even then you may be called a creep",
      "timestamp": "2021-11-22 12:33:10",
      "score": 73,
      "num_children": 1,
      "author": 312365,
      "replies": [
        {
          "id": "hlnrwuu",
          "text": "If the man looks plain, he's a creep. If handsome, then it's a compliment.",
          "timestamp": "2021-11-22 17:20:31",
          "score": 28,
          "num_children": 0,
          "author": 5390,
          "replies": []
        }
      ]
    },
    {
      "id": "hlmrfyf",
      "text": "Double standards",
      "timestamp": "2021-11-22 12:37:15",
      "score": 41,
      "num_children": 0,
      "author": 123481,
      "replies": []
    },
    {
      "id": "hlo7yhf",
      "text": "#THATS LOTS OF DAMGE",
      "timestamp": "2021-11-22 19:06:14",
      "score": 28,
      "num_children": 1,
      "replies": [
        {
          "id": "hnic83d",
          "text": "Ah yes DAMGE",
          "timestamp": "2021-12-06 21:18:27",
          "score": 2,
          "num_children": 0,
          "author": 106702,
          "replies": []
        }
      ]
    },
    {
      "id": "hlp7rcl",
      "text": "i mean he is right. if women can say shit men should be free to say it back",
      "timestamp": "2021-11-22 23:12:27",
      "score": 14,
      "num_children": 0,
      "author": 260289,
      "replies": []
    },
    {
      "id": "hlo8peb",
      "text": "Here's another example:\n\nIf a woman is fat, she's considered to be \" plus sized\", but if a man is fat, he's considered to be \"obese\" or a \"fat-ass\". Also if a man says the latter to a woman, he's instantly seen as misogynistic or fatphobic.",
      "timestamp": "2021-11-22 19:11:16",
      "score": 26,
      "num_children": 1,
      "author": 205200,
      "replies": [
        {
          "id": "hpjxn7l",
          "text": "I’m sorry, do you know the dad bod? So many women are attracted to that, meanwhile milfs are women after their late twenties that manage to have the proportions of a 19 year old.",
          "timestamp": "2021-12-22 13:24:32",
          "score": 1,
          "num_children": 0,
          "author": 267303,
          "replies": []
        }
      ]
    },
    {
      "id": "hlnqran",
      "text": "What she should have said is that grey sweatpants are for showers, not growers.\n\nAnd, Alexander should've pointed out all the obese chicks in leggings/yoga pants. There should be a law against that.",
      "timestamp": "2021-11-22 17:12:48",
      "score": 21,
      "num_children": 1,
      "replies": [
        {
          "id": "hlpznju",
          "text": "I don't even understand what kind of person feels the need to check out and judge random dude's dicks though... that's pretty creepy imo.\n\nIt's just gross, selfish, and sexually objectifying...",
          "timestamp": "2021-11-23 02:49:33",
          "score": 5,
          "num_children": 0,
          "author": 215395,
          "replies": []
        }
      ]
    },
    {
      "id": "hlpmjmq",
      "text": "Bitches with long backs. HAHAHA I haven't heard that one.",
      "timestamp": "2021-11-23 01:07:19",
      "score": 6,
      "num_children": 0,
      "author": 237857,
      "replies": []
    },
    {
      "id": "hlyzmxu",
      "text": "How about we stop sexualizing people altogether??",
      "timestamp": "2021-11-25 00:26:46",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "hmcubme",
          "text": "So start dressing like puritans again?",
          "timestamp": "2021-11-28 03:20:03",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "hmcwrts",
              "text": "No. Stop sexualizing people",
              "timestamp": "2021-11-28 03:40:33",
              "score": -2,
              "num_children": 1,
              "replies": [
                {
                  "id": "hmcwwqq",
                  "text": "I’m sorry but how in the fuck does anyone just shut off 1’000s-millions? of years of genetics and hormones???? \n\nPlease step into reality.\n\nThat’s like me saying stop PMSing.\nIt’s foolish and impossible to expect hormones to be controllable.",
                  "timestamp": "2021-11-28 03:41:40",
                  "score": 2,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "hmcxdfm",
                      "text": "It's called self control bozo. Learn it",
                      "timestamp": "2021-11-28 03:45:30",
                      "score": 0,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "hpjxhqg",
                      "text": "People manage to eat healthy despite their bodies being trained through 1000’s-millions of years to prefer fatty, salty and sweet. If that is possible, then you can also let people wear their clothes in peace.",
                      "timestamp": "2021-12-22 13:23:04",
                      "score": 1,
                      "num_children": 1,
                      "author": 267303,
                      "replies": [
                        {
                          "id": "hpkawpj",
                          "text": "It was a question, not an expectation.",
                          "timestamp": "2021-12-22 15:11:58",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hmf1srh",
      "text": "Left out likes and retweets..  odd",
      "timestamp": "2021-11-28 16:52:52",
      "score": 2,
      "num_children": 0,
      "author": 64749,
      "replies": []
    },
    {
      "id": "hlo943r",
      "text": "I have questions is there any problem I send meme about bully femenist  please tell me",
      "timestamp": "2021-11-22 19:13:59",
      "score": 0,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hln62d1",
      "text": "Ah yes, tara🌧, the well known feminist speaker…\n\nThis sub should be called r/antiwomen",
      "timestamp": "2021-11-22 14:48:32",
      "score": -49,
      "num_children": 2,
      "author": 296869,
      "replies": [
        {
          "id": "hlnasie",
          "text": "So being against someone body shaming is being antiwomen to you? How so?",
          "timestamp": "2021-11-22 15:23:37",
          "score": 31,
          "num_children": 1,
          "replies": [
            {
              "id": "hlncadf",
              "text": "Did I say that? Is “tara🌧” a feminist? Is what she’s saying rooted in feminist ideology or theory? No, so what does this have to do with being against feminism, which is the entire point of this sub? Does this have more to do with feminism or the fact she’s a woman?",
              "timestamp": "2021-11-22 15:34:25",
              "score": -24,
              "num_children": 2,
              "author": 296869,
              "replies": [
                {
                  "id": "hlne6ov",
                  "text": "It has to do because feminists are pushing about body acceptance as a really strong point. Which is fine, but at the same time they find funny when a man has a small penis, or is short for example and other abusive shit they find funny. And yes this is about feminism and this is a double standard. I am very sad for you if you think there's nothing wrong with this double standard. You are just labeling people who say things you don't like as mysognists to silence them. I wish you luck with that mindset.",
                  "timestamp": "2021-11-22 15:47:44",
                  "score": 22,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hlnewea",
                      "text": "Is “tara🌧” a feminist, or does this post have more to do with the fact she’s a woman? In what way does feminist ideology support body shaming against men? Most people I know (including myself) are feminists, but none of them support body shaming people. So when you say “they,” who do you mean, exactly?",
                      "timestamp": "2021-11-22 15:52:39",
                      "score": -16,
                      "num_children": 2,
                      "author": 296869,
                      "replies": [
                        {
                          "id": "hlngiir",
                          "text": "Feminist ideology finds bodyshaming men funny. I bet my ass this woman is an outspoken feminist. The discussion is here how would it look if a man made a tweet about tight clothes are for women with big breasts , not flat surfboards. It would be chauvinistic , even if the person doesn't identify as chauvinisitic. Hence the same happens here. I'm done trying to explain to you, you seem to be caught in this \"feminism=equality\" that isn't true and has nothing to do with reality. As I said I wish you luck with that mindset.",
                          "timestamp": "2021-11-22 16:03:44",
                          "score": 18,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hlni1gr",
                              "text": ">feminist ideology finds bodyshaming men funny\n\nSource? I wasn’t aware feminist ideology was so based around humor and comedy.\n\n>I bet my ass this woman is an outspoken feminist\n\nSo, in other words, you’re assuming. OP did too. Hence, r/antiwomen.\n\n>it would be chauvinistic even if the person doesn’t identify as chauvinistic\n\nTrue, because chauvinistic is a word with a specific meaning which can be used to describe things. If someone is acting chauvinistic, they are acting chauvinistic. How does this relate to the tweet?\n\n>you seem to be caught in this “feminism=equality”\n\nHow is it not? Feminism is inherently based around equality, what you’re describing is not feminism. Feminism is “the advocacy of women’s rights on the basis of the equality of the sexes.” Like your example with the word chauvinistic, if someone advocates for women’s rights on the basis of the equality of the sexes, that means they are a feminist, regardless of whether or not they identify as such.",
                              "timestamp": "2021-11-22 16:14:05",
                              "score": 1,
                              "num_children": 2,
                              "author": 296869,
                              "replies": [
                                {
                                  "id": "hlnp01l",
                                  "text": "> Source? I wasn’t aware feminist ideology was so based around humor and comedy.\n\nI wonder how comedic my tweets would be if I started talking about how boring a loose vagina is, and start talking about gravity making things drop over the years etc.  You are a joker if you think there's equality about this. I am not going to dissect each and every messed up point in your ramble as I don't have time.",
                                  "timestamp": "2021-11-22 17:01:04",
                                  "score": 10,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hlnpu01",
                                      "text": "Wdym by loose vagina? You know it’s a [myth](https://www.healthline.com/health/womens-health/loose-vagina#_noHeaderPrefixedContent) that women get “looser” the more they have sex, right? Also, ironically, there are fucking TONS of jokes about loose vaginas. Donut holes? There are plenty of people making jokes about how gravity makes things drop over the years. You literally just made one, I don’t think gravity is one of the leading causes of breast sag, so that’s a joke.\n\nYou “don’t have time” because you know you’re talking out of your ass, assuming things, and misrepresenting shit.",
                                      "timestamp": "2021-11-22 17:06:37",
                                      "score": 0,
                                      "num_children": 1,
                                      "author": 296869,
                                      "replies": [
                                        {
                                          "id": "hlnyw90",
                                          "text": "Of couse there are jokes, but I don't see anyone posting this on social networks and people saying \"yas! you go king!\" like an empowering move and I would get banned for hate speech in no time. And with good reason too, what I don't understand why women don't get banned for the same thing, specially legions of whiteknights or bitter women whatever applies to you defend these posts (like you are doing). You are truly defending an undefendable position. And yes I had to go pick up my children from Judo. From the sounds of it, you don't have a life but some of us do.",
                                          "timestamp": "2021-11-22 18:06:09",
                                          "score": 6,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "hlnz32n",
                                              "text": "Who says male body shaming is empowering, or reacts to it with \"yas! you go king!\"",
                                              "timestamp": "2021-11-22 18:07:23",
                                              "score": 3,
                                              "num_children": 1,
                                              "author": 296869,
                                              "replies": [
                                                {
                                                  "id": "hlnzs1s",
                                                  "text": "Just take a look at any /r/FemaleDatingStrategy post to see what I mean.",
                                                  "timestamp": "2021-11-22 18:12:00",
                                                  "score": 4,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "hlo04bw",
                                                      "text": "You’re using a sub known for women being casually sexist as a way to judge all women? Should I judge all men or all men’s rights activists based on what I see on r/incel or r/mgtow? Why not look at r/feminism, you know, actual feminist spaces dedicated for feminism?",
                                                      "timestamp": "2021-11-22 18:14:14",
                                                      "score": 3,
                                                      "num_children": 1,
                                                      "author": 296869,
                                                      "replies": [
                                                        {
                                                          "id": "hlo0l2n",
                                                          "text": "I'm not judging women. I 'm judging third wave feminism. I am antifeminist, not antiwomen.\n\n>  r/incel or r/mgtow\n\nthose were banned while FDS is kept up, you need to stop calling misogynistic people who say things you don't like.",
                                                          "timestamp": "2021-11-22 18:17:19",
                                                          "score": 2,
                                                          "num_children": 1,
                                                          "replies": [
                                                            {
                                                              "id": "hlo0s91",
                                                              "text": "You judged \"tara\" ... In what way is she third wave feminism? You don't even know if she identifies as a feminist or if she is one.\n\nFDS was probably left up because it more closely resembles r/mensrights or this sub... ie the point isn't inherently sexist, it just attracts sexists and therefore sexism is fairly common in the comments.",
                                                              "timestamp": "2021-11-22 18:18:39",
                                                              "score": 2,
                                                              "num_children": 1,
                                                              "author": 296869,
                                                              "replies": [
                                                                {
                                                                  "id": "hlocjz5",
                                                                  "text": "menrights doesn't have a derogatory name for women (\"scrotes\") and doesn't talk about how you need to manipulate and suck men dry of their money as quick as possible and other disturbing stuff. You are comparing things that have nothing to do with each other. I don't agree with some of the stuff in MRA but I don't think it's a hate group, it just outlines inequalities like these one here (like how much time you are spending defending a body shamer just because she has a vagina), justice inequalities when it comes to custody of children etc. It got so bad that there needs to be a men's rights movement. You are a toxic piece of crap, or a troll, probably both.",
                                                                  "timestamp": "2021-11-22 19:37:00",
                                                                  "score": 2,
                                                                  "num_children": 1,
                                                                  "replies": [
                                                                    {
                                                                      "id": "hlocnq8",
                                                                      "text": "No, but they do have a lot of sexism... Which is why the comparison works.",
                                                                      "timestamp": "2021-11-22 19:37:41",
                                                                      "score": 2,
                                                                      "num_children": 1,
                                                                      "author": 296869,
                                                                      "replies": [
                                                                        {
                                                                          "id": "hloe4pw",
                                                                          "text": "It really doesn't, no.",
                                                                          "timestamp": "2021-11-22 19:47:39",
                                                                          "score": 2,
                                                                          "num_children": 1,
                                                                          "replies": [
                                                                            {
                                                                              "id": "hlogfgd",
                                                                              "text": "It really does... One of the biggest criticisms of MRA spaces is how much sexism is there.\n\nI mean look at this post... this sub is meant to be about feminism, and yet posts like this, which objectively have nothing to do with feminism, are allowed. Look at these comments... You've admitted to assuming shit about her merely because she is a woman.\n\nDid I say the MRA is a hate group? When did I defend a body shamer?",
                                                                              "timestamp": "2021-11-22 20:03:01",
                                                                              "score": 1,
                                                                              "num_children": 1,
                                                                              "author": 296869,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "hlox71a",
                                                                                  "text": "God, I fucking hate people like them. Their arguments are always the same, and clearly it's a terrible thing to so much as discuss any other person's body. I'm sorry you have to deal with them. (Oh, who am I kidding, he's clearly a man. Only men and indoctrinated women believe in male supremacy.) My advice: don't debate him. I did once. It went on for days, and he still couldn't think straight. Give it up.",
                                                                                  "timestamp": "2021-11-22 21:56:06",
                                                                                  "score": -2,
                                                                                  "num_children": 1,
                                                                                  "author": 196433,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "hloxo8w",
                                                                                      "text": "Suck my balls, what about that.",
                                                                                      "timestamp": "2021-11-22 21:59:27",
                                                                                      "score": 3,
                                                                                      "num_children": 1,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "hloy5o7",
                                                                                          "text": "Witty, as always my friend.",
                                                                                          "timestamp": "2021-11-22 22:02:53",
                                                                                          "score": -2,
                                                                                          "num_children": 1,
                                                                                          "author": 196433,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "hlp1pa8",
                                                                                              "text": "you got it, I love how the moment someone doesn't treat women like unaccountable children you girls label them as misogynistic. Proves feminists want nothing to do with logic. It's cute in a fucked up way ♥",
                                                                                              "timestamp": "2021-11-22 22:28:18",
                                                                                              "score": 3,
                                                                                              "num_children": 1,
                                                                                              "replies": [
                                                                                                {
                                                                                                  "id": "hlp2vqk",
                                                                                                  "text": "Aw, it's so cute how you think basic kindness and rights are for children. Proves how much misogynists either want to treat women like children or treat them like inferiors and complain when advancing society and fed up people don't like their conservative stupidity. Have fun living in oppressive hell and still feeling like the oppressors are the ones being oppressed. Funny how history repeats itself... Funny how society advances with acceptance and decency instead of backing up hundreds of years in values. You're cute in a fucked up way too hon. 🖤",
                                                                                                  "timestamp": "2021-11-22 22:36:49",
                                                                                                  "score": -3,
                                                                                                  "num_children": 1,
                                                                                                  "author": 196433,
                                                                                                  "replies": [
                                                                                                    {
                                                                                                      "id": "hlpe9aj",
                                                                                                      "text": "You want to be treated in a special way and you are rambling about some preprocessed discussion about history and mysoginism that has nothing to do with what's being discussed. I take offense on you thinking I'm a mysoginist and I expect you to apologize for that. Try reversing the gender of what you are saying and see how unfair is to when using your little bullcrap speech",
                                                                                                      "timestamp": "2021-11-23 00:01:45",
                                                                                                      "score": 2,
                                                                                                      "num_children": 2,
                                                                                                      "replies": [
                                                                                                        {
                                                                                                          "id": "hlpj615",
                                                                                                          "text": "Wow. You both should really get a life.",
                                                                                                          "timestamp": "2021-11-23 00:40:34",
                                                                                                          "score": 5,
                                                                                                          "num_children": 2,
                                                                                                          "author": 299481,
                                                                                                          "replies": [
                                                                                                            {
                                                                                                              "id": "hlpl9wk",
                                                                                                              "text": "Thank you for the lighthearted comment ♥",
                                                                                                              "timestamp": "2021-11-23 00:57:20",
                                                                                                              "score": 5,
                                                                                                              "num_children": 0,
                                                                                                              "replies": []
                                                                                                            },
                                                                                                            {
                                                                                                              "id": "hlpmse0",
                                                                                                              "text": "I've got one. Not sure about him though. Hateful lives don't count.",
                                                                                                              "timestamp": "2021-11-23 01:09:14",
                                                                                                              "score": 0,
                                                                                                              "num_children": 0,
                                                                                                              "author": 196433,
                                                                                                              "replies": []
                                                                                                            }
                                                                                                          ]
                                                                                                        },
                                                                                                        {
                                                                                                          "id": "hlpogg8",
                                                                                                          "text": "I am unable to reverse the gender of my argument because it does not apply to male people. They have literally never been oppressed as a whole. As for your male entitlement, I shall not apologize for calling you a misogynist because that is exactly what you are. You have very clearly displayed traditional beliefs and values. It's the same (of course on a bit of a lower level) as alt-right fascists claiming that white people are oppressed because they are, consciously or not, bitter that those who are oppressed are becoming less oppressed. It is hard arguing with someone who is so extraordinarily gullible to the point where they have so little self worth and decide to direct it towards hatred. I truly am sorry for whatever conditions you grew up in that may have made it that way. But you have control over yourself now, so it's time to stop acting like you're in a different century, and start seeing things as they are. A misogynist is someone who hates women. You claim to be insulted by me calling you this, but is it so far from the truth? Are you that blind? It's shocking and sad reading your comments. I wish you the best of luck on your perspective, and that's all I can do for now. You've made up your mind to be hateful, no matter what bullshit you spew about men being oppressed. Of liberals and conservatives, both of whom are awful, conservatives are the worst. I'm 99% sure you're conservative. Well, this became very off topic, but, again, I really, truly, not sarcastically pity you. I hope some day you move past taking sides and pointing fingers, and you see that everyone must stand together regardless of gender to fight for equality for all people and classes. I cannot respond to you any further, but please take a little of this to heart, my friend.",
                                                                                                          "timestamp": "2021-11-23 01:22:33",
                                                                                                          "score": 0,
                                                                                                          "num_children": 1,
                                                                                                          "author": 196433,
                                                                                                          "replies": [
                                                                                                            {
                                                                                                              "id": "hlpsanz",
                                                                                                              "text": "Wow you called me a nazi too pretty much. I can see logic is not your forte. You know nothing about me, and basically all those comments are projections of someone you hate, I'm guessing your dad or something. Don't make 50% of the world population pay for something someone did to you. You will live much happier without this intense hatred you have for men. Wish you luck buddy.",
                                                                                                              "timestamp": "2021-11-23 01:52:16",
                                                                                                              "score": 3,
                                                                                                              "num_children": 1,
                                                                                                              "replies": [
                                                                                                                {
                                                                                                                  "id": "hlpsu6s",
                                                                                                                  "text": "I most certainly did not insult you to that point. I made a simple comparison. No one did anything to me, and I was talking only based on the views you have shared in the past when probed in argument. I do not hate men or any general people, and equality is what I always strive for. I guarantee you that if you pick up a history textbook or take a look at current events you will see clearly that men have the advantage because of peoples' mindsets.",
                                                                                                                  "timestamp": "2021-11-23 01:56:27",
                                                                                                                  "score": 0,
                                                                                                                  "num_children": 1,
                                                                                                                  "author": 196433,
                                                                                                                  "replies": [
                                                                                                                    {
                                                                                                                      "id": "hlpvqfv",
                                                                                                                      "text": "I'm pro equality, sounds you are too. You seem to see things from the feminist point of view and as long as feminism pushes for equality I will encourage this. But in its current form it isn't. Agree to disagree. Good luck to you.",
                                                                                                                      "timestamp": "2021-11-23 02:18:44",
                                                                                                                      "score": 3,
                                                                                                                      "num_children": 1,
                                                                                                                      "replies": [
                                                                                                                        {
                                                                                                                          "id": "hlpwlxr",
                                                                                                                          "text": "I'm glad to hear that you are pro equality. Unfortunately you cannot see that feminism, by definition and in action, is advocacy for the equality of the genders. There may be some cases of misandry, but as a mass, it is nonexistant. There are plenty of abusive women out there, and that does need to stop, along with the few exceptions of women who do hate men. But it's not easy walking down the street and being scared simply for your life. It's terrifying when men violate you in public when you did nothing. And you can imagine, reading things like this and then some things that are just blatantly misogynistic is so incredibly infuriating. All I want is for the sexes to have equal rights, equal pay, and for us to be able to step outside our houses without constant anxiety. I wish men could step in our shoes for just one day. One singular day. Then they'd probably write about how men were forced into that position by women and how awful we are. I wish I were a man so I could live without fear and discrimination.",
                                                                                                                          "timestamp": "2021-11-23 02:25:35",
                                                                                                                          "score": 0,
                                                                                                                          "num_children": 1,
                                                                                                                          "author": 196433,
                                                                                                                          "replies": [
                                                                                                                            {
                                                                                                                              "id": "hlpxgzu",
                                                                                                                              "text": "We'll see. I abhorr abuse on either gender but the feminist agenda yes, tries to push female abusers as incapable of wrongdoing and that needs to stop.",
                                                                                                                              "timestamp": "2021-11-23 02:32:22",
                                                                                                                              "score": 3,
                                                                                                                              "num_children": 1,
                                                                                                                              "replies": [
                                                                                                                                {
                                                                                                                                  "id": "hlpy47v",
                                                                                                                                  "text": "Again, you are talking about the wrong group of people. Feminists, real ones, do *not* enable or encourage abusers of any kind. No true advocate for equality would. Anyone claiming to be a feminists who does that is not a feminist, nor can their actions be called a feminist agenda.",
                                                                                                                                  "timestamp": "2021-11-23 02:37:23",
                                                                                                                                  "score": 0,
                                                                                                                                  "num_children": 1,
                                                                                                                                  "author": 196433,
                                                                                                                                  "replies": [
                                                                                                                                    {
                                                                                                                                      "id": "hlq294o",
                                                                                                                                      "text": "You are throwing a no true Scotsman fallacy but ok",
                                                                                                                                      "timestamp": "2021-11-23 03:10:04",
                                                                                                                                      "score": 2,
                                                                                                                                      "num_children": 0,
                                                                                                                                      "replies": []
                                                                                                                                    }
                                                                                                                                  ]
                                                                                                                                }
                                                                                                                              ]
                                                                                                                            }
                                                                                                                          ]
                                                                                                                        }
                                                                                                                      ]
                                                                                                                    }
                                                                                                                  ]
                                                                                                                }
                                                                                                              ]
                                                                                                            }
                                                                                                          ]
                                                                                                        }
                                                                                                      ]
                                                                                                    }
                                                                                                  ]
                                                                                                }
                                                                                              ]
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "hlt80gk",
                                  "text": "Feminism never was about equality but your mental gymnastics won't allow it.",
                                  "timestamp": "2021-11-23 20:21:14",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hlt8fem",
                                      "text": "\"The advocacy of women's rights on the basis of the equality of the sexes never was about equality but your mental gymnastics won't allow it.\"\n\nWith logic like that, I think the one doing mental gymnastics is you.",
                                      "timestamp": "2021-11-23 20:23:58",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 296869,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hlni9p7",
                          "text": "[deleted]",
                          "timestamp": "2021-11-22 16:15:41",
                          "score": 11,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hlnjhax",
                              "text": ">is applauded\n\nBy who? According to the pic, she wasn’t applauded at all, she was called out.\n\n>makes any comments about women’s body shapes or body parts it sparks complete and total outrage\n\nHow so? Sounds like an assumption or an anecdote to me (aka bullshit, because I haven’t seen that at all, in fact I’ve seen the exact opposite, men commenting on women’s bodies is incredibly common online)\n\n>perpetrated and enforced by feminism\n\nIn what way? Can you define feminism?\n\n>this girl doesn’t represent feminism shtick\n\nDoes she? If I look up famous or influential feminists on Wikipedia I’ll see tara🌧?\n\n>this woman is feminism \n\nNo, feminism is “the advocacy for women’s rights on the basis of the equality of the sexes,” not “tara🌧” You seem to be confused about this concept of feminism",
                              "timestamp": "2021-11-22 16:23:54",
                              "score": -1,
                              "num_children": 2,
                              "author": 296869,
                              "replies": [
                                {
                                  "id": "hlnjycw",
                                  "text": "Applauded by other feminists.  Its always “there are women In all different sizes” but nothing for men",
                                  "timestamp": "2021-11-22 16:27:07",
                                  "score": 8,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hlnkhld",
                                      "text": "By other feminists? Who? Do feminists just roam the streets and harass random men, making fun of their physical appearance?\n\nAnd no it’s not, I’ve seen men represented in body positivity stuff. In fact, men have a long [history](https://en.m.wikipedia.org/wiki/Body_positivity) within the body positivity movement as a whole.",
                                      "timestamp": "2021-11-22 16:30:43",
                                      "score": -2,
                                      "num_children": 1,
                                      "author": 296869,
                                      "replies": [
                                        {
                                          "id": "hlnspjn",
                                          "text": "Yes",
                                          "timestamp": "2021-11-22 17:25:51",
                                          "score": 3,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "hlnrhqh",
                                  "text": "[deleted]",
                                  "timestamp": "2021-11-22 17:17:42",
                                  "score": 5,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hlns3md",
                                      "text": "It’s not smug, it’s correct. The one pretending is you. Open a dictionary, educate yourself on the words you use before getting triggered about them.\n\nThat is what feminism is now. I don’t know what the definition of feminism used to be.",
                                      "timestamp": "2021-11-22 17:21:45",
                                      "score": -1,
                                      "num_children": 2,
                                      "author": 296869,
                                      "replies": [
                                        {
                                          "id": "hlonfrd",
                                          "text": "The dictionary definition is not what 3rd and 4th wave feminism is about at all. Stop being obtuse. This whole \"playing dumb\" behind the boiler plate definition is such an old trick that nobody falls for it anymore.",
                                          "timestamp": "2021-11-22 20:50:17",
                                          "score": 5,
                                          "num_children": 2,
                                          "replies": [
                                            {
                                              "id": "hlt8psq",
                                              "text": "Feminism was bad from the start, waves or not.",
                                              "timestamp": "2021-11-23 20:25:53",
                                              "score": 2,
                                              "num_children": 0,
                                              "replies": []
                                            },
                                            {
                                              "id": "hloooih",
                                              "text": "Oh yeah? Do you read a lot of 3rd/4th wave feminist literature, or participate in many feminist spaces?\n\nIf what you're saying is true, then it's not feminism, because feminism is the \"advocacy for women's rights on the basis of the equality of the sexes.\" And of course by \"old trick\" you mean... looking up a word you don't know in the dictionary...",
                                              "timestamp": "2021-11-22 20:58:34",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 296869,
                                              "replies": [
                                                {
                                                  "id": "hlp2fta",
                                                  "text": "You're definition is bullshit and minimum 20 years old.\n\nThe new definition born in the 3rd wave and prevalent in the 4th uses the term \"equity\" because all \"equality\" got women was \"equal opportunity\" which did not produce the desired outcome.\n\nAlso, too, the 3rd wave fight for complete sexual autonomy for female sexual behavior (destigmatizing sex work, promiscuity, ending \"slut shaming\") while putting tighter controls on male sexual behavior. VAWA gave women the power to \"phone in\" a male partner who is often arrested and removed from the residence even if there is no evidence he (or even ANYONE) is in danger. #metoo gave women the ability to ruin a a man's career and with mantra like #believewomen, do so even when it's based on  a false allegation. 3rd wave feminism is about full sexual autonomy for women while putting further limits and accountability on men for \\*their\\* behavior.\n\nFourth wave is about the next thing being targeted by the gender \"Oppression Police\"  - the idea that gender is a major source of discrimination and oppression and, like the family unit destroyed in the 2nd wave, can also be destroyed.\n\nFourth wave feminism is about pushing the new \"gender is a fluid social construct\" narrative. It's about turning all previously known ideas about what it means to be a man or a woman on it's head. It's about ensuring \"early child educations\" and \"gender professionals\" can groom small school children into getting gender reassignment surgery without their parents' knowledge or consent. Still reeling from the contradictory and often comical \"what defines a good man\" theories from the 3rd wave, the 4th wave is even more ludicrous from a male perspective.  It seems to suggest that penis owners should just shut up and disengage from society because \"we've had our turn\" and are just \"rapey exploiters\" anyways. One good thing about forth wave feminism is the high level of feminist infighting over the entire trans \"problem\". \"Woke\" feminists are SJWs who say trans women are women and to say otherwise is bigotry. \"Fundamental\" radical feminists say trans women were not born female, are not truly female, and can never be truly female or have truly female lived experiences. One point the radical feminists make is that a penis-equipped trans woman can rape other women with \"her\" penis when in the same jails. So, it's a neat little source of major infighting between \"woke\" feminists and \"radical\" feminists. Personally, I prefer a nice low-fat popcorn for watching these fights because I have yet to see any progress in the male fat acceptance movement for men because, oh wait, there will never BE such a movement for men. Body positivity is still a female and only female privilege.\n\nBut no, it's not about \"equality between the sexes\" and never was since somewhere towards the end of the 2nd wave.\n\n3rd and 4th wave feminism is Marxist brain cancer fighting against Woke SJW brain cancer. Let's see which cancer is stronger.\n\nFeminism is now about signing off on any sexual behavior women want to partake in, the furtherance of less due process for men accused of sexual-related crimes, de-construction of gender, and more insidious affirmative action and quota requirements for women, minorities and other \"marginalized\".\n\nIf you do spend all that time in modern feminist circles, that just proves what a bold-faced liar you are. Remember, we're not listening to the words of feminism (or women) any longer. We're watching your actions and actions speak louder than words.",
                                                  "timestamp": "2021-11-22 22:33:37",
                                                  "score": 5,
                                                  "num_children": 2,
                                                  "replies": [
                                                    {
                                                      "id": "hlt8way",
                                                      "text": "Feminism was bad from the start :)",
                                                      "timestamp": "2021-11-23 20:27:03",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "replies": []
                                                    },
                                                    {
                                                      "id": "hlp58io",
                                                      "text": "Wow... To think you could've avoided x amount of your life typing up that triggered, nonsensical, incorrect, utterly delusional rant (which briefly appeared to become transphobic for no real reason) of a comment by spending 30 seconds reading...\n\nhttps://www.merriam-webster.com/dictionary/feminism\n\nI also recommend skimming through these, because your perceptions of third and fourth wave feminism are slightly off, to say the least.\n\nhttps://en.wikipedia.org/wiki/Third-wave_feminism\n\nhttps://en.wikipedia.org/wiki/Fourth-wave_feminism\n\nI also like how you avoided the question: \"Do you read a lot of 3rd/4th wave feminist literature, or participate in many feminist spaces,\" because after skimming through your comment I think we both know the answer is something along the lines of \"No, I've done no real research into this, my entire view of feminism is based on anecdotes I can recall from \"anti-feminist\" echo chambers on various social media platforms. I have also never spoken to a woman or a feminist in real life.\"",
                                                      "timestamp": "2021-11-22 22:53:53",
                                                      "score": -1,
                                                      "num_children": 1,
                                                      "author": 296869,
                                                      "replies": [
                                                        {
                                                          "id": "hlp5scn",
                                                          "text": "Again, I don't read the Guardian or Wikipedia.\n\nI just watch what the radicals are doing, and saying.\n\nBut nice try to keep their image relatively clean.\n\nWikipedia is useless. They have feminist writers who are able to successfully defend against all discourse. There are people who work FULL TIME on keeping the definitions of feminism \"neutral\" while ensuring words like \"MGTOW\" paint a picture of an alt-right woman killer.  Of course, they're not paid to do this work. Feminism hasn't toppled Patriarchy OR capitalism yet... *but one day...*\n\nSo, me nd my peers reject your sources.\n\nThey are not *peer reviewed.* By me. Or my peers.\n\n***See how that works?***\n\nOff to gender studies class with you.\n\nOH HOW DID I FORGET:\n\nAdd to fourth wave:\n\nStarted in 3rd but really gained traction in 4th.\n\nAs it became clear that \"Equal Opportunity\" was not giving women \"parity or better\" in all fields (and STEM is still untouchable) the new \"equity\" social constructionists went to work. Wage gap is now a thing of the past if you look at people under 25, where degreed women are out-earning their male counterparts. (Still waiting for feminists to explain how even though they have more money they have less buying power because of Patriarchy... oh wait they did that with Pink Razor Theory.)\n\n# Enter UNPAID LABOR.\n\nThree main unpaid labor speaking points.\n\n1. Emotional labor\n2. Unpaid domestic labor\n3. Unpaid child care\n\nSome suggest that organizing social aspects of work (that work doesn't really mandate) should be done on a voluntary basis - that no expectation of \"pay\" should be made. Could we do a draw at work to see who picks up the birthday cake for cake day at work? Sure we could. Or, like my office, cake day died a natural death when we started working without an \"Administrative Coordinator\". Guess it wasn't really all that important...\n\nUnpaid domestic labor, the biggest joke ever, is about women in relationships who do more work than their partners do. Why feminist women are even concerned at ALL about partnered women is beyond me. They are trying to politicize distribution of labor in people's relationships forgetting that many women (and many men) do ALL of their OWN domestic labor. So... paying someone to do their own laundry starts to sound quite ludicrous... and it  is. Society's answer has been \"Well, then stop doing it all, or leave the person\" aka a grown up solution. Feminists respond with tantrums about Patriarchy and how she is \"forced\" to do it.\n\nUnpaid Child care. Again, most adults think that parents need to figure out how to take care of their own kids. And again, if he's not pulling his weight, that sounds like a \"couples\" problem and not a taxpayers problem. But women want child rearing (and domestic chores) to be somehow included in the Gross National Product aka part of the economy. Well, sorry for this. Taxpayers are not paying you to do your own shit. They also don't like it being called into attention that a big reason for the (now defunct) wage gap is that men work more hours, she SHE has more hours in the day for what now? DOMESTIC WORK AND CHILD CARE.\n\n**Sorry can't believe I forgot the whole \"pay me for doing my laundry and taking care of my own children\" thing.**\n\nNow, if \"Patriarchy\" had you taking care of OTHER PEOPLE'S laundry or children \"for free\" then I might lend you an ear.\n\nTo feminist women thinking of starting family: Nobody is going to pay you to wash your own clothes and care for your own children. If you think being a wife and mother should be a PAID POSITION, take it up with YOUR HUSBAND.\n\nMEN: If she identifies as feminist, she will be a SHIT WIFE and SHIT MOTHER and always expecting to be paid for everything she does. DO NOT MARRY HER.\n\nlol thank you.",
                                                          "timestamp": "2021-11-22 22:57:54",
                                                          "score": 4,
                                                          "num_children": 1,
                                                          "replies": [
                                                            {
                                                              "id": "hlp7jgt",
                                                              "text": "I mean, I can find you a more reliable source which shows you you're wrong... But Wikipedia and the dictionary aren't a bad place to start if you're looking to become even slightly informed about something, especially for someone who's main source of information appears to be tumblrinaction and \"ben shaprio PWNS CRAZY LIBTARD FEMINAZI\" clips from 2016.",
                                                              "timestamp": "2021-11-22 23:10:49",
                                                              "score": 0,
                                                              "num_children": 1,
                                                              "author": 296869,
                                                              "replies": [
                                                                {
                                                                  "id": "hlphps0",
                                                                  "text": "I don't need your sources. The \"good ones\" are \"peer reviewed by left-wing ideologue echo chambers\" and gender studies faculties. They're drenched in Marxism and really of no value to anyone.\n\nI'm not wrong, I'm right. I've seen feminism in action and what it really does. I've seen feminism in marriages, divorce court, child custody battles, school classrooms, parent teacher associations, school and daycare curriculum and all over the news. #metoo trials by fire. Men's careers ended before any evidence is even presented.\n\nSocialism, Marxism and feminism is fighting it's way into mainstream ideology. They are preying on young minds and scaring them into membership:\n\n*\"You will never win playing their game. You are a woman. You are a minority. You'll never be able to overcome the obstacles of your oppression or compete with those who are awash in unearned privilege!\"*\n\nSo of course the college-aged women freak out! SUCH INJUSTICE! Well, with no life experience and this short-haired green-haired lady in bad clothes telling **the untold truth of Patriarchy!** WOW! Where do I sign up and *can I get that Che Guevara T-shirt in white?!?*\n\nMost people's political leanings balance out once they get into the real (working) world but some people hold on desperately to their victim status because they've been permanently mentally damaged by those who's only political power is to indoctrinate other people's children in post-secondary environments.\n\nPart of the \"work\" I do is work with like minded people to pressure governments to partially or even completely defund highly-political-biased humanities programs. Those peeps don't really want all that dirty capitalist oil and big pharma tax money anyways, do they? If you think of it, we're doing them a favor. In times when budgets are incredibly tight and the COVID supply chain is wreaking economic havoc, it's a GREAT time to claw back at these bloated humanities programs and cut them back down to size.\n\nNow is the perfect time to *strike.*\n\nWe can't cure \"the cancer\" but we can hack off a large chunk off the proverbial tumor. \n\nAnyways, I have politicians to hound and letters to write...\n\nThe polarized political spectrum is also very helpful - my job is easy when half of people already fully agree with me and just a few on the left-leaning side need to be **awaken from their woke. More and more people on Reddit are coming out as \"formerly Woke\". It's heart warming, really.**\n\nToodles!",
                                                                  "timestamp": "2021-11-23 00:29:09",
                                                                  "score": 5,
                                                                  "num_children": 1,
                                                                  "replies": [
                                                                    {
                                                                      "id": "hlpio9z",
                                                                      "text": "No, you don’t need “my” sources, you’re free to delude yourself however you like. The danger is just when you try to convince others your delusions are true. \n\nAlso, feminism is already mainstream, most people believe in gender equality.",
                                                                      "timestamp": "2021-11-23 00:36:39",
                                                                      "score": 1,
                                                                      "num_children": 1,
                                                                      "author": 296869,
                                                                      "replies": [
                                                                        {
                                                                          "id": "hlplx4v",
                                                                          "text": ">No, you don’t need “my” sources, you’re free to delude yourself however you like. The danger is just when you try to convince others your delusions are true.\n\nMarxism is what leads to totalitarian uprisings, neighbors turning in their neighbors to the thought police, and mass graves. Put down the gender studies texts and read a history book.\n\n&#x200B;\n\n>Also, feminism is already mainstream, most people believe in gender equality.\n\nEquality. You say that word, but I don't think you know what it means. Hell, I believe in \"gender equality\" if that means women and men get the SAME RIGHTS and SAME OPPORTUNITIES but women already have that. What you want is not gender equality. You want a *specific outcome* for *specific women.*\n\nWhen you use the term \"Equity\" the truth now rears it's ugly head - that literally means \"taking from those who have more and giving to those who have left because equal outcome is the only fair way.\" \n\nEquity is a word used by Marxists and Communists.\n\nAgain, you do your grand exit by repeating what you used for your grand entrance. The \"boiler plate\" definition of feminism.\n\nFeminism is not that now, and many are starting to wonder if it ever was.",
                                                                          "timestamp": "2021-11-23 01:02:26",
                                                                          "score": 4,
                                                                          "num_children": 1,
                                                                          "replies": [
                                                                            {
                                                                              "id": "hlpm9zs",
                                                                              "text": "Wait, so you believe women deserve the same rights as men? Did you just advocate for women’s rights on the basis of the equality of the sexes? If only we had a word for that, so we didn’t have to say “advocate for women’s rights on the basis of the equality of the sexes,” every time we wanted to refer to the “advocacy of women’s rights on the basis of the equality of the sexes.”\n\nOh wait, we do, it’s feminism! You could say “I advocate for women’s rights on the basis of the equality of the sexes,” or you could say “I am a feminist!” Congratulations on your feminist awakenings!",
                                                                              "timestamp": "2021-11-23 01:05:11",
                                                                              "score": 1,
                                                                              "num_children": 1,
                                                                              "author": 296869,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "hlpn5aq",
                                                                                  "text": "Oh, well see? I was a feminist this whole time and typed all that stuff out for nothing.",
                                                                                  "timestamp": "2021-11-23 01:12:06",
                                                                                  "score": 3,
                                                                                  "num_children": 0,
                                                                                  "replies": []
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "hlt8m76",
                                          "text": "The dictionary is words, feminism is aggressive anti male violence, big differences.",
                                          "timestamp": "2021-11-23 20:25:13",
                                          "score": 1,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "hlt8s03",
                                              "text": "No, feminism is \"the advocacy of women's rights on the basis of the equality of the sexes.\" If that triggers you, maybe think about the things you say and look into them before talking out of your ass.",
                                              "timestamp": "2021-11-23 20:26:17",
                                              "score": 0,
                                              "num_children": 1,
                                              "author": 296869,
                                              "replies": [
                                                {
                                                  "id": "hltc0hn",
                                                  "text": "Maybe you should stop the mental gymnastics, learn respect, stop believing dictionary when it's written by feminazi, i'm blocking you since you're a femcel. Bye.",
                                                  "timestamp": "2021-11-23 20:47:25",
                                                  "score": 1,
                                                  "num_children": 2,
                                                  "replies": [
                                                    {
                                                      "id": "hltc7gd",
                                                      "text": "Source on the dictionary being written by \"feminazis?\"\n\nEvery dictionary in existence is written by feminazis? That's quite an impressive conspiracy theory!",
                                                      "timestamp": "2021-11-23 20:48:42",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "author": 296869,
                                                      "replies": []
                                                    },
                                                    {
                                                      "id": "hpjy1c0",
                                                      "text": "Lol, they should learn respect? Sure, they are definitely the ones lacking that..\n\n(/s)",
                                                      "timestamp": "2021-12-22 13:28:17",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "author": 267303,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hlp7x8c",
                  "text": "Around an 80% chance that she is, taking into consideration survey results. So I think it's fair to make assumptions.",
                  "timestamp": "2021-11-22 23:13:40",
                  "score": 2,
                  "num_children": 0,
                  "author": 287344,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hlo0jvp",
          "text": "Dude all that whiteknighting is still not going to get you laid.",
          "timestamp": "2021-11-22 18:17:07",
          "score": 12,
          "num_children": 1,
          "author": 294229,
          "replies": [
            {
              "id": "hlo4num",
              "text": "If that's whiteknighting, it's got a better chance at me getting laid than your misogyny 😎stay triggered.",
              "timestamp": "2021-11-22 18:44:16",
              "score": -7,
              "num_children": 1,
              "author": 296869,
              "replies": [
                {
                  "id": "hlt95p1",
                  "text": "Misandry isn't better",
                  "timestamp": "2021-11-23 20:28:46",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}