{
  "id": "r3c9l5",
  "text": "Out of womb, out of mind\n",
  "timestamp": "2021-11-27 12:04:54",
  "score": 3742,
  "subreddit": "t5_3fdcn",
  "num_children": 32,
  "author": 398010,
  "replies": [
    {
      "id": "hm9lf1n",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2021-11-27 12:04:55",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "hm9mbgp",
      "text": "Pro life and all about the children until it’s a gay couple trying to adopt or forced Hysterectomys on the border and reservations.",
      "timestamp": "2021-11-27 12:16:41",
      "score": 164,
      "num_children": 3,
      "replies": [
        {
          "id": "hm9vk5l",
          "text": "That's why it's more appropriate to call them \"pro forced birth\" rather than pro life. It's the same as \"all lives matter\" which is just a reaction to a real movement.",
          "timestamp": "2021-11-27 13:57:16",
          "score": 94,
          "num_children": 1,
          "author": 260891,
          "replies": [
            {
              "id": "hm9wfnz",
              "text": "“All lives matter” is the slogan for white fragility. And you’re right it is forced birth. Nobody wants baby’s at all anymore for several reasons mainly the economy and world is so fucked up nobody can afford to and that’s fucking up the economy so here come the conservatives saying people need to make more babies and you can’t get abortions.",
              "timestamp": "2021-11-27 14:05:29",
              "score": 45,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hmb18cx",
          "text": "They also seem to have a problem with “anchor babies.”",
          "timestamp": "2021-11-27 19:12:43",
          "score": 4,
          "num_children": 1,
          "author": 73070,
          "replies": [
            {
              "id": "hmc8iac",
              "text": "Except the Russian ones.",
              "timestamp": "2021-11-28 00:25:38",
              "score": 2,
              "num_children": 0,
              "author": 397494,
              "replies": []
            }
          ]
        },
        {
          "id": "hmmcvpb",
          "text": "Did the Hysterectomies actually happen? I’ve heard conflicting reports.",
          "timestamp": "2021-11-30 03:48:04",
          "score": 1,
          "num_children": 1,
          "author": 307645,
          "replies": [
            {
              "id": "hmmfdot",
              "text": "https://www.nytimes.com/2020/09/29/us/ice-hysterectomies-surgeries-georgia.html\nThis article has a statement that two official Hysterectomy reports from hospitals in Georgia were made. That’s real evidence for people who are skeptical, but I personally feel like they’d try to hide the grand scheme of it from the public to try and protect themselves",
              "timestamp": "2021-11-30 04:07:51",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hm9ulhr",
      "text": "I feel so hopeless. I don’t understand how their party is so full of hateful bullshit. I don’t understand how there’s so many people that support that hateful bullshit. It’s the party that welcomes the worst who proudly wave a nazi flag. And they hate us for advocating kindness and progress. I don’t understand this world",
      "timestamp": "2021-11-27 13:48:00",
      "score": 69,
      "num_children": 2,
      "author": 270096,
      "replies": [
        {
          "id": "hm9wps9",
          "text": "Methodist Pastor David Barnhart :\n\n\"The unborn\" are a convenient group of people to advocate for. They never make demands of you; they are morally uncomplicated, unlike the incarcerated, addicted, or the chronically poor; they don't resent your condescension or complain that you are not politically correct; unlike widows, they don't ask you to question patriarchy; unlike orphans, they don't need money, education, or childcare; unlike aliens, they don't bring all that racial, cultural, and religious baggage that you dislike; they allow you to feel good about yourself without any work at creating or maintaining relationships; and when they are born, you can forget about them, because they cease to be unborn. It's almost as if, by being born, they have died to you. You can love the unborn and advocate for them without substantially challenging your own wealth, power, or privilege, without re-imagining social structures, apologizing, or making reparations to anyone. They are, in short, the perfect people to love if you want to claim you love Jesus but actually dislike people who breathe.\n\nPrisoners? Immigrants? The sick? The poor? Widows? Orphans? All the groups that are specifically mentioned in the Bible? They all get thrown under the bus for the unborn.",
          "timestamp": "2021-11-27 14:08:05",
          "score": 76,
          "num_children": 1,
          "author": 98284,
          "replies": [
            {
              "id": "hm9xyig",
              "text": "That cheers me up a bit. Thank you",
              "timestamp": "2021-11-27 14:19:28",
              "score": 9,
              "num_children": 1,
              "author": 270096,
              "replies": [
                {
                  "id": "hm9z61x",
                  "text": "Stay safe and healthy.",
                  "timestamp": "2021-11-27 14:30:23",
                  "score": 4,
                  "num_children": 0,
                  "author": 98284,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hm9w4vn",
          "text": "Because fear and xenophobia are the only tools their political party has to remain in power. Conservatism must be regressive in order to exist.",
          "timestamp": "2021-11-27 14:02:38",
          "score": 20,
          "num_children": 1,
          "author": 290388,
          "replies": [
            {
              "id": "hm9z5o3",
              "text": "I get that. I just have a hard time coping with the fact that so many people choose hate over… fuck, idk. I’m not asking for some hippie dippy love. Just… simple concepts like gay marriage, abortion, not hating someone because they’re dark.  Just the tip of the iceberg. Ironically, as much as I hate hating…. I fucking hate these haters",
              "timestamp": "2021-11-27 14:30:17",
              "score": 14,
              "num_children": 1,
              "author": 270096,
              "replies": [
                {
                  "id": "hmg30nh",
                  "text": "This puzzles me too. I've spent time in that frame of mind myself (without buying in to the alt right) and I still can't explain it.\n\nThe closest I can come is the adversarial, fight or die attitude is stimulating and addictive to them..",
                  "timestamp": "2021-11-28 21:01:22",
                  "score": 1,
                  "num_children": 0,
                  "author": 254135,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hm9udjj",
      "text": "The baby you aborted could have also been the next Hitler.",
      "timestamp": "2021-11-27 13:45:51",
      "score": 36,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hma46ry",
      "text": "That aborted baby would have grown up unwatched and unloved and developed into a hateful, cruel person who supports repeating the cycle that created them.\n\nYou know what would change minds? Money and support, the two things they wouldn't give to save their lives and souls.",
      "timestamp": "2021-11-27 15:12:36",
      "score": 19,
      "num_children": 0,
      "author": 335759,
      "replies": []
    },
    {
      "id": "hm9x72u",
      "text": "Look up how much Alan Turing did to usher in the information age.\n\nThen look up how he was treated.",
      "timestamp": "2021-11-27 14:12:25",
      "score": 18,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hm9xg7i",
      "text": "The white supremacist kid you've freed could have killed more minorities",
      "timestamp": "2021-11-27 14:14:48",
      "score": 14,
      "num_children": 1,
      "author": 374055,
      "replies": [
        {
          "id": "hmc759z",
          "text": "I don't think this argument will sway them",
          "timestamp": "2021-11-28 00:15:18",
          "score": 2,
          "num_children": 0,
          "author": 286990,
          "replies": []
        }
      ]
    },
    {
      "id": "hma4359",
      "text": "\"Pro-life\" ends at birth.",
      "timestamp": "2021-11-27 15:11:48",
      "score": 12,
      "num_children": 0,
      "author": 174461,
      "replies": []
    },
    {
      "id": "hma5g3n",
      "text": "THE HEALTHY MOTHER WHO COULDN'T GO TO COLLEGE, (and even if she does get an abortion spends 1/4 of her wage on repaying college and another 1/4 on healthcare) Notice that America doesn't make nearly as many scientific discoveries as they used to.",
      "timestamp": "2021-11-27 15:22:40",
      "score": 8,
      "num_children": 0,
      "author": 206793,
      "replies": []
    },
    {
      "id": "hma14ju",
      "text": "Conservatives only care when they assume it’ll grow up to be a straight cis white man",
      "timestamp": "2021-11-27 14:47:22",
      "score": 7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hmak2l4",
      "text": "Someone who could cure is probably working two menial jobs to pay rent and put food on the table.  We waste so much human potential by having an underclass.",
      "timestamp": "2021-11-27 17:12:25",
      "score": 7,
      "num_children": 1,
      "author": 87434,
      "replies": [
        {
          "id": "hmbph8f",
          "text": "Yeah what use to curing cancer is being merely alive without the opportunity to get the education and experience that require resources the Right doesn't want you to have unless you're part of their exclusive club of insiders?\n\nThe kid whose food stamps you cut and neighborhood you let stagnate could have cured cancer.",
          "timestamp": "2021-11-27 22:03:16",
          "score": 5,
          "num_children": 0,
          "author": 150427,
          "replies": []
        }
      ]
    },
    {
      "id": "hmbxu4a",
      "text": "\"The baby you aborted could have cured cancer!\"\n\nHuh, maybe you should pay her to have the kid then. It's her body, aka her PRIVATE property.\n\nCapitalists only like capitalism moving one way, don't they?",
      "timestamp": "2021-11-27 23:05:43",
      "score": 9,
      "num_children": 1,
      "author": 114776,
      "replies": [
        {
          "id": "hmg4189",
          "text": "Just like Government-run healthcare bad, government-run defense force good.",
          "timestamp": "2021-11-28 21:07:57",
          "score": 3,
          "num_children": 0,
          "author": 254135,
          "replies": []
        }
      ]
    },
    {
      "id": "hma4lla",
      "text": "\"If you're pre-born, you're good, if you're pre-school, you're fucked.\"",
      "timestamp": "2021-11-27 15:15:56",
      "score": 8,
      "num_children": 0,
      "author": 298107,
      "replies": []
    },
    {
      "id": "hma7hyl",
      "text": "[deleted]",
      "timestamp": "2021-11-27 15:38:50",
      "score": 7,
      "num_children": 1,
      "replies": [
        {
          "id": "hmauvg7",
          "text": "They understand. They just need to obfuscate the fact that what they're REALLY after are laws that punish women for having sex for any reason outside of procreation.",
          "timestamp": "2021-11-27 18:27:59",
          "score": 3,
          "num_children": 0,
          "author": 201097,
          "replies": []
        }
      ]
    },
    {
      "id": "hmawzbk",
      "text": "The baby starved because the single mother was denied food stamps, health care, and housing CoUlD hAvE cUrEd CaNcEr.",
      "timestamp": "2021-11-27 18:42:44",
      "score": 6,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hma2xh7",
      "text": "\"They want live babies, and dead soldiers!\"",
      "timestamp": "2021-11-27 15:02:33",
      "score": 7,
      "num_children": 0,
      "author": 17317,
      "replies": []
    },
    {
      "id": "hmastc7",
      "text": "The woman you forced to have a child she didn't want could have cured cancer",
      "timestamp": "2021-11-27 18:13:22",
      "score": 6,
      "num_children": 0,
      "author": 51487,
      "replies": []
    },
    {
      "id": "hmb614x",
      "text": "All those poor kids your party keep in perpetual poverty could have cured cancer too",
      "timestamp": "2021-11-27 19:45:36",
      "score": 5,
      "num_children": 0,
      "author": 195948,
      "replies": []
    },
    {
      "id": "hmayq6t",
      "text": "It's not about the babies. If it was, they'd advocate for a MUCH stronger social safety net, like they had when they were growing up. Instead, it's about controlling the poor. Force someone to take care of a kid (or 2 someones, since \"christrian values\" and all that), and you'll have a workforce that you can crush with poverty anytime that you feel like it. Tired, overworked, desperate people who NEED to take care of their kids don't protest, or strike, or ask for enough money to feed themselves; they get another job, which keeps this vicious cycle going. \n\nSo, what I'm saying here, is that you should burn your places of employment to the ground, and put everyone's heads on sticks, from your general manager on up because your true fight is with capitalism. It's just wearing some religious robes to throw you off guard.",
      "timestamp": "2021-11-27 18:55:04",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hmbm6jh",
      "text": "The girl you wouldn’t let get an abortion could of cured cancer.",
      "timestamp": "2021-11-27 21:39:03",
      "score": 4,
      "num_children": 0,
      "author": 340219,
      "replies": []
    },
    {
      "id": "hmbtqw3",
      "text": "The correct term is: pro forced birthers.  There’s no other more appropriate term for these forced birthers.",
      "timestamp": "2021-11-27 22:35:11",
      "score": 4,
      "num_children": 0,
      "author": 127037,
      "replies": []
    },
    {
      "id": "hmc71ub",
      "text": "The single mother that was forced to raise a child alone could have cured cancer",
      "timestamp": "2021-11-28 00:14:34",
      "score": 3,
      "num_children": 0,
      "author": 286990,
      "replies": []
    },
    {
      "id": "hmcdwhx",
      "text": "The baby you aborted could've been Hitler.",
      "timestamp": "2021-11-28 01:07:41",
      "score": 3,
      "num_children": 0,
      "author": 284635,
      "replies": []
    },
    {
      "id": "hma8y6e",
      "text": "[according to Donohue and Levitt, legal abortion reduces crime ](https://www.nber.org/system/files/working_papers/w8004/w8004.pdf)\n\nIt makes sense, and is supported by data",
      "timestamp": "2021-11-27 15:49:54",
      "score": 2,
      "num_children": 0,
      "author": 221040,
      "replies": []
    },
    {
      "id": "hmawbv2",
      "text": "Perhaps more than any of those though, I’d say that the bright kid who wanted to go to college but instead had to go straight to working the register at their parents’ corner store to keep it afloat since the parents got cancer but have no healthcare coverage because instead of expanding ACA you gave the rich yet another tax break… yeah, they could’ve cured cancer too.",
      "timestamp": "2021-11-27 18:38:08",
      "score": 2,
      "num_children": 0,
      "author": 313681,
      "replies": []
    },
    {
      "id": "hmb5q33",
      "text": "Yes. The fetus could have, but more likely would have become a sociopath, serial killer or future Hitler without a strong suppression group. \n\nAhh the party of pro birth…. May they all rot in hell",
      "timestamp": "2021-11-27 19:43:30",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hmb8536",
      "text": "The woman they bullied into having an unwanted child could have cured cancer if she didn't have to drop out of school.",
      "timestamp": "2021-11-27 20:00:19",
      "score": 2,
      "num_children": 0,
      "author": 241062,
      "replies": []
    },
    {
      "id": "hmc800o",
      "text": "The millions of kids being raised by parents struggling under poverty wages could afford college and learn how to cure cancer. The list goes on.",
      "timestamp": "2021-11-28 00:21:49",
      "score": 2,
      "num_children": 0,
      "author": 350596,
      "replies": []
    },
    {
      "id": "hmb67tp",
      "text": "I tend to go darker in the other direction: \"I don't want a cure for cancer, just on the off chance that you'll get it and die suffering.\"",
      "timestamp": "2021-11-27 19:46:55",
      "score": 2,
      "num_children": 0,
      "author": 195013,
      "replies": []
    },
    {
      "id": "hmass4f",
      "text": "To paraphrase family guy: “republicans only care about them when they’re in the womb. Once they’re out they can go fuck themselves.”",
      "timestamp": "2021-11-27 18:13:08",
      "score": 1,
      "num_children": 0,
      "author": 254005,
      "replies": []
    },
    {
      "id": "hmczexf",
      "text": "How many kids who couldnt afford college could have cured cancer",
      "timestamp": "2021-11-28 04:02:43",
      "score": 1,
      "num_children": 0,
      "author": 183956,
      "replies": []
    },
    {
      "id": "hmauvxx",
      "text": "this individual is absolutely correct.\nAll human life is sacred and must be protected.",
      "timestamp": "2021-11-27 18:28:05",
      "score": 0,
      "num_children": 0,
      "author": 320607,
      "replies": []
    }
  ]
}