{
  "id": "rawm5k",
  "text": "This shit is the truth\n",
  "timestamp": "2021-12-07 10:58:46",
  "score": 4460,
  "subreddit": "t5_3fdcn",
  "num_children": 57,
  "author": 398010,
  "replies": [
    {
      "id": "hnkw65w",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2021-12-07 10:58:46",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "hnla2gm",
      "text": "That's because the Repubs are a cult that will back the GOP no matter what and most Dems who are politically aware will try to hold their people accountable.",
      "timestamp": "2021-12-07 13:29:04",
      "score": 431,
      "num_children": 6,
      "replies": [
        {
          "id": "hnlk0hh",
          "text": "Exactly.\n\nIt's not the media pushing this narrative, it's the voters.\n\nFor Republicans, all you need to get elected is to *be* a Republican.",
          "timestamp": "2021-12-07 14:49:24",
          "score": 232,
          "num_children": 3,
          "author": 69078,
          "replies": [
            {
              "id": "hnlr0iv",
              "text": "Should I run as a republican and then when I get into office vote for socialist policies?",
              "timestamp": "2021-12-07 15:39:48",
              "score": 97,
              "num_children": 5,
              "author": 259995,
              "replies": [
                {
                  "id": "hnlr8f3",
                  "text": "You'd get maybe a few weeks in before they caught on and recalled you.",
                  "timestamp": "2021-12-07 15:41:25",
                  "score": 74,
                  "num_children": 3,
                  "author": 69078,
                  "replies": [
                    {
                      "id": "hnmlpzu",
                      "text": "Can't recall a president, senator, or congressman afaik. Only a few governors have ever been recalled. Lots of state-level offices have mechanisms for recalls though.",
                      "timestamp": "2021-12-07 19:23:23",
                      "score": 38,
                      "num_children": 1,
                      "author": 150,
                      "replies": [
                        {
                          "id": "hnnrhoj",
                          "text": "If you think Republicans wouldn’t censure or impeach one of their own for not toeing the party line, you’re hilariously naive.",
                          "timestamp": "2021-12-08 00:29:59",
                          "score": 10,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hnltlxt",
                      "text": "They never recalled trump despite him giving free money away and meddling with tarrifs",
                      "timestamp": "2021-12-07 15:59:00",
                      "score": -18,
                      "num_children": 1,
                      "author": 72088,
                      "replies": [
                        {
                          "id": "hnmlvpr",
                          "text": "There's no mechanism to recall a US president. He was successfully impeached twice, though.",
                          "timestamp": "2021-12-07 19:24:31",
                          "score": 21,
                          "num_children": 0,
                          "author": 150,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hnoxe3z",
                      "text": "too be honest, if you use their language and rhetoric, i really think you could get to them. like genuinely, if you word mutual aid in a way that makes it sound like youre owning the libs theyll eat it up.",
                      "timestamp": "2021-12-08 07:09:50",
                      "score": 1,
                      "num_children": 0,
                      "author": 38269,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hnmg0y7",
                  "text": "Just do so gradually.  \n\n1. Veto damaging bills at first and nothing else.  \n2. Then begin to propose centralist legislation, and reach across the aisle on occasion.  \n3. Anyone from the GOP that pushes back, you call them out on all the awful shit they've done (there's dirt on most of them anyway).  \n4. Gradually gain a following either due to the economy flourishing or because the Republicans want a \"Republican\" leader regardless.  \n5. ~~Take over the world.~~  Remember that you're Democrat.  :)",
                  "timestamp": "2021-12-07 18:42:41",
                  "score": 39,
                  "num_children": 2,
                  "author": 201921,
                  "replies": [
                    {
                      "id": "hnncj8e",
                      "text": "They’ll probably find some loyal MAGA-cultist to run against and replace you when you’re up for re-election. I mean this is what they are threatening their non-compliant congresspeople with. And considering they have no problem appointing functional illiterates such as Boebert to Congress they’ll never run out of idiots to pit you against.",
                      "timestamp": "2021-12-07 22:33:53",
                      "score": 20,
                      "num_children": 0,
                      "author": 353162,
                      "replies": []
                    },
                    {
                      "id": "hnneyse",
                      "text": "Honestly I think the only way for dems to get ahead anymore is to either rebrand as a new party, or to control the cult narrative to point fingers at the actual criminals",
                      "timestamp": "2021-12-07 22:52:20",
                      "score": 8,
                      "num_children": 1,
                      "author": 136452,
                      "replies": [
                        {
                          "id": "hnnrm3m",
                          "text": "the only way for dems to get ahead is to become republicans. \n\nIt’s literally what happened in the 1960s.",
                          "timestamp": "2021-12-08 00:30:57",
                          "score": 4,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hnmsefg",
                  "text": "*The reverse Sinema*",
                  "timestamp": "2021-12-07 20:12:52",
                  "score": 7,
                  "num_children": 1,
                  "author": 314893,
                  "replies": [
                    {
                      "id": "hnnjl8h",
                      "text": "Was just thinking about her reading these takes",
                      "timestamp": "2021-12-07 23:27:48",
                      "score": 3,
                      "num_children": 0,
                      "author": 148145,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hnm0wz1",
                  "text": "Just steer clear of guns and abortion",
                  "timestamp": "2021-12-07 16:53:19",
                  "score": 13,
                  "num_children": 1,
                  "author": 341574,
                  "replies": [
                    {
                      "id": "hnm29h3",
                      "text": "Socialists are more pro-gun than most conservatives.\n\n\n\"Under no pretext are arms and ammunition to be surrendered; any attempt to disarm the working class must be frustrated, by force if necessary\" - Marx",
                      "timestamp": "2021-12-07 17:03:11",
                      "score": 33,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "hnm6psb",
                          "text": "This is true - conservatives are the ones who passed gun control in California in the 70s to fight the Black Panthers and Trump's the one who said \"take the guns first, go through due process second\"",
                          "timestamp": "2021-12-07 17:36:13",
                          "score": 27,
                          "num_children": 0,
                          "author": 79626,
                          "replies": []
                        },
                        {
                          "id": "hnmg96n",
                          "text": "This is an extreme stance that not all leftist support. Most support responsible gun ownership.",
                          "timestamp": "2021-12-07 18:44:19",
                          "score": 9,
                          "num_children": 2,
                          "author": 148015,
                          "replies": [
                            {
                              "id": "hnmhkuv",
                              "text": "Those people are liberals. See George Orwell's quote on pacifism.",
                              "timestamp": "2021-12-07 18:53:47",
                              "score": 8,
                              "num_children": 0,
                              "replies": []
                            },
                            {
                              "id": "hnmny60",
                              "text": "Also adding \"responsible\" or \"extreme\" before anything is a devious trick to poison any discussion as one side being reasonable people and anyone against them as irresponsible lunatics. Work on your linguistics or people will think you're a slimy fuck, which you may well be for all I know.",
                              "timestamp": "2021-12-07 19:39:47",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hnno331",
                                  "text": "People are downvoting but linguistically you're right.",
                                  "timestamp": "2021-12-08 00:02:50",
                                  "score": 4,
                                  "num_children": 1,
                                  "author": 82835,
                                  "replies": [
                                    {
                                      "id": "hosdtdr",
                                      "text": "I come across as hostile so I expect to get downvoted, but I'm not a loser so I don't give a shit about online points. I rack up more bans than most redditors get downvotes.",
                                      "timestamp": "2021-12-16 15:12:32",
                                      "score": 1,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hnopmcw",
                  "text": "Sure, just make sure your branding is on point.\n\nNot government subsidized healthcare, “FreedomCare”\n\nNot taxpayer funded childcare, “The Little Nationalists Act”\n\nNot UBI, “Patriot Provisions”",
                  "timestamp": "2021-12-08 05:33:26",
                  "score": 2,
                  "num_children": 0,
                  "author": 200530,
                  "replies": []
                }
              ]
            },
            {
              "id": "hnmgpm1",
              "text": "Being racist and old helps too.",
              "timestamp": "2021-12-07 18:47:34",
              "score": 5,
              "num_children": 0,
              "author": 393797,
              "replies": []
            },
            {
              "id": "hnlm7m4",
              "text": "You’re not wrong, but I think a lot of voters come to this conclusion with the help of propaganda from the right and Russia. They intentionally split the left and turn them against their own, and it works",
              "timestamp": "2021-12-07 15:05:29",
              "score": 33,
              "num_children": 1,
              "author": 381990,
              "replies": [
                {
                  "id": "hnlts3v",
                  "text": "I think though the ideals of the left *leads* them to turning on each other in some ways. If you're promoting, let's just take an example, women's rights. You find a politician who raped or sexuall harrassed women in his office. You *have* to get rid of him or you're telling those women you never actually cared about their issues.\n\nBecause of the values the Left holds, Leftists need to embody them. It's not just propaganda that makes us eat each other.\n\nThe right is totally different. It has a veneer of morality, of Christian Ethics, but that's pretty fundamentalist. There's a Calvanist \"if you do it, it's God's will\" sort of thing. So you can overlook all the bad - that's baked in. At heart, the Right is fixated on individual success - morals don't reallly apply. They don't have to turn on each other. Trump really exemplifies this. They only turn on someone who is a loser. Trump has managed to fail upwards, his \"losses\" rarely stick.",
                  "timestamp": "2021-12-07 16:00:17",
                  "score": 40,
                  "num_children": 0,
                  "author": 162410,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hnllkla",
          "text": "Well, I would say it’s more so that the QOP is going to suppress the shit out of minority voting groups to make up for the ground they lost with all their voters who died from Covid. Dems are still going to vote blue, any sensible person is still going to vote blue, just like the Reps are going to vote red.",
          "timestamp": "2021-12-07 15:00:52",
          "score": 18,
          "num_children": 1,
          "author": 392541,
          "replies": [
            {
              "id": "hnlu5fg",
              "text": "> Dems are still going to vote blue\n\nOn the few occasions that the candidate is perfect enough for them to deign to show up at the polls. 😒",
              "timestamp": "2021-12-07 16:03:02",
              "score": 13,
              "num_children": 1,
              "author": 354546,
              "replies": [
                {
                  "id": "hnmcauc",
                  "text": "If the Supremes blow up Roe, it's going to be a whole new game and everything from Biden's approval to historical trends simply won't matter. It's easily a 15-25 point swing. Outlawing abortion could make Manchin and Sinema blissfully irrelevant in 2023, allowing the full original Build Back Better and possibly even packing the Court.",
                  "timestamp": "2021-12-07 18:16:32",
                  "score": 8,
                  "num_children": 1,
                  "author": 48432,
                  "replies": [
                    {
                      "id": "hno1wzs",
                      "text": "I suppose we'll see.",
                      "timestamp": "2021-12-08 01:55:57",
                      "score": 2,
                      "num_children": 0,
                      "author": 354546,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hnn7lw0",
          "text": "Yeah, but then why does our supposedly left leaning media and even some on the left get in on using the go nowhere talking points to attack other democrats. Why is so much attention from the far left focused on attacking people who are more in line with them than the people who are walking around with swastikas?",
          "timestamp": "2021-12-07 21:58:02",
          "score": 4,
          "num_children": 1,
          "author": 277978,
          "replies": [
            {
              "id": "hnn8grh",
              "text": "Because our “left leaning” media is owned by right wing billionaires.",
              "timestamp": "2021-12-07 22:04:05",
              "score": 6,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hnmixfq",
          "text": "This is why you need to get out of the two party system.\n\nPeople need to be able to punish their party for behaving badly in ways other than electing an antithetical party.\n\nOn the Reykjavík City council, we have 8 parties, two significantly larger than the rest, but the majority coalition that elects the mayor and decides the budget and most major policy is made up of four parties. (Social Democrats(7), Restoration party(2), Pirate Party(2) and Left Green Alliance(1))\n\nThey vary from left to right across the middle, but are all largely progressive and modernist. If you are disappointed with one of them and want to punish that party, you can vote for another that still has similar overarching goals, but a different focus, different culture, different individuals. If enough people do that, the balance of power within the coalition will change. The same coalition with 3 Social Democrats and 4 Pirates, 3 Restoration Partiers and 2 Left Greens would pursue maybe largely the same policy goals, but with a very different balance, different focus and probably a different Mayor.\n\nIf there is enough of a backlash against one party, they might even be dropped out of the coalition after an election, if the others are strong enough to form a majority without them\n\nTo most disaffected voters of a progressive party, this would be a far more appealing way to punish a party that they still agree with in the big picture, but think has made too many mistakes, become too comfortable or lost its way, than to lead to power a right wing conservative party, or a populist alt-right party.\n\nIn some of our neighboring countries, they even forego solid majority coalitions, and minority governments and municipalities are the norm, where ad hoc agreements, or alliances over the budget and the chief executive don't extend to having to be allied on all policy issues.\n\nThe 'price' we pay is that small parties can become disproportionately influential by leveraging their position of being able to lead to power either of two large parties. But I would say that cost outweighs the gain of not having the extreme polarization of a two party system.",
          "timestamp": "2021-12-07 19:03:21",
          "score": 9,
          "num_children": 3,
          "author": 137814,
          "replies": [
            {
              "id": "hnneceu",
              "text": "maybe we can set that up after the next civil war is over.",
              "timestamp": "2021-12-07 22:47:43",
              "score": 4,
              "num_children": 0,
              "author": 174461,
              "replies": []
            },
            {
              "id": "hnmota8",
              "text": "Agreed. Our system is fucked and on it’s way to failure.",
              "timestamp": "2021-12-07 19:46:13",
              "score": 5,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hnn1b1x",
              "text": "I think open primaries can help. Let everyone vote in primaries. Not a total solution but it will moderate both sides I think.",
              "timestamp": "2021-12-07 21:14:17",
              "score": 2,
              "num_children": 0,
              "author": 384188,
              "replies": []
            }
          ]
        },
        {
          "id": "hnn1j8a",
          "text": "Republicans have also rewritten a lot of voting maps. So they pretty much will never lose most of their seats. The battles are over dem seats. Gerrymandering gives the right way too much power compared to their size.",
          "timestamp": "2021-12-07 21:15:52",
          "score": 5,
          "num_children": 0,
          "author": 384188,
          "replies": []
        },
        {
          "id": "hno88m7",
          "text": "You hold your people accountable in the fucking primaries.  You do not hold Dems accountable by letting the fascists take over and dismantle everything makes society worth fucking having.\n\n\"Accelerationists\" are just false-acting fascist apologists.  Do not believe their lies.",
          "timestamp": "2021-12-08 02:49:01",
          "score": 2,
          "num_children": 1,
          "author": 215411,
          "replies": [
            {
              "id": "hnpqvvz",
              "text": "That's the way it \\*should\\* work. However, the primaries really are a sham. The DNC manipulates who gets their message out and basically controls the outcome.\n\nThat's why Hillary and later Biden won their respective primaries. No one that the DNC doesn't approve of will make any real headway.",
              "timestamp": "2021-12-08 13:29:38",
              "score": 0,
              "num_children": 1,
              "replies": [
                {
                  "id": "hnpwoqq",
                  "text": "Hilary and Biden won their primaries because more people voted for them.  Period.  \n\nAnd no matter what lies you tell yourself, **you do not hold Dems accountable by letting the fascists take over and dismantle everything makes society worth fucking having.**",
                  "timestamp": "2021-12-08 14:18:19",
                  "score": 2,
                  "num_children": 1,
                  "author": 215411,
                  "replies": [
                    {
                      "id": "hnq9qr1",
                      "text": "I was NOT saying to let the Fash do ANYTHING. \nFFS. I don’t know how you got the idea I was. But can you really say Bernie Saunders got the same treatment from the DNC that Hillary did?",
                      "timestamp": "2021-12-08 15:52:29",
                      "score": 0,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hnkyg9u",
      "text": "There could be the perfect presidential candidate that would end world hunger, homelessness, and medical debt. But republicans wouldn’t vote for them because they were female. Republicans don’t care about people they care about themselves and their fragile feelings.",
      "timestamp": "2021-12-07 11:28:22",
      "score": 145,
      "num_children": 5,
      "replies": [
        {
          "id": "hnle91t",
          "text": "Most Republicans are just really Ill-informed, which results in them not caring about themselves either. \n\nThis is made painfully evident by them constantly voting against socialized healthcare and then running to GoFundMe for help paying their medical bills or funeral costs. \n\nThey're OK with GFM because they don't really understand what socialism is, and Fox News purposely conflates it with communism to that end.\n\nEven if they do understand socialism, they think it'll raise their taxes because the rich people it will actually affect pay to spread that misinformation.\n\nThey're really lost, and it's sad.",
          "timestamp": "2021-12-07 14:04:31",
          "score": 68,
          "num_children": 1,
          "author": 193551,
          "replies": [
            {
              "id": "hnlhqm4",
              "text": "When I went to shittier parts of Florida all I saw was what they vote for over and over again. They genuinely believe there's some democrat behind the shadows manipulating things so they have to continue to live in a shitty house near a shitty fucking swamp with their shitty fucking republican vote.",
              "timestamp": "2021-12-07 14:32:12",
              "score": 42,
              "num_children": 2,
              "author": 137793,
              "replies": [
                {
                  "id": "hnljsf4",
                  "text": "Can confirm as an ex-Floridian. Its bonkers.",
                  "timestamp": "2021-12-07 14:47:43",
                  "score": 23,
                  "num_children": 0,
                  "author": 114468,
                  "replies": []
                },
                {
                  "id": "hno1mem",
                  "text": "But they have their vape/kratom shop on every corner.",
                  "timestamp": "2021-12-08 01:53:29",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hnm7w5l",
          "text": "I think we're kidding ourselves if we think that ending homelessness, hunger and medical debt wouldn't be a HUGE dealbreaker for many in the GOP. Making things worse for others who don't \"deserve\" a better life is important for the deplorables.",
          "timestamp": "2021-12-07 17:44:53",
          "score": 15,
          "num_children": 0,
          "author": 150427,
          "replies": []
        },
        {
          "id": "hnlae2a",
          "text": "To be fair they probably wouldn't make it through the Democratic primary either because they'd be called \"unelectable\" by establishment dems.",
          "timestamp": "2021-12-07 13:31:57",
          "score": 49,
          "num_children": 1,
          "author": 27374,
          "replies": [
            {
              "id": "hnldqhx",
              "text": "Ah, that’s why Hilary didn’t win, because establishment dems didn’t think she was electable /s.",
              "timestamp": "2021-12-07 14:00:16",
              "score": 11,
              "num_children": 2,
              "author": 345680,
              "replies": [
                {
                  "id": "hnm6stg",
                  "text": "Nah, that's why *Bernie* didn't win. The Dem establishment was like \"He's too radical! The American people want the status quo!\" and ***massively*** miscalculated.",
                  "timestamp": "2021-12-07 17:36:50",
                  "score": 22,
                  "num_children": 0,
                  "author": 79626,
                  "replies": []
                },
                {
                  "id": "hnluec1",
                  "text": "She *wasn't* electable.  Dems underestimated how absolutely *loathed* she is.",
                  "timestamp": "2021-12-07 16:04:54",
                  "score": 15,
                  "num_children": 1,
                  "author": 354546,
                  "replies": [
                    {
                      "id": "hnlxwbn",
                      "text": "She literally lost to a reality show host.",
                      "timestamp": "2021-12-07 16:30:55",
                      "score": 3,
                      "num_children": 2,
                      "author": 189737,
                      "replies": [
                        {
                          "id": "hnm11h0",
                          "text": "Not the popular vote",
                          "timestamp": "2021-12-07 16:54:13",
                          "score": 8,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hnm2ehx",
                              "text": "Someone running against Trump shouldn't have an election that close in the first place lmao",
                              "timestamp": "2021-12-07 17:04:13",
                              "score": 11,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hno1y2x",
                          "text": "I know!",
                          "timestamp": "2021-12-08 01:56:12",
                          "score": 2,
                          "num_children": 0,
                          "author": 354546,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hnlka91",
          "text": "And Democrats would rage if they didn’t end world hunger within a month",
          "timestamp": "2021-12-07 14:51:26",
          "score": 11,
          "num_children": 1,
          "author": 132451,
          "replies": [
            {
              "id": "hnlugdd",
              "text": "> And Democrats would rage if they didn’t end world hunger within ~~a month~~ a week\n\nFTFY!",
              "timestamp": "2021-12-07 16:05:18",
              "score": 9,
              "num_children": 1,
              "author": 354546,
              "replies": [
                {
                  "id": "hnlvqs7",
                  "text": "Exactly",
                  "timestamp": "2021-12-07 16:14:57",
                  "score": 4,
                  "num_children": 0,
                  "author": 132451,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hno8lsi",
          "text": "Also Republicans absolutely do not want to end world hunger, homelessness, or medical debt. \n\nThe gender of your candidate wouldn't matter.  Republicans would crucify them *because* of those stances, not in spite of them.",
          "timestamp": "2021-12-08 02:52:09",
          "score": 2,
          "num_children": 0,
          "author": 215411,
          "replies": []
        }
      ]
    },
    {
      "id": "hnldr8m",
      "text": "It’s because the republican voter base treats politics like a sport. Miami Dolphin fans still show up to games, buy merchandise, and say “this year is their year”.",
      "timestamp": "2021-12-07 14:00:25",
      "score": 46,
      "num_children": 0,
      "author": 230903,
      "replies": []
    },
    {
      "id": "hnl9qo3",
      "text": "Republicans are hostile to the very concept of human decency. They’re not your friends and they are not worth arguing with.",
      "timestamp": "2021-12-07 13:26:11",
      "score": 104,
      "num_children": 2,
      "author": 358929,
      "replies": [
        {
          "id": "hnormsp",
          "text": "Goddamn right",
          "timestamp": "2021-12-08 05:56:23",
          "score": 2,
          "num_children": 0,
          "author": 357518,
          "replies": []
        },
        {
          "id": "hnovrsy",
          "text": "They run off of discord and misconduct. What notable bills did they pass that truly benefitted anyone in the past decade or how many? When critized they act like victims and say they're \"canceled\" and double down.",
          "timestamp": "2021-12-08 06:48:32",
          "score": 2,
          "num_children": 0,
          "author": 220220,
          "replies": []
        }
      ]
    },
    {
      "id": "hnledtv",
      "text": "Oh man, pandora's box has been opened. Facebook, twitter, instagram, whatsapp, telegram, and reddit have all created a thick webbing of networking bigots that reciprocate their echoing yodels about everything. They've generated a massive and active support network for the weakest, emotionally unstable, and immature minds of our country. Great stuff.",
      "timestamp": "2021-12-07 14:05:37",
      "score": 25,
      "num_children": 0,
      "author": 376065,
      "replies": []
    },
    {
      "id": "hnld7s8",
      "text": "Literally, say what you will about Republicans, the American progressive can learn one thing from them: how to fight dirty. Democrats are so caught up in respectability and \"building bridges\" that they're not willing to get in the mud to push through transformative legislation and say \"fuck you, got mine\" to the mythical \"moderate swing voter\". \n\nDemocrats are forever on the defense, and bar a small handful of congressfolks with some nerve like Sanders and AOC, that's gonna be what keeps them from ever getting anything big done.",
      "timestamp": "2021-12-07 13:55:57",
      "score": 57,
      "num_children": 5,
      "replies": [
        {
          "id": "hnlqg4x",
          "text": "[A good vid on the problem](https://www.youtube.com/watch?v=MAbab8aP4_A)",
          "timestamp": "2021-12-07 15:35:39",
          "score": 7,
          "num_children": 1,
          "replies": [
            {
              "id": "hnlxcyw",
              "text": "I love The Alt-Right Playbook!! Watched the whole series, Danskin's videos are *fantastic*",
              "timestamp": "2021-12-07 16:26:58",
              "score": 4,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hnli1sg",
          "text": ">Democrats are so caught up in respectability and \"building bridges\" that they're not willing to get in the mud to push through transformative legislation and say \"fuck you, got mine\" to the mythical \"moderate swing voter\".\n\nits all a fucking show. They have no desire to do anything their rich overlords don't want to do. But in order to keep raking in billions of dollars off rubes, they play the game. THis is Murica, don't catch ya slippin...",
          "timestamp": "2021-12-07 14:34:36",
          "score": 22,
          "num_children": 1,
          "replies": [
            {
              "id": "hnn8pqi",
              "text": "Yup.\n\nRemember when the Clinton recording came out and she explicitly stated the party had a private and public position on every issue?",
              "timestamp": "2021-12-07 22:05:50",
              "score": 4,
              "num_children": 0,
              "author": 224189,
              "replies": []
            }
          ]
        },
        {
          "id": "hnle599",
          "text": "The reality is that most establishment dems (aka most of the dems unfortunately), don’t want to actually build bridges and solve the issues. They’re corporate democrats. In terms of left versus right, the US “left” in congress and the Oval Office is dead center. The US “right,” is actually far right extremism. \n\nThe corporate dems want to uphold the establishment and keep the corporate powers in *power*, and line their pockets. Only a few of the folks on the [US] left actually want to do some good. Say what you will, but I only see a few folks walking the walk, and that’s Sanders and AOC.",
          "timestamp": "2021-12-07 14:03:38",
          "score": 33,
          "num_children": 1,
          "author": 345680,
          "replies": [
            {
              "id": "hnlhys8",
              "text": "Still pissed democrats stole the nomination from Bernie.",
              "timestamp": "2021-12-07 14:33:58",
              "score": 17,
              "num_children": 3,
              "author": 137793,
              "replies": [
                {
                  "id": "hnlork6",
                  "text": "If you look at Republican primary turnout and other heuristics it's pretty clear GOPers did an operation chaos on Bernie. The Democrats just didn't stop them",
                  "timestamp": "2021-12-07 15:23:41",
                  "score": 15,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hnlu9c0",
                  "text": "> Still pissed democrats stole the nomination from Bernie.\n\nBernie supporters stole the nomination from Bernie by *not showing up at the polls*. 😒",
                  "timestamp": "2021-12-07 16:03:52",
                  "score": 11,
                  "num_children": 1,
                  "author": 354546,
                  "replies": [
                    {
                      "id": "hnns4kv",
                      "text": "It’s what happens when your supporters are more interested in making memes than actually getting involved in the political process.",
                      "timestamp": "2021-12-08 00:34:57",
                      "score": 5,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hno1lzd",
                          "text": "LOL, yep!  That's it *exactly*!",
                          "timestamp": "2021-12-08 01:53:24",
                          "score": 2,
                          "num_children": 0,
                          "author": 354546,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hnmq1v9",
                  "text": "I like Bernie, but I was sorely disappointed that the race came down to two ancient white guys. Not great for building a party up.",
                  "timestamp": "2021-12-07 19:55:29",
                  "score": 4,
                  "num_children": 1,
                  "author": 384860,
                  "replies": [
                    {
                      "id": "hnmr8mt",
                      "text": "It's literally always been nothing but ancient white guys (til Obama)",
                      "timestamp": "2021-12-07 20:04:25",
                      "score": 3,
                      "num_children": 0,
                      "author": 137793,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hnm2j6s",
          "text": "Democrats are controlled opposition, everything is working as intended.\n\n\nAmerica has one party, the party of capital.",
          "timestamp": "2021-12-07 17:05:11",
          "score": 8,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hnmjij0",
          "text": "Taking as a given for the sake of argument that Democrats are far less likely to win if they fight “fair,” would you consider a win where both sides fight dirty to be an actual win? Or it’s it just a loss of a different kind? \n\nConsidering a specific example, and taking it to the extreme: \n\nIf the Dems have only a 40% chance of winning while fighting fair, but an 80% chance of winning fighting dirty, but any side that fights dirty and wins becomes a de facto dictator — then it might be considered better to fight fair, because an 80% chance of a Dem dictator leading a failed democracy is worse than a 40% chance of a functional democracy led by a Dem, even combined with a 60% chance of a GOP-led dictator leading a failed democracy.",
          "timestamp": "2021-12-07 19:07:32",
          "score": -2,
          "num_children": 1,
          "author": 193565,
          "replies": [
            {
              "id": "hnq8tj3",
              "text": "Talking in abstract percentages and a fixed number of possibilities is nonsense. Millions of peoples' lives are at stake, this isn't a statistical exercise.",
              "timestamp": "2021-12-08 15:46:16",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hnqi62d",
                  "text": "Sorry for asking a question, but the question remains: would you give up a real democracy in order to ensure corrupt democrats over corrupt republicans?\n\nA parallel question was discussed at the end of The Syndic, a novel by CM Kornbluth that I happen to like. \n\nI *think* I’d make the same choice you’re arguing is obvious, but I think it’s far from obvious. The character in the novel argued the other way.",
                  "timestamp": "2021-12-08 16:48:09",
                  "score": 1,
                  "num_children": 0,
                  "author": 193565,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hnld5c8",
      "text": "That’s how gerrymandering works.",
      "timestamp": "2021-12-07 13:55:23",
      "score": 11,
      "num_children": 0,
      "author": 10622,
      "replies": []
    },
    {
      "id": "hnlro6n",
      "text": "Rip Al Franken's career. \n\nAir-honka a sleeping lady? Resign out of respect.\n\nGrab em by the pussy? Walk in to changeroom? Second coming of Jesus, and multiple coming of Ben Garrison.",
      "timestamp": "2021-12-07 15:44:39",
      "score": 10,
      "num_children": 1,
      "author": 206956,
      "replies": [
        {
          "id": "hnmf1am",
          "text": "Eh, that was actually the least of what he did.  8 women came forward alleging he groped them and/or forcibly kissed them.  Many of the women were fans of him/Democrats and many of the incidents occurred while he was a Senator. I'm glad we hold our own up to a higher standard than Republicans do.  \n\nhttps://time.com/5042931/al-franken-accusers/\n\nThat being said: I wish we'd go after corrupt politicians as well.  Seriously, any Democrat who isn't fighting for campaign finance reform and whatnot should be primaried and replaced.",
          "timestamp": "2021-12-07 18:35:55",
          "score": 2,
          "num_children": 1,
          "author": 151701,
          "replies": [
            {
              "id": "hnmq8l9",
              "text": "https://imgur.com/gallery/FWPtO",
              "timestamp": "2021-12-07 19:56:51",
              "score": 2,
              "num_children": 1,
              "author": 384860,
              "replies": [
                {
                  "id": "hnmr4ct",
                  "text": "And what about the seven other women?  Like, she might have been a hit job but the rest of the women weren't.",
                  "timestamp": "2021-12-07 20:03:29",
                  "score": 1,
                  "num_children": 1,
                  "author": 151701,
                  "replies": [
                    {
                      "id": "hnmutnu",
                      "text": "Dunno. Maybe the legal system should get on that, and he shouldn't be a public figure anymore while they sort it out.\n\nIncidentally, https://en.wikipedia.org/wiki/Donald_Trump_sexual_misconduct_allegations",
                      "timestamp": "2021-12-07 20:29:22",
                      "score": 3,
                      "num_children": 1,
                      "author": 206956,
                      "replies": [
                        {
                          "id": "hnmy5jh",
                          "text": "This happened years ago but also: gropings are so difficult to prosecute they generally don't bother. Also, I'm not sure how these women felt about it, but a lot of people who are groped don't necessarily think the person should go to jail, just that they maybe shouldn't be in such a position of power. \n\nI'm aware Trump had way more allegations, heck, he bragged about it on tape.  Still, I don't think we should lower our standards just because Republican's standards are like...Marianas Trench low.",
                          "timestamp": "2021-12-07 20:53:10",
                          "score": 2,
                          "num_children": 0,
                          "author": 151701,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hnlgwxf",
      "text": "Remember David Vitter, the Republican Louisiana Senator who was reelected *after* it was revealed that he liked to have prostitutes make him wear diapers?",
      "timestamp": "2021-12-07 14:25:47",
      "score": 9,
      "num_children": 0,
      "author": 408774,
      "replies": []
    },
    {
      "id": "hnlmcbe",
      "text": "GOP doesn't even have a platform anymore, at least nothing beyond \"Oppose Dems\".",
      "timestamp": "2021-12-07 15:06:26",
      "score": 8,
      "num_children": 0,
      "author": 246442,
      "replies": []
    },
    {
      "id": "hnmguxm",
      "text": "It's not a media narrative. It's the way Republicans vote. Dem voters demand actual things that improve lives or they won't show up. Republican voters only demand that every candidate talks about how much they hate the Dems.",
      "timestamp": "2021-12-07 18:48:37",
      "score": 10,
      "num_children": 0,
      "author": 250787,
      "replies": []
    },
    {
      "id": "hnlhl2q",
      "text": "I don't want to play the, 'both side are equal' game, because they are not. BUt a whole lot of what we see in terms of our 2 party system is all staged bullshit. Not like a bunch of old people sitting around twirling their mustaches scheming, but not too far off from it either...\n\nAsk yourself this simple question. A tax break to the tune of trillions for the super rich. Passes through like its nothing. \n\nA social piece that can help the poorest among us, which doesn't even include universal healthcare, and suddenly there are literally just enough democrats that oppose it, clutching their pearls about defecit. Republicans run the defecit up all the time, and if we stopped chopping taxes for teh uber rich, the coffers would be full to fund all those social programs. But that would make the poors far too comfortable and less controlable by the rich to do all their dirty work for shitty money. And the democrats are more than comfortable having a society where the rich have absolute control over the rest of us...\n\nFUck the whole system to shit. It's corrupt to the core, and nothing short of a revolution will change anything. Last summer was hopeful with the protests, but the ruling class and the billionares have us so polarized and fighting over bullshit that we'll never be able to band together to fight the only war we need to fight, the class war. \n\nTL;DR - America is done...",
      "timestamp": "2021-12-07 14:31:00",
      "score": 27,
      "num_children": 1,
      "replies": [
        {
          "id": "hnn63wf",
          "text": ">suddenly there are literally just enough democrats that oppose it\n\nhttps://www.urbandictionary.com/define.php?term=rotating%20villain",
          "timestamp": "2021-12-07 21:47:27",
          "score": 2,
          "num_children": 0,
          "author": 298404,
          "replies": []
        }
      ]
    },
    {
      "id": "hnlp73s",
      "text": "Authoritarians usually step in line when dear leader tells them to, and they don't care about things like ethics, facts, and logical consistency.",
      "timestamp": "2021-12-07 15:26:46",
      "score": 7,
      "num_children": 0,
      "author": 250645,
      "replies": []
    },
    {
      "id": "hnl5yrx",
      "text": "To be fair, if you're a monkey, nobody is surprised when you fling poo like a monkey. Thanks to trumpism, the republicans have a much lower bar to reach. Even if they eat a little poo, they're given a pass...",
      "timestamp": "2021-12-07 12:51:21",
      "score": 14,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hnl9ijb",
      "text": "That's because Trump is an anti-hero (though he's really fits the evangelical's description of the [Anti-Christ](https://www.benjaminlcorey.com/could-american-evangelicals-spot-the-antichrist-heres-the-biblical-predictions/)). The worse character their anti-hero is and thus the more he \"owns the libs,\" the more they love him for it.",
      "timestamp": "2021-12-07 13:24:11",
      "score": 13,
      "num_children": 0,
      "author": 298404,
      "replies": []
    },
    {
      "id": "hnl8a99",
      "text": "Well, it does seem like democrats require sainthood of their leaders (see Al Franken) while republicans don't give a single fuck as long as they keep power.  Democrats want good leaders and republicans want power.  Big difference in end goals.",
      "timestamp": "2021-12-07 13:13:10",
      "score": 30,
      "num_children": 1,
      "author": 113817,
      "replies": [
        {
          "id": "hnm5tkq",
          "text": "“Democrats want good leaders”\n\nWhy did they elect Joe Biden and Kamala Harris then?",
          "timestamp": "2021-12-07 17:29:43",
          "score": 3,
          "num_children": 1,
          "author": 142378,
          "replies": [
            {
              "id": "hnm95r2",
              "text": "and the purity testing for internet points continues.",
              "timestamp": "2021-12-07 17:54:01",
              "score": -2,
              "num_children": 1,
              "author": 113817,
              "replies": [
                {
                  "id": "hnmaj19",
                  "text": "Why do Democrats promote neoliberalism when they could just… not do that? That isn’t purity testing. I don’t care if they’re perfect. Neoliberalism is the same imperialist ideology espoused by conservatives, but Dems shut down any criticism of it with their dumbass “nobody’s perfect” BS.",
                  "timestamp": "2021-12-07 18:03:53",
                  "score": 9,
                  "num_children": 1,
                  "author": 142378,
                  "replies": [
                    {
                      "id": "hnmfkpd",
                      "text": "\\> neoliberalism\n\nBernie Sanders and AOC would like a word with you.\n\n\\> That isn’t purity testing.\n\nSure it is.  But please, enlighten me with your candidates that win national / govenor offices?\n\n\\> imperialist ideology\n\nUsually said by people who don't want to actually accomplish anything, have not actually accomplished anything, wallow in victimization and just throw stones and stamp their feet in moral outrage without actually having to do anything.",
                      "timestamp": "2021-12-07 18:39:36",
                      "score": -2,
                      "num_children": 1,
                      "author": 113817,
                      "replies": [
                        {
                          "id": "hnmjlhz",
                          "text": "Obviously you don’t know what imperialism is, so I have no clue why you’re laughing about it. Bernie and AOC are also imperialists. The reason my candidates don’t win is because electoralism is designed to protect capital. The kind of genuine social change I advocate for isn’t really achievable within its framework. With that said, I think the least Democrats could do is to not promote the presidency of a segregationist and a cop.",
                          "timestamp": "2021-12-07 19:08:07",
                          "score": 3,
                          "num_children": 1,
                          "author": 142378,
                          "replies": [
                            {
                              "id": "hnmrzf5",
                              "text": "\\> what imperialism is\n\nOr.....I do and you are just continuing your condescending bullshit.\n\n\\> Bernie and AOC are also imperialists\n\nOk, so in other words, you really, really don't give a shit about actually winning elections you and actually accomplishing anything you just want to roll around in moral elitism and do absolutely fucking nothing, and never ever actually accomplish anything.  Got it.\n\n\\> The reason my candidates don’t win \n\nAnd there we go.  Excuses, lies, and bullshit.   I can hear the accctualllly from here.  Always an excuse, never an accomplishment. \n\n\\> The kind of genuine social change\n\nblah blah blah blah mindless moralizing doesn't accomplish anything and just regurgitates useless bullshit.",
                              "timestamp": "2021-12-07 20:09:55",
                              "score": -3,
                              "num_children": 1,
                              "author": 113817,
                              "replies": [
                                {
                                  "id": "hnmvt95",
                                  "text": "I never made any statement about who anybody should be voting for. Like I said, I don’t think voting is very effective on a large scale, but if voting for Democrats is beneficial, I don’t have a problem with anyone for doing it. My problem is with people who vehemently defend Democrat candidates and completely brush off their horrendous policies in order to preserve the falsely positive image of them that is created by the media. You just laughed when I mentioned that the Democrats are imperialists. Do you seriously not have any problem with imperialism, or do you think it isn’t a valid criticism? If it’s “moral elitism” to argue that we should be harshly critical of Biden for his administration’s treatment of immigrants or AOC’s support for Israel, then it sounds like you either have terrible principles or none at all. Why even bother with politics if that’s the case?",
                                  "timestamp": "2021-12-07 20:36:28",
                                  "score": 3,
                                  "num_children": 1,
                                  "author": 142378,
                                  "replies": [
                                    {
                                      "id": "hnmwsq6",
                                      "text": "\\> Like I said, I don’t think voting is very effective\n\nWhich smells very much like rationalization for not doing anything.\n\n\\>  falsely positive image of them that is created by the media\n\nOr they disagree with your purity testing opinions.\n\nSo you want republicans and donald to run the country.  Interesting.  That's not going to work out very well for you. \n\n\\> You just laughed when I mentioned that the Democrats are imperialists.\n\nCorrect, I was laughing at you.\n\n\\> or do you think it isn’t a valid criticism?\n\nding ding ding we have a winner.\n\n\\> we should be harshly critical of Biden\n\nGo right and be as critical as you want.  And when you drive people away from voting for democrats, when you do nothing to help democrat candidates, when you don't run and win elections you will get to do even more whining after republicans and donald take office and they really start fucking you over.",
                                      "timestamp": "2021-12-07 20:43:29",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 113817,
                                      "replies": [
                                        {
                                          "id": "hnmxofp",
                                          "text": "I do not support Republicans or Donald Trump. I have no clue where you got that idea from. I’m also not advocating for people to do nothing. I want people to do the exact opposite of nothing. I want people to organize so that they can have genuine political power rather than relying on corporate hacks who pretend to care about them but work against their interests. Would you mind explaining why exactly you think Democrats are not imperialists? That’s a pretty ludicrous assertion that I’m gonna need some evidence for.",
                                          "timestamp": "2021-12-07 20:49:47",
                                          "score": 3,
                                          "num_children": 1,
                                          "author": 142378,
                                          "replies": [
                                            {
                                              "id": "hnmywhv",
                                              "text": "\\> I do not support Republicans or Donald Trump.\n\nShitting on democrats by definition helps republicans and donald.  Expecting perfection from democrats while republicans only care about power hurts democrats and helps republicans and donald.  Doing nothing but whining helps republicans and donald. \n\n\\> Would you mind explaining why exactly you think Democrats are not imperialists\n\nI'm not going to spend any time on convincing your of your bullshit.  You won't believe it, any more than I am going to argue with maga cultists.   You want to believe that kind of mindless drivel and squander time and money on that bullshit more power to you.  I am sure you can find many people that just want to whine and moan and moralize and purity test and accomplish absolutely nothing but helping the republican donald maga party.  Good luck with that.",
                                              "timestamp": "2021-12-07 20:58:05",
                                              "score": -1,
                                              "num_children": 1,
                                              "author": 113817,
                                              "replies": [
                                                {
                                                  "id": "hnn1900",
                                                  "text": "Yeah I figured you didn’t have any actual argument for that. Again, I didn’t say that people shouldn’t vote for Democrats. You can vote for someone and still be critical of them. In fact, you should always be critical of anything or anyone you support. Otherwise you’ll inevitably end up supporting some truly terrible stuff, and it’s easy to use mental gymnastics to convince yourself that supporting that kind of thing is fine. That seems to have happened to you, so all I can offer you is a word of advice: if the actions of someone you support go against your principles, don’t just deny it. Do some investigation and figure out why that is so that you can continue to support the causes you believe in without having to support actions and policies you disagree with. You don’t have to not vote for them or support their opposition. If my only two options are Biden and Trump, I would vote for Biden, but I would not pretend that he didn’t have massive flaws that need to be addressed and accounted for.",
                                                  "timestamp": "2021-12-07 21:13:54",
                                                  "score": 2,
                                                  "num_children": 1,
                                                  "author": 142378,
                                                  "replies": [
                                                    {
                                                      "id": "hnn41ic",
                                                      "text": "\\> Yeah I figured you didn’t have any actual argument for that\n\nOr.....why get sucked into a meaningless argument with someone not interested in actually learning anything or doing anything.",
                                                      "timestamp": "2021-12-07 21:33:05",
                                                      "score": -1,
                                                      "num_children": 1,
                                                      "author": 113817,
                                                      "replies": [
                                                        {
                                                          "id": "hnn47zi",
                                                          "text": "What do you want me to learn? I’m listening.",
                                                          "timestamp": "2021-12-07 21:34:21",
                                                          "score": 2,
                                                          "num_children": 0,
                                                          "author": 142378,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hnltav8",
      "text": "Because democrats are responsible and hold themselves accountable. GOP voters are cheering for shit smeared walls",
      "timestamp": "2021-12-07 15:56:44",
      "score": 4,
      "num_children": 0,
      "author": 192463,
      "replies": []
    },
    {
      "id": "hnltypt",
      "text": "“The Left falls in love while the Right falls in line.” Cult members love the idea of the cult itself. There might be a charismatic leader or not to get them to cut themselves a million times but the right winger will always vote for the right wing, even if it’s a RINO. The left just doesn’t. It’s partially the political philosophy of the two sides, one is aimed at fairness and equal protection within the group (the Left) while the other is focused only on the definitions and makeup of the group (the Right). So the Right will always fall in line because the right doesn’t need to give a damn about fairness.",
      "timestamp": "2021-12-07 16:01:38",
      "score": 4,
      "num_children": 0,
      "author": 382827,
      "replies": []
    },
    {
      "id": "hnmcrho",
      "text": "The way I see it, when you only have 1 option, and they could actually do something to improve the country despite republican knockback, but basically don't,\n\n it feels like having a depressed super hero who's absolutely not in the mood to help anyone other than whoever they gain the most from, with an actively pissed off rabid villain wreaking havoc.\n\nLike, yeah no shit I'm going with the depressed egotistical hero over the dude shooting fire out their ass on villages. But I have actual standards for them, and when their interests are constantly against everyone you know, eventually you just give up. Like a cat persistant about going outside in the rain, the scratches are long old, it's been a long time trying, and I'm tired.\n\nA third party is the only route for this country to begin progressing in any meaningful way, including getting more parties over time. Sure, getting a few good things done every 4-8 years is great and all, but we're the most bloated fucking country, we can do more, faster, but refuse to entirely out of rich fuck's desire.",
      "timestamp": "2021-12-07 18:19:54",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hnlf4oa",
      "text": "It's all because of their cult leader who can brag about abusing women & get hookers to pee on a hotel room bed and still get elected. He started all that.",
      "timestamp": "2021-12-07 14:11:42",
      "score": 9,
      "num_children": 0,
      "author": 252900,
      "replies": []
    },
    {
      "id": "hnlkd4d",
      "text": "Democrats are pretty shitty but next to the GOP they are Anarchist leftist",
      "timestamp": "2021-12-07 14:52:02",
      "score": 3,
      "num_children": 0,
      "author": 196739,
      "replies": []
    },
    {
      "id": "hnlum4u",
      "text": "That’s because republican’s only demands are that you be racist and do whatever trump says.",
      "timestamp": "2021-12-07 16:06:30",
      "score": 3,
      "num_children": 0,
      "author": 390658,
      "replies": []
    },
    {
      "id": "hnm3thg",
      "text": "Mainstream corporate media sees everything through a rightwing perspective: and the Dem's usually attempt to meekly jump through their hoops, instead of challenging the slanted questions.",
      "timestamp": "2021-12-07 17:14:52",
      "score": 3,
      "num_children": 0,
      "author": 246718,
      "replies": []
    },
    {
      "id": "hnm86no",
      "text": "Because the left wing of the bird isn't a fucking cult",
      "timestamp": "2021-12-07 17:47:00",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hnm95et",
      "text": "That’s because Republicans’ constituents eat shit for breakfast, lunch, and dinner.",
      "timestamp": "2021-12-07 17:53:57",
      "score": 3,
      "num_children": 0,
      "author": 365070,
      "replies": []
    },
    {
      "id": "hnmi5lq",
      "text": "That's because those of us who vote dem don't actually like most of our politicians and only vote for them because the GOP are fucking Nazis, so in order to keep us from completely abandoning them the dems have to actually react when a member gets out of line.",
      "timestamp": "2021-12-07 18:57:53",
      "score": 3,
      "num_children": 0,
      "author": 211628,
      "replies": []
    },
    {
      "id": "hnm4qp3",
      "text": "That’s because (most) democrats are rational",
      "timestamp": "2021-12-07 17:21:47",
      "score": 2,
      "num_children": 0,
      "author": 394576,
      "replies": []
    },
    {
      "id": "hnme5js",
      "text": "Smash the fash!!!!!!!!",
      "timestamp": "2021-12-07 18:29:46",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hnmin5d",
      "text": "Gerrymandered safe districts",
      "timestamp": "2021-12-07 19:01:18",
      "score": 2,
      "num_children": 0,
      "author": 14017,
      "replies": []
    },
    {
      "id": "hnmzpas",
      "text": "He’s not wrong…. The Democrats are so legislatively incompetent… and the whole “can’t stoop to their level” shit is getting old. It’s time to fight fire with fire. And they are incapable of doing that or the filibuster would’ve already been squashed.",
      "timestamp": "2021-12-07 21:03:16",
      "score": 2,
      "num_children": 0,
      "author": 153976,
      "replies": []
    },
    {
      "id": "hnmzuiv",
      "text": "Shitting themselves and smearing it on the walls is what Republican constituents want their elected officials to do. That's what it says on the tin, it's bad faith all the way down.",
      "timestamp": "2021-12-07 21:04:15",
      "score": 2,
      "num_children": 0,
      "author": 139913,
      "replies": []
    },
    {
      "id": "hnn7ep4",
      "text": "This is exactly what I have been pointing out to the people posting about someone using the term Latinx or other stuff like that. The right can elect a man who calls Mexicans rapists and the media still acts like that's a viable candidate because that's okay somehow. The right can have literal Nazi marches in our nation's capital with 500 people walking around the streets of a city that some of these same people attacked almost a 11 months ago to the day and the news media--the one that they call so liberal and left leaning barely blinks an eye. \n\nI don't really get how at the same time that the media is meant to be favoring the left or even the center left that they're so constantly wrapped up in Republican talking points and allowing grifters to frame the narrative around almost anything in the national conversation.",
      "timestamp": "2021-12-07 21:56:31",
      "score": 2,
      "num_children": 0,
      "author": 277978,
      "replies": []
    },
    {
      "id": "hno4ruz",
      "text": "There's a reason for this. Democrats, if they're not happy with the candidate, won't vote. At all. The far left in the us and most of the progressives didn't like Hillary, so they stayed home. Trump won.  \n\n\nREPUBLICANS ALWAYS SHOW UP. *AND THEY* ***ALWAYS*** *PULL THE RED LEVER.* They're trained from childhood to do it, you grow up hearing over and over how important voting is. Reddit still calls out the idea of \"blue no matter who\" but here's the thing, YOU NEED THAT. Get blue candidates elected, and then worry about the slide to the left or whatever. Republicans are shifting the overton window because all they gotta do is run and they win. And now on r/politics you got people posting all over the place \"if Biden doesn't forgive my student loans democrats are gonna lose.\" Yeah, the implication there is clearly \"because I won't vote for him\". They pulled this shit with Hillary and now Roe is seriously at risk.   \n\n\nNobody's saying \"vote for the convicted rapist\" or anything, but jesus christ if the alternative is something like Trump you're implicit if you look at that and say \"but there are rumors that she fucked over Bernie! I'm not voting for her.\" Might as well just vote for trump at that point.",
      "timestamp": "2021-12-08 02:19:48",
      "score": 2,
      "num_children": 1,
      "author": 413119,
      "replies": [
        {
          "id": "hnol4ga",
          "text": "THANK YOU!!",
          "timestamp": "2021-12-08 04:45:41",
          "score": 1,
          "num_children": 0,
          "author": 18381,
          "replies": []
        }
      ]
    },
    {
      "id": "hno6cn6",
      "text": "Its almost like we actually have integrity and value good things and they don't.",
      "timestamp": "2021-12-08 02:33:05",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hno9sfm",
      "text": "Republicans spending the last 50 years actively breaking american democracy to create a circumstance where they can rule as a white christian fascist minority leads to this.",
      "timestamp": "2021-12-08 03:02:19",
      "score": 2,
      "num_children": 0,
      "author": 260650,
      "replies": []
    },
    {
      "id": "hnlhpav",
      "text": "I think the real reason is that the Republican party has proven itself to be like a child, incapable of acting reasonably. When a toddler shits in their pants it's expected. The Democrats are trying to be the adult. They catch the flak because *someone* has to clean up the toddler's shitty mess.",
      "timestamp": "2021-12-07 14:31:54",
      "score": 6,
      "num_children": 0,
      "author": 221385,
      "replies": []
    },
    {
      "id": "hnl9ljk",
      "text": "I mean, they have the presidency and control of Congress, so there's no good reason why we shouldn't expect them to do what they promised. \n\nAnd they're going to lose because they didn't do what they promised.",
      "timestamp": "2021-12-07 13:24:56",
      "score": 8,
      "num_children": 1,
      "author": 224189,
      "replies": [
        {
          "id": "hnlhwkj",
          "text": "[rotating villian](https://www.urbandictionary.com/define.php?term=rotating%20villain)",
          "timestamp": "2021-12-07 14:33:28",
          "score": 13,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hnm2l2z",
      "text": "I've been voting democrat for the past 14 years now and they have yet to do a god damn thing.",
      "timestamp": "2021-12-07 17:05:34",
      "score": 3,
      "num_children": 1,
      "author": 184155,
      "replies": [
        {
          "id": "hnm5d1d",
          "text": "THIS. The Democrats don't exist to solve problems for their voters. They're just supposed to be the friendlier face of the establishment. I'm sick of people thinking that it's the Republicans who hold the Dems back, when we all know it's their damn donors pulling all the strings. The Republicans will never support a public healthcare system in the US, and establishment Dems count on that to avoid having to choose between their health insurance donors and their sick poorer voters. It's disgusting and we should all be sick of their bullshit. I'm sure they'll appear sad about Rowe v Wade going away but in private I bet they're super stoked over the fundraising opportunity it presents.",
          "timestamp": "2021-12-07 17:26:20",
          "score": 1,
          "num_children": 0,
          "author": 359383,
          "replies": []
        }
      ]
    },
    {
      "id": "hnloo88",
      "text": "I think that’s due to the no compromise black and white mentality of the left wing in the US. Rightwing thought concerning what’s acceptable or not, is malleable. “Hillary lied and/or is bad” crowd, I’m looking at you.",
      "timestamp": "2021-12-07 15:23:02",
      "score": 0,
      "num_children": 0,
      "author": 38465,
      "replies": []
    },
    {
      "id": "hnm07y0",
      "text": "gerrymandering is a hell of a drug",
      "timestamp": "2021-12-07 16:48:14",
      "score": 1,
      "num_children": 0,
      "author": 365578,
      "replies": []
    },
    {
      "id": "hnm9sbe",
      "text": "It’s only a double-standard if you have standards to start with.",
      "timestamp": "2021-12-07 17:58:31",
      "score": 1,
      "num_children": 0,
      "author": 167041,
      "replies": []
    },
    {
      "id": "hnmdlnh",
      "text": "[“Murc's law, for the uninitiated, is the widespread assumption that only Democrats have any agency or causal influence over American politics.”](https://www.lawyersgunsmoneyblog.com/2017/12/great-moments-murcs-law)",
      "timestamp": "2021-12-07 18:25:48",
      "score": 1,
      "num_children": 0,
      "author": 367048,
      "replies": []
    },
    {
      "id": "hnmxpts",
      "text": "Trump did get elected once already...",
      "timestamp": "2021-12-07 20:50:03",
      "score": 1,
      "num_children": 0,
      "author": 397494,
      "replies": []
    },
    {
      "id": "hnn28ri",
      "text": "Republicans will only fight for two things and only two things, guns and money. The fight against everything else no matter what. What happens with the typical Republican voter is that they vote against the Democrat, no matter who it is, come hell or high water.",
      "timestamp": "2021-12-07 21:20:48",
      "score": 1,
      "num_children": 0,
      "author": 48636,
      "replies": []
    },
    {
      "id": "hnn6teq",
      "text": "The Democratic Party is who we vote for to keep the monsters out (that is, the Republican Party), and when we are insufficient, they wreak havoc on the nation.\n\nThe last two Republican presidents won without a majority (one by a SCOTUS ruling contrary to any legal philosophy).\n\nThe Democratic Party doesn't serve the public. Its _only_ platform is that the Republican Party is the alternative and will kill us. Sure, there are Social Democrats pushing for some relief and hunane treatment of the people, but they are the red-haired stepchildren of the Democratic Party, treated like a malignant tumor to be excised.\n\nIf we want to save the United States and prevent humanity from getting hammered by the climate crisis, we need to form a coalition of the people and take direct action. \n\nBut, since it is not feasible to organize such a movement of sufficient size to overwhelm state militants (law enforcement), we rely on disorganized action.",
      "timestamp": "2021-12-07 21:52:19",
      "score": 1,
      "num_children": 0,
      "author": 264568,
      "replies": []
    },
    {
      "id": "hnnemy7",
      "text": "Yep. I see the trolls on YT noticed too, because they lean all of the way into this. \"Oh no, Biden isn't burning the nation and scamming the public and firing babies out of cannons, but he can't do this one thing? Guess Trump was betting. Orange man good.\"\n\nThey get a firm fuck off.\n\nOFC then the next wave of bans comes along and most of those faces disappear/get banned, often because troll farm. Amazing what people will do for money...",
      "timestamp": "2021-12-07 22:49:54",
      "score": 1,
      "num_children": 0,
      "author": 332117,
      "replies": []
    },
    {
      "id": "hnneyt5",
      "text": "Its because its true. I think people fail to realize that the Democratic election was a coalition of many much more complex farther left and central groups. Many people voted for Democrats not out of support for them, but out of a lack of support for the alternative. In order to keep that going, they pretty much need to have a perfect record. Republicans don't have that problem because they are a party developed around the idea of falling in line.",
      "timestamp": "2021-12-07 22:52:20",
      "score": 1,
      "num_children": 0,
      "author": 345908,
      "replies": []
    },
    {
      "id": "hnnvoqh",
      "text": "No it isn't. Democrats don't have to be perfect, they have to try at all. Democratic voters are disappointed with the Democrats and they can risk losing the next election cycle when they fail to live up to the promises they made on the campaign trail, especially when they make no attempt to live up to them.\n\nRepublicans also have to do this. If they don't appeal to their voters they will lose their election. The difference is that their voters want republicans who will \"shit themself and smear it all over the walls\". Destroying our democracy is popular for them. A moderate, level headed republican that fails to harm the right amount of minorities will face the same disappointment that we are now leveling at Biden.",
      "timestamp": "2021-12-08 01:03:56",
      "score": 1,
      "num_children": 0,
      "author": 242840,
      "replies": []
    },
    {
      "id": "hnon1s0",
      "text": "Republicans keep winning because they have massive amounts party loyalty.  It’s not that they are smart or have good ideas or anything like that.",
      "timestamp": "2021-12-08 05:05:35",
      "score": 1,
      "num_children": 0,
      "author": 282477,
      "replies": []
    },
    {
      "id": "hnoslfy",
      "text": "We need to replace judges with computers",
      "timestamp": "2021-12-08 06:08:00",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hnouw6b",
      "text": "This looks like it was meant as hyperbole, but the domestic terrorists at the Capitol riots actually did smear their feces on the wall iirc.",
      "timestamp": "2021-12-08 06:37:05",
      "score": 1,
      "num_children": 0,
      "author": 45925,
      "replies": []
    },
    {
      "id": "hnroaap",
      "text": "Kind of how the Right treats minorities.",
      "timestamp": "2021-12-08 21:15:35",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hnmbdir",
      "text": "It's true, voting Republican is the natural thing to do. All things being equal, people following their heart all would vote Republican. The Republican general world view is in line with how we evolved to be and feel. Democrats have to get votes through trickery, manipulation and getting peopel to believe their false promises.",
      "timestamp": "2021-12-07 18:09:50",
      "score": -6,
      "num_children": 3,
      "replies": [
        {
          "id": "hnmbm51",
          "text": "Naturally then you must be in favor of making voting easier for the maximum amount of people to do, being as this would increase the work load of the number of people Democrats would need to “fool.”",
          "timestamp": "2021-12-07 18:11:34",
          "score": 5,
          "num_children": 0,
          "author": 131287,
          "replies": []
        },
        {
          "id": "hnmugyp",
          "text": "Did your mom drink heavily while pregnant with you? I really don’t mean to interrupt this heroic self fellatio sesh you got going here…I was just really curious after reading the single most moronic comment I’ve read today.",
          "timestamp": "2021-12-07 20:26:59",
          "score": 2,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hnnm82y",
          "text": "Reading this was like staring directly into the sun.",
          "timestamp": "2021-12-07 23:48:17",
          "score": 1,
          "num_children": 0,
          "author": 339168,
          "replies": []
        }
      ]
    },
    {
      "id": "hnml4vg",
      "text": "Uhhh, no?\n\nDemocrats don’t have to be “perfect” to win elections, they just have to deliver on their basic promises and implement meaningful changes that improve people’s lives, which they are refusing to do. Which makes it even more frustrating when they lose to the monsters on the right. \n\nIf Democrats returned to their New Deal roots and fought for higher wages, healthcare for all, ending wars, affordable housing and better living conditions, they’d never lose an election again.",
      "timestamp": "2021-12-07 19:19:08",
      "score": -4,
      "num_children": 1,
      "author": 253019,
      "replies": [
        {
          "id": "hnmsui3",
          "text": "They LITERALLY just tried to do something similar to the New Deal, and had to cut it back because of Republicans, Manchin and Sinema.",
          "timestamp": "2021-12-07 20:16:03",
          "score": 3,
          "num_children": 0,
          "author": 317978,
          "replies": []
        }
      ]
    },
    {
      "id": "hno0995",
      "text": "Vote Bernie or be forever stuck in the circlejerk of two sides that aren’t really doing anything about society’s biggest problems.",
      "timestamp": "2021-12-08 01:42:11",
      "score": 0,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hno1mui",
      "text": "I'm not the media but an individual potential voter. \n\nI don't give a flying fat fig what Republican politicians do because I will never in a million years vote for GOP Nazi trash.\n\nOn the other hand. All Democrats have to do is live up to their promises, pass laws that make the super wealthy pay their fair share thereby making life easier for the working class and I will vote for them. \n\nOr at least I would vote for them but they can't even do the barest minimum without crying they're being blocked by Manchin & Sinema or the Parliamentarian or whoever the rotating villain is that day. \n\nTLDR: GOP bad. Democrats need to be more than \"a little less bad than the GOP\". Dems need to actually do good.",
      "timestamp": "2021-12-08 01:53:35",
      "score": 0,
      "num_children": 0,
      "author": 293684,
      "replies": []
    }
  ]
}