{
  "id": "rb70si",
  "text": "Anon is noticing things, somebody stop him\n",
  "timestamp": "2021-12-07 19:15:04",
  "score": 12224,
  "subreddit": "t5_2qh4w",
  "num_children": 27,
  "author": 293069,
  "replies": [
    {
      "id": "hnn2dxe",
      "text": "Unlisted already lol.",
      "timestamp": "2021-12-07 21:21:47",
      "score": 188,
      "num_children": 2,
      "author": 286256,
      "replies": [
        {
          "id": "hnny5da",
          "text": "They can try but they'll never silence the masses",
          "timestamp": "2021-12-08 01:24:33",
          "score": 28,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hnodw5v",
          "text": "Huh",
          "timestamp": "2021-12-08 03:37:46",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hnng4z3",
      "text": "\"energy efficient NFT\"  \n\n\ndid they draw it on paper then scan it or something?",
      "timestamp": "2021-12-07 23:01:10",
      "score": 87,
      "num_children": 2,
      "author": 99142,
      "replies": [
        {
          "id": "hnnyb8v",
          "text": "It's a sticker with a URL to a 4K .jpeg, it's biodegradable and vegan-friendly",
          "timestamp": "2021-12-08 01:25:54",
          "score": 31,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hnnyod1",
          "text": "They walk to your house and use sign language to give you the code as to avoid creation of excess carbon dioxide",
          "timestamp": "2021-12-08 01:28:59",
          "score": 10,
          "num_children": 0,
          "author": 284662,
          "replies": []
        }
      ]
    },
    {
      "id": "hnmoyi6",
      "text": "All according to keikaku   \n\n\nWhat the hell is a \"playable\" NFT? Is that just a crap game that costs $1,000? Cause that is really what it is sounding like. NFT's are just the real life equivalent of those people in Runescape who would double your money for free, and the people buying NFTs are just people who think \"oh man all i have to do is give this person $10,000 and they will double it and hand it back to me, here you go stranger!\"",
      "timestamp": "2021-12-07 19:47:17",
      "score": 1109,
      "num_children": 13,
      "author": 234145,
      "replies": [
        {
          "id": "hnmyh5f",
          "text": "The NFT market is full of people who missed the cryptocurrency train hoping this is the next big thing, and then smarter people who know it's worthless but are just in it for extreme short term gains. Like the people manipulating the Classic Games market to sell an unboxed Mario64 for a million dollars knowing it's overpriced and will crash in a couple of years.",
          "timestamp": "2021-12-07 20:55:20",
          "score": 600,
          "num_children": 6,
          "author": 375983,
          "replies": [
            {
              "id": "hnnbm49",
              "text": "To be fair crypto currency is also worthless and it has a $2TN market cap. In economics it's called the greater fool theory where the thing you're buying doesn't actually have to have \"value\" as long as you can convince an ever greater fool to buy it from you at an even higher price.",
              "timestamp": "2021-12-07 22:26:57",
              "score": 261,
              "num_children": 12,
              "replies": [
                {
                  "id": "hnnex95",
                  "text": "Ngmi",
                  "timestamp": "2021-12-07 22:52:01",
                  "score": 14,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hnnppi6",
                  "text": "That must be why people are buying \"virtual property.\"\n\nConvince some stupid person to buy the Eiffel Tower from you for thousands of dollars in a shitty virtual world with lousy graphics.",
                  "timestamp": "2021-12-08 00:15:45",
                  "score": 13,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "hnoxtux",
                      "text": "Some dude paid a bunch (cant remember the exact amount but in 6 figures+) to have the virtual land next to the virtual land Snoop Dogg bought",
                      "timestamp": "2021-12-08 07:15:54",
                      "score": 3,
                      "num_children": 0,
                      "author": 381859,
                      "replies": []
                    },
                    {
                      "id": "hno0zzj",
                      "text": "Fundamentally the same as \"buying\" a movie on yt",
                      "timestamp": "2021-12-08 01:48:24",
                      "score": 3,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hnoey1q",
                          "text": "You're paying to access the movie. You cannot trade it along.",
                          "timestamp": "2021-12-08 03:47:09",
                          "score": 5,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hnnue9f",
                  "text": "Not at the beginning a lot of people underestimate how much money you could hide from everybody. The black market loved this shit because it was untraceable so nobody could see who has what. This entire life story changed when people were terrified of actual regulation and new capabilities of tracing. In reality if someone can make something that can never be traced with real life value the first system that will use it is the black market and this was the case in cryptocurrency for a long time.",
                  "timestamp": "2021-12-08 00:53:11",
                  "score": 9,
                  "num_children": 0,
                  "author": 274629,
                  "replies": []
                },
                {
                  "id": "hnnc2v1",
                  "text": "Yeah but that’s economics as a whole such as the US dollar it’s only worth what we tell people there is nothing actually backing the value. If the fed wants they can make it worthless we saw this by high inflation this year.",
                  "timestamp": "2021-12-07 22:30:25",
                  "score": 135,
                  "num_children": 7,
                  "author": 338702,
                  "replies": [
                    {
                      "id": "hno1nuk",
                      "text": "Oy vey",
                      "timestamp": "2021-12-08 01:53:49",
                      "score": 10,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "hnnke33",
                      "text": "the thing that makes the US dollar have some value is the country with an army behind it, and some gold i guess",
                      "timestamp": "2021-12-07 23:34:05",
                      "score": 28,
                      "num_children": 3,
                      "author": 211405,
                      "replies": [
                        {
                          "id": "hnnkmnn",
                          "text": "Pretty much only the army.",
                          "timestamp": "2021-12-07 23:35:55",
                          "score": 28,
                          "num_children": 0,
                          "author": 410537,
                          "replies": []
                        },
                        {
                          "id": "hnnmb9l",
                          "text": "So you're saying the answer is crypto + nukes. Got it!",
                          "timestamp": "2021-12-07 23:48:57",
                          "score": 7,
                          "num_children": 0,
                          "author": 174185,
                          "replies": []
                        },
                        {
                          "id": "hnnuv7e",
                          "text": "No gold at all. The dollar is no longer on the gold standard. It’s fiat money.\n\nArmies don’t matter either. Germany had armed forces under the Weinar Republic and the state still faced hyperinflation.\n\nLiterally the only thing that gives the US dollar value is the belief everyone has that it has value.",
                          "timestamp": "2021-12-08 00:57:05",
                          "score": 16,
                          "num_children": 2,
                          "replies": [
                            {
                              "id": "hnnvhlk",
                              "text": "Its belief in the US itself that gives the dollar its value your belief that the economy will function as it should makes money have value if that belief is broken the dollar loses its value",
                              "timestamp": "2021-12-08 01:02:16",
                              "score": 17,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hnohcsl",
                                  "text": "And if that belief falters what happens. Bank runs, system collapses.\n\nTheres not much inherent value then.",
                                  "timestamp": "2021-12-08 04:09:17",
                                  "score": 4,
                                  "num_children": 1,
                                  "author": 42128,
                                  "replies": [
                                    {
                                      "id": "honla83",
                                      "text": "The inherent value is that it's the only currency that the US government accepts for taxes. As long as you live in the US or are a US citizen you have to have US currency. The \"belief\" that supports fiat currency about is not belief in the financial institutions but belief that the IRS is going to come knocking on your door if you don't give them USD",
                                      "timestamp": "2021-12-15 15:39:23",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 297886,
                                      "replies": [
                                        {
                                          "id": "honljef",
                                          "text": ".... Ppl still have to pay taxes during hyper inflation lol. Doesn't make the money any more valuable.",
                                          "timestamp": "2021-12-15 15:41:01",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 42128,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hno0v8g",
                              "text": "The fact OPEC can only sell crude oil for USD gives it more power than any other currency. And the big US military budget keeps anyone threatening that system in line so it's been pretty stable despite all the past and ongoing economic disasters. It sort of feels like that's all coming to an end though, doesn't it? Things are really uncertain these days to where crypto looks more appealing than a rapidly inflating currency.",
                              "timestamp": "2021-12-08 01:47:17",
                              "score": 12,
                              "num_children": 1,
                              "author": 375983,
                              "replies": [
                                {
                                  "id": "hnoezho",
                                  "text": "> The fact OPEC can only sell crude oil for USD gives it more power than any other currency. And the big US military budget keeps anyone threatening that system in line so it's been pretty stable despite\n\nWhere do you get these room temperature IQ analysis from? Is the CIA in on it too? \n\nThe threat of military action (whatever that means) has absolutely nothing to do with the petrodollar nor eurodollar. The US economy is massive, a rational actor prefers to hold foreign currency in large rather than small markets. Its the most easily convertible currency (compare to CNY/CNH). The petrodollar simplifies trading instead of having to convert to/from several currencies. For example, almost all (90%+) FX trades go through the dollar. \n\nStop pretending like you understand economics from reading reddit crypto posts.",
                                  "timestamp": "2021-12-08 03:47:30",
                                  "score": 2,
                                  "num_children": 3,
                                  "author": 343810,
                                  "replies": [
                                    {
                                      "id": "hnotrlr",
                                      "text": "He’s right though. And yes the CIA is in on it. You think they did shit all around the world 50 years ago and just jerk off now?",
                                      "timestamp": "2021-12-08 06:22:34",
                                      "score": 8,
                                      "num_children": 0,
                                      "author": 173677,
                                      "replies": []
                                    },
                                    {
                                      "id": "hnomdnk",
                                      "text": "You don’t think it’s any more abstract than that? I honestly think your explanation is better than what I was going to say, but there has to be some tangible influence from the American military on the dollar valuation when they will be the only ones capable of protecting the hugely unpopular 1% that maintain the status quo that allows the military to operate in the manner that it does. It seems to me that those are the people that move that system along for the most part, the general pop isn’t insignificant but nowhere near as invested as the upper echelon.",
                                      "timestamp": "2021-12-08 04:58:40",
                                      "score": 4,
                                      "num_children": 0,
                                      "author": 391898,
                                      "replies": []
                                    },
                                    {
                                      "id": "hnplbyr",
                                      "text": "The millitary action stops countries from challenging the US millitarily. That means the US isn't invaded nor it's government toppled and that since US actions like sanctions won't be challenged militarily (by means of blockades or invasions) they are more likely to come to fruition. It also raises the benefits of being an US ally by extending some of said perks to your country, thus raising the value of the currency.            \nNo, it's not the only reason the dollar has so much value, but it contributes to it to some degree.",
                                      "timestamp": "2021-12-08 12:36:40",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 46563,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hnnj0kn",
                      "text": "But unlike the US dollar, crypto is accepted almost no where for (legal) goods or services.",
                      "timestamp": "2021-12-07 23:23:22",
                      "score": 81,
                      "num_children": 6,
                      "author": 87874,
                      "replies": [
                        {
                          "id": "hnovzv3",
                          "text": "Which makes it hard to use. What if someone wanted to cash out $200 mil bitcoins? You think coin-base as the liquid asset to pay that out?",
                          "timestamp": "2021-12-08 06:51:26",
                          "score": 4,
                          "num_children": 0,
                          "replies": []
                        },
                        {
                          "id": "hnnrqax",
                          "text": "Just a few of the companies that accept crypto as payment include Microsoft, AT&T, Burger King, Overstock, Miami Dolphins, Dallas Mavericks, Virgin Galactic, Norwegian Air, NewEgg, ExpressVPN, and AMC.",
                          "timestamp": "2021-12-08 00:31:51",
                          "score": 52,
                          "num_children": 4,
                          "author": 374671,
                          "replies": [
                            {
                              "id": "hnogpnp",
                              "text": "You generalize the situation, some of them accept certain coins like Bitcoin, not a ton of crypto options, while most of them don't actually hold the Bitcoin, it's immediately liquidated into USD by the payment processor, so the company never actually accepts crypto, their middleman payment processor does.",
                              "timestamp": "2021-12-08 04:03:19",
                              "score": 20,
                              "num_children": 1,
                              "author": 214527,
                              "replies": [
                                {
                                  "id": "hnovqip",
                                  "text": "True, but a looottt of companies out there invest USD back into crypto, just at strategic times that make sense.\n\nThe market volatility of crypto makes this necessary because someone could buy something worth 3k usd one day, and a few months later the same amount of crypto they sent could be worth 2.5, or 3.5k usd. Making it risky for both parties. If the market ever stabilizes this won't be necessary.",
                                  "timestamp": "2021-12-08 06:48:04",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 381859,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hnnsw9q",
                              "text": "Or you could use cash/card and not have costs change by 10% every other day lol",
                              "timestamp": "2021-12-08 00:41:07",
                              "score": 51,
                              "num_children": 1,
                              "author": 62243,
                              "replies": [
                                {
                                  "id": "hno5uz9",
                                  "text": "Every other day? Look at mister stable coin over here, I only buy shit coins so my costs change every 5 hours",
                                  "timestamp": "2021-12-08 02:28:55",
                                  "score": 34,
                                  "num_children": 0,
                                  "author": 386914,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hnnsv7b",
                              "text": "Ah yes, I’d love to pay a $20 tx fee for my $8 burger.",
                              "timestamp": "2021-12-08 00:40:53",
                              "score": 90,
                              "num_children": 3,
                              "author": 396065,
                              "replies": [
                                {
                                  "id": "hnorbb1",
                                  "text": "So you have already used Door dash/Ubereats",
                                  "timestamp": "2021-12-08 05:52:32",
                                  "score": 30,
                                  "num_children": 1,
                                  "author": 204213,
                                  "replies": [
                                    {
                                      "id": "hnphzpm",
                                      "text": "I *was* going to get Uber to bring me a burger and fries from five guys, it came out to $32",
                                      "timestamp": "2021-12-08 12:00:03",
                                      "score": 6,
                                      "num_children": 0,
                                      "author": 194054,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "hnohhhy",
                                  "text": "I mean institutions haven't invested billions in bitcoin with the hope to spend it one day lol.",
                                  "timestamp": "2021-12-08 04:10:31",
                                  "score": 4,
                                  "num_children": 0,
                                  "author": 42128,
                                  "replies": []
                                },
                                {
                                  "id": "hnozufp",
                                  "text": "Not a thing with most crypto, and not a thing with Bitcoin either on the lightning network.",
                                  "timestamp": "2021-12-08 07:43:12",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 228808,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hnp6qzy",
                              "text": "Just tried ordering something over at microsoft.com, and they didn't seem to support bitcoin payment at all, nor do I recall ever being able to pay in bitcoin at any burger king restaurant anywhere...",
                              "timestamp": "2021-12-08 09:23:55",
                              "score": 4,
                              "num_children": 1,
                              "author": 188992,
                              "replies": [
                                {
                                  "id": "hntja37",
                                  "text": "Microsoft allows you to use bitcoin to top up your MS account. You can then use the money on the account to make purchases. BK is on a store by store basis but it's more popular in Germany and Venezuela.",
                                  "timestamp": "2021-12-09 05:43:27",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 374671,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hnnkkqq",
                          "text": "But you can always convert it to other currencies, like dollars.",
                          "timestamp": "2021-12-07 23:35:31",
                          "score": 14,
                          "num_children": 2,
                          "author": 410537,
                          "replies": [
                            {
                              "id": "hnnurgv",
                              "text": "..by selling it. To a bigger fool.",
                              "timestamp": "2021-12-08 00:56:12",
                              "score": 31,
                              "num_children": 0,
                              "author": 125454,
                              "replies": []
                            },
                            {
                              "id": "hnnoz8q",
                              "text": "Yes. Greater fool theory. You never want to keep the garbage, you want to convert it back into dollars.",
                              "timestamp": "2021-12-08 00:09:52",
                              "score": 71,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "hnovzti",
                                  "text": "Most involved into crypto are in it long term. They may liquidate some here and there, but investors hold huge amounts of different coins in belief the projects technology will continue to innovate.",
                                  "timestamp": "2021-12-08 06:51:25",
                                  "score": 0,
                                  "num_children": 1,
                                  "author": 381859,
                                  "replies": [
                                    {
                                      "id": "hnp6xiq",
                                      "text": "Sure, but with the exceptions of a few ideological cases, almost everyone see crypto as an investment and not a day to day currency. They're involved in the long term the same way anyone else are involved in apple stocks.",
                                      "timestamp": "2021-12-08 09:26:41",
                                      "score": 3,
                                      "num_children": 1,
                                      "author": 188992,
                                      "replies": [
                                        {
                                          "id": "hns8by8",
                                          "text": "Thats my point when the above commenter mentioned not wanting to 'keep' the crypto.",
                                          "timestamp": "2021-12-08 23:30:51",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 381859,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "hnpngbd",
                                  "text": "Lets go back to 2010, you can receive 100 dollars worth of... dollars or bitcoin, which do you pick?",
                                  "timestamp": "2021-12-08 12:57:49",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 410537,
                                  "replies": [
                                    {
                                      "id": "hnpqcvs",
                                      "text": "Yes, I'd buy a dog turd if I was confident I could flip it to a chump.",
                                      "timestamp": "2021-12-08 13:24:58",
                                      "score": 3,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hnpwo6f",
                                          "text": "Congrats, that is how the market works.  \n\n\nEverything outside of clean water and food is a scam because you don't really need it.",
                                          "timestamp": "2021-12-08 14:18:11",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 410537,
                                          "replies": [
                                            {
                                              "id": "hnqf2so",
                                              "text": ">Everything outside of clean water and food is a scam because you don't really need it\n\nLmao this is the unironic disjointed train of thought that crypto cultists use to convince themselves that they're not morons for buying internet meme money",
                                              "timestamp": "2021-12-08 16:28:06",
                                              "score": 3,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "hnr71no",
                                                  "text": "I don't own crypto",
                                                  "timestamp": "2021-12-08 19:26:36",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "author": 410537,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hnozzyr",
                          "text": "Neither is gold or stocks\n\nCrypto is speculative like tesla. The speculation can pay off or elon could overdose on weed and die of thc poisoning",
                          "timestamp": "2021-12-08 07:45:20",
                          "score": 2,
                          "num_children": 0,
                          "author": 169156,
                          "replies": []
                        },
                        {
                          "id": "hnov9gx",
                          "text": "Actually you can use crypto for a variety of retail goods. Starbucks even has a way to use crypto. Xidax computers. AT&T even accepts it.\n\nThe problem is you can spend $100 bitcoin one day and it might have turned into $135 worth of bitcoin a few months later. Or it could be a period where bitcoin value is lower and doesn't have as much selling power so you're having to use more btc than you would have 2 weeks ago. The market is very volatile and the price of bitcoin fluctuates constantly, making it not the best currency to use right now.\n\nThere are other coins that don't have such volatility that are worth exactly a dollar each, but not a ton of them are accepted yet and why not just use the dollar at that point",
                          "timestamp": "2021-12-08 06:41:54",
                          "score": 1,
                          "num_children": 0,
                          "author": 381859,
                          "replies": []
                        },
                        {
                          "id": "hnnzz2m",
                          "text": "In Lenexa KS the Ford dealership accepts Biaxin. If you can buy a car with it then that's significant.",
                          "timestamp": "2021-12-08 01:39:50",
                          "score": -1,
                          "num_children": 0,
                          "author": 244631,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hnnoaw0",
                      "text": "Exactly! You feed them bullshit lines just like that then dumb chumps go \"okay, yeah! I don't know anything about monetary policy or cryptocurrency but that sounds like it could be true. I'll buy some of your internet meme money!!\"",
                      "timestamp": "2021-12-08 00:04:31",
                      "score": 8,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hno7u9m",
                          "text": "There is a set amount of Bitcoin there isn’t a set amount of dollars. If people have faith in the currency which btw is the only thing keeping the US dollar alive then btc would eventually increase in price as well as other crypto. While that’s not guaranteed for the dollar since the fed can always print more it’s a hedge against inflation. Crypto is also a medium of exchange as a lot of companies expect payments from it so it is just like any other currency. Also assets can be worth more than their intrinsic value such as vintage bills are worth way more than their face value that doesn’t make that item a part of the greater fool theory.",
                          "timestamp": "2021-12-08 02:45:37",
                          "score": 4,
                          "num_children": 1,
                          "author": 338702,
                          "replies": [
                            {
                              "id": "hnoqkhi",
                              "text": ">There is a set amount of Bitcoin there isn’t a set amount of dollars\n\n\"There is a set amount of PT Cruisers in the market and they are still mass producing new corvettes.\" Clearly this is an r-slurred argument and clearly even though corvettes are still being produced they are superior vand more valuable than PT cruisers. \n\nSee since you know literally nothing about monetary policy and theory youre the chump who bit on the suckers bait. \"Hey it makes sense that a limited supply means it's gotta be more better!\" If it's an investment asset yes, limited supply is a shield of value. If it's a currency then having a finite supply is horrible for an economy because deflation strangles economic growth. Which is it an investment asset or a currency? Because it can't do both things well.\n\n>Also assets can be worth more than their intrinsic value such as vintage bills are worth way more than their face value that doesn’t make that item a part of the greater fool theory.\n\nGoogle what the phrase intrinsic value means because you're confusing it with face value. Of course though, I'm not even mildly surprised that the crypto advocate doesn't know basic financial terms.",
                              "timestamp": "2021-12-08 05:43:53",
                              "score": 8,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hnoxmw6",
                                  "text": "Yes, bitcoin is widely regarded with competent people as a better store of wealth than it is as direct currency. A long time from now, there will be no more new bitcoin minted. The system does have an inherent way to circulate bitcoin back into the market though, transaction fees are given to those verifying the transactions (mining).That's one cryptocurrency of hundreds. Of those, there is plenty of bullshit, scams, meme, or 'shitcoins'. \n\nThat being said though there are some in there actually looking to innovate the blockchain tech and reach an area where we're capable of implementing them into constant real world scenarios. \n\nNFT's in the form of digital art is one of the first use cases to hit the main stream, and is being moved into gaming a bit as well now, but thats just one facet and they're still scratching the surface of what could technically be possible. The technical side isn't there yet  though, developers still have a long way to go.\n\nFrom a technology standpoint though, I'm all for what certain projects are doing and the potential real world applications they can bring.",
                                  "timestamp": "2021-12-08 07:13:12",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 381859,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hno8ssq",
                      "text": "The high inflation was mostly driven by supply shortages.  That's why it was really uneven inflation in prices, with some goods increasing in price substantially and others not increasing at all.  It doesn't matter if you use gold, crypto, fiat, or barter, when there's a shortage people will pay more for that good.",
                      "timestamp": "2021-12-08 02:53:49",
                      "score": -1,
                      "num_children": 0,
                      "author": 79950,
                      "replies": []
                    },
                    {
                      "id": "hnob6rf",
                      "text": "It has value in that the government only accepts USD for payment of taxes",
                      "timestamp": "2021-12-08 03:14:16",
                      "score": 0,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "hnp23su",
                      "text": "I think the us dollar has value from oil being sold in dollars",
                      "timestamp": "2021-12-08 08:15:19",
                      "score": 0,
                      "num_children": 0,
                      "author": 373447,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hno53o9",
                  "text": "I’d say crypto has at least the advantage of being untraceable (certain only because most of the big ones already glow) and is divisible. NFTs can have a certain worth to them in that there is a greater fool but crypto can be efficiently used as a bypass of hard currency exchanges.\n\nStill degenerate to believe pixels have value tho",
                  "timestamp": "2021-12-08 02:22:30",
                  "score": 6,
                  "num_children": 0,
                  "author": 241488,
                  "replies": []
                },
                {
                  "id": "hno5aqd",
                  "text": "Cryptocurrency is incredibly useful. It’s really the only way of transferring value anonymously over the internet. The illegal drug trade is estimated to be around $400B annually. Add to that every other illicit sales activity and money laundering, it’s clear there is a huge market for being able to anonymously transfer money over the internet.",
                  "timestamp": "2021-12-08 02:24:09",
                  "score": 7,
                  "num_children": 0,
                  "author": 260882,
                  "replies": []
                },
                {
                  "id": "hnoh9og",
                  "text": "Regardless of the total market cap, which is probably inflated but not for reasons you're touching upon, you are aware there are cryptos with utility right? Where their value isn't based on dumping bags on a fool.",
                  "timestamp": "2021-12-08 04:08:28",
                  "score": 3,
                  "num_children": 1,
                  "author": 42128,
                  "replies": [
                    {
                      "id": "hnopa0c",
                      "text": "If you had a hot juicy dog turd you could squeeze water out of it, you could put in your neighbors doorstep and light it on fire, you can head to your local library and put in in the air ducts next to the furnace, or you could just toss it at a small child. \n\nDog turds have loads of utility, but it would be a little silly to create an equities market to trade piles of turds and it would be even sillier if that market had a collective \"value\" equal to the GDP of the UK.",
                      "timestamp": "2021-12-08 05:29:40",
                      "score": 5,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hnos01i",
                          "text": "Now what's your opinion of the stock market?",
                          "timestamp": "2021-12-08 06:00:49",
                          "score": 1,
                          "num_children": 1,
                          "author": 42128,
                          "replies": [
                            {
                              "id": "hnpqr7s",
                              "text": "It's a casino that has functional utility in that firms can raise capital by selling partial ownership of it.\n\nOwning a fraction of a company that actually produces a good/service > owning internet meme money.",
                              "timestamp": "2021-12-08 13:28:31",
                              "score": 2,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hnq3y84",
                                  "text": "It's not much of a casino if there's no chance and the makers control the whole market. Especially when it's inherently fraudulent and rigged against retail invested, Over 50% of trades aren't lit and go to dark pools, on top of glaring problems like naked short selling.\n\nWhy would I trade in a market where the rich can do illegal things to take my money but if I did anything similar id be in jail.",
                                  "timestamp": "2021-12-08 15:12:26",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 42128,
                                  "replies": [
                                    {
                                      "id": "hnqeaxp",
                                      "text": "There's no chance for stupid retail investors. Its easy to make money if you're not a fucking moron wildly clicking around in your 2 day old Robinhood account because you spent 4 minutes reading a wikipedia article on options trading and now you fancy yourself the wolf of wallstreet. The problem is uninformed people drastically overestimate their knowledge and abilities and get  ​themselves in way over their heads. They have the experience and ability to buy and hold index funds so when they enter the complex short term arena they get rekt. \n\nLet me guess- you got suckered into believing the GameStop memes and got your lunch eaten?",
                                      "timestamp": "2021-12-08 16:22:57",
                                      "score": 1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hnqethv",
                                          "text": "No but I have made 6 figures from crypto.\n\nWouldn't even make 10% of that if I invested in stocks.",
                                          "timestamp": "2021-12-08 16:26:23",
                                          "score": 0,
                                          "num_children": 1,
                                          "author": 42128,
                                          "replies": [
                                            {
                                              "id": "hnrtol7",
                                              "text": "[removed]",
                                              "timestamp": "2021-12-08 21:50:16",
                                              "score": 1,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "hnrtonk",
                                                  "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```retard```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
                                                  "timestamp": "2021-12-08 21:50:17",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "author": 184140,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hnos6jh",
                  "text": "Crypto has some nonzero inherent value as a transaction medium.  As long as people want to be able to buy and sell things online without credit cards or whatever, there is some inherent demand for some sort of crypto.  Paypal doesn't actually have any \"value\", it doesn't produce any physical goods, but they make tons of money by providing a service for users and skimming some off the top.  Theoretically, crypto provides a similar service and the miners skim some off the top.  It's almost certainly worth much much less than it's currently valued at, but when it crashes it won't all crash to zero, it will crash down to its actual inherent value.  (Some or maybe even most coins will crash to zero, but the most popular ones will stabilize at a reasonable level as people continue to use them for the service they provide, not as an investment mechanism).\n\nNFTs actually have zero value and will eventually crash to zero.",
                  "timestamp": "2021-12-08 06:03:01",
                  "score": 2,
                  "num_children": 0,
                  "author": 22781,
                  "replies": []
                },
                {
                  "id": "hnnd7sb",
                  "text": "Aka a pyramid scheme",
                  "timestamp": "2021-12-07 22:39:10",
                  "score": -1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hnnihk6",
                      "text": "[deleted]",
                      "timestamp": "2021-12-07 23:19:17",
                      "score": 3,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hnnk8at",
                          "text": "A Ponzi scheme is where one person cashes out and the rest can't get their money back. \n\nA pyramid scheme is where people a duped into buying something, normally to sell, in a hierarchical fashion. With bonuses for briniging more people in. \n\nCrypto isn't really either of those things. \n\nIt's just gambling on whether numbers go up or not.",
                          "timestamp": "2021-12-07 23:32:49",
                          "score": 16,
                          "num_children": 1,
                          "author": 322161,
                          "replies": [
                            {
                              "id": "hnnuwjy",
                              "text": "i feel like it's more similar to the dutch tulip mania of the 17th century\n\nhttps://en.wikipedia.org/wiki/Tulip_mania",
                              "timestamp": "2021-12-08 00:57:24",
                              "score": -1,
                              "num_children": 0,
                              "author": 257855,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hnolc1c",
                  "text": "sounds like what the start of money must of been like, because you know.. it's worthless as well unless agreed that it has value.\n\nPerson 1: I have banana, give me sugar\n\nPerson 2: Here have this coin thingy\n\nPerson 1: what's this shiny?\n\nPerson 2: Money it's worth it trust me.\n\nPerson 1: Okay but can I eats?\n\n2: No just use to trade for sugar it has value\n\n1: Okay lets trade\n\nAll value of anything on this planet is agreed or disagreed upon and talked about through any civilization.",
                  "timestamp": "2021-12-08 04:47:52",
                  "score": 1,
                  "num_children": 0,
                  "author": 42540,
                  "replies": []
                },
                {
                  "id": "hnnncas",
                  "text": "Also known as the theory of US of A",
                  "timestamp": "2021-12-07 23:56:59",
                  "score": 1,
                  "num_children": 0,
                  "author": 362630,
                  "replies": []
                },
                {
                  "id": "hnovxrp",
                  "text": "Its really ironic how every major part of wallstreet is not involved with crypto… i thought the point was to have a decentralized system? Ponzi schemes rock",
                  "timestamp": "2021-12-08 06:50:41",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "hnnn3rn",
              "text": "> The NFT market is full of people who missed the cryptocurrency train hoping this is the next big thing, and then smarter people who know it's worthless but are just in it for extreme short term gains.\n\nAnd to be clear, both tend to lose a lot of money. The people with the critical thinking to realize that it's a scam, but dumb enough to \"pretend\" to fall for it in the hopes of playing the system, still get burned more often than not.",
              "timestamp": "2021-12-07 23:55:07",
              "score": 4,
              "num_children": 0,
              "author": 213044,
              "replies": []
            },
            {
              "id": "hnnoy7x",
              "text": "Yup, I’m here riding the train knowing full well that 90% of people will be bag holders in 5 years. I’m keeping my flurk though. It’s a matter of principal at this point.",
              "timestamp": "2021-12-08 00:09:38",
              "score": 10,
              "num_children": 1,
              "replies": [
                {
                  "id": "hno196x",
                  "text": "> It's a matter of principal at this point\n\nYup. I could cut my losses now and bring home a few bucks, or I could consider it all dead money and hodl with a slim chance in the future these pick up some kind of steam.",
                  "timestamp": "2021-12-08 01:50:30",
                  "score": 5,
                  "num_children": 1,
                  "author": 179914,
                  "replies": [
                    {
                      "id": "hno1eh9",
                      "text": "I meant because flurks were banned off of open sea because stonetoss bad",
                      "timestamp": "2021-12-08 01:51:40",
                      "score": 3,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hnndkt9",
              "text": "> and then smarter people who know it's worthless but are just in it for extreme short term gains\n\nTo be fair this true - about crypto, Tesla, etc. Just depends on how much of a market you can pump up.",
              "timestamp": "2021-12-07 22:41:57",
              "score": 9,
              "num_children": 0,
              "author": 230400,
              "replies": []
            },
            {
              "id": "hnndyag",
              "text": "NFTs are the future of selling drugs not even joking. If someone can automate smart contracts that’s it, your local drug dealer is now legally an “nft artist” selling images for the price of dime bags.",
              "timestamp": "2021-12-07 22:44:49",
              "score": 21,
              "num_children": 7,
              "author": 6184,
              "replies": [
                {
                  "id": "hnnhgfk",
                  "text": "NFT was always going to be used for money laundering which is exactly why the government will crack down harder on it than regular crypto or not at all depending on how many wealthy people use it.",
                  "timestamp": "2021-12-07 23:11:12",
                  "score": 16,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "hnnmuua",
                      "text": "That's kinda like banning twigs but allowing trees. It's almost never worth the effort to maintain that, unless it's their substitution for drug war money haha",
                      "timestamp": "2021-12-07 23:53:08",
                      "score": 4,
                      "num_children": 0,
                      "author": 174185,
                      "replies": []
                    },
                    {
                      "id": "hnoifm7",
                      "text": "It's only easy due to non existent kyc. Just like every reputable exchange servicing NA was forced to do, because those that didn't got sued/shut down big time.\n\nI hardly fathom any scenario where they crack down harder on a subset of crypto, Vs crypto as a whole.  Open sea is literally looking to IPO. You bet your ass they will easily comply to gov't regulations for kyc/aml. \n\nIt's literally only a matter of time. Government doesn't work quickly. Once sec comes knocking they're not going to fight it. Because one they wouldn't have a case in first place, and two someone with actual defense (xrp) ongoing court case has gone on for a long time. Which they would not want  what so ever.",
                      "timestamp": "2021-12-08 04:19:33",
                      "score": 2,
                      "num_children": 0,
                      "author": 42128,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hnnnevu",
                  "text": "Hey lawyers of Reddit, is \"confuse the shit out of the judge\" a valid legal tactic?",
                  "timestamp": "2021-12-07 23:57:33",
                  "score": 6,
                  "num_children": 1,
                  "author": 176666,
                  "replies": [
                    {
                      "id": "hnpfp9r",
                      "text": "Oh so that's how Kyle got off",
                      "timestamp": "2021-12-08 11:31:56",
                      "score": 0,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hnohvks",
                  "text": "That's literally the dumbest drug dealer in the world.. If just one person gets caught or leaks, guess what, they now can see exactly literally, every sale you made, verifiable and infallible.\n\nYou should probably let the crime be left to real criminals.\n\nI don't know many nft platform's running on monero. A lot of darknet markets do tho, I wonder why.",
                  "timestamp": "2021-12-08 04:14:14",
                  "score": 3,
                  "num_children": 1,
                  "author": 42128,
                  "replies": [
                    {
                      "id": "hnpfd7o",
                      "text": ">  they now can see exactly literally, every sale you made, verifiable and infallible.     \n   \n\n\nNot how the law works lmfao",
                      "timestamp": "2021-12-08 11:27:35",
                      "score": 0,
                      "num_children": 1,
                      "author": 6184,
                      "replies": [
                        {
                          "id": "hnq40d5",
                          "text": "What law are you talking about? We're talking about blockchain.\n\nAnd yeah the law works in usa that if they suspect any nefarious use of funds they steal all related funds and assets.\n\nWhich wouldn't work well for a drug dealer with his funds easily tracked.",
                          "timestamp": "2021-12-08 15:12:52",
                          "score": 2,
                          "num_children": 1,
                          "author": 42128,
                          "replies": [
                            {
                              "id": "hnq5cfo",
                              "text": "> If just one person gets caught or leaks, guess what, they now can see exactly literally, every sale you made, verifiable and infallible.    \n   \nNot evidence that they used NFTs as a means of selling drugs. Maybe the US is different, but unless you can prove each and every one in Ireland, you’re not gonna get charged for any more than the single transaction caught. Even the CAB won’t take that money off you. Besides, the money will be in crypto anyways, you have that shit on a wallet and put it somewhere the cops can’t find it, you can take the money when you’re back out.   \n    \nRich people literally use art to money launder all the time btw. Now they don’t need to set up an entire auction since the auction house is an online community.",
                              "timestamp": "2021-12-08 15:22:19",
                              "score": 1,
                              "num_children": 1,
                              "author": 6184,
                              "replies": [
                                {
                                  "id": "hnq612z",
                                  "text": "Laundering money by the rich, which is more tax evasion than laundering. (unless you find the instances of corrupt auctions helping launder money), is a lot different than someone using nfts to sell drugs.\n\nAnd yeah Ireland is definitely not the same as NA. Especially America. They don't need to prove anything of the sort really, just charge you with possession and intent to distribute, I mean that's hoping they don't find a huge stash of drugs when thsy raise your house, then you're really screwed. And civil forfeiture means they can take whatever they want, even if no crime was actually committed! \n\nAnd as I said the only evidence of using nfts for drug trade they need is one person exposing why they bought this nft lol.\n\nBut yeah even across the world lots of criminals have had their crypto confiscated. I think it was Sweden that ended up owing criminals money due to the increase value of btc due to it rising.",
                                  "timestamp": "2021-12-08 15:27:10",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 42128,
                                  "replies": [
                                    {
                                      "id": "hnq7exf",
                                      "text": "> They don't need to prove anything of the sort really, just charge you with possession and intent to distribute\n   \nDamn that sounds shit. Land of the free I guess. But tbf you get caught with a huge amount of drugs anywhere and you’re fucked.   \n   \n> And civil forfeiture means they can take whatever they want, even if no crime was actually committed!   \n   \nWe have this, the CAB, but only if you have things that you clearly couldn’t buy within your pay grade, like someone in unemployment owning a lambo. If you bought yourself a preowned shitbox you won’t get it taken away.  \n   \n> But yeah even across the world lots of criminals have had their crypto confiscated.  \n  \nIf those idiots are dumb enough to keep their crypto wallet in the same house they keep drugs in and get it confiscated in a raid, they don’t deserve the crypto anyways lmao",
                                      "timestamp": "2021-12-08 15:36:43",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 6184,
                                      "replies": [
                                        {
                                          "id": "hnq8fk9",
                                          "text": "Yeah to the latter point I really don't know the details.\n\nI think some gave it up, because they were caught and wouldn't be able to move the money. And would affect their sentence.\n\nPolice not being able to access it doesn't matter if they have it tracked and are throwing the book at you cause you cause won't give it up.",
                                          "timestamp": "2021-12-08 15:43:39",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 42128,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hnnfssi",
                  "text": "Any society that's still trying to have a war on drugs by that point has bigger issues than an illegal drug trade.",
                  "timestamp": "2021-12-07 22:58:39",
                  "score": 22,
                  "num_children": 1,
                  "author": 135582,
                  "replies": [
                    {
                      "id": "hnnmcxw",
                      "text": "Idk i think people will always want illegal shit",
                      "timestamp": "2021-12-07 23:49:19",
                      "score": 6,
                      "num_children": 1,
                      "author": 52384,
                      "replies": [
                        {
                          "id": "hnnp5co",
                          "text": "The point that went over your head is that a war on drugs is absolutely idiotic and any government that conducts one is either incompetent or malicious. See: the US war on drugs as a pretext to continue to oppress the poor.",
                          "timestamp": "2021-12-08 00:11:14",
                          "score": 3,
                          "num_children": 3,
                          "author": 135582,
                          "replies": [
                            {
                              "id": "hnnt02m",
                              "text": "Backwards Boris (English PM) recently announced a shite plan for an enhanced war on drugs. No doubts lining some crony’s pockets\n\n>\tUsers of class A drugs in the UK would face losing their passports or driving licences under proposals reportedly set to be unveiled this week.\nBoris Johnson will this week launch a 10-year plan to tackle drug-related crime, which will include travel bans, harsher sentences for drug dealers and measures to break up county lines gangs.\n\n[article](https://amp.theguardian.com/politics/2021/dec/05/users-of-class-a-drugs-in-uk-face-losing-passport-say-reports-of-proposals)",
                              "timestamp": "2021-12-08 00:41:58",
                              "score": 4,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hnnuypc",
                                  "text": "God forbid the standard of living in a country be improved, lest the poor see some of that benefit.",
                                  "timestamp": "2021-12-08 00:57:53",
                                  "score": 5,
                                  "num_children": 2,
                                  "author": 135582,
                                  "replies": [
                                    {
                                      "id": "hnnvi6j",
                                      "text": "[deleted]",
                                      "timestamp": "2021-12-08 01:02:24",
                                      "score": 1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hnnwapc",
                                          "text": "I was making a sarcastic (probably not)strawman of their motivations for doing so.",
                                          "timestamp": "2021-12-08 01:08:57",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 135582,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "hnpmqe6",
                                      "text": "Literally what Boris thinks",
                                      "timestamp": "2021-12-08 12:50:47",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 56950,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hnoxy5m",
                              "text": "Wasn't talking about a war on drugs, i was saying we'll always have illegal substances so drug dealers won't go away, even if you legalised weed world wide people would still want meth and crack, even if you legalised those people would still want something else",
                              "timestamp": "2021-12-08 07:17:33",
                              "score": 1,
                              "num_children": 1,
                              "author": 52384,
                              "replies": [
                                {
                                  "id": "hnpkoiw",
                                  "text": "Fuckin idiot.",
                                  "timestamp": "2021-12-08 12:29:50",
                                  "score": -2,
                                  "num_children": 1,
                                  "author": 135582,
                                  "replies": [
                                    {
                                      "id": "hnpn655",
                                      "text": "you are the one who brought up the war on drugs, the first guy said dealers would use them to sell shit and i said that even if drugs get legalized there's always going to be a black market",
                                      "timestamp": "2021-12-08 12:55:05",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 52384,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hno1rda",
                              "text": "Based.",
                              "timestamp": "2021-12-08 01:54:38",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hnnqjb6",
                  "text": "Then why aren't drug dealers now just normal artists selling doodles on post-its as art?",
                  "timestamp": "2021-12-08 00:22:17",
                  "score": 2,
                  "num_children": 1,
                  "author": 160431,
                  "replies": [
                    {
                      "id": "hnnvuoq",
                      "text": "Because there isn't a blockchain obsessed with securely authorizing your cash transaction.\n\nRest assured, when cash is dead and we all pay for everything with our digital chit cards you will see everyone buying $20 pieces of art from \"local artisans.\"",
                      "timestamp": "2021-12-08 01:05:18",
                      "score": 3,
                      "num_children": 2,
                      "author": 331062,
                      "replies": [
                        {
                          "id": "hno0x0v",
                          "text": "So you're telling me that law enforcement will not only be able to track all transactions and will use that to start going after small time schmucks selling dime bags but that said schmuck will be able to successfully counter this by becoming an \"NFT artist\"? \n\nI have serious reservations that this vision of the future will come about but even if it does I have even more serious doubts that it will happen in any sort of time frame where NFTs, as we have them now, are still a thing that's used and I just flat out do not believe that small time drug dealers will be able to use this method to evade law enforcement if they start using those kinds of methods to catch them.",
                          "timestamp": "2021-12-08 01:47:42",
                          "score": 4,
                          "num_children": 0,
                          "author": 160431,
                          "replies": []
                        },
                        {
                          "id": "hnoioti",
                          "text": "There's literally crypto forensic teams that have traced crypto through tumblers.\n\nThere's a reason only xmr is used by darknet.\n\nNo one worth their salt is going to want be having a publicly viewable record book of every sale they made. And last time I checked there's no nft markets running on xmr.",
                          "timestamp": "2021-12-08 04:21:55",
                          "score": 3,
                          "num_children": 0,
                          "author": 42128,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hno3wqb",
                  "text": "Crypto is already sufficient for those purposes.",
                  "timestamp": "2021-12-08 02:12:32",
                  "score": 2,
                  "num_children": 1,
                  "author": 100007,
                  "replies": [
                    {
                      "id": "hnpffm7",
                      "text": "Yeah true and it’s still used. I think NFTs will just be an easier way to do it.",
                      "timestamp": "2021-12-08 11:28:27",
                      "score": 1,
                      "num_children": 0,
                      "author": 6184,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hqksyd2",
                  "text": "[deleted]",
                  "timestamp": "2021-12-30 18:36:18",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hqkt9ey",
                      "text": "Either American or haven’t bought drugs in years. Nobody cares about “tracing back” it’s 2021, dealers advertise on Snapchat now, they don’t chill on corners hoping the guy the sell to isn’t a cop.",
                      "timestamp": "2021-12-30 18:38:16",
                      "score": 1,
                      "num_children": 0,
                      "author": 6184,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hno4rt6",
              "text": "Dont tell twitch streamers lmao",
              "timestamp": "2021-12-08 02:19:47",
              "score": 1,
              "num_children": 0,
              "author": 241488,
              "replies": []
            }
          ]
        },
        {
          "id": "hnnac4e",
          "text": "I keep trying to google what an NFT is an I'm too dumb to understand. \n\nIs it basically like a digital deed or title for something you bought and own online?",
          "timestamp": "2021-12-07 22:17:38",
          "score": 51,
          "num_children": 9,
          "author": 262015,
          "replies": [
            {
              "id": "hnnb62n",
              "text": "Essentially yes. And the deed is built into the thing you bought itself. It has a code in it. Just like each crypto transaction has a unique transaction key.",
              "timestamp": "2021-12-07 22:23:40",
              "score": 42,
              "num_children": 1,
              "replies": [
                {
                  "id": "hnoz2io",
                  "text": "[deleted]",
                  "timestamp": "2021-12-08 07:32:38",
                  "score": 18,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hnpm3n1",
                      "text": "75",
                      "timestamp": "2021-12-08 12:44:29",
                      "score": 1,
                      "num_children": 0,
                      "author": 137078,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hnne6x0",
              "text": "It's like you have a deed to the town slut, but everybody else also has access too, but these don't have the deed itself just free access to the town slut. \n\nSo the deed is worthless.",
              "timestamp": "2021-12-07 22:46:35",
              "score": 41,
              "num_children": 3,
              "author": 361450,
              "replies": [
                {
                  "id": "hnnhaes",
                  "text": "Perfect, thank you",
                  "timestamp": "2021-12-07 23:09:54",
                  "score": 10,
                  "num_children": 0,
                  "author": 262015,
                  "replies": []
                },
                {
                  "id": "hnnn78a",
                  "text": "So like /dating/ the town slut",
                  "timestamp": "2021-12-07 23:55:52",
                  "score": 5,
                  "num_children": 0,
                  "author": 377895,
                  "replies": []
                },
                {
                  "id": "hnoyxeg",
                  "text": "Ah, you're referring to your wife?",
                  "timestamp": "2021-12-08 07:30:41",
                  "score": 2,
                  "num_children": 1,
                  "author": 186282,
                  "replies": [
                    {
                      "id": "hnpaesy",
                      "text": "I think he's referring to Joe actually",
                      "timestamp": "2021-12-08 10:19:01",
                      "score": 3,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hnnhsio",
              "text": "its an encrypted cryptographic digital item that may appear in the form of art like a picture, video, or videogame. Only you know the key to the cryptogram, stored in your digital wallet. In some forms of crypto you can give a piece of your crypto so that they can verify your ownership without taking the key itself.\n\n&#x200B;\n\nFor example, let's pretend I'm an anon on 4chan. I can provide you this key to verify I'm the owner of this comment, my own NFT - a782ac5e-9c43-4f47-a309-1e1efdf0c98a",
              "timestamp": "2021-12-07 23:13:50",
              "score": 7,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hnnc0wk",
              "text": "It's a scam similar to those companies that will sell you a star. You're paying money to pretend you own something that most other people also have equal access to.",
              "timestamp": "2021-12-07 22:30:00",
              "score": 89,
              "num_children": 2,
              "replies": [
                {
                  "id": "hnod7z2",
                  "text": "The receipt is definitely yours tho",
                  "timestamp": "2021-12-08 03:31:55",
                  "score": 9,
                  "num_children": 0,
                  "author": 379738,
                  "replies": []
                },
                {
                  "id": "hnnyt81",
                  "text": "this is the best analogy i've heard to describe nfts, well done",
                  "timestamp": "2021-12-08 01:30:05",
                  "score": 28,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hno16wc",
                      "text": "Like movies!",
                      "timestamp": "2021-12-08 01:49:59",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hnndjig",
              "text": "it's proof that you paid for receipt of a digital asset located on an arbitrary blockchain of your choice\n\nbasically you give me a hundred dollars, and i record that you paid for a picture of my shit on a multiplayer excel spreadsheet. then you can sell this proof that you paid for a picture of my shit to another person, and it gets recorded on the same multiplayer excel sheet (nothing happens with the original picture of my shit during any of the exchanges)",
              "timestamp": "2021-12-07 22:41:41",
              "score": 18,
              "num_children": 2,
              "author": 358896,
              "replies": [
                {
                  "id": "hnnlzak",
                  "text": "I can think of one tiny area it might be useful Twitter.\n\nIf you use image and own it, even if they right click save, you still have data pricing it is yours and anyone using it can be suspended for pretending to be you.\n\n\nBut who really would be so Karen as to go to customer service to complain about that. They'd tell you speak to the manager or something",
                  "timestamp": "2021-12-07 23:46:24",
                  "score": 4,
                  "num_children": 1,
                  "author": 15826,
                  "replies": [
                    {
                      "id": "hnnt4xh",
                      "text": "Sure, platforms could integrate this. But why is this a world that we desire. What value did we bring to peoples lives by adding NFT support to twitter?",
                      "timestamp": "2021-12-08 00:43:01",
                      "score": 10,
                      "num_children": 1,
                      "author": 396065,
                      "replies": [
                        {
                          "id": "hnojkps",
                          "text": "Is social media really adding value to people's lives ? I mean recent data says exact opposite. So I feel like that's a moot point. \n\nI mean the whole og nfts are now in the phase of \"providing value\", and the perks are actually kind of cool and wide ranging but you know you also have to own a 5-6 figure collectable to be part of these clubs.\n\nSo basically the nft version of a 1%r country club, where you can all swing your dicks around and get exclusive acess events /shit because your part of it.\n\nIs it revolutionary or groundbreaking, I guess who you ask but, I just feel like it's just another part of society going into the digital age.\n\n\nPeople always say crpgto will die, or x will die, and I mean 90% will (we've seen it several times over). But its been over a decade for btc, so I don't think it's going to just die. Especially with institutions using it due to real world economic principles.\n\nIt's not hard to assume the same for nfts, which any reputable /knowledgeable person in the same has been saying/would say.  Can you make a lot of money off the other 90% that'll die, yes, but in the end they cease to exist so..",
                          "timestamp": "2021-12-08 04:30:29",
                          "score": 3,
                          "num_children": 0,
                          "author": 42128,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hnnnvg8",
                  "text": "You forgot the big sell. \n\nIf you created the proof, you get to make money off its consecutive sales.",
                  "timestamp": "2021-12-08 00:01:11",
                  "score": 1,
                  "num_children": 0,
                  "author": 174185,
                  "replies": []
                }
              ]
            },
            {
              "id": "hnnbmbn",
              "text": "Right click save as",
              "timestamp": "2021-12-07 22:27:00",
              "score": 14,
              "num_children": 0,
              "author": 323635,
              "replies": []
            },
            {
              "id": "hnnba83",
              "text": "yeah, not sure what part of this whole ordeal is \"the NFT\" but basically you *buy* some shitty awful (usually jpeg) for money and there is a site which shows ownership I think?\n\nand that's it... and you can boast about owning a jpeg which has a certain value that you bought it for and I think the goal is to resell it for more?",
              "timestamp": "2021-12-07 22:24:31",
              "score": 23,
              "num_children": 3,
              "author": 50782,
              "replies": [
                {
                  "id": "hnnnmhh",
                  "text": "It's supposed to be attached to useful things, like \"if you own this NFT, you own this house, according to the NFT's contract.  All I have to do to sell you the house is give you this tiny little code.\"\n\nBut it started getting attached to completely useless things like unique garbage JPG art, and then started getting treated like a currency for some insane reason.\n\nIt's like collecting \"for sale\" signs off of people's front lawns and thinking they're currency.",
                  "timestamp": "2021-12-07 23:59:13",
                  "score": 8,
                  "num_children": 0,
                  "author": 176666,
                  "replies": []
                },
                {
                  "id": "hnnhmk6",
                  "text": "You can also buy a fraction of a lambo",
                  "timestamp": "2021-12-07 23:12:33",
                  "score": 5,
                  "num_children": 0,
                  "author": 63823,
                  "replies": []
                },
                {
                  "id": "hnndely",
                  "text": "It's no more complex than that",
                  "timestamp": "2021-12-07 22:40:38",
                  "score": 14,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hnnklrp",
                      "text": "so what is the point of it?  what can it be used for? \n\nis it only to sell for more money?",
                      "timestamp": "2021-12-07 23:35:43",
                      "score": 6,
                      "num_children": 4,
                      "author": 211405,
                      "replies": [
                        {
                          "id": "hnnm8wj",
                          "text": "They are mostly used for fleecing rubes",
                          "timestamp": "2021-12-07 23:48:27",
                          "score": 15,
                          "num_children": 0,
                          "replies": []
                        },
                        {
                          "id": "hnnn1gj",
                          "text": "Proof of ownership and therefore scarcity. \n\nScarcity and money applies to rocks, art, and now GPUs etc. Art can be digitized easily and therefore it was always the first thing tokens would be applied to. You can extrapolate ownership and scarcity in the digital space to many other things over time.\n\nI forgot, the original artist gets to build a smart contract and therefore receive royalties much easier than the current system.",
                          "timestamp": "2021-12-07 23:54:36",
                          "score": 9,
                          "num_children": 0,
                          "author": 174185,
                          "replies": []
                        },
                        {
                          "id": "hno213y",
                          "text": "A more realistic use case: concert tickets or season passes to something. \n\nCompletely digital, non fungible, non-counterfit-able.\n\nMaybe it's a \"lifetime of free tacobell NFT\" which entitles the owner to a free taco everyday forever. The owner could sell that token and the buyer wouldn't be (as much) at risk of getting a fake.",
                          "timestamp": "2021-12-08 01:56:53",
                          "score": 6,
                          "num_children": 1,
                          "author": 329585,
                          "replies": [
                            {
                              "id": "hp1aago",
                              "text": "This is probably the ONLY real life application of NFT's that aren't a scam.",
                              "timestamp": "2021-12-18 10:43:45",
                              "score": 1,
                              "num_children": 1,
                              "author": 274426,
                              "replies": [
                                {
                                  "id": "hp1bffw",
                                  "text": "Eh it makes sense for things like social security or passport too I think. But just the tech not like...\"investing\".",
                                  "timestamp": "2021-12-18 10:59:55",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 329585,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hnnn6dm",
                          "text": "Well, in theory you could use it as a currency I guess?\n\nJust as stocks were ment to financially support a starting bussiness (so they don't need to get bank approved loan) and get a \"potential future\" share of the profit, NFTs were maybe ment to support an artis you like?\n\nAnyway, people don't really use stocks in that way. Instead they use them to manipulate / make virtual money without creating anything (while fucking over somebody). Same goes for crypto and NFTs. Another way how to lose money or stay equal for majority of the people, and how to make a big buck for some.",
                          "timestamp": "2021-12-07 23:55:41",
                          "score": 1,
                          "num_children": 1,
                          "author": 53802,
                          "replies": [
                            {
                              "id": "hnoju47",
                              "text": "You're not wrong, and I actually agree with you. But I'd rather choose the market where everyone can get rich and fucked too, Vs the one that's literally known fraudulent and exists only to make rich richer.\n\nRich have it good either way, in one I have a lot better chance.",
                              "timestamp": "2021-12-08 04:32:59",
                              "score": 1,
                              "num_children": 1,
                              "author": 42128,
                              "replies": [
                                {
                                  "id": "hnpf2y3",
                                  "text": "Oh don't get me wrong, I don't mind it. It is just that it doesn't produce anything and is just virtual waste of resources. But anything that can fuck over the elite rich assholes is welcome.\n\nStill better than the stock market, in which they fuck over real companies with real employees who don't even know what a stock is.",
                                  "timestamp": "2021-12-08 11:23:48",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 53802,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hnng0th",
              "text": "its a r-----tarded digital deed / bearer bond . thats it.",
              "timestamp": "2021-12-07 23:00:18",
              "score": 2,
              "num_children": 0,
              "author": 53716,
              "replies": []
            },
            {
              "id": "hnp8jol",
              "text": "Yes, but since there's no legal backing it's worthless. The idea is useful to record contracts and digital rights publicly, but I wouldn't touch that shit with a 10 foot pole right now.",
              "timestamp": "2021-12-08 09:51:03",
              "score": 1,
              "num_children": 0,
              "author": 225919,
              "replies": []
            }
          ]
        },
        {
          "id": "hnnd46t",
          "text": "careful you might trigger some /biz/tards with 40 dollars invested who are explaining the next paradigm of finance to you",
          "timestamp": "2021-12-07 22:38:22",
          "score": 17,
          "num_children": 0,
          "author": 358896,
          "replies": []
        },
        {
          "id": "hnnyt34",
          "text": "Just call $10,000 loot crates NFT's. People will buy them. 🤷‍♂️",
          "timestamp": "2021-12-08 01:30:04",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "hnok62x",
              "text": "Shit I have to make some calls.",
              "timestamp": "2021-12-08 04:36:11",
              "score": 1,
              "num_children": 0,
              "author": 42128,
              "replies": []
            }
          ]
        },
        {
          "id": "hnopanr",
          "text": "It sounds more like a in game skin that costs $1,000",
          "timestamp": "2021-12-08 05:29:51",
          "score": 3,
          "num_children": 0,
          "author": 184686,
          "replies": []
        },
        {
          "id": "hnpb3o6",
          "text": "Prob something like a fortnite skin",
          "timestamp": "2021-12-08 10:29:04",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hnnh7mm",
          "text": "I wish they would sell copies of games as NFT's. Then I could sell or give them away after I'm done playing them.",
          "timestamp": "2021-12-07 23:09:19",
          "score": 5,
          "num_children": 1,
          "replies": [
            {
              "id": "hnpc99q",
              "text": "Sony and Microsoft be like, “No, no you don’t!”",
              "timestamp": "2021-12-08 10:45:39",
              "score": 1,
              "num_children": 0,
              "author": 378247,
              "replies": []
            }
          ]
        },
        {
          "id": "hnnhefo",
          "text": "What makes an NFT valuable in the case of video games is the resale value attached to digital items.\n\nIf you want to know what happens when a game revolves entirely about NFTs, just take a look at Artifact. The cards in there could be resold, which resulted in easy to obtain cards being practically worthless while meta cards became unsustainably expensive.\nAll this fed into the decline of it, as nobody wanted to shell out a few hundred dollars to make a proper deck.",
          "timestamp": "2021-12-07 23:10:46",
          "score": 3,
          "num_children": 3,
          "author": 210394,
          "replies": [
            {
              "id": "hnok4cm",
              "text": "It's funny you mentioned an actual game. Not a p2e nft game. Which I play but by the very nature have one purpose, make you money before they crash lol. There is no gameplay for 99% other than clicking a few times, and the assets being trade able as nfts, which serve same purpose as auction houses and other stuff in actual games.\n\nThe reason why you're example failed, is the reason these games exist /what they're based off of. But they can actually return value, not just be a net cost to play.",
              "timestamp": "2021-12-08 04:35:43",
              "score": 2,
              "num_children": 0,
              "author": 42128,
              "replies": []
            },
            {
              "id": "hnphey9",
              "text": "And how long do Ubisoft typically support their games?\n\nWhat happens to the NFT when the game dies?",
              "timestamp": "2021-12-08 11:53:08",
              "score": 1,
              "num_children": 0,
              "author": 265763,
              "replies": []
            },
            {
              "id": "hnrgeir",
              "text": ">nobody wanted to shell out a few hundred dollars to make a proper deck.\n\nMagic the gathering has the same issue, but its the most popular tcg on the planet",
              "timestamp": "2021-12-08 20:25:53",
              "score": 1,
              "num_children": 0,
              "author": 116265,
              "replies": []
            }
          ]
        },
        {
          "id": "hnna646",
          "text": "Actually NFTs make a lot of sense in the point of view of the art market. Like art the whole thing is a scam that is supported by the richest in the world with the goal of reducing taxes and laundering money.\n\nAs long as some people agree the value will stay up and it will be a better way to hold assets than buying a house, like a 100 millions painting...",
          "timestamp": "2021-12-07 22:16:24",
          "score": -3,
          "num_children": 0,
          "author": 343640,
          "replies": []
        },
        {
          "id": "hno4eom",
          "text": "Unexpected Aizen.",
          "timestamp": "2021-12-08 02:16:41",
          "score": 1,
          "num_children": 0,
          "author": 43220,
          "replies": []
        },
        {
          "id": "hno9rg8",
          "text": "$10000 exclusive skins or some shit lol idk",
          "timestamp": "2021-12-08 03:02:05",
          "score": 1,
          "num_children": 0,
          "author": 145139,
          "replies": []
        },
        {
          "id": "hnq0zl2",
          "text": "Funnily enough there was one time when I was like 8 I played MapleStory and some guy said he'd give me tons of cash if I gave him some money. I gave him some and he came back like 5-10 minutes later and he gave me back like 50x as much\n\nGuessing he was a hacker or something but hey I got the dough",
          "timestamp": "2021-12-08 14:51:00",
          "score": 1,
          "num_children": 0,
          "author": 204445,
          "replies": []
        },
        {
          "id": "hnogxc3",
          "text": "Yeah I mean I can't blame your skepticism, because it's pretty accurate. The only real \"use\" I got out of nfts is p2e games (play to earn).  I mean it's nft gaming but not what you call gaming, there's game assets but the game consists of a few clicks a day.  Why did I play, each day I could make 80-150$ with what I had. That's literally the only reason everyone else bought in and played too lol. (oh just for full disclosure, these games rise and crash quicker and more often that meme coins lol.) \n\nCollectibles nfts are  pretty dumb. People following the hype.  I mean if actual games release digital collectables that way it'd be kinda cool, but that's totally different than current nft collectables/why ppl buy them (hype /chasing $$).\n\n\nThe only real gaming nft ecosystem out there is like decentraland and sandbox game, I know more about the latter but it's basically roblox in the meta verse with nfts as assets. They just provide the ecosystem (big Minecraft like world) and people buy land to have their own game, game creators can buy from the nft marketplace for assets to use (so even asset creators make $) then game creators can monetize their game as they see fit.",
          "timestamp": "2021-12-08 04:05:18",
          "score": 0,
          "num_children": 0,
          "author": 42128,
          "replies": []
        }
      ]
    },
    {
      "id": "hnnbu2v",
      "text": "Basically everybody pointed out how there would be no other way to easily identify scammers anymore. SoyTube did it to protect CBS and NBC but ended upo fucking everyone else in the ass",
      "timestamp": "2021-12-07 22:28:36",
      "score": 469,
      "num_children": 2,
      "replies": [
        {
          "id": "hnp5xgo",
          "text": ">  no other way to easily identify scammers anymore.\n\n>CBS and NBC \n\nThey are the scammers.",
          "timestamp": "2021-12-08 09:11:43",
          "score": 51,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hnne8ch",
          "text": "[removed]",
          "timestamp": "2021-12-07 22:46:52",
          "score": 87,
          "num_children": 2,
          "replies": [
            {
              "id": "hnnfs6m",
              "text": "When the dislike button doubles as itself when you replace the “l” in “dislike”",
              "timestamp": "2021-12-07 22:58:31",
              "score": 24,
              "num_children": 0,
              "author": 319060,
              "replies": []
            },
            {
              "id": "hnnl674",
              "text": "That’s what I call YouTube due to how many Adam Sandler clips I watch.",
              "timestamp": "2021-12-07 23:40:08",
              "score": 4,
              "num_children": 0,
              "author": 49136,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hnnt5xp",
      "text": "“Ubisoft goes steamworks bye bye always on drm”",
      "timestamp": "2021-12-08 00:43:14",
      "score": 22,
      "num_children": 2,
      "replies": [
        {
          "id": "hnobfjz",
          "text": "Nice",
          "timestamp": "2021-12-08 03:16:21",
          "score": 2,
          "num_children": 0,
          "author": 77836,
          "replies": []
        },
        {
          "id": "hnoha9b",
          "text": "Wonder how many get this?",
          "timestamp": "2021-12-08 04:08:37",
          "score": 0,
          "num_children": 0,
          "author": 332484,
          "replies": []
        }
      ]
    },
    {
      "id": "hnnchy2",
      "text": "many predicted this shit\n\nStep 1 crypto and nfts are soooo bad for the environment\n\nStep 2 make\"eco friendly\" nfts and crypto\n\nRemember when banks tried to sell crypto but it failed because the whole appeal was decentralised currency?\n\nI see so many youtubers crying about how terrible for the environment cryptos are then they peddle their shitty merch made in god knows what sweatshop, like the textile industry isn't one of the worst for the environment\n\nWhole problem would be solved if we got more clean energy like nuclear but instead of going for that people waste their time and fight eachother on small things",
      "timestamp": "2021-12-07 22:33:37",
      "score": 327,
      "num_children": 5,
      "author": 52384,
      "replies": [
        {
          "id": "hnndfld",
          "text": "I still think crypto done by banks in house is the future whether consumers like it or not.  It's too good of a deal for the government to not coerce it into happening.",
          "timestamp": "2021-12-07 22:40:51",
          "score": 48,
          "num_children": 1,
          "replies": [
            {
              "id": "hnnv4uo",
              "text": "Why do they need crypto when they control credit lines? If anything, crypto transactions are much more traceable than the bullshit they’re pulling now.",
              "timestamp": "2021-12-08 00:59:21",
              "score": 31,
              "num_children": 1,
              "replies": [
                {
                  "id": "hnoa5df",
                  "text": "You just answered your own question.",
                  "timestamp": "2021-12-08 03:05:23",
                  "score": 15,
                  "num_children": 1,
                  "author": 376865,
                  "replies": [
                    {
                      "id": "hnob6t2",
                      "text": "I think you misunderstood. Banks don’t want more easily traceable transactions. That would be creating more transparency. Banks love shady dealings with credit. If banks used cryptocurrencies literally all the receipts for their involvement in the 2008 financial crash would have been laid bare easily for anyone to look through. As long as they can keep everything on their books they can keep control of the financial system and claim that they didn’t intentionally run the economy into the ground should anything happen.",
                      "timestamp": "2021-12-08 03:14:16",
                      "score": 18,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hnood6v",
                          "text": "No, but governments absolutely love more traceable transactions, remember who bails them out. Mutually beneficial in that lens arguably.",
                          "timestamp": "2021-12-08 05:19:46",
                          "score": 6,
                          "num_children": 0,
                          "author": 376865,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hnp9zex",
          "text": "> Whole problem would be solved if we got more clean energy like nuclear but instead of going for that people waste their time and fight eachother on small things\n\nThe environmentalist lobby largely rejecting nuclear is intentional.",
          "timestamp": "2021-12-08 10:12:36",
          "score": 3,
          "num_children": 1,
          "author": 194832,
          "replies": [
            {
              "id": "hnpa4ju",
              "text": "I get that some of it is people being afraid of it after previous meltdowns and the issue of waste, but come on",
              "timestamp": "2021-12-08 10:14:45",
              "score": 2,
              "num_children": 1,
              "author": 52384,
              "replies": [
                {
                  "id": "hnpaa57",
                  "text": "Exactly. Most of it is watermelons wanting clean air and the like to be problems entirely unsolvable without just about universal societal planning.",
                  "timestamp": "2021-12-08 10:17:06",
                  "score": 2,
                  "num_children": 0,
                  "author": 194832,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hnneb7r",
          "text": "Please ELI5 digital NFTs being bad for the environment?",
          "timestamp": "2021-12-07 22:47:28",
          "score": 7,
          "num_children": 4,
          "author": 199011,
          "replies": [
            {
              "id": "hnnekxf",
              "text": "I think its electricity cost of running servers",
              "timestamp": "2021-12-07 22:49:30",
              "score": 41,
              "num_children": 1,
              "author": 99306,
              "replies": [
                {
                  "id": "hnqihja",
                  "text": "I run my serves on solar.",
                  "timestamp": "2021-12-08 16:50:10",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hnrucmn",
                      "text": "And you could feed that power to the grid to reduce coal consumption. The world is bigger than your moms garage, little buddy",
                      "timestamp": "2021-12-08 21:54:36",
                      "score": 2,
                      "num_children": 0,
                      "author": 400230,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hnnihu9",
              "text": "Basically you waste power by doing useless calculations to mine stuff into the blockchain. Then you burn the image/link into that",
              "timestamp": "2021-12-07 23:19:21",
              "score": 32,
              "num_children": 2,
              "author": 212050,
              "replies": [
                {
                  "id": "hnot7im",
                  "text": "Pretty sure tezos is proof of stake aka not surrending power in mining",
                  "timestamp": "2021-12-08 06:15:36",
                  "score": 4,
                  "num_children": 0,
                  "author": 238615,
                  "replies": []
                },
                {
                  "id": "hnpkgxr",
                  "text": "It's not useless calculations. It are calculations to secure the blockchain. It's using elektricity and calculation to establish decentralised trust.",
                  "timestamp": "2021-12-08 12:27:34",
                  "score": -1,
                  "num_children": 1,
                  "author": 313609,
                  "replies": [
                    {
                      "id": "hnpmomd",
                      "text": "Like this guy said. Useless calculations",
                      "timestamp": "2021-12-08 12:50:19",
                      "score": 5,
                      "num_children": 0,
                      "author": 212050,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hnnes4g",
              "text": "Basically running the computers that suport it takes a lot of power",
              "timestamp": "2021-12-07 22:50:58",
              "score": 27,
              "num_children": 0,
              "author": 52384,
              "replies": []
            },
            {
              "id": "hnnokea",
              "text": "Reddit using energy: stunning, brave, heroic\n\nEthereum using energy: environment destroying, alt-right, white supremacist\n\nTl;dr.. crypto is... Le bad",
              "timestamp": "2021-12-08 00:06:34",
              "score": 12,
              "num_children": 1,
              "author": 76338,
              "replies": [
                {
                  "id": "hnnrrce",
                  "text": "Crypto uses more power than Amazon, Google, Microsoft and Apple combined",
                  "timestamp": "2021-12-08 00:32:04",
                  "score": 18,
                  "num_children": 2,
                  "author": 371167,
                  "replies": [
                    {
                      "id": "hnntxyo",
                      "text": "While delivering next to no value.",
                      "timestamp": "2021-12-08 00:49:31",
                      "score": 14,
                      "num_children": 0,
                      "author": 396065,
                      "replies": []
                    },
                    {
                      "id": "hnnsogq",
                      "text": " [YouTube](https://www.linkedin.com/pulse/despacito-streaming-energy-consumption-rabih-bashroush) uses the same order of magnitude of power, but one is cool because it lets you see your name written on a streamer's ass and the other one evil because you saw a Vice article that called it wasteful and useless.",
                      "timestamp": "2021-12-08 00:39:21",
                      "score": 6,
                      "num_children": 1,
                      "author": 76338,
                      "replies": [
                        {
                          "id": "hnpp7vb",
                          "text": "yes",
                          "timestamp": "2021-12-08 13:14:31",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hnno18o",
          "text": "> Remember when banks tried to sell crypto but it failed because the whole appeal was decentralised currency?\n\nWhat idiot fell for that \"decentralised currency\" crap?  As soon as the crypto currency becomes relevant enough to actually matter, the big banks/world governments/elite illuminatis you're all worried about will just BUY THAT CURRENCY.  And then they have exactly as much control as they did with the other currency you were using before.  \n\nHence why all your bitcoin is useless now, because China is buying/mining it all, they can wake up one day and decide they want to tank its value.",
          "timestamp": "2021-12-08 00:02:26",
          "score": 8,
          "num_children": 3,
          "author": 176666,
          "replies": [
            {
              "id": "hnp7y3r",
              "text": ">will just BUY THAT CURRENCY\n\nLETSSSSSS FUCKINGGGGG GOOOOOOOO\n\nYou do realize if thay genuinely happened that would be the end game of all of us, set for life.",
              "timestamp": "2021-12-08 09:42:05",
              "score": 3,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hnpdd8b",
              "text": "China banned crypto mining , they used to have a ton of miners , they're also cracking down on bitcoin transactions too, it's a shame but it's not surprising \n\nbut that's just for individuals obviously",
              "timestamp": "2021-12-08 11:01:05",
              "score": 2,
              "num_children": 0,
              "author": 52384,
              "replies": []
            },
            {
              "id": "hnnoziu",
              "text": ">will just BUY THAT CURRENCY\n\nMore money for me loser",
              "timestamp": "2021-12-08 00:09:56",
              "score": 6,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hnowu2g",
          "text": "I'll be mining as long as it outweighs my power costs, even beyond that, just to make these smoothbrains seethe.",
          "timestamp": "2021-12-08 07:02:29",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hnne50f",
      "text": "I thought the environmental damage was not from the existence of these jpegs, but  it is from the \"mining\" of the cryptocurrency with which they are purchased.",
      "timestamp": "2021-12-07 22:46:11",
      "score": 117,
      "num_children": 3,
      "author": 248231,
      "replies": [
        {
          "id": "hnnek9i",
          "text": "You are smarter than their target market",
          "timestamp": "2021-12-07 22:49:22",
          "score": 81,
          "num_children": 1,
          "author": 159502,
          "replies": [
            {
              "id": "hnneo7w",
              "text": "I guess that doesn't take much knowing Ubisofts target market.",
              "timestamp": "2021-12-07 22:50:09",
              "score": 24,
              "num_children": 1,
              "author": 248231,
              "replies": [
                {
                  "id": "hnrjwtl",
                  "text": "it really doesn't they've been releasing the same games since 2008",
                  "timestamp": "2021-12-08 20:47:48",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hnoztuc",
          "text": "Only that no mining is done here, so very little energy consumption because of proof of stake.",
          "timestamp": "2021-12-08 07:42:58",
          "score": 2,
          "num_children": 0,
          "author": 337601,
          "replies": []
        },
        {
          "id": "hnnvdxd",
          "text": "Yes, but reddit just has a hate boner for NFTs and next to no understanding of the underlying technology.",
          "timestamp": "2021-12-08 01:01:24",
          "score": -7,
          "num_children": 1,
          "replies": [
            {
              "id": "hnnvzvt",
              "text": "Haha ugly monke go brrrrrrrr",
              "timestamp": "2021-12-08 01:06:30",
              "score": 6,
              "num_children": 0,
              "author": 52552,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hnnfbu0",
      "text": "Be me.\n\nWant to get rich.\n\nPay for digital receipt claiming I own something \n\nHave no actual authority or ability to stop people from using that thing that I have a receipt for. Can’t even license the content I have a receipt for, that ability still belongs to the artist.\n\nTry to sell the useless receipt for a markup in a few years for max profit \n\ncleverish.png imma be rich to the moon",
      "timestamp": "2021-12-07 22:55:04",
      "score": 108,
      "num_children": 1,
      "author": 31814,
      "replies": [
        {
          "id": "hnohkuc",
          "text": "But wait till smart contracts bro 🥴",
          "timestamp": "2021-12-08 04:11:24",
          "score": 12,
          "num_children": 0,
          "author": 336111,
          "replies": []
        }
      ]
    },
    {
      "id": "hnoanwq",
      "text": "I'm convinced that Ubisoft are building crypto mining into all their games now, so while you're playing, you're mining and making profits for them.",
      "timestamp": "2021-12-08 03:09:49",
      "score": 14,
      "num_children": 1,
      "author": 114618,
      "replies": [
        {
          "id": "hnpltap",
          "text": "Thats literally a kind of virus",
          "timestamp": "2021-12-08 12:41:34",
          "score": 2,
          "num_children": 0,
          "author": 65039,
          "replies": []
        }
      ]
    },
    {
      "id": "hnnz27x",
      "text": "YouTube is a lost cause at this point. Everyone needs to find a competitive alternative and switch over for good. Sally I don't see this ever happening as most people give zero fucks about what removing the dislike button means for the future of the website",
      "timestamp": "2021-12-08 01:32:10",
      "score": 35,
      "num_children": 2,
      "replies": [
        {
          "id": "hnoaavy",
          "text": "People do care, the problem is that you need NASA levels of infrastructure to make an alternative youtube. And since if you try to create one they will frame you as neo nazi and refuse to provide you credit (like most banks did), online payment (like Visa and Mastercard did), their servers (like Amazon did), allow you to have apps (like Samsung and Apple did), advertise yourself (like Tw, Insta, Tiktok and Facebook did), or even list you on the internet (like Google did), is next to impossible.\n\nBig tech is a cartel and they will protect each other from competition as we saw with Parler, Gab, Bitchute, etc.",
          "timestamp": "2021-12-08 03:06:41",
          "score": 58,
          "num_children": 1,
          "author": 350991,
          "replies": [
            {
              "id": "hnpmzvq",
              "text": ">People do care, the problem is that you need NASA levels of infrastructure to make an alternative youtube. And since if you try to create one they will frame you as neo nazi and refuse to provide you credit (like most banks did)\n\n10/10.\n\n&#x200B;\n\nGlad I am not the only one that has noticed this pattern unfold time and time again. Every fucking time a strong alt-tech platform strats rising, Big Tech (google, reddit, twitter, FB) illegally collude together to paint the competition as a hive of white supremacists and nazi's, than have the product taken off the market or blocked from linking to said websites\n\n&#x200B;\n\nParler was blamed for 1/6, despite the fact most of the planning was done on Facebook.....\n\n&#x200B;\n\nAs long as they keep associating our bests interests with \"muh nazi's\", they can play the average redditor like a fiddle",
              "timestamp": "2021-12-08 12:53:23",
              "score": 16,
              "num_children": 1,
              "replies": [
                {
                  "id": "hnruy2g",
                  "text": "Planning? You mean the facebook event telling people to go there?",
                  "timestamp": "2021-12-08 21:58:28",
                  "score": 2,
                  "num_children": 0,
                  "author": 400230,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hnpjheq",
          "text": "[deleted]",
          "timestamp": "2021-12-08 12:16:59",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "hnpolu7",
              "text": "I don't believe that at all. Every large website similar to YouTube has failed eventually. YouTube won't be king forever, especially if they keep on their current trajectory. Damn near every single YouTube user hates the removal of the dislikes. You can't keep making decisions that piss off your user base for very long",
              "timestamp": "2021-12-08 13:08:45",
              "score": 4,
              "num_children": 3,
              "replies": [
                {
                  "id": "hnppkh9",
                  "text": "[deleted]",
                  "timestamp": "2021-12-08 13:17:48",
                  "score": 3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hnqm2h6",
                      "text": "Only time will tell. Nothing on the internet will last forever, ESPECIALLY when websites are actively working to change their websites in a way that enrages its users.",
                      "timestamp": "2021-12-08 17:13:01",
                      "score": 2,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hnpx325",
                  "text": "at this point only if the entire MEDIUM changes (VR? AR?)",
                  "timestamp": "2021-12-08 14:21:25",
                  "score": 2,
                  "num_children": 0,
                  "author": 207240,
                  "replies": []
                },
                {
                  "id": "ho2zumg",
                  "text": "That's because you don't have a defeatist attitude. The more people that actively exercise their dollar votes the bigger the pressure on companies to do better. These \"everybody else will still do it\" arguments are self fulfilling.",
                  "timestamp": "2021-12-11 04:40:32",
                  "score": 1,
                  "num_children": 0,
                  "author": 192928,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hnpc3d0",
      "text": "Literally just csgo skinsLiterally just csgo skins",
      "timestamp": "2021-12-08 10:43:19",
      "score": 9,
      "num_children": 2,
      "replies": [
        {
          "id": "hnrhod5",
          "text": "Video game skins may actually be the only place NFTs make sense. I'd rather get a dope AK skin than a jpg of a cartoon monkey smoking a bong",
          "timestamp": "2021-12-08 20:33:58",
          "score": 3,
          "num_children": 0,
          "author": 116265,
          "replies": []
        },
        {
          "id": "hnpm3pu",
          "text": "It’s hiliarious, people are pontificating in this thread that this is the worst thing ever. Taken at face value, if you watched the damn video, it’s cs go skins with numbers on them. They are going to give them away. You can trade or sell them by the nature that they are NFTs.\n\nBut no, go ahead thread, keep yelling about NFTs and how Bitcoin is garbage.\n\nCan someone explain to me how the csgo skin model is the worst thing ever invented?",
          "timestamp": "2021-12-08 12:44:30",
          "score": 4,
          "num_children": 0,
          "author": 241215,
          "replies": []
        }
      ]
    },
    {
      "id": "hnnlyzk",
      "text": "#PSA\n\nThere's a chrome extension to get those dislikes back\n\nAlso, Jewbisoft",
      "timestamp": "2021-12-07 23:46:20",
      "score": 58,
      "num_children": 2,
      "author": 350407,
      "replies": [
        {
          "id": "hnns4e5",
          "text": "Name?",
          "timestamp": "2021-12-08 00:34:55",
          "score": 12,
          "num_children": 1,
          "author": 274443,
          "replies": [
            {
              "id": "hnntin3",
              "text": "Return YouTube Dislike",
              "timestamp": "2021-12-08 00:46:03",
              "score": 23,
              "num_children": 1,
              "author": 35606,
              "replies": [
                {
                  "id": "hno9gu3",
                  "text": "Thanks",
                  "timestamp": "2021-12-08 02:59:35",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hnpg2mc",
          "text": "not for long\n\nsomeone should make external dislike counter and make addon\n\nthis youtube will not be able to fight",
          "timestamp": "2021-12-08 11:36:38",
          "score": 8,
          "num_children": 2,
          "replies": [
            {
              "id": "hnq04g9",
              "text": "some thing should happen for reddit comments tbh. J-slurs shouldn't be able to determine what is wrongthink what what isn't",
              "timestamp": "2021-12-08 14:44:41",
              "score": 5,
              "num_children": 0,
              "author": 359783,
              "replies": []
            },
            {
              "id": "hnpo485",
              "text": "I recall the dev is working on crowd-sourced third-party dislike counter. Probably similar to how SponsorBlock works.",
              "timestamp": "2021-12-08 13:04:09",
              "score": 2,
              "num_children": 0,
              "author": 394841,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hnobbpm",
      "text": "They're slowly rolling out their plan to kill pirating forever.",
      "timestamp": "2021-12-08 03:15:25",
      "score": 7,
      "num_children": 0,
      "author": 61844,
      "replies": []
    },
    {
      "id": "hno6u83",
      "text": "Just so everyone knows there is a chrome and Firefox extension where you can legitimately see the dislike counter. Search for it in the arson store for your browser you can’t miss it.",
      "timestamp": "2021-12-08 02:37:06",
      "score": 4,
      "num_children": 1,
      "author": 82047,
      "replies": [
        {
          "id": "hnpbokf",
          "text": "For now while the API still works. It won't last long.",
          "timestamp": "2021-12-08 10:37:28",
          "score": 2,
          "num_children": 0,
          "author": 243219,
          "replies": []
        }
      ]
    },
    {
      "id": "hnouo2g",
      "text": "Wait a minute\n\nIs there actually a correlation between people not being afraid of backlash that allows shit like this? Or just anything bad in general?",
      "timestamp": "2021-12-08 06:34:12",
      "score": 3,
      "num_children": 0,
      "author": 331225,
      "replies": []
    },
    {
      "id": "hnnvzqs",
      "text": "Eh, I bought a bunch of Tezos this summer and they’re the blockchain being used for this lol Ubisoft ghey but come on let’s make daddy some money! \n\nAlso buying NFT’s themselves is dumb IMO when you could just buy what is effectively stock in successful NFT marketplaces and then cash out profits every time a particularly popular line of NFT’s gets released there. Might be a dumb fad but you’d best believe I’m gonna profit off it, and with a hell of a lot less risk than spending 5 or 6 figures on a single fucking monkey and betting on people still caring about it in 6 months.",
      "timestamp": "2021-12-08 01:06:28",
      "score": 8,
      "num_children": 1,
      "author": 350660,
      "replies": [
        {
          "id": "hnohs9z",
          "text": "Teach me",
          "timestamp": "2021-12-08 04:13:23",
          "score": 3,
          "num_children": 0,
          "author": 336111,
          "replies": []
        }
      ]
    },
    {
      "id": "hnpxd4w",
      "text": "Lmfao they think they're unique with this, TF2, CSGO, and DOTA2 as well as any game that trades on the SCM have been doing this",
      "timestamp": "2021-12-08 14:23:36",
      "score": 2,
      "num_children": 0,
      "author": 373873,
      "replies": []
    },
    {
      "id": "hnq32kz",
      "text": "guys how do I make an nft and sell it for 100 dollas? I wanna get rich off of stupid rich people",
      "timestamp": "2021-12-08 15:06:06",
      "score": 2,
      "num_children": 0,
      "author": 287266,
      "replies": []
    },
    {
      "id": "hnssj1i",
      "text": "Yeah cause companies like Ubisoft, EA and Activision definitely weren't doing shady shit or trying to sell worthless crap *before*.",
      "timestamp": "2021-12-09 02:01:14",
      "score": 2,
      "num_children": 0,
      "author": 294163,
      "replies": []
    },
    {
      "id": "hnnej1y",
      "text": "Tezos lmao",
      "timestamp": "2021-12-07 22:49:08",
      "score": 4,
      "num_children": 1,
      "author": 99949,
      "replies": [
        {
          "id": "hnnps3l",
          "text": "up 33%. Thanks for the free money Ubisoft.",
          "timestamp": "2021-12-08 00:16:20",
          "score": 5,
          "num_children": 0,
          "author": 39525,
          "replies": []
        }
      ]
    },
    {
      "id": "hnochaz",
      "text": "Oy vey! The goyim knows, shut it down, shut it down!",
      "timestamp": "2021-12-08 03:25:26",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hnp87r4",
      "text": "Our best bet at this point is to report them en masse. It works with Facebook iirc",
      "timestamp": "2021-12-08 09:46:09",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hnnsdxs",
      "text": "Man, fuck crypto",
      "timestamp": "2021-12-08 00:36:58",
      "score": 1,
      "num_children": 0,
      "author": 52606,
      "replies": []
    },
    {
      "id": "hnmpphx",
      "text": "giga-based. As an NFT owner myself, nothing brings me more joy than poorfrags seething at my collection. Perhaps spend more time in school learning about block-chain and encryption and less playing video games. haha\n\nEdit: Imagine thinking that copy-pasting an image is the same as owning it. As you can clearly see from the bc (block chain for you non-tech people) , I am the rightful owner of the artwork. Any and all duplications are thus a cheap replica.\n\n\nEdit2: The fact that people think \"copy pasting\" is somehow harming NFTs is hilarious. Is the Mona Lisa devalued when someone takes a picture of it? Educate yourselves.\n\n\nEdit3: Yikes, yall can't behave. Requesting the moderators to lock this comment section. Also please refrain from spamming my inbox with monkey nfts and pictures of Nikocado's stretched asshole.",
      "timestamp": "2021-12-07 19:52:55",
      "score": -62,
      "num_children": 11,
      "author": 59068,
      "replies": [
        {
          "id": "hnmruej",
          "text": "But i have to jerk off multiple times a day, i can‘t keep track of crypto",
          "timestamp": "2021-12-07 20:08:58",
          "score": 56,
          "num_children": 1,
          "author": 190070,
          "replies": [
            {
              "id": "hnmscks",
              "text": "Yeah, how are we supposed to invest when our money needs to go to onlyfans thots?",
              "timestamp": "2021-12-07 20:12:29",
              "score": 24,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hnmy990",
          "text": "*right clicks*\n\nNothing personal kid.",
          "timestamp": "2021-12-07 20:53:53",
          "score": 53,
          "num_children": 1,
          "author": 162812,
          "replies": [
            {
              "id": "hnothuj",
              "text": "Ubisoft is making playable skins. This is just like CSGO skins but valve can't just fuck up and delete it from your inventory",
              "timestamp": "2021-12-08 06:19:12",
              "score": 2,
              "num_children": 0,
              "author": 238615,
              "replies": []
            }
          ]
        },
        {
          "id": "hnn1whn",
          "text": "nice b8",
          "timestamp": "2021-12-07 21:18:26",
          "score": 46,
          "num_children": 1,
          "replies": [
            {
              "id": "hnn8pu1",
              "text": "yummy",
              "timestamp": "2021-12-07 22:05:51",
              "score": 4,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hnn9i5l",
          "text": "Imagine buying an NFT of a meme and thinking you're owning it and showing the \"poorfrags\". LOL",
          "timestamp": "2021-12-07 22:11:33",
          "score": 11,
          "num_children": 0,
          "author": 384847,
          "replies": []
        },
        {
          "id": "hnmy41l",
          "text": "Perhaps learn about copy paste",
          "timestamp": "2021-12-07 20:52:52",
          "score": 11,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hnneu14",
          "text": "NFT stands for\n\nN: I’m a fucking\n\nF: dope and I don’t \n\nT: deserve the money I wasted",
          "timestamp": "2021-12-07 22:51:22",
          "score": 10,
          "num_children": 0,
          "author": 170031,
          "replies": []
        },
        {
          "id": "hnn7ykj",
          "text": "giga-based. As an NFT owner myself, nothing brings me more joy than poorfrags seething at my collection. Perhaps spend more time in school learning about block-chain and encryption and less playing video games. haha\n\nEdit: Imagine thinking that copy-pasting an image is the same as owning it. As you can clearly see from the bc (block chain for you non-tech people) , I am the rightful owner of the artwork. Any and all duplications are thus a cheap replica.",
          "timestamp": "2021-12-07 22:00:28",
          "score": 17,
          "num_children": 1,
          "author": 274948,
          "replies": [
            {
              "id": "hnnf9h3",
              "text": "giga-based. As an NFT owner myself, nothing brings me more joy than poorfrags seething at my collection. Perhaps spend more time in school learning about block-chain and encryption and less playing video games. haha\n\nEdit: Imagine thinking that copy-pasting an image is the same as owning it. As you can clearly see from the bc (block chain for you non-tech people) , I am the rightful owner of the artwork. Any and all duplications are thus a cheap replica.\n\n\nEdit2: The fact that people think \"copy pasting\" is somehow harming NFTs is hilarious. Is the Mona Lisa devalued when someone takes a picture of it? Educate yourselves.",
              "timestamp": "2021-12-07 22:54:34",
              "score": 11,
              "num_children": 0,
              "author": 209121,
              "replies": []
            }
          ]
        },
        {
          "id": "hnnros1",
          "text": "!emojify",
          "timestamp": "2021-12-08 00:31:32",
          "score": 3,
          "num_children": 1,
          "author": 190573,
          "replies": [
            {
              "id": "hnnrpsp",
              "text": "giga-based. As an NFT owner 💯 myself, nothing 🚫 brings 🚶 me more joy 😊 than poorfrags seething 😤 at my collection 💦. Perhaps 😍 spend 💰 more time 🕐 in school 🏫 learning 🤓 about 💦 block-chain ☁ and encryption 🔐 and less ➖ playing 🎮 video 📹 games 🎱‼🃏. haha 😂   \n  \nEdit 📝: Imagine 🤔💭 thinking 🤔💭 that copy-pasting 📠 an image 📸 is the same as owning 🔫 it. As you 👈 can clearly 😋😉 see 👀 from the bc 😰 (block 🚫🍆❌ chain ⛓ for you 👈 non-tech people 👫👦👧) , I 👥 am the rightful 😐😬 owner 😎 of the artwork 🖌. Any and all 💯 duplications ⚫ are thus 😮 a cheap 💸 replica ➕.   \n  \n  \nEdit2: The fact ☑ that people 👫 think 🤔 \"copy 📝 pasting 📥\" is somehow 😆 harming 🤕 NFTs is hilarious 😆. Is the Mona 🅱 Lisa 😂 devalued when 🍑 someone 👤 takes 👊 a picture 📸 of it? Educate 🎓 yourselves.",
              "timestamp": "2021-12-08 00:31:45",
              "score": 10,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hnn8psc",
          "text": "Yikesss",
          "timestamp": "2021-12-07 22:05:51",
          "score": 3,
          "num_children": 0,
          "author": 188129,
          "replies": []
        },
        {
          "id": "hnnbeee",
          "text": "The best thing to do for NFTs is just to right click and save image",
          "timestamp": "2021-12-07 22:25:23",
          "score": 3,
          "num_children": 0,
          "author": 5469,
          "replies": []
        },
        {
          "id": "hnng2i6",
          "text": "You can genuinely forge an electronic signature/token but not a real one made of oil paints and physical matter, you see",
          "timestamp": "2021-12-07 23:00:39",
          "score": 0,
          "num_children": 1,
          "author": 319060,
          "replies": [
            {
              "id": "hnnpccy",
              "text": "Ok, please forge a signature using Richard Stallman's PGP key.\n\nhttps://stallman.org/gpg.html\n\nYou are speaking authoritatively over a topic you have no experience in.",
              "timestamp": "2021-12-08 00:12:48",
              "score": -1,
              "num_children": 1,
              "author": 76338,
              "replies": [
                {
                  "id": "hnny57p",
                  "text": "no. seethe+cope+ratio",
                  "timestamp": "2021-12-08 01:24:30",
                  "score": 3,
                  "num_children": 0,
                  "author": 319060,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hnozvai",
      "text": "anon will always be twisted",
      "timestamp": "2021-12-08 07:43:31",
      "score": 1,
      "num_children": 0,
      "author": 119315,
      "replies": []
    },
    {
      "id": "hnpiymq",
      "text": "Use a chrome extension. It literally undoes YouTube’s stupid decision.",
      "timestamp": "2021-12-08 12:11:12",
      "score": 1,
      "num_children": 0,
      "author": 114825,
      "replies": []
    },
    {
      "id": "hnoq5gj",
      "text": "dont say the acronym NFT you’ll scare the redditors",
      "timestamp": "2021-12-08 05:39:13",
      "score": -4,
      "num_children": 0,
      "replies": []
    }
  ]
}