{
  "id": "reonkm",
  "text": "Dankish\n",
  "timestamp": "2021-12-12 13:05:12",
  "score": 5745,
  "subreddit": "t5_3fdcn",
  "num_children": 36,
  "author": 327483,
  "replies": [
    {
      "id": "ho8prvt",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2021-12-12 13:05:17",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "ho8zrp1",
      "text": "I keep hoping it will impact voting in 2022. It is one of my only hopes.",
      "timestamp": "2021-12-12 14:32:36",
      "score": 505,
      "num_children": 8,
      "author": 9833,
      "replies": [
        {
          "id": "ho94ij5",
          "text": "It really wont given the fact they prey on teenagers online casually  spamming their ideology in the form of memes and “funny” videos\n\nEdit: i kinda generalized teenagers here sorry about that.",
          "timestamp": "2021-12-12 15:04:40",
          "score": 232,
          "num_children": 5,
          "author": 263916,
          "replies": [
            {
              "id": "ho956g9",
              "text": "I am a teacher and honestly most kids are pretty good and tend towards progressive. There are shitty kids out there but they aren't the majority.",
              "timestamp": "2021-12-12 15:09:21",
              "score": 217,
              "num_children": 8,
              "author": 9833,
              "replies": [
                {
                  "id": "ho95ecn",
                  "text": "Youre completely right those shitty kids tend to be the loudest sorry for generalizing",
                  "timestamp": "2021-12-12 15:10:54",
                  "score": 129,
                  "num_children": 1,
                  "author": 263916,
                  "replies": [
                    {
                      "id": "hoa4obz",
                      "text": "> those shitty kids tend to be the loudest\n\nIt's OK they'll probably end up becoming cops.",
                      "timestamp": "2021-12-12 19:06:04",
                      "score": 89,
                      "num_children": 1,
                      "author": 319463,
                      "replies": [
                        {
                          "id": "hoaa9m6",
                          "text": "Good God that is a depressing thought.\n\nEdit: You're right though.",
                          "timestamp": "2021-12-12 19:41:34",
                          "score": 53,
                          "num_children": 0,
                          "author": 152454,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ho9hhj9",
                  "text": "You have no idea how much I needed to hear that today. Thank you.",
                  "timestamp": "2021-12-12 16:34:59",
                  "score": 37,
                  "num_children": 1,
                  "author": 4720,
                  "replies": [
                    {
                      "id": "ho9ifnk",
                      "text": "It's funny even my kids, 7th graders, whose parents were Trump supporters were far more progressive than the kids themselves realized. The kids would parrot their parents at times, but then they would express support for social programs and be allies for their LGBTQ friends. I am in a very rural red area too, so it really gives me hope for the future.",
                      "timestamp": "2021-12-12 16:41:20",
                      "score": 52,
                      "num_children": 2,
                      "author": 9833,
                      "replies": [
                        {
                          "id": "ho9jfcg",
                          "text": "Same. I teach second in a very red area of a blue state. One father is constantly sending his son in with the most inappropriate books (Rush Limbaugh) the kid is so kind and so sweet but is still learning to read. When he asks if he can read it I Say “ in school we are working on “just right” level books. This is something you can always try to read at home but at school we should read books from our class library. The father also wanted to know who I voted for. So obnoxious. The kid has a great moral compass and a lot of empathy and I hope that is enough to keep him on a path of being able to his critical thinking skills.",
                          "timestamp": "2021-12-12 16:48:07",
                          "score": 57,
                          "num_children": 3,
                          "author": 204066,
                          "replies": [
                            {
                              "id": "ho9q0q3",
                              "text": "Ugh... that poor child 😓",
                              "timestamp": "2021-12-12 17:31:48",
                              "score": 33,
                              "num_children": 0,
                              "author": 21138,
                              "replies": []
                            },
                            {
                              "id": "hobsum8",
                              "text": "Thank you for being a teacher! I know you don’t hear it a lot but it takes a lot of courage and motivation to do what you do, especially with the risks involved nowadays, and the poor pay. Thank you for your service",
                              "timestamp": "2021-12-13 02:11:22",
                              "score": 9,
                              "num_children": 1,
                              "author": 309017,
                              "replies": [
                                {
                                  "id": "hobw83c",
                                  "text": "Awww thanks! I teach because I love it. When my students learn or master a new concept  my heart is full. I love waking up everyday to see them. I can do without the parent and administrator drama sometimes but I can’t imagine doing anything more fulfilling. No one goes into teaching for the money. Yet, I do get to wake up everyday and do something I am passionate about.",
                                  "timestamp": "2021-12-13 02:36:39",
                                  "score": 8,
                                  "num_children": 0,
                                  "author": 204066,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hpbipx4",
                              "text": "Out of curiosity, did you tell him who you voted for??  I would not respond to that well",
                              "timestamp": "2021-12-20 17:52:56",
                              "score": 1,
                              "num_children": 1,
                              "author": 212508,
                              "replies": [
                                {
                                  "id": "hujblxs",
                                  "text": "I said “I am very concerned with the environment so I vote for a candidate that takes science very seriously”",
                                  "timestamp": "2022-01-28 03:42:31",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 204066,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hocyj7j",
                          "text": "Hasn't it long been the case that people often support policies that don't align with their voting tendencies because of single issues though?\n\nWhy would these kids be different?",
                          "timestamp": "2021-12-13 09:03:51",
                          "score": 2,
                          "num_children": 0,
                          "author": 183190,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hoah5uw",
                  "text": "Millennials turned the tide, but I white-knuckle the belief that when Gen Z comes into their own (20 yrs?) they're going to mop up. I've got a lot of mental memes about this.",
                  "timestamp": "2021-12-12 20:27:46",
                  "score": 14,
                  "num_children": 0,
                  "author": 306307,
                  "replies": []
                },
                {
                  "id": "ho9nbit",
                  "text": "Where are you a teacher though? If you are in a city, most of their parents also would be pretty progressive whereas that would not be the case in a rural school.",
                  "timestamp": "2021-12-12 17:14:05",
                  "score": 7,
                  "num_children": 1,
                  "author": 295902,
                  "replies": [
                    {
                      "id": "ho9oxcr",
                      "text": "Rural area.",
                      "timestamp": "2021-12-12 17:24:38",
                      "score": 21,
                      "num_children": 2,
                      "author": 9833,
                      "replies": [
                        {
                          "id": "ho9qvqt",
                          "text": "Thanks for answering (and for being a teacher, especially these days!)",
                          "timestamp": "2021-12-12 17:37:27",
                          "score": 13,
                          "num_children": 0,
                          "author": 295902,
                          "replies": []
                        },
                        {
                          "id": "hobkrrp",
                          "text": "That's so surprising. I grew up in a rural area and the kids were all extremely conservative and homophobic and judgmental. I am a millennial though, so that could make a huge difference.",
                          "timestamp": "2021-12-13 01:09:08",
                          "score": 3,
                          "num_children": 1,
                          "author": 353515,
                          "replies": [
                            {
                              "id": "hobm669",
                              "text": "There are definitely some jerks, but overall, they are far better than a lot of the teachers and their parents.",
                              "timestamp": "2021-12-13 01:19:58",
                              "score": 4,
                              "num_children": 0,
                              "author": 9833,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hobsoou",
                  "text": "Thank you for being a teacher! I know you don’t hear it a lot but it takes a lot of courage and motivation to do what you do, especially with the risks involved nowadays, and the poor pay. Thank you for your service",
                  "timestamp": "2021-12-13 02:10:05",
                  "score": 3,
                  "num_children": 1,
                  "author": 309017,
                  "replies": [
                    {
                      "id": "hobsvpx",
                      "text": "Thank you, but the bright spot even though I teach in a very conservative area, it is on California. We get paid decently if the cost of living isn't too high.",
                      "timestamp": "2021-12-13 02:11:36",
                      "score": 3,
                      "num_children": 0,
                      "author": 9833,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hobdoxu",
                  "text": "And the shitty ones will end up trapped in their racist backwater small-town because they're not smart enough for college. Nothing but pills and poverty for you, young brownshirt. And frankly, you deserve no better.",
                  "timestamp": "2021-12-13 00:16:06",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hoai75v",
                  "text": "Thank goodness for that.",
                  "timestamp": "2021-12-12 20:34:46",
                  "score": 1,
                  "num_children": 0,
                  "author": 275743,
                  "replies": []
                },
                {
                  "id": "hobhv45",
                  "text": "Depends on the area.",
                  "timestamp": "2021-12-13 00:47:44",
                  "score": 1,
                  "num_children": 0,
                  "author": 35111,
                  "replies": []
                }
              ]
            },
            {
              "id": "ho99lfo",
              "text": "Plus there's still the TERFs and the Sam Harris/Jordan Peterson people.",
              "timestamp": "2021-12-12 15:40:22",
              "score": 18,
              "num_children": 2,
              "author": 45188,
              "replies": [
                {
                  "id": "ho9a6xu",
                  "text": "\"wHaT WouLD wE DO wIThOuT mEn?\" -jordan p.",
                  "timestamp": "2021-12-12 15:44:28",
                  "score": 21,
                  "num_children": 2,
                  "author": 279080,
                  "replies": [
                    {
                      "id": "ho9c2ct",
                      "text": "Without men most of my migraines would just come from TERFs, Neo Liberals, and New Agers",
                      "timestamp": "2021-12-12 15:57:23",
                      "score": 16,
                      "num_children": 0,
                      "author": 45188,
                      "replies": []
                    },
                    {
                      "id": "ho9ql3s",
                      "text": "Eat lobsters?",
                      "timestamp": "2021-12-12 17:35:33",
                      "score": 4,
                      "num_children": 1,
                      "author": 308105,
                      "replies": [
                        {
                          "id": "hoabkk4",
                          "text": "I only eat the Alpha lobsters",
                          "timestamp": "2021-12-12 19:50:07",
                          "score": 4,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hoc5kay",
                  "text": "Sam Harris people. What do they believe?",
                  "timestamp": "2021-12-13 03:48:43",
                  "score": 2,
                  "num_children": 1,
                  "author": 4778,
                  "replies": [
                    {
                      "id": "hoc6rve",
                      "text": "Basically, they are atheist extremists that believe that Eugenics is real and that trans people are fake, because they claim to love science but don't actually know what science is.\n\nIt is a fatal and ridiculous mistake to claim that religion in and of itself is the problem when you have a few speakers encouraging people to be just downright nasty because facts and logic are more important than \"being woke\"\n\nGiven the amount of people who believe that everyone who has faith is right wing and everyone who doesn't is left wing..  this is a real problem.\n\n\nThe core belief that Sam Harris has is that everyone is a organic robot with no mind or will of their own, and that we could achieve world peace if we just think the right way, and thinking the right way includes every backwards thing that Sam Harris himself believes. Anyone who can't be taught to think the right way is defective and a danger to everyone else, and must be treated as though they are mentally ill.\n\nAnd if that doesn't sound like fascism to you, then I challenge you to go onto the Sam Harris subreddit. It really needs to be featured on r/againsthatesubreddits\n\nI say this as a trans woman who was referred to as a mentally ill male rapist on r/samharris (plz no brigading)",
                      "timestamp": "2021-12-13 03:58:28",
                      "score": 2,
                      "num_children": 0,
                      "author": 45188,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ho9i0ya",
              "text": "Those memes and videos they post were actually designed by neo Nazis to isolate and alienate the poster. The (presumably)white kid posts it and everyone gets mad at him and calls him names, stripping him of his community and priming him for radicalization.",
              "timestamp": "2021-12-12 16:38:36",
              "score": 6,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ho9hqds",
              "text": "Here's hoping that it will, between the constituents they've killed and the ones they've disenfranchised by not being as extreme as their idiot voters/qucks want.",
              "timestamp": "2021-12-12 16:36:38",
              "score": 5,
              "num_children": 0,
              "author": 329764,
              "replies": []
            },
            {
              "id": "hoh9ext",
              "text": "*insert epilepsy inducing montage of nazi propaganda with phonk music in the background*",
              "timestamp": "2021-12-14 05:51:37",
              "score": 1,
              "num_children": 0,
              "author": 285238,
              "replies": []
            }
          ]
        },
        {
          "id": "ho97c4b",
          "text": "Desantis won Florida by 33k.\n\n62k people have died of covid in Florida. Democrats are about 10% unvaccinated and Republicans are about 40% unvaccinated. So maybe around 4 in 5 deaths will be Republican.\n\nSo there's hope! There's your daily dose of optimism.",
          "timestamp": "2021-12-12 15:24:32",
          "score": 59,
          "num_children": 2,
          "author": 299531,
          "replies": [
            {
              "id": "ho98jq5",
              "text": "62k is probably a low number in Florida, they've been on record as falsifying covid data on a state level.",
              "timestamp": "2021-12-12 15:33:03",
              "score": 56,
              "num_children": 1,
              "author": 240795,
              "replies": [
                {
                  "id": "hoak7qi",
                  "text": "Yeah but when you factor in all the legal bullshit, voter purging, and poll worker corruption, and limited access to voting, democrats would need 10x that difference in their favor to win. \n\nThe asymmetry of power in favor of Republicans is rage inducing.",
                  "timestamp": "2021-12-12 20:48:03",
                  "score": 13,
                  "num_children": 1,
                  "author": 169109,
                  "replies": [
                    {
                      "id": "hobvx65",
                      "text": "People always get that part wrong. Nothing the republicans are doing is new: closing polling locations in democrat-heavy areas, voter ID laws, gerrymandering, voter roll purges, superfluous recounts/audits, voter intimidation... they've been doing all of those for years and still losing elections. The only difference is that they are more open about it now and no longer embarrassed when they get caught cheating.",
                      "timestamp": "2021-12-13 02:34:20",
                      "score": 7,
                      "num_children": 1,
                      "author": 81370,
                      "replies": [
                        {
                          "id": "hoc2upl",
                          "text": "> they've been doing all of those for years and still losing elections\n\nThe point is they have an easier time winning despite most people not liking their policies. Every election cycle they get better and better at cheating.",
                          "timestamp": "2021-12-13 03:27:26",
                          "score": 1,
                          "num_children": 1,
                          "author": 169109,
                          "replies": [
                            {
                              "id": "hod6j3c",
                              "text": "And lose by a larger margin - both the national and state elections. GOP voters are a dwindling minority. That's why they cheat. They aren't getting young voters to replace the Boomers and Greatest who are aging out. Each generation has a higher educational attainment than the one before it and education level is the number one predictor of voting patterns. They HAVE to cheat, and they're still losing more and more.",
                              "timestamp": "2021-12-13 10:58:12",
                              "score": 1,
                              "num_children": 0,
                              "author": 81370,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ho97muo",
              "text": "Ugh, I hate that death is my daily dose of optimism. It is depressing. Living in historical times sucks.",
              "timestamp": "2021-12-12 15:26:38",
              "score": 18,
              "num_children": 1,
              "author": 9833,
              "replies": [
                {
                  "id": "ho9chz1",
                  "text": "Well if it makes you feel any less optimistic, the Democrats are going to lose votes by not following through on any of their promises, so maybe nothing will change!",
                  "timestamp": "2021-12-12 16:00:26",
                  "score": 23,
                  "num_children": 1,
                  "author": 286336,
                  "replies": [
                    {
                      "id": "ho9laij",
                      "text": "But then we'll have accelerationism. See? I'm all about the silver linings!",
                      "timestamp": "2021-12-12 17:00:34",
                      "score": 6,
                      "num_children": 0,
                      "author": 299531,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hoafc5o",
          "text": "Unfortunately, it won’t. The reason why COVID-19 is such an effective spreader is that it doesn’t kill a majority of hosts. That allows it to keep spreading and spreading and spreading. \n\n800k dead in the US alone is definitely a massive, massive tragedy. But there were somewhere in the neighborhood of 160 million votes cast for President last time. \n\nCombine that with new voter suppression laws and gerrymandering from the recent redistricting this year, and it’s going to be an uphill battle. The best solution would be to pass one of the two best voting rights acts. But that’s going to require punching a hole in the filibuster, apparently, because two Senators are busy grandstanding.",
          "timestamp": "2021-12-12 20:15:24",
          "score": 5,
          "num_children": 0,
          "author": 371927,
          "replies": []
        },
        {
          "id": "ho949at",
          "text": "Same. I hope they all go by way of the dodo.",
          "timestamp": "2021-12-12 15:02:52",
          "score": 10,
          "num_children": 0,
          "author": 344158,
          "replies": []
        },
        {
          "id": "ho9k1u7",
          "text": "Their voting habits are already impacted by constantly telling themselves \"the elections are rigged! Don't vote, there's no point!\" Of course, they do that to psyche themselves up to overthrow democracy, but still.",
          "timestamp": "2021-12-12 16:52:17",
          "score": 7,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ho9ptgi",
          "text": "I think the Dems are throwing this election with their refusal to cancel student loan debt. That coupled with a few hundred thousand dead conservatives will balance it out IMHO.\n\nEdit: how much you wanna bet we'll hear about dead conservatives voting GOP?",
          "timestamp": "2021-12-12 17:30:30",
          "score": 5,
          "num_children": 1,
          "replies": [
            {
              "id": "hoafsev",
              "text": "There were two cases documented of votes being cast in the name of dead people that I read about. One in AZ and one in PA. And they were both Republicans who cast their dead relatives’ ballots.",
              "timestamp": "2021-12-12 20:18:30",
              "score": 2,
              "num_children": 0,
              "author": 371927,
              "replies": []
            }
          ]
        },
        {
          "id": "hobshir",
          "text": "Between Gerrymandering, voter suppression, and the fact that conservatives are fear mongered into voting, and older generations voting much more and tending to lean conservative, and the fact they push culture issues like CRT, Vaccine fears, “Cultural Marxism,” there’s a lot more motivation for people to vote republican.\nOn top of that Biden hasn’t done anything differently, he hasn’t cancelled student debt or loan interest, legalized marijuana, tried to combat voter suppression in any meaningful way, pushed for higher minimum wage, and has kept the camps at the border open, has deported people at a higher rate then Trump, Hasn’t addressed climate change, I don’t know if it will impact anything",
          "timestamp": "2021-12-13 02:08:33",
          "score": 2,
          "num_children": 0,
          "author": 309017,
          "replies": []
        },
        {
          "id": "hob6wod",
          "text": "A brave revolutionary named Rosa Luxemburg would like a word with your bourgeois elections...",
          "timestamp": "2021-12-12 23:25:02",
          "score": 0,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ho99hnb",
      "text": "Seriously, I will never get over the hilarious look of \"utter bewilderment\" he seems to constantly wear, combined with his childlike Buddy the Elf style voice, I thought he was developmentally disabled.  \n\n\nThat's not an ableist joke at his expense, I mean I legitimately thought Fox News was abusing a mentally disabled person who didn't know any better... but no, that's just how Carlson is.",
      "timestamp": "2021-12-12 15:39:38",
      "score": 158,
      "num_children": 1,
      "author": 45188,
      "replies": [
        {
          "id": "hoa7gg1",
          "text": "My dog gives me that same look any time I leave him at home lmao",
          "timestamp": "2021-12-12 19:23:25",
          "score": 29,
          "num_children": 1,
          "author": 285174,
          "replies": [
            {
              "id": "hoafykb",
              "text": "At least your dog is being sincere.",
              "timestamp": "2021-12-12 20:19:38",
              "score": 22,
              "num_children": 0,
              "author": 371927,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hoad38y",
      "text": "Nazis killin' nazis. It is the way",
      "timestamp": "2021-12-12 20:00:16",
      "score": 45,
      "num_children": 1,
      "author": 214022,
      "replies": [
        {
          "id": "hoafh74",
          "text": "Hitler killed the worst Nazi of all.",
          "timestamp": "2021-12-12 20:16:21",
          "score": 28,
          "num_children": 0,
          "author": 360580,
          "replies": []
        }
      ]
    },
    {
      "id": "ho97vp3",
      "text": "Now that's funny.",
      "timestamp": "2021-12-12 15:28:22",
      "score": 25,
      "num_children": 0,
      "author": 411009,
      "replies": []
    },
    {
      "id": "ho9hspl",
      "text": "Damn. Just like the devil is actually the hero of the bible because all he does is punish evil people. All Tucker does is kill fox news viewers!",
      "timestamp": "2021-12-12 16:37:03",
      "score": 16,
      "num_children": 0,
      "author": 8291,
      "replies": []
    },
    {
      "id": "ho8r25w",
      "text": "That is a fact.",
      "timestamp": "2021-12-12 13:17:17",
      "score": 37,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ho9r49o",
      "text": "Not enough I hope he keeps at it",
      "timestamp": "2021-12-12 17:38:59",
      "score": 10,
      "num_children": 0,
      "author": 289804,
      "replies": []
    },
    {
      "id": "ho91qc3",
      "text": "Let him keep doing that. I wish he causes that to happen more in swing states. Florida is priming for another one in 2022 summer.",
      "timestamp": "2021-12-12 14:45:31",
      "score": 33,
      "num_children": 0,
      "author": 213814,
      "replies": []
    },
    {
      "id": "ho9v6c2",
      "text": "This got an angry chuckle outta me.",
      "timestamp": "2021-12-12 18:05:25",
      "score": 5,
      "num_children": 0,
      "author": 163865,
      "replies": []
    },
    {
      "id": "ho99afd",
      "text": "what?",
      "timestamp": "2021-12-12 15:38:14",
      "score": 12,
      "num_children": 1,
      "author": 79354,
      "replies": [
        {
          "id": "ho9owu3",
          "text": "because he is anti-vax and thus his viewers are aswell -> they dont get vaccinated and die of covid (if all goes well)",
          "timestamp": "2021-12-12 17:24:33",
          "score": 42,
          "num_children": 4,
          "author": 125106,
          "replies": [
            {
              "id": "hoa2nv1",
              "text": "I wouldn’t call preventable deaths “well”, especially because they infect other innocents. \n\nBut yeah, good explanation!",
              "timestamp": "2021-12-12 18:53:22",
              "score": 16,
              "num_children": 0,
              "author": 393868,
              "replies": []
            },
            {
              "id": "hob1n2u",
              "text": "[deleted]",
              "timestamp": "2021-12-12 22:47:02",
              "score": 10,
              "num_children": 1,
              "replies": [
                {
                  "id": "hob269t",
                  "text": "true, but I just wanted to quickly make a point. im not super educated on the topic of Tucker but he probably talks a lot of shit about the vaccine and thats why I said that :)",
                  "timestamp": "2021-12-12 22:50:41",
                  "score": 4,
                  "num_children": 1,
                  "author": 125106,
                  "replies": [
                    {
                      "id": "hob2fhm",
                      "text": "[deleted]",
                      "timestamp": "2021-12-12 22:52:29",
                      "score": 5,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hob2mic",
                          "text": "thanks! I didnt want to imply an argumentation, if I did im sorry, im really sleep deprived haha",
                          "timestamp": "2021-12-12 22:53:53",
                          "score": 2,
                          "num_children": 0,
                          "author": 125106,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hoaojw4",
              "text": "He’s antivax that is vaccinated!",
              "timestamp": "2021-12-12 21:16:53",
              "score": 9,
              "num_children": 0,
              "author": 182366,
              "replies": []
            },
            {
              "id": "hobt1tc",
              "text": "He himself obviously doesn’t buy into it though, that’s the evil part, he’s a parrot for the people that fund him, all of Fox News’ crew has vaccine mandates, that’s the evil part",
              "timestamp": "2021-12-13 02:12:54",
              "score": 5,
              "num_children": 0,
              "author": 309017,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ho93j11",
      "text": "😭😭😭",
      "timestamp": "2021-12-12 14:57:50",
      "score": 5,
      "num_children": 0,
      "author": 348151,
      "replies": []
    },
    {
      "id": "hoa74ut",
      "text": "It took me a while to think how he did that... But then I remember his antivaxx status.",
      "timestamp": "2021-12-12 19:21:26",
      "score": 4,
      "num_children": 0,
      "author": 341971,
      "replies": []
    },
    {
      "id": "hoabtpe",
      "text": "He gave a full endorsement of RFK Jr's new book. Kinda sus.",
      "timestamp": "2021-12-12 19:51:47",
      "score": 3,
      "num_children": 1,
      "author": 375163,
      "replies": [
        {
          "id": "hoag3zh",
          "text": "Bobby Jr. has gone off the deep end.",
          "timestamp": "2021-12-12 20:20:39",
          "score": 3,
          "num_children": 1,
          "author": 371927,
          "replies": [
            {
              "id": "hohxova",
              "text": "He sure has. Who the heck takes a plane to go swimming?",
              "timestamp": "2021-12-14 11:04:17",
              "score": 1,
              "num_children": 0,
              "author": 412202,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hoaihfn",
      "text": "I do believe that there are fewer of the right minded thinking people every generation. Every time some small minded bigot passes away, there is a kid with an open mind and far less prejudices waiting to take their place.",
      "timestamp": "2021-12-12 20:36:41",
      "score": 3,
      "num_children": 0,
      "author": 275743,
      "replies": []
    },
    {
      "id": "hoar1fe",
      "text": "It's true but I still hate him",
      "timestamp": "2021-12-12 21:33:41",
      "score": 3,
      "num_children": 0,
      "author": 262898,
      "replies": []
    },
    {
      "id": "hob6es8",
      "text": "I can't comment on Tucker because my opinions is ban-worthy.",
      "timestamp": "2021-12-12 23:21:23",
      "score": 3,
      "num_children": 0,
      "author": 402667,
      "replies": []
    },
    {
      "id": "hobhnkr",
      "text": "At first I didn’t get it, but then I did. This is fucking great",
      "timestamp": "2021-12-13 00:46:07",
      "score": 3,
      "num_children": 0,
      "author": 302778,
      "replies": []
    },
    {
      "id": "hoac0nw",
      "text": "You got this tucker!",
      "timestamp": "2021-12-12 19:53:03",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hobk811",
      "text": "It's like the complicated relationship Polish people have with Stalin. We hate him because he killed a lot of us. We also like him because no one killed more Russians than him.",
      "timestamp": "2021-12-13 01:04:57",
      "score": 2,
      "num_children": 0,
      "author": 215849,
      "replies": []
    },
    {
      "id": "hobkvdw",
      "text": "Unfortunately he’s also (indirectly) killed decent people.",
      "timestamp": "2021-12-13 01:09:54",
      "score": 2,
      "num_children": 0,
      "author": 40174,
      "replies": []
    },
    {
      "id": "ho9h9w2",
      "text": "[removed]",
      "timestamp": "2021-12-12 16:33:34",
      "score": -7,
      "num_children": 4,
      "replies": [
        {
          "id": "ho9q88r",
          "text": "Who is pretending that?  \n\nAre you going to pretend there aren't a significant number more anti-vaxers on the right than there are on the left?",
          "timestamp": "2021-12-12 17:33:10",
          "score": 9,
          "num_children": 0,
          "author": 201921,
          "replies": []
        },
        {
          "id": "ho9rikx",
          "text": "Which left wing politicians or news anchors have been telling people to not get vaccinated like Tucker has?",
          "timestamp": "2021-12-12 17:41:35",
          "score": 8,
          "num_children": 0,
          "author": 88876,
          "replies": []
        },
        {
          "id": "ho9ktne",
          "text": "What is there to pretend? They’re so infrequent versus the right-wing variety explicitly because the right’s media has peddled this anti-vax and anti-mask and just generally pro-infection nonsense since day 1. Seriously go find me an example of an antivax lefty. I can instantly link you to hundreds of examples of right wing ones.",
          "timestamp": "2021-12-12 16:57:30",
          "score": 16,
          "num_children": 1,
          "author": 141644,
          "replies": [
            {
              "id": "ho9qen5",
              "text": "There are plenty of people that are not conservative and are skeptical of vaccines, particularly people of color, due to past incidents in this country that have eroded their trust in the government’s approach to medicine with them. The [Tuskegee Syphilis Study](https://en.m.wikipedia.org/wiki/Tuskegee_Syphilis_Study) is an example of such. Misinformation only serves to make things worse. It is undoubtedly true that the people that are exposed to programs like Tuckers are mostly right-wing but, in general, the anti-vax rhetoric will always have a wider audience.",
              "timestamp": "2021-12-12 17:34:21",
              "score": -7,
              "num_children": 4,
              "author": 175433,
              "replies": [
                {
                  "id": "ho9r668",
                  "text": "The conversation doesn’t have to even be framed about “pretending” or “ignoring”. The fact of the matter is right-wing media and politicians have been aggressively pushing anti-vax and anti-mask sentiments for the entirety of the pandemic. I understand vaccine hesitancy exists in all walks of life, but it’s wildly inaccurate to try to portray it as a “both sides are equally bad” thing when only one is very deliberately trying to undermine medical trust in its audience.",
                  "timestamp": "2021-12-12 17:39:20",
                  "score": 8,
                  "num_children": 1,
                  "author": 141644,
                  "replies": [
                    {
                      "id": "ho9upih",
                      "text": "Not at all trying to suggest both sides are equally pushing misinformation. The right wing is clearly proudly owning that and have blood on their hands for it. What I’m saying is that people on both sides of the aisle are *victims* of this rhetoric and may have valid reasons, based on American history and how their demographics have been treated by the government and the medical community, to be skeptical. It doesn’t make them right in their anti-vax beliefs, it’s just a hurdle that needs to be addressed to build back their trust.",
                      "timestamp": "2021-12-12 18:02:25",
                      "score": 3,
                      "num_children": 1,
                      "author": 175433,
                      "replies": [
                        {
                          "id": "ho9vvrm",
                          "text": "Ah I understand what you’re saying there. Honestly, yeah, the death numbers have kinda numbed me to a lot, but not so much that I still don’t recognize the ones who are suffering/had suffered as often times victims of bad rhetoric. The part that gets me angry is the ones who do try to not get sick but are vulnerable because of conditions outside of their control, yet we have these asshats galavanting around on a crusade against masks as if asking them to take measures to not get their community sick is a grave insult to their freedoms. My friend’s wife is immunocompromised and I’ve seen the care that goes into making sure she doesn’t get exposed to the virus on his part. It’s infuriating that this rhetoric exists because it just, to me, comes off as callous disregard for your neighbor.",
                          "timestamp": "2021-12-12 18:10:00",
                          "score": 2,
                          "num_children": 0,
                          "author": 141644,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ho9qgfo",
                  "text": "Desktop version of /u/lsThisReaILife's link: <https://en.wikipedia.org/wiki/Tuskegee_Syphilis_Study>\n\n --- \n\n ^([)[^(opt out)](https://reddit.com/message/compose?to=WikiMobileLinkBot&message=OptOut&subject=OptOut)^(]) ^(Beep Boop.  Downvote to delete)",
                  "timestamp": "2021-12-12 17:34:41",
                  "score": 1,
                  "num_children": 0,
                  "author": 94696,
                  "replies": []
                },
                {
                  "id": "hoapv79",
                  "text": "That was the case early on, but now blacks are vaccinated at about the same rate as democrats overall (not that all blacks are democrats).",
                  "timestamp": "2021-12-12 21:25:38",
                  "score": 1,
                  "num_children": 1,
                  "author": 171417,
                  "replies": [
                    {
                      "id": "hobhdhr",
                      "text": "This is true. Thanks!",
                      "timestamp": "2021-12-13 00:43:57",
                      "score": 1,
                      "num_children": 0,
                      "author": 175433,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hoavhqr",
                  "text": "I'm so, so tired of people saying that Black people make up a sizeable amount of COVID antivaxxers and implying they're valid to be skeptical because of an experiment from over half a century ago.\n\nNo it's stupid, first of all, I don't think there's evidence that African Americans make up a sizeable proportion of unvaccinated people in the US, and if they do, I doubt it's because of skepticism, but because of a lack of access. The vaccines are offered and taken by everyone, black, white, blue, green, this isn't a reasonable circumstance to be skeptical based on racist medical experimentation",
                  "timestamp": "2021-12-12 22:04:09",
                  "score": 1,
                  "num_children": 1,
                  "author": 245759,
                  "replies": [
                    {
                      "id": "hobh8e9",
                      "text": ">\tI'm so, so tired of people saying that Black people make up a sizeable amount of COVID antivaxxers and implying they're valid to be skeptical because of an experiment from over half a century ago.\n\nI wasn’t specific to just black people, I said people of color. [The CDC even acknowledges these historical factors have an impact](https://www.cdc.gov/coronavirus/2019-ncov/community/health-equity/vaccine-equity.html) and, until recently, communities of color (with the exception of Asian-Americans) were vaccinating at lower rates than white Americans. \n\n>\tNo it's stupid, first of all, I don't think there's evidence that African Americans make up a sizeable proportion of unvaccinated people in the US, and if they do, I doubt it's because of skepticism, but because of a lack of access. The vaccines are offered and taken by everyone, black, white, blue, green, this isn't a reasonable circumstance to be skeptical based on racist medical experimentation\n\nSpoken like someone who hasn’t had to experience something like that before. Whatever you think is irrelevant to the reality. If the government in the past has essentially treated you like a second class citizen based on circumstances beyond your control, why would you blindly trust what they ask you to do?\n\nThankfully, vaccination rates are normalizing as alluded to above but there have been discrepancies in the past and, while lack of access certainly is a factor, it is understandable and absolutely reasonable that people within these communities would be skeptical. Efforts need to be made in these cases to help remove such skepticism.\n\nLet me be clear: I’m not saying they (or anyone) are right to be anti-vax, nor that there aren’t people who are anti-vax without having to deal with these things or simply for the sake of being contrarian or malicious. It’s not a good thing for this ideology to persist and it helps no one. It’s also clear that the propaganda is coming from the right-wing and that they continue to amplify it. It’s good that people of all colors and creeds are getting vaccinated at essentially equal rates now. My ultimate point is that not everyone that has an anti-vax attitude is a terrible human being and, for us as a country to change attitudes, as many people as possible that are holdouts need to be deprogrammed.",
                      "timestamp": "2021-12-13 00:42:53",
                      "score": 1,
                      "num_children": 0,
                      "author": 175433,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ho9q4h3",
          "text": "4 in 10 self identified Republicans is not vaccinated. That number is less than 1 in 10 for self identified democrats. \n\nSource\nhttps://www.brookings.edu/blog/fixgov/2021/10/01/for-covid-19-vaccinations-party-affiliation-matters-more-than-race-and-ethnicity/",
          "timestamp": "2021-12-12 17:32:29",
          "score": 8,
          "num_children": 1,
          "author": 251586,
          "replies": [
            {
              "id": "ho9ti5y",
              "text": "Oh sheet! Sources! More than \"hurr durr, I heard people say\"",
              "timestamp": "2021-12-12 17:54:37",
              "score": 6,
              "num_children": 0,
              "author": 95621,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hob9o0g",
      "text": "They said \"antifascists are the real fascists\".\n\nWell, as it turns out - fascists are the biggest antifascists, so I guess they had a point...",
      "timestamp": "2021-12-12 23:45:37",
      "score": 1,
      "num_children": 0,
      "author": 34191,
      "replies": []
    },
    {
      "id": "hobdupe",
      "text": "He's out of line but he's right....",
      "timestamp": "2021-12-13 00:17:21",
      "score": 1,
      "num_children": 0,
      "author": 6889,
      "replies": []
    },
    {
      "id": "hobr63b",
      "text": "Damn",
      "timestamp": "2021-12-13 01:58:34",
      "score": 1,
      "num_children": 0,
      "author": 78678,
      "replies": []
    },
    {
      "id": "hoc6a1y",
      "text": "But the one he's emboldened are much more dangerous.",
      "timestamp": "2021-12-13 03:54:26",
      "score": 1,
      "num_children": 0,
      "author": 119621,
      "replies": []
    },
    {
      "id": "hoc7hm2",
      "text": "So does this mean we need to have a \"Tucker Carlson\" Day? I'm not ready.",
      "timestamp": "2021-12-13 04:03:56",
      "score": 1,
      "num_children": 0,
      "author": 149244,
      "replies": []
    },
    {
      "id": "hoca1e2",
      "text": "He probably jerks off while thinking about it, too.",
      "timestamp": "2021-12-13 04:24:54",
      "score": 1,
      "num_children": 0,
      "author": 225718,
      "replies": []
    },
    {
      "id": "hocgzdf",
      "text": "Truly God's work.",
      "timestamp": "2021-12-13 05:29:10",
      "score": 1,
      "num_children": 0,
      "author": 150592,
      "replies": []
    },
    {
      "id": "hoci5rc",
      "text": "Tucker is so based he became a grifter for the betterment of the world.",
      "timestamp": "2021-12-13 05:41:02",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hocjxzf",
      "text": "Say whatever you want about Hitler but he did do one thing right, he killed Hitler.",
      "timestamp": "2021-12-13 05:59:46",
      "score": 1,
      "num_children": 0,
      "author": 9647,
      "replies": []
    },
    {
      "id": "hockwgl",
      "text": "He looks so confused all the time for a man who knows exactly what he does for a living.",
      "timestamp": "2021-12-13 06:09:59",
      "score": 1,
      "num_children": 0,
      "author": 182264,
      "replies": []
    },
    {
      "id": "hoclc2s",
      "text": "Holy shit you’re right",
      "timestamp": "2021-12-13 06:14:50",
      "score": 1,
      "num_children": 0,
      "author": 275560,
      "replies": []
    },
    {
      "id": "ho97aox",
      "text": "Wait so the entry requirements for being labelled a nazi in this group, now includes unvaccinated and anyone who watches Tucker?",
      "timestamp": "2021-12-12 15:24:15",
      "score": -44,
      "num_children": 6,
      "author": 189850,
      "replies": [
        {
          "id": "ho9f7pr",
          "text": "are we going to worry about the subtle distinctions between one far right sect and the next?",
          "timestamp": "2021-12-12 16:19:22",
          "score": 28,
          "num_children": 0,
          "author": 409547,
          "replies": []
        },
        {
          "id": "ho9rn2i",
          "text": "Is anyone who is unvaccinated and watches Tucker a Nazi?  No.  \n\nDoes that mean there are no Nazis in the group of unvaccinated people who watch Tucker?  No.\n\nCheck your fallacies.",
          "timestamp": "2021-12-12 17:42:24",
          "score": 12,
          "num_children": 0,
          "author": 201921,
          "replies": []
        },
        {
          "id": "ho9ky48",
          "text": "Tucker, the guy who constantly talks about our nation being made impure and unsafe by plague-ridden immigrants? I mean he doesn't wear the uniforms but he's saying the same shit in a different language.",
          "timestamp": "2021-12-12 16:58:20",
          "score": 23,
          "num_children": 1,
          "author": 150427,
          "replies": [
            {
              "id": "hoagk3u",
              "text": "He had to fire his “top writer” on his TV show for being an absolutely “out and proud” nazi.",
              "timestamp": "2021-12-12 20:23:40",
              "score": 5,
              "num_children": 0,
              "author": 371927,
              "replies": []
            }
          ]
        },
        {
          "id": "ho9ru5i",
          "text": "Where does it say that?  Stay in school kid, reading comprehension is important.\n\n&#x200B;\n\nOh, wait, I get it. You're saying Tucker IS responsible for all the unvaccinated who watch him and don't get vaccinated.\n\nYes, that's right.  Sorry, i thought you didn't get it.",
          "timestamp": "2021-12-12 17:43:39",
          "score": 4,
          "num_children": 0,
          "author": 88876,
          "replies": []
        },
        {
          "id": "ho9htip",
          "text": "No, try again",
          "timestamp": "2021-12-12 16:37:12",
          "score": 3,
          "num_children": 1,
          "author": 84364,
          "replies": [
            {
              "id": "ho9iusm",
              "text": "I don't yet it then",
              "timestamp": "2021-12-12 16:44:13",
              "score": -7,
              "num_children": 1,
              "author": 189850,
              "replies": [
                {
                  "id": "ho9wer6",
                  "text": "It’s not suggesting everyone that watches Tucker or is unvaccinated is a nazi, it’s suggesting nazis (modern definition) likely watch Tucker and fell for his anti-vaxx rhetoric and thus are more likely to have died a preventable death from Covid.",
                  "timestamp": "2021-12-12 18:13:24",
                  "score": 1,
                  "num_children": 1,
                  "author": 84364,
                  "replies": [
                    {
                      "id": "hoax405",
                      "text": "Ok makes sense",
                      "timestamp": "2021-12-12 22:15:23",
                      "score": 0,
                      "num_children": 0,
                      "author": 189850,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ho9ds1b",
          "text": "where are you getting that? What the joke is he didn't kill any nazis and yet he is glorified for killing the most nazis in 70 years...when the war has been over but he encourages racists",
          "timestamp": "2021-12-12 16:09:21",
          "score": -5,
          "num_children": 0,
          "author": 79354,
          "replies": []
        }
      ]
    },
    {
      "id": "ho9y4ky",
      "text": "How has he killed any nazis? Or do you just call anyone you disagree with / don’t like a nazi.",
      "timestamp": "2021-12-12 18:24:22",
      "score": -20,
      "num_children": 2,
      "replies": [
        {
          "id": "hoa2w4j",
          "text": "What do you call an audience who is openly anti-antifa?",
          "timestamp": "2021-12-12 18:54:52",
          "score": 7,
          "num_children": 0,
          "author": 324457,
          "replies": []
        },
        {
          "id": "hoa249g",
          "text": "It is not that it is someone \"we just disagree with\" \n\nThese people, for just the lulz of \"owning the libs\" became Suicidal, homicidal, patricidal, infanticidal, ghoulish bullies. They called everyone who simply wanted them not to spread the virus Cucks , snowflakes, sheep and far worse.\n\nAnd yes , out of that \"side\" of it they have choked on their own fluids patriotically as they spit put \"whaaaaaaiiit Poooowaaa! \" \n\nWhat we know so far. Is absolutely, in fact that that in those rural bastions of Trumpisim, The heart of the racist , bigoted and book burning Nazisim are dying at rates that will flip elections.  \n\nAnd you think we should have pity on the willfully ignorant. The bullies of the world.",
          "timestamp": "2021-12-12 18:49:54",
          "score": 4,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hs4nlo6",
      "text": "Yeh but that changing I think kids now are more centrist",
      "timestamp": "2022-01-10 22:57:56",
      "score": 0,
      "num_children": 0,
      "author": 238289,
      "replies": []
    }
  ]
}