{
  "id": "rgq426",
  "text": "Americans who identify with no religion now account for 29 percent of population: poll\n",
  "timestamp": "2021-12-15 04:09:57",
  "score": 12205,
  "subreddit": "t5_2qh2p",
  "num_children": 166,
  "author": 396073,
  "replies": [
    {
      "id": "hom33in",
      "text": "Yet only about 1% of Congress.",
      "timestamp": "2021-12-15 06:01:03",
      "score": 255,
      "num_children": 3,
      "author": 118182,
      "replies": [
        {
          "id": "hombwsx",
          "text": "Absolutely. All these posts about \"100% when?\" are missing a vital point. Honestly, I'd be okay with somewhere around 50%. The closer to 100% the better, sure. But what matters is social acceptance and political representation. And while we may be on our way down those paths, we still need much more political representation to reflect our current beliefs.",
          "timestamp": "2021-12-15 07:43:35",
          "score": 114,
          "num_children": 1,
          "author": 311039,
          "replies": [
            {
              "id": "hoqmz2b",
              "text": "Did you watch the Friendly Atheists video on that in the past few hours? He basically said the same haha",
              "timestamp": "2021-12-16 04:14:37",
              "score": 2,
              "num_children": 1,
              "author": 92140,
              "replies": [
                {
                  "id": "houxlto",
                  "text": "No, I've never seen their stuff actually. That's hella funny though.",
                  "timestamp": "2021-12-17 01:34:37",
                  "score": 2,
                  "num_children": 0,
                  "author": 311039,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "honw14h",
          "text": "Openly",
          "timestamp": "2021-12-15 16:49:40",
          "score": 27,
          "num_children": 0,
          "author": 115279,
          "replies": []
        },
        {
          "id": "hoqi5il",
          "text": "That's one of the essential flaws of a two party system. Under a parliamentary style government, there could be a party without any religious affiliation and would be a representative proportion in government depending on how many for for them. Not only would that give us a voice, it would be a block that would have to be negotiated with to form a majority since it's pretty much guaranteed every party would be a plurality.",
          "timestamp": "2021-12-16 03:35:41",
          "score": 2,
          "num_children": 0,
          "author": 130019,
          "replies": []
        }
      ]
    },
    {
      "id": "holtt63",
      "text": "Let us go for 100%",
      "timestamp": "2021-12-15 04:32:56",
      "score": 1161,
      "num_children": 16,
      "author": 194718,
      "replies": [
        {
          "id": "home2ls",
          "text": "50% in Germany. Official numbers of course, many more are just in the church because they are to lazy to leave or because the places where you can leave are overwhelmed since a „few“ big child abuse scandals in the past years.  In 2019 both churches, evangelical and catholic lost 1.2% of their members due to leaving.  they are loosing even more members because they die of old age. Religion in Germany will be non existent at the end of the century",
          "timestamp": "2021-12-15 08:11:52",
          "score": 436,
          "num_children": 7,
          "author": 190414,
          "replies": [
            {
              "id": "homkdu0",
              "text": "70% in Korea. Being atheist isnt even a thing thats talked about",
              "timestamp": "2021-12-15 09:39:59",
              "score": 302,
              "num_children": 8,
              "replies": [
                {
                  "id": "homne3c",
                  "text": "And yet the conservatives Christians rule",
                  "timestamp": "2021-12-15 10:22:48",
                  "score": 166,
                  "num_children": 2,
                  "author": 163841,
                  "replies": [
                    {
                      "id": "hoo0zsh",
                      "text": "Not only do they rule...they're getting scared as their numbers decline and they're getting more radical and violent.\n\nQAnon, Flat Earthers, Anti-Vaxxers, trump Cultists/Capitol Insurrectionists, etc.  \n\nAll these things are related and its going to get worse.",
                      "timestamp": "2021-12-15 17:21:56",
                      "score": 68,
                      "num_children": 2,
                      "author": 104413,
                      "replies": [
                        {
                          "id": "hop1fkh",
                          "text": "They are in the death throes, if you will.",
                          "timestamp": "2021-12-15 21:15:51",
                          "score": 5,
                          "num_children": 1,
                          "author": 320973,
                          "replies": [
                            {
                              "id": "hoq936d",
                              "text": "That's when it's most dangerous.",
                              "timestamp": "2021-12-16 02:28:15",
                              "score": 2,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hoquvhe",
                          "text": "[removed]",
                          "timestamp": "2021-12-16 05:25:04",
                          "score": -1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hot6qa2",
                              "text": "Actually you'd be wrong.  You can google it...they've done plenty of studies lately on cult and radicalization since there's so much of it going on.  There are some exceptions...for instance, there are some hippy anti-vaxxers.  But for the most part, conspiracy cultists are all the damned same group of people.  I also should have added christian religion extremists to the list...since they also fall into the same catagorization.\n\nAnd, by the way, I'm female...thought my name might have clued you in...but I know people like you don't get around actual pussy much, so its not surprising.",
                              "timestamp": "2021-12-16 18:21:08",
                              "score": 1,
                              "num_children": 1,
                              "author": 104413,
                              "replies": [
                                {
                                  "id": "hotu8t4",
                                  "text": "[removed]",
                                  "timestamp": "2021-12-16 20:54:46",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hotw97f",
                                      "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\n\n* Your comment contains and/or requests personal information and/or encourages witch-hunting, which is against [reddit rules](https://www.reddit.com/rules). You can try to edit or repost after you reword any requests into simple notices that do not ask users for anything, and after you remove the personal information if that is the issue.\n\n--\n\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\n\n--\n\n\n\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                                      "timestamp": "2021-12-16 21:07:48",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 136356,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "homw1f3",
                      "text": "It’s called fanaticism in my book, and lie, cheat and steal to stay in power. We are a federation built on voting by district, so district voting counts, not individual votes. This was set up to give power to minorities and slavery, and rules to this day. It makes it very easy and legal to lie, cheat, and steal in the U. S.",
                      "timestamp": "2021-12-15 12:11:52",
                      "score": 71,
                      "num_children": 1,
                      "author": 381866,
                      "replies": [
                        {
                          "id": "hon4ogn",
                          "text": "...whats that got do with South Korea?",
                          "timestamp": "2021-12-15 13:34:50",
                          "score": 56,
                          "num_children": 6,
                          "author": 324397,
                          "replies": [
                            {
                              "id": "honmn99",
                              "text": "Sir, this is a Wendy's.",
                              "timestamp": "2021-12-15 15:48:11",
                              "score": 31,
                              "num_children": 0,
                              "author": 228516,
                              "replies": []
                            },
                            {
                              "id": "honhf4m",
                              "text": "I don't know about them but the phrase \"conservative Christian\" immediately made my mind go to American politics .",
                              "timestamp": "2021-12-15 15:13:04",
                              "score": 11,
                              "num_children": 0,
                              "author": 237747,
                              "replies": []
                            },
                            {
                              "id": "hooewjr",
                              "text": "Lol I was reading this comment and at first I was “wow, I had no clue South Korea was being held hostage by religious fanatics, just like my country!” …. Then I kept reading\n\nBut seriously, how are the same people always bitching about ‘muh freedom’ in the US the ones who try to ban everything? Not sure why this thread made me think of that…",
                              "timestamp": "2021-12-15 18:51:14",
                              "score": 2,
                              "num_children": 1,
                              "author": 307316,
                              "replies": [
                                {
                                  "id": "hoomv61",
                                  "text": "Every political thread I read makes me think of that",
                                  "timestamp": "2021-12-15 19:42:07",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 404884,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "honc7sg",
                              "text": "I'm sure they believe Korea a state or county in the US, like France, Singapore and Djibouti.",
                              "timestamp": "2021-12-15 14:35:06",
                              "score": -2,
                              "num_children": 0,
                              "author": 94398,
                              "replies": []
                            },
                            {
                              "id": "hoo2f0t",
                              "text": "Deleted",
                              "timestamp": "2021-12-15 17:31:00",
                              "score": 1,
                              "num_children": 0,
                              "author": 381866,
                              "replies": []
                            },
                            {
                              "id": "hoo2ycy",
                              "text": "The fact that Christians rule in both South Korea and the US seems more than coincidence to me. When they’re in the minority in both countries",
                              "timestamp": "2021-12-15 17:34:25",
                              "score": 1,
                              "num_children": 0,
                              "author": 381866,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "homupkm",
                  "text": "That surprises me as every Korean I've met is openly/noticably Christian.",
                  "timestamp": "2021-12-15 11:57:06",
                  "score": 64,
                  "num_children": 4,
                  "author": 160813,
                  "replies": [
                    {
                      "id": "hon00zu",
                      "text": "Koreans in the US are overwhelmingly Christian. A big reason is because it offers the social aspect of being around other Koreans, not so much because they’re really religious.",
                      "timestamp": "2021-12-15 12:52:35",
                      "score": 80,
                      "num_children": 1,
                      "author": 157578,
                      "replies": [
                        {
                          "id": "hon7mro",
                          "text": "It's unfortunate that there doesn't seem to be enough [obligatory] social opportunity outside of religious gathering for so many (Korean-American or not). It's our instinct to want to stay home, but dragging your ass to church is often good for a person in the specific way of social interaction and support. There ought to be something else more productive to fill that vacuum, and I worry/wonder if political tribalism may be slowly filling that gap.",
                          "timestamp": "2021-12-15 13:59:23",
                          "score": 32,
                          "num_children": 3,
                          "author": 399716,
                          "replies": [
                            {
                              "id": "hon8c30",
                              "text": "Friday Night Magic?",
                              "timestamp": "2021-12-15 14:05:09",
                              "score": 18,
                              "num_children": 2,
                              "author": 376805,
                              "replies": [
                                {
                                  "id": "hon9b8z",
                                  "text": "Ha! Well, board game night in general sounds fucking awesome. So many great games, so many zero friends to play them with.",
                                  "timestamp": "2021-12-15 14:12:55",
                                  "score": 11,
                                  "num_children": 1,
                                  "author": 399716,
                                  "replies": [
                                    {
                                      "id": "hona88m",
                                      "text": "If you have a FLGS (friendly local gaming store), they usually have community nights, FNM, organized play for D&D and Pathfinder. Warhorn is a good resource for finding online games. Lots of board game and RPG streamers and podcasters have communities chock full of people looking for groups to play with.\n\nDefinitely don't need god to have a good time!",
                                      "timestamp": "2021-12-15 14:20:03",
                                      "score": 5,
                                      "num_children": 0,
                                      "author": 376805,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "honi5h5",
                                  "text": "FNM has been my primary source of socialization for the last decade.",
                                  "timestamp": "2021-12-15 15:18:14",
                                  "score": 7,
                                  "num_children": 0,
                                  "author": 294937,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "honxh8m",
                              "text": "There is always your local Ethical Union society meeting. In DC it's called the Washington Ethical Society. This is from their website and sounds a lot like church without god to me, right up to the cookies after the service.   \n\n\nFrom their website. \n\nEthical Societies meet regularly on Sundays for gatherings we refer to as Platforms (also known as Sunday Meetings, Sunday Program, or Platform Services). Platforms usually consist of a welcoming by a member, music, and a talk by an Ethical Culture Leader, invited guest, or layperson. These gatherings are intended to educate, stimulate personal growth, inspire reflection and action, and build a sense of community. They may also include a moment of silence, a reading of a story or quotation, a Q&A with the speaker, and time to greet each other. Themes range from ethical teachings (Ethical Culture history and philosophy) to ethical action issues (environmentalism, human rights, and social justice), to personal stories (journeys, passions, and talents). Platforms are free, open to the public, and tend to be followed by refreshments and an opportunity to socialize.",
                              "timestamp": "2021-12-15 16:59:10",
                              "score": 4,
                              "num_children": 0,
                              "author": 236736,
                              "replies": []
                            },
                            {
                              "id": "honysxo",
                              "text": "Reminds me of smoking breaks.   Smokers took way more breaks and always gathered around chatting and smoking.  As a non smoker I was jealous.\n\nAs smoking near doors mostly died down so did social smoking.  And since smoking breaks were never official breaks died too.   Social smoking I'm sure exists but it's replacement is sitting in a break room drinking coffee by yourself or eating a snack while surfing reddit and YouTube.",
                              "timestamp": "2021-12-15 17:07:47",
                              "score": 1,
                              "num_children": 0,
                              "author": 379902,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "homxs0q",
                      "text": "Often times foreigners in america become christian to fit in",
                      "timestamp": "2021-12-15 12:30:05",
                      "score": 18,
                      "num_children": 0,
                      "author": 288469,
                      "replies": []
                    },
                    {
                      "id": "homyily",
                      "text": "There is a Korean Catholic Church near where I live (US). I was walking my dog past it one day and what looked like at least a hundred people were leaving after the services. I was shocked, didn’t know that was a thing.",
                      "timestamp": "2021-12-15 12:37:34",
                      "score": 8,
                      "num_children": 1,
                      "author": 273890,
                      "replies": [
                        {
                          "id": "hoq995s",
                          "text": "I've met many Korean folks.\n\nIt's a social thing for them in the US.",
                          "timestamp": "2021-12-16 02:29:29",
                          "score": 2,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "homxbjg",
                      "text": "Its the circle you are involved in.",
                      "timestamp": "2021-12-15 12:25:20",
                      "score": 14,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hon4pbb",
                  "text": "I didn't realize it was that extensive...I thought that Christianity as an anti-communist ideology. I had thought it was a mixture of emperor worship (carried on still in NPRK though officially atheist) and Confucian thought before?\n\nGood to know that the christian influence is waning fast.",
                  "timestamp": "2021-12-15 13:35:02",
                  "score": 2,
                  "num_children": 0,
                  "author": 357568,
                  "replies": []
                },
                {
                  "id": "honas1k",
                  "text": "Wait, what?  70% of people in S. Korea no longer go to church???\n\nThat's a huge win!!!",
                  "timestamp": "2021-12-15 14:24:15",
                  "score": 2,
                  "num_children": 0,
                  "author": 308579,
                  "replies": []
                },
                {
                  "id": "honfan9",
                  "text": "Are they straight up atheist? Or just believe in some vague notions of ancestor worship and eastern religion?",
                  "timestamp": "2021-12-15 14:57:53",
                  "score": 2,
                  "num_children": 1,
                  "author": 89568,
                  "replies": [
                    {
                      "id": "honj0uu",
                      "text": "Most of my Korean friends, simply don't care about religion at all.",
                      "timestamp": "2021-12-15 15:24:14",
                      "score": 3,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "honjjsx",
                          "text": "Fair enough.",
                          "timestamp": "2021-12-15 15:27:49",
                          "score": 2,
                          "num_children": 0,
                          "author": 89568,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "honffm8",
                  "text": "Do a wiki rabbit hole of South Korean cult churches. Some really wild stuff. \n\nhttps://en.wikipedia.org/wiki/Shincheonji_Church_of_Jesus",
                  "timestamp": "2021-12-15 14:58:52",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "honiz5w",
                      "text": "O yea we got our crazies",
                      "timestamp": "2021-12-15 15:23:55",
                      "score": 3,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "honj8qc",
                          "text": "미쳤어?? 와~~~~~",
                          "timestamp": "2021-12-15 15:25:44",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hony128",
                  "text": "Really?  I've always thought of Koreans as being strong Christian.  Like guaranteed to have a Jesus picture in their bathroom.  And they all attend the same Korean church 3 times a week. \n\nMaybe that's just American Koreans.",
                  "timestamp": "2021-12-15 17:02:43",
                  "score": 1,
                  "num_children": 0,
                  "author": 379902,
                  "replies": []
                },
                {
                  "id": "hoohjb6",
                  "text": "There are some mega churches full of Koreans in the U.S. Northwest.",
                  "timestamp": "2021-12-15 19:08:10",
                  "score": 1,
                  "num_children": 0,
                  "author": 138355,
                  "replies": []
                }
              ]
            },
            {
              "id": "homzfyd",
              "text": "If I remember correctly, Germany's religiosity is split very starkly along the east/west line. East Germany has very little belief in religion, while west is comparable to the rest of western Europe.",
              "timestamp": "2021-12-15 12:46:52",
              "score": 15,
              "num_children": 2,
              "author": 138764,
              "replies": [
                {
                  "id": "homzrsw",
                  "text": "East Germany only has ~1/8 of the German population. They are way less religious that’s true but the rest of Germany is the driver of the leavings, as there are nearly no people left in the churches in the east that can leave. West Germany is becoming less religious in an amazing pace.",
                  "timestamp": "2021-12-15 12:50:03",
                  "score": 14,
                  "num_children": 1,
                  "author": 190414,
                  "replies": [
                    {
                      "id": "hon26ti",
                      "text": "Ah, entirely fair. I suppose I've only seen it per capita before, which would naturally omit the differences in population density.",
                      "timestamp": "2021-12-15 13:12:51",
                      "score": 3,
                      "num_children": 0,
                      "author": 138764,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hon65o6",
                  "text": "East is more nationalist conservative. South more Christian conservative.",
                  "timestamp": "2021-12-15 13:47:20",
                  "score": 1,
                  "num_children": 0,
                  "author": 183964,
                  "replies": []
                }
              ]
            },
            {
              "id": "homy1jl",
              "text": "At 51% your society will breakdown. It will just be a daily Purge event. /s",
              "timestamp": "2021-12-15 12:32:48",
              "score": 12,
              "num_children": 2,
              "author": 273890,
              "replies": [
                {
                  "id": "hondtm0",
                  "text": "And everyone will be gay but also getting pregnant just for the sake of having an abortion because they love murdering children! And don’t forget about the inevitable communist nazis taking power and enslaving the god-fearing, red-blooded Americans (in Germany)!",
                  "timestamp": "2021-12-15 14:47:06",
                  "score": 11,
                  "num_children": 1,
                  "author": 142221,
                  "replies": [
                    {
                      "id": "hopzmf4",
                      "text": "I can't wait to eat baby bbq",
                      "timestamp": "2021-12-16 01:18:04",
                      "score": 3,
                      "num_children": 1,
                      "author": 214141,
                      "replies": [
                        {
                          "id": "hoqrgqz",
                          "text": "I'll fire up the pit",
                          "timestamp": "2021-12-16 04:53:23",
                          "score": 1,
                          "num_children": 0,
                          "author": 3096,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "honbg3j",
                  "text": "Sweet!  Breaknit down an rebuild new. This system aint working",
                  "timestamp": "2021-12-15 14:29:16",
                  "score": 2,
                  "num_children": 0,
                  "author": 327398,
                  "replies": []
                }
              ]
            },
            {
              "id": "homorsy",
              "text": "To lazy to leave? What? You just, stop going...",
              "timestamp": "2021-12-15 10:42:03",
              "score": 20,
              "num_children": 3,
              "author": 197585,
              "replies": [
                {
                  "id": "homp5hm",
                  "text": "'officially,' as in still members on the church's books even if they haven't attended in years...",
                  "timestamp": "2021-12-15 10:47:20",
                  "score": 48,
                  "num_children": 0,
                  "author": 272296,
                  "replies": []
                },
                {
                  "id": "hompz0o",
                  "text": "Officially leaving the church is a bit of a bureaucratic process in Germany (shocking, I know). You also have to pay dumb ass church taxes here if you're still registered.",
                  "timestamp": "2021-12-15 10:58:32",
                  "score": 37,
                  "num_children": 2,
                  "author": 264839,
                  "replies": [
                    {
                      "id": "homqrie",
                      "text": "Wait so you have to pay to be a part of a church? I feel like that would be an incentive to NOT be religious. Though I guess it's the same as paying to be a part of a club or organization or something.",
                      "timestamp": "2021-12-15 11:08:59",
                      "score": 24,
                      "num_children": 1,
                      "author": 197585,
                      "replies": [
                        {
                          "id": "homtw5z",
                          "text": "Well it works like this:\n\nWhen you get baptized as a little baby, you enter the church. \n\nThat means 9 percent (8 in bavaria) of the wage tax gets added to your salary statement. \n\nIf you wann leave church (and not pay that anymore)  you have to go to the registry office. Costs around 35 euros once. \n\nBecause until 2000 practially everyone was baptized the rate is still 50 percent. But it will get way lower. Milenials and first zoomers are the one giving birth now and those mostly wont baptize their kids.\n\n\nEdit: quit church last month. This months pay check will be the first without church tax. Im saving around 900 Euros per year now.",
                          "timestamp": "2021-12-15 11:47:40",
                          "score": 34,
                          "num_children": 3,
                          "author": 74371,
                          "replies": [
                            {
                              "id": "homue4b",
                              "text": "Directly taxing people to practice their faith is like so many levels of wrong, and I’m not even religious. America has a lot of problems, but at least that isn’t one of them.",
                              "timestamp": "2021-12-15 11:53:25",
                              "score": 19,
                              "num_children": 8,
                              "author": 179781,
                              "replies": [
                                {
                                  "id": "homuwrc",
                                  "text": "Yeah it sucks. But atleast everyone can just leave whenever they want. And you can still go to any church. Doesnt matter if you are part of it or not.\n\n\nThe good thing though. The church atleast gets some stuff done here with the money. They help people and the community. Normal priests and the churches are not rich or anything. Just normal middleclass people",
                                  "timestamp": "2021-12-15 11:59:26",
                                  "score": 9,
                                  "num_children": 1,
                                  "author": 74371,
                                  "replies": [
                                    {
                                      "id": "homvtnk",
                                      "text": "Do you know if the churches have to share their bookkeeping with the government or some kind of third party to make sure they are using the church tax funds appropriately?",
                                      "timestamp": "2021-12-15 12:09:31",
                                      "score": 9,
                                      "num_children": 1,
                                      "author": 145620,
                                      "replies": [
                                        {
                                          "id": "homx46n",
                                          "text": "I think it's shared yeah. Most of it goes to the communities. They pay all their workers, church service, pastoral care, senior work anf such.\n\n\nThe next biggest part goes to Kindergartens, schools etc. The church help out with a lot of that. Priests often teach Religion at elementary schools for example. Also some money to maintain museums and such. Also, anybody here can join Christian Kindergartens and schools, doesnt even matter if they are Christian or not.\n\n\nThen a small part goes into social stuff, helping the poor and the ill.\n\n\nAnd well, around 10 percent goes into administration i think.\n\n\n\nEdit: oh. Kinda didnt answer your question. The protestant church is usually very transparent. The catholic not so much.  However, because of Tebartz van Elst, catholic rich bishop, more and more catholic bishops and priests are way more transparent now",
                                          "timestamp": "2021-12-15 12:23:15",
                                          "score": 9,
                                          "num_children": 1,
                                          "author": 74371,
                                          "replies": [
                                            {
                                              "id": "homxzro",
                                              "text": "In the states the churches are treated like non profit organizations. Donations to the church are tax deductible and churches pay no income taxes. \n\nHowever, unlike most other non profit organizations, they don't have to show how they spend their money. \n\nHere we have televangelist preachers who drive sports cars, live in mansions and fly around in private jets while conning poor people into sending them their money under the guise of \"prosperity gospel\" basically by giving them money it is a seed for god to bring them more good will. It's a crock of shit that makes me feel sorry for the poor saps who fall for it and makes me want to harm these evil fucks. \n\nCreflo Dollar [needs plane](https://youtu.be/uGOEt1PCWio)\n\nPaula White (was trumps spiritual advisor)\n\nJoel Osteen",
                                              "timestamp": "2021-12-15 12:32:19",
                                              "score": 5,
                                              "num_children": 1,
                                              "author": 145620,
                                              "replies": [
                                                {
                                                  "id": "honttyg",
                                                  "text": "That's ***exactly*** what I've addressed in my other thread.\n\n[Churches & Religious Leaders exist for a few purposes: To keep people indoctrinated through fear, control & manipulation, & to continue to grift from them using \"Tithes & Offerings\" by \"Giving back to God.\"](https://www.reddit.com/r/atheism/comments/regp1j/churches_religious_leaders_exist_for_a_few/)",
                                                  "timestamp": "2021-12-15 16:35:14",
                                                  "score": 3,
                                                  "num_children": 0,
                                                  "author": 200819,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "honbcl6",
                                  "text": "It is actually incredible as a tool against religion. The worst part is that normally the scam money they get is tied to attendance, stupidity, craziness and peer pressure. \n\nThe moment you pay it through something like taxes nobody will care. Everyone pays relatively the same amount that is based on how much they have to give and it seems fair. \n\nThe pastor/priest has no reason to make his followers stupider, crazier or turn his church into something as close as possible to a cult (in the religious righteous view that it is something different from religion). Then you simply wait a few decades and priests and pastors stay the same leeches on society they always were but they don't even have to do more than a token amount of work for it anymore. And everyone is happy while the churches destroy themselves. At some point they get too weak and the natural scandals like nun run child prostitution rings become public and you can actually get rid of them completely. \n\nAnd the best part is they do it themselves. Because their scum rises to the top their leaderships are people that are unwilling to sacrifice their money and instead of shrinking the useless overhead they will rather save money at the lowest level and close local churches to save money. Which will make it obviously worse and so the idiots on their thrones will still be mostly happy while they close the last church. Let's hope they don't wake up enough to change it before then.",
                                  "timestamp": "2021-12-15 14:28:32",
                                  "score": 4,
                                  "num_children": 0,
                                  "author": 45861,
                                  "replies": []
                                },
                                {
                                  "id": "hon9hvp",
                                  "text": "I used to feel the same way about Germany (Austria is the same) but religion has always been a business.\n\nThen I realized they are providing a direct financial incentive to leave religion, so now I support it.",
                                  "timestamp": "2021-12-15 14:14:21",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 397227,
                                  "replies": [
                                    {
                                      "id": "honby6r",
                                      "text": "The direct financial incentive is always there. Churches are always expensive and need massive support from the followers. The only difference is that normally you have peer pressure to keep people from not donating to the church. \n\nIn Germany/Austria you can just leave without any real effect other than saving money. Most likely even if you go to church.",
                                      "timestamp": "2021-12-15 14:33:07",
                                      "score": 5,
                                      "num_children": 1,
                                      "author": 45861,
                                      "replies": [
                                        {
                                          "id": "hoore26",
                                          "text": "By direct financial incentive, in Germany and Austria they will prosecute you for \"tax evasion\" if you are a member and don't pay the tax.",
                                          "timestamp": "2021-12-15 20:11:03",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 397227,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "hons44b",
                                  "text": "That a lot of Europe does this is part of the reason they don't have the absolute batshit fucking *insanity* in religion that the US does. It sucks to be taxed and paying the church automatically, but it's very much a pick your poison situation.",
                                  "timestamp": "2021-12-15 16:23:49",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 65151,
                                  "replies": []
                                },
                                {
                                  "id": "homyy73",
                                  "text": "How has this not been adopted in America? The most greedy country on earth seems to have missed this \"oppertunity\" to flece its citizens for more money. I know church and state are separate on paper, but are they really?",
                                  "timestamp": "2021-12-15 12:41:57",
                                  "score": 0,
                                  "num_children": 2,
                                  "author": 393797,
                                  "replies": [
                                    {
                                      "id": "hon86qg",
                                      "text": "Only someone with sub-zero levels of knowledge of American politics would be surprised that Americans don't want to pay taxes of any kind.\n\nWhy is there no church tax? Because it's a fucking *tax* lmao",
                                      "timestamp": "2021-12-15 14:03:55",
                                      "score": 4,
                                      "num_children": 0,
                                      "author": 374702,
                                      "replies": []
                                    },
                                    {
                                      "id": "honc8ow",
                                      "text": "Because you need big churches for it. And Germany (and europe in general) had the history of the catholic church simply taxing everyone 10% in the past. The current system is a way lower tax (usually below 2% of your overall income) than they had in the past.",
                                      "timestamp": "2021-12-15 14:35:17",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 45861,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "homx0oi",
                                  "text": "Actually, in America, this: https://ajo.prod.reuters.tv/api/v2/img/5efb76c3e4b09631f6472e3a-1593538427153?width=640&location=LANDSCAPE&videoId=OVCKKIACF. It is now.",
                                  "timestamp": "2021-12-15 12:22:13",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 381866,
                                  "replies": []
                                },
                                {
                                  "id": "honcz0l",
                                  "text": "To the contrary! If you have stupid thoughts, at least pay for them. I'm all for such a tax. Make it 59% of the income. Isn't it better then when churches do not pay taxes at all?",
                                  "timestamp": "2021-12-15 14:40:47",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 116058,
                                  "replies": []
                                },
                                {
                                  "id": "hopck1b",
                                  "text": "No, we just hand money to churches without collecting it from parishioners first. Have a look at how much PPP money your local churches got.",
                                  "timestamp": "2021-12-15 22:29:00",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 283155,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "homwnlh",
                              "text": "Bravo",
                              "timestamp": "2021-12-15 12:18:29",
                              "score": 1,
                              "num_children": 0,
                              "author": 381866,
                              "replies": []
                            },
                            {
                              "id": "hon6atb",
                              "text": "Holy shit. You only did this now?",
                              "timestamp": "2021-12-15 13:48:30",
                              "score": 1,
                              "num_children": 1,
                              "author": 183964,
                              "replies": [
                                {
                                  "id": "honicxe",
                                  "text": "Only work since a year. Before i was at university and got all taxes back anyway for the small jobs i did beside university",
                                  "timestamp": "2021-12-15 15:19:42",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 74371,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "homqm0v",
                      "text": "Austria too.\n\nIm still paying since my family is religios and wants me to be too.",
                      "timestamp": "2021-12-15 11:06:59",
                      "score": 8,
                      "num_children": 1,
                      "author": 204110,
                      "replies": [
                        {
                          "id": "homw3tu",
                          "text": "Can't you leave without them knowing?",
                          "timestamp": "2021-12-15 12:12:36",
                          "score": 4,
                          "num_children": 0,
                          "author": 345409,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "homu9kt",
                  "text": "That's too much work.",
                  "timestamp": "2021-12-15 11:51:57",
                  "score": 1,
                  "num_children": 0,
                  "author": 234696,
                  "replies": []
                }
              ]
            },
            {
              "id": "homtdtv",
              "text": "Islam is going to spread in germany. I think by 2040 30% of Germany will be muslim.",
              "timestamp": "2021-12-15 11:41:40",
              "score": -14,
              "num_children": 3,
              "author": 11914,
              "replies": [
                {
                  "id": "homvp1q",
                  "text": "Islam will eventually go the same way as Christianity. There well may be 30% of the population born into a Muslim family but fewer will actually believe in it.",
                  "timestamp": "2021-12-15 12:08:07",
                  "score": 8,
                  "num_children": 1,
                  "author": 238561,
                  "replies": [
                    {
                      "id": "homvsdp",
                      "text": "Wrong",
                      "timestamp": "2021-12-15 12:09:07",
                      "score": -15,
                      "num_children": 1,
                      "author": 11914,
                      "replies": [
                        {
                          "id": "homyei6",
                          "text": "You're right.  I should have written fewer and fewer.",
                          "timestamp": "2021-12-15 12:36:25",
                          "score": 11,
                          "num_children": 1,
                          "author": 238561,
                          "replies": [
                            {
                              "id": "homyxjg",
                              "text": "Yes 30% is way too much. The problem is that Islam supports honor killing and the structure is designed like that so its very easy to spread.",
                              "timestamp": "2021-12-15 12:41:46",
                              "score": -9,
                              "num_children": 1,
                              "author": 11914,
                              "replies": [
                                {
                                  "id": "hondso1",
                                  "text": "You have been suckered in by talking points from reactionary political ideologues. Hope you get out soon!",
                                  "timestamp": "2021-12-15 14:46:55",
                                  "score": 5,
                                  "num_children": 1,
                                  "author": 115789,
                                  "replies": [
                                    {
                                      "id": "honej33",
                                      "text": "I am going to move out of Germany soon either way. Muslims are unbearable.",
                                      "timestamp": "2021-12-15 14:52:17",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 11914,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "homuz9d",
                  "text": "I expect similar in the UK. They seem to be the only religious ones left.",
                  "timestamp": "2021-12-15 12:00:14",
                  "score": 4,
                  "num_children": 2,
                  "author": 160813,
                  "replies": [
                    {
                      "id": "hon6xo0",
                      "text": "We are not.",
                      "timestamp": "2021-12-15 13:53:40",
                      "score": 1,
                      "num_children": 0,
                      "author": 17095,
                      "replies": []
                    },
                    {
                      "id": "homvbck",
                      "text": "Exactly. Also France, Sweden, Netherlands.",
                      "timestamp": "2021-12-15 12:03:55",
                      "score": -1,
                      "num_children": 0,
                      "author": 11914,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "homvp5k",
                  "text": "Doesn’t make sense. If someone becomes atheist why would they join Islam?",
                  "timestamp": "2021-12-15 12:08:09",
                  "score": 1,
                  "num_children": 1,
                  "author": 276705,
                  "replies": [
                    {
                      "id": "homvz1m",
                      "text": "I dont talk about the atheist. The muslims spread more than any other. By 2040 there will probably be 50% Atheism, 30% Islam, 10% Christianity, 10% others.",
                      "timestamp": "2021-12-15 12:11:08",
                      "score": -1,
                      "num_children": 1,
                      "author": 11914,
                      "replies": [
                        {
                          "id": "hon4yqs",
                          "text": "Citation needed.",
                          "timestamp": "2021-12-15 13:37:14",
                          "score": 5,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hong7jy",
              "text": "Germany tales church taxes from citizens who declare themselves as Christian. So I'd take Germany's numbers with a pinch of salt",
              "timestamp": "2021-12-15 15:04:26",
              "score": 1,
              "num_children": 0,
              "author": 235703,
              "replies": []
            },
            {
              "id": "honlrxr",
              "text": "Aren't people taxed in Germany based on their \"chosen\" church? Isn't it thus advantageous for the non-religious to declare that status, so they take home more pay?",
              "timestamp": "2021-12-15 15:42:35",
              "score": 1,
              "num_children": 0,
              "author": 339640,
              "replies": []
            }
          ]
        },
        {
          "id": "hominad",
          "text": "[deleted]",
          "timestamp": "2021-12-15 09:15:01",
          "score": 137,
          "num_children": 3,
          "replies": [
            {
              "id": "hooldxf",
              "text": "Especially imaginary friends that get involved in law making.",
              "timestamp": "2021-12-15 19:32:44",
              "score": 23,
              "num_children": 0,
              "author": 33272,
              "replies": []
            },
            {
              "id": "hoop82a",
              "text": "Oh get over yourself, let me live my life. Let me enjoy my imagination, you don't have to play along.",
              "timestamp": "2021-12-15 19:57:04",
              "score": -2,
              "num_children": 1,
              "author": 103116,
              "replies": [
                {
                  "id": "hoqfgip",
                  "text": "[deleted]",
                  "timestamp": "2021-12-16 03:15:24",
                  "score": 0,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hoqp7n4",
                      "text": "No the fuck I don't. My imaginary friend is named Bob and you've never met him. To be fair, you have zero control over Bob because he is my imaginary friend, but likewise Bob has no control over you. You don't have to be such a dick about it.",
                      "timestamp": "2021-12-16 04:33:38",
                      "score": 1,
                      "num_children": 0,
                      "author": 103116,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hoom5i9",
              "text": "[One of my favorite lines from the show Moone Boy](https://coub.com/view/4nt9c)",
              "timestamp": "2021-12-15 19:37:37",
              "score": 1,
              "num_children": 0,
              "author": 254072,
              "replies": []
            }
          ]
        },
        {
          "id": "holu445",
          "text": "Let’s go",
          "timestamp": "2021-12-15 04:35:35",
          "score": 68,
          "num_children": 1,
          "author": 396073,
          "replies": [
            {
              "id": "honfhwp",
              "text": "... Brandon? /s",
              "timestamp": "2021-12-15 14:59:20",
              "score": 6,
              "num_children": 0,
              "author": 131125,
              "replies": []
            }
          ]
        },
        {
          "id": "honj5f6",
          "text": "I heard in an interview with neil degrasse Tyson I think, that this down tick in religiosity is not accompanied by more rationality, it results in an equal uptick of other irrational beliefs like crystal healing, paganism, alternative medicines etc.\n\nI think there are just too many pressures and the cognitive cost of cognitive thinking  is high(most thinking and knowledge seems to come from people's social networks not their own experience and first hand knowledge which has good and bad aspects ).\n\n The best hope is to socialize critical thinking, but that takes effort and money spent on education.",
          "timestamp": "2021-12-15 15:25:06",
          "score": 12,
          "num_children": 2,
          "author": 340507,
          "replies": [
            {
              "id": "honno0z",
              "text": "Yes the collective intelligence may not be increasing per se but one hill at a time. Education will certainly be crucial in the battle for higher critical thinking.",
              "timestamp": "2021-12-15 15:54:46",
              "score": 7,
              "num_children": 1,
              "author": 194718,
              "replies": [
                {
                  "id": "honw1g1",
                  "text": "It is arguable that organized religiosity is more virulent(then other forms of irrational thinking) and therefore dangerous in it's ability to transmit false or harmful information and resist inoculation, because it is usually a core part of someone's identity  and community and gives false comfort by claiming to provide answers to really hard or impossible questions and in some cases threatens eternal suffering if denied.. Being part of those communities, it's very hard to break away from that support of family friends and even coworkers. \n\nIt's also arguable that social media networks  and it's ability to transmit  general misinformation like conspiracy theories and various irrational beliefs are just as much a threat even with if you got rid of the major religions. \n\n\nI kind of agree with the theories that religion evolved to fit the need of systems of trust outside one's tribes(and even as a test of that trust within the tribe) to allow greater institutions beyond what humans had grown to socialize with (150 or so) in defining in and outgroups. \n\nI don't think it's reasonable to expect humans to ever be complete  rational actors, but we can hope to strike a healthy  balance on how we behave when we lack information :)",
                  "timestamp": "2021-12-15 16:49:44",
                  "score": 4,
                  "num_children": 1,
                  "author": 340507,
                  "replies": [
                    {
                      "id": "honyzt7",
                      "text": "I agree.  \n\n&#x200B;\n\nCheers",
                      "timestamp": "2021-12-15 17:09:02",
                      "score": 1,
                      "num_children": 0,
                      "author": 194718,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hoopx10",
              "text": "Ehh I think people are kind of programmed for this kind of thinking, and it's tough to throw off the shackles all at once. \n\nAlso, the pagans and crystal idiots have no political power and aren't trying to fuck us at every turn.",
              "timestamp": "2021-12-15 20:01:31",
              "score": 2,
              "num_children": 1,
              "author": 204680,
              "replies": [
                {
                  "id": "hoovzm8",
                  "text": "Absolutely the evolution of this type of thinking has worked good enough for ages for survival and economy of expensive cognitive functions. \n\nAlthough they do not currently  have political power of say the Christian nationalists, they can be exploited and be used politically in similar manners. Taking power of religion out of politics doesn't mean that politics won't exploit others when they can.\n\nBut that's a problem to.worry about after you worry about things like the us christian nationalists:)",
                  "timestamp": "2021-12-15 20:40:36",
                  "score": 1,
                  "num_children": 0,
                  "author": 340507,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hombubw",
          "text": "I'm fine with 99.9999%",
          "timestamp": "2021-12-15 07:42:41",
          "score": 29,
          "num_children": 3,
          "author": 334198,
          "replies": [
            {
              "id": "homcaxe",
              "text": "Imagine if this happens, the religious ones would have all the stigma atheists have rn lmao",
              "timestamp": "2021-12-15 07:48:39",
              "score": 29,
              "num_children": 4,
              "author": 55380,
              "replies": [
                {
                  "id": "homn2w5",
                  "text": "isn't it the first time in all humanity history that atheism is so big in so many communities ?",
                  "timestamp": "2021-12-15 10:18:31",
                  "score": 12,
                  "num_children": 1,
                  "author": 284332,
                  "replies": [
                    {
                      "id": "honawrw",
                      "text": "Yes.",
                      "timestamp": "2021-12-15 14:25:15",
                      "score": 4,
                      "num_children": 0,
                      "author": 308579,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "homwdak",
                  "text": "I think it will eventually be like astrology.  People still believe in that but it's considered unimportant and harmless and you don't get people pushing it on rational members of society.",
                  "timestamp": "2021-12-15 12:15:24",
                  "score": 8,
                  "num_children": 0,
                  "author": 238561,
                  "replies": []
                },
                {
                  "id": "homeeyt",
                  "text": "Welcome to Sweden. \n\nSadly the amount religious fruit cakes has increased because of the huge influx of immigrants the past 5 or so years.",
                  "timestamp": "2021-12-15 08:16:31",
                  "score": 37,
                  "num_children": 1,
                  "author": 146047,
                  "replies": [
                    {
                      "id": "honavr7",
                      "text": "omg, that's awful.",
                      "timestamp": "2021-12-15 14:25:02",
                      "score": 3,
                      "num_children": 1,
                      "author": 308579,
                      "replies": [
                        {
                          "id": "honhw9p",
                          "text": "It sure is but we’re still around 90% atheists or aGnOsTic.",
                          "timestamp": "2021-12-15 15:16:26",
                          "score": 4,
                          "num_children": 0,
                          "author": 146047,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "homtb5h",
                  "text": "There would be about 350 of them in the entire country.\n\nThere wouldn't be any stigma, because they would be insignificant to the point of invisibility...",
                  "timestamp": "2021-12-15 11:40:47",
                  "score": 2,
                  "num_children": 0,
                  "author": 406431,
                  "replies": []
                }
              ]
            },
            {
              "id": "homkuuy",
              "text": "In the wise words of my parents: \"100% is always acceptable\"",
              "timestamp": "2021-12-15 09:46:47",
              "score": 4,
              "num_children": 0,
              "author": 275604,
              "replies": []
            },
            {
              "id": "hony31l",
              "text": "I'll be happy with 51%",
              "timestamp": "2021-12-15 17:03:05",
              "score": 1,
              "num_children": 1,
              "author": 18688,
              "replies": [
                {
                  "id": "hookdmp",
                  "text": "51? Why such a low number?",
                  "timestamp": "2021-12-15 19:26:15",
                  "score": 1,
                  "num_children": 1,
                  "author": 334198,
                  "replies": [
                    {
                      "id": "hop0g6i",
                      "text": "simple majority  \nstill a lofty (yet obtainable) goal",
                      "timestamp": "2021-12-15 21:09:33",
                      "score": 1,
                      "num_children": 1,
                      "author": 18688,
                      "replies": [
                        {
                          "id": "hosv4cn",
                          "text": "I think we can achieve much more than that. Some countries have a 75% atheist population.",
                          "timestamp": "2021-12-16 17:06:44",
                          "score": 1,
                          "num_children": 0,
                          "author": 334198,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hones9i",
          "text": "Pretty cool until you realize some of these nones fall into conspiracy bullshit and all manner of nonsense. Abrahamic religions are done, as Nietzsche said, but not everyone is going to replace that with a healthy worldview.",
          "timestamp": "2021-12-15 14:54:08",
          "score": 5,
          "num_children": 1,
          "author": 89568,
          "replies": [
            {
              "id": "honotjc",
              "text": "I agree but we can take some solace that the organized and established mind mush of religion is a good place to see change.  As others have said, education will be paramount but we may never see purely critical thinking underpin all that we do and think. Part of being human is being imperfect. We just need to work on making that imperfection a beast we keep have a grasp on.  I saw it in the flat earth movement that seems to have had popularity but is now levelled out some and yes, likely replace by the likes of QAnon etc.",
              "timestamp": "2021-12-15 16:02:10",
              "score": 1,
              "num_children": 0,
              "author": 194718,
              "replies": []
            }
          ]
        },
        {
          "id": "homjfnm",
          "text": "To the moon?",
          "timestamp": "2021-12-15 09:26:13",
          "score": 4,
          "num_children": 0,
          "author": 77556,
          "replies": []
        },
        {
          "id": "homx5a1",
          "text": "There's nothing wrong with religions which bother no one and are harmless. Personal practice and family tradition types, for example. Paganism would be a big one.",
          "timestamp": "2021-12-15 12:23:34",
          "score": 7,
          "num_children": 4,
          "author": 398967,
          "replies": [
            {
              "id": "honchnv",
              "text": "My problem with religion - any religion - is that it fosters and encourages irrational thought.  That's not to say that all atheists are Vulcan-like in their unshakable logic, but if someone chooses to believe one thing that has no rational or objective basis in reality, it becomes very easy for them to believe other irrational things as well.  And while the first thing might be harmless as you say, the others may not, such as denying the impact humans have on the environment or believing that vaccines cause autism or are a part of some nefarious government plot.",
              "timestamp": "2021-12-15 14:37:09",
              "score": 19,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "honb33x",
              "text": "Religion doesn't want to be harmless.  It does its best to be harmful.  Even fucking yoga, you'll find \"teacher's\" preaching all kinds of anti-medicine claims.",
              "timestamp": "2021-12-15 14:26:34",
              "score": 16,
              "num_children": 3,
              "author": 308579,
              "replies": [
                {
                  "id": "honj3xs",
                  "text": "This is true, but there's going to be lots of toxic non-religious worldviews pop up to fill the vacuum. Not everyone is going to form a nuanced, rational worldview. Quite the opposite. Nietzsche warned us. Hell we're already seeing it. Plenty of the dumbass QAnon folks I know were pretty much nones (plenty were evangelicals too). This whole anti-vax weird shit had lots of nones as well. The horn rimmed glasses, granola and tattoo types I thought were all going to be cool secularists? Not quite. Whole lots of stupid anti science stuff going on there too.\n\nAnd social media has just made it worse. It's rotted people's brains and eroded trust in established institutions (like religion, but also science, government, journalism, academia, etc.). All kinds of people (religious or not) are falling for all kinds of nonsense. I wouldn't celebrate just yet.",
                  "timestamp": "2021-12-15 15:24:49",
                  "score": 4,
                  "num_children": 1,
                  "author": 89568,
                  "replies": [
                    {
                      "id": "hop6rsd",
                      "text": "That's what happens when religion relentlessly attacks education.",
                      "timestamp": "2021-12-15 21:50:14",
                      "score": 1,
                      "num_children": 0,
                      "author": 308579,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "honejgc",
                  "text": "But that’s the teachers not necessarily the religion",
                  "timestamp": "2021-12-15 14:52:21",
                  "score": 1,
                  "num_children": 1,
                  "author": 130689,
                  "replies": [
                    {
                      "id": "hop60zz",
                      "text": "People are the culture, mate.  That's how it works.",
                      "timestamp": "2021-12-15 21:45:25",
                      "score": 1,
                      "num_children": 0,
                      "author": 308579,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "honu7jj",
                  "text": "And you will find that with none religious people and with atheists. It seems that your problem is with ethics, and the tie you've drawn to theology isn't as strong as you imagine it - not is it the casual force you imagine.",
                  "timestamp": "2021-12-15 16:37:42",
                  "score": 0,
                  "num_children": 1,
                  "author": 89813,
                  "replies": [
                    {
                      "id": "hop6ipj",
                      "text": "Bad bot.",
                      "timestamp": "2021-12-15 21:48:36",
                      "score": 1,
                      "num_children": 1,
                      "author": 308579,
                      "replies": [
                        {
                          "id": "hop7tqg",
                          "text": "That doesn't sound correct.",
                          "timestamp": "2021-12-15 21:57:06",
                          "score": 1,
                          "num_children": 1,
                          "author": 89813,
                          "replies": [
                            {
                              "id": "hop89x5",
                              "text": "I disagree with your claims and see the problem as one of religion attacking education.",
                              "timestamp": "2021-12-15 22:00:02",
                              "score": 1,
                              "num_children": 1,
                              "author": 308579,
                              "replies": [
                                {
                                  "id": "hop8ola",
                                  "text": "Certainly a strange perspective. I don't find much universal truth in it. Though there is certainly some cultural truth with the path Evangelicals have taken to the American education system. \n\nThough looking around here I don't think internet athiests really have that problem sorted out.",
                                  "timestamp": "2021-12-15 22:02:45",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 89813,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hontdjk",
              "text": "No, any form of baseless adherence to religion, heath fads, political off shoots etc are reflective of dangerous thinking. While initially the practices may seem benign, the underlying lack of intellectual honesty, critical thinking and reconciliation to reality (facts) reflect a failing of eduction/higher reasoning in the individual and the greater society. If the cracks in the psyche allow for leprechauns or crystal healing etc, with time the irrationality is allowed to flourish and we are back to larger scale issues that bring threats to health, security and cohesiveness of the community.  Rational thinking should never be allowed to be set aside.",
              "timestamp": "2021-12-15 16:32:15",
              "score": 1,
              "num_children": 0,
              "author": 194718,
              "replies": []
            },
            {
              "id": "hondsss",
              "text": "These religions don’t exist unfortunately.",
              "timestamp": "2021-12-15 14:46:56",
              "score": 0,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "homra3m",
          "text": "I'm not so naive as to think that this year, 2021, somehow, is the year that humanity falls away from religion. Articles like this are just stupid clickbait.",
          "timestamp": "2021-12-15 11:15:35",
          "score": 1,
          "num_children": 2,
          "author": 232532,
          "replies": [
            {
              "id": "homzqhq",
              "text": "Anyone would be delusional to think it would happen in A YEAR...so, yeah.\n\nDecades. Yes\n\nJust up and happening one year? No.",
              "timestamp": "2021-12-15 12:49:41",
              "score": 5,
              "num_children": 0,
              "author": 101804,
              "replies": []
            },
            {
              "id": "honjeub",
              "text": "I'm not so naive to think this will lead to mass societal improvement either. I'm as critical of religions as anyone else but it's not like all these \"nones\" have suddenly formed rational, well informed world views. Plenty of them are still going to fall into conspiracies, radical political groups, anti-science ignoramuses, and snake oil spiritualism.",
              "timestamp": "2021-12-15 15:26:53",
              "score": 0,
              "num_children": 0,
              "author": 89568,
              "replies": []
            }
          ]
        },
        {
          "id": "hom6mpf",
          "text": "[removed]",
          "timestamp": "2021-12-15 06:39:32",
          "score": -59,
          "num_children": 9,
          "replies": [
            {
              "id": "hom6va9",
              "text": "I wonder what the ratio between people whose religion has stopped them from doing evil vs those whose religion has enabled them to do evil",
              "timestamp": "2021-12-15 06:42:15",
              "score": 64,
              "num_children": 3,
              "author": 390828,
              "replies": [
                {
                  "id": "homgx0g",
                  "text": "Does that encourage a dangerous epistemology of non Skeptical faith that enables one to mistake a personal atrocious idea for a divine command?",
                  "timestamp": "2021-12-15 08:50:47",
                  "score": 2,
                  "num_children": 0,
                  "author": 183806,
                  "replies": []
                },
                {
                  "id": "honjx0e",
                  "text": "First you have to unambiguously define evil, which is essentially impossible.  One person's evil is another's \"tragically necessary duty\".  No one ever believes they are the bad guy.",
                  "timestamp": "2021-12-15 15:30:17",
                  "score": 2,
                  "num_children": 0,
                  "author": 334819,
                  "replies": []
                },
                {
                  "id": "hom77oj",
                  "text": "[removed]",
                  "timestamp": "2021-12-15 06:46:11",
                  "score": -33,
                  "num_children": 5,
                  "replies": [
                    {
                      "id": "hom81gf",
                      "text": "How about instead of being scared of possible damnation in the afterlife, you be scared of actually hurting someone in the real world that we live in. I guarantee you my morals are better than most religious peoples, and that not from me being scared of anything. It’s due to me not being a cunt.",
                      "timestamp": "2021-12-15 06:55:55",
                      "score": 33,
                      "num_children": 1,
                      "author": 185266,
                      "replies": [
                        {
                          "id": "hom86j4",
                          "text": "[removed]",
                          "timestamp": "2021-12-15 06:57:36",
                          "score": -20,
                          "num_children": 2,
                          "replies": [
                            {
                              "id": "hom89kw",
                              "text": "Show me where I said anything about you being Christian?",
                              "timestamp": "2021-12-15 06:58:37",
                              "score": 25,
                              "num_children": 1,
                              "author": 185266,
                              "replies": [
                                {
                                  "id": "hom8fwv",
                                  "text": "[removed]",
                                  "timestamp": "2021-12-15 07:00:41",
                                  "score": -1,
                                  "num_children": 2,
                                  "replies": [
                                    {
                                      "id": "hom9r2r",
                                      "text": "You do realize many non Christian religions have the concept of an eternal damnation, right? Pretty much all polytheist religions have one, as do the Abrahamic religions, as does Shinto, Zoroastrianism, Sikhism, and in a way the religions believing in reincarnation do as well. So In no way was I assuming you were Christian.",
                                      "timestamp": "2021-12-15 07:16:34",
                                      "score": 20,
                                      "num_children": 1,
                                      "author": 185266,
                                      "replies": [
                                        {
                                          "id": "homc49c",
                                          "text": "Shinto does?? I thought they were peaceful, but then again, I literally have no idea what they really believe. Shouldn't have expected a big religion to be peaceful, religions tend to be big when they're good for controlling a populace.",
                                          "timestamp": "2021-12-15 07:46:18",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 334198,
                                          "replies": [
                                            {
                                              "id": "homf4gx",
                                              "text": "Wikipedia says they call it Yomi, meaning “world of darkness”. According to the Kojiki, this is where the dead go in the afterlife. Wiki also relates it more to hades than a Abrahamic version of hell.",
                                              "timestamp": "2021-12-15 08:26:08",
                                              "score": 2,
                                              "num_children": 0,
                                              "author": 185266,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "homapf1",
                                      "text": "> Who knows, but at least for me I like to know that some people have a belief system or code where if they misbehave against me they could go to hell lol.\n\nYou were the one who brought up hell, which Christians believe in. I know Jews don’t. I think Muslims do, but they might call it something else. I’m not personally aware of other religions that believe in hell.",
                                      "timestamp": "2021-12-15 07:28:16",
                                      "score": 14,
                                      "num_children": 3,
                                      "author": 160768,
                                      "replies": [
                                        {
                                          "id": "homdpof",
                                          "text": "Lol. Got em.   \n\nWhat a coward.",
                                          "timestamp": "2021-12-15 08:07:05",
                                          "score": 6,
                                          "num_children": 0,
                                          "author": 175883,
                                          "replies": []
                                        },
                                        {
                                          "id": "homfkyi",
                                          "text": "Only thing I can find that’s close to the word hell is Hel in Norse mythology, which was a land of the dead. Islam calls it jahannam which is related to the Hebrew gehinnom, which is currently described as a purgatory.",
                                          "timestamp": "2021-12-15 08:32:18",
                                          "score": 3,
                                          "num_children": 0,
                                          "author": 185266,
                                          "replies": []
                                        },
                                        {
                                          "id": "hommnnl",
                                          "text": "Islam does and it's the worse hell I ever heard of...\n\nA lot of the punishment there are described in details and the Qur'an says that women will make the majority of the population there, because Islam is very misoginist.\n\nIn fact, even Paradise sounds like hell for women where, If I remember correctly, they still serve their husbands as slave with the other 72 (sentient?) virgin (eughh) sex toys that are created for the men's enjoyment in a place where they'll naturally worship allah.\n\nAlso, even the tomb where you wait for the \"final judgement\" crushes you until your ribs are joining if you displeased god, or turns into a small apartment with a window over Jannah (the paradise) and it smells like henna which actually sounds worse than the other option to me.\n\n\nedit: Women are never mentioned having rewards in Jannah, but I looked it up and the person saying that \"Women will only have their husbands\" is an historian.\nModern islamic erudites think that women will be able to have hoor (virgin sex toy) too and that it is gender neutral except in the Qur'an, only houris are described and they're described as:\n\n\n-virgins, no man or jinn has opened their hymen, untouched by any men\n\n\n-large and beutiful eyes, wide and beautiful eyes*2, bright eyed damsel, with intensely black eyes set agaisnt the whiteness of their irises\n\n\n-thirty three year old (thank god)\n\n\n-Fairest complexion, transparent to the marrow of their bones, \"Pure\"\n\n\n-as elegant as rubies and coral\n\n\n-sheltered in pavilions, reclining on green cushions and beautiful carpets,\n \n\n-beautiful fair females, beautiful\n\n\n-created without the process of birth\n\n\n-hairless except the eyebrows and the head\n\n-and of course \"maidens with swelling breasts\"\n\n\nThe big tittied goth sex slaves are described in details in the qur'an, but there is not a single mention of the femboys in maid dresses sex slaves (which would also have been bad, like I'm not excusing the fucked up concept).\n\n\nThe excuse is that it would have shocked everyone at the time...\n\nit sounds like a lot like the same excuse every time...",
                                          "timestamp": "2021-12-15 10:12:25",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 195024,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hompjyx",
                              "text": "Well, see, if you're an atheist, that same belief system says that you're evil, stupid, and a threat to believers, and you deserve to be tortured forever. Which would mean that you're a complete fucking idiot if you think that belief system protects you in any way.",
                              "timestamp": "2021-12-15 10:52:49",
                              "score": 1,
                              "num_children": 0,
                              "author": 318636,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hom7isf",
                      "text": "You are legitimately in the wrong sub then",
                      "timestamp": "2021-12-15 06:49:46",
                      "score": 24,
                      "num_children": 1,
                      "author": 342179,
                      "replies": [
                        {
                          "id": "hom7uba",
                          "text": "[removed]",
                          "timestamp": "2021-12-15 06:53:34",
                          "score": -17,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hom8gk0",
                              "text": "I'm not avoiding something because it doesn't match what I believe. I am recognizing that someone who behaves out of a fear of punishment is not a good person who should be trusted. I want a world where people do what is right on the merits. I recognize thta is idealistic but honestly, the amount of evil that has been done in the name of a religion that is suppose to punish the wicked is proof positive that it doesn't work. Plus, a not insignificant portion of the religious believe that as long as they confess and ask for forgiveness then they aren't going to hell anyway so they can do as they please. The US prison population is famously filled with extremely religious people.",
                              "timestamp": "2021-12-15 07:00:53",
                              "score": 19,
                              "num_children": 0,
                              "author": 342179,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hom8ogv",
                      "text": "Hell isn’t real. Knowing someone is religious is no guarantee that they have good morals.",
                      "timestamp": "2021-12-15 07:03:30",
                      "score": 20,
                      "num_children": 1,
                      "author": 187294,
                      "replies": [
                        {
                          "id": "hom9505",
                          "text": "Especially because they're acting like that because of their self interest to go to heaven.",
                          "timestamp": "2021-12-15 07:09:01",
                          "score": 14,
                          "num_children": 0,
                          "author": 69855,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hombk43",
                      "text": "That hasn't stopped anyone, otherwise, we wouldn't have most criminals being religious people, or all the horrible stuff that religions have done through their story, even in times where those beliefs were quite stronger.\n\nYou are just having hope in something that is proven to not work, so.. good luck with that.",
                      "timestamp": "2021-12-15 07:38:58",
                      "score": 7,
                      "num_children": 0,
                      "author": 223173,
                      "replies": []
                    },
                    {
                      "id": "hombaws",
                      "text": "I hate knowing that some people’s belief systems inform a moral code that justifies hatred and violence toward others.",
                      "timestamp": "2021-12-15 07:35:43",
                      "score": 6,
                      "num_children": 0,
                      "author": 331527,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hom71zn",
              "text": "I would bet some peoples belief in leprechauns has prevented them from committing serious criminal acts.\n\nI would bet some peoples belief in Bigfoot has prevented them from committing serious criminal acts.\n\nI would bet some peoples belief in Pixies has prevented them from committing serious criminal acts.\n\nWe can go on all day.",
              "timestamp": "2021-12-15 06:44:23",
              "score": 16,
              "num_children": 1,
              "author": 194718,
              "replies": [
                {
                  "id": "hom7jv0",
                  "text": "[removed]",
                  "timestamp": "2021-12-15 06:50:07",
                  "score": -1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hom8k2s",
                      "text": ">and yet the objects you listed have no associated codes of ethics or consequences from breaking rules that affect other people in society.\n\n\\- As they are made up, they are on the same page as any religion.  Fake rules and fake ethics are... FAKE.\n\nActual ethics and shared morals can replace fake ones with far more efficiency and legitimacy.\n\nTo encourage adherence to a false system of morality is in itself immoral as it is dishonest. If you are talking about say a generation of current theists then fine. Past that is beyond my level of tolerance.",
                      "timestamp": "2021-12-15 07:02:03",
                      "score": 14,
                      "num_children": 0,
                      "author": 194718,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "homa8xf",
              "text": "Yeah, that's probably the reason the Scandinavian countries are basically a wasteland ravaged by atheist criminals with no fear of religious reprisal. Oh wait, they're not! If anything, religious beliefs drive people to crime, not the opposite. I mean, look at the Catholic church.",
              "timestamp": "2021-12-15 07:22:37",
              "score": 12,
              "num_children": 0,
              "author": 71357,
              "replies": []
            },
            {
              "id": "hom9h3b",
              "text": "Belief in religion has also caused horrific acts such as terrorism and honour killing. And child abuse",
              "timestamp": "2021-12-15 07:13:08",
              "score": 9,
              "num_children": 0,
              "author": 372188,
              "replies": []
            },
            {
              "id": "hom9wmd",
              "text": "I would bet that if we drew up a list of bad shit that was prevented by religion, and a list of bad shit that happened because of religion, religion is going to look pretty fucking awful. \n\nI don't think religion is a long term, or short term, solution to anything.",
              "timestamp": "2021-12-15 07:18:29",
              "score": 7,
              "num_children": 0,
              "author": 126926,
              "replies": []
            },
            {
              "id": "hombbzs",
              "text": "The jail statistics say otherwise.",
              "timestamp": "2021-12-15 07:36:06",
              "score": 5,
              "num_children": 0,
              "author": 223173,
              "replies": []
            },
            {
              "id": "hommdbo",
              "text": "This is actually a myth. For some reason people seem to think atheists are more likely to commit crime but multiple studies have proven that it really is just a myth, crime is actually more likely to be committed by people in religion with a forgiving god. Not to mention the amount of American serial killers who have hyper religious authority figures who caused much of their mental anguish (most American serial killers were made, they weren't born that way).\n\nA \"lack of morals\" has nothing to do with it everyone and their mother knows that murder is wrong. You don't need religion to have morals (in fact, if I recall (and I do) aren't many murders justified in certain religious views?). I've been an atheist my whole life (it's been pushed on me many times oddly enough by family who have all been to prison and the woman who later ended up killing my uncle) and I can honestly tell you the only crime I've committed is driving a little too fast once.",
              "timestamp": "2021-12-15 10:08:21",
              "score": 3,
              "num_children": 0,
              "author": 219550,
              "replies": []
            },
            {
              "id": "homimh8",
              "text": "On second thought, let’s just get to 51% first",
              "timestamp": "2021-12-15 09:14:41",
              "score": 1,
              "num_children": 0,
              "author": 202733,
              "replies": []
            },
            {
              "id": "homkcgd",
              "text": "Sounds like treating the symptoms, not the disease. Not a very useful long-term solution in my view. \n\nAnd what about atrocities commited in the name of religion, or committed due to perpetrators relying on the church to cover up their crimes?",
              "timestamp": "2021-12-15 09:39:25",
              "score": 1,
              "num_children": 0,
              "author": 1812,
              "replies": []
            }
          ]
        },
        {
          "id": "hoo9vsi",
          "text": "Even if they do, they at least know they are imaginary.",
          "timestamp": "2021-12-15 18:18:52",
          "score": 1,
          "num_children": 0,
          "author": 138708,
          "replies": []
        },
        {
          "id": "hookewz",
          "text": "Yeah it’s almost disheartening to see it only at 29%.  I was hoping for much higher",
          "timestamp": "2021-12-15 19:26:28",
          "score": 1,
          "num_children": 1,
          "author": 29195,
          "replies": [
            {
              "id": "hooomer",
              "text": "I think the 25%+ may mark a momentum and will pick up speed. \n\nWe can only pray!",
              "timestamp": "2021-12-15 19:53:14",
              "score": 1,
              "num_children": 1,
              "author": 194718,
              "replies": [
                {
                  "id": "houie2z",
                  "text": "Pray to whom tho?!  Lol",
                  "timestamp": "2021-12-16 23:40:12",
                  "score": 1,
                  "num_children": 1,
                  "author": 29195,
                  "replies": [
                    {
                      "id": "houmxw5",
                      "text": "It was said in jest :)",
                      "timestamp": "2021-12-17 00:14:16",
                      "score": 2,
                      "num_children": 0,
                      "author": 194718,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hoovm6g",
          "text": "That would be nice but assumes 0% stupid gullible people. Ain't happening",
          "timestamp": "2021-12-15 20:38:08",
          "score": 1,
          "num_children": 1,
          "author": 362333,
          "replies": [
            {
              "id": "hoowcxw",
              "text": "I think few here disagree. I am not assuming, rather hoping.",
              "timestamp": "2021-12-15 20:43:04",
              "score": 1,
              "num_children": 0,
              "author": 194718,
              "replies": []
            }
          ]
        },
        {
          "id": "hopc6kc",
          "text": "Keep in mind that this number is really the percent of Americans who identify as no religion and are willing to say so in a poll. I'd be shocked if it wasn't somewhat higher in reality, but of course there's no way to truly know.",
          "timestamp": "2021-12-15 22:26:25",
          "score": 1,
          "num_children": 1,
          "author": 283155,
          "replies": [
            {
              "id": "hopdng8",
              "text": "Totally agree! Plus the people on the fence, plus the cultural theists etc.",
              "timestamp": "2021-12-15 22:36:32",
              "score": 2,
              "num_children": 0,
              "author": 194718,
              "replies": []
            }
          ]
        },
        {
          "id": "homsiwg",
          "text": "100 % of North Koreans are atheists.",
          "timestamp": "2021-12-15 11:31:16",
          "score": -6,
          "num_children": 2,
          "replies": [
            {
              "id": "homt52e",
              "text": "The Kim family are viewed as deities, so I'm not so sure about that number.",
              "timestamp": "2021-12-15 11:38:45",
              "score": 8,
              "num_children": 1,
              "author": 370118,
              "replies": [
                {
                  "id": "hon1paj",
                  "text": "Eh…sort of.  That’s the official line, but defectors have consistently said pretty much no one actually believes it.  It’s just something everyone nods along with so they don’t get thrown into concentration camps.",
                  "timestamp": "2021-12-15 13:08:21",
                  "score": -2,
                  "num_children": 0,
                  "author": 167090,
                  "replies": []
                }
              ]
            },
            {
              "id": "homumj9",
              "text": "When you are supposed to worship you leader I don't think that counts.",
              "timestamp": "2021-12-15 11:56:08",
              "score": 1,
              "num_children": 0,
              "author": 184935,
              "replies": []
            }
          ]
        },
        {
          "id": "hon7wz4",
          "text": "[deleted]",
          "timestamp": "2021-12-15 14:01:42",
          "score": -2,
          "num_children": 1,
          "replies": [
            {
              "id": "honjysb",
              "text": "Why?",
              "timestamp": "2021-12-15 15:30:37",
              "score": 2,
              "num_children": 1,
              "author": 194718,
              "replies": [
                {
                  "id": "hoqau1o",
                  "text": "[deleted]",
                  "timestamp": "2021-12-16 02:41:01",
                  "score": 0,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hoqincf",
                      "text": "Well Einstein, I never said they will now did I?\n\nI did not present a proposition nor a prediction but rather hope.\n\nI suggest you revisit your grade school level comprehension. Assuming you went to school. \n\n&#x200B;\n\nWhat is a \"White thing\"?  \n\nNOTE: I am not white by any stretch of the imagination.",
                      "timestamp": "2021-12-16 03:39:34",
                      "score": 1,
                      "num_children": 0,
                      "author": 194718,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hombd2m",
      "text": "Oh wow! So that's more than the percentage of catholics. Yet 6 \"Supreme\" court justices are catholic. How the fuck is that proper representation?",
      "timestamp": "2021-12-15 07:36:29",
      "score": 348,
      "num_children": 6,
      "author": 46789,
      "replies": [
        {
          "id": "homuiwh",
          "text": "You can thank Electoral College for that.",
          "timestamp": "2021-12-15 11:54:57",
          "score": 145,
          "num_children": 3,
          "replies": [
            {
              "id": "honb6aq",
              "text": "And the Senate...",
              "timestamp": "2021-12-15 14:27:14",
              "score": 72,
              "num_children": 2,
              "author": 397168,
              "replies": [
                {
                  "id": "honte0y",
                  "text": "And the Federalist Society . . .",
                  "timestamp": "2021-12-15 16:32:20",
                  "score": 28,
                  "num_children": 1,
                  "author": 106713,
                  "replies": [
                    {
                      "id": "hoo08h0",
                      "text": "[deleted]",
                      "timestamp": "2021-12-15 17:17:07",
                      "score": 21,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "hoo0cnk",
                          "text": "And My Axe!",
                          "timestamp": "2021-12-15 17:17:52",
                          "score": 9,
                          "num_children": 0,
                          "author": 104413,
                          "replies": []
                        },
                        {
                          "id": "hor2qtu",
                          "text": "And the constitution.",
                          "timestamp": "2021-12-16 06:46:20",
                          "score": 1,
                          "num_children": 0,
                          "author": 141775,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hoo447z",
                  "text": "I am the Senate.",
                  "timestamp": "2021-12-15 17:41:51",
                  "score": 4,
                  "num_children": 1,
                  "author": 179458,
                  "replies": [
                    {
                      "id": "hoo4f8m",
                      "text": "*\\^Mitch McConnell has entered the thread*",
                      "timestamp": "2021-12-15 17:43:49",
                      "score": 2,
                      "num_children": 0,
                      "author": 397168,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "honx1xg",
              "text": "> You can thank Gerrymandering for that.\n\nFTFY",
              "timestamp": "2021-12-15 16:56:23",
              "score": 14,
              "num_children": 2,
              "author": 5750,
              "replies": [
                {
                  "id": "hoo0bpd",
                  "text": "Is there any way to get rid of gerrymandering?",
                  "timestamp": "2021-12-15 17:17:42",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hoo2bj5",
                      "text": "Yeah. It's more likely than getting rid of the electoral college. Independent organizations and ranked choice voting",
                      "timestamp": "2021-12-15 17:30:22",
                      "score": 3,
                      "num_children": 1,
                      "author": 5750,
                      "replies": [
                        {
                          "id": "hoo5rxk",
                          "text": "Sounds good to me",
                          "timestamp": "2021-12-15 17:52:23",
                          "score": 2,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hro2j2x",
                  "text": "Not really. \n\nSupreme court justices are nominated by the president, which is not affected by gerrymandering, and the senate, which is also not affected by gerrymandering.\n\nYou can thank a combination of the electoral college and unequal representation in the senate.",
                  "timestamp": "2022-01-07 18:18:10",
                  "score": 0,
                  "num_children": 0,
                  "author": 20475,
                  "replies": []
                }
              ]
            },
            {
              "id": "hoomrme",
              "text": "My brother's FIL claims the electoral college shouldn't be abolished because it prevents the tyranny of the majority. He gets super pissed if you then ask how that works in a democracy (and yeah, the US is a representative republic, same thing for these purposes).",
              "timestamp": "2021-12-15 19:41:30",
              "score": 5,
              "num_children": 2,
              "replies": [
                {
                  "id": "hoonzzs",
                  "text": "Did you tell him that Electoral College allows tyranny of the minority? I mean, Wyoming and South Dakota can overrule California.",
                  "timestamp": "2021-12-15 19:49:21",
                  "score": 4,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hop2gte",
                  "text": "I doubt that any current human honestly believes that the electoral college is an inherently good idea.  Republicans like it because it makes their votes count more and they retroactively justify it with extremely weak and easily negated talking points like hurr durr it's a Republic or durr duh tyranny of the majority.  They've all already been told why those arguments are dumb and they don't care.  They're working backwards from their conclusion and it's the best they can do without just admitting that they believe white people votes should count for more.",
                  "timestamp": "2021-12-15 21:22:32",
                  "score": 1,
                  "num_children": 0,
                  "author": 41444,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "honglai",
          "text": "Coz religion unites religious people but atheism has no such effect on our community.\n\nEvery election ever has been \"Christian values are under attack\" or similar shit. Atheists dont have such uniting force so election never revolves around atheism and hence nobody feels the need to represent atheists.",
          "timestamp": "2021-12-15 15:07:10",
          "score": 57,
          "num_children": 2,
          "author": 143257,
          "replies": [
            {
              "id": "honpby3",
              "text": "Our uniting force is essentially \"keep religion out of the government\" but that's about all I can think of.",
              "timestamp": "2021-12-15 16:05:28",
              "score": 39,
              "num_children": 1,
              "author": 340691,
              "replies": [
                {
                  "id": "hons6ux",
                  "text": "A worthy cause. Keep up the good fight. The world is changing.",
                  "timestamp": "2021-12-15 16:24:19",
                  "score": 22,
                  "num_children": 0,
                  "author": 57665,
                  "replies": []
                }
              ]
            },
            {
              "id": "hoo8wi3",
              "text": "The closest thing we have is [The Satanic Temple](https://thesatanictemple.com/), an Atheist organization that is currently fighting for the abortion rights of individuals in Texas suffering that new draconian law. It seems like an appropriately ironic banner to rally under; the bad guy character in their mythology.",
              "timestamp": "2021-12-15 18:12:28",
              "score": 10,
              "num_children": 0,
              "author": 172403,
              "replies": []
            }
          ]
        },
        {
          "id": "honrw8c",
          "text": "...and how many in congress are atheists?  Zero?  One maybe?",
          "timestamp": "2021-12-15 16:22:22",
          "score": 9,
          "num_children": 0,
          "author": 65582,
          "replies": []
        },
        {
          "id": "honmr7f",
          "text": "Mitch McConnell",
          "timestamp": "2021-12-15 15:48:53",
          "score": 2,
          "num_children": 0,
          "author": 319741,
          "replies": []
        },
        {
          "id": "hoo33ea",
          "text": "It’s time to change that!",
          "timestamp": "2021-12-15 17:35:18",
          "score": 2,
          "num_children": 0,
          "author": 338034,
          "replies": []
        },
        {
          "id": "hooad0p",
          "text": "Appointing judges based on their biases seems odd to me to begin with...",
          "timestamp": "2021-12-15 18:21:58",
          "score": 2,
          "num_children": 0,
          "author": 81107,
          "replies": []
        }
      ]
    },
    {
      "id": "holxvdk",
      "text": "Essentially meaningless when the religious right has successfully captured SCOTUS. Experts have warned for decades about this and the serious repercussions it represents to American democracy. I think statistics like this may lead to complacency, when realistically, these religious nuts are tightening their grip. The sad thing is that this could have easily been averted in earlier elections. The attack on Roe v. Wade and the failure of SCOTUS to intervene, coupled with the US being added to the list of backsliding democracies this year should be sounding serious alarm bells.",
      "timestamp": "2021-12-15 05:10:07",
      "score": 524,
      "num_children": 7,
      "author": 373819,
      "replies": [
        {
          "id": "hom1vdx",
          "text": "Yep the fundi nuts are going to tighten their grip.  The Y’all qaeda isn’t going to take this without a fight.  It’s pretty scary for the future.",
          "timestamp": "2021-12-15 05:48:35",
          "score": 174,
          "num_children": 2,
          "author": 217287,
          "replies": [
            {
              "id": "hom71f7",
              "text": "It really is. History shows us what happens when the far right has to be stopped. It usually consists of a massive war effort and an unimaginable loss of life.",
              "timestamp": "2021-12-15 06:44:12",
              "score": 85,
              "num_children": 2,
              "author": 373819,
              "replies": [
                {
                  "id": "homayoi",
                  "text": "Some of the huge loss of life has been self-inflicted pandemic bullshit. The religious right is killing themselves off and making themselves sterile by choosing natural immunity over vaccines.",
                  "timestamp": "2021-12-15 07:31:31",
                  "score": 55,
                  "num_children": 2,
                  "author": 160768,
                  "replies": [
                    {
                      "id": "homd3yo",
                      "text": "They never fail to fully embrace the wrong side of history. Once again, they‘re proving that they’re incapable of doing the right thing.",
                      "timestamp": "2021-12-15 07:59:12",
                      "score": 64,
                      "num_children": 0,
                      "author": 373819,
                      "replies": []
                    },
                    {
                      "id": "hon2k3g",
                      "text": "Not only that, but the boomer Christians are beginning to die from age. I give it another decade or so before even the ridiculous district lines won't help them, anymore. Many of today's young children will be voting Democrat, by then.",
                      "timestamp": "2021-12-15 13:16:15",
                      "score": 19,
                      "num_children": 2,
                      "author": 156501,
                      "replies": [
                        {
                          "id": "honghmr",
                          "text": "That’s assuming you’re still allowed to vote by then",
                          "timestamp": "2021-12-15 15:06:27",
                          "score": 27,
                          "num_children": 1,
                          "author": 327795,
                          "replies": [
                            {
                              "id": "honrl6c",
                              "text": "Stop it hurts",
                              "timestamp": "2021-12-15 16:20:22",
                              "score": 6,
                              "num_children": 0,
                              "author": 160768,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hoqhcgc",
                          "text": "I hope you are right, but the power of stupid is stronger than we think.",
                          "timestamp": "2021-12-16 03:29:29",
                          "score": 1,
                          "num_children": 0,
                          "author": 93218,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hon6shz",
                  "text": "Same with the far left. Remember that almost any extremism leads to massive death",
                  "timestamp": "2021-12-15 13:52:30",
                  "score": -9,
                  "num_children": 1,
                  "author": 264869,
                  "replies": [
                    {
                      "id": "hop1vb9",
                      "text": "\"but BOTH sides are bad!! It doesn't matter that only one is in power, I just felt like enlightening this conversation with my massive intellect!\"",
                      "timestamp": "2021-12-15 21:18:43",
                      "score": 4,
                      "num_children": 1,
                      "author": 296626,
                      "replies": [
                        {
                          "id": "hopx21a",
                          "text": "Wow you must be politically ignorant if you think the right is some how dominating the country when they only control one branch of the government",
                          "timestamp": "2021-12-16 00:58:31",
                          "score": -2,
                          "num_children": 1,
                          "author": 264869,
                          "replies": [
                            {
                              "id": "hor5xek",
                              "text": "Do you seriously think the Democrats, a party that routinely panders to corporate interests and doesn't give a fuck about the average american, are *left wing*?\n\nAmerica has two parties, far right and extremely far right. Leftism is nowhere near having any significant influence in American politics.",
                              "timestamp": "2021-12-16 07:23:51",
                              "score": 2,
                              "num_children": 0,
                              "author": 296626,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hompcn2",
              "text": "Y'all Qaeda controlling the most powerful military in the world with thousands of nukes.",
              "timestamp": "2021-12-15 10:50:01",
              "score": 19,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hon2yj0",
          "text": "Also, there are plenty of “nones” who do hold what I would describe as religious beliefs, it’s just the fact that they don’t align with a specific sect that lands them in the “non-religious” category.",
          "timestamp": "2021-12-15 13:19:49",
          "score": 18,
          "num_children": 0,
          "author": 2378,
          "replies": []
        },
        {
          "id": "hompywl",
          "text": "The hand maids reality?",
          "timestamp": "2021-12-15 10:58:30",
          "score": 12,
          "num_children": 1,
          "author": 27629,
          "replies": [
            {
              "id": "hon5a19",
              "text": "Atwood's The Handmaid's Tale i.e. the standard evangelical fundamentalist's wet dream.",
              "timestamp": "2021-12-15 13:39:54",
              "score": 8,
              "num_children": 0,
              "author": 94835,
              "replies": []
            }
          ]
        },
        {
          "id": "honb6m5",
          "text": "Don't give up like that.  You're giving into a gamed system.",
          "timestamp": "2021-12-15 14:27:18",
          "score": 2,
          "num_children": 1,
          "author": 308579,
          "replies": [
            {
              "id": "hotn4bi",
              "text": "Trying not too but my optimism is waning.",
              "timestamp": "2021-12-16 20:08:23",
              "score": 2,
              "num_children": 1,
              "author": 373819,
              "replies": [
                {
                  "id": "houcx1a",
                  "text": "I hear you.",
                  "timestamp": "2021-12-16 23:00:21",
                  "score": 1,
                  "num_children": 0,
                  "author": 308579,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hoozrre",
          "text": "The SCOTUS stuff is a big loss, but a lot of things could be accomplished by Congress and Presidents elected with the help of that 29% passing legislation explicitly protecting things from religious overreach.",
          "timestamp": "2021-12-15 21:05:13",
          "score": 2,
          "num_children": 0,
          "author": 134856,
          "replies": []
        },
        {
          "id": "homvvqr",
          "text": "Yep. Also some of those non-religious individuals can hold crazy ideologies too.",
          "timestamp": "2021-12-15 12:10:08",
          "score": 1,
          "num_children": 1,
          "author": 276705,
          "replies": [
            {
              "id": "hon6nue",
              "text": "*Sigh* you're talking about Ayn Rand's fanboys, aren't you?",
              "timestamp": "2021-12-15 13:51:26",
              "score": 2,
              "num_children": 1,
              "author": 262606,
              "replies": [
                {
                  "id": "honlbj0",
                  "text": "That’s Exhibit A.",
                  "timestamp": "2021-12-15 15:39:37",
                  "score": 3,
                  "num_children": 0,
                  "author": 276705,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hoqxik4",
          "text": "There's literally article after article warning that the majority of Americans are asleep and that their democracy is in dire threat, and they're right. Biden is probably going to be another Carter and allow evil to really do a number this time on your country.",
          "timestamp": "2021-12-16 05:50:40",
          "score": 1,
          "num_children": 1,
          "author": 14550,
          "replies": [
            {
              "id": "hotlthb",
              "text": "I think you’re right. Biden’s presidency should be a time to reflect and work on tightening our democratic traditions. Nothing is being done at the moment and we’re wasting the only chance we may get.",
              "timestamp": "2021-12-16 19:59:58",
              "score": 1,
              "num_children": 1,
              "author": 373819,
              "replies": [
                {
                  "id": "hovhoc8",
                  "text": "For sure, but nothing is being done yet. Whatever can be done, should be done before it's too late and before you get the madman back, or someone similar.",
                  "timestamp": "2021-12-17 04:04:39",
                  "score": 1,
                  "num_children": 0,
                  "author": 14550,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "holzbbw",
      "text": "Thank god",
      "timestamp": "2021-12-15 05:23:46",
      "score": 65,
      "num_children": 2,
      "replies": [
        {
          "id": "hombwah",
          "text": "Amen to that.",
          "timestamp": "2021-12-15 07:43:25",
          "score": 29,
          "num_children": 1,
          "author": 330369,
          "replies": [
            {
              "id": "honmlkt",
              "text": "Been praying for this day.",
              "timestamp": "2021-12-15 15:47:53",
              "score": 18,
              "num_children": 1,
              "author": 266293,
              "replies": [
                {
                  "id": "hopc2ze",
                  "text": "HAIL SATAN",
                  "timestamp": "2021-12-15 22:25:44",
                  "score": 6,
                  "num_children": 0,
                  "author": 57363,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hoqn6w7",
          "text": "hold on-",
          "timestamp": "2021-12-16 04:16:28",
          "score": 1,
          "num_children": 0,
          "author": 198374,
          "replies": []
        }
      ]
    },
    {
      "id": "hom3vei",
      "text": "I love that non religious people are growing, but I fear that the growing number of people who do not identify with any religion will make religious folks feel cornered and make them take drastic measures to curb their decline",
      "timestamp": "2021-12-15 06:09:12",
      "score": 60,
      "num_children": 5,
      "author": 271512,
      "replies": [
        {
          "id": "homynpx",
          "text": "Well, they’re currently working to systematically replace election officials in the swing districts they lost last time with the kind of loyalists who would happily “find” 11,780 votes for them on request… and setting things up so state legislatures they control can toss out “contested” election results and send electors of their own choosing to Congress… seems pretty drastic. Not to mention if the federal judiciary (not just the Supreme Court) ever recovers from the last four years, I likely won’t live to see it.",
          "timestamp": "2021-12-15 12:38:59",
          "score": 35,
          "num_children": 0,
          "author": 187338,
          "replies": []
        },
        {
          "id": "hon4mwr",
          "text": "Seems to be what's happening. Religion is slowly dying and the fanatics are going to fight tooth and nail to to keep their power over people. They're not going to go away quietly unfortunately.",
          "timestamp": "2021-12-15 13:34:28",
          "score": 16,
          "num_children": 0,
          "author": 184464,
          "replies": []
        },
        {
          "id": "honroee",
          "text": "They already are because they're noticing the growing number of non-religious people. Take a look at what's been happening within our SCOTUS.",
          "timestamp": "2021-12-15 16:20:57",
          "score": 5,
          "num_children": 0,
          "author": 103036,
          "replies": []
        },
        {
          "id": "hondyt8",
          "text": "Don’t let them watch ***The Handmaid’s Tale***…",
          "timestamp": "2021-12-15 14:48:10",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hoowrax",
          "text": "Doubt. Its literally a belief system. Just because some people dont believe in what they do doesnt mean they'll actively force them to. Only the religious extremists do that shit. Youll find that more often than not, people of a faith are very calm and collected. At least in my experience.",
          "timestamp": "2021-12-15 20:45:39",
          "score": -2,
          "num_children": 0,
          "author": 204225,
          "replies": []
        }
      ]
    },
    {
      "id": "homm5qa",
      "text": "As a teen still stuck in a religious cult I'm so happy when I see these numbers.",
      "timestamp": "2021-12-15 10:05:19",
      "score": 39,
      "num_children": 5,
      "author": 241390,
      "replies": [
        {
          "id": "hone5l8",
          "text": "Username checks out.\n\nStay strong!",
          "timestamp": "2021-12-15 14:49:33",
          "score": 11,
          "num_children": 1,
          "replies": [
            {
              "id": "hoqn95z",
              "text": "username checks out again!",
              "timestamp": "2021-12-16 04:17:01",
              "score": 5,
              "num_children": 0,
              "author": 198374,
              "replies": []
            }
          ]
        },
        {
          "id": "hoocjfz",
          "text": "Just stop bathing. They'll eventually stop dragging you to events. Works for lots of things.",
          "timestamp": "2021-12-15 18:36:06",
          "score": 8,
          "num_children": 0,
          "author": 280063,
          "replies": []
        },
        {
          "id": "hommajh",
          "text": "Good",
          "timestamp": "2021-12-15 10:07:14",
          "score": 5,
          "num_children": 0,
          "author": 396073,
          "replies": []
        },
        {
          "id": "honn5j0",
          "text": "Get out when you can my friend!",
          "timestamp": "2021-12-15 15:51:25",
          "score": 6,
          "num_children": 0,
          "author": 220898,
          "replies": []
        },
        {
          "id": "hoowwkz",
          "text": "What cult?",
          "timestamp": "2021-12-15 20:46:35",
          "score": 2,
          "num_children": 1,
          "author": 204225,
          "replies": [
            {
              "id": "hoqdc8t",
              "text": "Hasidic Judaism",
              "timestamp": "2021-12-16 02:59:34",
              "score": 3,
              "num_children": 0,
              "author": 241390,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "holryoh",
      "text": "Good",
      "timestamp": "2021-12-15 04:16:46",
      "score": 35,
      "num_children": 2,
      "author": 353379,
      "replies": [
        {
          "id": "hols3uo",
          "text": "Yes",
          "timestamp": "2021-12-15 04:18:01",
          "score": 17,
          "num_children": 0,
          "author": 396073,
          "replies": []
        },
        {
          "id": "hoowvaj",
          "text": "Why is it a good thing? Is religion super far gone in America?",
          "timestamp": "2021-12-15 20:46:23",
          "score": 2,
          "num_children": 1,
          "author": 204225,
          "replies": [
            {
              "id": "hop4uag",
              "text": "Its the kind of people that are religious. Many of them use christianity to be discriminatory towards me and others in my situation.",
              "timestamp": "2021-12-15 21:37:43",
              "score": 3,
              "num_children": 1,
              "author": 353379,
              "replies": [
                {
                  "id": "hopcbug",
                  "text": "Its ironic isn't it. Basically at the heart of every religion is like, love and acceptance, forgiveness of other etc, but people can't work around their beliefs. So silly. Sorry you've faced such discriminatory things",
                  "timestamp": "2021-12-15 22:27:25",
                  "score": 2,
                  "num_children": 0,
                  "author": 204225,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hom2p67",
      "text": "These are always in /r/atheism when will they get posted to /r/news? /r/upliftingnews?",
      "timestamp": "2021-12-15 05:56:57",
      "score": 97,
      "num_children": 2,
      "author": 52125,
      "replies": [
        {
          "id": "hom7npj",
          "text": "Go ahead and post it.  What is stopping you?",
          "timestamp": "2021-12-15 06:51:22",
          "score": 64,
          "num_children": 1,
          "author": 187804,
          "replies": [
            {
              "id": "hom9t8x",
              "text": "You're right",
              "timestamp": "2021-12-15 07:17:18",
              "score": 48,
              "num_children": 0,
              "author": 52125,
              "replies": []
            }
          ]
        },
        {
          "id": "hon9rxl",
          "text": "Because there’s people who won’t see it as uplifting news",
          "timestamp": "2021-12-15 14:16:34",
          "score": 14,
          "num_children": 1,
          "author": 354187,
          "replies": [
            {
              "id": "hoognc0",
              "text": "I mean it’s pretty neutral, and it’s comparable to like “oh the DOW hit a record high.” Woohoo, number go up.",
              "timestamp": "2021-12-15 19:02:27",
              "score": 3,
              "num_children": 0,
              "author": 287629,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hom2f7q",
      "text": "Religion: takes people with brains and intelligence, good hearts and most non-cis-white people and shoots them in the foot, making them leave\n\nReligion: Why doesnt anyone want to be forced to worship my version of god?",
      "timestamp": "2021-12-15 05:54:03",
      "score": 84,
      "num_children": 4,
      "author": 86223,
      "replies": [
        {
          "id": "hom2gkc",
          "text": "Yep",
          "timestamp": "2021-12-15 05:54:26",
          "score": 6,
          "num_children": 0,
          "author": 396073,
          "replies": []
        },
        {
          "id": "homq2ke",
          "text": "Considering your point about non-cis-white people, do you mean “Western Christianity:” as opposed to “Religion:”?",
          "timestamp": "2021-12-15 10:59:52",
          "score": 6,
          "num_children": 1,
          "author": 175483,
          "replies": [
            {
              "id": "homq9i7",
              "text": "Why would you try to specify? The post is about America. Of course they're talking about Christianity.",
              "timestamp": "2021-12-15 11:02:27",
              "score": 17,
              "num_children": 1,
              "author": 316579,
              "replies": [
                {
                  "id": "homqg6j",
                  "text": "For accuracy. The post is about religious identification and affiliation (or lack of) numbers.",
                  "timestamp": "2021-12-15 11:04:51",
                  "score": 1,
                  "num_children": 0,
                  "author": 175483,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hon2x2z",
          "text": "Please just stop brigin race into things that have nothing to do with race.",
          "timestamp": "2021-12-15 13:19:28",
          "score": 1,
          "num_children": 0,
          "author": 403573,
          "replies": []
        },
        {
          "id": "hooxdhp",
          "text": "Also in my experience: The house of god is open to anyone and you are free to leave with no judgment.\n\nI swear this is just a case of bad press. Why would anyone acknowledge good, healthy churches? That doesn't get the paper views. Same with cops. No one gives a shit if a cop saves some bodies life, they only care if they take one. Don't generalize so much.",
          "timestamp": "2021-12-15 20:49:38",
          "score": -1,
          "num_children": 0,
          "author": 204225,
          "replies": []
        }
      ]
    },
    {
      "id": "holrgb3",
      "text": "Very good.",
      "timestamp": "2021-12-15 04:12:21",
      "score": 108,
      "num_children": 2,
      "author": 129585,
      "replies": [
        {
          "id": "holx68g",
          "text": "And yet only 1% of congress is non affiliated. We are grossly underrepresented",
          "timestamp": "2021-12-15 05:03:35",
          "score": 169,
          "num_children": 6,
          "author": 255862,
          "replies": [
            {
              "id": "hom6rm3",
              "text": "I’m actually surprised it’s even 1%…\n\nI’m Canadian and while religion isn’t as prominent in our social and political culture, every person in politics has shown some allegiance to a religious belief. \n\nThe words “send prayers to…” are constantly being used as a blanket statement to express remorse or wishing well upon others. I don’t understand how it’s been so dismissed coming from government representatives that are supposed to be—at least public ally—non biased.\n\nEdit: it’s actually so normalized in society to “send prayers”, that I see people I know aren’t religious respond that on social media posts. Like, you aren’t gonna pray for them. Most of those commenting aren’t either. If people actually cared, they wouldn’t “send prayers”, they’d send actual support, like a hot meal, a ride, a shoulder to cry on etc.",
              "timestamp": "2021-12-15 06:41:06",
              "score": 23,
              "num_children": 2,
              "author": 395908,
              "replies": [
                {
                  "id": "hombwk3",
                  "text": "Politicians often use religious connections to often win votes and influence the masses.  They'll be a member of large churches to gain funds and support, in exchange for pushing their god agenda (scratch my back I'll scratch yours). It is really common in Australia, even though the pollies are so crooked they couldn't lie straight in bed. 'Convenient Chrsitians' I believe is the expression.",
                  "timestamp": "2021-12-15 07:43:30",
                  "score": 11,
                  "num_children": 0,
                  "author": 346692,
                  "replies": []
                },
                {
                  "id": "hon2ol4",
                  "text": "Where I'm from politicians send thoughts. Thankfully no prayers.",
                  "timestamp": "2021-12-15 13:17:23",
                  "score": 3,
                  "num_children": 0,
                  "author": 101536,
                  "replies": []
                }
              ]
            },
            {
              "id": "homal60",
              "text": "That's actually getting better too, just very slowly. [The senate](https://en.wikipedia.org/wiki/Religious_affiliation_in_the_United_States_Senate#Buddhists_(1)) has just 1 self-identified \"Unaffiliated\", but also 3 who declined to give any religion, plus a non-practicing Buddhist and a non-practicing Jew. So that adds up to 6% self-identified \"Nones\".\n\nAt current rates about about 2042 the U.S. will consist of 50% \"Nones\". At that point you'll see Congress leap into the \"None\" category too.",
              "timestamp": "2021-12-15 07:26:49",
              "score": 12,
              "num_children": 1,
              "author": 217427,
              "replies": [
                {
                  "id": "homy8fg",
                  "text": "In Germany the new leader has declined to swear an oath to a god; he has done the same for all the other offices he has held.",
                  "timestamp": "2021-12-15 12:34:44",
                  "score": 12,
                  "num_children": 0,
                  "author": 238561,
                  "replies": []
                }
              ]
            },
            {
              "id": "hom536c",
              "text": "Or they just won't admit it.",
              "timestamp": "2021-12-15 06:22:27",
              "score": 50,
              "num_children": 1,
              "author": 369318,
              "replies": [
                {
                  "id": "hom7o0y",
                  "text": "Doesn't count if they don't.",
                  "timestamp": "2021-12-15 06:51:28",
                  "score": 75,
                  "num_children": 1,
                  "author": 342179,
                  "replies": [
                    {
                      "id": "homorti",
                      "text": "If they would vote like atheists, that would be good enough for me.",
                      "timestamp": "2021-12-15 10:42:03",
                      "score": 8,
                      "num_children": 2,
                      "author": 218164,
                      "replies": [
                        {
                          "id": "hon9vj1",
                          "text": "That’s the beauty of secularism. I don’t need to know (or care to know) what my representative’s religious beliefs are. Just do your job in a rational manner guided by science and facts.",
                          "timestamp": "2021-12-15 14:17:22",
                          "score": 5,
                          "num_children": 0,
                          "author": 318520,
                          "replies": []
                        },
                        {
                          "id": "hoo199u",
                          "text": "That's why I don't give any credence to the morons who say Trump was obviously an atheist. The dude surrounded himself with dominionists and shoved them in every level of the judicial branch he could. If he's \"actually\" an atheist is irrelevant if he's so willing to pretend to be religious and enact their will on every level.",
                          "timestamp": "2021-12-15 17:23:37",
                          "score": 2,
                          "num_children": 0,
                          "author": 65151,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hom45ql",
              "text": "this",
              "timestamp": "2021-12-15 06:12:20",
              "score": 3,
              "num_children": 1,
              "author": 77642,
              "replies": [
                {
                  "id": "hom46dl",
                  "text": "Hey there scooterjay2013! If you agree with someone else's comment, please leave an **upvote** instead of commenting **\"this\"**! By upvoting instead, the original comment will be pushed to the top and be more visible to others, which is even better! Thanks! :)\n***\n ^(I am a bot! Visit) [^(r/InfinityBots)](https://reddit.com/r/InfinityBots) ^(to send your feedback! More info:) [^(Reddiquette)](https://www.reddithelp.com/hc/en-us/articles/205926439#wiki_in_regard_to_comments)",
                  "timestamp": "2021-12-15 06:12:32",
                  "score": 11,
                  "num_children": 1,
                  "author": 38618,
                  "replies": [
                    {
                      "id": "honq957",
                      "text": "Did I just get bot shamed?",
                      "timestamp": "2021-12-15 16:11:33",
                      "score": 3,
                      "num_children": 0,
                      "author": 77642,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "homngjo",
              "text": "see: median voter theorem",
              "timestamp": "2021-12-15 10:23:45",
              "score": 1,
              "num_children": 0,
              "author": 266598,
              "replies": []
            },
            {
              "id": "homy1j9",
              "text": "There's absolutely no way that 99% of congress really do believe in gods.",
              "timestamp": "2021-12-15 12:32:48",
              "score": 1,
              "num_children": 0,
              "author": 238561,
              "replies": []
            }
          ]
        },
        {
          "id": "holrvok",
          "text": "Yes",
          "timestamp": "2021-12-15 04:16:00",
          "score": 15,
          "num_children": 1,
          "author": 396073,
          "replies": [
            {
              "id": "holw39k",
              "text": "We grow.",
              "timestamp": "2021-12-15 04:53:40",
              "score": 8,
              "num_children": 0,
              "author": 282348,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "holwan7",
      "text": "Those numbers are way too low. Gotta pump those numbers up!",
      "timestamp": "2021-12-15 04:55:35",
      "score": 45,
      "num_children": 2,
      "author": 327279,
      "replies": [
        {
          "id": "holwc39",
          "text": "Gotta pump up those numbers",
          "timestamp": "2021-12-15 04:55:57",
          "score": 11,
          "num_children": 1,
          "author": 396073,
          "replies": [
            {
              "id": "holzigq",
              "text": "Those a re rookie numbers",
              "timestamp": "2021-12-15 05:25:39",
              "score": 12,
              "num_children": 0,
              "author": 327279,
              "replies": []
            }
          ]
        },
        {
          "id": "homqxqc",
          "text": "In reality the percentage is higher due to the amount of people who are closeted atheist/non-religous in very conservative communities.",
          "timestamp": "2021-12-15 11:11:10",
          "score": 2,
          "num_children": 1,
          "author": 33408,
          "replies": [
            {
              "id": "homw5d0",
              "text": "No reason to lie on a private survey..",
              "timestamp": "2021-12-15 12:13:03",
              "score": 2,
              "num_children": 0,
              "author": 361511,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "holtm9e",
      "text": "Most excellent, just need to get it to 95%.",
      "timestamp": "2021-12-15 04:31:12",
      "score": 71,
      "num_children": 1,
      "author": 71968,
      "replies": [
        {
          "id": "hopbutp",
          "text": "Well, I am sure the majority are modern day agnostics and feel that there is a deeper understanding of the cosmos through eastern religion. \n\nAs an Atheist, or Anti-theist, I do not trust that data to be reflective of the general population's religious, or mystical, sentiment. I just take comfort in knowing that enough people are dropping religious traditionalism. IE They are not identifying with the religion they were raised with. \n\nAlthough, it is a tough fight. My wife is atheist like me and her Roman Catholic Mother can sometimes scratch little ideas into her about \"how to explain things to a toddler\", or, \"how to let them know the different perspectives, especially about why most people are celebrating Christmas.\" \n\nIt's a really easy argument to win. We celebrate it for the same reason we celebrate Halloween. For Fun. It's just ancient Pagan folk lore. For presents",
          "timestamp": "2021-12-15 22:24:11",
          "score": 2,
          "num_children": 0,
          "author": 111479,
          "replies": []
        }
      ]
    },
    {
      "id": "holvaeq",
      "text": "“But Christianity is growing in Africa” is the usual christian comeback.",
      "timestamp": "2021-12-15 04:46:20",
      "score": 39,
      "num_children": 2,
      "author": 154748,
      "replies": [
        {
          "id": "holye1p",
          "text": "And, the story goes that they will return to evangelize and re-Christianize Europe, LOL.",
          "timestamp": "2021-12-15 05:15:00",
          "score": 24,
          "num_children": 2,
          "replies": [
            {
              "id": "homnixo",
              "text": "i'm sure the totality of american christianity will welcome a flood of africans bringing their culture into america\n\nright?",
              "timestamp": "2021-12-15 10:24:42",
              "score": 24,
              "num_children": 1,
              "author": 266598,
              "replies": [
                {
                  "id": "hon4u35",
                  "text": "They'll re-Christianize us remotely.",
                  "timestamp": "2021-12-15 13:36:09",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "hon2bq8",
              "text": "I’ve never heard that…The two things I hear from evangelicals is that either the end of the world is coming, and the decline in belief is just a part of the whole revelations thing, or that another Great Awakening is coming, and everyone will return to Christianity.  There’s a lot of white supremacy mixed up in evangelical beliefs, so they think of themselves as the ones ‘saving’ black people, and don’t even consider the opposite happening.",
              "timestamp": "2021-12-15 13:14:06",
              "score": 8,
              "num_children": 1,
              "author": 167090,
              "replies": [
                {
                  "id": "hon444m",
                  "text": "Just keep making shit up as time goes along -- all to soothe their egos.",
                  "timestamp": "2021-12-15 13:29:58",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hom1nhm",
          "text": "My Filipino in laws say all the priests in the churches they go to are either Filipino or African. Good for the US, at least.",
          "timestamp": "2021-12-15 05:46:27",
          "score": 10,
          "num_children": 0,
          "author": 233995,
          "replies": []
        }
      ]
    },
    {
      "id": "homl356",
      "text": "The future of the country as we are the most vaccinated and will survive this shit.",
      "timestamp": "2021-12-15 09:50:04",
      "score": 13,
      "num_children": 1,
      "author": 387932,
      "replies": [
        {
          "id": "homl5pw",
          "text": "Yes",
          "timestamp": "2021-12-15 09:51:06",
          "score": 4,
          "num_children": 0,
          "author": 396073,
          "replies": []
        }
      ]
    },
    {
      "id": "homrgk7",
      "text": "Those are rookie numbers. Let’s get those numbers up to Estonia and Sweden levels!",
      "timestamp": "2021-12-15 11:17:53",
      "score": 12,
      "num_children": 0,
      "author": 101492,
      "replies": []
    },
    {
      "id": "hompdww",
      "text": "Its higher.\n\nPeople are simply afraid of backlash if they're found out.",
      "timestamp": "2021-12-15 10:50:31",
      "score": 8,
      "num_children": 0,
      "author": 90086,
      "replies": []
    },
    {
      "id": "holxx0w",
      "text": "The closer we get to 100 the more comfortable I become.",
      "timestamp": "2021-12-15 05:10:33",
      "score": 23,
      "num_children": 1,
      "replies": [
        {
          "id": "holy9kw",
          "text": "For sure",
          "timestamp": "2021-12-15 05:13:50",
          "score": 6,
          "num_children": 0,
          "author": 396073,
          "replies": []
        }
      ]
    },
    {
      "id": "hon2im0",
      "text": "29% of Americans don't believe in a sky daddy. Scarily low number still.",
      "timestamp": "2021-12-15 13:15:52",
      "score": 7,
      "num_children": 0,
      "author": 51294,
      "replies": []
    },
    {
      "id": "homf873",
      "text": "That's low I'm shocked its not higher",
      "timestamp": "2021-12-15 08:27:32",
      "score": 5,
      "num_children": 1,
      "author": 82410,
      "replies": [
        {
          "id": "homjmu3",
          "text": "Most people are fake religious anyway. They don't go to church or literally live any aspect of their life like they are.",
          "timestamp": "2021-12-15 09:29:08",
          "score": 3,
          "num_children": 0,
          "author": 34383,
          "replies": []
        }
      ]
    },
    {
      "id": "hon6kqs",
      "text": "Nice, that's basically 3/10 people. Ant this number is only gonna go up as my generation, and Gen Z start having/raising kids. Maybe we can have an actual separation of church and state, and stop having religion factor into so many of our laws within the coming decades.",
      "timestamp": "2021-12-15 13:50:44",
      "score": 6,
      "num_children": 0,
      "author": 265814,
      "replies": []
    },
    {
      "id": "honnqdb",
      "text": "We're at 60% here in Scotland. A few centuries of religious warfare coupled with an educated population will do that. The remainder are almost all old people with a sprinkling of 1st & 2nd Gen immigrants.\n\nI boggles my mind that American politicians have to say they believe in a God to even be electable. If a political candidate here even so much as mentioned they were religious they would be immediately disregarded by the voters as showing a deficiency on being able to think properly on a basic level and more importantly their motives would be treated as highly suspect. Religous people rarely get into politics for good reasons. Not there aren't people of faith in our political system, they've just learned that religion starts with a very very small r.",
      "timestamp": "2021-12-15 15:55:11",
      "score": 6,
      "num_children": 0,
      "author": 120803,
      "replies": []
    },
    {
      "id": "hop1e6o",
      "text": "That sounds about right because about 70% of Americans don't know basic facts about their own country.",
      "timestamp": "2021-12-15 21:15:36",
      "score": 6,
      "num_children": 1,
      "author": 184365,
      "replies": [
        {
          "id": "hop1s4d",
          "text": "“Facts don’t care about your feelings” - Ben Shapiro",
          "timestamp": "2021-12-15 21:18:08",
          "score": 1,
          "num_children": 0,
          "author": 396073,
          "replies": []
        }
      ]
    },
    {
      "id": "hopgh2h",
      "text": "It's amazing how rapidly Christianity is dying in America, and they have nobody to blame but themselves.  It's not just on the coasts, either.  I recently returned to Utah after 20+ years in California - the liberal bubble where free thought was allowed used to be the University and about 3 blocks around it. Now the whole county is at worst 50/50 religious.\n\nIn 50 years there will only be 9 Christians left in America and they'll all be Republican Supreme Court justices.",
      "timestamp": "2021-12-15 22:56:03",
      "score": 6,
      "num_children": 0,
      "author": 14254,
      "replies": []
    },
    {
      "id": "homxlwr",
      "text": "Defund God.",
      "timestamp": "2021-12-15 12:28:20",
      "score": 5,
      "num_children": 0,
      "author": 345923,
      "replies": []
    },
    {
      "id": "honsaxu",
      "text": "Cool story. In reality many many atheists sadly live in families that are so horrid that they are forced to lie to make their lives easier. Once the controlling generation are all in care homes or graves this will take a massive jump.",
      "timestamp": "2021-12-15 16:25:04",
      "score": 4,
      "num_children": 1,
      "author": 318080,
      "replies": [
        {
          "id": "hoqctpm",
          "text": "Facts tho. I have to lie about being gay and atheist just to prevent being kicked out on the streets by my religious parents.",
          "timestamp": "2021-12-16 02:55:40",
          "score": 2,
          "num_children": 1,
          "author": 16658,
          "replies": [
            {
              "id": "hosk8fk",
              "text": "There is nothing immoral about lying to protect yourself from harm. May you have a grand life.",
              "timestamp": "2021-12-16 15:55:54",
              "score": 2,
              "num_children": 0,
              "author": 318080,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hoo1dmi",
      "text": "It's almost like people are finally waking up to the fact that basing their lives on the assumed whims and wills of an invisible genie living in the clouds is not an effective long-term strategy for success.",
      "timestamp": "2021-12-15 17:24:23",
      "score": 4,
      "num_children": 0,
      "author": 119836,
      "replies": []
    },
    {
      "id": "hom3ojl",
      "text": "According to the article: \"Some experts are estimating that unaffiliated people could be the largest religious group in the country.\"\n\nTo which I reply: some experts estimate that people who don't collect stamps are the largest group of stamp-collectors in the country.\"",
      "timestamp": "2021-12-15 06:07:10",
      "score": 15,
      "num_children": 1,
      "author": 366435,
      "replies": [
        {
          "id": "homyym4",
          "text": "I mean unaffiliated and non-religious aren't the same thing. Plenty of religious people aren't affiliated with an organized group.",
          "timestamp": "2021-12-15 12:42:04",
          "score": 4,
          "num_children": 0,
          "author": 111916,
          "replies": []
        }
      ]
    },
    {
      "id": "holvbxx",
      "text": "Fuck yeah!",
      "timestamp": "2021-12-15 04:46:43",
      "score": 3,
      "num_children": 1,
      "author": 83477,
      "replies": [
        {
          "id": "holvd60",
          "text": "Fuck yeah!",
          "timestamp": "2021-12-15 04:47:02",
          "score": 1,
          "num_children": 0,
          "author": 396073,
          "replies": []
        }
      ]
    },
    {
      "id": "homdef3",
      "text": "Can't wait for Christians to start yelling \"See! It's the end of times! Nobody believes in God anymore, the world is so evil and morality is gone!\"\n\nThen you show them some crime and safety statistics related to population growth and the best answer I got was this \"They are just all bad in their hearts. Crime may be gone but only because people are scared of prison.\" :D",
      "timestamp": "2021-12-15 08:02:59",
      "score": 3,
      "num_children": 0,
      "author": 6054,
      "replies": []
    },
    {
      "id": "homl6xs",
      "text": "you can thank your baby loving priests and cardinals for this one",
      "timestamp": "2021-12-15 09:51:34",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "homv8mu",
      "text": "That's ridiculously low, I remember reading the UK was at 50% and that was a few years back so probably more now",
      "timestamp": "2021-12-15 12:03:05",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "homwva4",
      "text": "pathetically low % for an advanced country.\n\nOh wait...",
      "timestamp": "2021-12-15 12:20:40",
      "score": 3,
      "num_children": 0,
      "author": 131968,
      "replies": []
    },
    {
      "id": "hon15s4",
      "text": "I would say at least 70% of Religious people I meet are just flat out crazy.",
      "timestamp": "2021-12-15 13:03:23",
      "score": 4,
      "num_children": 0,
      "author": 157816,
      "replies": []
    },
    {
      "id": "hon6c44",
      "text": "I’m actually surprised it’s only 29 percent. I have a hard time finding someone under 30 who is religious.",
      "timestamp": "2021-12-15 13:48:48",
      "score": 5,
      "num_children": 0,
      "author": 71926,
      "replies": []
    },
    {
      "id": "hon6xqm",
      "text": "And accepted/celebrated church leaders in power out there on sundays promote killing 29% of the country at the side of the road.. well they'll take the 'earthen vessels' lucky us:\n\n>The document, consisting of 14 sections divided into bullet points, had a section on \"rules of war\" that stated \"make an offer of peace before declaring war\", which within stated that the **enemy must \"surrender on terms\" of no abortions, no same-sex marriage, no communism and \"must obey Biblical law\", then continued: \"If they do not yield — kill all males\"**\n\n[https://en.wikipedia.org/wiki/Matt\\_Shea#%22Biblical\\_Basis\\_for\\_War%22\\_manifesto](https://en.wikipedia.org/wiki/Matt_Shea#%22Biblical_Basis_for_War%22_manifesto)",
      "timestamp": "2021-12-15 13:53:41",
      "score": 5,
      "num_children": 0,
      "author": 145328,
      "replies": []
    },
    {
      "id": "honcs1l",
      "text": "I don't believe in any religion but unfortunately still had to join a religion to have the hope of protecting my rights. I joined the Satanic Temple and got official membership paperwork as well. The crazy Christians in the country, especially in Congress and Supreme Court scares me. Them possibly Roe v Wade really summited that for me.",
      "timestamp": "2021-12-15 14:39:19",
      "score": 4,
      "num_children": 0,
      "author": 412597,
      "replies": []
    },
    {
      "id": "honjsc9",
      "text": "[deleted]",
      "timestamp": "2021-12-15 15:29:25",
      "score": 4,
      "num_children": 1,
      "replies": [
        {
          "id": "honjtxi",
          "text": "Maybe less than that",
          "timestamp": "2021-12-15 15:29:42",
          "score": 2,
          "num_children": 0,
          "author": 396073,
          "replies": []
        }
      ]
    },
    {
      "id": "honqjad",
      "text": "Please vote.",
      "timestamp": "2021-12-15 16:13:26",
      "score": 5,
      "num_children": 0,
      "author": 46692,
      "replies": []
    },
    {
      "id": "homcpb7",
      "text": "In other news, 71% of americans are idiots.",
      "timestamp": "2021-12-15 07:53:50",
      "score": 14,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hom8bbj",
      "text": "[deleted]",
      "timestamp": "2021-12-15 06:59:12",
      "score": 35,
      "num_children": 4,
      "replies": [
        {
          "id": "hom950h",
          "text": "I think you're right, but I'm optimistic about people who call themselves \"spiritual\", because they don't tend to be as dogmatic, intolerant or hateful as the more religious people.\n\nPeople can believe whatever nonsense they want, just as long as they keep it to themselves. My main issue with religion comes about when they try to push it on others, indoctrinate children or threaten people with suffering.\n\nPersonally, I've never met a \"spiritual\" person who told me I'm going to burn for eternity for being gay.",
          "timestamp": "2021-12-15 07:09:01",
          "score": 30,
          "num_children": 0,
          "author": 274297,
          "replies": []
        },
        {
          "id": "homqswh",
          "text": "Agreed. The article ends with a quote from a non-religious person who still believes that the universe is \"always there for\" him. This is still magical thinking, even if it's not strictly God that cares for him.",
          "timestamp": "2021-12-15 11:09:29",
          "score": 7,
          "num_children": 0,
          "author": 125796,
          "replies": []
        },
        {
          "id": "homqxay",
          "text": "The article breaks down the numbers of those who still identify with some form of spirituality/higher power",
          "timestamp": "2021-12-15 11:11:02",
          "score": 5,
          "num_children": 0,
          "author": 175483,
          "replies": []
        },
        {
          "id": "homp4yp",
          "text": "Even atheists who are not spiritual are susceptible to believing nonsense: essential oils, homeopathy, chiropractic, trickle-down economics, etc.",
          "timestamp": "2021-12-15 10:47:08",
          "score": 19,
          "num_children": 1,
          "author": 218164,
          "replies": [
            {
              "id": "homyh1x",
              "text": "I’m annoyed I had to scroll so far down to find this. “Non religious” is not the same as “atheist who tries to be knowledgeable of the world around them”. It just means they don’t have organized religion. Most of that percentage absolutely fall prey to any number of pseudoscience bs, or less harmful, a general “pagan” attitude. This gets posted like once a month as though it’s mission accomplished. There’s a lot of bs to plow through still.",
              "timestamp": "2021-12-15 12:37:08",
              "score": 11,
              "num_children": 0,
              "author": 410612,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "homobzo",
      "text": "What a strange low number. In my country 53% identify themselves as non-religous and that number is growing. And the remaining 47% hardly ever visit a religious service.",
      "timestamp": "2021-12-15 10:35:55",
      "score": 7,
      "num_children": 0,
      "author": 289564,
      "replies": []
    },
    {
      "id": "hom5yaq",
      "text": "That's it?",
      "timestamp": "2021-12-15 06:31:58",
      "score": 3,
      "num_children": 0,
      "author": 276826,
      "replies": []
    },
    {
      "id": "hombglt",
      "text": "Question: How can I be counted in polls like this? Where do I go to say \"I'm an American and an Atheist, please count me.\"?",
      "timestamp": "2021-12-15 07:37:44",
      "score": 3,
      "num_children": 1,
      "author": 273369,
      "replies": [
        {
          "id": "homlqqo",
          "text": "I think they use the census for stuff like this, I have never taken a poll.",
          "timestamp": "2021-12-15 09:59:25",
          "score": 1,
          "num_children": 0,
          "author": 34143,
          "replies": []
        }
      ]
    },
    {
      "id": "homtjnz",
      "text": "Gotta pump those numbers",
      "timestamp": "2021-12-15 11:43:36",
      "score": 3,
      "num_children": 0,
      "author": 53392,
      "replies": []
    },
    {
      "id": "homtmlo",
      "text": "But we got plenty of spirit so shut the fuck up about your 'godless' claims. Sorry. So sick of the fearful fundie evangelical bullshit",
      "timestamp": "2021-12-15 11:44:33",
      "score": 3,
      "num_children": 0,
      "author": 164758,
      "replies": []
    },
    {
      "id": "homxb6f",
      "text": "Does not mean they are not dogmatic assholes.",
      "timestamp": "2021-12-15 12:25:14",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hon0znl",
      "text": "That’s it?  I thought we were smarter than this…",
      "timestamp": "2021-12-15 13:01:47",
      "score": 3,
      "num_children": 0,
      "author": 120833,
      "replies": []
    },
    {
      "id": "hon3a0w",
      "text": "I wonder how many churchies are out there just going thru the motions because they want to fly under the religious radar.  But in reality they are thinking “what a load of crap this is”",
      "timestamp": "2021-12-15 13:22:41",
      "score": 3,
      "num_children": 0,
      "author": 53841,
      "replies": []
    },
    {
      "id": "hon6eh4",
      "text": "I legit thought I saw a Pew report that it was higher than that? Might've been me.",
      "timestamp": "2021-12-15 13:49:21",
      "score": 3,
      "num_children": 0,
      "author": 403160,
      "replies": []
    },
    {
      "id": "hon9fyn",
      "text": "I have no clue about the numbers for Denmark but i would guess it’s close to 90%. It’s so normal that nobody makes a point out of identifying as an atheist. Yes many get babtized and go to church for weddings, funerals and christmas but people do it out of tradition. On normal sundays the churches are practically empty. I don’t know anyone who actually believes in God. Except for my Muslim friends. It’s kinda weird that it’s like that since we have an actual state religion in Denmark.",
      "timestamp": "2021-12-15 14:13:56",
      "score": 3,
      "num_children": 0,
      "author": 299895,
      "replies": []
    },
    {
      "id": "honcfe8",
      "text": "Our last vestige to primitive man finally disappearing.",
      "timestamp": "2021-12-15 14:36:40",
      "score": 3,
      "num_children": 0,
      "author": 402112,
      "replies": []
    },
    {
      "id": "hong3n9",
      "text": "Can't wait for more people to start minding their own fucking business.",
      "timestamp": "2021-12-15 15:03:40",
      "score": 3,
      "num_children": 0,
      "author": 146148,
      "replies": []
    },
    {
      "id": "honga5e",
      "text": "Its 2021 and I have seen what our organized religions have done in our communities and I no longer want any affiliation with them. Until I see them be the people that they pretend to be, I don’t acknowledge their faith.",
      "timestamp": "2021-12-15 15:04:57",
      "score": 3,
      "num_children": 0,
      "author": 327795,
      "replies": []
    },
    {
      "id": "honpv02",
      "text": "That's good. Theists are still loud as fuck and even more so literally dangerous.",
      "timestamp": "2021-12-15 16:08:56",
      "score": 3,
      "num_children": 0,
      "author": 11353,
      "replies": []
    },
    {
      "id": "hoopwzy",
      "text": "Religion needs to stay out of government. I think when all the boomers die we will be about 70%  agnostic/atheist",
      "timestamp": "2021-12-15 20:01:30",
      "score": 3,
      "num_children": 1,
      "author": 19769,
      "replies": [
        {
          "id": "hop34h3",
          "text": "Get my angry upvote. I’m a boomer. I’m atheist all my life.",
          "timestamp": "2021-12-15 21:26:36",
          "score": 3,
          "num_children": 1,
          "author": 102123,
          "replies": [
            {
              "id": "hop4f2v",
              "text": "I applaud you. I really wish religion wasn’t mixed with politics so we can make some real progress.",
              "timestamp": "2021-12-15 21:34:57",
              "score": 1,
              "num_children": 1,
              "author": 19769,
              "replies": [
                {
                  "id": "hop5cip",
                  "text": "I wish religion weren’t mixed with our life at all.\n\nHappy to totally agree with you.",
                  "timestamp": "2021-12-15 21:41:03",
                  "score": 1,
                  "num_children": 0,
                  "author": 102123,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "homeahn",
      "text": "Pamp it Lol",
      "timestamp": "2021-12-15 08:14:49",
      "score": 2,
      "num_children": 0,
      "author": 319425,
      "replies": []
    },
    {
      "id": "homji36",
      "text": "Praise...oh ehm sorry...",
      "timestamp": "2021-12-15 09:27:12",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "homv8v4",
      "text": "Let's keep that quiet before Gilead kills us all",
      "timestamp": "2021-12-15 12:03:10",
      "score": 2,
      "num_children": 0,
      "author": 222946,
      "replies": []
    },
    {
      "id": "homw32l",
      "text": ">> Research survey shows that 30 percent of nonreligious participants still hold a slight connection to a higher power, with 19 percent saying that religion is still somewhat important to them despite their own personal beliefs. While this remaining connection to religion might seem contradictory, some experts say that is not the case.\n\nLol. Religion is part of the human species and will die when the species die",
      "timestamp": "2021-12-15 12:12:22",
      "score": 2,
      "num_children": 0,
      "author": 276705,
      "replies": []
    },
    {
      "id": "honlko9",
      "text": "How is it still that low!? People are F-ing liars, “I believe in some omnipotent deity who controls everything but don’t actually live my life that way.”",
      "timestamp": "2021-12-15 15:41:15",
      "score": 2,
      "num_children": 0,
      "author": 117709,
      "replies": []
    },
    {
      "id": "honoo96",
      "text": "Those are rookie numbers. Gotta boost those numbers!!",
      "timestamp": "2021-12-15 16:01:12",
      "score": 2,
      "num_children": 0,
      "author": 342140,
      "replies": []
    },
    {
      "id": "hoob5un",
      "text": "the biggest reason why this happens is because of access to information,the internet will literally kill religion eventually,you cant still believe in bronze age fairy tales after you stumble on a hubble telescope video or science videos on youtube.",
      "timestamp": "2021-12-15 18:27:12",
      "score": 2,
      "num_children": 0,
      "author": 355575,
      "replies": []
    },
    {
      "id": "hootlmi",
      "text": "29% only? I thought it'd be much higher by now.",
      "timestamp": "2021-12-15 20:25:16",
      "score": 2,
      "num_children": 1,
      "author": 119575,
      "replies": [
        {
          "id": "hoou7nz",
          "text": "Same here",
          "timestamp": "2021-12-15 20:29:10",
          "score": 1,
          "num_children": 0,
          "author": 396073,
          "replies": []
        }
      ]
    },
    {
      "id": "hopl0me",
      "text": "Keep up the good work!",
      "timestamp": "2021-12-15 23:28:31",
      "score": 2,
      "num_children": 0,
      "author": 319724,
      "replies": []
    },
    {
      "id": "hopq5u9",
      "text": "When I was a kid this number was something like 3%. The internet has changed things in a monumental way.",
      "timestamp": "2021-12-16 00:06:15",
      "score": 2,
      "num_children": 0,
      "author": 327509,
      "replies": []
    },
    {
      "id": "hopz07n",
      "text": "I feel vindicated. Back in 1961, at the tender age of 10, I became an atheist. I hid my disbelief from family, friends, teachers, etc. I didn’t grow up in the Bible Belt. Rather, I came of age in a small then working class town in Southeastern Pennsylvania. Back in those days, respectable people didn’t broach their atheism in polite conversation. I’m overjoyed to see the “Nones” rise today especially among the young.",
      "timestamp": "2021-12-16 01:13:19",
      "score": 2,
      "num_children": 0,
      "author": 357120,
      "replies": []
    },
    {
      "id": "hoqmei4",
      "text": "29% of the population (65.9 million people) with basically 0 representation in government",
      "timestamp": "2021-12-16 04:09:49",
      "score": 2,
      "num_children": 0,
      "author": 183239,
      "replies": []
    },
    {
      "id": "hoqras2",
      "text": "Keep in mind about 54% of Gen Z & 45% of Millennials have no religious affiliation, so this number will almost certainly continue to increase over time as older generations slowly die off.\r  \n\r  \nWhat gives me a little bit of hope for the future is that the religious nutcases who are trying to force their dogma on the entire country (such as banning abortions, dragging the Bible into congress) are slowly but surely declining in their influence, and they know it.\r  \n\r  \nWaiting on the world to change...",
      "timestamp": "2021-12-16 04:51:56",
      "score": 2,
      "num_children": 0,
      "author": 57905,
      "replies": []
    },
    {
      "id": "hosie5r",
      "text": "I wonder how many are atheists and why that was not included in the poll",
      "timestamp": "2021-12-16 15:43:42",
      "score": 2,
      "num_children": 1,
      "author": 413015,
      "replies": [
        {
          "id": "hoskc0s",
          "text": "[https://www.pewforum.org/2021/12/14/about-three-in-ten-u-s-adults-are-now-religiously-unaffiliated/](https://www.pewforum.org/2021/12/14/about-three-in-ten-u-s-adults-are-now-religiously-unaffiliated/) \n\nI don't know. People who participated in the poll just chose what they identified as",
          "timestamp": "2021-12-16 15:56:34",
          "score": 1,
          "num_children": 1,
          "author": 396073,
          "replies": [
            {
              "id": "hosklfo",
              "text": "That's what I mean. Religiously unaffiliated =/= atheist. Many who say they are not religious tell me they \"have a personal relationship with the Lord\"",
              "timestamp": "2021-12-16 15:58:19",
              "score": 2,
              "num_children": 1,
              "author": 413015,
              "replies": [
                {
                  "id": "hosldmb",
                  "text": "Yeah. It's all about semantics.",
                  "timestamp": "2021-12-16 16:03:32",
                  "score": 1,
                  "num_children": 0,
                  "author": 396073,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hotyz9l",
      "text": "[deleted]",
      "timestamp": "2021-12-16 21:25:25",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "hotz1p0",
          "text": "We need more atheist politicians",
          "timestamp": "2021-12-16 21:25:52",
          "score": 2,
          "num_children": 0,
          "author": 396073,
          "replies": []
        }
      ]
    },
    {
      "id": "htyn0vr",
      "text": "Oh my God, why do you all hate religion so much? Just accept that some people don't agree with you, it's fine to disagree. But I don't want people to jump with joy that religion is declining. If you don't believe then ok, but don't ridicule the other side.",
      "timestamp": "2022-01-24 01:48:34",
      "score": 2,
      "num_children": 0,
      "author": 149185,
      "replies": []
    },
    {
      "id": "homauvu",
      "text": "These are rookie numbers, we need to pump these numbers up!",
      "timestamp": "2021-12-15 07:30:11",
      "score": 1,
      "num_children": 0,
      "author": 215267,
      "replies": []
    },
    {
      "id": "hombkso",
      "text": "Those are rookie numbers. We need to pump those numbers up!",
      "timestamp": "2021-12-15 07:39:14",
      "score": 3,
      "num_children": 0,
      "author": 104813,
      "replies": []
    },
    {
      "id": "holx0ta",
      "text": "Do people that believe we live in a simulation / forgotten experiment and such count into that 29%? On one hand it's not a traditional religion but also assumes creation by a more advanced being.",
      "timestamp": "2021-12-15 05:02:14",
      "score": 2,
      "num_children": 0,
      "author": 57047,
      "replies": []
    },
    {
      "id": "holy8u9",
      "text": "[deleted]",
      "timestamp": "2021-12-15 05:13:39",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "honjdck",
      "text": "That's not atheist though it includes people who are religious but just not a particular religion.",
      "timestamp": "2021-12-15 15:26:36",
      "score": 1,
      "num_children": 0,
      "author": 49748,
      "replies": []
    },
    {
      "id": "hongvyk",
      "text": "> About **12 percent describe themselves as religious and spiritual** and 28 percent as spiritual but not religious.\n\nThose people are probably fucking crazy.",
      "timestamp": "2021-12-15 15:09:19",
      "score": 0,
      "num_children": 0,
      "author": 248878,
      "replies": []
    },
    {
      "id": "honir0q",
      "text": "Not today jesus or whatever sky daddy",
      "timestamp": "2021-12-15 15:22:22",
      "score": 0,
      "num_children": 0,
      "author": 401496,
      "replies": []
    },
    {
      "id": "hoow78u",
      "text": "I'm out the loop, why is this a good thing for America? I'm aware there are some select individuals who abuse their faith for power or something?",
      "timestamp": "2021-12-15 20:42:01",
      "score": -1,
      "num_children": 0,
      "author": 204225,
      "replies": []
    },
    {
      "id": "holyabz",
      "text": "This is REALLY encouraging.",
      "timestamp": "2021-12-15 05:14:02",
      "score": 1,
      "num_children": 0,
      "author": 34954,
      "replies": []
    },
    {
      "id": "hom4moq",
      "text": "Beautiful.",
      "timestamp": "2021-12-15 06:17:29",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hom7gg6",
      "text": "But having no religion != atheist",
      "timestamp": "2021-12-15 06:49:01",
      "score": 1,
      "num_children": 0,
      "author": 187804,
      "replies": []
    },
    {
      "id": "homagz3",
      "text": "And then there are people like my mum who say that Atheism isn't a religious demographic and that it's a minority...  \n\n\nI mean, she's right about it being a minority, but it's certainly not a *tiny* minority.",
      "timestamp": "2021-12-15 07:25:22",
      "score": 1,
      "num_children": 0,
      "author": 286267,
      "replies": []
    },
    {
      "id": "homgnrh",
      "text": "Good!\n\nHopefully soon they'll identify with other advanced concept like not getting in insane debt just because you want to have education, not getting bankrupt because you got sick, getting a fair wage, 5 weeks of paid vacation and similar things.",
      "timestamp": "2021-12-15 08:47:20",
      "score": 1,
      "num_children": 0,
      "author": 10789,
      "replies": []
    },
    {
      "id": "hommsft",
      "text": "So by 2121 we may be the majority?",
      "timestamp": "2021-12-15 10:14:22",
      "score": 1,
      "num_children": 0,
      "author": 209531,
      "replies": []
    },
    {
      "id": "homoe0g",
      "text": "[removed]",
      "timestamp": "2021-12-15 10:36:41",
      "score": 0,
      "num_children": 1,
      "replies": [
        {
          "id": "homq283",
          "text": "Not commenting here would have been a smart step, because the more you use the subreddit, the more interested Reddit thinks you are.",
          "timestamp": "2021-12-15 10:59:44",
          "score": 3,
          "num_children": 0,
          "author": 318636,
          "replies": []
        }
      ]
    },
    {
      "id": "homyesq",
      "text": "People PEOPLE **PEOPLE** !!!\n\nThese numbers are disappointing! What is going on here? Are we godless heathens *SLACKING* ???\n\nI expect these numbers to be MUCH higher, now, *GET OUT THERE AND MAKE IT HAPPEN  !!!*\n\nI can't believe we have to keep having these talks...\n\n:)",
      "timestamp": "2021-12-15 12:36:30",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hon2amk",
      "text": "Huh. Why are so many Americans trusting their taxes with atheists?\n\n*ba-dum tssss*\nThank you, I'm here all week!",
      "timestamp": "2021-12-15 13:13:50",
      "score": 1,
      "num_children": 0,
      "author": 84238,
      "replies": []
    },
    {
      "id": "hon2dq5",
      "text": "Silent majority in no time",
      "timestamp": "2021-12-15 13:14:37",
      "score": 1,
      "num_children": 0,
      "author": 95146,
      "replies": []
    },
    {
      "id": "hon2we7",
      "text": "Thanks, Trump!",
      "timestamp": "2021-12-15 13:19:18",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hon3ab6",
      "text": "Thank God ! oh wait ….",
      "timestamp": "2021-12-15 13:22:45",
      "score": 1,
      "num_children": 0,
      "author": 191722,
      "replies": []
    },
    {
      "id": "hon4xrx",
      "text": "Very disappointing, but it's a start.",
      "timestamp": "2021-12-15 13:37:00",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hon5hbp",
      "text": "Just another century or so and folks won’t look at me weird for not believing in a literal fairy tale.",
      "timestamp": "2021-12-15 13:41:38",
      "score": 1,
      "num_children": 0,
      "author": 372146,
      "replies": []
    },
    {
      "id": "hon5ttd",
      "text": "That number is only going to get bigger.",
      "timestamp": "2021-12-15 13:44:35",
      "score": 1,
      "num_children": 0,
      "author": 195048,
      "replies": []
    },
    {
      "id": "hon6a0m",
      "text": "LETS GOOO",
      "timestamp": "2021-12-15 13:48:20",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hon6pel",
      "text": "Honestly thought it would be higher. Not by much but still.",
      "timestamp": "2021-12-15 13:51:47",
      "score": 1,
      "num_children": 0,
      "author": 93850,
      "replies": []
    },
    {
      "id": "hon7gw6",
      "text": "Those are rookie numbers.",
      "timestamp": "2021-12-15 13:58:02",
      "score": 1,
      "num_children": 0,
      "author": 158149,
      "replies": []
    },
    {
      "id": "hon89il",
      "text": "Moving in the right direction",
      "timestamp": "2021-12-15 14:04:33",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hon8an6",
      "text": "We gotta pump those numbers up, those are rookie numbers!",
      "timestamp": "2021-12-15 14:04:49",
      "score": 1,
      "num_children": 0,
      "author": 327169,
      "replies": []
    },
    {
      "id": "hon8qem",
      "text": "So 61% still believe in a book of fictional plays.",
      "timestamp": "2021-12-15 14:08:24",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hon8wdk",
      "text": "I’m atheist but I told the government I was Catholic when I was 16 because my Mom was helping me fill out the paper work.\n\nI feel like a lot of people fall into this category.",
      "timestamp": "2021-12-15 14:09:42",
      "score": 1,
      "num_children": 0,
      "author": 13459,
      "replies": []
    },
    {
      "id": "hon9tqc",
      "text": "Maybe John Lennon was right. Imagine that.",
      "timestamp": "2021-12-15 14:16:58",
      "score": 1,
      "num_children": 0,
      "author": 379431,
      "replies": []
    },
    {
      "id": "hona7ro",
      "text": "A lot of these people still believe in God. They just don't specify one religion.",
      "timestamp": "2021-12-15 14:19:57",
      "score": 1,
      "num_children": 0,
      "author": 306120,
      "replies": []
    },
    {
      "id": "honb4v1",
      "text": "Push these numbers  up and we can start feeding chriatians to lions",
      "timestamp": "2021-12-15 14:26:56",
      "score": 1,
      "num_children": 0,
      "author": 327398,
      "replies": []
    },
    {
      "id": "honcgxo",
      "text": "We’re winning fellas, in 50 years this may be a mostly atheist land in the states",
      "timestamp": "2021-12-15 14:36:59",
      "score": 1,
      "num_children": 0,
      "author": 69421,
      "replies": []
    },
    {
      "id": "hondcgg",
      "text": "Vote in praimries.",
      "timestamp": "2021-12-15 14:43:34",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hondp25",
      "text": "It’s about fucking time. One of the few things I appreciate about Europeans, way more have already accepted that there’s no fucking magical sky daddy.\n\nGrow tf up.",
      "timestamp": "2021-12-15 14:46:10",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "honecly",
      "text": "Doesn't feel that way at all. But again I live in Texas, so...",
      "timestamp": "2021-12-15 14:50:58",
      "score": 1,
      "num_children": 0,
      "author": 49339,
      "replies": []
    },
    {
      "id": "honf9ui",
      "text": "Give it a few more years, and that number will be much higher. It’s the southern states keeping it real high.",
      "timestamp": "2021-12-15 14:57:43",
      "score": 1,
      "num_children": 0,
      "author": 373632,
      "replies": []
    },
    {
      "id": "honh7em",
      "text": "Idiots. Dont they know they can use religion to justify any and all shitty beliefs they have?",
      "timestamp": "2021-12-15 15:11:33",
      "score": 1,
      "num_children": 0,
      "author": 396215,
      "replies": []
    },
    {
      "id": "honiobp",
      "text": "Only 29%",
      "timestamp": "2021-12-15 15:21:52",
      "score": 1,
      "num_children": 1,
      "author": 83006,
      "replies": [
        {
          "id": "honisk1",
          "text": "The good news is that the Christians are losing followers",
          "timestamp": "2021-12-15 15:22:39",
          "score": 1,
          "num_children": 1,
          "author": 396073,
          "replies": [
            {
              "id": "honiyxz",
              "text": "They’re gaining more leverage in government control.",
              "timestamp": "2021-12-15 15:23:52",
              "score": 1,
              "num_children": 0,
              "author": 83006,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "honl7jt",
      "text": "… and almost zero represented in government.",
      "timestamp": "2021-12-15 15:38:54",
      "score": 1,
      "num_children": 0,
      "author": 273442,
      "replies": []
    },
    {
      "id": "honluzr",
      "text": "Good",
      "timestamp": "2021-12-15 15:43:08",
      "score": 1,
      "num_children": 0,
      "author": 230834,
      "replies": []
    },
    {
      "id": "honnat7",
      "text": "Sweet, just 71 percent more to go",
      "timestamp": "2021-12-15 15:52:23",
      "score": 1,
      "num_children": 0,
      "author": 199429,
      "replies": []
    },
    {
      "id": "hontwsm",
      "text": "This means 29 percent of population is American, which is a scary thought. There are either too many Americans, or not enough people",
      "timestamp": "2021-12-15 16:35:45",
      "score": 1,
      "num_children": 0,
      "author": 248503,
      "replies": []
    },
    {
      "id": "hontx0h",
      "text": "Now they just need to vote accordingly.",
      "timestamp": "2021-12-15 16:35:47",
      "score": 1,
      "num_children": 0,
      "author": 156128,
      "replies": []
    },
    {
      "id": "honurvu",
      "text": "Fuck yea!",
      "timestamp": "2021-12-15 16:41:22",
      "score": 1,
      "num_children": 0,
      "author": 163439,
      "replies": []
    },
    {
      "id": "honz9dn",
      "text": "One of the few things that gives me hope",
      "timestamp": "2021-12-15 17:10:46",
      "score": 1,
      "num_children": 0,
      "author": 82335,
      "replies": []
    },
    {
      "id": "honzsmd",
      "text": "It's more than that but most folks don't want to deal with the absolute shit fit most christians have when faced with an atheist.  They believe every atheist has a christian inside them desperate to come out.  They are the embodiment of no one wants to be a sucker alone.",
      "timestamp": "2021-12-15 17:14:16",
      "score": 1,
      "num_children": 0,
      "author": 37213,
      "replies": []
    },
    {
      "id": "hoo0y7c",
      "text": "If I only I could live to see 100% 😞",
      "timestamp": "2021-12-15 17:21:39",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hoo1ehh",
      "text": "70% is religious? wtf is wrong with your country? Do you have no schools?",
      "timestamp": "2021-12-15 17:24:33",
      "score": 1,
      "num_children": 0,
      "author": 133,
      "replies": []
    },
    {
      "id": "hoo1rvg",
      "text": "That's very good news.",
      "timestamp": "2021-12-15 17:26:54",
      "score": 1,
      "num_children": 0,
      "author": 10498,
      "replies": []
    },
    {
      "id": "hoo38b2",
      "text": "Better, but still a ways to go.",
      "timestamp": "2021-12-15 17:36:12",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hoo4an9",
      "text": "A good sign for humanity",
      "timestamp": "2021-12-15 17:42:59",
      "score": 1,
      "num_children": 0,
      "author": 361267,
      "replies": []
    },
    {
      "id": "hoo71bx",
      "text": "Time to start being more forward and visible about it. I'm proud of my reality-based understanding of the universe. Mythology belongs to the past.",
      "timestamp": "2021-12-15 18:00:23",
      "score": 1,
      "num_children": 0,
      "author": 395348,
      "replies": []
    },
    {
      "id": "hoo7wx3",
      "text": "In Portugal 90 % are Catholic, but from this, 80% don't go to church, they say that are \"non-practitioner\" Catholic , the only reason that they tell that are Catholic is that is culture thing, is the way that is be Portuguese, in the mind of most people, to be Portuguese is be catolic... So they don't believe it, is a way to be patriotic..",
      "timestamp": "2021-12-15 18:06:00",
      "score": 1,
      "num_children": 0,
      "author": 275823,
      "replies": []
    },
    {
      "id": "hoo9jnl",
      "text": "Until all religion is over...\n\nhttps://www.youtube.com/watch?v=Qn0cAfuOhwU",
      "timestamp": "2021-12-15 18:16:40",
      "score": 1,
      "num_children": 0,
      "author": 156967,
      "replies": []
    },
    {
      "id": "hooaxtu",
      "text": "Then WHY are we still letting the minority hard-core religious run the country (into the ground)?",
      "timestamp": "2021-12-15 18:25:45",
      "score": 1,
      "num_children": 0,
      "author": 181455,
      "replies": []
    },
    {
      "id": "hoobuqu",
      "text": "And the world is getting worse. Awesome.",
      "timestamp": "2021-12-15 18:31:41",
      "score": 1,
      "num_children": 0,
      "author": 202329,
      "replies": []
    },
    {
      "id": "hoobvjp",
      "text": "I think it's mainly because the people who are so pro-religion are fucking crazy.",
      "timestamp": "2021-12-15 18:31:50",
      "score": 1,
      "num_children": 0,
      "author": 382990,
      "replies": []
    },
    {
      "id": "hoocg9x",
      "text": "That’s so sad there’s only 29% of level headed population:/",
      "timestamp": "2021-12-15 18:35:32",
      "score": 1,
      "num_children": 0,
      "author": 183376,
      "replies": []
    },
    {
      "id": "hood9qx",
      "text": "These numbers are kind of misleading. A large percentage of the \"nones\" are people still are very much still religious, they just don't align with any particular religion. This includes people that believe in some kind of nebulous concept of \"God\", even if it's not the God of the Abrahamic religions.\n\nI mean, it's great that they don't buy into the organized religion bullshit, but they still believe in invisible sky men.\n\nAtheists are still only 4% and agnostics 5%",
      "timestamp": "2021-12-15 18:40:49",
      "score": 1,
      "num_children": 0,
      "author": 381136,
      "replies": []
    },
    {
      "id": "hoodcf7",
      "text": "No religion doesn't mean they're not theistic though.",
      "timestamp": "2021-12-15 18:41:17",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hoodxu3",
      "text": "Personally, I'm fine if people want to believe in some God. As long as they long let affect how they vote. Or try to cram it down someone's face.",
      "timestamp": "2021-12-15 18:45:05",
      "score": 1,
      "num_children": 0,
      "author": 191891,
      "replies": []
    },
    {
      "id": "hoof1m3",
      "text": "One of us!!",
      "timestamp": "2021-12-15 18:52:08",
      "score": 1,
      "num_children": 0,
      "author": 2535,
      "replies": []
    },
    {
      "id": "hooh9r9",
      "text": "I suspect the Evangelicals are helping to drive up that number. I’m already there.",
      "timestamp": "2021-12-15 19:06:26",
      "score": 1,
      "num_children": 0,
      "author": 138355,
      "replies": []
    },
    {
      "id": "hooi00l",
      "text": "Yet we probably have 4 total senators.",
      "timestamp": "2021-12-15 19:11:09",
      "score": 1,
      "num_children": 0,
      "author": 127096,
      "replies": []
    },
    {
      "id": "hookh5n",
      "text": "I believe everyone subconsciously wants to be non-religious. The people that stay religious are just scared of eternal punishment.",
      "timestamp": "2021-12-15 19:26:52",
      "score": 1,
      "num_children": 0,
      "author": 363337,
      "replies": []
    },
    {
      "id": "hooltei",
      "text": "No wonder why our country is falling apart. /s",
      "timestamp": "2021-12-15 19:35:29",
      "score": 1,
      "num_children": 0,
      "author": 26410,
      "replies": []
    },
    {
      "id": "hoomh5c",
      "text": "Wish it was more",
      "timestamp": "2021-12-15 19:39:40",
      "score": 1,
      "num_children": 0,
      "author": 52288,
      "replies": []
    },
    {
      "id": "hoon96s",
      "text": "Music to my ears!",
      "timestamp": "2021-12-15 19:44:37",
      "score": 1,
      "num_children": 0,
      "author": 154441,
      "replies": []
    },
    {
      "id": "hoonh8v",
      "text": "Gotta pump those numbers up!",
      "timestamp": "2021-12-15 19:46:03",
      "score": 1,
      "num_children": 0,
      "author": 403371,
      "replies": []
    },
    {
      "id": "hooo3rv",
      "text": "Best story so far today!",
      "timestamp": "2021-12-15 19:50:00",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hoos97k",
      "text": "If this is true people need to speak up.",
      "timestamp": "2021-12-15 20:16:38",
      "score": 1,
      "num_children": 0,
      "author": 231258,
      "replies": []
    },
    {
      "id": "hoouiag",
      "text": "Pretty sure half of those who identify as theists actually don't believe in god. I'm such an example. A Christian for the sake of my parents.",
      "timestamp": "2021-12-15 20:31:01",
      "score": 1,
      "num_children": 0,
      "author": 29394,
      "replies": []
    },
    {
      "id": "hoovhru",
      "text": "Americans who actually follow their religion: .000001%.",
      "timestamp": "2021-12-15 20:37:21",
      "score": 1,
      "num_children": 0,
      "author": 77010,
      "replies": []
    },
    {
      "id": "hooyeii",
      "text": "I feel that is slightly lower than it actually is",
      "timestamp": "2021-12-15 20:56:20",
      "score": 1,
      "num_children": 0,
      "author": 170773,
      "replies": []
    },
    {
      "id": "hooyn0b",
      "text": "Yessssssss",
      "timestamp": "2021-12-15 20:57:52",
      "score": 1,
      "num_children": 0,
      "author": 384924,
      "replies": []
    },
    {
      "id": "hop4ofe",
      "text": ">According to the findings, \"nones,\" which refers to Americans who do not identify as having any religious affiliations, now make up around 29 percent of U.S. adults\n\nI wonder what the % disparity would be if,  in addition to the option for \"none\", they added another option for \"atheist\".",
      "timestamp": "2021-12-15 21:36:39",
      "score": 1,
      "num_children": 0,
      "author": 301633,
      "replies": []
    },
    {
      "id": "hopapqx",
      "text": "I’ve searched but never found. I’m sure a majority of that 29% feels the same way.",
      "timestamp": "2021-12-15 22:16:28",
      "score": 1,
      "num_children": 0,
      "author": 114705,
      "replies": []
    },
    {
      "id": "hopc8wm",
      "text": "There used to be a lot of people who would answer that they were Christian even though they weren't because Christianity was acceptable and considered good.  Christians have made such a bad name of the term \"Christianity\" with their hate and hypocrisy that a lot of people no longer want to be associated with the term.",
      "timestamp": "2021-12-15 22:26:51",
      "score": 1,
      "num_children": 0,
      "author": 174609,
      "replies": []
    },
    {
      "id": "hopft7q",
      "text": "Only 29%? How many were in the group that they polled?",
      "timestamp": "2021-12-15 22:51:27",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hopi5z6",
      "text": "good news",
      "timestamp": "2021-12-15 23:07:57",
      "score": 1,
      "num_children": 0,
      "author": 5102,
      "replies": []
    },
    {
      "id": "hopvqbz",
      "text": "Maybe idk how statistics work but I feel like it would prolly be much higher if the sample size was larger than 4,000. I wish I could have participated",
      "timestamp": "2021-12-16 00:48:32",
      "score": 1,
      "num_children": 1,
      "author": 210318,
      "replies": [
        {
          "id": "hopwdvg",
          "text": ">Maybe idk how statistics work\n\nYou don't. \n\n>but I feel like it would prolly be much higher if the sample size was larger than 4,000\n\nNah.\n\n>I wish I could have participated\n\nThere's always a next poll for anything, don't worry!",
          "timestamp": "2021-12-16 00:53:23",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hopz3zv",
              "text": "So how does a 4,000 person sample size indicate a good depiction of the entire country of 300m?\n\nNot being sarcastic generally curious because I would think sample size and location would be two pretty important factors",
              "timestamp": "2021-12-16 01:14:09",
              "score": 1,
              "num_children": 1,
              "author": 210318,
              "replies": [
                {
                  "id": "hoq0rqz",
                  "text": "If they didn't fuck up the study design, yes. \n\nHere in Germany sample size is usually about a thousand people, and that's entirely sufficient. Adjusted for population that's essentially the same anyway (of course this is only scalable so far - it doesn't mean that it's enough to ask one dude in Liechtenstein to get an accurate picture from there). \n\nYes, location is important. But it's not like they do the survey in one single place or something or don't adjust it for demographics. At least that's what I hope, I didn't look into this study I particular.\n\nFor the most part however it's close to irrelevant whether you ask 4,000 or 80,000 people. The minuscule gain in accuracy is totally offset by the expenditure of polling. \n\nIt's not like they *couldn't* do this in principle or just don't *care* about producing a good result, it's just not worth it, since the results are already quite accurate. Even if were +/- 2 to 3 percentage points, it doesn't really matter that much anyway, does it? The trend is pretty strong either way.",
                  "timestamp": "2021-12-16 01:26:43",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hoq6uf5",
      "text": "Does \"no religion\" mean that they a) have no religious faith,  b) aren't affiliated with any church, or c) neither one?\n\nUnfortunately, the decline in religious identification doesn't mean that a 29% minority of Americans think rationally, hold science in high fregard, value facts over faith or base their beliefs on evidence. The MAGA and anti-vaccine phenomena have demonstrated that many Americans exalt faith over fact, rhetoric over facts and and personal charisma over truth.\n\nIn many respects, MAGA is a religious cult.\n\nPart of the decline in organized religion has everything to do with sexual abuse in the Roman Catholic and other churches and very little to do with religiosity. Many Americans - including ex-Catholics - have renounced organized religion, but still believe - without evidentiary support - that God created the universe in seven days, that the Bible was divinely inspired, that Jesus answers prayers and that we live on in heaven or hell after death.\n\nAnd oppose abortion on religious grounds.\n\nIn short, they've shitcanned the institution but they've kept the faith.\n\nOthers who \"identify with no religion\" still believe in some sort of vague spirituality or deism - the belief that all nature is interconnected by some undefined spiritual or divine force.\n\nAnd still others are superstitious, believing in good and bad luck, astrology, omens and portents, \"thoughts and prayers,\" and the power of positive thinking and divine providence.\n\nA fractional decline in organized religion is an encouraging trend, but we have a long way to go before we have a truly just, rational and secular society.",
      "timestamp": "2021-12-16 02:11:57",
      "score": 1,
      "num_children": 0,
      "author": 95432,
      "replies": []
    },
    {
      "id": "hoq89a8",
      "text": "Is that up or down?",
      "timestamp": "2021-12-16 02:22:12",
      "score": 1,
      "num_children": 0,
      "author": 273722,
      "replies": []
    },
    {
      "id": "hoqab05",
      "text": "\"71% of americans have no critical thinking skills.\"\n\nsounds about right honestly.",
      "timestamp": "2021-12-16 02:37:12",
      "score": 1,
      "num_children": 0,
      "author": 78825,
      "replies": []
    },
    {
      "id": "hoqbqj6",
      "text": "Ugh, I hate the term “nones”. That term lumps together too many people with vastly different beliefs. Not being religious and being an atheist are not necessarily the same thing. It is entirely possible for a theist to simply not belong to any organized religion, but have their own personal goofy beliefs. \n\n\nI don’t feel particularly enamored with the idea of being lumped in with the “spiritual but not religious” dingalings.",
      "timestamp": "2021-12-16 02:47:41",
      "score": 1,
      "num_children": 0,
      "author": 319926,
      "replies": []
    },
    {
      "id": "hoqetkp",
      "text": "important to note that:\n\n1) religion =/= faith. people who are disillusioned with the catholic church, for example, may still believe in god and simply not be active within an organized religion community.\n\nand\n\n2) religion =/= belief in the supernatural or irrational.\n\nit's very possible that wacky subcultures within the \"wellness\" community have supplanted religion for many people.",
      "timestamp": "2021-12-16 03:10:36",
      "score": 1,
      "num_children": 0,
      "author": 277713,
      "replies": []
    },
    {
      "id": "horz2we",
      "text": "Does this mean 29% atheist? Or 29% atheist/no religion",
      "timestamp": "2021-12-16 13:18:37",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hos1lam",
      "text": "“Pump, pump it up!”",
      "timestamp": "2021-12-16 13:40:11",
      "score": 1,
      "num_children": 0,
      "author": 317697,
      "replies": []
    },
    {
      "id": "hos7ult",
      "text": "I think atheist and agnostic still hide. If you live in the Bible Belt you keep to yourself cause you’ll be called out quickly and condemned.",
      "timestamp": "2021-12-16 14:29:40",
      "score": 1,
      "num_children": 0,
      "author": 303895,
      "replies": []
    },
    {
      "id": "homj9f4",
      "text": "[removed]",
      "timestamp": "2021-12-15 09:23:45",
      "score": -17,
      "num_children": 3,
      "replies": [
        {
          "id": "homliaz",
          "text": "We've been waiting for a god—any at all—to step in for the last, oh I don't know, how old is human civilization? about 15000 years?\n\nSo yeah, good luck with that \"when God steps in\" bullshit.",
          "timestamp": "2021-12-15 09:56:04",
          "score": 10,
          "num_children": 0,
          "author": 66802,
          "replies": []
        },
        {
          "id": "homlobs",
          "text": "Oh please, deities have had thousands of years to step up and show themselves if they actually existed.",
          "timestamp": "2021-12-15 09:58:27",
          "score": 8,
          "num_children": 0,
          "author": 34143,
          "replies": []
        },
        {
          "id": "homvviq",
          "text": "What's your god waiting for? A vacation day?",
          "timestamp": "2021-12-15 12:10:05",
          "score": 6,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "holxkcz",
      "text": "[deleted]",
      "timestamp": "2021-12-15 05:07:13",
      "score": -15,
      "num_children": 2,
      "replies": [
        {
          "id": "hom8zej",
          "text": "How so?",
          "timestamp": "2021-12-15 07:07:07",
          "score": 6,
          "num_children": 0,
          "author": 274297,
          "replies": []
        },
        {
          "id": "hombvzz",
          "text": "Some people treat their political stance as a religion, but it's not a religion by itself, the problem is the people that is dogmatic about their ideas.",
          "timestamp": "2021-12-15 07:43:19",
          "score": 6,
          "num_children": 0,
          "author": 223173,
          "replies": []
        }
      ]
    },
    {
      "id": "honjho1",
      "text": "How do you deal with X-Mass ? I find it difficult to explain to almost everyone what Winter Solstice is... i.e. I don't celebrate Jesus birthday.  Then, I ended-up offending people... But, I dont want to come off as a Scruge..?",
      "timestamp": "2021-12-15 15:27:25",
      "score": -2,
      "num_children": 0,
      "author": 399799,
      "replies": []
    }
  ]
}