{
  "id": "rh46mq",
  "text": "I just threw up in my mouth a little bit...\n",
  "timestamp": "2021-12-15 17:21:03",
  "score": 5191,
  "subreddit": "t5_3fdcn",
  "num_children": 160,
  "replies": [
    {
      "id": "hoo0uvw",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2021-12-15 17:21:03",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "hooi0u1",
      "text": "There were loads of people saying he isn't politically involved and doesn't want money or fame while defending him. Then he goes and does this shit. [Big surprise!](https://youtu.be/N6e5i49loRQ)\n\nEdit: [I hope this is used against him in the civil cases](https://twitter.com/thisiskyler/status/1471114936122290180?s=21)",
      "timestamp": "2021-12-15 19:11:17",
      "score": 958,
      "num_children": 10,
      "author": 195457,
      "replies": [
        {
          "id": "hoovujn",
          "text": "I told someone that it would be 3 months before he's out signing people's ARs.......guess my clock is a little slow.",
          "timestamp": "2021-12-15 20:39:40",
          "score": 401,
          "num_children": 1,
          "author": 314180,
          "replies": [
            {
              "id": "hopuvv6",
              "text": "I was saying he would be speaking at either the next CPAC or RNC. I guess his speaking engagements came a lot sooner than I would have thought.",
              "timestamp": "2021-12-16 00:42:03",
              "score": 89,
              "num_children": 1,
              "author": 57581,
              "replies": [
                {
                  "id": "hopxdlq",
                  "text": "He'll be running for office next.  Mark my words.\n\nOh, and *he'll win*. 😒",
                  "timestamp": "2021-12-16 01:00:58",
                  "score": 83,
                  "num_children": 2,
                  "author": 354546,
                  "replies": [
                    {
                      "id": "hopzm44",
                      "text": "New speaker for the NRA",
                      "timestamp": "2021-12-16 01:18:00",
                      "score": 43,
                      "num_children": 3,
                      "author": 392942,
                      "replies": [
                        {
                          "id": "hoq195b",
                          "text": "But will he become the NRA's next unregistered foreign agent?",
                          "timestamp": "2021-12-16 01:30:23",
                          "score": 25,
                          "num_children": 0,
                          "author": 246408,
                          "replies": []
                        },
                        {
                          "id": "hoqkcg8",
                          "text": "You need some business acumen to head the NRA.  I'd be shocked if the next R president didn't appoint him to the fucking Supreme Court.",
                          "timestamp": "2021-12-16 03:52:47",
                          "score": 11,
                          "num_children": 1,
                          "author": 215411,
                          "replies": [
                            {
                              "id": "hors4y2",
                              "text": "Sad that this is not out of the realm of possibility.",
                              "timestamp": "2021-12-16 12:11:56",
                              "score": 2,
                              "num_children": 0,
                              "author": 41008,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hoq89ar",
                          "text": "Oh, that would be *perfect*! \n\nBut I was thinking he'll run for *political* office.\n\nAnd he'll *win*.",
                          "timestamp": "2021-12-16 02:22:12",
                          "score": 3,
                          "num_children": 0,
                          "author": 354546,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hos02xz",
                      "text": "All it takes is to run in a very red district - which there are plenty of thanks to gerrymandering - and pretty much any crackpot can win running as a Republican.",
                      "timestamp": "2021-12-16 13:27:24",
                      "score": 2,
                      "num_children": 1,
                      "author": 57581,
                      "replies": [
                        {
                          "id": "hot7tav",
                          "text": "Well, it helps if they're batshit insane with a known history of pedophilia.",
                          "timestamp": "2021-12-16 18:28:16",
                          "score": 2,
                          "num_children": 0,
                          "author": 354546,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hop02id",
          "text": "That Twitter thread ruined my day",
          "timestamp": "2021-12-15 21:07:06",
          "score": 39,
          "num_children": 1,
          "author": 285249,
          "replies": [
            {
              "id": "hor49gs",
              "text": "That’s the whole point. Ruining your day, making people throw up in their mouths. That’s the entire political goal of the right.",
              "timestamp": "2021-12-16 07:03:55",
              "score": 20,
              "num_children": 3,
              "author": 130732,
              "replies": [
                {
                  "id": "horzra7",
                  "text": "This is a profound truth.",
                  "timestamp": "2021-12-16 13:24:34",
                  "score": 4,
                  "num_children": 0,
                  "author": 158499,
                  "replies": []
                },
                {
                  "id": "hos4n5z",
                  "text": "Yup 💯",
                  "timestamp": "2021-12-16 14:05:05",
                  "score": 2,
                  "num_children": 0,
                  "author": 308047,
                  "replies": []
                },
                {
                  "id": "hoskr7n",
                  "text": "That and fascism.",
                  "timestamp": "2021-12-16 15:59:22",
                  "score": 1,
                  "num_children": 0,
                  "author": 206883,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hooklhw",
          "text": "[deleted]",
          "timestamp": "2021-12-15 19:27:39",
          "score": 154,
          "num_children": 1,
          "replies": [
            {
              "id": "hoorz9n",
              "text": "Literally one person said that. I can’t believe how many people commented supporting him and saying how intelligent he is lmfao. \n\nIf he is intelligent that just shows how high the bar is for the right.",
              "timestamp": "2021-12-15 20:14:50",
              "score": 108,
              "num_children": 3,
              "author": 401447,
              "replies": [
                {
                  "id": "hop6g4o",
                  "text": "I mean, they're against colleges because apparently getting an education turns u into a liberal",
                  "timestamp": "2021-12-15 21:48:09",
                  "score": 45,
                  "num_children": 2,
                  "author": 392603,
                  "replies": [
                    {
                      "id": "hoq0jce",
                      "text": "Listen, if we were supposed to get a college education it would say so in the Bible!",
                      "timestamp": "2021-12-16 01:24:57",
                      "score": 19,
                      "num_children": 1,
                      "author": 388778,
                      "replies": [
                        {
                          "id": "hos4qdj",
                          "text": "😂",
                          "timestamp": "2021-12-16 14:05:47",
                          "score": 1,
                          "num_children": 0,
                          "author": 308047,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hosl7yl",
                      "text": "I mean it kind of does. But only because the right has gone down the fascism rabbit hole. \n\nThink about it:\n\nGoing away from your Faux news loving white Christian fascist family and meeting people from all over the world with completely different worldviews, learning how to see things from a new perspective, learning facts….yes. College liberalizes people. But bit because of some plot. Because the right has completely lost its mind.",
                      "timestamp": "2021-12-16 16:02:28",
                      "score": 1,
                      "num_children": 0,
                      "author": 206883,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hop1xqv",
                  "text": "The bar is hard to get to with all the magma",
                  "timestamp": "2021-12-15 21:19:09",
                  "score": 31,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hopadd9",
                  "text": "[deleted]",
                  "timestamp": "2021-12-15 22:14:10",
                  "score": 5,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hopavoe",
                      "text": "Yeah Twitter algorithm sucks. I was just half excited to see them actually stand their grounds for once. \n\nOh well at least some have a spine I guess",
                      "timestamp": "2021-12-15 22:17:36",
                      "score": 4,
                      "num_children": 0,
                      "author": 401447,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hop8d91",
          "text": "jesus fucking christ. The \"more tweets\" section under his tweet made me want to forget how to read",
          "timestamp": "2021-12-15 22:00:38",
          "score": 21,
          "num_children": 1,
          "author": 264408,
          "replies": [
            {
              "id": "hoprbe5",
              "text": "Kevin Sorbo spreading his verbal diarrhea as usual. Shame. I liked Andromeda.",
              "timestamp": "2021-12-16 00:14:56",
              "score": 14,
              "num_children": 1,
              "author": 40533,
              "replies": [
                {
                  "id": "hoqndr3",
                  "text": "The best part about Kevin Sorbo on Twitter is Lucy Lawless constantly trolling him",
                  "timestamp": "2021-12-16 04:18:07",
                  "score": 18,
                  "num_children": 0,
                  "author": 138592,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hoq0h51",
          "text": "He was politically involved enough to go out of State to attend a Trump rally in 2020.",
          "timestamp": "2021-12-16 01:24:29",
          "score": 20,
          "num_children": 0,
          "author": 392623,
          "replies": []
        },
        {
          "id": "hop8y4c",
          "text": "They’ll look at this and not even question their loyalty or own morals. They’ll simply readjust and find a new argument to support it now.",
          "timestamp": "2021-12-15 22:04:32",
          "score": 12,
          "num_children": 0,
          "author": 266061,
          "replies": []
        },
        {
          "id": "hopm4au",
          "text": "What a fucking monster. Kyle Rittenhouse is a total piece of shit and a complete dirtbag that proves how corrupt and malicious and unequal our legal system is in the USA.\n\nIt wouldn't surprise me at all if killing people in the street becomes a prerequisite for joining the Republican party. \n\nOur country is doomed and deserves what's coming.",
          "timestamp": "2021-12-15 23:36:27",
          "score": 62,
          "num_children": 2,
          "author": 384130,
          "replies": [
            {
              "id": "hoqjwph",
              "text": "They’re holding over half of us hostage.  \n\nA solid half of America just wants to live in harmony and general peace except for necessary discourse.  This needs to be put to a fucking end.",
              "timestamp": "2021-12-16 03:49:26",
              "score": 24,
              "num_children": 1,
              "replies": [
                {
                  "id": "hoqydcj",
                  "text": "[deleted]",
                  "timestamp": "2021-12-16 05:59:07",
                  "score": 9,
                  "num_children": 3,
                  "replies": [
                    {
                      "id": "hor2tzl",
                      "text": "Not possible.  Traditional red states have hundreds of heavily populated blue areas that have been systematically disenfranchised from having any say in who is elected, even presidentially.  Races nowadays are not won through sheer votes, but through whether or not democrats can overcome republican election rigging that happens years before votes are cast.  We cannot abandon our brothers and sisters in these states, and we cannot allow ourselves to fall to division.  That's exactly what they want.  We need to target the real problem - the fact that they are rigging elections as we speak and the fact that they're openly fascist now.  We need to fight the republican party itself, not on a voting or optics level, but on the streets.  Protest.  Make the french proud, do so over their shitty voting laws, over their fucked up abortion laws and their court stacking and all of it.  We need to let these pieces of shit  know that a majority of America wants progress and peace, not war and regression.  We need to let them know by force, and soon, otherwise they will destroy us.",
                      "timestamp": "2021-12-16 06:47:20",
                      "score": 10,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hoslir5",
                          "text": "Also the red states are welfare queens. Their entire way of life wouldn’t work without the blue states and areas on their states making money and giving it to them.",
                          "timestamp": "2021-12-16 16:04:28",
                          "score": 2,
                          "num_children": 0,
                          "author": 206883,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hor80mz",
                      "text": "This problem could be fixed by disconnecting the internet. Or at least by deleting all social media platforms and removing all comments sections from every website. This shit started with social media…now everything is political and everyone has an opinion that they can share with the world, anonymously. Unfortunately, you can’t put the genie back in the bottle.",
                      "timestamp": "2021-12-16 07:49:50",
                      "score": 2,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "hora512",
                      "text": "At least in California, all the trumpers would be fleeing the central valley in droves. There would be nobody left.\n\n\"Blue\" and \"Red\" states really aren't.",
                      "timestamp": "2021-12-16 08:17:21",
                      "score": 2,
                      "num_children": 1,
                      "author": 183164,
                      "replies": [
                        {
                          "id": "hp3h72s",
                          "text": "I agree with this one, the fact that Biden was voted for over Republican alternatives shows how California was able to sort of get their act together briefly and accept the faults of the Red voters false messages as a path to not go down this presidential term. A lot of Republican voters may come around over time, but it's the issue of getting them to understand they are being used and abused by their leaders and moved around like pieces of a chess game. We are all people and need the same quality of life as the next and eventually the majority will accept this one basic fact and push forward to ensure we no longer allow future generations to be brainwashed and bullied into changing lanes.",
                          "timestamp": "2021-12-18 22:01:03",
                          "score": 1,
                          "num_children": 0,
                          "author": 384130,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hosjswj",
              "text": "The only problem is that a lot of innocent people are going to get caught in the crossfire. The very same people that these right-wing scumbags are holding hostage, it makes me hope that the afterlife is real. Because there are a lot of people who will be going to heaven and hell if it is. Victims and their killers mostly.",
              "timestamp": "2021-12-16 15:53:02",
              "score": 2,
              "num_children": 1,
              "author": 45188,
              "replies": [
                {
                  "id": "hp3gjsw",
                  "text": "If only an afterlife was something we could tune into and watch on TV.",
                  "timestamp": "2021-12-18 21:55:50",
                  "score": 2,
                  "num_children": 0,
                  "author": 384130,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hoq3i18",
          "text": "Money talks…",
          "timestamp": "2021-12-16 01:47:16",
          "score": 1,
          "num_children": 0,
          "author": 383076,
          "replies": []
        },
        {
          "id": "hoshky7",
          "text": "He had been going to right-wing talk shows and claiming that he's not a hero, that he doesn't want to get involved politically, and that he only agreed to speak to \"clear the record\" and \"show his support and sympathy for BLM\"\n\nSo it's good to know that it was just an act to look good in court and discourage the fed from pressing charges\n\nIt's a real shame. This little scumbag claiming to learn something and that he doesn't want to be a conservative folk hero, almost restored some of my faith in humanity. So of course he's fucking lying. I swear sometimes you have to actively try not to be a nihilistic piece of shit in this world.\n\nI hope they annihilate this murderous child in civil court",
          "timestamp": "2021-12-16 15:38:19",
          "score": 1,
          "num_children": 0,
          "author": 45188,
          "replies": []
        },
        {
          "id": "hoso2tr",
          "text": "I don't want a fat juicy steak right now at 11 in the morning, but that doesn't mean that I would turn one down.",
          "timestamp": "2021-12-16 16:21:18",
          "score": 1,
          "num_children": 1,
          "author": 203994,
          "replies": [
            {
              "id": "hotiyuj",
              "text": "It's more going out of your house to go out and buy and then cook",
              "timestamp": "2021-12-16 19:41:20",
              "score": 1,
              "num_children": 0,
              "author": 195457,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hoo29aq",
      "text": "Didn't he just say he wasn't about all that qanon shit? Gasp, seems like he'll do anything to be famous. Even commit murder.",
      "timestamp": "2021-12-15 17:29:59",
      "score": 459,
      "num_children": 5,
      "author": 339320,
      "replies": [
        {
          "id": "hopmfs5",
          "text": "The dude went looking for an opportunity to put himself in a situation where he could shoot people.  You think he's above being a liar?",
          "timestamp": "2021-12-15 23:38:45",
          "score": 50,
          "num_children": 2,
          "author": 349724,
          "replies": [
            {
              "id": "hopmj06",
              "text": "No. That's the joke.",
              "timestamp": "2021-12-15 23:39:25",
              "score": 10,
              "num_children": 1,
              "author": 339320,
              "replies": [
                {
                  "id": "hopna6w",
                  "text": "Oh shit, somehow my brain completely skipped \"Gasp\" at the beginning of the second sentence.  My mistake!\n\nApparently it skipped everything after the first sentence.  Today was a day, man.",
                  "timestamp": "2021-12-15 23:44:56",
                  "score": 8,
                  "num_children": 0,
                  "author": 349724,
                  "replies": []
                }
              ]
            },
            {
              "id": "hopuj30",
              "text": "[removed]",
              "timestamp": "2021-12-16 00:39:17",
              "score": -2,
              "num_children": 2,
              "replies": [
                {
                  "id": "hoqfldh",
                  "text": "Ok, and?  Are you insinuating that I'm coming to the defense or Rosenbaum or something?  Rosenbaum's behavior doesn't negate the fact that Rittenhouse deliberately put himself into a situation where he could possibly get the opportunity to shoot someone.",
                  "timestamp": "2021-12-16 03:16:26",
                  "score": 4,
                  "num_children": 0,
                  "author": 349724,
                  "replies": []
                },
                {
                  "id": "hoqkgym",
                  "text": "So you’re saying rosenbaum was a bad actor who wasn’t aligned with BLM and their interests?  \n\nAND that he made it clear multiple times that night?\n\nAND that rosenbaum wouldn’t have acted that way had people with guns not been there?\n\nAND you’re saying Kyle knew someone in the crowd was severely unhinged and still decided to split away from the group he was with, and unsurprisingly ended up having to use his gun?  \n\nSeems like Kyle was a big part of the reason any bullets were fired that night.  Wonder if he should be responsible for the bullets he willingly brought to a high stakes, high tension environment.",
                  "timestamp": "2021-12-16 03:53:47",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hoobvzp",
          "text": "His mom needs new teeth. Those bills don’t pay themselves",
          "timestamp": "2021-12-15 18:31:55",
          "score": 173,
          "num_children": 0,
          "author": 130408,
          "replies": []
        },
        {
          "id": "hookhtx",
          "text": "Kid is a teenager. He's impressionable and he is being groomed into being a true right-wing radical. He is literally at ground zero of conspiracy cult land. Whatever modicum of sense he might have had will quickly be erased by the cult that's grooming him. \n\nAnd mind you, I don't mean to portray him as a victim here. I'm simply stating that *if* he doesn't believe in Q-anon now, he absolutely fucking will by the time this cult is through with him.",
          "timestamp": "2021-12-15 19:26:59",
          "score": 253,
          "num_children": 1,
          "author": 169109,
          "replies": [
            {
              "id": "hoomb72",
              "text": "He DID get a visit to The Child King in Mar-A-Lie-Go, so he is the anointed one.",
              "timestamp": "2021-12-15 19:38:37",
              "score": 100,
              "num_children": 1,
              "author": 271845,
              "replies": [
                {
                  "id": "hooy0dk",
                  "text": "Yeah, in a way I feel sorry for him. He got caught up in right wing bullshit and decided to play at being a proud boy, without realizing just how dangerous that is. Killed two people which is going to fuck with his perception of reality for the rest of his life, a distortion fed and amplified by America’s rabid right wing to the point he’s become their totem of the “ideal” youth. Not to say he deserves sympathy, but this entire situation has somehow evolved into a much darker mummer’s show than I think anyone was expecting.",
                  "timestamp": "2021-12-15 20:53:47",
                  "score": 55,
                  "num_children": 3,
                  "author": 332503,
                  "replies": [
                    {
                      "id": "hopdnow",
                      "text": "Not sure if any part of this could not have been entirely predicted a year ago. Just fill in the names, dates, and places. \n\nThere is no light under which I feel bad for him.",
                      "timestamp": "2021-12-15 22:36:34",
                      "score": 19,
                      "num_children": 0,
                      "author": 379188,
                      "replies": []
                    },
                    {
                      "id": "hopcnic",
                      "text": "Hitlerjugend",
                      "timestamp": "2021-12-15 22:29:39",
                      "score": 14,
                      "num_children": 0,
                      "author": 271845,
                      "replies": []
                    },
                    {
                      "id": "hopxqjn",
                      "text": "He's a piece of shit that killed people and is cashing in on it because our country is full of hate, ignorance and racism. I hope his life is miserable and he never knows happiness.",
                      "timestamp": "2021-12-16 01:03:35",
                      "score": 25,
                      "num_children": 0,
                      "author": 268985,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hoq4ft8",
          "text": "I wonder how much money they threw at him to do this",
          "timestamp": "2021-12-16 01:54:08",
          "score": 2,
          "num_children": 0,
          "author": 47439,
          "replies": []
        },
        {
          "id": "horrer3",
          "text": "Kyle has basically been added to the Q bible as a prophet",
          "timestamp": "2021-12-16 12:04:16",
          "score": 2,
          "num_children": 0,
          "author": 263916,
          "replies": []
        }
      ]
    },
    {
      "id": "hoo44bh",
      "text": "Qualifications to be a political speaker for the left:  ideally post-graduate degree in political science, experience in a political office, or well known political pundit online\n\nQualifications to be a political speaker for the right:  shoot BLM protestors",
      "timestamp": "2021-12-15 17:41:52",
      "score": 1285,
      "num_children": 12,
      "author": 201921,
      "replies": [
        {
          "id": "hoofsac",
          "text": "More like hunting BLM protesters.",
          "timestamp": "2021-12-15 18:56:54",
          "score": 484,
          "num_children": 2,
          "author": 175494,
          "replies": [
            {
              "id": "hoooric",
              "text": "Qualification: be a dumb kid with a gun who more or less hunts human beings for sport",
              "timestamp": "2021-12-15 19:54:08",
              "score": 142,
              "num_children": 1,
              "author": 69382,
              "replies": [
                {
                  "id": "hor8twz",
                  "text": "Next he'll be going to Predator University to give a lecture to budding human hunters.",
                  "timestamp": "2021-12-16 08:00:08",
                  "score": 5,
                  "num_children": 0,
                  "author": 260891,
                  "replies": []
                }
              ]
            },
            {
              "id": "hoohhba",
              "text": "But they were criminals!!\n\n/s",
              "timestamp": "2021-12-15 19:07:48",
              "score": 140,
              "num_children": 0,
              "author": 151818,
              "replies": []
            }
          ]
        },
        {
          "id": "hook9pm",
          "text": "You forgot “likes big butts”\n\n[cringe warning ](https://youtu.be/r8zVaz9YANA)",
          "timestamp": "2021-12-15 19:25:33",
          "score": 106,
          "num_children": 4,
          "author": 151542,
          "replies": [
            {
              "id": "hoose5f",
              "text": ">I want someone who likes me for me. She's gotta have big tits though.\n\n\\-A Murderer",
              "timestamp": "2021-12-15 20:17:31",
              "score": 91,
              "num_children": 0,
              "author": 384779,
              "replies": []
            },
            {
              "id": "hoood8q",
              "text": "By the title it looks like he’s taking quite well after the likes of Pedo trump",
              "timestamp": "2021-12-15 19:51:38",
              "score": 50,
              "num_children": 0,
              "author": 69963,
              "replies": []
            },
            {
              "id": "hopp6oc",
              "text": "\"A nice dame?\" Is Frank Sinatra asking the questions? \"That's what you need for Christmas, kid, a cuckoo bird with a some huge gazongas!\"",
              "timestamp": "2021-12-15 23:58:57",
              "score": 14,
              "num_children": 0,
              "author": 68159,
              "replies": []
            },
            {
              "id": "hop8t8q",
              "text": "That's something both sides can agree on",
              "timestamp": "2021-12-15 22:03:38",
              "score": 8,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hoq8eu7",
          "text": "Notice how no one is Marjorie Greene Tayloring him like David Hogg was for speaking out against unfettered weapon access.",
          "timestamp": "2021-12-16 02:23:20",
          "score": 15,
          "num_children": 0,
          "author": 1512,
          "replies": []
        },
        {
          "id": "hoqcd81",
          "text": "Mark McCloskey, and his wife, aimed guns at protesters, now a Senate candidate. So talented!",
          "timestamp": "2021-12-16 02:52:17",
          "score": 13,
          "num_children": 0,
          "author": 321229,
          "replies": []
        },
        {
          "id": "hoo65dy",
          "text": "Or be a token minority I guess.",
          "timestamp": "2021-12-15 17:54:45",
          "score": 67,
          "num_children": 0,
          "author": 10827,
          "replies": []
        },
        {
          "id": "hoq5g8o",
          "text": "Funnily enough he actually said in an interview he supports BLM. Which made some conservatives hate him because he became a martyr for killing \"pedophiles and murderers\"",
          "timestamp": "2021-12-16 02:01:44",
          "score": 20,
          "num_children": 1,
          "author": 302539,
          "replies": [
            {
              "id": "hoqzv38",
              "text": "Of course he supports BLM. He wants a steady supply of targets.",
              "timestamp": "2021-12-16 06:14:35",
              "score": 6,
              "num_children": 0,
              "author": 387391,
              "replies": []
            }
          ]
        },
        {
          "id": "hopv6ar",
          "text": "Ehh.. more like “Be a terrorist”",
          "timestamp": "2021-12-16 00:44:15",
          "score": 8,
          "num_children": 0,
          "author": 361300,
          "replies": []
        },
        {
          "id": "hor7a4i",
          "text": "I think you’re overestimating how high the bar is…",
          "timestamp": "2021-12-16 07:40:35",
          "score": 3,
          "num_children": 0,
          "author": 294177,
          "replies": []
        },
        {
          "id": "horba9s",
          "text": "Honestly, I didn’t think the right would go this low. And I think extremely lowly of most of them who are still with the party after 2016.",
          "timestamp": "2021-12-16 08:32:16",
          "score": 3,
          "num_children": 0,
          "author": 172943,
          "replies": []
        },
        {
          "id": "hoqurw4",
          "text": "But look at how traumatized he still is from having to shoot those protesters! /s",
          "timestamp": "2021-12-16 05:24:06",
          "score": 4,
          "num_children": 0,
          "author": 245715,
          "replies": []
        },
        {
          "id": "hop52mf",
          "text": "So the courts wrong then?",
          "timestamp": "2021-12-15 21:39:15",
          "score": -36,
          "num_children": 6,
          "replies": [
            {
              "id": "hop6qlf",
              "text": "...what?",
              "timestamp": "2021-12-15 21:50:02",
              "score": 13,
              "num_children": 0,
              "author": 392603,
              "replies": []
            },
            {
              "id": "hopnlmy",
              "text": "Court didn't say he didn't shoot someone - he just claimed self defense. He still murdered someone.",
              "timestamp": "2021-12-15 23:47:16",
              "score": 9,
              "num_children": 1,
              "author": 309235,
              "replies": [
                {
                  "id": "hopzccx",
                  "text": "No, the courts did say he didn't *murder* someone. He still shot someone; it was not murder. You can disagree with the ruling but the way you phrased this is just wrong.",
                  "timestamp": "2021-12-16 01:15:56",
                  "score": 8,
                  "num_children": 2,
                  "author": 120409,
                  "replies": [
                    {
                      "id": "hoq1wk4",
                      "text": "That's fair, as the original comment said he shot someone, I jumped the gun on the murder word.",
                      "timestamp": "2021-12-16 01:35:14",
                      "score": 3,
                      "num_children": 0,
                      "author": 309235,
                      "replies": []
                    },
                    {
                      "id": "horhvka",
                      "text": "It’s still murder. There are degrees of the act. Even when you accidentally hit someone with your car it’s a form of murder. They just call it manslaughter, but that’s like 3rd degree murder.",
                      "timestamp": "2021-12-16 10:03:26",
                      "score": 1,
                      "num_children": 1,
                      "author": 221852,
                      "replies": [
                        {
                          "id": "hosyvma",
                          "text": "No. There was a whole trial about exactly that, to determine if it was murder. The jury found him not guilty. It is literally not murder as determined by our legal system.\n\nYou can say, \"in my opinion the verdict was wrong - he should have been found guilty.\" And be correct, because that's your opinion. But legally... No. You're just spreading misinformation.",
                          "timestamp": "2021-12-16 17:30:37",
                          "score": 1,
                          "num_children": 1,
                          "author": 120409,
                          "replies": [
                            {
                              "id": "hp0cwhl",
                              "text": "I didn’t say anything about the verdict. I’m talking about the classification of the act.if you hit someone with your car accidentally and they die, it doesn’t matter if you’re not found guilty it’s still manslaughter. Same with any act where you cause the cessation of life of another individual. Not guilty doesn’t mean innocent.",
                              "timestamp": "2021-12-18 03:56:39",
                              "score": 1,
                              "num_children": 1,
                              "author": 221852,
                              "replies": [
                                {
                                  "id": "hp16zk3",
                                  "text": "> If you hit someone with your car accidentally and they die, it doesn’t matter if you’re not found guilty it’s still manslaughter.\n\nThat's literally not true. Manslaughter is a legal term that narrowly defines a set of crimes. The whole point of a trial is to determine whether a killing qualifies as a crime - i.e. murder or manslaughter. If you're found not guilty, you may still have killed somebody, but it was not criminal.\n\nYou're using legal language inappropriately. I don't know how else to clarify it for you.\n\nEdit: In case you're stuck on this point, \"not guilty\" means the trial could not prove a crime occured; \"innocent\" means it proved a crime *did not occur*. Either way, describing the act in question with a term that legally defines a crime is incorrect. It's foundational to our legal system that crimes must be proven.",
                                  "timestamp": "2021-12-18 09:56:24",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 120409,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hopbu8w",
              "text": "He unequivocally shot people during a BLM protest.",
              "timestamp": "2021-12-15 22:24:05",
              "score": 24,
              "num_children": 0,
              "author": 300876,
              "replies": []
            },
            {
              "id": "hopdxa1",
              "text": "Rittenhouse successfully argued self defense in court, but that has nothing to do with getting this speaking slot.\n\nThe assertion is he's getting invited to these things because he shot the right people. Is that incorrect?",
              "timestamp": "2021-12-15 22:38:23",
              "score": 16,
              "num_children": 1,
              "author": 351566,
              "replies": [
                {
                  "id": "hor7eoe",
                  "text": "No it’s because they believe he was persecuted by the media and the left in general for defending property during the riots and defending himself using his 2nd amendment rights. If he had just shot 3 BLM protestors (aka “the right people”) in their homes, they wouldn’t be inviting him to speak at all their events.",
                  "timestamp": "2021-12-16 07:42:13",
                  "score": -6,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hor9l0j",
                      "text": "> If he had just shot 3 BLM protestors (aka “the right people”) in their homes, they wouldn’t be inviting him to speak at all their events.\n\nNo yeah they definitely still would be",
                      "timestamp": "2021-12-16 08:09:59",
                      "score": 3,
                      "num_children": 1,
                      "author": 183164,
                      "replies": [
                        {
                          "id": "hor9zit",
                          "text": "Do you have any examples of them inviting such a person to speak at their events? Such people do exist, so if you’re right then there should be an example or two",
                          "timestamp": "2021-12-16 08:15:18",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "horhzgp",
                              "text": "What about that soldier who was in prison for killing kids and other shady shit? Trump pardoned him and then he was EVERYWHERE.",
                              "timestamp": "2021-12-16 10:04:55",
                              "score": 3,
                              "num_children": 0,
                              "author": 221852,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hor62ms",
              "text": "What do the courts have to do with whether or not Rittenhouse shot two people?  That's not even up for debate.  Though you make your stance on the issue loud and clear by simultaneously showing you support Kyle Rittenhouse and showing that you weren't following the trials whatsoever.",
              "timestamp": "2021-12-16 07:25:36",
              "score": 1,
              "num_children": 1,
              "author": 201921,
              "replies": [
                {
                  "id": "hor7ha7",
                  "text": "He shot 3 and killed 2.",
                  "timestamp": "2021-12-16 07:43:09",
                  "score": 3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hor9di2",
                      "text": "True, but technically if he shot three, he also shot two.  ;)",
                      "timestamp": "2021-12-16 08:07:12",
                      "score": 1,
                      "num_children": 0,
                      "author": 201921,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hoq8q91",
              "text": "Yes. Glad we agree",
              "timestamp": "2021-12-16 02:25:40",
              "score": 0,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hopanu5",
          "text": "I don’t disagree with your take on right-speakers but dem speakers routinely suck ass",
          "timestamp": "2021-12-15 22:16:08",
          "score": -21,
          "num_children": 1,
          "author": 323307,
          "replies": [
            {
              "id": "hopcj2q",
              "text": "Dems aren't leftists.",
              "timestamp": "2021-12-15 22:28:49",
              "score": 19,
              "num_children": 1,
              "replies": [
                {
                  "id": "hopcolq",
                  "text": "Left doesn’t equal leftists",
                  "timestamp": "2021-12-15 22:29:51",
                  "score": -19,
                  "num_children": 1,
                  "author": 323307,
                  "replies": [
                    {
                      "id": "hopn5ee",
                      "text": "Actually it does and the Dems aren't left.  Good try though.",
                      "timestamp": "2021-12-15 23:43:57",
                      "score": 11,
                      "num_children": 1,
                      "author": 47550,
                      "replies": [
                        {
                          "id": "hopptr7",
                          "text": "Sure",
                          "timestamp": "2021-12-16 00:03:46",
                          "score": -10,
                          "num_children": 0,
                          "author": 323307,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hoobwsf",
      "text": "America fists 2021?",
      "timestamp": "2021-12-15 18:32:03",
      "score": 109,
      "num_children": 4,
      "author": 230775,
      "replies": [
        {
          "id": "hoolru6",
          "text": "Assume the position. \n/FISTO",
          "timestamp": "2021-12-15 19:35:12",
          "score": 22,
          "num_children": 1,
          "replies": [
            {
              "id": "hopo4ca",
              "text": "Fisto changeo cuz!",
              "timestamp": "2021-12-15 23:51:02",
              "score": 2,
              "num_children": 0,
              "author": 200378,
              "replies": []
            }
          ]
        },
        {
          "id": "hoogd59",
          "text": "Maybe America Fest",
          "timestamp": "2021-12-15 19:00:38",
          "score": 9,
          "num_children": 0,
          "author": 212224,
          "replies": []
        },
        {
          "id": "hopqn6j",
          "text": "[deleted]",
          "timestamp": "2021-12-16 00:09:50",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hopqocd",
              "text": "I saw that you mentioned Ben Shapiro. In case some of you don't know, Ben Shapiro is a grifter and a hack. If you find anything he's said compelling, you should keep in mind he also says things like this:\n\n>If you wear your pants below your butt, don't bend the brim of your cap, and have an EBT card, 0% chance you will ever be a success in life.\n\n\n*****\n\n^(I'm a bot. My purpose is to counteract online radicalization. You can summon me by tagging thebenshapirobot. Options: novel, civil rights, sex, dumb takes, etc.)\n\n\n\n[^More ^About ^Ben ](https://np.reddit.com/r/AuthoritarianMoment/wiki/index) ^| [^Feedback ^& ^Discussion: ^r/AuthoritarianMoment ](https://np.reddit.com/r/AuthoritarianMoment) ^| [^Opt ^Out ](https://np.reddit.com/r/AuthoritarianMoment/comments/olk6r2/click_here_to_optout_of_uthebenshapirobot/)",
              "timestamp": "2021-12-16 00:10:06",
              "score": 4,
              "num_children": 0,
              "author": 280326,
              "replies": []
            }
          ]
        },
        {
          "id": "hoqjxel",
          "text": "Yeah, on the *right* side of Folsom Street.",
          "timestamp": "2021-12-16 03:49:35",
          "score": 1,
          "num_children": 0,
          "author": 297077,
          "replies": []
        }
      ]
    },
    {
      "id": "hool93g",
      "text": "Do you guys remember Kaitlyn Bennett? That worthless woman who got famous only for carrying an ar-15 at Kent State on the anniversary of the National guard shooting there.\n\nWell. Meet the male Kaitlyn Bennett... Except this motherfucker is only famous for killing people to defend a place whose owner didn't even want them there.",
      "timestamp": "2021-12-15 19:31:51",
      "score": 110,
      "num_children": 1,
      "author": 341971,
      "replies": [
        {
          "id": "hoomcjh",
          "text": "All kyle needs to do now is shit himself, passed out on the floor like she did!",
          "timestamp": "2021-12-15 19:38:51",
          "score": 71,
          "num_children": 1,
          "replies": [
            {
              "id": "hop9diz",
              "text": "Wait what....she did what?",
              "timestamp": "2021-12-15 22:07:24",
              "score": 20,
              "num_children": 2,
              "author": 306489,
              "replies": [
                {
                  "id": "hopbbiw",
                  "text": "She shit herself. Here's a link to a Twitter page dedicated to her doing so. https://mobile.twitter.com/kaitlinshits its their pinned tweet.",
                  "timestamp": "2021-12-15 22:20:34",
                  "score": 27,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hopl079",
                  "text": "And there was so much",
                  "timestamp": "2021-12-15 23:28:25",
                  "score": 17,
                  "num_children": 2,
                  "author": 247767,
                  "replies": [
                    {
                      "id": "hoqvce7",
                      "text": "I just saw the picture for the first time and wow you ain't kidding. Way too much poop.",
                      "timestamp": "2021-12-16 05:29:38",
                      "score": 3,
                      "num_children": 0,
                      "author": 139913,
                      "replies": []
                    },
                    {
                      "id": "horrbgx",
                      "text": "I can only dream of having such a healthy bowel movement.",
                      "timestamp": "2021-12-16 12:03:18",
                      "score": 2,
                      "num_children": 0,
                      "author": 121350,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hoomt52",
      "text": "“Joe Biden needs to apologize! Kyle isn’t a white supremacist!”\n\nOne week later…\n\nKyle is the keynote speaker at a white supremacist convention.",
      "timestamp": "2021-12-15 19:41:46",
      "score": 86,
      "num_children": 0,
      "author": 1380,
      "replies": []
    },
    {
      "id": "hoohtey",
      "text": "CONFIRMED White privilege",
      "timestamp": "2021-12-15 19:09:58",
      "score": 73,
      "num_children": 2,
      "author": 189865,
      "replies": [
        {
          "id": "hopa9nf",
          "text": "exactly",
          "timestamp": "2021-12-15 22:13:28",
          "score": 6,
          "num_children": 1,
          "replies": [
            {
              "id": "hoq1ya0",
              "text": "Can you imagine what these ghouls would say if Democrats venerated a black murderer?",
              "timestamp": "2021-12-16 01:35:35",
              "score": 1,
              "num_children": 1,
              "author": 116385,
              "replies": [
                {
                  "id": "hoq99dd",
                  "text": "“Sup OJ”?",
                  "timestamp": "2021-12-16 02:29:31",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hoqt44o",
                      "text": "Everyone hates OJ. You fail.",
                      "timestamp": "2021-12-16 05:08:27",
                      "score": 1,
                      "num_children": 0,
                      "author": 116385,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hoqr0rs",
          "text": "idk about that, a white man shot a Trump supporter in self defense in Portland last year, and US Marshalls promptly executed him.",
          "timestamp": "2021-12-16 04:49:32",
          "score": 3,
          "num_children": 0,
          "author": 114511,
          "replies": []
        }
      ]
    },
    {
      "id": "hooteor",
      "text": "The list of people that conservatives idolize is fucking ridiculous:\n\nTucker Carlson, Alex Jones, Rush Limbaugh, Sarah Palin, Donald Trump, Matt Gaetz, Lauren Boebert, Marjorie Taylore Greene, and now Kyle Rittenhouse (to name a few)\n\nThat list is a \"who's who\" of the absolute most fucking stupid, moronic, mindless baked potatoes on the planet.",
      "timestamp": "2021-12-15 20:24:02",
      "score": 53,
      "num_children": 1,
      "replies": [
        {
          "id": "hooxbnq",
          "text": "George Zimmerman",
          "timestamp": "2021-12-15 20:49:18",
          "score": 26,
          "num_children": 1,
          "author": 69606,
          "replies": [
            {
              "id": "hoq9hig",
              "text": "He’s so forgettable. He hates that, I bet.",
              "timestamp": "2021-12-16 02:31:11",
              "score": 11,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hoohtx7",
      "text": "So there's like a zero percent chance this dipshit is writing his own speech, right?",
      "timestamp": "2021-12-15 19:10:03",
      "score": 45,
      "num_children": 1,
      "author": 202453,
      "replies": [
        {
          "id": "hoozo6e",
          "text": "25% chance imo. My bets is that Steve Bannon has had a series of speeches written for this little troll to spew for months now.",
          "timestamp": "2021-12-15 21:04:36",
          "score": 23,
          "num_children": 0,
          "author": 332503,
          "replies": []
        }
      ]
    },
    {
      "id": "hoogf0t",
      "text": "I knew it. I knew he’d become a clout chasing little shit",
      "timestamp": "2021-12-15 19:00:57",
      "score": 38,
      "num_children": 1,
      "author": 81839,
      "replies": [
        {
          "id": "hor8ham",
          "text": "on the plus side at least he’s not still doing what got him famous like yanno murder",
          "timestamp": "2021-12-16 07:55:40",
          "score": 1,
          "num_children": 0,
          "author": 66735,
          "replies": []
        }
      ]
    },
    {
      "id": "hoocwz7",
      "text": "What do you think he'll talk about? How he can't get girls to sleep with him, because the left/mainstream media has unfairly tarnished his image? How gun control measures are MArXiSts, because he \\*needed\\* that weapon for self-defense?  How he is an EMT in training because his mommy let him chase ambulances around his shithole town?\n\nI can't think of any other topics someone who looks like him would be able to generate. I guess he could give a masterclass on how to fake cry on command.",
      "timestamp": "2021-12-15 18:38:32",
      "score": 108,
      "num_children": 4,
      "author": 154171,
      "replies": [
        {
          "id": "hoogk55",
          "text": "Marx was actually pro-guns, he wanted the working class to be armed en mass to make the overthrow of the ruling class easier",
          "timestamp": "2021-12-15 19:01:52",
          "score": 48,
          "num_children": 3,
          "author": 212224,
          "replies": [
            {
              "id": "hoohwq1",
              "text": "I was using Marxist in the alt-right sense of the word; an \"insult\" applied to anyone who disagrees with them on just about anything. Really, I think they just think anyone who is socially liberal is a Marxist...that's how smart they are.",
              "timestamp": "2021-12-15 19:10:33",
              "score": 34,
              "num_children": 1,
              "author": 154171,
              "replies": [
                {
                  "id": "hooi02j",
                  "text": "Oh I’m well aware, I just like to point out how wrong the right is",
                  "timestamp": "2021-12-15 19:11:09",
                  "score": 25,
                  "num_children": 0,
                  "author": 212224,
                  "replies": []
                }
              ]
            },
            {
              "id": "hopcyyj",
              "text": "\"Under no pretext...\"",
              "timestamp": "2021-12-15 22:31:50",
              "score": 4,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hops0ze",
              "text": "They do like to credit his quote to their talking head of the day tho.",
              "timestamp": "2021-12-16 00:20:15",
              "score": 1,
              "num_children": 0,
              "author": 40533,
              "replies": []
            }
          ]
        },
        {
          "id": "hoofrsi",
          "text": "Wait, he's in EMT training? Doesn't he claim to have PTSD from committing murder? I'm not saying EMT's can't have PTSD but it doesn't seem like a great career choice if you do suffer from it.",
          "timestamp": "2021-12-15 18:56:49",
          "score": 45,
          "num_children": 2,
          "author": 139206,
          "replies": [
            {
              "id": "hoohhzh",
              "text": "He claimed at his trial that he was an EMT training and went to Kenosha in that capacity. I'm pretty sure any prospect of him becoming an EMT now are gone, given that his claim to fame is *taking* rather than saving lives.",
              "timestamp": "2021-12-15 19:07:55",
              "score": 54,
              "num_children": 3,
              "author": 154171,
              "replies": [
                {
                  "id": "hoorf4o",
                  "text": "What is latin for \"First, do *some* harm\"?",
                  "timestamp": "2021-12-15 20:11:14",
                  "score": 25,
                  "num_children": 1,
                  "author": 361251,
                  "replies": [
                    {
                      "id": "hooz4sd",
                      "text": "\"Carthago delenda est.\"",
                      "timestamp": "2021-12-15 21:01:06",
                      "score": 14,
                      "num_children": 0,
                      "author": 182173,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hopgi5t",
                  "text": "Which is bullshit, because being an \"EMT in training\" is the same as \"Not being an EMT\".\nHe's on video at the riot telling people to come to him cause \"he's an EMT\" which is not only a lie but dangerous and irresponsible on so many levels. EMT may be the bottom rung of healthcare but it's no fucking joke. Until you've gone through that giant textbook backwards and forwards, until you've practiced your skills till you can do them in your sleep, until you've taken vitals quickly and accurately over and over again, you're absolutely not an EMT. You don't have any of the knowledge, experience, or personal legal responsibility.",
                  "timestamp": "2021-12-15 22:56:16",
                  "score": 29,
                  "num_children": 1,
                  "author": 351595,
                  "replies": [
                    {
                      "id": "hor71lk",
                      "text": "I know when I was in school for nursing, people kept asking me medical advice. I told them that all I was qualified for was wiping asses. (You needed a CNA before starting clinicals.)  An odd number of people have a lot of faith in students of healthcare professions for some reason, and I also noticed that the more you know the less likely you are to make any sort of statements about things. So some students really spout off about how much they know. Anyone who hit their terminal degree for their particular path keeps their mouth shut almost all the time.",
                      "timestamp": "2021-12-16 07:37:37",
                      "score": 4,
                      "num_children": 1,
                      "author": 65408,
                      "replies": [
                        {
                          "id": "hos1ihe",
                          "text": "The more you know about a subject, the better you should understand what you don't know about it.",
                          "timestamp": "2021-12-16 13:39:34",
                          "score": 1,
                          "num_children": 0,
                          "author": 351595,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hopgbx1",
                  "text": "How was he supposed to practice first aid if nobody needed it? Sheesh!",
                  "timestamp": "2021-12-15 22:55:03",
                  "score": 6,
                  "num_children": 0,
                  "author": 10786,
                  "replies": []
                }
              ]
            },
            {
              "id": "hoqccmn",
              "text": "He’s also applying to nursing school. Can you imagine?!?",
              "timestamp": "2021-12-16 02:52:10",
              "score": 1,
              "num_children": 0,
              "author": 226679,
              "replies": []
            }
          ]
        },
        {
          "id": "hooqpwh",
          "text": "Reporter:  \"So Kyle....you say you want to be an EMT.  What have you done towards this goal?  Have you been taking certification classes?  Doing ride-alongs?\"\n\nKyle:  \"No.....but I have been working on seeing gunshot wounds up close.\"",
          "timestamp": "2021-12-15 20:06:42",
          "score": 13,
          "num_children": 0,
          "author": 271845,
          "replies": []
        },
        {
          "id": "hooh5uq",
          "text": "[removed]",
          "timestamp": "2021-12-15 19:05:45",
          "score": -34,
          "num_children": 4,
          "replies": [
            {
              "id": "hooiixu",
              "text": "I don't bring weapons to proud boys/oath keeper rallies, because I'm not a homicidal maniac looking for trouble. Try using your brain rather than just listening to Tucker.",
              "timestamp": "2021-12-15 19:14:30",
              "score": 25,
              "num_children": 0,
              "author": 154171,
              "replies": []
            },
            {
              "id": "hoon4a6",
              "text": "He literally said he wanted to use an AR to shoot protestors.. less than a week later he went well out of his way to do just that. This is what the BLM social movement is about, inequality, institutional racism, and social injustice.\n\nIt's no surprise to reasonable people that this sociopath is being heralded as a hero by conservatives. It's a philosophy borne out of an unhealthy appreciation of suffering and strict social hierarchies that must be defended with violence if deemed necessary. \n\nThank you for coming here to provide a real life example.",
              "timestamp": "2021-12-15 19:43:44",
              "score": 19,
              "num_children": 0,
              "author": 285979,
              "replies": []
            },
            {
              "id": "hookl4o",
              "text": "> youll see it was self defense.\n\nand OJ didn't kill those people",
              "timestamp": "2021-12-15 19:27:35",
              "score": 12,
              "num_children": 0,
              "author": 401993,
              "replies": []
            },
            {
              "id": "hooj3ku",
              "text": "Serious question: do you have a poster of Kyle hanging on your bedroom ceiling? How much would you pay to smell his farts? I want to try to get to know my enemies better.",
              "timestamp": "2021-12-15 19:18:10",
              "score": 19,
              "num_children": 0,
              "author": 154171,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hooh0vu",
      "text": "Their only criteria for a speaker is if they've murdered someone. Fucking disgusting.",
      "timestamp": "2021-12-15 19:04:52",
      "score": 115,
      "num_children": 2,
      "author": 29168,
      "replies": [
        {
          "id": "hop7gze",
          "text": "I wonder if they’ll have that child murderer turned anti choice activist there",
          "timestamp": "2021-12-15 21:54:47",
          "score": 19,
          "num_children": 0,
          "author": 104107,
          "replies": []
        },
        {
          "id": "hopgki6",
          "text": "I'm legitimately interested in hearing what he says, and how quickly he incriminates himself.",
          "timestamp": "2021-12-15 22:56:43",
          "score": 12,
          "num_children": 2,
          "author": 238331,
          "replies": [
            {
              "id": "hopo6kt",
              "text": "Yeah I kind of am too but frankly it doesn't matter what he admits too because of double jeopardy.",
              "timestamp": "2021-12-15 23:51:29",
              "score": 9,
              "num_children": 0,
              "author": 29168,
              "replies": []
            },
            {
              "id": "hoquwjd",
              "text": "He won't. They'll have some bullshit jingoist script for him to read, and he'll read it word for word, guaranteed. He's not like the 1/6 insurrectionists talking shop on Facebook, this kid is being groomed and trained up young. He's a fascist hero. He's like the glorified Nazi sniper from Inglorious Basterds -- a model fascist who does and says and represents all the right things, and hurts the right people.",
              "timestamp": "2021-12-16 05:25:21",
              "score": 3,
              "num_children": 0,
              "author": 139913,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hoocm0l",
      "text": "America Fest?\n\nThis is seriously the most nationalistic country on the planet.\n\nAlso, CALLED IT. I feel like if it was more about self defense and not about ideology, he'd have no reason to accept this kind of invite for what is clearly a partisan group.",
      "timestamp": "2021-12-15 18:36:34",
      "score": 171,
      "num_children": 5,
      "author": 21028,
      "replies": [
        {
          "id": "hoopjzb",
          "text": "I suspect he has significant financial incentives to ride this train.",
          "timestamp": "2021-12-15 19:59:11",
          "score": 48,
          "num_children": 1,
          "author": 250645,
          "replies": [
            {
              "id": "hopav2q",
              "text": "> I suspect he has significant financial incentives to ride this train.\n\nAs do they all.  There are people to fleece and money to be made.  This is a big reason we are in this mess.",
              "timestamp": "2021-12-15 22:17:29",
              "score": 19,
              "num_children": 1,
              "author": 166197,
              "replies": [
                {
                  "id": "hos75qe",
                  "text": "The GQP is the \"Grifting Q Party\" after all",
                  "timestamp": "2021-12-16 14:24:25",
                  "score": 2,
                  "num_children": 0,
                  "author": 38759,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hooyv6h",
          "text": "Throwing a festival for the country you spend all of your time in and where pretty much everybody you know lives and is from makes about as much sense as throwing a carbon-based life form festival.",
          "timestamp": "2021-12-15 20:59:21",
          "score": 29,
          "num_children": 1,
          "author": 150427,
          "replies": [
            {
              "id": "hoph023",
              "text": "[deleted]",
              "timestamp": "2021-12-15 22:59:45",
              "score": 5,
              "num_children": 1,
              "replies": [
                {
                  "id": "hopr3bi",
                  "text": "Moon rocks for everyone. Except Mercury and Venus, not you.",
                  "timestamp": "2021-12-16 00:13:16",
                  "score": 1,
                  "num_children": 0,
                  "author": 299609,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hoq8h0x",
          "text": "I would bet any amount of money he'll be up for election in 2022.",
          "timestamp": "2021-12-16 02:23:47",
          "score": 2,
          "num_children": 0,
          "author": 222480,
          "replies": []
        },
        {
          "id": "hor3x52",
          "text": "I thought it said “fist” which is barely stupider.",
          "timestamp": "2021-12-16 06:59:58",
          "score": 2,
          "num_children": 0,
          "author": 307989,
          "replies": []
        },
        {
          "id": "hoqjskt",
          "text": "> This is seriously the most nationalistic country on the planet.\n\nI guess you've never heard of North Korea?",
          "timestamp": "2021-12-16 03:48:33",
          "score": 1,
          "num_children": 1,
          "author": 297077,
          "replies": [
            {
              "id": "hoqvoym",
              "text": "North Korea actually admits they're nationalistic. We pretend we aren't.",
              "timestamp": "2021-12-16 05:33:03",
              "score": 0,
              "num_children": 1,
              "author": 21028,
              "replies": [
                {
                  "id": "hor295z",
                  "text": "If you, individually, are not, and can freely say so, then we are not.",
                  "timestamp": "2021-12-16 06:40:41",
                  "score": 2,
                  "num_children": 0,
                  "author": 297077,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hoo87jm",
      "text": "I'm sure we all knew this would happen.",
      "timestamp": "2021-12-15 18:07:57",
      "score": 54,
      "num_children": 2,
      "replies": [
        {
          "id": "hoofwvb",
          "text": "Oh I called it from the word go. About a day into the trial",
          "timestamp": "2021-12-15 18:57:43",
          "score": 26,
          "num_children": 1,
          "replies": [
            {
              "id": "hoogike",
              "text": "When they had the St. Louis couple that stood in their yard pointing guns at people speaking at events I think we all knew he’d be next",
              "timestamp": "2021-12-15 19:01:35",
              "score": 37,
              "num_children": 1,
              "author": 150632,
              "replies": [
                {
                  "id": "hoohhlx",
                  "text": "If I ever found a magic lamp, I'd waste my first wish making everyone bulletproof just to watch these people lose their fucking minds when they have to figure out a new way to solve their problems. They'd probably end up trying to blow their brains out but to no avail because... You know...",
                  "timestamp": "2021-12-15 19:07:51",
                  "score": 25,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "hoozi8u",
                      "text": "Mine would be similar, but it’d be granting everyone but these fuck heads invulnerability. Watch them try to shoot an unarmed black man only for the bullet to ding off his skin, try to bash a trans person’s brains in only for the lead pipe to shatter like chalk, or try to run over an exhausted undocumented immigrant only for their tire’s to pop. They’d learn to get along real quick after that.",
                      "timestamp": "2021-12-15 21:03:32",
                      "score": 10,
                      "num_children": 0,
                      "author": 332503,
                      "replies": []
                    },
                    {
                      "id": "hoorn9b",
                      "text": "__PARRY THIS YOU FUCKING CASUALL__\n\n*Throws spear*",
                      "timestamp": "2021-12-15 20:12:40",
                      "score": 9,
                      "num_children": 0,
                      "author": 197369,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hoq98tw",
          "text": "Just wait, he'll be up for election in the mid-terms next year...",
          "timestamp": "2021-12-16 02:29:24",
          "score": 3,
          "num_children": 1,
          "author": 222480,
          "replies": [
            {
              "id": "hoqbm5o",
              "text": "Don't laugh, you're probably right.",
              "timestamp": "2021-12-16 02:46:47",
              "score": 3,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hooxfdw",
      "text": "Guilty or not (not arguing for or against that here), the fact they are celebrating the death of two human beings, fellow Americans nonetheless, is disgusting. Self-defense or not, two people are dead because of the actions that this kid took that day.",
      "timestamp": "2021-12-15 20:49:59",
      "score": 16,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hook3or",
      "text": "No, this is great. Give this little troll with no media coaching a platform and let him speak for you.  Especially ahead of a potential civil trial this sound like a great idea that certainly won't be used against him.  Give him enough rope.  Please.  Remember Joe the Plumber?  Of course you don't. Don't worry about it, it worked out fabulously sweetie.  Stay the course! 😂",
      "timestamp": "2021-12-15 19:24:30",
      "score": 15,
      "num_children": 0,
      "author": 80659,
      "replies": []
    },
    {
      "id": "hoomuli",
      "text": "KR on Tucker: I actually support BLM\n\nAlso KR:",
      "timestamp": "2021-12-15 19:42:01",
      "score": 12,
      "num_children": 1,
      "author": 285627,
      "replies": [
        {
          "id": "hoq9xhu",
          "text": "“I actually support BLM (*as a vehicle against which to express my impotent rage and irrational hate*)”",
          "timestamp": "2021-12-16 02:34:26",
          "score": 6,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hop65xc",
      "text": "Even if you think Kyle Rittenhouse acted in self-defence, it makes zero sense to valourize him. You know, unless you like the fact that he killed people you politically disagree with.",
      "timestamp": "2021-12-15 21:46:18",
      "score": 13,
      "num_children": 1,
      "author": 77880,
      "replies": [
        {
          "id": "hoqb7vm",
          "text": "Exactly. That’s why this shit makes me want to scream. Like we’re beholden to the worst of us because they don’t operate with facts or reason. We’re talking dr. Oz levels of fraud and incompetence masquerading as good advice. I can’t take it anymore. I feel like we need a new Australia to send them all to. Maybe bezos is doing good by us after all and will take them all to “live in space.”",
          "timestamp": "2021-12-16 02:43:51",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hooabd1",
      "text": "Their web address is \"TPUSA.com\", thats putting it lightly.",
      "timestamp": "2021-12-15 18:21:40",
      "score": 36,
      "num_children": 1,
      "author": 293176,
      "replies": [
        {
          "id": "hoonxo5",
          "text": "There's a subreddit that does silly photoshops mocking then that uses that exact same premise, i think it's just r/ToiletPaperUSA",
          "timestamp": "2021-12-15 19:48:56",
          "score": 22,
          "num_children": 0,
          "author": 286336,
          "replies": []
        }
      ]
    },
    {
      "id": "hooowaj",
      "text": "They've had rapist speakers. Why not murderers?",
      "timestamp": "2021-12-15 19:54:59",
      "score": 13,
      "num_children": 0,
      "author": 316676,
      "replies": []
    },
    {
      "id": "hoof4ag",
      "text": "I'm only barely missing this shitshow by 2 days going to Phoenix for holidays with the family. Just wanna barf in my mouth a little bit. The having to go to Phoenix part, not the holidays with family part.",
      "timestamp": "2021-12-15 18:52:37",
      "score": 9,
      "num_children": 0,
      "author": 308454,
      "replies": []
    },
    {
      "id": "hoor5f2",
      "text": "I am interested in actually watching this.. Not because I care what he says, but I am interested in seeing how he frames recent events, and if he brags.\n\nedit: I feel like I need to say that I in no way support him by watching him talk on this. I just want to see what happens.",
      "timestamp": "2021-12-15 20:09:30",
      "score": 9,
      "num_children": 0,
      "author": 140892,
      "replies": []
    },
    {
      "id": "hop39rg",
      "text": "Why do the shooters only ever shoot up non-rightwing events?",
      "timestamp": "2021-12-15 21:27:30",
      "score": 8,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hop2hzm",
      "text": "Fucking shameless.",
      "timestamp": "2021-12-15 21:22:44",
      "score": 10,
      "num_children": 0,
      "author": 296140,
      "replies": []
    },
    {
      "id": "hop2xgw",
      "text": "I have to say someone’s been working with this little hillbilly. The way he dresses, the way he speaks. Someone polished this little mf.",
      "timestamp": "2021-12-15 21:25:26",
      "score": 9,
      "num_children": 0,
      "author": 357419,
      "replies": []
    },
    {
      "id": "hopb0g6",
      "text": "Its crazy because Kyle's lawyer *specifically* said, \"Kyle, you're going to need to learn to say no to people who are just going to try and take advantage of you\" and now this murdering idiot is going on maga tour 2022. \n\n\nDid he already get over the fact that he literally killed two people?",
      "timestamp": "2021-12-15 22:18:30",
      "score": 10,
      "num_children": 1,
      "author": 217672,
      "replies": [
        {
          "id": "hopducv",
          "text": "I still have a sliver of hope that he's going to go Hunter Avallone on them.\n\nI don't expect it, but I do hope for it.\n\nMostly because it would be hilarious.",
          "timestamp": "2021-12-15 22:37:50",
          "score": 4,
          "num_children": 1,
          "replies": [
            {
              "id": "hopxc5t",
              "text": "Hunter Avallone?",
              "timestamp": "2021-12-16 01:00:41",
              "score": 0,
              "num_children": 1,
              "author": 274129,
              "replies": [
                {
                  "id": "horcxy1",
                  "text": "I think that he is a YouTube guy who used to be a right winger but he learned more about the current right wing and now he's more left leaning. I don't know much about him. I don't have high expectations for Rittenhouse though. The dude is obsessed with cops, has shown zero growth coming out of a murder trial, and not to mention, when asked what he looked for in a girl, he immediately said he wanted a girl with a nice ass and big tits lol cringe. Maybe one day he will see how shitty he is, but I don't see it happening any time in the near future unless the more prominent conservatives get too brazen and obvious with using Kyle as a prop and he catches on.",
                  "timestamp": "2021-12-16 08:54:29",
                  "score": 2,
                  "num_children": 1,
                  "author": 217672,
                  "replies": [
                    {
                      "id": "hordbol",
                      "text": "> I think that he is a YouTube guy who used to be a right winger but he learned more about the current right wing and now he's more left leaning.\n\nPretty much what I was getting at.",
                      "timestamp": "2021-12-16 08:59:40",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hophlac",
      "text": "I cannot fathom what is going on in the USA right now.",
      "timestamp": "2021-12-15 23:03:53",
      "score": 9,
      "num_children": 1,
      "author": 64283,
      "replies": [
        {
          "id": "hopk069",
          "text": "Me neither, and I live here.",
          "timestamp": "2021-12-15 23:21:10",
          "score": 5,
          "num_children": 1,
          "author": 45651,
          "replies": [
            {
              "id": "horlfiw",
              "text": "Everyone has a feeling that things are only going to get worse from here.",
              "timestamp": "2021-12-16 10:52:05",
              "score": 1,
              "num_children": 0,
              "author": 193748,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hooisjb",
      "text": "I love how \"hero\" used to be something you earned by doing something amazing, helping humanity, going above and beyond. You know, like hospital staff working triple shifts keeping people alive in a pandemic. Now the threshold seems to be \"not a convicted murderer.\" Okay then.",
      "timestamp": "2021-12-15 19:16:12",
      "score": 25,
      "num_children": 1,
      "author": 363490,
      "replies": [
        {
          "id": "hoq9m4j",
          "text": "“Committed murder against *those people we hate* and got away with it”.\n\nWhat’s not to revere? 🤢",
          "timestamp": "2021-12-16 02:32:08",
          "score": 8,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hoold8n",
      "text": "I guess Derek Chauvin wasn’t available",
      "timestamp": "2021-12-15 19:32:36",
      "score": 7,
      "num_children": 1,
      "author": 122843,
      "replies": [
        {
          "id": "hoqbceu",
          "text": "OH SHIT",
          "timestamp": "2021-12-16 02:44:48",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hoozj8f",
      "text": "This kid is such a fucking toadstool",
      "timestamp": "2021-12-15 21:03:42",
      "score": 9,
      "num_children": 0,
      "author": 128107,
      "replies": []
    },
    {
      "id": "hop0ns9",
      "text": "What's he gonna say? Guns go boom. I killed people. Hurrdurr.",
      "timestamp": "2021-12-15 21:10:54",
      "score": 9,
      "num_children": 1,
      "author": 78844,
      "replies": [
        {
          "id": "hop8e2v",
          "text": "*Standing ovation*",
          "timestamp": "2021-12-15 22:00:47",
          "score": 7,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hoqbzsp",
      "text": "Has PTSD so bad he cries, yet monetizes his actions easily. PTSD my ass",
      "timestamp": "2021-12-16 02:49:35",
      "score": 8,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hookdxb",
      "text": "Are you kidding me. \n\nHave no idea why moved to this fucken Fascist state.",
      "timestamp": "2021-12-15 19:26:18",
      "score": 8,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hoombc0",
      "text": "My brain threw up inside of my skull.",
      "timestamp": "2021-12-15 19:38:38",
      "score": 7,
      "num_children": 0,
      "author": 246718,
      "replies": []
    },
    {
      "id": "hoor161",
      "text": "Someone please tell me this is fake and OP created a meme to troll the entire subreddit with….. Pretty Please?!",
      "timestamp": "2021-12-15 20:08:43",
      "score": 7,
      "num_children": 1,
      "replies": [
        {
          "id": "hoorcdk",
          "text": "I wish it were a joke. Kyle is even promoting it on his Twitter",
          "timestamp": "2021-12-15 20:10:45",
          "score": 6,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hoous5o",
      "text": "His life is literally only going to get worse. He will be the poster boy like Zimmerman was for a while then they will have a new flavor of the week and his life will implode like Zimmerman's did. Next 5 years you'll see his name in the news again for DUI or domestic violence or shooting someone again.\n\nThese poster boys never learn do they. Society always remembers you're a shitbag especially once your leaders can't make money off of you anymore.",
      "timestamp": "2021-12-15 20:32:49",
      "score": 6,
      "num_children": 0,
      "author": 390115,
      "replies": []
    },
    {
      "id": "hop199v",
      "text": "Is this real life?",
      "timestamp": "2021-12-15 21:14:44",
      "score": 6,
      "num_children": 0,
      "author": 82049,
      "replies": []
    },
    {
      "id": "hop5pnu",
      "text": "Kyle is an absolute moron with nothing valuable to say but we did have a president who was largely incoherent so I guess it’s par for the course in right wing land.",
      "timestamp": "2021-12-15 21:43:26",
      "score": 8,
      "num_children": 1,
      "author": 72631,
      "replies": [
        {
          "id": "hos8l9e",
          "text": "It's a bonus for them because then they are \"real Americans like us!\"",
          "timestamp": "2021-12-16 14:35:15",
          "score": 2,
          "num_children": 0,
          "author": 311561,
          "replies": []
        }
      ]
    },
    {
      "id": "hop5zps",
      "text": "Hope he keeps on being public and making appearances like this. And I hope they keep announcing them. Makes it easier to find him. I’ll go toe to toe with this doughy piece of shit. Keep it up Kyle.",
      "timestamp": "2021-12-15 21:45:12",
      "score": 7,
      "num_children": 0,
      "author": 394866,
      "replies": []
    },
    {
      "id": "hoqhh0w",
      "text": "Nazi youth on the rise.  So what’s next, a country pop album?  With a little auto tune, anything is possible.",
      "timestamp": "2021-12-16 03:30:27",
      "score": 7,
      "num_children": 0,
      "author": 340175,
      "replies": []
    },
    {
      "id": "hoqtgii",
      "text": "So they are celebrating a guy that killed fellow Americans? Sounds about conservative extremism.",
      "timestamp": "2021-12-16 05:11:41",
      "score": 7,
      "num_children": 0,
      "author": 358637,
      "replies": []
    },
    {
      "id": "hoqtub0",
      "text": "some skater needs to shoot him out of \"self defense\"",
      "timestamp": "2021-12-16 05:15:19",
      "score": 7,
      "num_children": 0,
      "author": 363057,
      "replies": []
    },
    {
      "id": "hor7ux1",
      "text": "America Fist, let's get fisted for freedom.",
      "timestamp": "2021-12-16 07:47:55",
      "score": 7,
      "num_children": 0,
      "author": 143668,
      "replies": []
    },
    {
      "id": "hoobrvs",
      "text": "Well this will just motivate more murderous assholes",
      "timestamp": "2021-12-15 18:31:10",
      "score": 18,
      "num_children": 0,
      "author": 309665,
      "replies": []
    },
    {
      "id": "hoouqo4",
      "text": "Jesus,  this is gonna be held in my hometown of Phoenix!?\n\nI really hope barely anyone shows up to this shitshow",
      "timestamp": "2021-12-15 20:32:33",
      "score": 7,
      "num_children": 1,
      "author": 358768,
      "replies": [
        {
          "id": "hor8sy5",
          "text": "put a sign outside of the venue that says vax cards required",
          "timestamp": "2021-12-16 07:59:48",
          "score": 3,
          "num_children": 0,
          "author": 66735,
          "replies": []
        }
      ]
    },
    {
      "id": "hop640a",
      "text": "What of value could this little vigilante piece of shit possibly have to say?",
      "timestamp": "2021-12-15 21:45:57",
      "score": 6,
      "num_children": 0,
      "author": 150428,
      "replies": []
    },
    {
      "id": "hop9x49",
      "text": "y'know if I was this guy I would stay out of public light. he seems to be quite proud of what he's done. I really don't know how someone can kill someone and then go on to do this shit after your trial ends. \n\nI would find it hard to live with myself for months or possibly years if I killed someone, even in self defense. I think in all honesty it would haunt me until I died. I don't understand this guy at all. does he have no remorse?",
      "timestamp": "2021-12-15 22:11:07",
      "score": 6,
      "num_children": 1,
      "replies": [
        {
          "id": "hor2yd2",
          "text": "No, he doesn't, and it's horrifyingly common on this planet.",
          "timestamp": "2021-12-16 06:48:44",
          "score": 2,
          "num_children": 0,
          "author": 241045,
          "replies": []
        }
      ]
    },
    {
      "id": "hoposfb",
      "text": "Treating RWers like anything other than the slackjawed grinder monkey terrorist trash they are is a dangerous mistake.",
      "timestamp": "2021-12-15 23:55:59",
      "score": 5,
      "num_children": 0,
      "author": 117066,
      "replies": []
    },
    {
      "id": "hopv3gs",
      "text": "I hope everyone there catches Covid and dies",
      "timestamp": "2021-12-16 00:43:41",
      "score": 7,
      "num_children": 0,
      "author": 187646,
      "replies": []
    },
    {
      "id": "hoqbvpk",
      "text": "Okay, he's innocent according to law, even though I don't agree. What makes him a hero though?",
      "timestamp": "2021-12-16 02:48:45",
      "score": 6,
      "num_children": 1,
      "replies": [
        {
          "id": "hor2tsu",
          "text": "Because he's a gun user. That's all they need.",
          "timestamp": "2021-12-16 06:47:17",
          "score": 3,
          "num_children": 0,
          "author": 336892,
          "replies": []
        }
      ]
    },
    {
      "id": "hoqmhd5",
      "text": "I quit, there's no fucking justice in the world, I'm done, I have to get out of politics and out of the country.",
      "timestamp": "2021-12-16 04:10:29",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hoqpnqm",
      "text": "There's an ancient proverb that goes \"A conservative would gleefully smear feces all over himself if it meant a liberal had to smell it\" and that's exactly what's happening here.",
      "timestamp": "2021-12-16 04:37:32",
      "score": 6,
      "num_children": 0,
      "author": 114511,
      "replies": []
    },
    {
      "id": "hoqr5wo",
      "text": "*sigh* come on, dude. you don’t have to do this. just go live a quiet life and be a nurse or whatever like you said on Tucker Carlson.",
      "timestamp": "2021-12-16 04:50:46",
      "score": 8,
      "num_children": 0,
      "author": 140919,
      "replies": []
    },
    {
      "id": "hoosl02",
      "text": "Conservatives are so fucked up lol",
      "timestamp": "2021-12-15 20:18:46",
      "score": 4,
      "num_children": 0,
      "author": 346281,
      "replies": []
    },
    {
      "id": "hoovmf2",
      "text": "The right was a murder for an idol. Fitting.",
      "timestamp": "2021-12-15 20:38:11",
      "score": 5,
      "num_children": 0,
      "author": 2962,
      "replies": []
    },
    {
      "id": "hoow7lo",
      "text": "Murder being legalized wasn’t on my 2021 bingo card, but what can you do, better luck next year",
      "timestamp": "2021-12-15 20:42:05",
      "score": 5,
      "num_children": 0,
      "author": 176897,
      "replies": []
    },
    {
      "id": "hop087a",
      "text": "Kyle is pawn for conservatives, nothing more",
      "timestamp": "2021-12-15 21:08:07",
      "score": 5,
      "num_children": 0,
      "author": 311538,
      "replies": []
    },
    {
      "id": "hop84c5",
      "text": "The US is just racing downhill with every day Fox news and Charlie Kirk exist. Awful.",
      "timestamp": "2021-12-15 21:59:02",
      "score": 5,
      "num_children": 0,
      "author": 101175,
      "replies": []
    },
    {
      "id": "hopkv7p",
      "text": "Republicans claim to be pro life but put this killer on a pedestal. I wonder how long before we see another Timothy McVeigh and how many TV spots and speaking appearances  they'll get.",
      "timestamp": "2021-12-15 23:27:25",
      "score": 5,
      "num_children": 1,
      "author": 212216,
      "replies": [
        {
          "id": "hopm4qo",
          "text": "My mom was friends with a woman named Suzanne that dated McVeigh when he was stationed at Fort Reily Kansas before he went to the gulf War...I seem to recall her saying it was 1989/1990? She told us he was a part of the KKK and when she found out, she dumped him",
          "timestamp": "2021-12-15 23:36:32",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hoq4dk9",
      "text": "Trump supporters have reached cartoon villainy levels of evil.",
      "timestamp": "2021-12-16 01:53:40",
      "score": 4,
      "num_children": 0,
      "author": 160031,
      "replies": []
    },
    {
      "id": "hoq4p6z",
      "text": "Based on his behavior and statements since the trial, I wonder if he sticks to his guns and tells them he doesn't want anything to do with guns or violence or he cashes in and uses his new celebrity status to make money and help destroy America. Place your bets now!!!",
      "timestamp": "2021-12-16 01:56:07",
      "score": 4,
      "num_children": 0,
      "author": 19190,
      "replies": []
    },
    {
      "id": "hoqztsx",
      "text": "“HEY GUYS! I know i beat a double homicide case by way of my judge being a blow-hard, but yeah! come watch me talk about shit i don’t know anything about! Go america!”",
      "timestamp": "2021-12-16 06:14:12",
      "score": 7,
      "num_children": 0,
      "author": 7767,
      "replies": []
    },
    {
      "id": "hor9fwt",
      "text": "He’s making a career out of the fame he got from shooting people… disgusting",
      "timestamp": "2021-12-16 08:08:04",
      "score": 5,
      "num_children": 0,
      "author": 359522,
      "replies": []
    },
    {
      "id": "hoob39b",
      "text": "I can only imagine the word vomit going on at the rally.",
      "timestamp": "2021-12-15 18:26:43",
      "score": 13,
      "num_children": 0,
      "author": 97271,
      "replies": []
    },
    {
      "id": "hoon9z8",
      "text": "[removed]",
      "timestamp": "2021-12-15 19:44:45",
      "score": 5,
      "num_children": 1,
      "replies": [
        {
          "id": "hopdh1u",
          "text": "No, they'll be saying the day of the rope has come.\n\nThe USA might be a fascist dictatorship in a couple of years.",
          "timestamp": "2021-12-15 22:35:18",
          "score": 6,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hooncn7",
      "text": "there it is again, that funny feeling",
      "timestamp": "2021-12-15 19:45:13",
      "score": 4,
      "num_children": 0,
      "author": 212779,
      "replies": []
    },
    {
      "id": "hoonvas",
      "text": "Fucking asshole.",
      "timestamp": "2021-12-15 19:48:32",
      "score": 4,
      "num_children": 0,
      "author": 347912,
      "replies": []
    },
    {
      "id": "hoor7dp",
      "text": "#blm",
      "timestamp": "2021-12-15 20:09:51",
      "score": 4,
      "num_children": 0,
      "author": 209583,
      "replies": []
    },
    {
      "id": "hop2k9c",
      "text": "This is actually gross",
      "timestamp": "2021-12-15 21:23:08",
      "score": 4,
      "num_children": 0,
      "author": 189850,
      "replies": []
    },
    {
      "id": "hop4ubi",
      "text": "Performative nonsense. They are turning him into a symbol of right wing violence and white supremacy",
      "timestamp": "2021-12-15 21:37:43",
      "score": 4,
      "num_children": 0,
      "author": 286897,
      "replies": []
    },
    {
      "id": "hop8tpa",
      "text": "In reality, what qualifications does an 18 year old kid have to give a political speech? Does him using his gun to shoot other Americans suddenly make him a hero? This is some really awful messaging and quite honestly, it makes the GOP look like monsters.",
      "timestamp": "2021-12-15 22:03:43",
      "score": 3,
      "num_children": 0,
      "author": 266061,
      "replies": []
    },
    {
      "id": "hopb726",
      "text": "What the fuck is \"America Fest\" sounds like a convention for morons.",
      "timestamp": "2021-12-15 22:19:43",
      "score": 5,
      "num_children": 0,
      "author": 313504,
      "replies": []
    },
    {
      "id": "hopih0b",
      "text": "“So you got away with murder, tell us about that”",
      "timestamp": "2021-12-15 23:10:08",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hopjqud",
      "text": "So much for “I just wanna stay out of politics now”",
      "timestamp": "2021-12-15 23:19:18",
      "score": 4,
      "num_children": 0,
      "author": 153976,
      "replies": []
    },
    {
      "id": "hoplmo8",
      "text": "Take off and nuke the site from orbit.  Nothing of value will be lost.",
      "timestamp": "2021-12-15 23:32:58",
      "score": 4,
      "num_children": 1,
      "author": 174461,
      "replies": [
        {
          "id": "hopsedt",
          "text": "Honestly, if the rest of the world decided to nuke America I wouldn’t blame them.",
          "timestamp": "2021-12-16 00:23:04",
          "score": 4,
          "num_children": 1,
          "author": 154165,
          "replies": [
            {
              "id": "hopxe93",
              "text": "Works for me. But then Putin will be happy",
              "timestamp": "2021-12-16 01:01:06",
              "score": 2,
              "num_children": 0,
              "author": 174461,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hopohw3",
      "text": "Wait until you see how long the standing ovation goes. My house is going to look like the pie eating contest in Stand By Me.",
      "timestamp": "2021-12-15 23:53:48",
      "score": 4,
      "num_children": 0,
      "author": 361814,
      "replies": []
    },
    {
      "id": "hoppd94",
      "text": "He's gonna need the money for when the lawsuits hit. That's (IMO) why he was praising BLM. He's trying to get out ahead of that.",
      "timestamp": "2021-12-16 00:00:20",
      "score": 4,
      "num_children": 0,
      "author": 20553,
      "replies": []
    },
    {
      "id": "hopy2cr",
      "text": "All that differentiates Rittenhouse from Crumbley is that school was online only when Rittenhouse did his murders",
      "timestamp": "2021-12-16 01:06:02",
      "score": 3,
      "num_children": 0,
      "author": 66135,
      "replies": []
    },
    {
      "id": "hoq51j6",
      "text": "Man what a dîckhead.",
      "timestamp": "2021-12-16 01:58:41",
      "score": 3,
      "num_children": 0,
      "author": 8358,
      "replies": []
    },
    {
      "id": "hoq5iu6",
      "text": "We all knew this was going to happen. The right takes care of their own.",
      "timestamp": "2021-12-16 02:02:17",
      "score": 4,
      "num_children": 0,
      "author": 122182,
      "replies": []
    },
    {
      "id": "hoqc3ad",
      "text": "From the same folks that demonize Gretta for wanting to save the only planet we call home.",
      "timestamp": "2021-12-16 02:50:17",
      "score": 4,
      "num_children": 0,
      "author": 160742,
      "replies": []
    },
    {
      "id": "hoqcsyw",
      "text": "After they went with the gun couple, they knew they had to up their speakers into actual murderers. Next will be a serial killer who only tortured and killed college women in liberal arts fields to get the same kind of reaction.",
      "timestamp": "2021-12-16 02:55:30",
      "score": 4,
      "num_children": 0,
      "author": 34217,
      "replies": []
    },
    {
      "id": "hoqf2qr",
      "text": "Looks like a young Glenn Beck. Square headed. Well fed. Whole shape is fat rounded corners.",
      "timestamp": "2021-12-16 03:12:30",
      "score": 3,
      "num_children": 0,
      "author": 284155,
      "replies": []
    },
    {
      "id": "hoqgj2a",
      "text": "I AM NOT SAYING WE SHOULD \n\nBut how do y’all think the alt right would react if someone shot Kyle rittenhouse",
      "timestamp": "2021-12-16 03:23:23",
      "score": 4,
      "num_children": 1,
      "author": 231212,
      "replies": [
        {
          "id": "houvxpp",
          "text": "If he was threatening their life I’m sure they would understand ;)",
          "timestamp": "2021-12-17 01:22:17",
          "score": 1,
          "num_children": 0,
          "author": 169373,
          "replies": []
        }
      ]
    },
    {
      "id": "hor6532",
      "text": "Man, he sure changed his mind from not wanting to be too high profile really fast. My guess is that the whole \"moderate who was forced to take action\" thing he was going for really didn't play well to basically anyone on the left so he just dropped it.",
      "timestamp": "2021-12-16 07:26:26",
      "score": 3,
      "num_children": 0,
      "author": 277978,
      "replies": []
    },
    {
      "id": "horu466",
      "text": "like this little shit knows anything about anything",
      "timestamp": "2021-12-16 12:31:57",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hool94c",
      "text": "The true sign that someone is truly mournful and remorseful for an \"unfortunate situation that happened to result in two people's deaths\" is parlaying that tragedy into an all-out media tour",
      "timestamp": "2021-12-15 19:31:51",
      "score": 3,
      "num_children": 0,
      "author": 57031,
      "replies": []
    },
    {
      "id": "hooo8nn",
      "text": "Can’t say I’m surprised",
      "timestamp": "2021-12-15 19:50:50",
      "score": 3,
      "num_children": 0,
      "author": 69963,
      "replies": []
    },
    {
      "id": "hooqjrw",
      "text": "what is he gonna speak about lol the kid literally has no skills no kinda talent or anything. His only \"accomplishment\" is killing people.",
      "timestamp": "2021-12-15 20:05:36",
      "score": 3,
      "num_children": 0,
      "author": 214309,
      "replies": []
    },
    {
      "id": "hooxrry",
      "text": "What. The. Actual. FUCK!",
      "timestamp": "2021-12-15 20:52:13",
      "score": 3,
      "num_children": 0,
      "author": 312652,
      "replies": []
    },
    {
      "id": "hop42h0",
      "text": "Haha is his forehead really that big?",
      "timestamp": "2021-12-15 21:32:40",
      "score": 3,
      "num_children": 0,
      "author": 76793,
      "replies": []
    },
    {
      "id": "hopu2h8",
      "text": "I guess that seals it.\n\nTo have a long career as a speaker to groups of morons, just murder innocent people and get away with it, because the people you killed with liberal.",
      "timestamp": "2021-12-16 00:35:46",
      "score": 3,
      "num_children": 0,
      "author": 404389,
      "replies": []
    },
    {
      "id": "hopu2yq",
      "text": "I wonder if he’ll run for president with OJ Simpson.",
      "timestamp": "2021-12-16 00:35:52",
      "score": 3,
      "num_children": 0,
      "author": 409875,
      "replies": []
    },
    {
      "id": "hopw9ly",
      "text": "Turning Point... The same crowd of people that think they should be able to shoot anyone who disagrees with their political opinions.",
      "timestamp": "2021-12-16 00:52:29",
      "score": 3,
      "num_children": 0,
      "author": 328367,
      "replies": []
    },
    {
      "id": "hopzskc",
      "text": "Man, America is fucking wild.",
      "timestamp": "2021-12-16 01:19:21",
      "score": 3,
      "num_children": 0,
      "author": 326521,
      "replies": []
    },
    {
      "id": "hoq0w2m",
      "text": "If you're celebrating murderers you're probably the bad guys.",
      "timestamp": "2021-12-16 01:27:37",
      "score": 3,
      "num_children": 0,
      "author": 283493,
      "replies": []
    },
    {
      "id": "hoq2ldb",
      "text": "This is some kind of slow grind to something, and one day, that something is going to give.",
      "timestamp": "2021-12-16 01:40:30",
      "score": 3,
      "num_children": 0,
      "author": 400448,
      "replies": []
    },
    {
      "id": "hoqe85h",
      "text": "You have to *apply* to attend.",
      "timestamp": "2021-12-16 03:06:02",
      "score": 3,
      "num_children": 0,
      "author": 65782,
      "replies": []
    },
    {
      "id": "hoqmr65",
      "text": "Oh my god this is really fucking me up. What in the actual fuck fuck fuck!!!!!!! Please tell me this is a joke omfg",
      "timestamp": "2021-12-16 04:12:46",
      "score": 3,
      "num_children": 0,
      "author": 104898,
      "replies": []
    },
    {
      "id": "hoqwdga",
      "text": "Ewww this is my state.",
      "timestamp": "2021-12-16 05:39:38",
      "score": 3,
      "num_children": 0,
      "author": 309099,
      "replies": []
    },
    {
      "id": "hoqzsxt",
      "text": "Wow. Wtf is wrong with people?",
      "timestamp": "2021-12-16 06:13:56",
      "score": 3,
      "num_children": 0,
      "author": 275092,
      "replies": []
    },
    {
      "id": "hor44yl",
      "text": "on todays panel \"how to get away with murder\"",
      "timestamp": "2021-12-16 07:02:28",
      "score": 3,
      "num_children": 0,
      "author": 75302,
      "replies": []
    },
    {
      "id": "hor7v4l",
      "text": "next up ted bundy",
      "timestamp": "2021-12-16 07:48:00",
      "score": 3,
      "num_children": 0,
      "author": 66735,
      "replies": []
    },
    {
      "id": "hordubv",
      "text": "this shit's sick",
      "timestamp": "2021-12-16 09:06:50",
      "score": 3,
      "num_children": 0,
      "author": 261458,
      "replies": []
    },
    {
      "id": "hos3iwk",
      "text": "I remember people saying that he will be psychologically scarred...",
      "timestamp": "2021-12-16 13:56:05",
      "score": 3,
      "num_children": 0,
      "author": 272429,
      "replies": []
    },
    {
      "id": "hosh690",
      "text": "Rittenhouse went around publicly disavow in his hero worship cult and claiming that he supported black lives matter, his killings apparently having traumatized him into being a less terrible person.\n\nAnd this single image confirms that all that was just an act recommended by his lawyer in order to look good in civil court and discourage federal charges.",
      "timestamp": "2021-12-16 15:35:34",
      "score": 3,
      "num_children": 0,
      "author": 45188,
      "replies": []
    },
    {
      "id": "hooowwg",
      "text": "The first thing I said when he was acquitted was that he was going to be signing skateboards at conservative conventions within a year.",
      "timestamp": "2021-12-15 19:55:06",
      "score": 10,
      "num_children": 0,
      "author": 400353,
      "replies": []
    },
    {
      "id": "hoojp1c",
      "text": "Well surely he has some good tips about how to get away with murder.",
      "timestamp": "2021-12-15 19:21:55",
      "score": 2,
      "num_children": 0,
      "author": 373729,
      "replies": []
    },
    {
      "id": "hooonx3",
      "text": "I’m throwing up outside of my mouth more than a little bit.",
      "timestamp": "2021-12-15 19:53:31",
      "score": 2,
      "num_children": 0,
      "author": 260095,
      "replies": []
    },
    {
      "id": "hooqax2",
      "text": "I called it. That in 10 years he would be running for some political office as a republican.\n\nGuess I was wrong about the time though.",
      "timestamp": "2021-12-15 20:04:01",
      "score": 2,
      "num_children": 0,
      "author": 72936,
      "replies": []
    },
    {
      "id": "hoor45q",
      "text": "what's funny is they would lose their fucking minds if there was a mexicofest",
      "timestamp": "2021-12-15 20:09:16",
      "score": 2,
      "num_children": 0,
      "author": 124938,
      "replies": []
    },
    {
      "id": "hoorkfh",
      "text": "Knew this sorta shit would happen the second he took the stand.",
      "timestamp": "2021-12-15 20:12:10",
      "score": 2,
      "num_children": 0,
      "author": 407822,
      "replies": []
    },
    {
      "id": "hoosz89",
      "text": "[removed]",
      "timestamp": "2021-12-15 20:21:17",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "hoq3hei",
          "text": "The term you’re looking for is ‘backpfeifengesicht’",
          "timestamp": "2021-12-16 01:47:08",
          "score": 2,
          "num_children": 0,
          "author": 86876,
          "replies": []
        }
      ]
    },
    {
      "id": "hoozf41",
      "text": "They stretched his head vertically so he looks slightly less like a cartoon pig.",
      "timestamp": "2021-12-15 21:02:58",
      "score": 2,
      "num_children": 0,
      "author": 128174,
      "replies": []
    },
    {
      "id": "hop16ig",
      "text": "Maybe this time he'll be shooting blanks!",
      "timestamp": "2021-12-15 21:14:15",
      "score": 2,
      "num_children": 0,
      "author": 181879,
      "replies": []
    },
    {
      "id": "hop7byo",
      "text": "Throwing up from two ends",
      "timestamp": "2021-12-15 21:53:54",
      "score": 2,
      "num_children": 0,
      "author": 104107,
      "replies": []
    },
    {
      "id": "hop7tqo",
      "text": "Really can't say I didn't see this coming. \n\nJust glad that this will really be helping shoot down his defamation cases.",
      "timestamp": "2021-12-15 21:57:06",
      "score": 2,
      "num_children": 0,
      "author": 392603,
      "replies": []
    },
    {
      "id": "hop9g71",
      "text": "Toilet Paper USA, very fitting.",
      "timestamp": "2021-12-15 22:07:54",
      "score": 2,
      "num_children": 0,
      "author": 205481,
      "replies": []
    },
    {
      "id": "hop9p68",
      "text": "The right wing has no shame. They’ll lie, cheat, kill, steal, and throw their “values” away to gain and hold onto power and money.",
      "timestamp": "2021-12-15 22:09:36",
      "score": 2,
      "num_children": 0,
      "author": 171746,
      "replies": []
    },
    {
      "id": "hop9xin",
      "text": "Yikes",
      "timestamp": "2021-12-15 22:11:11",
      "score": 2,
      "num_children": 0,
      "author": 9532,
      "replies": []
    },
    {
      "id": "hopa4ug",
      "text": "Kyle will be in jail within a year.",
      "timestamp": "2021-12-15 22:12:34",
      "score": 2,
      "num_children": 0,
      "author": 295400,
      "replies": []
    },
    {
      "id": "hopb67w",
      "text": "Fun trick. The TP stands for toilet paper. Someone forgot to flush.",
      "timestamp": "2021-12-15 22:19:33",
      "score": 2,
      "num_children": 0,
      "author": 235569,
      "replies": []
    },
    {
      "id": "hopc6al",
      "text": "Americafest? Oh boy",
      "timestamp": "2021-12-15 22:26:22",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hopdsqj",
      "text": "Was trying to think of what a “Canada Fest” would look like up here. Probably just a bunch of maple syrup vendors, a guy dressed as a snow man, ice carvers, and homeless people in a square downtown Toronto.",
      "timestamp": "2021-12-15 22:37:32",
      "score": 2,
      "num_children": 0,
      "author": 381968,
      "replies": []
    },
    {
      "id": "hopepgc",
      "text": "Saw that coming.",
      "timestamp": "2021-12-15 22:43:49",
      "score": 2,
      "num_children": 0,
      "author": 53172,
      "replies": []
    },
    {
      "id": "hopf1j3",
      "text": "Don't go to his Twitter. It is just awful. I seriously can't see how ANY human being alive can look at this guy and think \"yeah thats who I want representing gun people like me\" this country is pathetic",
      "timestamp": "2021-12-15 22:46:08",
      "score": 2,
      "num_children": 0,
      "author": 271685,
      "replies": []
    },
    {
      "id": "hopknib",
      "text": "Ew.",
      "timestamp": "2021-12-15 23:25:53",
      "score": 2,
      "num_children": 0,
      "author": 191376,
      "replies": []
    },
    {
      "id": "hopsm3w",
      "text": "TPUSA: Because the living embodiment of Cartman couldn't make friends so he made a hate group.",
      "timestamp": "2021-12-16 00:24:41",
      "score": 2,
      "num_children": 0,
      "author": 412412,
      "replies": []
    },
    {
      "id": "hoptwq3",
      "text": "This is a honeypot/honeytrap.",
      "timestamp": "2021-12-16 00:34:34",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hopwzqq",
      "text": "Maybe the next thing can be a reality TV series on Fox Nation called “Alt Right Bachelor”. Blonde Right Wing media personalities like Ann Coulter, Tomi Lahri, Ainsley Earhardt, Kristy Swanson and Meagyn Kelly competent to be Kyle’s first girlfriend and save him from being an incel. It’s too late to save him from being a killer.",
      "timestamp": "2021-12-16 00:58:02",
      "score": 2,
      "num_children": 0,
      "author": 407170,
      "replies": []
    },
    {
      "id": "hopzs47",
      "text": "The right-wing version of David Hogg.",
      "timestamp": "2021-12-16 01:19:15",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hoq2l4m",
      "text": "Where’s Chrystul Kizer’s invite?",
      "timestamp": "2021-12-16 01:40:28",
      "score": 2,
      "num_children": 0,
      "author": 300924,
      "replies": []
    },
    {
      "id": "hoq2mv2",
      "text": "The nationalism around republicans/conservatives is starting to unnerve me even more..",
      "timestamp": "2021-12-16 01:40:49",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hoq3f67",
      "text": "He won’t, but part of me Really hopes he talks about how racism is fucked up. He’s an idiot, and basically an NRA shill, but he’s young and according to several reports (I think, I’m not going to bother to source so downvote away), is somewhat pro- critical race theory/black lives matte",
      "timestamp": "2021-12-16 01:46:40",
      "score": 2,
      "num_children": 0,
      "author": 383076,
      "replies": []
    },
    {
      "id": "hoq3oe7",
      "text": "Holy shit! I think this post has the most upvotes and comments ever on this sub! Thank you to all for the interaction here. It's much appreciated.",
      "timestamp": "2021-12-16 01:48:34",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hoq4iyn",
      "text": "This is so fucked. It'll just incentivize more murderous alt-right fuckheads to go and kill people for no reason and claim 'self defense' to not get punished for it.\n\nThis country is going down such a downwards spiral, it's worse than I thought was possible, but I honestly shouldn't be surprised.",
      "timestamp": "2021-12-16 01:54:48",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hoq6208",
      "text": "They’ve got to funnel money to him somehow",
      "timestamp": "2021-12-16 02:06:11",
      "score": 2,
      "num_children": 0,
      "author": 232646,
      "replies": []
    },
    {
      "id": "hoqc19z",
      "text": "Fucking disgusting",
      "timestamp": "2021-12-16 02:49:53",
      "score": 2,
      "num_children": 0,
      "author": 104333,
      "replies": []
    },
    {
      "id": "hoqc98j",
      "text": "\"Supplies\".",
      "timestamp": "2021-12-16 02:51:29",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hoqpqed",
      "text": "The question still stands. How do all of these republicans and GOP know Kyle is a republican? 🧐🙄",
      "timestamp": "2021-12-16 04:38:11",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hos4v92",
      "text": "Everyday, I see bullshit like these mfs, and I take America less and less seriously",
      "timestamp": "2021-12-16 14:06:51",
      "score": 2,
      "num_children": 0,
      "author": 64068,
      "replies": []
    },
    {
      "id": "hos6b34",
      "text": "I had a panic attack because I saw \"Confirmed Speaker\" and my sleep deprived brain thought that this was some sort of propaganda ad claiming that Rittenhouse should be made Speaker of the House if the Republican Party retakes the house.",
      "timestamp": "2021-12-16 14:18:00",
      "score": 2,
      "num_children": 0,
      "author": 137438,
      "replies": []
    },
    {
      "id": "hosagfg",
      "text": "Can someone who's not me please photoshop the image of him crying onto this poster instead?",
      "timestamp": "2021-12-16 14:48:52",
      "score": 2,
      "num_children": 0,
      "author": 283922,
      "replies": []
    },
    {
      "id": "hosakro",
      "text": "Not even a tiny bit surprising that a violent racist is speaking at a meeting of violent racists. If you know a republican, you know  fascist!",
      "timestamp": "2021-12-16 14:49:44",
      "score": 2,
      "num_children": 0,
      "author": 289804,
      "replies": []
    },
    {
      "id": "hosbiu6",
      "text": "No surprise here.  \n\n[Neo nazis were lining up for George Zimmerman (man who killed a black teen Trayvon Martin for looking \"suspicious\")](https://i.redd.it/psi1lytm9ye21.jpg)\n\nFucking Tom Cotton and Matt Gaetz were going at each other for the right to hire Rittenhouse as an intern.  It just goes to show you that conservatives and the right wing in general don't have to do anything but just fuck with the democrats to get support.",
      "timestamp": "2021-12-16 14:56:27",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hosiirr",
      "text": "What happened to keeping a low profile?",
      "timestamp": "2021-12-16 15:44:31",
      "score": 2,
      "num_children": 0,
      "author": 254756,
      "replies": []
    },
    {
      "id": "hotum19",
      "text": "Let’s celebrate death, and sensationalize the violence of still-developing adolescent brains! It’s like GOP trap. \n\nY’all saw the interview with son’s troglodyte mother, right? That kid never stood a chance in life.",
      "timestamp": "2021-12-16 20:57:07",
      "score": 2,
      "num_children": 1,
      "author": 177106,
      "replies": [
        {
          "id": "hov3e3a",
          "text": "Damned right! And to add; this fucker dropped out of high school, doesn't have a diploma or GED but has a few right wing politicians offering him a job as a political intern that's going to be paid! He's the republicunts new poster boy",
          "timestamp": "2021-12-17 02:17:38",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hsivm22",
      "text": "Kyle is speaking at public events? Not surprising and good information to have.",
      "timestamp": "2022-01-13 19:11:54",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hoot661",
      "text": "i’m not for the right making kyle some type of political martyr or hero but for the love of god can we please stop saying he murdered people? the videos clearly show him being attacked like cmon can we stop we this narrative already?",
      "timestamp": "2021-12-15 20:22:31",
      "score": -38,
      "num_children": 2,
      "author": 280751,
      "replies": [
        {
          "id": "hope4jm",
          "text": "He went there with the intent and expectation of killing people.\n\nSelf-fulfilling prophecy.",
          "timestamp": "2021-12-15 22:39:49",
          "score": 9,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hootc3k",
          "text": "Fuck off my post, boot licker",
          "timestamp": "2021-12-15 20:23:34",
          "score": 21,
          "num_children": 1,
          "replies": [
            {
              "id": "hootsre",
              "text": "i’m not a boot licker lol. i just said i’m not for the right making him some type of hero. i hate the right just as much as y’all. but this was never supposed to be turned into something political and kyle even said that himself. i think he’s a little shit as well but the facts are that he defended himself. he didn’t go there looking for trouble and theres proof of him giving aid to people. if you want to stay in the same narrative then that’s your right. but i’m simply stating the facts and the facts are he was attacked and tried to run away after shooting his first attacker n was attacked again",
              "timestamp": "2021-12-15 20:26:31",
              "score": -27,
              "num_children": 1,
              "author": 280751,
              "replies": [
                {
                  "id": "hop19m6",
                  "text": "His whole intention was to go there to murder/hunt people. He sure as fuck didn't go into the middle of a protest to play grab-ass and have a dance off.",
                  "timestamp": "2021-12-15 21:14:48",
                  "score": 14,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "hoq3rfg",
                      "text": "Your speculation on his intent is nothing more than that. How would you ever presume to know his intent I bet you never even bothered to watch any of the trial and are just regurgitating someone's opinion. Kyle had family and friends who's businesses were in the riot zone where police had been stood down and were allowing chaos to unfold. How dare he antagonize those poor rioters simply by being there :(",
                      "timestamp": "2021-12-16 01:49:11",
                      "score": -6,
                      "num_children": 0,
                      "author": 351637,
                      "replies": []
                    },
                    {
                      "id": "hop3q3i",
                      "text": "if you knew the facts you’d know he was there to protect businesses. yes they didn’t ask him to, yes he shouldn’t have been in possession of the gun to begin w. but regardless of that you can see him cleaning graffiti n giving medical aid. not once did he intimidate anyone or threaten anyone. he was threatened by someone n layer that night that same person attacked him. people didn’t see what happened n only saw that he shot someone so they immediately thought he just murdered the man. nothing he did suggested he was hunting people. if he was he would have literally hunted ppl. the facts show he simply went to defend businesses in an area that he worked. i’ve seen the video of his saying he wish he had his rifle to shoot at looters. ik that implies that he wanted to do that but he wasn’t shooting at people during the protest who were looting or protesting. he only shot at ppl who attacked him. i can guarantee you if no one had tried to attack kyle nothing would have happened",
                      "timestamp": "2021-12-15 21:30:26",
                      "score": -16,
                      "num_children": 3,
                      "author": 280751,
                      "replies": [
                        {
                          "id": "hopeg09",
                          "text": "> if you knew the facts you’d know he was there to protect businesses.\n\nAnd the Nazis were socialists, North Korea is democratic, and the Ministry of Truth never lied.\n\nOh, wait!",
                          "timestamp": "2021-12-15 22:42:00",
                          "score": 10,
                          "num_children": 0,
                          "replies": []
                        },
                        {
                          "id": "hop6qg5",
                          "text": "The car lot owner literally said in court that they didn't ask him to protect shit. So what other reasons are you going to make up to justify a kid bringing a rifle to a protest and murdering people? Can't wait to see the men's gymnastics on this one. \n\nHE BROUGHT A FUCKING GUN TO A PROTEST. HE WASN'T THERE TO EAT ICE CREAM AND PLAY CHECKERS, YOU THICK HEADDED DINK. YOU, YOURSELF JUST SAID HE WAS ON CAMERA TALKING ABOUT SHOOTING LOOTERS! BUT OH.. NOT *THIS* TIME. NOOOO.. HE DIDN'T MEAN IT *THAT* DAY. NOT MY LITTLE BUDDY-WUDDY KYLE! HE'D NEVER **DO** SUCH A THING.. EVEN THOUGH HE SAID HE WISHED HE HAD HIS RIFE SO HE COULD KILL PEOPLE STEALING. **ON** **CAMERA**. 🤦‍♂️ \n\nI refuse to believe you're *that*.. just.. Dumb.",
                          "timestamp": "2021-12-15 21:50:00",
                          "score": 9,
                          "num_children": 2,
                          "replies": [
                            {
                              "id": "hopnzh2",
                              "text": "I like that the idiot you responded to answered the other post, but not yours.  Wonder why...🤔",
                              "timestamp": "2021-12-15 23:50:01",
                              "score": 7,
                              "num_children": 1,
                              "author": 47550,
                              "replies": [
                                {
                                  "id": "hopqebz",
                                  "text": "Cause stupids are gonna stupid. 🤷‍♂️ Barely anyone is capable of critical thinking anymore. It's really sad.",
                                  "timestamp": "2021-12-16 00:08:02",
                                  "score": 5,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hor9fig",
                              "text": "So because he brought the gun to the “protest” (riot) that means he was there to commit violence? And therefore should not have been allowed to defend himself when people were coming after him? So what’s your opinion on Gaige Grosskreutz? He also brought a gun to the riot. Sounds like by your logic Gaige got what he deserved.",
                              "timestamp": "2021-12-16 08:07:55",
                              "score": -2,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hop9cq2",
                          "text": "He walked the streets with a gun for a reason, and it wasn't for self defense.",
                          "timestamp": "2021-12-15 22:07:15",
                          "score": 10,
                          "num_children": 1,
                          "author": 205481,
                          "replies": [
                            {
                              "id": "hopabqt",
                              "text": "if it wasn’t for self defense then why didn’t he just start shooting people unprovoked? why didn’t he shoot anyone he saw doing damage to buildings? btw he wasn’t there alone he went w a group of people. so by you saying that was his intentions then that must’ve been the intentions of the group then right? so why didn’t they commit a mass shooting?",
                              "timestamp": "2021-12-15 22:13:52",
                              "score": 2,
                              "num_children": 1,
                              "author": 280751,
                              "replies": [
                                {
                                  "id": "hopem1x",
                                  "text": "Had to make it look like self defence so that he wouldn't be put in jail forever.",
                                  "timestamp": "2021-12-15 22:43:09",
                                  "score": 5,
                                  "num_children": 2,
                                  "replies": [
                                    {
                                      "id": "hopfrb3",
                                      "text": "how did he “make” it look like self defense? there’s clear video of him being attacked by a man who threatened him earlier that night. there’s also clear video of people who think he just murdered that man also attacking him.",
                                      "timestamp": "2021-12-15 22:51:06",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 280751,
                                      "replies": []
                                    },
                                    {
                                      "id": "hor9tss",
                                      "text": "Wow Kyle must be a fucking psychic to know that people would come after him unprovoked if he went to that riot and that there would be recordings of it if he ended up being arrested and charged. It’s like the perfect crime, which is very impressive for a 17 year old to pull off alone.",
                                      "timestamp": "2021-12-16 08:13:12",
                                      "score": -2,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "horqq4z",
                                          "text": ">unprovoked\n\nHe definitely provoked people.",
                                          "timestamp": "2021-12-16 11:56:52",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 205481,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "horr4v4",
      "text": "Whats he going to have to say? Explain the euphoria of shooting libtards while everyone touches themselves?",
      "timestamp": "2021-12-16 12:01:19",
      "score": 1,
      "num_children": 0,
      "author": 408055,
      "replies": []
    },
    {
      "id": "horyg8t",
      "text": "I knew that shit would happen",
      "timestamp": "2021-12-16 13:12:59",
      "score": 1,
      "num_children": 0,
      "author": 191334,
      "replies": []
    },
    {
      "id": "hos3a8q",
      "text": "Turning Point USA is KKK in MAGA hats.",
      "timestamp": "2021-12-16 13:54:07",
      "score": 1,
      "num_children": 0,
      "author": 47500,
      "replies": []
    },
    {
      "id": "hos3czh",
      "text": "Why not.. the right already fell inline with a self confessed serial rapist who doesn't even wait... just grabs them by the pussy, \n\nremember : i moved on her like a bitch but she was married and wouldn't give it up and I wasted an entire afternoon furniture shopping for nothing.\n\nThis is no surprise what so ever.",
      "timestamp": "2021-12-16 13:54:45",
      "score": 1,
      "num_children": 0,
      "author": 26344,
      "replies": []
    },
    {
      "id": "hos5f0f",
      "text": "Only in America can you kill someone in the street and become a celebrity because of it.",
      "timestamp": "2021-12-16 14:11:10",
      "score": 1,
      "num_children": 1,
      "author": 34871,
      "replies": [
        {
          "id": "hostnkb",
          "text": "Well, nazi Germany in the 30s",
          "timestamp": "2021-12-16 16:57:15",
          "score": 1,
          "num_children": 0,
          "author": 202742,
          "replies": []
        }
      ]
    },
    {
      "id": "hp6d23s",
      "text": "Is 1000% going to run for office one day.",
      "timestamp": "2021-12-19 15:31:11",
      "score": 1,
      "num_children": 0,
      "author": 26543,
      "replies": []
    },
    {
      "id": "hoqycf1",
      "text": "People fr over reacting to this Kyle Rittenhouse shit.",
      "timestamp": "2021-12-16 05:58:52",
      "score": -9,
      "num_children": 0,
      "author": 80740,
      "replies": []
    },
    {
      "id": "hoqd7oc",
      "text": "[removed]",
      "timestamp": "2021-12-16 02:58:36",
      "score": -4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hoogym8",
      "text": "Looks like a repost. I've seen this image 1 time.\n\nFirst Seen [Here](https://redd.it/rgyr44) on 2021-12-15 100.0% match.\n\nFeedback? Hate? Visit r/repostsleuthbot - *I'm not perfect, but you can help. Report [ [False Positive](https://www.reddit.com/message/compose/?to=RepostSleuthBot&subject=False%20Positive&message={\"post_id\": \"rh46mq\", \"meme_template\": null}) ]*\n\n[View Search On repostsleuth.com](https://www.repostsleuth.com?postId=rh46mq&sameSub=false&filterOnlyOlder=true&memeFilter=true&filterDeadMatches=false&targetImageMatch=86&targetImageMemeMatch=96)\n\n---\n\n**Scope:** Reddit | **Meme Filter:** False | **Target:** 86% | **Check Title:** False | **Max Age:** Unlimited | **Searched Images:** 275,243,846 | **Search Time:** 0.70804s",
      "timestamp": "2021-12-15 19:04:29",
      "score": -3,
      "num_children": 1,
      "author": 182762,
      "replies": [
        {
          "id": "hopmfg9",
          "text": "Not a repost on this sub tho. Try again",
          "timestamp": "2021-12-15 23:38:42",
          "score": 6,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hosc8qq",
      "text": "Barbara identifies as non binary they/them",
      "timestamp": "2021-12-16 15:01:36",
      "score": 0,
      "num_children": 0,
      "replies": []
    }
  ]
}