{
  "id": "rqxo0v",
  "text": "If it wasn't ever enjoyable...then why did you do it?\n",
  "timestamp": "2021-12-29 03:14:33",
  "score": 604,
  "subreddit": "t5_2zaj2",
  "num_children": 47,
  "author": 304941,
  "replies": [
    {
      "id": "hqe7hzq",
      "text": "\"I enjoy the salary and the benefits, but not actually doing the work.\"\n\nWelcome to having a job.",
      "timestamp": "2021-12-29 10:10:45",
      "score": 166,
      "num_children": 3,
      "author": 23392,
      "replies": [
        {
          "id": "hqfmz9b",
          "text": "Esnackly. Like if she doesn't want to be a prostitute, don't be. Play the lottery or something. \n\nThis literally only applies to women feeling sympathy for having to wagie. Not even getting into the incendiary politics of \"sex work\" which is bullshit in itself but if a man was like \"I hate my job so much. I've contemplated suicide cause of it\" besides the reddit trolls and simps telling him to shut up, at best he might get some genuine concern to anything has gotta be better than what he's doing, or there's no shame in anti-depressants, which are correct. But I'm trying to show the scope of how men bitching about real depression=lame topic, women complaining about they can't go to spas and shit=injustice. Like sad dog commercial IN THE ARMS OF AN ANGEL injustice.",
          "timestamp": "2021-12-29 17:40:26",
          "score": 32,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hqfp1j1",
          "text": "Exactly. But feminists think that doing the work is rape. Of course, this applies to women only. Men can be forced to do anything (dangerous labour, war, child support, alimony etc. ). However, women are still most affected.",
          "timestamp": "2021-12-29 17:53:29",
          "score": 21,
          "num_children": 0,
          "author": 350249,
          "replies": []
        },
        {
          "id": "hqfytyt",
          "text": "Good point lmao",
          "timestamp": "2021-12-29 18:56:06",
          "score": 6,
          "num_children": 0,
          "author": 311512,
          "replies": []
        }
      ]
    },
    {
      "id": "hqe8eov",
      "text": "I think the worst thing the feminists trying to do is  convincing the world that \"sex workers are r*pe victims\" 🤷🏻‍♀️",
      "timestamp": "2021-12-29 10:22:54",
      "score": 71,
      "num_children": 3,
      "author": 40571,
      "replies": [
        {
          "id": "hqev3e6",
          "text": "But wait I thought it was empowering to be a sex worker",
          "timestamp": "2021-12-29 14:27:50",
          "score": 33,
          "num_children": 1,
          "author": 312365,
          "replies": [
            {
              "id": "hqeyezx",
              "text": "Only when it's convenient for them.",
              "timestamp": "2021-12-29 14:53:46",
              "score": 36,
              "num_children": 1,
              "author": 270078,
              "replies": [
                {
                  "id": "hqg3s2x",
                  "text": "Wait until they realise that probably the largest clientele of sex workers are pretty much men.",
                  "timestamp": "2021-12-29 19:28:04",
                  "score": 9,
                  "num_children": 0,
                  "author": 32600,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hqf3g0u",
          "text": "Between this and the idea that men in dresses are women, it's a bad time for actual women.",
          "timestamp": "2021-12-29 15:30:55",
          "score": 6,
          "num_children": 2,
          "replies": [
            {
              "id": "hqgvl6f",
              "text": "Unless you are part of the feminist elite, that means you get paid for spreading BS, or a rich woman from instagram.\n\nFeminism affects women with skin in the game go figure",
              "timestamp": "2021-12-29 22:27:57",
              "score": 4,
              "num_children": 0,
              "author": 160933,
              "replies": []
            },
            {
              "id": "hqg46p8",
              "text": "Men in dresses are not women, but if there is a soul distinct from the body, I could easily fathom that someone born in a man's body is truly feminine at heart. This does not affect women, except that the woman born in a man's body (transgender women) honestly would give their balls up to get fucked, and it sort of illustrates by comparison that feminists would rather be angry about sex rather than enjoying it.",
              "timestamp": "2021-12-29 19:30:43",
              "score": 8,
              "num_children": 1,
              "author": 400947,
              "replies": [
                {
                  "id": "hqgafgs",
                  "text": "[deleted]",
                  "timestamp": "2021-12-29 20:10:59",
                  "score": 8,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hqgb172",
                      "text": "To be fair, they do get bent 🤣",
                      "timestamp": "2021-12-29 20:14:53",
                      "score": 3,
                      "num_children": 0,
                      "author": 400947,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hqgdg9b",
          "text": "This is exactly what stood out to me as well.",
          "timestamp": "2021-12-29 20:30:30",
          "score": 1,
          "num_children": 0,
          "author": 262336,
          "replies": []
        }
      ]
    },
    {
      "id": "hqd4gvt",
      "text": "Rule 1 of human psychology, people are motivated by self-interest. Everything people choose to do benefits them in some way. Feminists are just retarded.",
      "timestamp": "2021-12-29 03:15:16",
      "score": 186,
      "num_children": 2,
      "author": 304941,
      "replies": [
        {
          "id": "hqdxo3v",
          "text": "Including all the pornstars. Suddenly its men taking advantage when you could have said no to that money and fame.\n\nNot defending the industry is scum it is and probably mistreated them. But they werent under a gun to say yes.\n\nEdit: IIRC Mia Khalifa is against porn but still has an onlyfans account lmao i mean the mental gymnastics are real",
          "timestamp": "2021-12-29 07:59:42",
          "score": 77,
          "num_children": 1,
          "replies": [
            {
              "id": "hqeiq0n",
              "text": "i wont lie, if i was a woman and could sit at home in my bed and take some nude shots after a shower and bank 5 digits a week... i mean shit.   i'm only human.",
              "timestamp": "2021-12-29 12:32:09",
              "score": 29,
              "num_children": 3,
              "author": 398064,
              "replies": [
                {
                  "id": "hqeuvqb",
                  "text": "Same even 4 or high 3 digits would do me",
                  "timestamp": "2021-12-29 14:26:08",
                  "score": 10,
                  "num_children": 0,
                  "author": 312365,
                  "replies": []
                },
                {
                  "id": "hqf6v7n",
                  "text": "As a dude I've considered only fans to sell feet pics. Like even I get only 20 bucks a month that's free money compared to other porn stars posting full body shots.\n\nIssue is I have the feet of a gargoyle and would need some miracle pedicures to fix my nails",
                  "timestamp": "2021-12-29 15:55:01",
                  "score": 8,
                  "num_children": 1,
                  "author": 316486,
                  "replies": [
                    {
                      "id": "hqgosa9",
                      "text": ">Issue is I have the feet of a gargoyle and would need some miracle pedicures to fix my nails\n\nYou never know, there could be a niche audience, play it up with grey paint.",
                      "timestamp": "2021-12-29 21:43:06",
                      "score": 3,
                      "num_children": 1,
                      "author": 383824,
                      "replies": [
                        {
                          "id": "hqgpvb7",
                          "text": "Mix in some food play with Bugles chops and give each toe a little chip claw!\n\nFuck it I may actually do this",
                          "timestamp": "2021-12-29 21:50:11",
                          "score": 2,
                          "num_children": 0,
                          "author": 316486,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hqf3msc",
                  "text": "If you have any sort of self conscious then you’d immediately know the major consequences that will lead to it in the future.",
                  "timestamp": "2021-12-29 15:32:15",
                  "score": 11,
                  "num_children": 0,
                  "author": 205989,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hqg3j9c",
          "text": "Truuuu. It benefit me greatly to not starve to death.",
          "timestamp": "2021-12-29 19:26:27",
          "score": 0,
          "num_children": 0,
          "author": 244915,
          "replies": []
        }
      ]
    },
    {
      "id": "hqde3y2",
      "text": "Woooah, must be traumatizing to consent to sex.",
      "timestamp": "2021-12-29 04:34:17",
      "score": 105,
      "num_children": 1,
      "author": 288118,
      "replies": [
        {
          "id": "hqehx86",
          "text": "Agency and accountability are scarier to them",
          "timestamp": "2021-12-29 12:23:04",
          "score": 23,
          "num_children": 1,
          "author": 389946,
          "replies": [
            {
              "id": "hqh32de",
              "text": "Right??? 😂 Oh, the humanity…",
              "timestamp": "2021-12-29 23:18:42",
              "score": 2,
              "num_children": 0,
              "author": 288118,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hqd7mz2",
      "text": "🤦‍♂️",
      "timestamp": "2021-12-29 03:40:32",
      "score": 38,
      "num_children": 1,
      "replies": [
        {
          "id": "hqeb1s9",
          "text": "🤦‍♂️",
          "timestamp": "2021-12-29 10:58:00",
          "score": 17,
          "num_children": 1,
          "author": 289393,
          "replies": [
            {
              "id": "hqedzr5",
              "text": "🤦🏻‍♂️",
              "timestamp": "2021-12-29 11:35:26",
              "score": 15,
              "num_children": 1,
              "author": 25769,
              "replies": [
                {
                  "id": "hqf8oky",
                  "text": "🤦‍♀️",
                  "timestamp": "2021-12-29 16:07:30",
                  "score": 6,
                  "num_children": 0,
                  "author": 130219,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hqdzzfw",
      "text": "I've suffered the trauma of bodily abuse myself... my boss giving me a paycheck every month, and a christmas bonus too, giving me health insurance, and a paid vacation. I never enjoyed it, because I knew what he wanted all along... to use my body... to do work...",
      "timestamp": "2021-12-29 08:30:08",
      "score": 39,
      "num_children": 1,
      "author": 412238,
      "replies": [
        {
          "id": "hqg4m8c",
          "text": ">ut the TV is big enough and high enough that people's heads don't pass in front of it.  \n>  \n>I'm watching the screen and 5° be\n\nWell my friend, you gotta do like most feminists do, 30 years after retirement and after getting all those benefits, #MeToo that basterd of a boss!",
          "timestamp": "2021-12-29 19:33:30",
          "score": 7,
          "num_children": 0,
          "author": 32610,
          "replies": []
        }
      ]
    },
    {
      "id": "hqedxgo",
      "text": "Dude females have reached a level of grandiosity that if you look at her without her will ur a rapist LOL",
      "timestamp": "2021-12-29 11:34:40",
      "score": 39,
      "num_children": 2,
      "author": 25769,
      "replies": [
        {
          "id": "hqf3va1",
          "text": "[here ](https://imgur.com/gallery/BiJ9tQ9) you go.",
          "timestamp": "2021-12-29 15:33:54",
          "score": 7,
          "num_children": 3,
          "author": 7839,
          "replies": [
            {
              "id": "hqf7gap",
              "text": "Jesus. So if I zone out in your direction I'm now a criminal? What a mess",
              "timestamp": "2021-12-29 15:59:04",
              "score": 5,
              "num_children": 1,
              "author": 316486,
              "replies": [
                {
                  "id": "hqfy6ba",
                  "text": "I'll never forget the time I was sitting at the bar with my buddy and the game was on the really big screen on my 10:00 position. \n\nRight below the screen is a high traffic area that goes between the main bar and the pool room. But the TV is big enough and high enough that people's heads don't pass in front of it. \n\nI'm watching the screen and 5° below that I just see someone's eyes connect with mine and as I slightly lower my eyes to see what I thought I saw there was this girl who wasn't even that attractive who got this look of disgust on her face like she had just been ogled by I don't know.... Ted Bundy or something. \n\nI looked away and turned forward because for a moment there I was actually afraid of the trouble that might come. I really really regret that action. \n\nWhenever this thought pops into my head I wish I just would have started smirking and then done that thing where you point two fingers at your eyes and then point one above her head to the big TV. Of course that might not have embarrassed her and even if it did that would turn into the feeling of rejection for her which can be even more dangerous than just being caught looking. \n\nAt least when you caught looking you didn't reject them they get to reject you. But if you signal \"ha, no sweetheart I was watching the game. I pay more attention to that than you\" some of them will f****** kill you... Well they won't..  they'll get some betasimp proxy agent to do it for them.",
                  "timestamp": "2021-12-29 18:51:53",
                  "score": 6,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "hqg9yv5",
                      "text": "[deleted]",
                      "timestamp": "2021-12-29 20:07:59",
                      "score": 2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hqgqeev",
                          "text": "You've got a really great point. I mean sorry about your troubles but yeah these women now are kicking in doors and inciting mobs against people and you're not allowed to do anything to retaliate. I was just in the initial stages with a neighbor girl last summer, she's 21...I was 45. Her mother used to live in the building but hasn't for a year. And then she found out that me and her daughter were building a flower garden together and that we were going to have a mutual birthday party.\n\nHer mother who doesn't have a car arranged a ride came to my apartment and started kicking the door down and I had to call 911 and then when the police showed up she played the whole I'm just a girl I just wanted to talk to him b*******. \n\nAnd then was showing up almost every day for weeks screaming and yelling and inciting the neighbors who were all f***** up meth head losers so they all joined in and I ended up getting thrown out of the building by police and arrested for harassment when it was them that was harassing me.\n\nWe haven't had our day in court yet. The crown attorney offered me what is called a peace Bond which is basically saying I promise to be good and they'll drop all the charges. But I already lost my apartment and a job over this. Most people would have taken it but then they said that I needed to attend counseling so that I don't reoffend and I drew the line. I told them I'm moving forward with trial.\n\nI have multiple audio recordings of their harassment of me and the girl who tried to rewrite history by saying that I was harassing her for 4 months... I have 4 months worth of Facebook conversations between me and her that were completely normal. \n\nThere are no consequences for these false accusations and even the innocent have to pay a price because the world still protects women and assumes that men are predators. \n\nThere will never be equality as long as this continues which means there will never be equality because women like the power and privilege to be able to make accusations like this without any consequences because women hate accountability. Women are children.",
                          "timestamp": "2021-12-29 21:53:38",
                          "score": 2,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hqgj8zy",
                      "text": "This is the problem bro , we gotta start working on it by ourselves .. like who tf are women to be that paranoid ? We shall look where we please and may anyone who disagrees go to deep fuckn hell !! Like does it even matter what she thinks ? Do what you please as long as you know U doin' well",
                      "timestamp": "2021-12-29 21:07:35",
                      "score": 1,
                      "num_children": 0,
                      "author": 25769,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hqfjezu",
              "text": "Fuck this gay earth.",
              "timestamp": "2021-12-29 17:17:45",
              "score": 7,
              "num_children": 0,
              "author": 272884,
              "replies": []
            },
            {
              "id": "hqgdjse",
              "text": "This is just dumb.",
              "timestamp": "2021-12-29 20:31:10",
              "score": 1,
              "num_children": 0,
              "author": 262336,
              "replies": []
            }
          ]
        },
        {
          "id": "hqetbo5",
          "text": "Take a look at this PSA (it's still true after all these years)\n\n&#x200B;\n\n[https://www.youtube.com/watch?v=PxuUkYiaUc8](https://www.youtube.com/watch?v=PxuUkYiaUc8)",
          "timestamp": "2021-12-29 14:13:28",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hqdn33w",
      "text": "Tell that to the prostitutes who will never eat at the fanciest restaurants or stay at luxurious hotels...",
      "timestamp": "2021-12-29 05:57:06",
      "score": 46,
      "num_children": 0,
      "author": 267097,
      "replies": []
    },
    {
      "id": "hqd7qu0",
      "text": "No b*1tch, you can't have it both ways",
      "timestamp": "2021-12-29 03:41:23",
      "score": 58,
      "num_children": 1,
      "author": 215939,
      "replies": [
        {
          "id": "hqeh4mp",
          "text": "that would cost extra.",
          "timestamp": "2021-12-29 12:13:52",
          "score": 14,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hqdujl4",
      "text": "Perfect example of a woman who sexualizes and demoralizes herself when it’s beneficial to her but then turns around blaming men for it when it’s not anymore. Smh",
      "timestamp": "2021-12-29 07:20:16",
      "score": 40,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqe4atl",
      "text": "It's shocking to find out that you have sex in sex work",
      "timestamp": "2021-12-29 09:27:33",
      "score": 22,
      "num_children": 0,
      "author": 352829,
      "replies": []
    },
    {
      "id": "hqd8qf7",
      "text": "Because this retard has no other purpose",
      "timestamp": "2021-12-29 03:49:18",
      "score": 40,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqduqq6",
      "text": "“Society makes women be sexualized” meanwhile women are literally boasting about “making a living” from  online and in person prostitution like they don’t have friends or families that can see them degraded for $20 sub.",
      "timestamp": "2021-12-29 07:22:38",
      "score": 25,
      "num_children": 2,
      "replies": [
        {
          "id": "hqe1ps9",
          "text": "The reverse process is true as well, but the staple of feminism is that only one sex can FEEL exploited or whatever...",
          "timestamp": "2021-12-29 08:52:55",
          "score": 8,
          "num_children": 0,
          "author": 394886,
          "replies": []
        },
        {
          "id": "hqfjyuk",
          "text": "No one is being degraded for 20 dollars a sub. The sub is an entry fee only (whores will tell you it's equivalent to your entry to a strip club) and you're expected to pay 20 dollars for 15 seconds of video.",
          "timestamp": "2021-12-29 17:21:16",
          "score": 0,
          "num_children": 0,
          "author": 272884,
          "replies": []
        }
      ]
    },
    {
      "id": "hqee2qf",
      "text": "Beta simps : omg that requires a felony right now they don't have the right to fuck you",
      "timestamp": "2021-12-29 11:36:28",
      "score": 4,
      "num_children": 0,
      "author": 25769,
      "replies": []
    },
    {
      "id": "hqemx4z",
      "text": "Rape? What an idiot.",
      "timestamp": "2021-12-29 13:16:02",
      "score": 6,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqfic7r",
      "text": "I got banned on r/MensRights for posting that, as the moderators told me I was encouraging prostitution and the mistreatment of women by men.\n\nTheir argument was that most women don't choose to be a prostitute and are forced or coerced into it.\n\nI then told them that this particular woman had a brothel and was the one handling prostitutes and she was not forced or coerced in any way, she even made a fortune of it.  \nI was banned and muted for god knows how long.",
      "timestamp": "2021-12-29 17:10:51",
      "score": 6,
      "num_children": 2,
      "author": 156299,
      "replies": [
        {
          "id": "hqhtpu3",
          "text": "LOL that's insane",
          "timestamp": "2021-12-30 02:31:20",
          "score": 2,
          "num_children": 0,
          "author": 304941,
          "replies": []
        },
        {
          "id": "hqfkket",
          "text": "\n>most women don't choose to be a prostitute and are forced or coerced into it.\n\nSex negative feminists consider all sex work to be trafficking. Not surprised the jannies of MensRights are feminists.",
          "timestamp": "2021-12-29 17:25:02",
          "score": 2,
          "num_children": 1,
          "author": 272884,
          "replies": [
            {
              "id": "hqfmekn",
              "text": "I was honestly surprised by MensRights moderators, they seem to be more on the feminazi side than the men's rights activists, which is ironic considering the thread they moderate.",
              "timestamp": "2021-12-29 17:36:44",
              "score": 3,
              "num_children": 1,
              "author": 156299,
              "replies": [
                {
                  "id": "hqfqv11",
                  "text": "They would be targeted by other mods if they didn't fall in line with the narrative. Or they've likely been slowly overrun with interlopers. Given this is reddit after all I'm sure they've got women or trans on their team too.",
                  "timestamp": "2021-12-29 18:05:12",
                  "score": 2,
                  "num_children": 0,
                  "author": 272884,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hqenqrj",
      "text": "No, you didn't \"had to\", you chose to.",
      "timestamp": "2021-12-29 13:23:58",
      "score": 3,
      "num_children": 0,
      "author": 64753,
      "replies": []
    },
    {
      "id": "hqdx6m5",
      "text": "Just say things that are the way you want them to be while dodging all responsibility and consequences, and get people to join your team…\n\nSounds good to me /s",
      "timestamp": "2021-12-29 07:53:15",
      "score": 7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqe45u1",
      "text": "Andrea wants all the benefits of being a prostitute but she can't accept she IS a prostitute. That's why she needs a story to make it acceptable for her twisted little mind. Prostitution is a contract: someone pays to use the other part's body. There is no rape involved if both parts agree to it.",
      "timestamp": "2021-12-29 09:25:37",
      "score": 11,
      "num_children": 1,
      "author": 67617,
      "replies": [
        {
          "id": "hqeu2di",
          "text": "Exactly, this is why I find people need a better definition for r*pe.  It’s very clear the language is being abused for the purpose of calling everything non-consensual, even after someone accepts money and goes to luxurious hotels and the fanciest restaurants…while taking extensive trips, it’s somehow possible for them to think they aren’t consenting to the work that they are being paid for, while accepting every benefit of it for days on end and never seeking to leave that situation.  If it weren’t consensual then why didn’t she simply leave?  Is she claiming she was FORCED to go on trips and stay at luxury hotels and eat at fancy restaurants?!",
          "timestamp": "2021-12-29 14:19:36",
          "score": 3,
          "num_children": 1,
          "author": 80317,
          "replies": [
            {
              "id": "hqexxcp",
              "text": "I think the legal definition of rape is very clear. However, there is a constant attempt to change the meaning of words in order to serve the narrative pushed forward by certain activists, in their attempt to normalise things that were unacceptable in the past.\n\nWhat she does here is trying to sort her cognitive dissonance so she can get back to a comfort zone. At the moment she is disgusted with the fact that she needs to sell her body voluntarily, and by calling it rape she justifies it by implying she doesn't agree but she is forced to do it. So she is still a strong independent woman oppressed by the patriarchy, not a cheap prostitute.",
              "timestamp": "2021-12-29 14:50:03",
              "score": 2,
              "num_children": 0,
              "author": 67617,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hqe31tz",
      "text": "When I was selling my time, my company would send me on trips. Twelve-hour-long flights, staying at hotels, visiting clients.\nNot a moment of that was enjoyable because I knew what came after that. 10 to 12 hours working day. I let them rape my spirit for money /s",
      "timestamp": "2021-12-29 09:10:30",
      "score": 5,
      "num_children": 0,
      "author": 130927,
      "replies": []
    },
    {
      "id": "hqe5k3w",
      "text": "she wants luxury hotels and eating and fanciest restaurants, shopping, and spa treatments for free.",
      "timestamp": "2021-12-29 09:44:37",
      "score": 5,
      "num_children": 0,
      "author": 207849,
      "replies": []
    },
    {
      "id": "hqeimj4",
      "text": "consensual rape.  its a thing, because of course it is.",
      "timestamp": "2021-12-29 12:31:04",
      "score": 5,
      "num_children": 1,
      "author": 398064,
      "replies": [
        {
          "id": "hqevfzq",
          "text": "Oh CNC sex is a different thing all together this just some retarded shit",
          "timestamp": "2021-12-29 14:30:36",
          "score": 2,
          "num_children": 0,
          "author": 312365,
          "replies": []
        }
      ]
    },
    {
      "id": "hqe5lwq",
      "text": "\"LET them\" - how is that against consent I wonder.",
      "timestamp": "2021-12-29 09:45:17",
      "score": 3,
      "num_children": 0,
      "author": 155384,
      "replies": []
    },
    {
      "id": "hqeywfz",
      "text": "rape is when you are forced to have sex, no? then why are you selling your body? it's like selling a tv and saying they stole your tv when someone buys it, it's crazy",
      "timestamp": "2021-12-29 14:57:29",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqf3vo8",
      "text": "We all have some form of dilusion.  Amongst attractive women it is that they deserve the attention they get based on their attractiveness, and that it will not go away when they begin to lose their attractiveness. \n\nWhen they begin to realize this, they get frustrated, it's natural.\n\nAdding to the frustration is that they believed that women were in it together (Go Sista!), but then they realize that a younger hotter woman is willing to do at least what they are willing to do to steal away their sugar daddy and they're shocked!",
      "timestamp": "2021-12-29 15:33:59",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqflmjj",
      "text": "She chose to sell sex for a high profit, but the sex was forced?",
      "timestamp": "2021-12-29 17:31:46",
      "score": 2,
      "num_children": 0,
      "author": 157316,
      "replies": []
    },
    {
      "id": "hqg31xe",
      "text": "I think sex workers in general would agree that a person with this mindset should not be in this line of work.",
      "timestamp": "2021-12-29 19:23:23",
      "score": 2,
      "num_children": 0,
      "author": 32600,
      "replies": []
    },
    {
      "id": "hqe1l3n",
      "text": "If she did not enjoy any sex and feels abused, maybe it's time to return the money men spent on her?",
      "timestamp": "2021-12-29 08:51:15",
      "score": 5,
      "num_children": 0,
      "author": 394886,
      "replies": []
    },
    {
      "id": "hqe2hep",
      "text": "[deleted]",
      "timestamp": "2021-12-29 09:03:03",
      "score": 4,
      "num_children": 1,
      "replies": [
        {
          "id": "hqettrq",
          "text": "that would be $10 bucks... $20 if you want to use both holes...",
          "timestamp": "2021-12-29 14:17:39",
          "score": 0,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hqdxlrf",
      "text": "“Former brothel owner”",
      "timestamp": "2021-12-29 07:58:49",
      "score": 3,
      "num_children": 1,
      "author": 43787,
      "replies": [
        {
          "id": "hqevlri",
          "text": "You mean brothel",
          "timestamp": "2021-12-29 14:31:55",
          "score": 1,
          "num_children": 1,
          "author": 312365,
          "replies": [
            {
              "id": "hqh9pwz",
              "text": "Yeah, autocorrect",
              "timestamp": "2021-12-30 00:05:17",
              "score": 1,
              "num_children": 0,
              "author": 43787,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hqg3zzs",
      "text": "If she was selling it wasn't rape.",
      "timestamp": "2021-12-29 19:29:29",
      "score": 3,
      "num_children": 1,
      "author": 332264,
      "replies": [
        {
          "id": "hqhiqsw",
          "text": "Exactly, I can't just become a male porn star then cry on Twitter about all my shoots being rape, its a job I chose lmfao.",
          "timestamp": "2021-12-30 01:10:15",
          "score": 2,
          "num_children": 0,
          "author": 81064,
          "replies": []
        }
      ]
    },
    {
      "id": "hqfatpg",
      "text": "Then... stop being a prostitute... and it isn’t rape when... you literally give consent with payment",
      "timestamp": "2021-12-29 16:21:58",
      "score": 1,
      "num_children": 1,
      "author": 328102,
      "replies": [
        {
          "id": "hqg4j75",
          "text": "Let me guess, the 14 year old factory workers in Bangladesh should just find a different job?",
          "timestamp": "2021-12-29 19:32:58",
          "score": -1,
          "num_children": 2,
          "author": 244915,
          "replies": [
            {
              "id": "hqg9key",
              "text": "[deleted]",
              "timestamp": "2021-12-29 20:05:24",
              "score": 2,
              "num_children": 1,
              "replies": [
                {
                  "id": "hqgauew",
                  "text": "The guys currently working in the factory could just become prostitutes if their job at the factory is so dangerous an terrible.",
                  "timestamp": "2021-12-29 20:13:40",
                  "score": -1,
                  "num_children": 1,
                  "author": 244915,
                  "replies": [
                    {
                      "id": "hqgbha2",
                      "text": "[deleted]",
                      "timestamp": "2021-12-29 20:17:46",
                      "score": 2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hqgdptj",
                          "text": "Nice! 2 whole options!",
                          "timestamp": "2021-12-29 20:32:15",
                          "score": -1,
                          "num_children": 0,
                          "author": 244915,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hqgkwl3",
              "text": "Honey, 14 year old kids from Bangladesh In Factories has nothing to do with this",
              "timestamp": "2021-12-29 21:18:20",
              "score": 0,
              "num_children": 1,
              "author": 328102,
              "replies": [
                {
                  "id": "hqgm7ra",
                  "text": "“Then... stop being a factory worker... and it isn’t coercion when... you literally give consent with payment”",
                  "timestamp": "2021-12-29 21:26:36",
                  "score": 1,
                  "num_children": 1,
                  "author": 244915,
                  "replies": [
                    {
                      "id": "hqgoa3v",
                      "text": "Not the same",
                      "timestamp": "2021-12-29 21:39:49",
                      "score": 1,
                      "num_children": 1,
                      "author": 328102,
                      "replies": [
                        {
                          "id": "hqj3l4k",
                          "text": "How?",
                          "timestamp": "2021-12-30 10:07:19",
                          "score": 0,
                          "num_children": 0,
                          "author": 244915,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hqg8yfn",
      "text": "You fuckers: Well, it’s not *legally* rape, as the definition of rape is forceful intercourse, and she isn’t technically being forced.\n\nAlso you fuckers: DIVOOOOORCE RAAAAAPE.",
      "timestamp": "2021-12-29 20:01:30",
      "score": 0,
      "num_children": 2,
      "author": 244915,
      "replies": [
        {
          "id": "hqgacla",
          "text": "What?",
          "timestamp": "2021-12-29 20:10:28",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "hqgb148",
              "text": "I’m doing an epic own.",
              "timestamp": "2021-12-29 20:14:52",
              "score": -1,
              "num_children": 0,
              "author": 244915,
              "replies": []
            }
          ]
        },
        {
          "id": "hqhthrj",
          "text": "I don't understand. You can read her story. Her literal career was that of a prostitute. She traded sex for money because by 22 she had gotten herself into a lot of debt.\n\nHow is it rape when you enter into a contractual agreement with another person, they meet their end of the bargain and then it's your turn to meet yours?\n\nHow are you \"owning us\" with this logic?",
          "timestamp": "2021-12-30 02:29:39",
          "score": 2,
          "num_children": 1,
          "author": 304941,
          "replies": [
            {
              "id": "hqj45oj",
              "text": "You can easily make the argument that economic pressure is a form of coercion, even if no one is physically forcing you to be a prostitute. In the same way Bangladeshi child workers aren’t working in dangerous factories voluntarily even though they aren’t technically being forced to work there.",
              "timestamp": "2021-12-30 10:14:47",
              "score": 0,
              "num_children": 2,
              "author": 244915,
              "replies": [
                {
                  "id": "hqj4sxm",
                  "text": "And yet Feminism as a whole, in the mainstream, including the vast, vast majority of modern Feminists, are pro sex-work or \"sex-positive\" as they like to call it.\n\nSo given that this is the Anti-Feminism subreddit, I don't see the contradiction at all.",
                  "timestamp": "2021-12-30 10:23:10",
                  "score": 2,
                  "num_children": 1,
                  "author": 304941,
                  "replies": [
                    {
                      "id": "hqjwdnv",
                      "text": "I can’t see why you can’t hold both positions. Sex work should be legal (though heavily regulated) to make it safer, and the workers and their work should be respected. At the same time, it’s tragic that some people are driven to do something their body interprets as rape out of desperation, and we should do what we can to avoid putting people in that situation.\n\nAlso, sex-negative self proclaimed feminists are not that rare. The entirety of FDS is anti-sex work, and they seem to be called feminists in your book.",
                      "timestamp": "2021-12-30 15:02:32",
                      "score": 0,
                      "num_children": 2,
                      "author": 244915,
                      "replies": [
                        {
                          "id": "hqk496a",
                          "text": ">I can’t see why you can’t hold both positions. Sex work should be legal (though heavily regulated) to make it safer, and the workers and their work should be respected. At the same time, it’s tragic that some people are driven to do something their body interprets as rape out of desperation, and we should do what we can to avoid putting people in that situation.\n\nI don't disagree with you on any point. But you do realize that this woman in the picture, Andrea Heinz, joined the sex industry because she had gotten herself into a lot of debt by 22 due to bad life choices and then made millions of dollars doing it, and then opened up a brothel for other women during the last 4 years of her career. So if she was being raped for her entire experience, I highly doubt she would have opened a brothel for other women to get raped too.\n\nThis is what we're making fun of. A transactional relationship that you agree to is not rape, especially if you consented to it.\n\nShe by the way is completely sex-negative, and believes that all sex work is bad for women, even heavily regulated.\n\n>Also, sex-negative self proclaimed feminists are not that rare. The entirety of FDS is anti-sex work, and they seem to be called feminists in your book.\n\nFDS is a group of extremists and is the most hated sub on reddit. Most Feminists would not identify those women among themselves. We call them Feminists because that's what they call themselves.",
                          "timestamp": "2021-12-30 15:58:20",
                          "score": 2,
                          "num_children": 0,
                          "author": 304941,
                          "replies": []
                        },
                        {
                          "id": "hrhzlb1",
                          "text": "FDS is also anti-men and they seek to actively ruin male lives. They claim to be feminists but they also support female serial killers and false accusations.",
                          "timestamp": "2022-01-06 15:12:48",
                          "score": 1,
                          "num_children": 1,
                          "author": 21337,
                          "replies": [
                            {
                              "id": "hri7462",
                              "text": "Yeah, they are terrible people all around. Incredibly racist and homophobic too.",
                              "timestamp": "2022-01-06 16:01:21",
                              "score": 1,
                              "num_children": 0,
                              "author": 244915,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hqvkc8e",
                  "text": "so someone who's going to work to pay his/her bills is raped ? because he/she doesn't want to work but has to to pay the bills ?",
                  "timestamp": "2022-01-02 01:10:07",
                  "score": 1,
                  "num_children": 1,
                  "author": 233717,
                  "replies": [
                    {
                      "id": "hqwx929",
                      "text": "It’s not rape, as rape involves coercive *sex*. But yes, it is coercive. Obviously, some forms of coercion are worse than others; forcing a child to eat broccoli is less bad than forcing a child to eat poop, even if both are technically coercive.",
                      "timestamp": "2022-01-02 08:29:07",
                      "score": 1,
                      "num_children": 1,
                      "author": 244915,
                      "replies": [
                        {
                          "id": "hqx9b04",
                          "text": "The main post is not rape, not coercive sex since the customer didn’t forced her of anything he paid for a service, the reason why she’s doing it (having ton of debt) is not of his concern. \n\nYou understand that if everything is a form a coercion then something is wrong about your argument. You’re trying to stay coherent by saying « yes but some form of coercion are just worse than other » but that doesn’t change the fact that your argument is ridicule. There’s something called responsibility, I know you women don’t like it \n\nshe has the responsibility to pay for all her irresponsable debt, nobody forced her to have debt. how she’s paying back is not of the debt issuer concern because she’s an adult \n\nThe reason why she’s doing prostitution is not the concern of her customers, they are just paying for a service.",
                          "timestamp": "2022-01-02 11:14:45",
                          "score": 1,
                          "num_children": 1,
                          "author": 233717,
                          "replies": [
                            {
                              "id": "hqzcdds",
                              "text": "Have you ever heard the legendary Coconut Island Analogy? Goes like this:\n\n> Let's say that you are on a plane, and that plane crash lands on an island, okay? There are only a few survivors. In fact, there are only two. And you wake up after the first one does. By the time that you have woken up, the other survivor in this plane has claimed all of the coconuts on all of the coconut trees, stacked them on their piles, sheltered that pile from all the wreckage from the plane, declared they own it, and they say that they would be willing to give you said coconuts if you throat their cock. Now would you consider that to be a voluntary interaction?",
                              "timestamp": "2022-01-02 20:50:00",
                              "score": 1,
                              "num_children": 0,
                              "author": 244915,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hqfa750",
      "text": "Imagine working voluntarily as a sex worker and calling it rape....",
      "timestamp": "2021-12-29 16:17:49",
      "score": 1,
      "num_children": 0,
      "author": 281962,
      "replies": []
    },
    {
      "id": "hqfakhv",
      "text": "You know I watched Monster yesterday lol...... \n\nSomeone help me discover the differences...... Aileen Wuernos was a prostitute too... Actually - \n\nProstitute or escort...❓",
      "timestamp": "2021-12-29 16:20:17",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqfpqzb",
      "text": "U “letting” them do something to ur body is consensual. Therefore it’s not rape cause you “let” them do it. I just wish an anomaly happens and all men disappear leaving this planet to women and see how they handle it. I’m tired of them.",
      "timestamp": "2021-12-29 17:58:01",
      "score": 1,
      "num_children": 0,
      "author": 344389,
      "replies": []
    },
    {
      "id": "hqg56o5",
      "text": "I don't know if they are really dumb or they think we are dumb",
      "timestamp": "2021-12-29 19:37:11",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqg68cw",
      "text": "Funny how they can twist up the definitions of just about everything: rape, sexism, patriarch etc, and then turn around and not expect anyone to snicker whenever they try to give you the text book definition of feminism to justify their hypocrisy. I hope all those men who bothered to sleep with her still have their receipts. She's clearly run out of all the money they gave her before 'the wall' halted her operations.",
      "timestamp": "2021-12-29 19:43:58",
      "score": 1,
      "num_children": 0,
      "author": 32610,
      "replies": []
    },
    {
      "id": "hqgwwyd",
      "text": "If you don’t like being a prostitute, don’t be one.",
      "timestamp": "2021-12-29 22:36:51",
      "score": 1,
      "num_children": 0,
      "author": 406881,
      "replies": []
    },
    {
      "id": "hqh2665",
      "text": "An alternative would have been a job at McDonald's.",
      "timestamp": "2021-12-29 23:12:32",
      "score": 1,
      "num_children": 0,
      "author": 122531,
      "replies": []
    },
    {
      "id": "hqkbo5h",
      "text": "It's her option, nobody forced her to do it",
      "timestamp": "2021-12-30 16:47:25",
      "score": 1,
      "num_children": 0,
      "author": 264176,
      "replies": []
    },
    {
      "id": "hr5qon3",
      "text": "Bro then why is she a hooker",
      "timestamp": "2022-01-04 02:22:28",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hs43xeh",
      "text": "I feel bad for those who are sex workers and don't want to be, as they are in a sense, letting other people use their bodies when they don't want to.\n\nBut, there's always a but. You can't call it rape, because you can't let someone rape you. Letting someone have sex with you is consent. Sorry.",
      "timestamp": "2022-01-10 20:54:10",
      "score": 1,
      "num_children": 0,
      "author": 60810,
      "replies": []
    },
    {
      "id": "htgezme",
      "text": "To get money fast",
      "timestamp": "2022-01-20 13:31:21",
      "score": 1,
      "num_children": 0,
      "author": 85084,
      "replies": []
    },
    {
      "id": "huiqs9u",
      "text": "“I let them rape me”\n\nOxymoronic?",
      "timestamp": "2022-01-28 01:11:38",
      "score": 1,
      "num_children": 0,
      "author": 157108,
      "replies": []
    },
    {
      "id": "hqe4a3c",
      "text": "So what is her Onlyfan page again?",
      "timestamp": "2021-12-29 09:27:16",
      "score": -8,
      "num_children": 1,
      "author": 149809,
      "replies": [
        {
          "id": "hqemz38",
          "text": "No.",
          "timestamp": "2021-12-29 13:16:35",
          "score": 8,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hqe47sd",
      "text": "[deleted]",
      "timestamp": "2021-12-29 09:26:22",
      "score": 0,
      "num_children": 1,
      "replies": [
        {
          "id": "hqe48eq",
          "text": ">selling amorous rite\nbecause selling groceries, amenities 'r stationaries is too mainstream.  Plus thee coequal not receiveth to whine about t\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`",
          "timestamp": "2021-12-29 09:26:36",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hqe48wv",
              "text": "Shakespeare-Bot, thou hast been voted most annoying bot on Reddit. I am exhorting all mods to ban thee and thy useless rhetoric so that we shall not be blotted with thy presence any longer.",
              "timestamp": "2021-12-29 09:26:48",
              "score": 2,
              "num_children": 1,
              "author": 198501,
              "replies": [
                {
                  "id": "hqeo8c1",
                  "text": "! Shakespeareinsult",
                  "timestamp": "2021-12-29 13:28:37",
                  "score": 2,
                  "num_children": 0,
                  "author": 329205,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}