{
  "id": "rs7m61",
  "text": "The Qunt from Georgia forgets who won the last \"divorce\"\n",
  "timestamp": "2021-12-30 17:50:31",
  "score": 4276,
  "subreddit": "t5_3fdcn",
  "num_children": 136,
  "author": 57011,
  "replies": [
    {
      "id": "hqklopy",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2021-12-30 17:50:31",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "hqkvpr8",
      "text": "Conservatives like to blame democrats for eroding America's values but are always so quick to talk about divorce whenever the going gets too tough.",
      "timestamp": "2021-12-30 18:53:50",
      "score": 515,
      "num_children": 4,
      "author": 266587,
      "replies": [
        {
          "id": "hqkwqpf",
          "text": "They've decided a long time ago that compromise isn't an option, and it's my opinion that the reason for this is because the right has just become more extreme right over the years.  If they had any idea what \"divorce\" entails, I think a lot of Americans, conservative or otherwise would be very furious at such a stupid stupid remark.  We'd literally be talking about the destruction of America.",
          "timestamp": "2021-12-30 19:00:23",
          "score": 218,
          "num_children": 6,
          "author": 201921,
          "replies": [
            {
              "id": "hqlzawl",
              "text": "They think an America that doesn't think, believe, and worship as they do should be destroyed.  I think none of them ever actually \"got\" the idea of America.",
              "timestamp": "2021-12-30 23:14:14",
              "score": 77,
              "num_children": 2,
              "author": 73519,
              "replies": [
                {
                  "id": "hqmmrkg",
                  "text": "\"America is where MY dreams come true not yours.  Like it or get out!\"",
                  "timestamp": "2021-12-31 02:01:17",
                  "score": 45,
                  "num_children": 1,
                  "author": 406658,
                  "replies": [
                    {
                      "id": "hqnj7zp",
                      "text": "That is exactly right, well said.",
                      "timestamp": "2021-12-31 06:37:39",
                      "score": 15,
                      "num_children": 0,
                      "author": 188763,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hqoyqrp",
                  "text": "Yeah, exactly. Too few people truly understand this, but it's absolutely true. These people really honestly see anyone that's not in their circle as an enemy of the country. Not Christian? That must mean you're a product and supporter of satan. True evil that must b destroyed.\n\nTo these people it is only themselves that matter. Their idea of freedom is control.",
                  "timestamp": "2021-12-31 15:55:55",
                  "score": 3,
                  "num_children": 0,
                  "author": 15807,
                  "replies": []
                }
              ]
            },
            {
              "id": "hqlzo7x",
              "text": "Not to mention that counties that were blue during the 2020 election account for 71% of US GDP",
              "timestamp": "2021-12-30 23:16:45",
              "score": 129,
              "num_children": 6,
              "author": 60491,
              "replies": [
                {
                  "id": "hqmrcr0",
                  "text": "The only red states that run balanced budgets are the oil producing states. The rest rely on the taxes paid by successful blue states. They wouldn't last a year as their own country; highest poverty rates, highest welfare rates, highest crime rates, highest obesity rates, almost none of the nation's great universities (not that they'd care), just... nothing. Blue state gdp per capita would probably go up 20%+ and we wouldn't have any of the GOP senators/congressmen stopping us from catching up on the last 30 years that the rest of the post-industrial world has been leaving us behind in.",
                  "timestamp": "2021-12-31 02:35:52",
                  "score": 52,
                  "num_children": 3,
                  "author": 81370,
                  "replies": [
                    {
                      "id": "hqotep4",
                      "text": "Fuck that sounds so NICE.",
                      "timestamp": "2021-12-31 15:17:02",
                      "score": 11,
                      "num_children": 1,
                      "author": 106296,
                      "replies": [
                        {
                          "id": "hqpfr8h",
                          "text": "I'd feel bad for the normal people stranded in places like Austin or Ashville, but I'm sure we can set up some kind of prisoner exchange situation. They'll want their nutjobs back from eastern Oregon or rural Pennsylvania or wherever.",
                          "timestamp": "2021-12-31 17:51:54",
                          "score": 11,
                          "num_children": 2,
                          "author": 81370,
                          "replies": [
                            {
                              "id": "hqpn4w6",
                              "text": "Yeah, here in Georgia, the Atlanta metro is literally 60% of the population of a 50/50 state. It would be interesting to see how that would go, but if it ever came up for a vote I'm sure they'd use their gerrymandered supermajority (that got less than 50% of the vote) to force Atlanta to go with them.",
                              "timestamp": "2021-12-31 18:42:02",
                              "score": 7,
                              "num_children": 1,
                              "author": 236227,
                              "replies": [
                                {
                                  "id": "hqrmki9",
                                  "text": "Yeah, that blueberry-in-the-tomato soup issue is true throughout the south. I'm not sure where everyone from the southern metros will live in the north, but we'll figure something out - that's one of the benefits of having all of the most intelligent people in the country supporting one party over the other.",
                                  "timestamp": "2022-01-01 03:43:44",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 81370,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hqpg16n",
                              "text": "Like the 1948 partition.",
                              "timestamp": "2021-12-31 17:53:47",
                              "score": 4,
                              "num_children": 0,
                              "author": 106296,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hqpe9ga",
                      "text": "If we do have a national divorce, will blue states accept a liberal refuge from a red state?  Please?",
                      "timestamp": "2021-12-31 17:41:53",
                      "score": 7,
                      "num_children": 2,
                      "author": 238659,
                      "replies": [
                        {
                          "id": "hqpg78m",
                          "text": "Ha, I was just thinking about this in the other response before I saw your. \n\nObviously. One of our two parties has always understood the importance of immigration. And I'm sure the closed-border, safe-space xenophobes will be more than happy let all of their educated workforce leave before they even realize it's a problem.",
                          "timestamp": "2021-12-31 17:54:54",
                          "score": 4,
                          "num_children": 1,
                          "author": 81370,
                          "replies": [
                            {
                              "id": "hqua3z3",
                              "text": "Sounds like Brexit",
                              "timestamp": "2022-01-01 19:42:49",
                              "score": 2,
                              "num_children": 0,
                              "author": 55291,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hqshdsq",
                          "text": "Of course, my brother.",
                          "timestamp": "2022-01-01 09:39:46",
                          "score": 1,
                          "num_children": 0,
                          "author": 141858,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hqqd1co",
                      "text": "They got a lot of football... a lot of college football... that'll mean sumpin...",
                      "timestamp": "2021-12-31 21:44:09",
                      "score": 3,
                      "num_children": 1,
                      "author": 102410,
                      "replies": [
                        {
                          "id": "hqrmqhv",
                          "text": "I'm sure that will comfort them when they are hungry and out of prescription medicines, and can't find any foreign trade partners.",
                          "timestamp": "2022-01-01 03:45:12",
                          "score": 3,
                          "num_children": 0,
                          "author": 81370,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hqm5huc",
                  "text": "Turns out the socialist haters are the biggest socialists of all",
                  "timestamp": "2021-12-30 23:56:38",
                  "score": 82,
                  "num_children": 2,
                  "author": 5930,
                  "replies": [
                    {
                      "id": "hqmen3u",
                      "text": "Can you imagine what it would be like if they did secede? Texas alone makes up the vast majority of the remaining 29%. The state of Texas would have to either subsidize all of those other red states or they very quickly would collapse entirely. The new red-state country would quite literally, have to turn socialist at Texans’ expense or the whole thing would collapse by the end of year 1",
                      "timestamp": "2021-12-31 01:00:40",
                      "score": 81,
                      "num_children": 1,
                      "author": 60491,
                      "replies": [
                        {
                          "id": "hqn4ew3",
                          "text": "With the grifter-hacks we have running Texas, the South would be fucked instantly.  Texas is already deteriorating, and not slowly.",
                          "timestamp": "2021-12-31 04:19:26",
                          "score": 31,
                          "num_children": 1,
                          "author": 142250,
                          "replies": [
                            {
                              "id": "hqnkfu3",
                              "text": "Considering all this, I wonder if it would be better to separate without a civil war.  Just...just let them have a part of the world (another planet would be better but not possible atm), preferably on their own island for them to fuck over as hard as they want.  Let them reap what they truly wish to sow.  Let them try their white Christian theocratic-ethnostate and pollute and destroy all they want and just leave the rest of us alone.  Have their own coviddom.  Honestly I think they might be happier.",
                              "timestamp": "2021-12-31 06:50:51",
                              "score": 23,
                              "num_children": 3,
                              "author": 123189,
                              "replies": [
                                {
                                  "id": "hqnxafb",
                                  "text": "Sometimes I honestly think this is the correct answer lmao",
                                  "timestamp": "2021-12-31 09:31:13",
                                  "score": 14,
                                  "num_children": 1,
                                  "author": 354636,
                                  "replies": [
                                    {
                                      "id": "hqrff68",
                                      "text": "it *happened* and its called novorossiya\n\n* yanukovich used to have 42-43 support\n* part of his fans created this thing  *(wheret they could deny the holod0mo and repress gays)*\n* now the rest of ukraine hass less crazies\n* even the south + east are now competitive   */ the hillibillies has their novorossiya*\n* translated.. hillibillies goes to florida  and tx-nc-az-ga  turns   relatively blue \n\n*redpills*\n\n* *ukraine actually likes this  (reintegrartin = give the hillibillies veto power  or putinistshaving SOLID states + being competitive at nationwide elections) .... so let them enjoy this thing*\n* *putin felt in his own trap (he cant disown novorossiya + he ha to feed them - EVEN when the hillibillies would make far more harm if they reintegrate + uuse veto-powers)*\n\nhaving a blood-free novorosiya  (ok  take florida + make all that u want there)  would   give the same benefits",
                                      "timestamp": "2022-01-01 02:42:37",
                                      "score": 3,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "hqo3jwf",
                                  "text": "If The Handmaid's Tale taught us anything, it's that you don't want a Gilead next door, let alone having to live in one.",
                                  "timestamp": "2021-12-31 10:56:27",
                                  "score": 8,
                                  "num_children": 0,
                                  "author": 341668,
                                  "replies": []
                                },
                                {
                                  "id": "hqp2uj1",
                                  "text": "They can have Epsteins Island, him and his side kick can't use it anymore.",
                                  "timestamp": "2021-12-31 16:24:43",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 328683,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hqmwkvf",
                      "text": "dude, every fucking dogshit stupid anti masker talking about how stores are public places and this non existent \"right\" to shop have really been confusing me.",
                      "timestamp": "2021-12-31 03:16:37",
                      "score": 14,
                      "num_children": 0,
                      "author": 50571,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hqp9bqy",
                  "text": "California pays more federal taxes than 42 other states combined. If we leave, broke red states wouldn't last 6 months.",
                  "timestamp": "2021-12-31 17:08:52",
                  "score": 2,
                  "num_children": 0,
                  "author": 271498,
                  "replies": []
                },
                {
                  "id": "hqo1r71",
                  "text": "I don't doubt that ultimately should the resulting war not be completely devastating that the left would come out on top, but what I worry about is everything before that.  I don't think there would be a country left to split at the end.  You'd be telling two neighbors, one Democrat the other Republican, that they're now enemies and must kill each other.  It would be very very bloody and the only entity that will truly get what they want from all of this will be Putin, certainly not the GOP.",
                  "timestamp": "2021-12-31 10:32:08",
                  "score": 1,
                  "num_children": 1,
                  "author": 201921,
                  "replies": [
                    {
                      "id": "hqoy12k",
                      "text": "Even a bloodless secession would cost the blue parts of our Union greatly too. The flip side of all this is access to food and a 3rd major international port in TX. \n\nRight now, the US is one of the only industrialized countries that produces more food than we consume. That would no longer be true of a Union made up of just the blue states. There would be a slight balancing of the GDP in fact provided the red states would sell the food to the blue states. Moreover, there are some things like natural gas and gasoline that would favor the red states too. However, the blue states would probably pretty quickly turn to renewables for power so I don’t think that’s as big of a balancer as food would be.\n\nLastly, there is a major supply chain issue in our country right now. The two major international trade ports (both coastal - east and west) are strained and Texas is offering a promising 3rd alternative right now. Like Chicago did in the 19th century, Texas is a centrally-located spot that could stand to boom from international trade. However, doing so will cause an increase in urban density which is the number one correlating factor with blue voting. Essentially as Texas grows and becomes more successful, it will likely become more blue.\n\nIn a way, this is an allegory for the real problem in America today which is that empty land shouldn’t be given voice in politics. Democracy has always been based on the idea of equal voices for all participants and our system over-states the voice of those in less densely populated areas right now. That’s a major flaw in our system",
                      "timestamp": "2021-12-31 15:50:52",
                      "score": 3,
                      "num_children": 0,
                      "author": 60491,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hqoi7vb",
                  "text": "And the fact that MT G lives in a blue state...",
                  "timestamp": "2021-12-31 13:44:46",
                  "score": 1,
                  "num_children": 0,
                  "author": 59098,
                  "replies": []
                },
                {
                  "id": "hqpem3p",
                  "text": "This.",
                  "timestamp": "2021-12-31 17:44:14",
                  "score": 1,
                  "num_children": 0,
                  "author": 377743,
                  "replies": []
                }
              ]
            },
            {
              "id": "hqmis7n",
              "text": "They haven’t moved more extreme… they stem from the line of thinkers who raped, genocided, and enslaved humans for hundreds of years. They got shut up in the 1860’s, and have been working very, very hard to regain all the power they currently wield.",
              "timestamp": "2021-12-31 01:31:21",
              "score": 26,
              "num_children": 0,
              "author": 152768,
              "replies": []
            },
            {
              "id": "hqnbqvc",
              "text": "America is not going to be destroyed \" he shouted passionately.  \n\n\"Never?\" prodded the old man softly.  \n\n\"Well...\" Nately faltered.  \n\nThe old man laughed indulgently, holding in check a deeper, more explosive delight. His goading remained gentle. \"Rome was destroyed, Greece was destroyed, Persia was destroyed, Spain was destroyed. All great countries are destroyed. Why not yours? How much longer do you really think your own country will last? Forever? Keep in mind that the earth itself is destined to be destroyed by the sun in twenty-five million years or so.\"  \n\nNately squirmed uncomfortably. \"Well, forever is a long time, I guess.\n\n-Joseph Heller",
              "timestamp": "2021-12-31 05:23:46",
              "score": 16,
              "num_children": 1,
              "author": 191629,
              "replies": [
                {
                  "id": "hqshws7",
                  "text": "Best novel. EVER.",
                  "timestamp": "2022-01-01 09:47:39",
                  "score": 1,
                  "num_children": 0,
                  "author": 141858,
                  "replies": []
                }
              ]
            },
            {
              "id": "hqnbpvh",
              "text": "I think they're aware and want to destroy America. I don't think these people love America or democracy.",
              "timestamp": "2021-12-31 05:23:30",
              "score": 11,
              "num_children": 0,
              "author": 113258,
              "replies": []
            },
            {
              "id": "hqlz3w5",
              "text": "[removed]",
              "timestamp": "2021-12-30 23:12:53",
              "score": 3,
              "num_children": 1,
              "replies": [
                {
                  "id": "hqmjic4",
                  "text": "I'm not convinced anymore that we won't live to see the breakup and balkanization of the US in my lifetime.",
                  "timestamp": "2021-12-31 01:36:48",
                  "score": 17,
                  "num_children": 0,
                  "author": 236455,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hqn0e0h",
          "text": "For a bunch of christian conservatives, they do a whole lot of divorcing",
          "timestamp": "2021-12-31 03:46:33",
          "score": 20,
          "num_children": 1,
          "author": 159132,
          "replies": [
            {
              "id": "hqn4n3j",
              "text": "And cheating, stealing, raping, and lying.\n\nEdit - probably should add 'killing' in there to.  Ya know, bAcK tHe BlUe!",
              "timestamp": "2021-12-31 04:21:21",
              "score": 16,
              "num_children": 0,
              "author": 142250,
              "replies": []
            }
          ]
        },
        {
          "id": "hqml4po",
          "text": "Republicans are eroding America's values. It's all projection. All the the time.",
          "timestamp": "2021-12-31 01:49:02",
          "score": 21,
          "num_children": 1,
          "author": 50846,
          "replies": [
            {
              "id": "hqo8cyj",
              "text": "They just want another chance to lose a war",
              "timestamp": "2021-12-31 11:59:04",
              "score": 4,
              "num_children": 1,
              "replies": [
                {
                  "id": "hqotpvw",
                  "text": "They have way more trained, crazed, and violent citizens on their side. I don't think a war is the answer.",
                  "timestamp": "2021-12-31 15:19:23",
                  "score": 1,
                  "num_children": 0,
                  "author": 106296,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hqmf7ee",
          "text": "But isn’t divorce a bad thing that’s taught from the Bible…",
          "timestamp": "2021-12-31 01:04:48",
          "score": 11,
          "num_children": 0,
          "author": 202981,
          "replies": []
        }
      ]
    },
    {
      "id": "hqkww1x",
      "text": "So by definition she's anti-American, because she doesn't want America as it stands today.  \n\nIf that doesn't spell traitor, I don't know what does.",
      "timestamp": "2021-12-30 19:01:19",
      "score": 249,
      "num_children": 3,
      "author": 201921,
      "replies": [
        {
          "id": "hqm0rrw",
          "text": "Agreed, we already fought this war. She is a traitor.",
          "timestamp": "2021-12-30 23:24:18",
          "score": 48,
          "num_children": 1,
          "author": 400479,
          "replies": [
            {
              "id": "hqo8e7n",
              "text": "The right will lose again",
              "timestamp": "2021-12-31 11:59:30",
              "score": 8,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hql5sl3",
          "text": "And so are the voters in who support her in the district. Can't have them off the hook.",
          "timestamp": "2021-12-30 19:58:30",
          "score": 51,
          "num_children": 0,
          "author": 156658,
          "replies": []
        },
        {
          "id": "htd6ipt",
          "text": "This is some self driving goalposts shit. NOBODY wants America as it is today",
          "timestamp": "2022-01-19 20:37:34",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hqklyny",
      "text": "I'd like to see Margarine Traitor-Greed divorced...from Congress.",
      "timestamp": "2021-12-30 17:52:15",
      "score": 373,
      "num_children": 3,
      "author": 246718,
      "replies": [
        {
          "id": "hqlpfbn",
          "text": "Aborted might be better -- so long as it's still legal, anyway.",
          "timestamp": "2021-12-30 22:07:30",
          "score": 89,
          "num_children": 2,
          "author": 297077,
          "replies": [
            {
              "id": "hqm9v6r",
              "text": "Pro-abortion, anti-Christ.",
              "timestamp": "2021-12-31 00:26:57",
              "score": 16,
              "num_children": 0,
              "author": 402671,
              "replies": []
            },
            {
              "id": "hqowaem",
              "text": "I'm not sure 190th-ish trimester abortions are legal...",
              "timestamp": "2021-12-31 15:38:20",
              "score": 1,
              "num_children": 0,
              "author": 168621,
              "replies": []
            }
          ]
        },
        {
          "id": "hqm5f4v",
          "text": "Too kind with your suggestion. Far too kind",
          "timestamp": "2021-12-30 23:56:08",
          "score": 7,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hqm9urf",
          "text": "She is an Iranian, Russian, and Chinese agent working for free to break up America.",
          "timestamp": "2021-12-31 00:26:51",
          "score": 4,
          "num_children": 2,
          "author": 408035,
          "replies": [
            {
              "id": "hqmrymz",
              "text": "Worse, she is a GOP true-believer.",
              "timestamp": "2021-12-31 02:40:30",
              "score": 16,
              "num_children": 1,
              "author": 81370,
              "replies": [
                {
                  "id": "hqmv0sy",
                  "text": "Same thing",
                  "timestamp": "2021-12-31 03:04:16",
                  "score": 5,
                  "num_children": 1,
                  "author": 379702,
                  "replies": [
                    {
                      "id": "hqrgvmo",
                      "text": "and does it for ... free\n\n* at least a traitor got a payment (lepen)  / she stabs her country for free",
                      "timestamp": "2022-01-01 02:54:46",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hqolmhj",
              "text": "she can be shitty without having to be a villain from a spy novel",
              "timestamp": "2021-12-31 14:14:37",
              "score": 1,
              "num_children": 0,
              "author": 361840,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hqkzh97",
      "text": "I'm sure our enemies abroad would love this.  I think we have to accept the fact that any sitting congress person who advocates for devisive stuff like this is 1. A fascist 2. A pawn of Putin.  Fascists Americans love Russia and Putin.  They see a divided America as a step forward in global fascist control.  They foresee an alliance between the fascist part of America and Russia.  Now while Russia technically isn't fascist, it is highly compatible with right-wing authoritarianism. \n\nJust look at the latest news about another fascist POS in congress named Madison Cawthorn.  Trip to Europe, hops a boat to Russia, meets a U.S. Army Captain who later invites him to a fake fitness competition in Miami to get him in the room with a Russian woman who Cawthorn marries and gets divorced from less than a year later.  All these fascists should be considered compromised.  Actively working against the integrity of the U.S.  Putin said it himself.  The U.S. has to be taken down from within, and it's literally unfolding in front of our eyes.",
      "timestamp": "2021-12-30 19:18:00",
      "score": 56,
      "num_children": 2,
      "author": 411009,
      "replies": [
        {
          "id": "hqljbnk",
          "text": "They are more traditional right wing. Except it’s the Russian Mob that rules Russia. \n\nEastern Europe is becoming more fascist over the last few years. \n\nJust like when Stalin ruled - technically it is Right wing Authoritarian like you mentioned. Not true communism or socialism.",
          "timestamp": "2021-12-30 21:27:25",
          "score": 9,
          "num_children": 1,
          "replies": [
            {
              "id": "hqrk7ni",
              "text": ">Eastern Europe is becoming more fascist over the last few years.\n\nyes no and yes\n\n&#x200B;\n\n\\- pis were strong  /  but they aint broke polish traditions >)\n\n* a party its athletic and wins election\n* a party gets too drunk and stagnates-drowns itself\n* it happened to the sld > to the platform  > to pis  (from 44 to 32)\n\n&#x200B;\n\n\\- fides wants a dictatorship.. but its interestin\n\n* fides has 48.. but the opposition has 46-52\n* if fides losses they might lose\n\n&#x200B;\n\n\\- romanian psd its funy\n\n* they went full trump (crackdown on lgbt + kissing putin + using  authoritarian nostalgia) + it afailed (3world kakistocracy + homophobia plunged them from 45  to 30)\n* **so they used their own judges to PURGE their trump**\n* psd courts sent their trump to jail\n* **after betraying dragnea psd   returned to  their normal mode** (extreme thievery  but not a dictatorship)\n* the risk its  a psd-haur coalition (haur are literal faascists)  /  psd vs haur runoff (u will have to vote cancer to kept haur  out of power\\_\n* sht will be funny  if the runoff  its psd vs usr  (usr would have a chance to win and force honesty)",
              "timestamp": "2022-01-01 03:23:30",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hqqw3zu",
          "text": "We'll be better without them.  The y'all Qaeda can descend into poverty, tyranny, and ruin.  We can build a better country without them.  We can actually fix the Constitution.  Then, I dunno, we can send relief aid workers or something now and then.  Maybe they can apply to get let back in.",
          "timestamp": "2022-01-01 00:08:33",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hqknhgl",
      "text": "Every time she says things that imply that she is unaware that republicans and democrats live next door to each other in literally every state, I get the same feeling as when I see a little kid trip over toys that were in plain view the whole time.",
      "timestamp": "2021-12-30 18:01:46",
      "score": 248,
      "num_children": 5,
      "author": 339320,
      "replies": [
        {
          "id": "hql455g",
          "text": "She doesn’t care. Fascists are in it for power. Even if she was aware of how ridiculous her idea is, she would say it anyway if it will get Qultists to support her more and will get her a better position when the putsch she so hopes for happens",
          "timestamp": "2021-12-30 19:47:45",
          "score": 107,
          "num_children": 0,
          "author": 98805,
          "replies": []
        },
        {
          "id": "hqljmvn",
          "text": "Exactly, every state is actually purple with the actual divides usually occurring between rural and urban",
          "timestamp": "2021-12-30 21:29:29",
          "score": 21,
          "num_children": 0,
          "author": 384550,
          "replies": []
        },
        {
          "id": "hql76sq",
          "text": "They know, they just don't care and want a Rwanda-style cleansing of any opposition.\n\nhttps://twitter.com/brianklaas/status/1476241016336404492?t=4Fdu6oxFJqvq1Jod7iJHhQ&s=19",
          "timestamp": "2021-12-30 20:07:43",
          "score": 65,
          "num_children": 1,
          "author": 41187,
          "replies": [
            {
              "id": "hqlit9s",
              "text": "They seem to forget that Liberals own weapons too, we just don’t masturbate on/ with them in public",
              "timestamp": "2021-12-30 21:24:05",
              "score": 58,
              "num_children": 1,
              "author": 315770,
              "replies": [
                {
                  "id": "hqlko54",
                  "text": "Somewhat, however overwhelmingly \"Conservatives\" own the largest amount of firearms and enjoy about a 50 percent split in the Military and probably a 70 percent majority in the Police. \nRegardless it's a reminder to not only be armed, but to be very well trained :( \nI think people need to understand that the same Rhetoric we hear now existed in Germany in the 1930s, Rwanda before that massacre, Serbia before their genocide etc. \nPeople are wound up on the right and cannot wait to taste blood, they don't care who's. \nI think one of the most profound book I read in this regard was \"A Jew Must Die\" a WW2 murder mystery that seemed incredibly stupid when I started it, yet beyond profound when I finished. \nI encourage everyone to read it.",
                  "timestamp": "2021-12-30 21:36:18",
                  "score": 25,
                  "num_children": 3,
                  "replies": [
                    {
                      "id": "hqln3h6",
                      "text": "Except the majority of military installations are in blue states. \n\nThe hillbilly red army and their individual arms are really cute at how they think that's going to matter but really they aren't going to hold a candle to actual military weaponry. \n\nIf it comes down to it, with control of both the main capital centers of the nation in NY and CA and the majority of weaponry in blue states they have no chance. \n\nIn an actual war scenario we'd run through the red state faction as breezily as we rode through Kuwait or as quickly as the Russians took Berlin.",
                      "timestamp": "2021-12-30 21:52:10",
                      "score": 33,
                      "num_children": 4,
                      "author": 148799,
                      "replies": [
                        {
                          "id": "hqly2is",
                          "text": "Exactly, an fully loaded Apache helicopter would have ended the Jan 6th insurrection in about 1 minute",
                          "timestamp": "2021-12-30 23:05:43",
                          "score": 13,
                          "num_children": 3,
                          "author": 315770,
                          "replies": [
                            {
                              "id": "hqo3ps2",
                              "text": "AND IT FUCKING SHOULD HAVE.",
                              "timestamp": "2021-12-31 10:58:37",
                              "score": 6,
                              "num_children": 0,
                              "author": 341668,
                              "replies": []
                            },
                            {
                              "id": "hqpeyhh",
                              "text": "A 9mm ended it in about 10 seconds...",
                              "timestamp": "2021-12-31 17:46:34",
                              "score": 1,
                              "num_children": 0,
                              "author": 294021,
                              "replies": []
                            },
                            {
                              "id": "hqrh8ss",
                              "text": "and thats how it should've been dealt \n\n* i imagine that if someone tries a jan6 on belarus .. lukashenka will recieve him with ice cream and stuffed toys ....",
                              "timestamp": "2022-01-01 02:57:55",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hqmjub1",
                          "text": "You don’t get it, there are Military officers who eat up the garbage on Faux and literally support Trump, despite his Anti constitutional rhetoric and will do anything to make sure that the communist Dems fall by the wayside. To make matters worse imbeciles on the left have pissed off the police and many in the Military as well, but expect them to follow orders because they signed a piece of paper.\nMoreover republicans are set to sweep congress next year and likely the Presidency two years after. Trumps rhetoric is stronger now than before his soft coupe do to the typical weak, inept democrats thinking the “Hillbillies” will not be a threat.\nThey are mistaken as we have already seen a entire paper massacred, what, two years ago?\nYou saw the hillbillies easily sit in Nancy Pelosi desk less than a year ago.\nKeep underestimating them and they will have full power while you curl up in the basement wishing you hadn’t bad mouthed your Hill billy neighbor and knew how to actually use a firearm, not that it matters as at that point it will just get you killed.\nI’ve stared down the barrel of a Klashnikov and trust me, it ain’t fun knowing the only reason you are alive is the “hillbilly” didn’t pull the trigger.\nYou people are clueless and a big part The Big lie works",
                          "timestamp": "2021-12-31 01:39:21",
                          "score": 6,
                          "num_children": 2,
                          "replies": [
                            {
                              "id": "hqnbgri",
                              "text": "The military isn't split though at all levels. The right-wing shitbags are mostly grunts at the lower level who have no real knowledge of strategy. They'd be a bunch of chickens running around with their heads cut off in a real conflict, and that's not even touching on the fact that modern wars rely on high-tech weaponry that's designed and serviced mostly in blue states. They could sit there and pew pew with their rifles all day long as drones picked them off.",
                              "timestamp": "2021-12-31 05:21:10",
                              "score": 4,
                              "num_children": 1,
                              "author": 115967,
                              "replies": [
                                {
                                  "id": "hqp3ux0",
                                  "text": "I live in Montana and know a Pile of Military, My Cousin a retired LT Commander whom I always found intelligent, although we cannot get along as he thinks he \"commands\" me. LOVED Trump, and I mean You don't question his genius.\nBrother in Law, retired Wing Commander, again a very intelligent man until, Trump *face palm* \nWould either of them go team Red? I don't know. \n\nFormer Friend, retired Major in the Marines, combat veteran Working on his PHD in Psychology, would undoubtably jump back in his tank to rid the world of Liberal, Socialist Scum. His FB is filled with Military who share his view. \nStill waiting for him to kick my ass, although he and I both know I will shove his medals up his rectum, so that won't happen. \nThose ancedotals and seeing Vietnam and other Veteran stickers next to  \"Lets go Brandon\" all over Montucky says you are wrong and fucked. \nThe Right does what Fascists do best, give constant praise along with lots of flags to the Military. \nThe left? Well, we see the visceral in your post, not to Trump, but to the Military itself, why the hell would they want to fight for that? \nBecause they should? Don't be absurd. \nMost you are right don't know the US Constitution, they rest don't care as they are told every day how dangerous Liberalism is, how Liberals are responsible for all the wrong in America. \nNot the first time we heard this propaganda, Nazi's used it as did Communists under Stalin.\n It works. \n\nhttps://www.military.com/daily-news/2020/09/15/dozens-of-retired-generals-admirals-sign-letter-backing-trump-reelection.html",
                                  "timestamp": "2021-12-31 16:31:45",
                                  "score": 2,
                                  "num_children": 3,
                                  "replies": [
                                    {
                                      "id": "hqri37t",
                                      "text": "imho\n\n\\-  if we were conservative would be understandable to vote trump (cheney)   before jan6  \n\n* on hehe its just slurs bro >)\n\n\\- still liking him AFTER jan6  its the problem\n\n* as liking chavez cz  92; coups",
                                      "timestamp": "2022-01-01 03:05:07",
                                      "score": 1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hqss4i0",
                                          "text": "I don't think it's understandable at all, can you name another POTUS who was under indictment during his election?\nAnother POTUS who campaigned against the US Constitution, both times?\nOne who trashed every US President and our institutions? \nBragged about sleeping with his daughter? \nI voted largely red until Trump won the Nomination in 2016, between that and his indefensible collusion with Russia (See Mueller Report, Senate and House intelligence reports on Russian interference) and republicans being his personal defense attorney over the unconscionable, I will never vote Republican again, Period. \nThey can go to hell.",
                                          "timestamp": "2022-01-01 12:19:40",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "hqv29ew",
                                      "text": "All former.",
                                      "timestamp": "2022-01-01 22:58:38",
                                      "score": 1,
                                      "num_children": 0,
                                      "replies": []
                                    },
                                    {
                                      "id": "hqqwhx0",
                                      "text": "Retired.  As in not active.  As in nobody has to give a fuck what they say and their influence is dried up.  Probably old as shit, too, so it's not like they have the star power needed to raise an armed force with some phone calls.",
                                      "timestamp": "2022-01-01 00:11:38",
                                      "score": 0,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hqnnos0",
                              "text": "I won’t argue that things certainly are rather grim right now, but I’d like to add some facts for clarity.\\\nI don’t know if you served or not, so I won’t judge you. But, your understanding of military members being expected to “follow orders because they signed a piece of paper” is lacking. To them it’s not just a piece of paper, it’s a lifestyle and it’s honor. They are bound to uphold and defend the constitution, and I assure it’s not something done lightly or without regard. That paper defines who they are down to their very core. They believe in it, they trust it and they put their lives in the line for it. Because when you take orders from the top to kill people, you have to know why and it needs to be justifiable.\\\nYou are correct, up until recently the military has tended to lean to the Right, if not outright ruby red in some cases. And the reason for that isn’t what you think. It doesn’t have to do with the border, it doesn’t have to do with social programs or a fiscal responsibility. It literally has to do with self preservation. Traditionally the Democrats have pushed to reduce the military budget and close bases, that is where their opposition has come from. But, Trump (in his usual self defeating fashion), changed that during his presidency with how he acted towards Generals Kelly and Mattis and his comments about members being ‘suckers and losers’. Those Generals are highly highly respected and loved in military circles. His comments were a betrayal and as such things have changed dramatically.\\\nIn 2016 Trump took about 40% of the military votes while Clinton took about 20%. Fast forward to the 2020 election and Biden (for the first time in years), took the majority with around 41% while Trump took around 37%. That is a radical swing no matter how you spin it. Sentiment has changed dramatically and honestly for the better.\\\nSo your scenario of the military backing a coup in this country, is extreme hyperbole I’m afraid. It literally would never happen unless the Pentagon were on board with it and they most certainly are not. It’s the reason Donald didn’t get his military parade (remember that? Seems like eons ago), because the Pentagon said “No, we aren’t doing that. You can get a flyover and some pretty vehicles on the lawn and that’s it”.\\\nNow your estimation on the police? As much as it pains me to say it, you hit that one out of the park. You are dead on. And personally that’s more scary to me. And it’s why I changed my stance on gun ownership. I’ve come a full 180° on it. When mass shootings were happening every week it seemed like, I was all in on gun control. And then I talked to my neighbor and he talked about owning his because of the crazy ‘red hats’. In 2016, I bought my first. And I’ve been in support ever since. And I’ll be straight, it’s nice to see a lot of Left Leaning gun owners popping up in social media sites. More and more all the time.\\\nAnyway, that’s my two cents. Be safe, be well.",
                              "timestamp": "2021-12-31 07:28:15",
                              "score": 1,
                              "num_children": 2,
                              "author": 232564,
                              "replies": [
                                {
                                  "id": "hqrizbo",
                                  "text": "> But, Trump (in his usual self defeating fashion), changed that during his presidency with how he acted towards Generals Kelly and Mattis and his comments about members being ‘suckers and losers’.\n\nand thats  the good part...\n\n&#x200B;\n\n\\- a clever fascist would not shit at the army\n\n* neither chavez/putin/assad are stupid enough to play this\n* so a pulling out a venezuela (flynn) will not be that possible.....\n\n&#x200B;\n\n\\- but the police its full on the crazy\n\n* too much crazyes\n* **they've millitary gear** *(thanks war on drugs)*\n* normies hates  them   \n* normies (if they want these jobs) > **goes to the millitary**\n\nredpill  \n\n* if police turns banans someone could try a coup\n* a (loyal) millitary vs (seditionist) police + proud boys might happen [https://elpais.com/internacional/2010/09/30/actualidad/1285797605\\_850215.html](https://elpais.com/internacional/2010/09/30/actualidad/1285797605_850215.html)",
                                  "timestamp": "2022-01-01 03:12:53",
                                  "score": 2,
                                  "num_children": 0,
                                  "replies": []
                                },
                                {
                                  "id": "hqp7lg4",
                                  "text": "BTW, I was a frothing gun owner not too long ago as well, I changed my tune for the same reason as you, tired of seeing school shootings and psychopaths massacring people. *puke* \nNow I'm getting old and would just assume get rid of most of em, but I honestly don't want them to get into the hands of some nut bag, sigh. \nWith that said I have not carried in years, but I have again since the rise of the right, plus being married to a scary brown person....\nhttps://thoughtsoftheages.blogspot.com/2018/02/addressing-gun-control-debate-from-long.html",
                                  "timestamp": "2021-12-31 16:57:02",
                                  "score": 1,
                                  "num_children": 2,
                                  "replies": [
                                    {
                                      "id": "hqq37w9",
                                      "text": "Liberal here, I keep a 9mm, .45, .44 Magnum, semi 12 gauge, .257 Weatherby magnum, 308 Hogan, 338 Lapua magnum sniper rifle and AR15 at the ready…",
                                      "timestamp": "2021-12-31 20:33:29",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 315770,
                                      "replies": []
                                    },
                                    {
                                      "id": "hqpjh4k",
                                      "text": "Lol, nobody should have anything at home except revolvers? No thanks, I’ll keep my glock and ar.",
                                      "timestamp": "2021-12-31 18:17:12",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 15613,
                                      "replies": [
                                        {
                                          "id": "hqpkvhd",
                                          "text": "Where did I say that? My preferred carry gun is a revolver though, I mean it's not like there is some big impending gun fight on the horizon. \nAs to Glocks, wonderful combat firearm to which I have thousands of rounds out of both I own, a real need for them? No. \nDo you have more than a box of shells out of yours? No, didn't think so.\nAny real training with them? I mean serious training?",
                                          "timestamp": "2021-12-31 18:26:36",
                                          "score": 1,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "hqpmer5",
                                              "text": "I have hundreds of rounds out of my current carry glock (43x). Many more out of my last 19. Haven’t been able to zero my ar in because rounds have been too expensive the last year when it was built.\n\nWould love to find somewhere around me that isn’t some right wing ‘militia’ training, but I’m in OK.\n\nI was referring to the blog you linked, though. Did you even read it? It suggests that rifles should be left at ranges and can never leave it and people should only be able to have revolvers at home. Kinda went the opposite way of the conversation.",
                                              "timestamp": "2021-12-31 18:37:07",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 15613,
                                              "replies": [
                                                {
                                                  "id": "hqpvi19",
                                                  "text": "Did I read it? \nI wrote it. \nI did a fair amount of research to come to the conclusions I did. I am about solutions and try to come up with them after my bitching. \n\nYou must have missed the part where I said I have an AR as well. \nI have a carbon 15 to carry while snow shoeing to smoke a Yote (Coyote) or two, three, four, five, well you get the picture. \nSince then, I lost my taste for Varmint hunting, not against it, just like Trapping it's something in my past I have no interest in any longer. \n\nTraining, those right wing nuts have pretty good training. In fact if the NRA acted like it did at their ranges and competitive circuits, it would be outstanding. I believe I covered that in my article as well. \n\nFormer NRA Bullseye Pistol Shooter (off hand precision) and shot some F Class 1000 yard as well and a fair amount of devotion to shooting Trap. For whatever reason I am not very good at regular but do well at Wobble Trap, go figure. \n Competitive shooting is amazing and something I encourage and hope to get into again in the future. \n\nTraining;  I think I got the most out of PSD Training to be honest, it applies to protecting yourself the most in the real world IMO as it details defensive driving, planning routes and what to do when it does hit. \nNone of that stay and engage BS. \n\nMore formal training actually turned me off from Evil Black guns as I realized your odds of fighting off multiple intruders is likely not going to happen. We took turns being the bad guy in CQB, you are absolutely Fucked. I should have realized that back when I played a shit load of paintball, but I was very athletic in those days and did well sooo getting old sucks. \nI want to be clear, I am a shooter, not an operator, I am just someone who wanted the best Training possible. \n\nhttps://www.youtube.com/watch?v=ueZKWBid88o",
                                                  "timestamp": "2021-12-31 19:39:27",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hqnfcy7",
                          "text": "Gerald O'Hara: [the men are discussing the prospect of going to war with the North] And what does the captain of our troops say?\n\nAshley: Well, gentlemen, if Georgia fights, I go with her. But like my father I hope that the Yankees let us leave the Union in peace.\n\nMan: But Ashley, Ashley, they've insulted us!\n\nCharles Hamilton: You can't mean you don't want war!\n\nAshley: Most of the miseries of the world were caused by wars. And when the wars were over, no one ever knew what they were about.\n\nGerald O'Hara: [the other men protest] Now gentlemen, Mr. Butler has been up North I hear. Don't you agree with us, Mr. Butler?\n\nRhett Butler: I think it's hard winning a war with words, gentlemen.\n\nCharles Hamilton: What do you mean, sir?\n\nRhett Butler: I mean, Mr. Hamilton, there's not a cannon factory in the whole South.\n\nMan: What difference does that make, sir, to a gentleman?\n\nRhett Butler: I'm afraid it's going to make a great deal of difference to a great many gentlemen, sir.\n\nCharles Hamilton: Are you hinting, Mr. Butler, that the Yankees can lick us?\n\nRhett Butler: No, I'm not hinting. I'm saying very plainly that the Yankees are better equipped than we. They've got factories, shipyards, coalmines... and a fleet to bottle up our harbors and starve us to death. All we've got is cotton, and slaves and... arrogance.\n\nMan: That's treacherous!\n\nCharles Hamilton: I refuse to listen to any renegade talk!\n\nRhett Butler: Well, I'm sorry if the truth offends you.\n\nCharles Hamilton: Apologies aren't enough sir. I hear you were turned out of West Point, Mr. Rhett Butler. And that you aren't received in a decent family in Charleston. Not even your own.\n\nRhett Butler: I apologize again for all my shortcomings. Mr. Wilkes, Perhaps you won't mind if I walk about and look over your place. I seem to be spoiling everybody's brandy and cigars and... dreams of victory.",
                          "timestamp": "2021-12-31 05:58:16",
                          "score": 1,
                          "num_children": 0,
                          "author": 115967,
                          "replies": []
                        },
                        {
                          "id": "hqplgex",
                          "text": "I think you misunderstand 4th generation warfare\n\nmost times, insurgents would be guerrillas in areas where the government forces are loyal, looking like you or me.\n\nIn areas where the local sheriff and cops support them, they'll be open, and for the people in the town who don't support them, they'll either be ran out or killed.\n\nAnd the thing is, the US military does not have the manpower to guard, patrol, and engage in even every place in a region (not even counting massive states like cali or texas) so these things would happen.\n\nA Second American Civil war wouldn't look like the first, it be the worse of the troubles mixed with the worse of yugoslavia, with a dash of syria.\n\nDo not overestimate the US military's ability and do not underestimate the far right's",
                          "timestamp": "2021-12-31 18:30:34",
                          "score": 1,
                          "num_children": 0,
                          "author": 104269,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hqqtq6z",
                      "text": "The caveat to that statistic is that a person who owns 10, 20, 30+ firearms can still only use one at a time. It doesn't mean there aren't a lot of conservative gun owners, just that the number is often inflated by the ones who fetishize guns.",
                      "timestamp": "2021-12-31 23:49:54",
                      "score": 5,
                      "num_children": 1,
                      "author": 114951,
                      "replies": [
                        {
                          "id": "hqqyy7k",
                          "text": "Sure, I am one of them who has ways too damned many and yes, that is irrelevant. \nHowever firearm ownership is up about 6 percent. \nIt is to note that there are over 600k hunters in Wisconsin alone. \nFeel free to pretend nothing will happen. \nIt will",
                          "timestamp": "2022-01-01 00:31:04",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hqqzvh2",
                              "text": "Oi, don't put words in my mouth, because I certainly didn't say nothing was going to happen. \n\nI never felt the need or desire to own any until this year - my resolution and gift to myself is getting some classes at the local range and finding something I like.",
                              "timestamp": "2022-01-01 00:38:19",
                              "score": 1,
                              "num_children": 1,
                              "author": 114951,
                              "replies": [
                                {
                                  "id": "hqr3p9c",
                                  "text": "Great job getting classes, please take several and be safe :) \nWhat did you get?",
                                  "timestamp": "2022-01-01 01:08:20",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hqu8buw",
                                      "text": "I haven't bought anything yet, though I've been looking online etc. One of the two local ranges let's you try their own stock, and it looks like a decent selection to get a feel for some.\n\nPart of me is leaning towards a shotgun because I shot clay a few times as a kid and enjoyed it. A nice outdoor hobby for a pandemic, I think. But a rifle seems like it might be the most conducive to learning in general. Either way, something that suits for home defense but is also fun in its own right.",
                                      "timestamp": "2022-01-01 19:30:52",
                                      "score": 1,
                                      "num_children": 2,
                                      "author": 114951,
                                      "replies": [
                                        {
                                          "id": "hqug19f",
                                          "text": "Trap is an absolute hoot and trigger time/reflexes are always good for home defense, although Trap is about keeping your bird hunting reflexes up. If you go that route spend some coin on a good shotgun (Have a beautiful Weatherby Orion D Italia I bought to shoot trap (field gun however) and only did two rounds, PM Me if interested. Not sure why as previously I went a couple times a week. A good Trap gun will cost you 1400 on up. https://www.americanrifleman.org/content/weatherby-orion-d-italia-ii/\nI loved the long range game with rifles and it's the only real way you can afford to shoot now days. You can get an out of box Savage that is well beyond your or even most experienced shooters accuracy capabilities and have fun. The rule of thumb for a decent scope is to spend as much as you did on your rifle. https://www.cabelas.com/shop/en/savage-10t-sr-bolt-action-rifle\n.308 is actually a very popular caliber in this regard with the experienced long range shooters as it is cheap (was) and allows you to shoot thousands of rounds (unlikely) and never have to worry about replacing a barrel. \nThe Magnum rounds burn up Barrel. I shot a 300 win mag 1000 yard F Class and the barrel life is maximum 800 shots, so I am half way there or more. However I went that route as less adjustment since it had less bullet drop, example mine dropped roughly 18 feet at 1000 yards. Altitude, Humidity, wind and rotation of earth (East West) factor in of course. \nIf you want the semi auto with a magazine a M1A1 match will make you a rock star, but anytime you shoot semi auto you burn through more rounds. I also have a Cetme that I am considering getting rid of which would only need a trigger for shooting a few hundred yards they kick ass. \nWith a bolt action you can practice site alignment and trigger pull with \"Snap Caps' or dummy rounds at home. Lots of that makes you a better shooter, even beyond shooting real rounds. Knowing math and your scope puts the bullet where you want it, although with lots of money modern scopes adjust automatically! \nUsually at the 1000 yard I would maybe shoot 10 shots a day as we let our barrels cool between shots. Shooting long range is fun as hell, lots of Algebra and Calculus if you stay old school as a .308 round will drop about 36 feet in a thousand yards, now put that bullet on a 10 inch plate....\nThe Shotgun of course gives you both means. For home invaders it's perfect. Trap ranges are usually closer or even in town for close trips and lots of fun. \nGood luck, either way say goodbye to your bank account :P especially Trap, if money is an option I would avoid this as most will shoot thousands upon thousands of trap rounds a year. Initial cost and ammo are far higher do to more time at the range.",
                                          "timestamp": "2022-01-01 20:23:20",
                                          "score": 2,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "hqumqg8",
                                              "text": "I think if I am going to splurge on a shotgun, the one that really caught my eye is the IWI Tavor [TS12](https://www.americanrifleman.org/content/review-iwi-tavor-ts12/) . I'm a sucker for thoughtful design in general, and I've yet to find a bad review of it. Probably not ideal for trap lol but versatile, great for home defense and by all accounts -very- fun to shoot.\n\nI hadn't really considered a long range rifle since it didn't strike me as ideal self defense for the suburbs, but that's a very good point about the rate at which you use ammo - and the math is cool! \n\nThere's a certain appeal to an AR-15 style platform or something similar and really making it your own with all the options for upgrades, accessories and so on. I'm sure it will all cost more than I anticipate, but on the other hand, the part of my budget alotted for social stuff has largely gone unused in pandemic life.",
                                              "timestamp": "2022-01-01 21:09:18",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 114951,
                                              "replies": [
                                                {
                                                  "id": "hqup1og",
                                                  "text": "Semi Auto's are a hoot, I won't lie, but to really learn precision bolt action is where it's at. \nThat shotgun is completely useless beyond pretend home protection from zombies, please avoid it if you intend to shoot trap, you will be laughed off the range and end up throwing in the bush do to pellet spread being too much to hit absolutely anything. \nOn the cheaper end you can get a single action shotgun for years of fun in Trap, or upgrade to Side by Side or Over under. \nIf you insist on at least a Pump, you can get one of these or a Winchester and buy a short barrel for home defense. Not that it's really needed beyond ascetics, looking cool and the imagination since the typical person has ZERO idea how to actually clear a house. \nhttps://www.benelliusa.com/shotguns/supernova-pump-action-shotguns\n\nIf you have a close indoor range you can get into Pistol shooting. I did NRA Match Pistol which is also known as Bullseye both indoor and outdoor. Loads of fun and far cheaper as you can use a .22. \nThen you can scope or put a reflex site on your pistol. \nhttps://www.bullseyepistol.com/getinto.htm",
                                                  "timestamp": "2022-01-01 21:25:18",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "hquibmr",
                                          "text": "I forgot to add that a rifle can be used for home defense but is less than stellar do to bullet penetration which will go through the bad guy, the wall, another wall, your neighbors wall etc.  not to mention the scope for up close... \nSpeaking of, this scope is outstanding for the price .\nhttps://www.swfa.com/swfa-ss-10x42-tactical-30mm-riflescope-3.html\nThen get a milldot Master to go with it ;)",
                                          "timestamp": "2022-01-01 20:39:03",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hqr7q6j",
                      "text": "While true that the majority are in the hands of Conservatives, if one person has an arsenal of 100 firearms, 98 are paperweights.\n\nIt's all academic in the end. The collapse of the supply chain would put an end to things really quickly. We're all interdependent. The urban areas don't get by without the food and raw materials from the rural areas and the rural areas don't get by without the manufacturing and finished products of the urban.",
                      "timestamp": "2022-01-01 01:40:19",
                      "score": 3,
                      "num_children": 0,
                      "author": 95029,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hqmbxyn",
          "text": "[deleted]",
          "timestamp": "2021-12-31 00:41:29",
          "score": 7,
          "num_children": 1,
          "replies": [
            {
              "id": "hqn180f",
              "text": "I grew up in the conservative east of California, which just makes lazy California stereotypes more infuriating because I grew up with people who believe all the same shit the people making those jokes do.",
              "timestamp": "2021-12-31 03:53:13",
              "score": 3,
              "num_children": 0,
              "author": 293043,
              "replies": []
            }
          ]
        },
        {
          "id": "hqly61t",
          "text": "OP’s post seems unaware of that fact too",
          "timestamp": "2021-12-30 23:06:23",
          "score": 4,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hqkpcad",
      "text": "I'd like to see a national divorce between MTG and governing bodies.",
      "timestamp": "2021-12-30 18:13:29",
      "score": 53,
      "num_children": 0,
      "author": 250645,
      "replies": []
    },
    {
      "id": "hqkuitz",
      "text": "The Union retains the *whole* house in *this* settlement.\n\nThe other party has to move out. To an apartment.\n\nOr whatever. Wherever. The furnishings remain.",
      "timestamp": "2021-12-30 18:46:15",
      "score": 36,
      "num_children": 0,
      "author": 126515,
      "replies": []
    },
    {
      "id": "hql7x4e",
      "text": "It’s gonna be really funny when California’s economy is bigger than the entirety of the United States after 50 years of independence lolol",
      "timestamp": "2021-12-30 20:12:36",
      "score": 34,
      "num_children": 2,
      "author": 246042,
      "replies": [
        {
          "id": "hqlo6k6",
          "text": "Yeah they're too stupid to realize this part. CA and NY alone have enough economic might to crush the red states. Their economies are the size of many large country's economies. Capital stops flowing to the red staters try buying food, basic necessities, oil, machinery.\n\nThey also aren't bright enough to know the majority of domestic military installations are in blue states. CA again has the more of the them than anywhere else.  \n\nSo they might have more guns but we have the tanks, artillery, aircraft, warships, etc.",
          "timestamp": "2021-12-30 21:59:16",
          "score": 24,
          "num_children": 3,
          "author": 148799,
          "replies": [
            {
              "id": "hqm2440",
              "text": "As someone who lives in San Diego, it’s really hard to use AR-15’s against nuclear submarines with ICBM WMD’s sorta just doesn’t work lolol",
              "timestamp": "2021-12-30 23:33:31",
              "score": 12,
              "num_children": 1,
              "author": 246042,
              "replies": [
                {
                  "id": "hqpltsy",
                  "text": "but you know what AR-15's work really well on?\n\nThe crew of the submarines and drones and tanks, their repair teams, the truckers who transport fuel, and the families of all of above.",
                  "timestamp": "2021-12-31 18:33:09",
                  "score": 1,
                  "num_children": 1,
                  "author": 104269,
                  "replies": [
                    {
                      "id": "hqppgej",
                      "text": "I guess, but that takes networking, organizing, infrastructure, training, intelligence, and stealth. Common citizens won’t really have all that, and given the majority of infrastructure is centralized in military bases which are commonly located in high value locations like major cities, which are also commonly democratic, they’ll be at a disadvantage.\n\nNot to mention the targets you referenced are all a part of the economies of the military and would be protected by them so you’d have a hard time enforcing that plan when you’re outgunned, outmaneuvered, and don’t have access to nearly the level of communications or intelligence that the enemy force would.\n\nI’m not pro military, but I respect the threat they hold over us. We’re one failed revolution away from an authoritarian dictatorship.",
                      "timestamp": "2021-12-31 18:57:50",
                      "score": 1,
                      "num_children": 1,
                      "author": 246042,
                      "replies": [
                        {
                          "id": "hqpq5lu",
                          "text": "The military does not have the manpower to defend and patrol every road they use and every family of the people involved with them while also engaging in a low level insurgency operation.",
                          "timestamp": "2021-12-31 19:02:39",
                          "score": 1,
                          "num_children": 2,
                          "author": 104269,
                          "replies": [
                            {
                              "id": "hqpqy26",
                              "text": "I mean if we’re going terrorism then I dont think they’ll be afraid to fight back with terrorism. It’s the US military, since when have they shyer away from mass murder out of convenience?",
                              "timestamp": "2021-12-31 19:08:04",
                              "score": 1,
                              "num_children": 1,
                              "author": 246042,
                              "replies": [
                                {
                                  "id": "hqprvna",
                                  "text": ">the US military, since when have they shyer away from mass murder out of convenience?\n\nSince it's in home territory and the last time they did that the militia movement started",
                                  "timestamp": "2021-12-31 19:14:32",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 104269,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hqqurlt",
                              "text": "Pretty sure they have the manpower, firepower, and reconnaissance capability to protect their own bases - particularly naval bases and airfields. At the end of the day, that's what counts. Not like we negotiate with terrorists anyway.",
                              "timestamp": "2021-12-31 23:57:48",
                              "score": 1,
                              "num_children": 0,
                              "author": 114951,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hqnerx2",
              "text": "I love how many of these morons don't realize all the high-tech weaponry is designed in blue states. It turns out you need educated people to make drones and fighter jets.\n\nNorthrop Grumman is a perfect example. They designed the Stealth Bomber and they're working on a future land-based ICBM system.\n\nThey're based in Connecticut with their Aeronautics division in Redondo, California because it turns out that's where all the smart people are at. All these hippies are building UAVs, the new F-35 Lightning, cargo transports, and reconnaissance vehicles.\n\nTheir Mission Systems is in Linthicum, Maryland. They produce a shit ton of radar sensors, and they are in charge of producing and maintaining AWACS for the US, UK, NATO, and allies.\n\nTheir Defense Systems are in McLean, Virginia. They provide training and systems for the military.\n\nSo imagine MAGAstan trying to fight a war against the actual educated part of the country that produces all the fucking aircraft, spy satellites, UAVs, night vision goggles, cargo transports, ships, steal aircraft, modern fighter jets, and logistics. It would a fucking shit show. And who would foreign nations side with. First of all, most would not risk getting involved in an internal dispute in a nuclear superpower, but if they did, they'd fucking well support the part of the country that's also making all this shit for them as well.",
              "timestamp": "2021-12-31 05:52:32",
              "score": 8,
              "num_children": 0,
              "author": 115967,
              "replies": []
            },
            {
              "id": "hqlujic",
              "text": "If hoi4 has taught me anything it's that I can never have too many guns but I need too many of those other things.",
              "timestamp": "2021-12-30 22:41:53",
              "score": 4,
              "num_children": 0,
              "author": 326243,
              "replies": []
            }
          ]
        },
        {
          "id": "hqrnl95",
          "text": "Hmmm this actually is a good idea perhaps?",
          "timestamp": "2022-01-01 03:52:32",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hqro96i",
              "text": "No it’s definitely not. Think of all the people in Texas who will be subjected to even more of an authoritarian regressive rule? Think of the lack of environmental restrictions in a red dominated US. Think of the exploitation of the other world powers as the separate countries of the US conflict with one another. We’d become a war zone out of petty disagreements between militant corporations. This hair ripping frustration of a situation is far better than the natural alternatives",
              "timestamp": "2022-01-01 03:58:25",
              "score": 1,
              "num_children": 0,
              "author": 246042,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hqli3ic",
      "text": "Liberals, leftists, and fellow socialists also living in the southern states: please remind your conservative, right, and fascist neighbors that we are sometimes gun owners as well and they should fuck around and find out.",
      "timestamp": "2021-12-30 21:19:25",
      "score": 30,
      "num_children": 4,
      "author": 351872,
      "replies": [
        {
          "id": "hqnf6xe",
          "text": "Also, remind them that guns and bodies on the ground don't matter as much in modern warfare. I'd love to see them using their peashooter against drones.",
          "timestamp": "2021-12-31 05:56:36",
          "score": 8,
          "num_children": 1,
          "author": 115967,
          "replies": [
            {
              "id": "hqpmd7m",
              "text": "they won't\n\nthey'll use it on the logistics that support the drones\n\nand the pilots\n\nand the maintenance crews \n\nand the truckers who transport fuel to the air base\n\nand the families of all of above\n\nand what could the US do? they certainly can't bomb citizens willy nilly like they did in Afghanistan.\n\nIt'll be a long and drawn out campaign of midnight raids and arrests and standoffs",
              "timestamp": "2021-12-31 18:36:50",
              "score": -1,
              "num_children": 3,
              "author": 104269,
              "replies": [
                {
                  "id": "hqqh6kv",
                  "text": "Spread memes with misinformation. How can you expect them to be smart enough to put together plans and follow through when they are so easily tricked by misinformation",
                  "timestamp": "2021-12-31 22:14:46",
                  "score": 2,
                  "num_children": 0,
                  "author": 399764,
                  "replies": []
                },
                {
                  "id": "hqrttmy",
                  "text": "Bold of you to assume MAGATs have the capacity to think strategically",
                  "timestamp": "2022-01-01 04:51:20",
                  "score": 1,
                  "num_children": 1,
                  "author": 19131,
                  "replies": [
                    {
                      "id": "hqrw04t",
                      "text": "its unwise to underestimate your enemies",
                      "timestamp": "2022-01-01 05:14:43",
                      "score": 1,
                      "num_children": 1,
                      "author": 104269,
                      "replies": [
                        {
                          "id": "hqs0eo7",
                          "text": "Fair enough",
                          "timestamp": "2022-01-01 06:00:23",
                          "score": 1,
                          "num_children": 0,
                          "author": 19131,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hquorgv",
                  "text": "It would be very hard to get inside those facilities. To launch a concentrated attack on such facilities would be dispersed very quickly through heavy firepower. And if situation is necessary then any type of force be used against traitors.",
                  "timestamp": "2022-01-01 21:23:18",
                  "score": 1,
                  "num_children": 1,
                  "author": 19629,
                  "replies": [
                    {
                      "id": "hquqr11",
                      "text": "Last time I checked, the people like truckers, manufacturers, and off duty soldiers aren't often on base\n\nAnd unless you're suggesting that the US military has both the manpower to both engage in counter insurgency operations and guard these folks along with the family of the soldiers, I'm sorry to say but there's always gonna be soft targets for them to attack",
                      "timestamp": "2022-01-01 21:36:59",
                      "score": 1,
                      "num_children": 0,
                      "author": 104269,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hqnm2j4",
          "text": "They know it, but just never realize it.\n\nThey love to misquote inner city gun statistics but never realize that same inner city is going to pop off and squash a rebellion real quick.",
          "timestamp": "2021-12-31 07:09:22",
          "score": 7,
          "num_children": 0,
          "author": 263812,
          "replies": []
        },
        {
          "id": "hqofxuk",
          "text": "I would but we’re not on speaking terms anymore. I can’t make inroads past the delusional home-made bumper stickers and flags depicting Trump shirtless and muscled. \n\nThey’re confronting the general public at all times with their trucks and hats and t-shirts, but they’re definitely not prepared for an actual conversation. Not trying to get shot out here.",
          "timestamp": "2021-12-31 13:23:20",
          "score": 4,
          "num_children": 0,
          "author": 99767,
          "replies": []
        },
        {
          "id": "hqpeknk",
          "text": "Exactly, it’s not lost on me that they think they will walk all over true patriots. Fuck around and find out",
          "timestamp": "2021-12-31 17:43:58",
          "score": 2,
          "num_children": 0,
          "author": 315770,
          "replies": []
        }
      ]
    },
    {
      "id": "hqkwryb",
      "text": "Didn’t the cession get immediately followed by a few terrorist attacks from the south?",
      "timestamp": "2021-12-30 19:00:36",
      "score": 23,
      "num_children": 1,
      "author": 89005,
      "replies": [
        {
          "id": "hqky1kx",
          "text": "Yes, and it ended with the complete ass-whooping of the South. MTG and her white-hooded friends would do well to remember that.",
          "timestamp": "2021-12-30 19:08:44",
          "score": 28,
          "num_children": 4,
          "author": 26283,
          "replies": [
            {
              "id": "hqlac7y",
              "text": " Time for Sherman x2",
              "timestamp": "2021-12-30 20:28:29",
              "score": 16,
              "num_children": 3,
              "author": 251849,
              "replies": [
                {
                  "id": "hqlj2ty",
                  "text": "\"War is the remedy our enemies have chosen. Other simple remedies were within their choice. You know it and they know it, but they wanted war, and I say let us give them all they want...\" --W.T. Sherman",
                  "timestamp": "2021-12-30 21:25:49",
                  "score": 15,
                  "num_children": 0,
                  "author": 297220,
                  "replies": []
                },
                {
                  "id": "hqljpri",
                  "text": "Yep - fucken burn it",
                  "timestamp": "2021-12-30 21:30:00",
                  "score": 6,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hqqv8md",
                  "text": "As long as we spare Savannah again. It's amazingly liberal and unequivocally the only priceless city in my state.",
                  "timestamp": "2022-01-01 00:01:31",
                  "score": 2,
                  "num_children": 0,
                  "author": 114951,
                  "replies": []
                }
              ]
            },
            {
              "id": "hqlnxo4",
              "text": "If the ass whooping were truly complete we wouldn’t be in this mess.",
              "timestamp": "2021-12-30 21:57:37",
              "score": 11,
              "num_children": 1,
              "author": 74381,
              "replies": [
                {
                  "id": "hqnejzp",
                  "text": "The leaders weren't held accountable. Most of them - including JD - were pardoned. Bad mistake that we're seeing made again, on a smaller scale.",
                  "timestamp": "2021-12-31 05:50:23",
                  "score": 5,
                  "num_children": 1,
                  "author": 26283,
                  "replies": [
                    {
                      "id": "hqp5t9m",
                      "text": "Our country is going to continue to be a shithole until we figure out how accountability works.",
                      "timestamp": "2021-12-31 16:44:57",
                      "score": 2,
                      "num_children": 0,
                      "author": 40197,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hqlqir8",
              "text": "#ShermanDidntGoFarEnough",
              "timestamp": "2021-12-30 22:14:54",
              "score": 9,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hqm5jke",
              "text": "It actually wasn't a total ass whooping, in fact the south were winning at the start of the war. Their casualty rate was less than the north. The north won when their stronger industrial base eventually ramped up their arms and equipment production capability far beyond that of the south's, and capitalizing on some unforced strategic errors the south made.\n\nIt remains one of the bloodiest civil wars in human history, and the bad guys nearly won.",
              "timestamp": "2021-12-30 23:56:58",
              "score": 5,
              "num_children": 1,
              "author": 273601,
              "replies": [
                {
                  "id": "hqtyrgc",
                  "text": "The north legit never stopped it's westward expansion. Had they, it wouldn't have lasted a month. Ah well.",
                  "timestamp": "2022-01-01 18:25:54",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hqkyidq",
      "text": "It amazes me how these fucking lunatics get elected",
      "timestamp": "2021-12-30 19:11:45",
      "score": 19,
      "num_children": 1,
      "replies": [
        {
          "id": "hql3izf",
          "text": "She ran unopposed. The one person who _did_ run against her withdrew with some sketchy something. Looks like we should just go full businessman on the whole district: Shut it down, lay off all the inhabitants, and sell it off for parts.",
          "timestamp": "2021-12-30 19:43:48",
          "score": 14,
          "num_children": 1,
          "author": 92150,
          "replies": [
            {
              "id": "hqljy3q",
              "text": "I read that the democrat running against her was going through a divorce and dropped out.",
              "timestamp": "2021-12-30 21:31:32",
              "score": 7,
              "num_children": 1,
              "replies": [
                {
                  "id": "hqlzae9",
                  "text": "Traitor Green’s followers harassed her opponent and sent him threats of violence, which was a big factor in him dropping out",
                  "timestamp": "2021-12-30 23:14:08",
                  "score": 13,
                  "num_children": 0,
                  "author": 140588,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hqlk32g",
      "text": "General Sherman should have kept going.",
      "timestamp": "2021-12-30 21:32:27",
      "score": 14,
      "num_children": 0,
      "author": 185444,
      "replies": []
    },
    {
      "id": "hqmd5zh",
      "text": "As a Californian, I have to say I agree with her. The US needs California, California by and large does not need the US. \n\nThe United States as it stands now, is going down the shitter, and no amount of voting will change that. Republicans will drag the country into an abyss from which there is no return. \n\nI hold zero sentimentality to the idea that the US should stay together because of some misguided notions of “togetherness” and “aMeRiCa.”",
      "timestamp": "2021-12-31 00:50:03",
      "score": 12,
      "num_children": 0,
      "author": 379367,
      "replies": []
    },
    {
      "id": "hql0d69",
      "text": "\"If we can't steal the election for our dear leader, we'll just create a new country for him to be president of\"",
      "timestamp": "2021-12-30 19:23:36",
      "score": 10,
      "num_children": 0,
      "author": 91844,
      "replies": []
    },
    {
      "id": "hqlggoo",
      "text": "She's too dumb to realize that in the far right caliphate she is trying to create, her job will be to remain home, barefoot and pregnant, waiting for her jihadi husband to come home and tell her what her opinion is.",
      "timestamp": "2021-12-30 21:08:41",
      "score": 9,
      "num_children": 0,
      "author": 21964,
      "replies": []
    },
    {
      "id": "hqnazdm",
      "text": "I've written before about why a MAGA civil war would be a hilarious, albeit horrific, failure. Just for the lols, I'm going to repost this here.\n\n---\n\nI live in a MAGA state (Arkansas). MAGAts don't want to be Wermacht. You don't need to worry about that. They don't have the stomach for it. They want to be Einsatzgruppen. The Wehrmacht were actual military that conquered territory. They were hardened soldiers who had to suffer deprivation and put their lives at risk. The Einsatzgruppen were paramilitary groups that slept in comfy beds, had their morning coffee, and then went around already conquered areas terrorizing and committing mass exterminations, full well knowing they could run back behind the Wermacht's skirts if anyone really stood up to them.\n\nMAGAts and militia groups see themselves as Wermacht, but they're really just Einsatzgruppen. They aren't going to rise up and actually work together to make coordinated attacks. You can see that with the January 6th coup attempt. The Trump partisans' plans were pretty fucking weak. Ultimately, they were relying on the military or the police swinging their way and allowing them to just terrorize congress. When that didn't happen, they fell back on rioting and acts of petty terrorism.\n\nAnd even if there was an actual attempt at Civil War, the MAGA states would get curb stomped quickly for the same reason Rhett Butler told Ashley Wilkes the South would get curb stomped.\n\nFirst of all, the only contiguous MAGA region is the South. The rest of the MAGA movement are rural dwellers spread out thinly across large states, which makes them mobilizing pretty fucking unlikely.\n\n> Rhett Butler: I think it's hard winning a war with words, gentlemen.\n> \n> Charles Hamilton: What do you mean, sir?\n> \n> Rhett Butler: I mean, Mr. Hamilton, there's not a cannon factory in the whole South.\n> \n> Man: What difference does that make, sir, to a gentleman?\n\nSecond, the South has a lot of manufacturing now, but it's not exactly a hotbed of genius and innovation. The few bright spots in the South are stuff like NASA being in Alabama and Florida which has more to do with government funding and those being good locations for launches. Just like the MAGAts don't understand that Jim Bob boycotting Starbucks isn't probably hurting their business because Jim Bobs don't go to Starbucks anyway, they don't understand that the people who design all the drones and tanks and aircraft aren't morons. So they're either leaning liberal or they're the kind of conservative who isn't going to put their career on the line for a stupid temper tantrum.\n\n> Rhett Butler: No, I'm not hinting. I'm saying very plainly that the Yankees are better equipped than we. They've got factories, shipyards, coalmines... and a fleet to bottle up our harbors and starve us to death. All we've got is cotton, and slaves and... arrogance.\n> \n\nThird, the (lol) coastal elites own the fucking coasts. They own the fucking shipyards. The entire Pacific Coast fleet is in liberal enclave states. A large part of the Atlantic Coast fleet is docking and being built in places like New Jersey, New York, and other liberal enclaves.\n\nHere are the current active Naval Shipyards.\n\n\n|Shipyard|City|State|Year||Duties|\n|------------------|------------|----|------|---|------------------------------------------|\n| Norfolk NSY      | Portsmouth | VA | 1767 |   | Maintains ships of the Atlantic Fleet    |\n| Pearl Harbor NSY | Honolulu   | HI | 1908 |   | Maintains ships of the Pacific Fleet     |\n| Portsmouth NSY   | Kittery    | ME | 1800 |   | Maintains nuclear submarines             |\n| Puget Sound NSY  | Bremerton  | WA | 1901 |   | Decommissions nuclear-powered submarines |\n| Coast Guard Yard | Baltimore  | MD | 1899 |   | Maintains Coast Guard cutters and craft  |\n\nJust like in the Civil War, the South would essentially be a landlocked, low-income, low-education shithole going up against the full might of the US military. The few MAGAts that defected from higher levels of command wouldn't make up for the vast material differences in production, design, and access to resources that the non-MAGAt side would be able to bring to bear. And even if the South could keep its coasts unblockaded, which countries would risk the ire of the US government in trading with them. Who overseas likes MAGAts other than the Russians? And I think even Putin wouldn't risk arming them.\n\nAn actual attempt at a MAGAt uprising would be doomed to failure.",
      "timestamp": "2021-12-31 05:16:43",
      "score": 10,
      "num_children": 1,
      "author": 115967,
      "replies": [
        {
          "id": "hqrlbh8",
          "text": ">Einsatzgruppen\n\nand that texas-georgia-nc-arizona aint THAT RED   \n\n* as ukraine   (sedition at REAL dixie  its possible.... alabama/donetsk)\n* but sedition at tilt areas (odessa-zaporizhzia  ...  texas-georgia-arizona got rekt)\n* its better cz urkraine has the industry on their dixie  + their west its poor  ....  the us aint has this",
          "timestamp": "2022-01-01 03:33:03",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hql55eh",
      "text": "I'd like to divorce her from earth.",
      "timestamp": "2021-12-30 19:54:17",
      "score": 9,
      "num_children": 0,
      "author": 100829,
      "replies": []
    },
    {
      "id": "hqlh6lh",
      "text": "She makes Alex Jones look sane",
      "timestamp": "2021-12-30 21:13:26",
      "score": 10,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hql7oeu",
      "text": "Actually a terrific idea. A country of just blue states would rule. The red states would utterly collapse without the welfare from blue and we could just take care of our own.",
      "timestamp": "2021-12-30 20:11:00",
      "score": 36,
      "num_children": 4,
      "author": 409737,
      "replies": [
        {
          "id": "hqlk60u",
          "text": "A long, indefensible border with a failed terrorist theocracy may not turn out as good as you might think.",
          "timestamp": "2021-12-30 21:33:00",
          "score": 31,
          "num_children": 3,
          "author": 47694,
          "replies": [
            {
              "id": "hqlq3li",
              "text": "When they have no capital (it's all in CA, NY, WA, etc.) or weaponry (the majority of military installations are in blue states), yeah, that's not \"indefensible\" and we'd be okay.  \n\nPut war ships off each coast so supplies can be cut off and we'd have control of them very quickly when there's no food, gas, parts to supply machinery, etc.\n\nRemember how quickly Texas went into choas when their grid went down due to snow?! Yeah Texas would be the biggest leading hub of capital for the red states and they're obviously very precarious as is. They thrown into total chaos due to some flurries already!",
              "timestamp": "2021-12-30 22:12:03",
              "score": 23,
              "num_children": 2,
              "author": 148799,
              "replies": [
                {
                  "id": "hqpmi49",
                  "text": ">When they have no capital (it's all in CA, NY, WA, etc.) or weaponry (the majority of military installations are in blue states), yeah, that's not \"indefensible\" and we'd be okay.\n\nHave you ever heard of terrorist groups?\n\nOne I heard caused an entire war with just a few box cutters",
                  "timestamp": "2021-12-31 18:37:46",
                  "score": 1,
                  "num_children": 0,
                  "author": 104269,
                  "replies": []
                },
                {
                  "id": "hqsny4x",
                  "text": "precisely. If we ever needed to fight back Texas has shown some light sabotage would effectively do the trick.",
                  "timestamp": "2022-01-01 11:18:04",
                  "score": 1,
                  "num_children": 0,
                  "author": 370719,
                  "replies": []
                }
              ]
            },
            {
              "id": "hqllqr5",
              "text": "But it allows america to do what it does best, invading foreign lands to steal their oil.\n\nWith the added bonus that in this case they'd actually have a claim to it.",
              "timestamp": "2021-12-30 21:43:18",
              "score": 19,
              "num_children": 1,
              "author": 50292,
              "replies": [
                {
                  "id": "hqlu7lu",
                  "text": "I do love stealing oil.... You son of a bitch I'm in.",
                  "timestamp": "2021-12-30 22:39:41",
                  "score": 7,
                  "num_children": 0,
                  "author": 326243,
                  "replies": []
                }
              ]
            },
            {
              "id": "hqlqpq7",
              "text": "Nah, just invade and do it properly this time.\n\n***Finish*** Sherman's march to the sea.",
              "timestamp": "2021-12-30 22:16:13",
              "score": 14,
              "num_children": 1,
              "replies": [
                {
                  "id": "hqqijs5",
                  "text": "What do u mean by finish it?",
                  "timestamp": "2021-12-31 22:24:51",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hr2i7lf",
                      "text": "Ban confederate ideology better than Germany did after WW2.",
                      "timestamp": "2022-01-03 13:18:00",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hqup88s",
          "text": "Not an inch of America will be given to these traitors. They can leave to antartica but these cockroaches shouldn't take an inch of American land.",
          "timestamp": "2022-01-01 21:26:35",
          "score": 2,
          "num_children": 0,
          "author": 19629,
          "replies": []
        },
        {
          "id": "hqlgfy0",
          "text": "A shitty idea, because it also kills blue voters in the red states as well as the immunocompromised and the children in those states who are stuck at the mercy of the jackasses.",
          "timestamp": "2021-12-30 21:08:33",
          "score": 3,
          "num_children": 2,
          "author": 69529,
          "replies": [
            {
              "id": "hqli6nv",
              "text": "Don't worry, blue states will allow asylum for non-Qultists.",
              "timestamp": "2021-12-30 21:20:00",
              "score": 18,
              "num_children": 3,
              "author": 409737,
              "replies": [
                {
                  "id": "hqovyqd",
                  "text": "Guard at the border: “You want to enter the Blu-nited States, sir?”\n\nTired, filthy looking man with no shoes says, “Yesum.”\n\n“Please read the sign.” Guard points to a sign that says, “I think Hillary Clinton did nothing wrong.”\n\n“I think Hillary Clinton…” Man looks visibly upset. “…did nothing wrrr… Argh! She killed everyone at Benghazi!!!” Begins foaming at the mouth.\n\n“We found another one, boys. Take this one to the penal colony, too.”",
                  "timestamp": "2021-12-31 15:35:58",
                  "score": 4,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hqocjb7",
                  "text": "South Korea allows asylum for North Koreans, the question is whether their new govt would allow them to seek it.",
                  "timestamp": "2021-12-31 12:48:14",
                  "score": 2,
                  "num_children": 0,
                  "author": 120205,
                  "replies": []
                },
                {
                  "id": "hqof7l3",
                  "text": "People can’t afford to live in blue states, that’s why they’re all moving down here and raising my cost of living. But hopefully they vote!",
                  "timestamp": "2021-12-31 13:16:13",
                  "score": 0,
                  "num_children": 0,
                  "author": 99767,
                  "replies": []
                }
              ]
            },
            {
              "id": "hqmbrrk",
              "text": "As opposed to now?",
              "timestamp": "2021-12-31 00:40:16",
              "score": 6,
              "num_children": 0,
              "author": 379367,
              "replies": []
            }
          ]
        },
        {
          "id": "hqocejp",
          "text": "Think about the disenfranchised blue voters in the red states",
          "timestamp": "2021-12-31 12:46:47",
          "score": 1,
          "num_children": 0,
          "author": 120205,
          "replies": []
        }
      ]
    },
    {
      "id": "hqldtsc",
      "text": "Just because a state is blue that doesn’t mean every single person living in that state is a democrat. So they’d be screwing their own voters and it’s not so easy for republicans to do a mass exodus out of their state. My state California is a prime example; bunch of conservatives moved to Idaho, drove the real estate up, now the rest can’t afford to move there.",
      "timestamp": "2021-12-30 20:51:24",
      "score": 8,
      "num_children": 0,
      "author": 257339,
      "replies": []
    },
    {
      "id": "hql9bid",
      "text": "Blue state dweller here \n\nDone. \nMy taxes will drop by half. \nI’m done carrying the cost for these idiots. \n\nWhy is it that these states who take way more from the federal government than they pay in all talk about “fiscal conservatism?”\n\nFuck you. Pay your own way loser.",
      "timestamp": "2021-12-30 20:21:46",
      "score": 45,
      "num_children": 4,
      "author": 80893,
      "replies": [
        {
          "id": "hqlvkq3",
          "text": "No welfare except for corporations and red states!",
          "timestamp": "2021-12-30 22:48:47",
          "score": 11,
          "num_children": 0,
          "author": 397076,
          "replies": []
        },
        {
          "id": "hqmb1gn",
          "text": "I'm 100% on board with a peaceful dissolution of the union at this point. Let conservatives create the third world theocratic nightmare state of their dreams. Fence them off and marginalize their diseased worldview ad much as possible.\n\nIt won't be easy, it won't be particularly clear-cut in terms that of territorial identity, and dividing up military forces will be a bit of a nightmare, but this may very well be the best option at this point.\n\nI absolutely do not trust conservatives with the most basic civic responsibility at this point. I barely trust them to understand basic social contracts of civilization. I do not want you share a country with these people. I'm sure they feel the same. \n\nWhat do we have to gain in forcing a relationship that neither side wants?",
          "timestamp": "2021-12-31 00:35:17",
          "score": 20,
          "num_children": 1,
          "replies": [
            {
              "id": "hqmbo58",
              "text": "Same. We can’t even agree on scientific facts. The Republican states are too far gone for them to ever come back to reason & logic. \n\nPersonally, I’m fine with California going it alone and seceding by itself.",
              "timestamp": "2021-12-31 00:39:35",
              "score": 11,
              "num_children": 1,
              "author": 379367,
              "replies": [
                {
                  "id": "hqrkt5b",
                  "text": "imho\n\n\\- gave themf lorida\n\n\\- let them crate a florida theocracy\n\n\\-lets have a more normal country  (as ukraine... the hillibilly went to novorosiya / now u've more normalcy",
                  "timestamp": "2022-01-01 03:28:35",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hqmeji4",
          "text": "because those states have the most poor, and the most almost poor.",
          "timestamp": "2021-12-31 00:59:56",
          "score": 2,
          "num_children": 0,
          "author": 79324,
          "replies": []
        },
        {
          "id": "hqoeyut",
          "text": "As a lefty born and raised in a red state, this pisses me off every time I read it. Tons of people from blue states are currently moving here because they can no longer afford to live in their previous state.",
          "timestamp": "2021-12-31 13:13:49",
          "score": 1,
          "num_children": 1,
          "author": 99767,
          "replies": [
            {
              "id": "hqp5k6a",
              "text": "What you are referring to is the privileged groups that can simply take their skills and go anywhere. These are generally not liberal people, they are mostly libertarian leaning well off sorts moving from California to Texas. They aren't moving because they can't afford California anymore, they are moving because they made a bunch of money and now instead of paying it forward they want to move to a low tax state. These are the fuck you I got mine crowd.\n\nAlso, it's a myth that everyone is leaving blue states for red states. Washington state, my home, is as blue as it gets and has been a net gainer of interstate migration for over a decade now.",
              "timestamp": "2021-12-31 16:43:16",
              "score": 5,
              "num_children": 1,
              "author": 259087,
              "replies": [
                {
                  "id": "hqqfikk",
                  "text": "You have no idea the political leanings  of the people who are migrating to red states. All we can know is that they have enough money to move, which says little. I’m hoping they all come down here and vote blue. \n\nAnd it’s certainly not a myth [where I am](https://www.thestate.com/news/upstate/article253449029.html)\n\n“California, Connecticut, Illinois, Michigan, Maryland, New York, Ohio, and Pennsylvania also posted large in-migration numbers to the Upstate from 2012-2016. Although states such as New Hampshire and Rhode Island posted smaller in-migration numbers, it is noteworthy that the in-migration numbers have doubled from those two states, in comparison to 2011-2015.\n\nWhile most of these states are more densely populated than South Carolina, it is noteworthy that the Upstate’s cost of living is lower. In some cases, such as Manhattan in New York City, cost of living in the Upstate is as much as 88% lower.”",
                  "timestamp": "2021-12-31 22:02:28",
                  "score": 1,
                  "num_children": 0,
                  "author": 99767,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hqks9t1",
      "text": "Hmm we could have a Bosnia-Herzergovinia here if it were up to her.  Neighbors just used it as an excuse to steal stuff like TVs, cars, stoves, homes, children to sex as sex slaves and murder and rape.  So MTG is for theft, grand larceny, prostitution, murder and rape!",
      "timestamp": "2021-12-30 18:32:01",
      "score": 20,
      "num_children": 1,
      "author": 106376,
      "replies": [
        {
          "id": "hqkxxif",
          "text": "Now imagine this with 10x the population, 100x the land mass, and about 1000x the available firepower.",
          "timestamp": "2021-12-30 19:08:00",
          "score": 14,
          "num_children": 1,
          "author": 26283,
          "replies": [
            {
              "id": "hqkylro",
              "text": "Do we need to?  That Shit Show was Hell on Earth and if you survived you would have most likely died from alcoholism or drug use because you can't fix what happened.  Man you wanting me to get a gun just for protection from this scumbaggery.",
              "timestamp": "2021-12-30 19:12:22",
              "score": 9,
              "num_children": 3,
              "author": 106376,
              "replies": [
                {
                  "id": "hql0vir",
                  "text": ">Do we need to? \n\n1/3 of alleged adults in the USA are either actively working towards a fascist take-over or the nation, or are passively supporting it. Yeah, you need to.",
                  "timestamp": "2021-12-30 19:26:51",
                  "score": 14,
                  "num_children": 1,
                  "author": 26283,
                  "replies": [
                    {
                      "id": "hql3lj4",
                      "text": "Like I say Can't happen here?  Says Who?  Anything can happen anywhere at anytime.",
                      "timestamp": "2021-12-30 19:44:16",
                      "score": 4,
                      "num_children": 0,
                      "author": 106376,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hqkzjt0",
                  "text": "I own firearms for this exact reason, and this reason alone: to protect my peeps from alt-right wingnuts when they go all sedition on the rest of us.",
                  "timestamp": "2021-12-30 19:18:26",
                  "score": 13,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "hql02kn",
                      "text": "Exactly.",
                      "timestamp": "2021-12-30 19:21:46",
                      "score": 5,
                      "num_children": 0,
                      "author": 106376,
                      "replies": []
                    },
                    {
                      "id": "hqlji0z",
                      "text": "Absolutely",
                      "timestamp": "2021-12-30 21:28:36",
                      "score": 2,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hqla7qb",
                  "text": "You absolutely should buy a gun.",
                  "timestamp": "2021-12-30 20:27:39",
                  "score": 2,
                  "num_children": 0,
                  "author": 251849,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hqla2i7",
      "text": "Time to bring out the classics https://youtu.be/gvjOG5gboFU",
      "timestamp": "2021-12-30 20:26:41",
      "score": 7,
      "num_children": 1,
      "author": 293025,
      "replies": [
        {
          "id": "hqlf5nc",
          "text": "I knew in my heart what it was without even guessing. A classic indeed!",
          "timestamp": "2021-12-30 21:00:08",
          "score": 2,
          "num_children": 1,
          "author": 338401,
          "replies": [
            {
              "id": "hqop1gy",
              "text": "Lol",
              "timestamp": "2021-12-31 14:42:58",
              "score": 1,
              "num_children": 0,
              "author": 293025,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hqm2xhp",
      "text": "I'm actually 100% okay with this, but it has to be 100% peaceful. I don't know how long they would last given that the blue states have been subsidizing all the red states' shit for decades.",
      "timestamp": "2021-12-30 23:39:06",
      "score": 4,
      "num_children": 0,
      "author": 212341,
      "replies": []
    },
    {
      "id": "hqm55j8",
      "text": "I wish punching nazis/confederates/traitor was still a thing…",
      "timestamp": "2021-12-30 23:54:19",
      "score": 5,
      "num_children": 1,
      "author": 349885,
      "replies": [
        {
          "id": "hqpofj5",
          "text": "Be the change you want to see in the world!",
          "timestamp": "2021-12-31 18:50:51",
          "score": 1,
          "num_children": 0,
          "author": 15613,
          "replies": []
        }
      ]
    },
    {
      "id": "hqme43m",
      "text": "Daddy Sherman would like a word with Marjorie home state \n😈😈",
      "timestamp": "2021-12-31 00:56:49",
      "score": 6,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqmkl1h",
      "text": "America is simply 50 countries in a trench coat",
      "timestamp": "2021-12-31 01:44:56",
      "score": 6,
      "num_children": 0,
      "author": 106959,
      "replies": []
    },
    {
      "id": "hqlaxw6",
      "text": "So she is essentially advocating civil war.",
      "timestamp": "2021-12-30 20:32:29",
      "score": 12,
      "num_children": 0,
      "author": 201752,
      "replies": []
    },
    {
      "id": "hqkyw9u",
      "text": "I’m still very confused on how this works. Because if you move from a red state but are Republican to a blue state do you still need a cooling off period or not. Sorry I am not following her logic.",
      "timestamp": "2021-12-30 19:14:16",
      "score": 5,
      "num_children": 0,
      "author": 245152,
      "replies": []
    },
    {
      "id": "hqlikbu",
      "text": "Wow she literally thinks she invented secession. 🤦🏻‍♀️",
      "timestamp": "2021-12-30 21:22:28",
      "score": 4,
      "num_children": 0,
      "author": 182264,
      "replies": []
    },
    {
      "id": "hqlktnm",
      "text": "Careful what you wish for, Sloth Queen.",
      "timestamp": "2021-12-30 21:37:18",
      "score": 4,
      "num_children": 0,
      "author": 104777,
      "replies": []
    },
    {
      "id": "hqlnaxy",
      "text": "A country of just republican states would be poor and riddled with infrastructure issues. They would desperately rely on Texas, Florida and Georgia (Atlanta) for their tax revenue.",
      "timestamp": "2021-12-30 21:53:31",
      "score": 3,
      "num_children": 0,
      "author": 85542,
      "replies": []
    },
    {
      "id": "hqlup85",
      "text": "Republican states that suggest this, should put their money (of lack there of) where their mouth is and send back all federal aid beyond what they contributed.  Stop being welfare queens to Democrat run states.",
      "timestamp": "2021-12-30 22:42:56",
      "score": 3,
      "num_children": 0,
      "author": 259621,
      "replies": []
    },
    {
      "id": "hqlwyun",
      "text": "The problem remains that all states are shades of purple. California and Texas are both notorious for being redoubts for one party while still having strong elements of the other party among their voters.\n\nAnd this is just getting into Republican vs. Democrat which is a poor representation of what is actually popular. Nationwide, we also have strong favor for medical care for all, college for all, cancelling student debts, a higher minimum wage, massive reformation (if not abolition) of state and federal justice systems and so on. And none of these policies are supported by either party.",
      "timestamp": "2021-12-30 22:58:15",
      "score": 5,
      "num_children": 1,
      "author": 264568,
      "replies": [
        {
          "id": "hqmtcj0",
          "text": "Exactly why I think we should be able to have voting by policies as well.",
          "timestamp": "2021-12-31 02:51:05",
          "score": 3,
          "num_children": 0,
          "author": 309665,
          "replies": []
        }
      ]
    },
    {
      "id": "hqlzo78",
      "text": "They’ll be really sad when they find out red states don’t generate any revenue and once they lose their federal backing they’ll practically be living in third world countries. I say let them go. They’re basically the millstone around the country’s neck anyways. Maybe we could have a real modern society if we let these people rot in boonies and moved on.",
      "timestamp": "2021-12-30 23:16:45",
      "score": 4,
      "num_children": 0,
      "author": 314381,
      "replies": []
    },
    {
      "id": "hqm20jw",
      "text": "She’s from Dalton GA. If you’ve ever been there, it will start to make sense pretty quickly.",
      "timestamp": "2021-12-30 23:32:52",
      "score": 4,
      "num_children": 1,
      "author": 353838,
      "replies": [
        {
          "id": "hqn7vrg",
          "text": "She isn't from Dalton, she's from Milledgeville, and if you've ever been there it's pretty fuckin funny to know that's where she originated.",
          "timestamp": "2021-12-31 04:49:06",
          "score": 2,
          "num_children": 0,
          "author": 33629,
          "replies": []
        }
      ]
    },
    {
      "id": "hqm3pvn",
      "text": "[deleted]",
      "timestamp": "2021-12-30 23:44:32",
      "score": 3,
      "num_children": 1,
      "replies": [
        {
          "id": "hqn3aao",
          "text": "I strongly second this sentiment lol.",
          "timestamp": "2021-12-31 04:10:07",
          "score": 2,
          "num_children": 0,
          "author": 23557,
          "replies": []
        }
      ]
    },
    {
      "id": "hqmc3ae",
      "text": "Blue states always pay the bills while red states rack up the debts. If there’s a real divorce I’d like to see how those red states can manage themselves with uneducated masses and huge deficits.",
      "timestamp": "2021-12-31 00:42:31",
      "score": 4,
      "num_children": 0,
      "author": 242773,
      "replies": []
    },
    {
      "id": "hqmn3w5",
      "text": "Tough words from someone who had to move ten miles west because she couldn’t win an election where she lived.",
      "timestamp": "2021-12-31 02:03:49",
      "score": 3,
      "num_children": 0,
      "author": 140304,
      "replies": []
    },
    {
      "id": "hqnf35a",
      "text": "All the blue states acting like this is a bad thing.\n\nPLEASE divorce the states, as long as those in the south are free to come north. \n\nI’d rathe a country that is Half righ on all matters of human rights rather than together but all wrong because of a broken system, and you know you would too.",
      "timestamp": "2021-12-31 05:55:34",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqnqjv0",
      "text": "Blue states massively subsidize red states in federal tax dollars. A lot of these red states would not be able to pay for basic necessities like roads and bridges without the money they get from blue states.\n\nhttps://rockinst.org/wp-content/uploads/2021/01/2021-Balance-of-Payments-Report-web.pdf",
      "timestamp": "2021-12-31 08:03:12",
      "score": 4,
      "num_children": 0,
      "author": 404553,
      "replies": []
    },
    {
      "id": "hqlo4q5",
      "text": "When I was a kid, we had a dachshund that swallowed a chicken bone. It spent three days coughing before we realized what was going on.  Poor dog had bad breath because the bone started to decay.  Once we figured it out we took him to the vet.  They got the bone out without too much damage to his throat.  Cost us, like, $300.\n\nThat chicken bone is smarter than Marjorie Taylor Greene.  Not the dog.  He was a dumb ass.",
      "timestamp": "2021-12-30 21:58:56",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqlvy4u",
      "text": "conservatives always forget they got spanked last time they tried that",
      "timestamp": "2021-12-30 22:51:17",
      "score": 3,
      "num_children": 0,
      "author": 151997,
      "replies": []
    },
    {
      "id": "hqlvywb",
      "text": "Wrong Confederate flag. Put the all white flag up that they used, it says everything that needs to be said about them.",
      "timestamp": "2021-12-30 22:51:25",
      "score": 3,
      "num_children": 0,
      "author": 181879,
      "replies": []
    },
    {
      "id": "hqlzsnx",
      "text": "#BRING THE GOOD OLE BUGLE BOYS, WE’LL SING ANOTHER SONG!",
      "timestamp": "2021-12-30 23:17:36",
      "score": 3,
      "num_children": 0,
      "author": 237924,
      "replies": []
    },
    {
      "id": "hqm3uvy",
      "text": "Sure, I and every other rational capable person who lives in the South will just move out and further the brain drain.",
      "timestamp": "2021-12-30 23:45:31",
      "score": 3,
      "num_children": 0,
      "author": 259310,
      "replies": []
    },
    {
      "id": "hqm9ha1",
      "text": "Sometimes I think it would be nice to give them their Gilead and us some fucking peace. But it wouldn’t be long before their inevitably shitty economy and complete disregard of physical and social infrastructure led them to jealousy and war mongering.",
      "timestamp": "2021-12-31 00:24:14",
      "score": 3,
      "num_children": 1,
      "author": 102090,
      "replies": [
        {
          "id": "hqmn0ud",
          "text": "There's also that a good chunk of minority groups are in these areas and any split would be followed by them targeting us for mass violence.",
          "timestamp": "2021-12-31 02:03:13",
          "score": 3,
          "num_children": 1,
          "author": 281001,
          "replies": [
            {
              "id": "hqn3ulw",
              "text": "That is a solid point to the reality of it. My point is only that they would cock up their own fantasy version of things.\n\nEdit:grammar",
              "timestamp": "2021-12-31 04:14:46",
              "score": 1,
              "num_children": 0,
              "author": 102090,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hqm9nla",
      "text": "lmao taxes from blue states like CA basically keep some of those welfare and federal government dependent red states afloat.",
      "timestamp": "2021-12-31 00:25:27",
      "score": 3,
      "num_children": 0,
      "author": 214309,
      "replies": []
    },
    {
      "id": "hqmh69a",
      "text": "The awkward moment when all the major population and economic centers  of this new red confederacy are blue\n\nFuck off Margie from Dallas TX",
      "timestamp": "2021-12-31 01:19:20",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqmhyl1",
      "text": "I mean the US should just nationally divorce itself from existence.",
      "timestamp": "2021-12-31 01:25:10",
      "score": 3,
      "num_children": 0,
      "author": 345272,
      "replies": []
    },
    {
      "id": "hqmpblc",
      "text": "As a foreigner I'd love to see America weakened as a world power.  Maybe let each state have a referendum at least, I expect only the really far gone ones would be stupid enough to jump ship.  Oh.  Forgot I'm in the UK for a second there.  Goodbye Europe 😭",
      "timestamp": "2021-12-31 02:20:35",
      "score": 3,
      "num_children": 0,
      "author": 224744,
      "replies": []
    },
    {
      "id": "hqms2pk",
      "text": "The fascists are talking about something like the Partition in India, but in the U.S.",
      "timestamp": "2021-12-31 02:41:22",
      "score": 3,
      "num_children": 1,
      "author": 77349,
      "replies": [
        {
          "id": "hqnfqks",
          "text": "That would be the closest historical analogy by far. Hopefully it could be organized better...but likely it'd a similar bloodbath.",
          "timestamp": "2021-12-31 06:01:59",
          "score": 2,
          "num_children": 0,
          "author": 399525,
          "replies": []
        }
      ]
    },
    {
      "id": "hqoj4l8",
      "text": "I laughed so hard at “The Qunt”… that’s just fantastic",
      "timestamp": "2021-12-31 13:53:03",
      "score": 3,
      "num_children": 1,
      "author": 246399,
      "replies": [
        {
          "id": "hqpcppj",
          "text": "I also enjoy \"Trunt\"",
          "timestamp": "2021-12-31 17:31:30",
          "score": 1,
          "num_children": 0,
          "author": 49105,
          "replies": []
        }
      ]
    },
    {
      "id": "hqsfbim",
      "text": "I see headlines from European news yt vids and they sound really concerned for us. Looking at it objectively, it 'd be really concerning if all this was happening in any other country. I guess we've just been too used to it?",
      "timestamp": "2022-01-01 09:09:21",
      "score": 3,
      "num_children": 0,
      "author": 319512,
      "replies": []
    },
    {
      "id": "hqlgmvj",
      "text": "we did that once and the south is still feeling the effects of the loss.",
      "timestamp": "2021-12-30 21:09:49",
      "score": 2,
      "num_children": 1,
      "author": 295400,
      "replies": [
        {
          "id": "hqlrb6z",
          "text": "Not enough effects.",
          "timestamp": "2021-12-30 22:20:17",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hqlrjai",
      "text": "Ha. She wouldn’t want this. It would cause a financial crisis and therefore negatively impact all her investments in vaccine manufacturers that she’s trying to hide from her party.",
      "timestamp": "2021-12-30 22:21:46",
      "score": 2,
      "num_children": 0,
      "author": 392773,
      "replies": []
    },
    {
      "id": "hqluv4f",
      "text": "Lets fucking go then",
      "timestamp": "2021-12-30 22:44:01",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqm84sy",
      "text": "A \"divorce\" is to avoid war. They like to use the term because they think of America's federal government as the kid in the divorce, where each side carves up their respective states, and we share the federal government basically. So Texas does what Texas wants and California does what California wants, we go our separate ways, but we get together to wage war and stuff from time to time. I think this is dumb and would make civil war more likely, but I think this is what the people who talk about this stuff mean.",
      "timestamp": "2021-12-31 00:14:51",
      "score": 2,
      "num_children": 0,
      "author": 277724,
      "replies": []
    },
    {
      "id": "hqmal0c",
      "text": "How is that not sedition?",
      "timestamp": "2021-12-31 00:32:02",
      "score": 2,
      "num_children": 0,
      "author": 345935,
      "replies": []
    },
    {
      "id": "hqmdrpb",
      "text": "in their eyes, they were the union. I'm not kidding you.",
      "timestamp": "2021-12-31 00:54:22",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqmgqj1",
      "text": "Civil War 2, fuck the Boogaloos.",
      "timestamp": "2021-12-31 01:16:05",
      "score": 2,
      "num_children": 0,
      "author": 143668,
      "replies": []
    },
    {
      "id": "hqmj2gu",
      "text": "does that include trump who moved from ny to florida? Now that would be fine with me.",
      "timestamp": "2021-12-31 01:33:30",
      "score": 2,
      "num_children": 0,
      "author": 295400,
      "replies": []
    },
    {
      "id": "hqmkzvl",
      "text": "Agreed. The blue states can't keep funding the red states to be stupid.",
      "timestamp": "2021-12-31 01:48:03",
      "score": 2,
      "num_children": 0,
      "author": 315866,
      "replies": []
    },
    {
      "id": "hqmpe7t",
      "text": "HOW DOES SHE continue to get dumber and dumber???? Seriously?",
      "timestamp": "2021-12-31 02:21:09",
      "score": 2,
      "num_children": 0,
      "author": 125577,
      "replies": []
    },
    {
      "id": "hqmwhvw",
      "text": "Except this time it's in the best interest of the blue states to agree to this and really fucking stupid for the red states.\n\nAlmost every red state is subsidized by the blue states. Red states take more money from the federal government than they pay in taxes. Blue states pay more in than they get back. Except for New Mexico I think.\n\nBlue states create the vast majority of the GDP.\n\nBut more than any of that it's the red states holding everyone back from things like universal health care, tackling inequality, climate change initiatives, on and on. Basically everything that we want to do is being blocked by a minority mostly living in these states.\n\nSo let them go their own way. They are just holding everyone back. In a few decades they will be a 2nd world country full of corruption. Let the leopards eat their faces.",
      "timestamp": "2021-12-31 03:15:58",
      "score": 2,
      "num_children": 0,
      "author": 333759,
      "replies": []
    },
    {
      "id": "hqmymys",
      "text": "Come on everybody, you’re all getting mad at a drooling idiot for being a fucking savages moron. It’s not fair to be so mad.",
      "timestamp": "2021-12-31 03:32:53",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqn939l",
      "text": "I say they can have all the red areas but we keep all federal property. There is a reason the red areas are sparsely populated. No one wants to live near these fuckheads.",
      "timestamp": "2021-12-31 04:59:42",
      "score": 2,
      "num_children": 0,
      "author": 1512,
      "replies": []
    },
    {
      "id": "hqna3xz",
      "text": "I'm suggesting a National Divorce between Marjorie and the USA. And since she wants to re-enact historical events so badly just throw her into the Boston Harbor.",
      "timestamp": "2021-12-31 05:08:40",
      "score": 2,
      "num_children": 0,
      "author": 48123,
      "replies": []
    },
    {
      "id": "hqncxse",
      "text": "I sure wouldn't mind a GDP divorce between red and blue counties...",
      "timestamp": "2021-12-31 05:34:59",
      "score": 2,
      "num_children": 0,
      "author": 75264,
      "replies": []
    },
    {
      "id": "hqo7igw",
      "text": "Yes please. No more antivaxers or gun nuts or racist pricks!",
      "timestamp": "2021-12-31 11:48:24",
      "score": 2,
      "num_children": 0,
      "author": 139677,
      "replies": []
    },
    {
      "id": "hqohq7m",
      "text": "Red states want to split? You mean all of the poor, uneducated, welfare absorbing red states want to leave? Haha alright. Good luck.",
      "timestamp": "2021-12-31 13:40:16",
      "score": 2,
      "num_children": 0,
      "author": 408253,
      "replies": []
    },
    {
      "id": "hqpxeqm",
      "text": "... that's literally treason",
      "timestamp": "2021-12-31 19:52:34",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqsdbki",
      "text": "This particular wording of this is from a specific fascist screed:\n\n[https://americanmind.org/features/a-house-dividing/the-separation/](https://americanmind.org/features/a-house-dividing/the-separation/)\n\nI distinctly remember this because I wrote a whole thing mocking it. With context it's a lot worse.",
      "timestamp": "2022-01-01 08:40:54",
      "score": 2,
      "num_children": 0,
      "author": 149693,
      "replies": []
    },
    {
      "id": "hsrfz22",
      "text": "The best states are purple states",
      "timestamp": "2022-01-15 13:20:28",
      "score": 2,
      "num_children": 0,
      "author": 158868,
      "replies": []
    },
    {
      "id": "htn6yl9",
      "text": "Evilgelical jihad; Evilgelical Sharia law",
      "timestamp": "2022-01-21 20:13:26",
      "score": 2,
      "num_children": 0,
      "author": 173838,
      "replies": []
    },
    {
      "id": "hql41pj",
      "text": "Hey, you can hate someone without using gendered slurs against them",
      "timestamp": "2021-12-30 19:47:08",
      "score": -5,
      "num_children": 1,
      "author": 169344,
      "replies": [
        {
          "id": "hqm5em1",
          "text": "You probably don’t want go to to Australia then lmao",
          "timestamp": "2021-12-30 23:56:02",
          "score": 2,
          "num_children": 0,
          "author": 202735,
          "replies": []
        }
      ]
    },
    {
      "id": "hqkz5b5",
      "text": "And this point doesn't seem like a bad idea. problem is how do you split it?",
      "timestamp": "2021-12-30 19:15:53",
      "score": 0,
      "num_children": 1,
      "author": 63590,
      "replies": [
        {
          "id": "hql42kk",
          "text": "Send them all to texas and then chop it off like a gangrenous foot?",
          "timestamp": "2021-12-30 19:47:18",
          "score": 6,
          "num_children": 1,
          "author": 76634,
          "replies": [
            {
              "id": "hqu016i",
              "text": "I'd rather lose Florida",
              "timestamp": "2022-01-01 18:34:37",
              "score": 1,
              "num_children": 0,
              "author": 303269,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hql78az",
      "text": "She’s already divorced from reality.",
      "timestamp": "2021-12-30 20:08:00",
      "score": 1,
      "num_children": 0,
      "author": 149098,
      "replies": []
    },
    {
      "id": "hql9ndu",
      "text": "Yeah, why not?",
      "timestamp": "2021-12-30 20:23:55",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqlazsr",
      "text": "She probably didn't \"forget\"... she's never known.",
      "timestamp": "2021-12-30 20:32:49",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqlh2j6",
      "text": "Logged in just to upvote your post title",
      "timestamp": "2021-12-30 21:12:40",
      "score": 1,
      "num_children": 0,
      "author": 50531,
      "replies": []
    },
    {
      "id": "hqli82t",
      "text": "Will she just choke on a chicken bone already.",
      "timestamp": "2021-12-30 21:20:15",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqlk344",
      "text": "I mean the blue states have all the capital and larger economies than many entire countries, so go for hillbilly. \n\nWe'll cut off funds and starve you into submission like last time.",
      "timestamp": "2021-12-30 21:32:28",
      "score": 1,
      "num_children": 0,
      "author": 148799,
      "replies": []
    },
    {
      "id": "hqludi0",
      "text": "MTG needs to be removed from any government office asap. I can't stand that loony bin cunt.",
      "timestamp": "2021-12-30 22:40:46",
      "score": 1,
      "num_children": 0,
      "author": 402888,
      "replies": []
    },
    {
      "id": "hqly94c",
      "text": "Sure, what she says is anti American, but I'd love for those red states to try and fend for themselves given that blue states subsidize them.",
      "timestamp": "2021-12-30 23:06:58",
      "score": 1,
      "num_children": 0,
      "author": 356475,
      "replies": []
    },
    {
      "id": "hqlydbu",
      "text": "Should be amusing. I think they forgot they've been gerrymandering for years to artificially raise their political wins.\n\nAll those mostly empty red states will be interesting",
      "timestamp": "2021-12-30 23:07:47",
      "score": 1,
      "num_children": 0,
      "author": 286990,
      "replies": []
    },
    {
      "id": "hqlytoo",
      "text": "Down with the traitors and up with the stars, Majorie.",
      "timestamp": "2021-12-30 23:10:55",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqm19os",
      "text": "I'm okay with it.",
      "timestamp": "2021-12-30 23:27:43",
      "score": 1,
      "num_children": 0,
      "author": 287358,
      "replies": []
    },
    {
      "id": "hqm38ds",
      "text": "lol are they too afraid to use the word succeed??? i wonder why?",
      "timestamp": "2021-12-30 23:41:11",
      "score": 1,
      "num_children": 0,
      "author": 3237,
      "replies": []
    },
    {
      "id": "hqm5975",
      "text": "I am more than okay with letting the original Confederacy States secede into their own country.  We would lose the following: texas, louisiana, mississippi, alabama, georgia, florida, South and North Carolina, Virginia, Tennessee and Arkansas.  Let them go ahead and all those who want to stay with the Union move to other states.",
      "timestamp": "2021-12-30 23:55:01",
      "score": 1,
      "num_children": 1,
      "author": 359714,
      "replies": [
        {
          "id": "hqmne97",
          "text": "Virginia is largely blue now, and Georgia is purple. Replace them with Kentucky & West Virginia.",
          "timestamp": "2021-12-31 02:05:57",
          "score": 1,
          "num_children": 0,
          "author": 281001,
          "replies": []
        }
      ]
    },
    {
      "id": "hqm8vum",
      "text": "That oversized vote power in the senate isn’t worth much to states that secede. And all that positive cash flow from federal taxes dries up. And federal contracts go bye-bye. Plus secession worked out so well for Georgia last time. #FAFO",
      "timestamp": "2021-12-31 00:20:08",
      "score": 1,
      "num_children": 0,
      "author": 282932,
      "replies": []
    },
    {
      "id": "hqmap94",
      "text": "See what I mean?? Didn't they teach American history where this woman went to school? Specifically Civil War history??\n\nBeen there done that you stupid traitorous witch.\n\nBy the way....guess who will not be collecting alimony..ummm..I mean Federal $$ like Medicare/Social Security after the \"divorce\"?",
      "timestamp": "2021-12-31 00:32:51",
      "score": 1,
      "num_children": 0,
      "author": 165747,
      "replies": []
    },
    {
      "id": "hqmcc6n",
      "text": "Oh way down south in the land of traitors,",
      "timestamp": "2021-12-31 00:44:15",
      "score": 1,
      "num_children": 0,
      "author": 49562,
      "replies": []
    },
    {
      "id": "hqmhc59",
      "text": "Colors are for gangsters.",
      "timestamp": "2021-12-31 01:20:32",
      "score": 1,
      "num_children": 0,
      "author": 399342,
      "replies": []
    },
    {
      "id": "hqmkq77",
      "text": "[removed]",
      "timestamp": "2021-12-31 01:46:01",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "hqmqkfc",
          "text": "\"Let the Confederate traitors win the Civil War 150 years later\" is not something that flies here.",
          "timestamp": "2021-12-31 02:29:58",
          "score": 1,
          "num_children": 0,
          "author": 176442,
          "replies": []
        }
      ]
    },
    {
      "id": "hqmp9tf",
      "text": "I dont have a problem with it tbh. Why force a people unsatisfied with the majority rule when it only benefits the majority. I think they should be allowed to leave if they want to. No reason to fight over it imo. Let them be",
      "timestamp": "2021-12-31 02:20:14",
      "score": 1,
      "num_children": 0,
      "author": 286897,
      "replies": []
    },
    {
      "id": "hqmwfv9",
      "text": "I know Texas has a lot of guns, but just bring some snow machines and we'll be ok.",
      "timestamp": "2021-12-31 03:15:31",
      "score": 1,
      "num_children": 0,
      "author": 241730,
      "replies": []
    },
    {
      "id": "hqn2wrv",
      "text": "Can we just give em Texas and call it a day ...they can keep all the crazy in one place.",
      "timestamp": "2021-12-31 04:06:58",
      "score": 1,
      "num_children": 0,
      "author": 372680,
      "replies": []
    },
    {
      "id": "hqn56g8",
      "text": "The same hubris and ignorance that is killing them by the thousands won't allow them to look at what a disaster that would be big picture. Let's say we agree on an amicable split. We are going to get along, no one has to pay alimony. But what is the contingency plan for foreign interests? Who wouldn't love to have some bases so close to us? When the Saudis flooded the market with cheap oil, a lot of American wells had to be turned off, and many people were laid off. These people just love ignorant shit-talking, and it's embarrassing the kinds of dumbasses we have in our own Congress.",
      "timestamp": "2021-12-31 04:25:50",
      "score": 1,
      "num_children": 0,
      "author": 4720,
      "replies": []
    },
    {
      "id": "hqn6ra6",
      "text": "As the only Red state that pulls it's weight, I don't want this.",
      "timestamp": "2021-12-31 04:39:23",
      "score": 1,
      "num_children": 0,
      "author": 113884,
      "replies": []
    },
    {
      "id": "hqn6wd0",
      "text": "I say we do it then we build that wall trump wanted on the southern border of Virginia. I will even be happy to help pay for it.",
      "timestamp": "2021-12-31 04:40:38",
      "score": 1,
      "num_children": 0,
      "author": 4188,
      "replies": []
    },
    {
      "id": "hqn85b6",
      "text": "It’s okay. We can just send another general to burn down half her home state if it comes to that",
      "timestamp": "2021-12-31 04:51:22",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqnapqb",
      "text": "y’all if there is a divorce come save me, i live in the state (and used to live in the district) that Qaren represents 😭",
      "timestamp": "2021-12-31 05:14:13",
      "score": 1,
      "num_children": 0,
      "author": 129344,
      "replies": []
    },
    {
      "id": "hqnd7zl",
      "text": "Let them walk before they get hold of the nuclear codes again.",
      "timestamp": "2021-12-31 05:37:39",
      "score": 1,
      "num_children": 0,
      "author": 399525,
      "replies": []
    },
    {
      "id": "hqnki0h",
      "text": "If the red states split off into their own country you'd have people illegally immigrating into Mexico within 10 years.",
      "timestamp": "2021-12-31 06:51:30",
      "score": 1,
      "num_children": 1,
      "author": 98757,
      "replies": [
        {
          "id": "hqo7nmo",
          "text": "They would be dead before that. Think of all the shootings and antivaxers and people who die in child birth because no abortion. Point is I'd give it about 7 years max.",
          "timestamp": "2021-12-31 11:50:07",
          "score": 1,
          "num_children": 0,
          "author": 139677,
          "replies": []
        }
      ]
    },
    {
      "id": "hqnm80b",
      "text": "Do it again uncle billy",
      "timestamp": "2021-12-31 07:11:10",
      "score": 1,
      "num_children": 0,
      "author": 83600,
      "replies": []
    },
    {
      "id": "hqnya3i",
      "text": "Away down south in the land of traitors",
      "timestamp": "2021-12-31 09:44:36",
      "score": 1,
      "num_children": 0,
      "author": 289125,
      "replies": []
    },
    {
      "id": "hqo22r3",
      "text": "Well... if she thinks \"Northern Aggression\" was rough the last time, when her ancestors' cause went belly up... she should see our arsenal now.",
      "timestamp": "2021-12-31 10:36:30",
      "score": 1,
      "num_children": 0,
      "author": 307356,
      "replies": []
    },
    {
      "id": "hqoc9r3",
      "text": "If that happens I’ll pull a Sherman and go see the beaches of Georgia.",
      "timestamp": "2021-12-31 12:45:20",
      "score": 1,
      "num_children": 0,
      "author": 120205,
      "replies": []
    },
    {
      "id": "hqojy2v",
      "text": "We'll see how long they can last without blue state revenue",
      "timestamp": "2021-12-31 14:00:12",
      "score": 1,
      "num_children": 0,
      "author": 276883,
      "replies": []
    },
    {
      "id": "hqokqg1",
      "text": "What does “national divorce” even mean? Succession ? Civil war?",
      "timestamp": "2021-12-31 14:06:59",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqomi1z",
      "text": "Ugh, then we’re stuck bordering a third world country….",
      "timestamp": "2021-12-31 14:22:02",
      "score": 1,
      "num_children": 0,
      "author": 177134,
      "replies": []
    },
    {
      "id": "hqomxas",
      "text": "Um, we tried that already and THEY LOST!!! We're a good part into the next millennium and STILL they won't admit defeat. They tried it with the orange one, and it didn't work. They tried it on 1/6/21 and failed at it AGAIN. It's not that they can't admit defeat, they're just too fking STUPID to comprehend.",
      "timestamp": "2021-12-31 14:25:34",
      "score": 1,
      "num_children": 0,
      "author": 62539,
      "replies": []
    },
    {
      "id": "hqoojwq",
      "text": "I really do think that this will happen. Which is terrifying.",
      "timestamp": "2021-12-31 14:38:59",
      "score": 1,
      "num_children": 1,
      "author": 8933,
      "replies": [
        {
          "id": "hqopip1",
          "text": "Change is scary, but often for the best. Personally I’d like these traitors to shit or get off the pot. Many will die, but that’s inevitable at this point no matter what happens.",
          "timestamp": "2021-12-31 14:46:48",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "hqos9wl",
              "text": "I guess I can’t speak for those of you in the US but I know my government would immediately ally with the confederation. The idea is terrifying - the rise of fascism in the US has precipitated years of slowly removing our rights to protest (we can’t anymore) and to free speech (a man holding a sign against the government was recently bundled into a van and never seen again) and to ‘offend’ the government.",
              "timestamp": "2021-12-31 15:08:24",
              "score": 1,
              "num_children": 0,
              "author": 8933,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hqoq74g",
      "text": "Seeing how irredeemably lost a huuuge portion GOP/MAGA/Q crowd seem to be, doesn’t a « Q-xit » appear inevitable?",
      "timestamp": "2021-12-31 14:52:10",
      "score": 1,
      "num_children": 0,
      "author": 243135,
      "replies": []
    },
    {
      "id": "hqot6l7",
      "text": "Being from Massachusetts I would welcome that. My tax money wouldn’t go to providing emergency relief for states that want to secede.\nSee Texas",
      "timestamp": "2021-12-31 15:15:20",
      "score": 1,
      "num_children": 0,
      "author": 146281,
      "replies": []
    },
    {
      "id": "hqot9mw",
      "text": "Yeah, but this time their side WANTS violence and there will be much less clear battle lines. Who in the Blue states is actually going to sign up to fight this time around?",
      "timestamp": "2021-12-31 15:15:58",
      "score": 1,
      "num_children": 0,
      "author": 106296,
      "replies": []
    },
    {
      "id": "hqow145",
      "text": "I mean they can kindly fuck off America and live somewhere else but I doubt any other country would accept these fuckers.",
      "timestamp": "2021-12-31 15:36:27",
      "score": 1,
      "num_children": 0,
      "author": 40067,
      "replies": []
    },
    {
      "id": "hqozxzz",
      "text": "Good luck with that. If they got what they wanted, the Red States would become Mexico or something. Corrupt government and a weak economy. The red states depend on the blue states. Blue states may struggle a bit but will ultimately bounce back.",
      "timestamp": "2021-12-31 16:04:26",
      "score": 1,
      "num_children": 0,
      "author": 410685,
      "replies": []
    },
    {
      "id": "hqp3kfx",
      "text": "How tf does she still have a job?!?!? Goddamn",
      "timestamp": "2021-12-31 16:29:45",
      "score": 1,
      "num_children": 0,
      "author": 283974,
      "replies": []
    },
    {
      "id": "hqp5dmy",
      "text": "yawn.  Bring it, posers!\n\nyou crybabies spent 8 years of the obama administration promising this and just sat on your fat asses playing \"digital soldier\" and nothing has changed.  \n\nMTG is just trying to drain more armchair warrior conservatives wallets into her campaign fund.",
      "timestamp": "2021-12-31 16:42:04",
      "score": 1,
      "num_children": 0,
      "author": 17053,
      "replies": []
    },
    {
      "id": "hqp6cf2",
      "text": "She can obviously go to hell, but fascism isn’t a justification for misogyny. Calling any woman, regardless of who she is or what she stands for, a sexist slur isn’t okay.",
      "timestamp": "2021-12-31 16:48:34",
      "score": 1,
      "num_children": 0,
      "author": 17539,
      "replies": []
    },
    {
      "id": "hqp7ji8",
      "text": "The Union made a huge mistake when it didn’t bring all the Confederate Generals and politicians to trial for Treason and Sedition and hung them when found guilty. Let’s not make that mistake again…",
      "timestamp": "2021-12-31 16:56:40",
      "score": 1,
      "num_children": 0,
      "author": 315770,
      "replies": []
    },
    {
      "id": "hqp8b2t",
      "text": "Forgive me if this has been posted before, but this is some sad brainwashed delusional shit here:\n\nhttps://www.washingtonpost.com/arts-entertainment/2021/12/29/ted-koppel-mayberry-cbs-sunday-morning/\n\nTed Koppel ‘takes the political temperature’ in a town in North Carolina that may or may not have been an inspiration for Andy Griffith’s fictional Mayberry.",
      "timestamp": "2021-12-31 17:01:55",
      "score": 1,
      "num_children": 0,
      "author": 195029,
      "replies": []
    },
    {
      "id": "hqpgyow",
      "text": "She gets away with saying this crap, because she is independently wealthy, and from what I understand, her district is one of the wealthier districts. So, there are no consequences.",
      "timestamp": "2021-12-31 18:00:07",
      "score": 1,
      "num_children": 0,
      "author": 242413,
      "replies": []
    },
    {
      "id": "hqpoqlp",
      "text": "The Republicans won the last divorce, considering Democrats were the southern slaveowners.",
      "timestamp": "2021-12-31 18:52:56",
      "score": 1,
      "num_children": 2,
      "author": 128660,
      "replies": [
        {
          "id": "hqq6xva",
          "text": "The parties switched sides in the 1950's when Republicans adopted The Southern Strategy to attract votes from racist whites. What we see now is its culmination.",
          "timestamp": "2021-12-31 20:59:57",
          "score": 3,
          "num_children": 0,
          "author": 57011,
          "replies": []
        },
        {
          "id": "hqq9tew",
          "text": "Very cute for those barely acquainted with history, but perhaps it’s more important to remember that the conservatives lost and the liberals won.",
          "timestamp": "2021-12-31 21:20:39",
          "score": 2,
          "num_children": 0,
          "author": 27807,
          "replies": []
        }
      ]
    },
    {
      "id": "hqqgnf2",
      "text": "May they be dumb enough to try 🥂",
      "timestamp": "2021-12-31 22:10:50",
      "score": 1,
      "num_children": 0,
      "author": 310038,
      "replies": []
    },
    {
      "id": "hqqu8cf",
      "text": "Has ANYONE actually put forward some kind of way this would work? MN is blue but surrounded by generally red states. Is the “liberal” country going to be a country of the coasts with a few islands in the middle of the other country?\n\nThen there is the reality within the states. The most lopsided state in 2020 still had 1/3 vote for the loser. I’m sure all the blue cities will love going to Red Merica just like the rural areas will love joining Blue Merica. This would continue down to pockets within each region in all the states.\n\nUntil someone can delineate a plan for functional nation states to come from such a divorce this whole exercise is nothing more than onanism (and about as productive).",
      "timestamp": "2021-12-31 23:53:42",
      "score": 1,
      "num_children": 0,
      "author": 353309,
      "replies": []
    },
    {
      "id": "hqqu8lw",
      "text": "Honestly we should split it be awesome for the citizens of the neo-confederacy to finally see that their politicians don't give a shit about them, and whilst that's happening the blue states will pressure the ruling class into adopting socialism.",
      "timestamp": "2021-12-31 23:53:45",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hqr2ssa",
      "text": "Yea the alt right won last time lol",
      "timestamp": "2022-01-01 01:01:20",
      "score": 1,
      "num_children": 0,
      "author": 304119,
      "replies": []
    },
    {
      "id": "hqsodzj",
      "text": "OP forgets it was Republicans who won. Fuckin dumbass",
      "timestamp": "2022-01-01 11:24:35",
      "score": 1,
      "num_children": 1,
      "author": 95048,
      "replies": [
        {
          "id": "hqsx2lz",
          "text": "Republicans are the racist losers these daye...",
          "timestamp": "2022-01-01 13:22:40",
          "score": 1,
          "num_children": 1,
          "author": 57011,
          "replies": [
            {
              "id": "hqt0win",
              "text": "Yeah ok. Keep huffing your copium bud",
              "timestamp": "2022-01-01 14:03:33",
              "score": 1,
              "num_children": 1,
              "author": 95048,
              "replies": [
                {
                  "id": "hqtat3k",
                  "text": "Bye, Trumpian dumbass.",
                  "timestamp": "2022-01-01 15:32:54",
                  "score": 1,
                  "num_children": 0,
                  "author": 57011,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hqvph4y",
      "text": "\"let's split the nation in two administrative regions, that will make things run smoother\" -someone in 285 ce",
      "timestamp": "2022-01-02 01:47:54",
      "score": 1,
      "num_children": 0,
      "author": 395392,
      "replies": []
    },
    {
      "id": "ht0suu6",
      "text": "[removed]",
      "timestamp": "2022-01-17 09:58:27",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "ht0wxa8",
          "text": "This time the Republicans are the evil ones, good will triumph like always",
          "timestamp": "2022-01-17 10:53:38",
          "score": 1,
          "num_children": 0,
          "author": 57011,
          "replies": []
        }
      ]
    },
    {
      "id": "hqm4zbu",
      "text": "Fastest way to have Russia planting nukes on North American soil.\n\nE: downvotes haha. Y'all that dense to realize reds will look to Putin for military aide?",
      "timestamp": "2021-12-30 23:53:09",
      "score": -2,
      "num_children": 1,
      "replies": [
        {
          "id": "hqsk960",
          "text": "What?",
          "timestamp": "2022-01-01 10:22:17",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hqujdz5",
              "text": "Two nations. Who do y'all think Qpublicans will look to for support other than Russia?",
              "timestamp": "2022-01-01 20:46:22",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hqult8p",
                  "text": "Ohhhhhh, I misunderstood what you meant. I think the others that downvoted you did, too.",
                  "timestamp": "2022-01-01 21:02:59",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hqmtopa",
      "text": "Gawd Biden needs to find a way to fix all this divide",
      "timestamp": "2021-12-31 02:53:44",
      "score": -4,
      "num_children": 0,
      "author": 309665,
      "replies": []
    }
  ]
}