{
  "id": "rv8j3r",
  "text": "Does doing that stop false sexual harassment claims?\n",
  "timestamp": "2022-01-03 18:34:40",
  "score": 590,
  "subreddit": "t5_2zaj2",
  "num_children": 30,
  "author": 13767,
  "replies": [
    {
      "id": "hr4gpsw",
      "text": "Looks like someone just learnt the F word",
      "timestamp": "2022-01-03 21:11:39",
      "score": 58,
      "num_children": 1,
      "author": 25769,
      "replies": [
        {
          "id": "hr8866b",
          "text": "She uses the F word six times among other bad language and insults. However demands others to stay professional.\n\nSo obviously, behaving correctly will not prevent false accusations.",
          "timestamp": "2022-01-04 16:16:43",
          "score": 19,
          "num_children": 0,
          "author": 350249,
          "replies": []
        }
      ]
    },
    {
      "id": "hr4ha3c",
      "text": "I love this double standard.\n\nIf women don't want to be alone with/mentor men, well, she's a woman and it's her right and should be respected.\n\nIf a man doesn't want to mentor a woman, he should grow up and get over it. \n\nIf they didn't have double standards, they wouldn't have any.\n\nNote: You don't owe women SHIT. Don't let them shame you for setting boundaries.",
      "timestamp": "2022-01-03 21:15:18",
      "score": 181,
      "num_children": 1,
      "author": 23708,
      "replies": [
        {
          "id": "hr4pvao",
          "text": "[deleted]",
          "timestamp": "2022-01-03 22:10:26",
          "score": -1,
          "num_children": 2,
          "replies": [
            {
              "id": "hr4rbdy",
              "text": "Not the point.\n\nMen are wary of false allegations. They have a right to be. They also have a right to protect themselves from them. Also, as I said, men don't owe women shit. If we don't want to mentor you, we shouldn't have to. The reason shouldn't matter, and boundaries should be respected.",
              "timestamp": "2022-01-03 22:19:58",
              "score": 68,
              "num_children": 1,
              "author": 23708,
              "replies": [
                {
                  "id": "hr4rxf9",
                  "text": "[deleted]",
                  "timestamp": "2022-01-03 22:23:55",
                  "score": -2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hr4x8d4",
                      "text": "> The point is to create a safe space where everyone can learn and grow together?\n\nThe point is to work, actually.  To generate economic value.  That always involves risks.  \n\nYour job isn’t your school, where they coddle you and wipe your ass and seem to feel some duty to make you feel “safe” and look after your feelings.  Men and women risk sexual harassment going to work and being around sexual people.  Men and women take risks getting out of bed in the morning.  And yes, it is reasonable that people have some protection against sexual harassment.  But when we go overboard, and there is no due process?  When a certain percentage of people are nuts, malicious, etc, and you create an environment where the incentives are all aligned with believing whatever said bad actor says?  Then those “well intentioned” protections become a cudgel, and the risk to reward ratio of bothering with mentorship goes out the window.  \n\nI mentor a younger and coincidentally very attractive junior engineer at work right now.  And I thank god it’s all remote, over Zoom, recorded, and that I control the recordings.  We’ve had sessions for about a year now and would likely keep in touch after one of us leaves the company.  But would I ever meet up with her 1:1 in person with all this woke shit in the workplace?  100% not.  Not even for coffee or lunch or whatever.  Just not worth the risk.  She’s already been trained and indoctrinated to cry “sexism” at fairly ordinary stuff that young engineers face (senior engineers not always liking your ideas, people talking over each other in meetings, management not wanting to give you huge raises each year just because you set the world on fire with your two years out of college awesomeness, etc).  Why would I, a middle aged and very successful engineer, take that risk just to do some free labor the company doesn’t really care about anyways?  And if she (or you) don’t like that, “too fucking bad”.\n\nWhy is it far lefties are always in denial about the secondary/tertiary consequences of their politics?",
                      "timestamp": "2022-01-03 22:59:02",
                      "score": 38,
                      "num_children": 1,
                      "author": 44527,
                      "replies": [
                        {
                          "id": "hr59a2x",
                          "text": "Lefties need a monster to justify their whole existence. Someone to \"fight against\". Once racism has been mostly dealt with, they needed a new enemy. \nAnd also they have their whole careers and tons of money at stake. They have no desire to lose it all.",
                          "timestamp": "2022-01-04 00:21:36",
                          "score": 18,
                          "num_children": 0,
                          "author": 394886,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hr4rpmh",
              "text": "That’s a anecdotal incident irrelevant to why the stat is so high men are scared to work with women in case anything gets misunderstood this also means they can’t really joke around & have some banter like they would with guys.\n\nThey will also fear of the women just making shit up easy Money for her & it’s the end of him.",
              "timestamp": "2022-01-03 22:22:31",
              "score": 17,
              "num_children": 1,
              "author": 251789,
              "replies": [
                {
                  "id": "hr4sunm",
                  "text": "[deleted]",
                  "timestamp": "2022-01-03 22:30:01",
                  "score": 0,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hr4u91h",
                      "text": "It is irrelevant your personal experience isn’t why men don’t want to work with women I explained it clearly.\n\n60% of men aren’t uncomfortable because of a few bad men that’s why some women are uncomfortable. Men are uncomfortable because of the risks for normal good working business men.\n\nMen who want to keep themselves safe should never be alone with a women at work.",
                      "timestamp": "2022-01-03 22:39:14",
                      "score": 23,
                      "num_children": 0,
                      "author": 251789,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hr4nnr1",
      "text": "What’s funny is she doesn’t realize she’s providing a great example as to why this might be the case. Who would want to mentor someone who thinks like that?",
      "timestamp": "2022-01-03 21:56:10",
      "score": 75,
      "num_children": 1,
      "author": 234341,
      "replies": [
        {
          "id": "hr63xp3",
          "text": "With an attitude like that, sounds like a real fking nightmare.",
          "timestamp": "2022-01-04 03:57:12",
          "score": 22,
          "num_children": 1,
          "author": 205989,
          "replies": [
            {
              "id": "hssn98s",
              "text": "An attitude that says “please don’t rape, touch, or make comments about me.”\n\n*attitude*.",
              "timestamp": "2022-01-15 18:27:35",
              "score": 1,
              "num_children": 0,
              "author": 12518,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hr55eg7",
      "text": "The solution is obvious. Have deeper investigations into all rape claims and imprison the woman whose claims are revealed to be false. That's all it takes to solve this problem.",
      "timestamp": "2022-01-03 23:54:45",
      "score": 32,
      "num_children": 2,
      "replies": [
        {
          "id": "hr5a2hh",
          "text": "Maybe. But nobody will do it - feminists will instantly badmouth the person who will dig deeper and question their words, demanding proofs.",
          "timestamp": "2022-01-04 00:27:01",
          "score": 21,
          "num_children": 1,
          "author": 394886,
          "replies": [
            {
              "id": "hr7ecj9",
              "text": "That's true. But we need to consider all of the negative consequences that allowing false rape claims to go unpunished will inevitably cause. \n\n[Less than a year ago, I vented about one of my fears of this.](https://www.reddit.com/r/TrueUnpopularOpinion/comments/m59ydj/feminism_is_driving_the_human_race_to_war_and_we/)\n\nWhat will allowing false rape claims lead to? Let me explain more of my fears of the consequences of letting them happen.\n\nMen would be living under the Sword of Damocles. Feminists would be just itching for an excuse to kill the nearest man and when that happens, the man would have no more than two choices. Let himself be killed or defend himself, and I don't mean in court.\n\nAnd what happens if it gets to the point where false rape claims are made on a daily basis? Men will have nothing to lose and what would that lead to? Let's not say the answer to that.\n\nThe consequnces of investigating false rape claims are harsh, yes. But the consequences of letting them happen would be far worse, for both men and women. It has to be stopped before it's too late.",
              "timestamp": "2022-01-04 12:23:05",
              "score": 8,
              "num_children": 1,
              "replies": [
                {
                  "id": "hr7evtk",
                  "text": "Who will do this and how? \nTo do this from a political side is to commit a political suicide - nobody will elect you next time. And you'll have a bad reputation and a buck of fake rape claims the next morning you'll start to take steps in that direction.",
                  "timestamp": "2022-01-04 12:28:35",
                  "score": 2,
                  "num_children": 1,
                  "author": 394886,
                  "replies": [
                    {
                      "id": "hr7ge92",
                      "text": "I think it's a political suicide either way. Would you vote for a politician who allows false rape claims after what happened in recent years? Be honest.\n\nAt least there's women out there who protest against false rape, if only a few.\n\nFalse rape claims aren't rare. In fact, they're becoming more common. The r/SupportForTheAccused subreddit proves this. \n\nWith the fact that false rape claims are on the rise and we are reaching the point that daily false rape claims will be inevitable, answer me this:\n\nAt this point, what have men got to lose by fighting false rape claims?",
                      "timestamp": "2022-01-04 12:43:46",
                      "score": 3,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "hr7geze",
                          "text": "Here's a sneak peek of /r/SupportForTheAccused using the [top posts](https://np.reddit.com/r/SupportForTheAccused/top/?sort=top&t=year) of the year!\n\n\\#1: [Pour one out for a victory for a fallen brother](https://i.redd.it/dgivbbelhrd61.jpg) | [16 comments](https://np.reddit.com/r/SupportForTheAccused/comments/l5qrgk/pour_one_out_for_a_victory_for_a_fallen_brother/)  \n\\#2: [About to go to jail for rape I did not commit. Counseling question.](https://np.reddit.com/r/SupportForTheAccused/comments/kqf6qm/about_to_go_to_jail_for_rape_i_did_not_commit/)  \n\\#3: [POS woman FALSELY accuses 5 men for kidnapping and gangraping her.](https://i.redd.it/z9imoeea1qc61.jpg) | [1 comment](https://np.reddit.com/r/SupportForTheAccused/comments/l2d121/pos_woman_falsely_accuses_5_men_for_kidnapping/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
                          "timestamp": "2022-01-04 12:43:59",
                          "score": 2,
                          "num_children": 0,
                          "author": 110046,
                          "replies": []
                        },
                        {
                          "id": "hr7hxdy",
                          "text": "Politicians don't want their electorate to think like that. So... Instead of saying \"I won't check if rape accuses are legit or fake\" they word it out like \"I will provide the support for the victims of rape\". And I'm not in the States, but it sounds like both Dems and Republicans have nothing to offer and it's time to break the two-party system.\n\nMen have pretty much nothing to lose, but they don't want to be ostracized by our currently extremely woke and infantile society. Plus they have jobs and wives and they don't want to lose them.",
                          "timestamp": "2022-01-04 12:58:31",
                          "score": 1,
                          "num_children": 1,
                          "author": 394886,
                          "replies": [
                            {
                              "id": "hr7jhww",
                              "text": "I'm not in the US either. I'm British.\n\nYou're right, men don't have anything to lose anymore, but they already are ostracized.\n\nAnd the odds are, they're gonna lose their jobs and wives no matter what.\n\nthe point I'm trying to make is this: If false rape and misandry in general isn't tackled politically, what will happen next? Vigilantism. Then where are we?\n\nFeminism is only motivated by hate and schadenfreude. Let a politcal movement like that grow like the cancerous tumor that it is, what happens next?",
                              "timestamp": "2022-01-04 13:13:04",
                              "score": 2,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hr7l1gh",
                                  "text": "Young generation of men staying the hell away from women. Advanced \"red flag\" criterias when it comes to dating. Ability to sniff out feminists from miles away.",
                                  "timestamp": "2022-01-04 13:26:48",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 394886,
                                  "replies": [
                                    {
                                      "id": "hr7meo6",
                                      "text": "[And according to feminists, saying \"no\" to a woman's offer of sex is rape, apparently.](https://thoughtcatalog.com/anne-gus/2014/06/when-he-says-no-denying-a-woman-sex-is-rape/)",
                                      "timestamp": "2022-01-04 13:38:34",
                                      "score": 2,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hr7oeoo",
                                          "text": "I see sarcasm written all over it. No means no, right?",
                                          "timestamp": "2022-01-04 13:55:02",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 394886,
                                          "replies": [
                                            {
                                              "id": "hr7p6e9",
                                              "text": "Not if a man's saying it. You see sarcasm, I see truth. I wish this was satire, but this is feminism we're talking about.",
                                              "timestamp": "2022-01-04 14:01:15",
                                              "score": 2,
                                              "num_children": 0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hst1sje",
          "text": "I completely agree with you. I think false accusations should be taken more seriously as they are very much capable of ruining people’s lives, and I agree that there should be consequences for people who falsely accuse others. However, people often forget how rare the chance of being falsely accused is. You are more likely to be sexually assaulted as a man then falsely accused. The false allegation figure is estimated to be 0.5% (in 2018). In addition, a lot of the people who falsely accuse others have a long history of lying or something similar. The chance of you being falsely accused out of the blue is very very unlikely.",
          "timestamp": "2022-01-15 20:01:40",
          "score": 0,
          "num_children": 1,
          "replies": [
            {
              "id": "ht184l0",
              "text": ">people often forget how rare the chance of being falsely accused is. You are more likely to be sexually assaulted as a man then falsely accused.\n\nThat is simply not true. A few short minutes scrolling through r/SupportForTheAccused will prove you wrong. It's far too easy to lose count of the number of victims of FR there.",
              "timestamp": "2022-01-17 13:06:28",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "htm9so7",
                  "text": "https://www.channel4.com/news/factcheck/factcheck-men-are-more-likely-to-be-raped-than-be-falsely-accused-of-rape\n\nThere are multiple studies and statistics which show that men are much more likely to be raped then falsely accused of rape. I linked one, which is a quick and easy read, above. I am also happy to send you more studies if you were like. Statistically men are more likely to be raped then falsely accused of rape. While data may not be perfect considering a lot of rape (and I am guessing false accusations too!) cases go unreported, it is not a minor statistical difference, and so very clearly true, even if the numbers are not absolutely exact. I am glad there is a subreddit for victims of false accusations and I do genuinely believe it is a problem, but (statistically) it is very clearly not a bigger problem then sexual assault, and considering the rarity of being falsely accused, it is not something anyone should be concerned about randomly happening to them (I guess unless they are a celebrity for whom false accusations are often more common). \n\nI’m referring to percentages. Yes, I entirely believe that some people’s lives have been ruined by false accusations, as you said, we can see this by all the reports on that subreddit. But more men’s lives have been ruined by rape then being falsely accused of rape. This is not to say that the number of people who have been falsely accused are negligible, of course they are not, we are on a planet of over 7 billion people. \n\n1 in 6 American women are a victim of rape in their lifetime, and 1 in 33 men. Do you mean to tell me that for every 33 men you know in real life, at least 1 has been falsely accused of rape? \n\nNot only all of that, you are **15 times** more likely to be falsely accused of murder then falsely accused of rape, yet I much more often see people worrying about getting accused of rape (or other sexual assault) then murder.\n\nThat said, if you have any articles from a legitimate source with statistics showing that you are more likely to be falsely accused of rape then be a victim of rape, as you said, feel free to send them to me.",
                  "timestamp": "2022-01-21 16:50:29",
                  "score": 0,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hr41vf4",
      "text": "Welp, someone's berserk button got pushed!",
      "timestamp": "2022-01-03 19:37:57",
      "score": 23,
      "num_children": 1,
      "author": 250768,
      "replies": [
        {
          "id": "hr4cep7",
          "text": "It's a red head.",
          "timestamp": "2022-01-03 20:43:59",
          "score": 11,
          "num_children": 0,
          "author": 380134,
          "replies": []
        }
      ]
    },
    {
      "id": "hr55cwv",
      "text": "That’s just the 60% who will admit it to a survey.  The number is FAR higher \n\nIt’s not that fucking hard.  Just don’t use false rape accusations and “believe all women” to assuage your regret at sleeping your way up the totem pole.  \n\nGrow the fuck up.  You’re exhausting.",
      "timestamp": "2022-01-03 23:54:27",
      "score": 27,
      "num_children": 0,
      "author": 412974,
      "replies": []
    },
    {
      "id": "hr4vsp7",
      "text": "Ironically, she's providing a great example of why men don't want to mentor women. If I had an employee with this kind of entitled bitch attitude, I wouldn't want to mentor her either.",
      "timestamp": "2022-01-03 22:49:29",
      "score": 33,
      "num_children": 0,
      "author": 304941,
      "replies": []
    },
    {
      "id": "hr3rsjo",
      "text": "[removed]",
      "timestamp": "2022-01-03 18:36:24",
      "score": 76,
      "num_children": 3,
      "replies": [
        {
          "id": "hr42o27",
          "text": "Exactly",
          "timestamp": "2022-01-03 19:42:53",
          "score": 14,
          "num_children": 0,
          "author": 209471,
          "replies": []
        },
        {
          "id": "hr4fmo0",
          "text": "Exactly what I would do. With the current trend of false accusations and no real gender quotas in my country (yay, something we don't suck at!), I would simply not hire any women. You can't openly tell them it's because of their sex, but you can always find a way to not hire them.",
          "timestamp": "2022-01-03 21:04:35",
          "score": 24,
          "num_children": 2,
          "replies": [
            {
              "id": "hr68i0p",
              "text": "they're \"not a good fit\" for the company/position.",
              "timestamp": "2022-01-04 04:32:12",
              "score": 7,
              "num_children": 0,
              "author": 311133,
              "replies": []
            },
            {
              "id": "hssn4hb",
              "text": "lmao you are retarded",
              "timestamp": "2022-01-15 18:26:44",
              "score": 1,
              "num_children": 0,
              "author": 12518,
              "replies": []
            }
          ]
        },
        {
          "id": "hr63361",
          "text": "If I was in such position I rather find another job with less of that shit. Pretty sure all men will start dodging this type of interactions that need too much care. Hope the industry realize how far things are going.",
          "timestamp": "2022-01-04 03:50:53",
          "score": 5,
          "num_children": 0,
          "author": 11233,
          "replies": []
        }
      ]
    },
    {
      "id": "hr61dib",
      "text": "WPT is just a circlejerk of losers, it literally costs brain cells to read their posts",
      "timestamp": "2022-01-04 03:38:13",
      "score": 8,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hr5jgtx",
      "text": "Thank god people in the comments are calling her dumbass out. It's surprising for that braindead sub. Kinda sad it got 19k updoots tho",
      "timestamp": "2022-01-04 01:32:44",
      "score": 6,
      "num_children": 0,
      "author": 217413,
      "replies": []
    },
    {
      "id": "hr5cb97",
      "text": "Misandry is the new virtue signaling.",
      "timestamp": "2022-01-04 00:42:41",
      "score": 17,
      "num_children": 0,
      "author": 256140,
      "replies": []
    },
    {
      "id": "hr4zjld",
      "text": "Women lie and make false allegations regularly. They also regularly lie about how often they make false allegations.",
      "timestamp": "2022-01-03 23:14:41",
      "score": 13,
      "num_children": 1,
      "replies": [
        {
          "id": "hst2eag",
          "text": "[removed]",
          "timestamp": "2022-01-15 20:05:43",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hst3qo8",
              "text": "Here is mine: https://digitalcommons.lmu.edu/cgi/viewcontent.cgi?referer=&httpsredir=1&article=2216&context=llr\n\nWhere is the support for your 0.5% stat?",
              "timestamp": "2022-01-15 20:14:36",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hr680b3",
      "text": "Places don't want to hire women because of women like her.",
      "timestamp": "2022-01-04 04:28:18",
      "score": 7,
      "num_children": 0,
      "author": 69434,
      "replies": []
    },
    {
      "id": "hr6jcwl",
      "text": "Leave it to a woman to announce how easy it is to be a man.",
      "timestamp": "2022-01-04 06:07:00",
      "score": 7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hr7b428",
      "text": "Losers? \n\nDo they ever stop embarrassing themselves? Creating false accusations is the biggest self embarrassment in the universe, and super detrimental to the dignity. They are the losers. Are they brainless enough to understand that they humiliate themselves this disgusting way? I am a lady and I don't understand why would someone cause this brutal pain to a gentleman who does anything possible to make their life beautiful and desirable. If you have endeavoured to do good to your partner but they have hurt you that way, you are the heroes and they are the broken. However, don't lose hope, there are good, well behaved women, who would be on your side and will support you and relieve you.\nKarma will punish the false accusers. Karma is a bitch and is real.",
      "timestamp": "2022-01-04 11:47:58",
      "score": 3,
      "num_children": 1,
      "replies": [
        {
          "id": "hr7dvi6",
          "text": "They do this when they well know they have nothing to lose.\n\nAccuse your male coworker of sexual harassment, but make sure you don't press charges, otherwise you risk to be found lying. Limit yourself to accuse him publicly and just by that he'll lose his job and will have a hard time finding a new one.",
          "timestamp": "2022-01-04 12:18:13",
          "score": 3,
          "num_children": 1,
          "author": 136516,
          "replies": [
            {
              "id": "hr7fb45",
              "text": "And then be afraid of Karma, because the higher spiritual powers cannot be lied to. No evil remains unpunished. I hope every day for justice for you. You are such good people. You deserve divine loved ones in your lives.\n\nThey will always have something to lose. Their dignity and morality for instance.",
              "timestamp": "2022-01-04 12:32:54",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hr59gb5",
      "text": "Not really, because nothing prevents feminists at work from crying sexism anyway at any movement and word they are displeased to hear.",
      "timestamp": "2022-01-04 00:22:47",
      "score": 8,
      "num_children": 0,
      "author": 394886,
      "replies": []
    },
    {
      "id": "hr4g1bk",
      "text": "Keep your tits covered up, keep your pants lose and skirts decently long, and stop flirting to get ahead.",
      "timestamp": "2022-01-03 21:07:13",
      "score": 20,
      "num_children": 1,
      "replies": [
        {
          "id": "hr4qcx4",
          "text": "[deleted]",
          "timestamp": "2022-01-03 22:13:41",
          "score": 0,
          "num_children": 3,
          "replies": [
            {
              "id": "hr4ykvj",
              "text": "You seem to be dragging your personal experience (that we have no way of knowing is real or not) all up and down this post’s comments.  \n\nYou can “proof by anecdote” all day, but there is a reason [it’s a logical fallacy](https://en.wikipedia.org/wiki/Anecdotal_evidence).   It also comes off as disingenuous and makes you look like a bad faith actor.  \n\n> Take responsibility and change\n\nWe did?  Men changed into not mentoring women in the workplace.  \n\n“Actions, meet my good friend Consequences!”",
              "timestamp": "2022-01-03 23:08:08",
              "score": 14,
              "num_children": 0,
              "author": 44527,
              "replies": []
            },
            {
              "id": "hr4zamy",
              "text": "I missed the part where this is my problem.",
              "timestamp": "2022-01-03 23:13:00",
              "score": 9,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hr4yxgw",
              "text": "Cause of you ain’t selling don’t advertise. It’s trashy and if you project trash you attract trash men. You do your part before screaming at men. All the laws protect you not us.",
              "timestamp": "2022-01-03 23:10:29",
              "score": 4,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hr7ftl1",
      "text": "For someone who apparently doesn’t like getting fucked she says fuck a lot don’t you think?😂😂",
      "timestamp": "2022-01-04 12:38:04",
      "score": 5,
      "num_children": 1,
      "author": 17216,
      "replies": [
        {
          "id": "hr93eo8",
          "text": "Confession through projection........",
          "timestamp": "2022-01-04 19:38:11",
          "score": 2,
          "num_children": 0,
          "author": 250768,
          "replies": []
        }
      ]
    },
    {
      "id": "hr8grb0",
      "text": "I’ll never understand how these chicks spend hours doing their makeup and picking a shirt that shoes just enough cleavage but then get pissed when a man does what is natural and looks! Hell, even *I* notice a woman who is dressed nicely and showing her body and I’m a straight female!!!",
      "timestamp": "2022-01-04 17:13:03",
      "score": 4,
      "num_children": 0,
      "author": 303807,
      "replies": []
    },
    {
      "id": "hr86ytw",
      "text": "I'm gunna go out on a limb and say it's because of this attitude men don't want to mentor women.  Like why would I want to mentor someone this nasty and reacts this way?  Fucking WHY!?\n\nToo many of these types have horrible reactions to stuff and show you why the opinion in the first place is held.  \n\nIt's liek that 50 somethign percent of men won't date a feminists, and thousands of feminists  retweeted it with these vial responses.  This is why you clowns!",
      "timestamp": "2022-01-04 16:08:35",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hr8bzrn",
      "text": "Ladies, here's the brutal reality: You are not worth the risk. Men owe you nothing, not even our time. You have to earn it through effort, determination, drive, responsibility, respect and professionalism. \n\nEven then, it is at OUR discretion whom we want to mentor, guide, teach or communicate with...on OUR terms.\n\nThe world owes you nothing. Not even a thought. Posts like this only reinforce our hesitancy to teach you.\n\nI'm so glad she posted this. I'm sure her coworkers will now treat her like a leper. This post alone assures me that no one will want to be in a room alone with her....further proving our point. Her career is over. She's radioactive now. No one will even try to get near her.",
      "timestamp": "2022-01-04 16:41:51",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hr8lpel",
      "text": "Keep our dicks in our pants, and shut up about how you dress? Then maybe don't dress like you're ready to take a dick.\n\nOf course men should be professional at the workplace, but that's a two way street. If you dress like a stripper you're going to get treated like one.",
      "timestamp": "2022-01-04 17:44:47",
      "score": 2,
      "num_children": 0,
      "author": 45072,
      "replies": []
    },
    {
      "id": "hr6tysj",
      "text": "No. It prevents real ones.",
      "timestamp": "2022-01-04 08:08:20",
      "score": 1,
      "num_children": 0,
      "author": 4734,
      "replies": []
    },
    {
      "id": "hr7sipf",
      "text": "For generations when one realized that they were probably not going to realize all their dreams they had a 'mid-life crisis'.  And they did something stupid/young to bring back those feelings of invincibility or possibility.  They bought something expensive they really couldn't afford, had sex with someone they shouldn't, travel to exotic places, got a new job/career.\n\nBut these last few generations are full of people whose expectations where set stupidly high by SM, they're incredibly self centered and never really learned about delayed gratification.  So the crash is harder and they are willing to burn the world down to get what they are 'owed'.\n\nAdd to that a womans ability to completely destroy a man with an accusation of sexual harrassment, or rape (the definition of which now includes complimenting how she looks), and they wonder why men with something to lose want nothing to do with them professionally.",
      "timestamp": "2022-01-04 14:27:28",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hr854bq",
      "text": "And this is why we are uncomfprtable",
      "timestamp": "2022-01-04 15:56:17",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hr8ednm",
      "text": "Then quit teasing men and keep YOUR hands to yourself and do us a favor and keep your legs closed.",
      "timestamp": "2022-01-04 16:57:26",
      "score": 1,
      "num_children": 0,
      "author": 86537,
      "replies": []
    },
    {
      "id": "hr8mnd7",
      "text": "Male manager here with several women on his team. I stay as physically long distant as possible at all times and keep detailed notes of what is discussed in our routine 1:1’s. No room to  hide fake inappropriate quotes when the meeting agenda was packed with work items and their responses are noted. \n\nBuuuut it also means that they don’t get to organically add their pursuits to the conversation and I try to avoid giving any of them more responsibilities than the others. It limits their growth but it’s just not safe for me.",
      "timestamp": "2022-01-04 17:50:46",
      "score": 1,
      "num_children": 0,
      "author": 348931,
      "replies": []
    },
    {
      "id": "hrllxgw",
      "text": "Someone got out of bed on the wrong side this morning.",
      "timestamp": "2022-01-07 05:27:24",
      "score": 1,
      "num_children": 0,
      "author": 121695,
      "replies": []
    },
    {
      "id": "hsry8z2",
      "text": "False sexual harrasment claims are extremely rare. They do happen, and its a problem, but dont pretend as if its even slightly likely to happen to you.",
      "timestamp": "2022-01-15 15:43:55",
      "score": 1,
      "num_children": 0,
      "author": 406448,
      "replies": []
    },
    {
      "id": "hst0ovu",
      "text": "You are more likely as a man to be sexually assaulted yourself then falsely accused.",
      "timestamp": "2022-01-15 19:54:16",
      "score": 1,
      "num_children": 0,
      "replies": []
    }
  ]
}