{
  "id": "s2of69",
  "text": "How ironic\n",
  "timestamp": "2022-01-13 02:47:56",
  "score": 696,
  "subreddit": "t5_2zaj2",
  "num_children": 13,
  "replies": [
    {
      "id": "hsgs97z",
      "text": "I was yesterday spending some free time reading r/FemaleDatingStrategy. God, how much hate towards men some women have there. Its definitely a sickness being so extremist in any sense.",
      "timestamp": "2022-01-13 08:56:22",
      "score": 59,
      "num_children": 4,
      "author": 26066,
      "replies": [
        {
          "id": "hsh64y1",
          "text": "i vomit whenever i read the posts.",
          "timestamp": "2022-01-13 11:58:01",
          "score": 17,
          "num_children": 1,
          "author": 359095,
          "replies": [
            {
              "id": "hsrmb9s",
              "text": "Is this not extreme? Or are you being satirical?",
              "timestamp": "2022-01-15 14:15:13",
              "score": 1,
              "num_children": 1,
              "author": 29221,
              "replies": [
                {
                  "id": "hsrmkxj",
                  "text": "why do you think it is extreme?",
                  "timestamp": "2022-01-15 14:17:22",
                  "score": 1,
                  "num_children": 0,
                  "author": 359095,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hshcpkd",
          "text": "They’re the female version of misogynistic men who still use women for sex",
          "timestamp": "2022-01-13 13:05:09",
          "score": 14,
          "num_children": 1,
          "replies": [
            {
              "id": "hss08og",
              "text": "Not really. FDS doesn't say anywhere you should be using men for sex. It says you wanna look for a valuable man before having sex with him. Of course none of the redditors in here would understand.",
              "timestamp": "2022-01-15 15:57:49",
              "score": -2,
              "num_children": 3,
              "author": 271724,
              "replies": [
                {
                  "id": "hss5j0d",
                  "text": "You’re an FDS member, that explains a lot",
                  "timestamp": "2022-01-15 16:33:08",
                  "score": 4,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hsvguo9",
                  "text": "No, I’ve seen enough FDS to know that their idea of a valuable man is “Rich, thinks of you as a goddess and always agrees with you, spends their life being a feminist and always pays for everything”.  And in fact, one of the top posts there is making fun of a guy who got used for sex by his date.\n\nI mean cmon, in that sub they literally call all men “Scrotes” and constantly trash on them.  How do you not see the problem there?",
                  "timestamp": "2022-01-16 07:00:54",
                  "score": 2,
                  "num_children": 0,
                  "author": 1683,
                  "replies": []
                },
                {
                  "id": "hswfe06",
                  "text": "Yeah.  We know.",
                  "timestamp": "2022-01-16 13:59:56",
                  "score": 0,
                  "num_children": 0,
                  "author": 227146,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hsstzhk",
          "text": "well the first step is admitting to it",
          "timestamp": "2022-01-15 19:10:54",
          "score": 2,
          "num_children": 0,
          "author": 113711,
          "replies": []
        },
        {
          "id": "hsrmc8y",
          "text": "Which is no different than this sub",
          "timestamp": "2022-01-15 14:15:25",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hsfqvwx",
      "text": "I saw a feminist respond to this by saying “well it’s usually not an informed no”. Well that’s just like when a girl rejects a guy for sex and he says something like “but I have a big dick” or “but I eat pussy so well”.",
      "timestamp": "2022-01-13 02:49:36",
      "score": 65,
      "num_children": 3,
      "replies": [
        {
          "id": "hsgrfle",
          "text": "\"You don't know how sex **with ME** feels like\"",
          "timestamp": "2022-01-13 08:45:19",
          "score": 33,
          "num_children": 1,
          "author": 287753,
          "replies": [
            {
              "id": "hshcq5j",
              "text": "Pretty much",
              "timestamp": "2022-01-13 13:05:17",
              "score": 17,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hsujycf",
          "text": "How do you compare pressuring someone for sex to arguing an ideology? Also, someone responding to a post saying “well it’s usually not an informed no” on Reddit and a guy asking a girl for sex and she saying no and him trying to convince here IN REAL LIFE are very different.",
          "timestamp": "2022-01-16 02:16:07",
          "score": 2,
          "num_children": 0,
          "author": 286247,
          "replies": []
        },
        {
          "id": "hst2706",
          "text": "i mean, the idea of feminism isn’t comparable at all to sex, so it just goes to show how little you know about both.",
          "timestamp": "2022-01-15 20:04:21",
          "score": -1,
          "num_children": 1,
          "author": 169517,
          "replies": [
            {
              "id": "hst4ry5",
              "text": "How?",
              "timestamp": "2022-01-15 20:21:23",
              "score": 2,
              "num_children": 1,
              "replies": [
                {
                  "id": "hst6bs1",
                  "text": "feminism is an ideology that is trying to advance the rights of women, while sex is intercourse between people. make as many similes and metaphors as you like, but the real world is full of real people who can see right through it and know it’s all bullshit. that “hate” you think you feel against you is just society not accepting your stupid theories.",
                  "timestamp": "2022-01-15 20:31:48",
                  "score": -2,
                  "num_children": 1,
                  "author": 169517,
                  "replies": [
                    {
                      "id": "hsthd42",
                      "text": "What stupid theories? I don’t have stupid theories. Also when did I say there was hate towards me?",
                      "timestamp": "2022-01-15 21:47:15",
                      "score": 2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hstj93m",
                          "text": "dude, you’ve posted anti women and pro abortion shit nonstop for months. you can’t pull the “i think women think im good” card bro.",
                          "timestamp": "2022-01-15 22:00:20",
                          "score": -4,
                          "num_children": 1,
                          "author": 169517,
                          "replies": [
                            {
                              "id": "hstro6i",
                              "text": "Anti woman? No, anti feminism and anti abortion. You have it twisted. Being against bad women isn’t the same as being against all women. Also I’m literally a woman myself so…",
                              "timestamp": "2022-01-15 22:57:37",
                              "score": 2,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hsts7d7",
                                  "text": "being a woman doesn’t mean you can’t be sexist. you think you are holding back generations of progress by posting memes on reddit. not only are you sexist, you really are plain dumb too.",
                                  "timestamp": "2022-01-15 23:01:12",
                                  "score": 0,
                                  "num_children": 2,
                                  "author": 169517,
                                  "replies": [
                                    {
                                      "id": "hsttif8",
                                      "text": "How am I being sexist or holding back progress? I never once said women shouldn’t have equal rights, did I? Feminism doesn’t have a monopoly on equality. I consider myself an egalitarian instead.",
                                      "timestamp": "2022-01-15 23:10:12",
                                      "score": 3,
                                      "num_children": 0,
                                      "replies": []
                                    },
                                    {
                                      "id": "hstttl6",
                                      "text": "So disliking misandrist women and being against letting women kill their unborn makes me a sexist? That’s some Olympic level mental gymnastics",
                                      "timestamp": "2022-01-15 23:12:22",
                                      "score": 3,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hstupiv",
                                          "text": "i’m not going to argue with someone who thinks they can stop people from getting abortions. it’s like convincing an ant they can stop a boulder rolling towards them. time will pass and your way of thinking and living will be forgotten, society will advance like it always does, and all your fighting will be for nothing. all i want is for people to be more comfortable having less people like you around annoying them in the meantime.",
                                          "timestamp": "2022-01-15 23:18:30",
                                          "score": 1,
                                          "num_children": 2,
                                          "author": 169517,
                                          "replies": [
                                            {
                                              "id": "hstuv53",
                                              "text": "Killing your own babies isn’t very advanced. And what do you mean by people like me? People who aren’t okay with killing babies? Also yes I can and will stop people from getting abortions as much as possible",
                                              "timestamp": "2022-01-15 23:19:34",
                                              "score": 2,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "hstvbas",
                                                  "text": "but you won’t. you literally won’t. unless you put your hand on every single pregnant woman’s vagina and mouth, you won’t. you can make all your hilarious memes and posts. but people are going to get abortions. people are gonna have sex. equality will come eventually. you aren’t going to stop any of that. it’s just funny to see you try.",
                                                  "timestamp": "2022-01-15 23:22:44",
                                                  "score": 0,
                                                  "num_children": 2,
                                                  "author": 169517,
                                                  "replies": [
                                                    {
                                                      "id": "hstvlav",
                                                      "text": "I can’t do that but I can discourage them from getting an abortion, tell them about their other options, and educate them about fetal development. Also abortion is the opposite of equality. When did I say I don’t want equality? I literally never said that. I’m literally an egalitarian.",
                                                      "timestamp": "2022-01-15 23:24:39",
                                                      "score": 2,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "hstw0wv",
                                                          "text": "you won’t though. if someone wants an abortion, some random lady posting outdated memes isn’t going to change their mind lmfao others aren’t as weak minded and easily manipulated as you.",
                                                          "timestamp": "2022-01-15 23:27:39",
                                                          "score": 0,
                                                          "num_children": 1,
                                                          "author": 169517,
                                                          "replies": [
                                                            {
                                                              "id": "hstw5k8",
                                                              "text": "When abortion becomes illegal it will change their mind.",
                                                              "timestamp": "2022-01-15 23:28:31",
                                                              "score": 2,
                                                              "num_children": 1,
                                                              "replies": [
                                                                {
                                                                  "id": "hstxkmx",
                                                                  "text": "it hasn’t anywhere else in the world though, why would it work here?",
                                                                  "timestamp": "2022-01-15 23:38:16",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "author": 169517,
                                                                  "replies": [
                                                                    {
                                                                      "id": "hstz72m",
                                                                      "text": "Well it might not disappear completely but the rates will go down, that’s just common sense that when something is illegal less people do it. Also by your logic, since abortion still happens when it’s illegal, we might as well not have any laws at all since people will break them anyway.",
                                                                      "timestamp": "2022-01-15 23:49:25",
                                                                      "score": 2,
                                                                      "num_children": 1,
                                                                      "replies": [
                                                                        {
                                                                          "id": "hstzj17",
                                                                          "text": "riiiiiigt, sort of how since drugs are illegal, NO ONE sells or buys or does drugs, noooo those numbers are WAAAAAAAY down",
                                                                          "timestamp": "2022-01-15 23:51:40",
                                                                          "score": 1,
                                                                          "num_children": 1,
                                                                          "author": 169517,
                                                                          "replies": [
                                                                            {
                                                                              "id": "hstzqj4",
                                                                              "text": "I never said that. Yeah drugs are illegal but people still do them. Does that mean we should be making meth and crack legal? Also if you legalized drugs, more people would do them, that’s common sense.",
                                                                              "timestamp": "2022-01-15 23:53:07",
                                                                              "score": 2,
                                                                              "num_children": 1,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "hsu0all",
                                                                                  "text": "yes, other counties legalized drugs, which reduced overdose deaths, increased rehabilitation rates, and protected people from buying laced drugs. the point is, if people want something, they’re going to do whatever it takes to get it. there’s certain things that are useless to ban, as it harms more people than it helps.",
                                                                                  "timestamp": "2022-01-15 23:57:06",
                                                                                  "score": 0,
                                                                                  "num_children": 1,
                                                                                  "author": 169517,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "hsu0km4",
                                                                                      "text": "People who do drugs aren’t hurting anyone but theirselves. Baby murderers don’t deserve safety. If she dies, that’s kind of on her.",
                                                                                      "timestamp": "2022-01-15 23:59:04",
                                                                                      "score": 2,
                                                                                      "num_children": 1,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "hsu1hla",
                                                                                          "text": "so you don’t care about people. you dont care if 2 people die, because in that case 1 person doesn’t get to live, you want more people dead. don’t pretend to care about lives when you’re asking for deaths like that. also, would you be interested in funding foster children programs and adoption programs that actually work, no matter how expensive it is, and no matter how high out taxes are? if you care about the kids, you care that they get taken care of well, right?",
                                                                                          "timestamp": "2022-01-16 00:05:20",
                                                                                          "score": 1,
                                                                                          "num_children": 3,
                                                                                          "author": 169517,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "hsu1wkn",
                                                                                              "text": "Yes I would be interested in funding foster and adoption programs. I see nothing wrong with that.",
                                                                                              "timestamp": "2022-01-16 00:08:13",
                                                                                              "score": 2,
                                                                                              "num_children": 1,
                                                                                              "replies": [
                                                                                                {
                                                                                                  "id": "hsu2sk9",
                                                                                                  "text": "hey at least we can agree on something. but why should anti abortion laws pass before the child care laws. there are so many children already screwed in the system, why would we want to pump in an influx of new unwanted babies when there are teens without homes? your priorities don’t make sense.",
                                                                                                  "timestamp": "2022-01-16 00:14:37",
                                                                                                  "score": 0,
                                                                                                  "num_children": 1,
                                                                                                  "author": 169517,
                                                                                                  "replies": [
                                                                                                    {
                                                                                                      "id": "hsu47zz",
                                                                                                      "text": "Hold the phone, babies put up for adoption don’t go into foster care, they get adopted. There are far more people who want to adopt an baby than there are babies up for adoption. 75% of kids in foster care aren’t up for adoption. Also, most people looking to adopt don’t want a teenager, most people looking to adopt want a baby or toddler.",
                                                                                                      "timestamp": "2022-01-16 00:24:49",
                                                                                                      "score": 2,
                                                                                                      "num_children": 1,
                                                                                                      "replies": [
                                                                                                        {
                                                                                                          "id": "hsu4o95",
                                                                                                          "text": "both systems are privatized and therefore are broken beyond repair due to not being regulated enough by the government, fixing one problem fixes the other as babies go unadopted or are abandoned, leading them to lives as orphans in the foster system.",
                                                                                                          "timestamp": "2022-01-16 00:28:00",
                                                                                                          "score": 1,
                                                                                                          "num_children": 3,
                                                                                                          "author": 169517,
                                                                                                          "replies": [
                                                                                                            {
                                                                                                              "id": "hsu4z8y",
                                                                                                              "text": "Babies don’t go unadopted, what don’t you understand? There are 36 people who want to adopt a baby for every 1 baby put up for adoption. The waiting list to adopt a baby takes 2-7 years to go through. No baby is unwanted, just because the biological mother doesn’t want it doesn’t mean somebody else won’t.",
                                                                                                              "timestamp": "2022-01-16 00:30:12",
                                                                                                              "score": 2,
                                                                                                              "num_children": 1,
                                                                                                              "replies": [
                                                                                                                {
                                                                                                                  "id": "hsu60h1",
                                                                                                                  "text": "yea, and are the background checks always done well for all of these adoptions? 15% of adoptions end because the parent can’t sustain the child, which then gets put into *drum roll* THE FOSTER CARE SYSTEM",
                                                                                                                  "timestamp": "2022-01-16 00:37:24",
                                                                                                                  "score": 1,
                                                                                                                  "num_children": 1,
                                                                                                                  "author": 169517,
                                                                                                                  "replies": [
                                                                                                                    {
                                                                                                                      "id": "hsufuzt",
                                                                                                                      "text": "Sorry I needed to be more specific, 36 screened people. Also if one couple / person can’t adopt it, someone else will. Claiming you care about someone while simultaneously saying they’d be better off dead is a prime example of cognitive dissonance.",
                                                                                                                      "timestamp": "2022-01-16 01:47:07",
                                                                                                                      "score": 1,
                                                                                                                      "num_children": 0,
                                                                                                                      "replies": []
                                                                                                                    }
                                                                                                                  ]
                                                                                                                }
                                                                                                              ]
                                                                                                            },
                                                                                                            {
                                                                                                              "id": "hsus971",
                                                                                                              "text": "You claim banning abortion won’t decrease abortion rates at all yet also claim it’ll put more kids in the foster care system? Which is it? Those two statements are literally mutually exclusive",
                                                                                                              "timestamp": "2022-01-16 03:16:27",
                                                                                                              "score": 1,
                                                                                                              "num_children": 0,
                                                                                                              "replies": []
                                                                                                            },
                                                                                                            {
                                                                                                              "id": "hsusbhf",
                                                                                                              "text": "You say banning abortion won’t decrease abortion rates at all yet it’ll also put more kids in the foster care system?",
                                                                                                              "timestamp": "2022-01-16 03:16:42",
                                                                                                              "score": 1,
                                                                                                              "num_children": 0,
                                                                                                              "replies": []
                                                                                                            }
                                                                                                          ]
                                                                                                        }
                                                                                                      ]
                                                                                                    }
                                                                                                  ]
                                                                                                }
                                                                                              ]
                                                                                            },
                                                                                            {
                                                                                              "id": "hsu1yfz",
                                                                                              "text": "No I don’t want more people dead, that’s a strawman argument. Also you admit that abortion kills a baby yet you’re still pro choice? Sickening",
                                                                                              "timestamp": "2022-01-16 00:08:35",
                                                                                              "score": 2,
                                                                                              "num_children": 1,
                                                                                              "replies": [
                                                                                                {
                                                                                                  "id": "hsu2xqk",
                                                                                                  "text": "no i’m just using your own logic to show you how stupid it is. you rather the mom and the “baby” die than just the baby. you dont care about saving any lives.",
                                                                                                  "timestamp": "2022-01-16 00:15:38",
                                                                                                  "score": 0,
                                                                                                  "num_children": 1,
                                                                                                  "author": 169517,
                                                                                                  "replies": [
                                                                                                    {
                                                                                                      "id": "hsu3zyz",
                                                                                                      "text": "Well I’d rather nobody die. Also the baby is innocent, the mom is guilty.",
                                                                                                      "timestamp": "2022-01-16 00:23:13",
                                                                                                      "score": 2,
                                                                                                      "num_children": 1,
                                                                                                      "replies": [
                                                                                                        {
                                                                                                          "id": "hsu4dyl",
                                                                                                          "text": "it doesn’t matter. they’re gonna do it anyways. do you want to save lives or not?",
                                                                                                          "timestamp": "2022-01-16 00:25:59",
                                                                                                          "score": 1,
                                                                                                          "num_children": 1,
                                                                                                          "author": 169517,
                                                                                                          "replies": [
                                                                                                            {
                                                                                                              "id": "hsu4qyt",
                                                                                                              "text": "Of course I do. Also, a lot of women will be discouraged if abortion is illegal. The current abortion rate is about 20-25% of women have one. Do you really think 20-25% of women are unhinged enough to stick a coat hanger up their vagina? Also, if they died every time having a coat hanger abortion, only women with a death wish would do it.",
                                                                                                              "timestamp": "2022-01-16 00:28:33",
                                                                                                              "score": 2,
                                                                                                              "num_children": 1,
                                                                                                              "replies": [
                                                                                                                {
                                                                                                                  "id": "hsu5q39",
                                                                                                                  "text": "isn’t it funny how abortions in clandestine facilities BY NATURE aren’t reported so you don’t actually have any statistics that would be able to help you. abortions with coat hangers are never factored in, so even if you DO ban abortions (which you won’t) the exact same number or people are going to get them.",
                                                                                                                  "timestamp": "2022-01-16 00:35:24",
                                                                                                                  "score": 0,
                                                                                                                  "num_children": 1,
                                                                                                                  "author": 169517,
                                                                                                                  "replies": [
                                                                                                                    {
                                                                                                                      "id": "hsuigsc",
                                                                                                                      "text": "Do you really think 20-25% of women are willing to break the law? You’re being intellectually dishonest and going against common sense. A lot of women who got abortions actually said if abortion was illegal they wouldn’t get one.",
                                                                                                                      "timestamp": "2022-01-16 02:05:44",
                                                                                                                      "score": 1,
                                                                                                                      "num_children": 0,
                                                                                                                      "replies": []
                                                                                                                    }
                                                                                                                  ]
                                                                                                                }
                                                                                                              ]
                                                                                                            }
                                                                                                          ]
                                                                                                        }
                                                                                                      ]
                                                                                                    }
                                                                                                  ]
                                                                                                }
                                                                                              ]
                                                                                            },
                                                                                            {
                                                                                              "id": "hsu26g4",
                                                                                              "text": "I don’t think women should have abortions. I don’t know what you’re not grasping about that. But if she does, she doesn’t deserve safety.",
                                                                                              "timestamp": "2022-01-16 00:10:09",
                                                                                              "score": 2,
                                                                                              "num_children": 1,
                                                                                              "replies": [
                                                                                                {
                                                                                                  "id": "hsu3clf",
                                                                                                  "text": "no one cares that you don’t want women to get abortions. they’re going to get them anyways. stop pretending to care about people and lives when you wouldn’t protect them given the opportunity.",
                                                                                                  "timestamp": "2022-01-16 00:18:35",
                                                                                                  "score": 1,
                                                                                                  "num_children": 1,
                                                                                                  "author": 169517,
                                                                                                  "replies": [
                                                                                                    {
                                                                                                      "id": "hsu4agm",
                                                                                                      "text": "Of course I care about people. Why wouldn’t I? I’m not a sociopath.",
                                                                                                      "timestamp": "2022-01-16 00:25:19",
                                                                                                      "score": 2,
                                                                                                      "num_children": 1,
                                                                                                      "replies": [
                                                                                                        {
                                                                                                          "id": "hsu4rnd",
                                                                                                          "text": "so why do you want to kill more people? you can’t stop what’s already happening, but you can reduce it and help the ones who are already alive and struggling right?",
                                                                                                          "timestamp": "2022-01-16 00:28:42",
                                                                                                          "score": 1,
                                                                                                          "num_children": 2,
                                                                                                          "author": 169517,
                                                                                                          "replies": [
                                                                                                            {
                                                                                                              "id": "hsu57o6",
                                                                                                              "text": "I don’t want to kill more people. It’s intellectually dishonest to blame pro lifers for back alley abortions as we’re against abortion in all forms. The women who get back alley abortions aren’t pro life and neither are the doctors who perform them. Yes, it’s normally doctors who perform back alley abortions. Also if women died every time from back alley abortions, only women with a death wish would do them.",
                                                                                                              "timestamp": "2022-01-16 00:31:47",
                                                                                                              "score": 2,
                                                                                                              "num_children": 1,
                                                                                                              "replies": [
                                                                                                                {
                                                                                                                  "id": "hsu6erh",
                                                                                                                  "text": "it’s absolutely right to blame pro lifers for clandestine abortions when they are ACTIVELY CAMPAIGNING AGAINST SAFER ABORTIONS. also, the fact that you don’t have the empathy to imagine why someone would be desperate enough to necessitate a clandestine abortion shows how little you care about the actual people getting abortions.",
                                                                                                                  "timestamp": "2022-01-16 00:40:14",
                                                                                                                  "score": 0,
                                                                                                                  "num_children": 2,
                                                                                                                  "author": 169517,
                                                                                                                  "replies": [
                                                                                                                    {
                                                                                                                      "id": "hsufh4g",
                                                                                                                      "text": "Well she doesn’t have to have an abortion. She can just not get one.",
                                                                                                                      "timestamp": "2022-01-16 01:44:22",
                                                                                                                      "score": 1,
                                                                                                                      "num_children": 0,
                                                                                                                      "replies": []
                                                                                                                    },
                                                                                                                    {
                                                                                                                      "id": "hsufncu",
                                                                                                                      "text": "Pro lifers do care about women. That’s why we have charities to help them. Also what part of murderers don’t deserve safety do you not understand?",
                                                                                                                      "timestamp": "2022-01-16 01:45:37",
                                                                                                                      "score": 1,
                                                                                                                      "num_children": 0,
                                                                                                                      "replies": []
                                                                                                                    }
                                                                                                                  ]
                                                                                                                }
                                                                                                              ]
                                                                                                            },
                                                                                                            {
                                                                                                              "id": "hsu5cw0",
                                                                                                              "text": "You’re making a strawman argument. I don’t want to kill anyone.",
                                                                                                              "timestamp": "2022-01-16 00:32:49",
                                                                                                              "score": 2,
                                                                                                              "num_children": 1,
                                                                                                              "replies": [
                                                                                                                {
                                                                                                                  "id": "hsu6nsr",
                                                                                                                  "text": "but banning safe abortions increases death rates, and you don’t care",
                                                                                                                  "timestamp": "2022-01-16 00:42:02",
                                                                                                                  "score": 0,
                                                                                                                  "num_children": 1,
                                                                                                                  "author": 169517,
                                                                                                                  "replies": [
                                                                                                                    {
                                                                                                                      "id": "hsuf7r8",
                                                                                                                      "text": "Doesn’t mean I want that to happen. Also she can just not get an abortion, ever thought of that?",
                                                                                                                      "timestamp": "2022-01-16 01:42:28",
                                                                                                                      "score": 1,
                                                                                                                      "num_children": 0,
                                                                                                                      "replies": []
                                                                                                                    }
                                                                                                                  ]
                                                                                                                }
                                                                                                              ]
                                                                                                            }
                                                                                                          ]
                                                                                                        }
                                                                                                      ]
                                                                                                    }
                                                                                                  ]
                                                                                                }
                                                                                              ]
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    },
                                                    {
                                                      "id": "hstvp37",
                                                      "text": "Sex isn’t a right.",
                                                      "timestamp": "2022-01-15 23:25:22",
                                                      "score": 2,
                                                      "num_children": 2,
                                                      "replies": [
                                                        {
                                                          "id": "hstw5jq",
                                                          "text": "maybe for you it’s not lmaooooo",
                                                          "timestamp": "2022-01-15 23:28:30",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 169517,
                                                          "replies": [
                                                            {
                                                              "id": "hstw9pv",
                                                              "text": "You’re kind of using the same logic as incels right now.",
                                                              "timestamp": "2022-01-15 23:29:17",
                                                              "score": 2,
                                                              "num_children": 1,
                                                              "replies": [
                                                                {
                                                                  "id": "hstxojv",
                                                                  "text": "ok. i dont care. you’re the one that’s wrong and literally rejected from general society for how stupid your ideas are.",
                                                                  "timestamp": "2022-01-15 23:39:02",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "author": 169517,
                                                                  "replies": [
                                                                    {
                                                                      "id": "hstyz8w",
                                                                      "text": "What stupid ideas? Being against misandry and killing babies? You’re a man; why are you defending feminists so hard? They literally joke about killing you all or putting you all in cages",
                                                                      "timestamp": "2022-01-15 23:47:56",
                                                                      "score": 2,
                                                                      "num_children": 1,
                                                                      "replies": [
                                                                        {
                                                                          "id": "hstzcbw",
                                                                          "text": "ok. that’s a joke. they can make jokes. i’m not offended by jokes, i’m not a snowflake. plus, no real feminist is making jokes like that and means it anyways, and if they did, i don’t care, because the overall victory of feminism is worth “girl make joke about me in cage” every once in a while. i really don’t care.",
                                                                          "timestamp": "2022-01-15 23:50:24",
                                                                          "score": 1,
                                                                          "num_children": 1,
                                                                          "author": 169517,
                                                                          "replies": [
                                                                            {
                                                                              "id": "hstzux5",
                                                                              "text": "What do you mean by victory of feminism? Have you ever heard of something called egalitarianism? It’s like feminism but it strives for true equality, the goalpost isn’t constantly being moved, and it doesn’t involve misandry.",
                                                                              "timestamp": "2022-01-15 23:53:59",
                                                                              "score": 2,
                                                                              "num_children": 1,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "hsu0n0k",
                                                                                  "text": "yea, that’s stupid. society is constantly moving and flowing, and having an ideology that never changes with how the times necessitate. would you drive a wooden carriage if back in 1840 they decided to stop advancing auto technology? no. we need changing ideologies with changing times, and anyone who stands in the way is just going to get ran over and forgotten under everyone else.",
                                                                                  "timestamp": "2022-01-15 23:59:32",
                                                                                  "score": 1,
                                                                                  "num_children": 1,
                                                                                  "author": 169517,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "hsu1t8h",
                                                                                      "text": "Feminism doesn’t own equality nor is everyone who’s not a feminist against equality. You don’t seem to understand that. For some reason you accused me of being against equality.",
                                                                                      "timestamp": "2022-01-16 00:07:35",
                                                                                      "score": 2,
                                                                                      "num_children": 1,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "hsu2kqq",
                                                                                          "text": "equality isn’t good. equity is good. everyone getting the help they need. if certain people need more help, they can get that help,  people who don’t need help, won’t get it. equality is like having a 50m head start in a 100m race while everyone can only run at the same speed. sure, it’s equal, but it’s not fair or helpful",
                                                                                          "timestamp": "2022-01-16 00:13:00",
                                                                                          "score": 1,
                                                                                          "num_children": 0,
                                                                                          "author": 169517,
                                                                                          "replies": []
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        },
                                                        {
                                                          "id": "hstw9lp",
                                                          "text": "anyways who cares. you’re acting as if that’s going to stop me from putting my penis into other people and vice versa. “sex isn’t a right” doesn’t mean anything when two people want to have sex you dunce",
                                                          "timestamp": "2022-01-15 23:29:16",
                                                          "score": 0,
                                                          "num_children": 1,
                                                          "author": 169517,
                                                          "replies": [
                                                            {
                                                              "id": "hstwfub",
                                                              "text": "Well if you get her pregnant, don’t be surprised, especially if you don’t wear a condom and she’s not on birth control",
                                                              "timestamp": "2022-01-15 23:30:26",
                                                              "score": 1,
                                                              "num_children": 2,
                                                              "replies": [
                                                                {
                                                                  "id": "hsty0u4",
                                                                  "text": "ok. abortion. simple as.",
                                                                  "timestamp": "2022-01-15 23:41:26",
                                                                  "score": -1,
                                                                  "num_children": 1,
                                                                  "author": 169517,
                                                                  "replies": [
                                                                    {
                                                                      "id": "hstyvs0",
                                                                      "text": "No because abortion is murder",
                                                                      "timestamp": "2022-01-15 23:47:16",
                                                                      "score": 1,
                                                                      "num_children": 1,
                                                                      "replies": [
                                                                        {
                                                                          "id": "hstz2zv",
                                                                          "text": "but i already poked the water sack and the clump of cells is already dead. whats going to happen then.",
                                                                          "timestamp": "2022-01-15 23:48:39",
                                                                          "score": 1,
                                                                          "num_children": 0,
                                                                          "author": 169517,
                                                                          "replies": []
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                },
                                                                {
                                                                  "id": "hsty2lb",
                                                                  "text": "also. i’m gay. i’m shooting spum into boy butt. no babies here.",
                                                                  "timestamp": "2022-01-15 23:41:46",
                                                                  "score": 0,
                                                                  "num_children": 0,
                                                                  "author": 169517,
                                                                  "replies": []
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "hstv48o",
                                              "text": "Also you still didn’t answer my question. How am I sexist?",
                                              "timestamp": "2022-01-15 23:21:22",
                                              "score": 2,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "hstvng0",
                                                  "text": "i could explain it to you but you would just throw it back at me and say that’s not sexism i could say the way you hold back womens reproductive rights is sexist. the way you objectify women in some of your posts is sexist. i could go on.",
                                                  "timestamp": "2022-01-15 23:25:04",
                                                  "score": 0,
                                                  "num_children": 2,
                                                  "author": 169517,
                                                  "replies": [
                                                    {
                                                      "id": "hstvsr1",
                                                      "text": "I don’t objectify women. When did I say I see women as objects? You’re using feminist buzzwords. Don’t use words you don’t know the definition of, it doesn’t make you look intelligent, quite the opposite.",
                                                      "timestamp": "2022-01-15 23:26:04",
                                                      "score": 2,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "hstxb68",
                                                          "text": "idk, your post about how women get breast augmentations just SCREAMS “i’ve never talked to any actual rational people”.",
                                                          "timestamp": "2022-01-15 23:36:25",
                                                          "score": 0,
                                                          "num_children": 1,
                                                          "author": 169517,
                                                          "replies": [
                                                            {
                                                              "id": "hstza0r",
                                                              "text": "But I never said women aren’t human and are not objects, did I? Like I said, don’t use words you don’t know the definition of",
                                                              "timestamp": "2022-01-15 23:49:58",
                                                              "score": 2,
                                                              "num_children": 1,
                                                              "replies": [
                                                                {
                                                                  "id": "hstzq9c",
                                                                  "text": "i’m not going to argue the definition of the word objectify. you made an ignorant, sexist, straw man argument. it’s all you did. that picture serves no purpose but that.",
                                                                  "timestamp": "2022-01-15 23:53:04",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "author": 169517,
                                                                  "replies": [
                                                                    {
                                                                      "id": "hstzzdh",
                                                                      "text": "How is that a strawman argument. Also if you don’t know how to use a word properly, don’t use it at all, you just make yourself look foolish.",
                                                                      "timestamp": "2022-01-15 23:54:52",
                                                                      "score": 2,
                                                                      "num_children": 1,
                                                                      "replies": [
                                                                        {
                                                                          "id": "hsu0sa7",
                                                                          "text": "it was a picture, saying something NOBODY said, judging women for body augmentation that they wanted for themselves. sounds pretty scummy.",
                                                                          "timestamp": "2022-01-16 00:00:32",
                                                                          "score": 1,
                                                                          "num_children": 1,
                                                                          "author": 169517,
                                                                          "replies": [
                                                                            {
                                                                              "id": "hsu1opl",
                                                                              "text": "I’m not judging them for that, if that’s what makes them happy, they can do that",
                                                                              "timestamp": "2022-01-16 00:06:43",
                                                                              "score": 2,
                                                                              "num_children": 1,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "hsu28on",
                                                                                  "text": "then why make a post on r/antifeminists about that exact topic in a very disparaging way?",
                                                                                  "timestamp": "2022-01-16 00:10:35",
                                                                                  "score": 1,
                                                                                  "num_children": 1,
                                                                                  "author": 169517,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "hsu2j02",
                                                                                      "text": "It was a response to the free the nipple movement",
                                                                                      "timestamp": "2022-01-16 00:12:40",
                                                                                      "score": 1,
                                                                                      "num_children": 1,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "hsu3ywn",
                                                                                          "text": "and there you go. sexualizing and objectifying a woman for having her chest out. sexism.",
                                                                                          "timestamp": "2022-01-16 00:23:00",
                                                                                          "score": 1,
                                                                                          "num_children": 1,
                                                                                          "author": 169517,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "hsu4cop",
                                                                                              "text": "I didn’t say she’s an object, stop using that stupid word when you don’t even know what it means.",
                                                                                              "timestamp": "2022-01-16 00:25:45",
                                                                                              "score": 1,
                                                                                              "num_children": 1,
                                                                                              "replies": [
                                                                                                {
                                                                                                  "id": "hsu52f3",
                                                                                                  "text": "OBJECTIFY-degrade to the status of a mere object.\n\"a deeply sexist attitude that objectifies women\"- pasted from google. you imply a woman with her nipples out is sexual, reducing the woman and her chest to nothing but an OBJECT for SEXUAL gratification, instead of just a part of a persons body that EVERYONE has.",
                                                                                                  "timestamp": "2022-01-16 00:30:47",
                                                                                                  "score": 1,
                                                                                                  "num_children": 1,
                                                                                                  "author": 169517,
                                                                                                  "replies": [
                                                                                                    {
                                                                                                      "id": "hsu5b0i",
                                                                                                      "text": "I didn’t say she’s not a human anymore. Also I didn’t imply anything, you mean you assumed.",
                                                                                                      "timestamp": "2022-01-16 00:32:27",
                                                                                                      "score": 1,
                                                                                                      "num_children": 1,
                                                                                                      "replies": [
                                                                                                        {
                                                                                                          "id": "hsu6krd",
                                                                                                          "text": "you are a fucking idiot who doesn’t understand basic semantics. you don’t have to say she isn’t explicitly human to dehumanize her.",
                                                                                                          "timestamp": "2022-01-16 00:41:26",
                                                                                                          "score": 0,
                                                                                                          "num_children": 1,
                                                                                                          "author": 169517,
                                                                                                          "replies": [
                                                                                                            {
                                                                                                              "id": "hsufesn",
                                                                                                              "text": "I’m not dehumanizing her either. Like I said, don’t use big words you don’t know the meaning of, doesn’t make you look smart at all.",
                                                                                                              "timestamp": "2022-01-16 01:43:55",
                                                                                                              "score": 1,
                                                                                                              "num_children": 0,
                                                                                                              "replies": []
                                                                                                            }
                                                                                                          ]
                                                                                                        }
                                                                                                      ]
                                                                                                    }
                                                                                                  ]
                                                                                                }
                                                                                              ]
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    },
                                                    {
                                                      "id": "hstw1i9",
                                                      "text": "Abortion is 1. Not a right, quite the opposite 2. Has nothing to do with reproduction since you’re already pregnant. Reproductive rights are things like birth control, tubal ligations, vasectomies, things that prevent you from getting pregnant / getting someone pregnant. Once you’ve gotten pregnant / gotten someone pregnant, you’ve already reproduced. Abortion isn’t a choice between whether or not to reproduce, it’s a choice between letting your kid live and killing it.",
                                                      "timestamp": "2022-01-15 23:27:45",
                                                      "score": 2,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "hstxhqb",
                                                          "text": "it doesn’t matter. people are going to get abortions. you’re not going to wave a magic wand and make them impossible. someone sticks a coat hanger in there, a lil poot of blood and clots come out, and baby no more. you won’t stop it, so let people get it safely.",
                                                          "timestamp": "2022-01-15 23:37:42",
                                                          "score": 0,
                                                          "num_children": 1,
                                                          "author": 169517,
                                                          "replies": [
                                                            {
                                                              "id": "hstzjwg",
                                                              "text": "No such thing as safe abortions, all abortion kills a human being. Also I might not stop it completely but if it’s criminalized, the rates will go down. When you make something illegal, less people do it, that’s just common sense. Also rape and abuse is illegal yet people still do it so by your logic why don’t we make those things legal since people do them anyway, to make it safer for rapists and abusers.",
                                                              "timestamp": "2022-01-15 23:51:50",
                                                              "score": 2,
                                                              "num_children": 1,
                                                              "replies": [
                                                                {
                                                                  "id": "hsu0012",
                                                                  "text": "no, because rape and abuse results in a victim. in an abortion, both mom and dad turn out fine. also, making something illegal doesn’t stop it, that’s one of the first things you learn about when they teach you prohibition, you clearly uneducated dolt.",
                                                                  "timestamp": "2022-01-15 23:55:00",
                                                                  "score": 1,
                                                                  "num_children": 2,
                                                                  "author": 169517,
                                                                  "replies": [
                                                                    {
                                                                      "id": "hsu0417",
                                                                      "text": "Yeah it doesn’t stop it but it DECREASES it, Eva so hard to grasp about that? Never said it stops it completely",
                                                                      "timestamp": "2022-01-15 23:55:48",
                                                                      "score": 2,
                                                                      "num_children": 1,
                                                                      "replies": [
                                                                        {
                                                                          "id": "hsu0z8o",
                                                                          "text": "no, it doesn’t. it NEVER HAS. the only thing that changes is people get sent to jail for it, and the prison industrial complex and the elites make more money off of it. and you are supporting it.",
                                                                          "timestamp": "2022-01-16 00:01:51",
                                                                          "score": 0,
                                                                          "num_children": 1,
                                                                          "author": 169517,
                                                                          "replies": [
                                                                            {
                                                                              "id": "hsu1mig",
                                                                              "text": "You claiming that it won’t decrease it at all goes against all common sense.",
                                                                              "timestamp": "2022-01-16 00:06:18",
                                                                              "score": 1,
                                                                              "num_children": 1,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "hsu241b",
                                                                                  "text": "i don’t care that it goes against common sense, it doesn’t go against FACTS AND NUMBERS. \n\nhttps://www.nbcnews.com/think/amp/ncna1235174\n\nhttps://www.nbcnews.com/news/amp/ncna858476\n\nhttps://www.colorado.edu/asmagazine/2021/09/22/study-shows-abortion-ban-may-lead-21-increase-pregnancy-related-deaths\n\nhttps://www.cnn.com/2018/03/21/health/abortion-restriction-laws/index.html\n\nhttps://www.independent.co.uk/life-style/health-and-families/health-news/women-in-countries-where-abortion-is-illegal-just-as-likely-to-have-one-as-countries-where-it-is-legal-study-concludes-a7025671.html?amp\n\nhow many more do you want?",
                                                                                  "timestamp": "2022-01-16 00:09:42",
                                                                                  "score": 0,
                                                                                  "num_children": 1,
                                                                                  "author": 169517,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "hsu2d94",
                                                                                      "text": "Before abortion was legalized, abortion was rare and each year, the abortion cases were usually under 100.",
                                                                                      "timestamp": "2022-01-16 00:11:30",
                                                                                      "score": 1,
                                                                                      "num_children": 1,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "hsu3v74",
                                                                                          "text": "fuck you. i have you SIX fucking sources. and you just say numbers with nothing. please warn people before you act this fucking stupid",
                                                                                          "timestamp": "2022-01-16 00:22:16",
                                                                                          "score": 0,
                                                                                          "num_children": 1,
                                                                                          "author": 169517,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "hsu3xs8",
                                                                                              "text": "What do pregnancy related deaths have to do with abortion anyway?",
                                                                                              "timestamp": "2022-01-16 00:22:47",
                                                                                              "score": 1,
                                                                                              "num_children": 1,
                                                                                              "replies": [
                                                                                                {
                                                                                                  "id": "hsu486m",
                                                                                                  "text": "the pregnancies cause the deaths, dumbass. if they aborted, the mothers would have been fine, but instead, they either die during childbirth, die before childbirth and give dead birth to preterm birth, which can be, and often is, extremely painful and difficult to survive,  or die with the baby and the baby dies as well.",
                                                                                                  "timestamp": "2022-01-16 00:24:52",
                                                                                                  "score": 1,
                                                                                                  "num_children": 1,
                                                                                                  "author": 169517,
                                                                                                  "replies": [
                                                                                                    {
                                                                                                      "id": "hsu4hdz",
                                                                                                      "text": "In general, the baby and the mom can be saved by an emergency c section. If you’re talking about something like ectopic pregnancies, abortion will still be allowed in those rare cases.",
                                                                                                      "timestamp": "2022-01-16 00:26:38",
                                                                                                      "score": 1,
                                                                                                      "num_children": 1,
                                                                                                      "replies": [
                                                                                                        {
                                                                                                          "id": "hsu5eug",
                                                                                                          "text": "you can’t “in general” someone’s life away. what if doctors stopped giving medicine for certain illnesses because “in general” once you’re dying you can have surgery to MAYBE save your life. please stop repeating stupid arguments.",
                                                                                                          "timestamp": "2022-01-16 00:33:12",
                                                                                                          "score": 0,
                                                                                                          "num_children": 0,
                                                                                                          "author": 169517,
                                                                                                          "replies": []
                                                                                                        }
                                                                                                      ]
                                                                                                    }
                                                                                                  ]
                                                                                                }
                                                                                              ]
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    },
                                                                    {
                                                                      "id": "hsu07r2",
                                                                      "text": "You do realize a lot of women regret their abortions, right? Also what about the poor innocent baby they murdered? That’s a victim, right? Did you think of that?",
                                                                      "timestamp": "2022-01-15 23:56:32",
                                                                      "score": 2,
                                                                      "num_children": 1,
                                                                      "replies": [
                                                                        {
                                                                          "id": "hsu15zd",
                                                                          "text": "no. it’s not a baby. it’s less than 300 cells at certain points of abortion. if anyone regrets an abortion, there is no solution and it is then THEIR problem. abortions are possible and accessible and safe, taking them away is NOT the same as regretting a choice with NO solution.",
                                                                          "timestamp": "2022-01-16 00:03:07",
                                                                          "score": 0,
                                                                          "num_children": 1,
                                                                          "author": 169517,
                                                                          "replies": [
                                                                            {
                                                                              "id": "hsu1kg7",
                                                                              "text": "Well if it’s not a human baby then what species is it? Also how long do you think abortion should be allowed until? Also yes abortion is a choice but it is a bad choice",
                                                                              "timestamp": "2022-01-16 00:05:53",
                                                                              "score": 2,
                                                                              "num_children": 0,
                                                                              "replies": []
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hsfu3pd",
      "text": "Feminists are *Irony Impaired*...",
      "timestamp": "2022-01-13 03:13:34",
      "score": 44,
      "num_children": 0,
      "author": 138651,
      "replies": []
    },
    {
      "id": "hsg4q3m",
      "text": "[removed]",
      "timestamp": "2022-01-13 04:38:28",
      "score": 32,
      "num_children": 1,
      "replies": [
        {
          "id": "hsgn2wc",
          "text": "Facts",
          "timestamp": "2022-01-13 07:48:33",
          "score": 13,
          "num_children": 1,
          "author": 164469,
          "replies": [
            {
              "id": "hshclei",
              "text": "What did that person say?",
              "timestamp": "2022-01-13 13:04:07",
              "score": 6,
              "num_children": 1,
              "replies": [
                {
                  "id": "hshcs1v",
                  "text": "I forgot lmao",
                  "timestamp": "2022-01-13 13:05:47",
                  "score": 4,
                  "num_children": 1,
                  "author": 164469,
                  "replies": [
                    {
                      "id": "hsi4fk4",
                      "text": "Facts",
                      "timestamp": "2022-01-13 16:24:45",
                      "score": 9,
                      "num_children": 0,
                      "author": 267820,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hsggoef",
      "text": "proceed to go straight to name calling. By calling them the **\"pick me girl\"**",
      "timestamp": "2022-01-13 06:32:42",
      "score": 31,
      "num_children": 2,
      "author": 148374,
      "replies": [
        {
          "id": "hshcu80",
          "text": "I’ve been called that. I say “bold of you to assume I care about what a man thinks of me.”",
          "timestamp": "2022-01-13 13:06:18",
          "score": 11,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hsiz13m",
          "text": "That's why I had 0 friends in college. The few girls I used to hang out with would drop pickme any time I'd say something I perceived as *reasonable* like I was even sugarcoating to protect their feelings.\n\nI realized that they think the world of themselves and will harrass anyone who will make them think for even a second that they're doing or supporting the wrong thing.",
          "timestamp": "2022-01-13 19:33:22",
          "score": 4,
          "num_children": 0,
          "author": 144324,
          "replies": []
        }
      ]
    },
    {
      "id": "hsikj10",
      "text": "CEO of any company: only 20% of people would buy our product, there must be something wrong with it.  \nFeminists: only 20% of people would buy our product, there must be something wrong with people.  \nIt's really crazy when you think about it.",
      "timestamp": "2022-01-13 18:03:23",
      "score": 6,
      "num_children": 2,
      "author": 294229,
      "replies": [
        {
          "id": "hsrmjs8",
          "text": "if 20% of people bought a product, it would be huge",
          "timestamp": "2022-01-15 14:17:06",
          "score": 2,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hsuk72m",
          "text": "What a wonderful uneducated generalization :)",
          "timestamp": "2022-01-16 02:17:50",
          "score": 1,
          "num_children": 0,
          "author": 286247,
          "replies": []
        }
      ]
    },
    {
      "id": "hshw778",
      "text": "How often do they say no, really?",
      "timestamp": "2022-01-13 15:32:29",
      "score": 4,
      "num_children": 1,
      "replies": [
        {
          "id": "hshxf7u",
          "text": "You’d be surprised, I’m one who says no",
          "timestamp": "2022-01-13 15:40:28",
          "score": 4,
          "num_children": 1,
          "replies": [
            {
              "id": "hshxwkv",
              "text": "I would think most feminists get indoctrinated into it by family and friends or honestly they have daddy issues. But either way it happens before they can consciously make a decision.",
              "timestamp": "2022-01-13 15:43:34",
              "score": 5,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hsga0fj",
      "text": "- More than two thirds of Britons support gender equality – but just seven per cent would call themselves feminists.\n\n- Out of 8,000 people surveyed, only 560 used the ‘f-word’ to describe their views on equality.\n\nNote that the 'charity' that paid for this survey, tried to massage the result by claiming that even though the participants didn't identify as feminists, they were feminists anyway...\n\nhttps://www.telegraph.co.uk/women/life/only-7-per-cent-of-britons-consider-themselves-feminists/?fbclid=IwAR1FUze38ERGiJM7d4sM6M3-k2lwr8hp5GsRVIbr3xUndwJl5tEsr-xSmFM\n\n- Why so many young women don't call themselves feminist\n\n- Fewer than one in five young women would call themselves a feminist, polling in the UK and US suggests.\n\nhttps://www.bbc.com/news/uk-politics-47006912\n\n------------------------------------------------------\n\n*Men need feminism like bicycles need fish.*",
      "timestamp": "2022-01-13 05:25:09",
      "score": 23,
      "num_children": 3,
      "author": 187461,
      "replies": [
        {
          "id": "hshcx0l",
          "text": "Feminism doesn’t have a monopoly on equality anymore than Buddhism has a monopoly on pacifism",
          "timestamp": "2022-01-13 13:07:00",
          "score": 11,
          "num_children": 1,
          "replies": [
            {
              "id": "hshek3t",
              "text": "Feminism today isn't about equality, it is about female supremacy",
              "timestamp": "2022-01-13 13:21:29",
              "score": 16,
              "num_children": 1,
              "author": 327329,
              "replies": [
                {
                  "id": "hshg9sh",
                  "text": "Agreed 100% but feminists still insist everyone for equality is a feminist/ if you say you’re an anti feminist you must be against equality",
                  "timestamp": "2022-01-13 13:36:03",
                  "score": 10,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hsgn32u",
          "text": "Also less than 1% of woman call out double standards of feminism. \n\nIf vast majority of woman didn't identify as feminists and they consider themselves as nice fair people. Why are they not calling out the double standards of feminism?",
          "timestamp": "2022-01-13 07:48:37",
          "score": 13,
          "num_children": 1,
          "author": 150315,
          "replies": [
            {
              "id": "hsk4afq",
              "text": "They never admit anything. I already tried to talk and exchange, even accepting some bad truth but in any case they admitted shit! Plus, when you end up digging a bit in their reddit profil you realize they lied about many things. Most of the time they deflect, change subject and carry on.",
              "timestamp": "2022-01-13 23:56:15",
              "score": 4,
              "num_children": 0,
              "author": 80437,
              "replies": []
            }
          ]
        },
        {
          "id": "hsgmoco",
          "text": "These numbers are reassuring!",
          "timestamp": "2022-01-13 07:43:24",
          "score": 5,
          "num_children": 0,
          "author": 136516,
          "replies": []
        }
      ]
    },
    {
      "id": "hsgnzrc",
      "text": "Well, these are the same imbeciles that can't take it when men say no to feminism. Brigaiding the manosphere, and thumping their chests afterwards....while doing \"[the scream.](https://www.youtube.com/watch?v=IFb_AERKha8)\" Retarded, the lot of them.",
      "timestamp": "2022-01-13 08:00:09",
      "score": 6,
      "num_children": 0,
      "author": 218700,
      "replies": []
    },
    {
      "id": "hsl2sdx",
      "text": "They say that because nobody willingly sleeps with a feminist",
      "timestamp": "2022-01-14 04:07:16",
      "score": 3,
      "num_children": 1,
      "replies": [
        {
          "id": "hss5ot9",
          "text": "I did and I regret it. Thankfully I got away from that relationship and am now happy and single. I was also a brainwashed feminist at that time, though.",
          "timestamp": "2022-01-15 16:34:11",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hudvbzr",
              "text": "I’m glad you recovered 💪🏻 yeah that was kinda my last relationship too, she was just Uber pride though. Too much passion can certainly kill the vibe if you’re not aligned exactly lol",
              "timestamp": "2022-01-27 02:25:15",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hsj72c1",
      "text": "very true actually. ive heard feminists call fellow females uncle toms for wanting some sort of traditional living or being a wife/mother.",
      "timestamp": "2022-01-13 20:22:57",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "hsjowca",
          "text": "Being anti feminist doesn’t mean wanting a traditional life",
          "timestamp": "2022-01-13 22:15:25",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "hsk8v6m",
              "text": "thats your opinion. for others they enjoy traditional living and want the choice to do it. feminism discourages that quite often directly.",
              "timestamp": "2022-01-14 00:27:57",
              "score": 3,
              "num_children": 1,
              "replies": [
                {
                  "id": "hsk9voa",
                  "text": "I didn’t say they can’t, but being an anti feminist woman doesn’t mean you have to",
                  "timestamp": "2022-01-14 00:35:02",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hskapbp",
                      "text": "so why reply at all then... just a random opinion thrown out for no reason other than you are clearly biased enough against traditional living that you felt compelled to state your opinion about it.",
                      "timestamp": "2022-01-14 00:40:49",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hskb2le",
                          "text": "You’re making a lot of assumptions. Also there’s a difference between being a stay at home mom and being a tradwife. No sane stay at home mom is calling herself a tradwife.",
                          "timestamp": "2022-01-14 00:43:26",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hskc0xh",
                              "text": "so now you are feeling victimized and not answering questions.\n\nagain why reply? what was your goal of replying?",
                              "timestamp": "2022-01-14 00:50:10",
                              "score": 0,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hskc7fd",
                                  "text": "I was just telling you. I’m an anti feminist and I’m a career woman. Also when did I say I’m feeling victimized?",
                                  "timestamp": "2022-01-14 00:51:26",
                                  "score": 0,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hskcxi2",
                                      "text": "you implied that i was making assumptions when i was clearly making observations of what you were doing without an actual point behind doing it.\n\ninstead of me stating an opinion or comment you felt entitled enough to try and tell me what i was doing.\n\nthats the point in case you havent figure that out. enjoy your opinion, i have actual experience that can backup mine.",
                                      "timestamp": "2022-01-14 00:56:38",
                                      "score": 0,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hskf5zs",
                                          "text": "My bad, but you seemed to think being a housewife / stay at home mom has something to do with being an anti feminist",
                                          "timestamp": "2022-01-14 01:12:33",
                                          "score": 0,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "hskff3w",
                                              "text": "if its her choice it does, because feminists consider her making that choice to be anti feminist.\n\nyou see now? perhaps not. again enjoy your opinion.",
                                              "timestamp": "2022-01-14 01:14:24",
                                              "score": 1,
                                              "num_children": 0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hsjorgp",
      "text": "I’m just messing around I don’t really take this seriously",
      "timestamp": "2022-01-13 22:14:34",
      "score": 1,
      "num_children": 1,
      "author": 119923,
      "replies": [
        {
          "id": "hswgqlh",
          "text": "This istoo important to be taken seriously.",
          "timestamp": "2022-01-16 14:11:43",
          "score": 1,
          "num_children": 0,
          "author": 227146,
          "replies": []
        }
      ]
    },
    {
      "id": "hshrjgr",
      "text": "[deleted]",
      "timestamp": "2022-01-13 15:01:20",
      "score": -7,
      "num_children": 2,
      "replies": [
        {
          "id": "hshu0m4",
          "text": "Feminism doesn’t have a monopoly on equality",
          "timestamp": "2022-01-13 15:18:15",
          "score": 10,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hsj3r4i",
          "text": "Women want to cherry pick equality. Now I'm not talking about something physically strenuous or incredibly dangerous, but women want nothing to do with any role or responsibility that is uncomfortable, arduous or unpleasant. The employment figures prove this and disprove this patriarchy bullshit.",
          "timestamp": "2022-01-13 20:02:45",
          "score": 6,
          "num_children": 1,
          "replies": [
            {
              "id": "hu2eqxf",
              "text": "100% agree.\n\nFeminism is just another Marxist weapon masquerading as \"equality\" , like most of what communism espouses.",
              "timestamp": "2022-01-24 20:40:24",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}