{
  "id": "s5kzpp",
  "text": "I cringed so hard after seeing this shit.\n",
  "timestamp": "2022-01-16 20:39:58",
  "score": 623,
  "subreddit": "t5_2zaj2",
  "num_children": 39,
  "author": 84340,
  "replies": [
    {
      "id": "hsy3u6n",
      "text": "Feminists saying that they are\"Fighting the patriarchy\" is the equivalent of a lazy NEET saying \"I am trying to find myself\".",
      "timestamp": "2022-01-16 20:45:01",
      "score": 151,
      "num_children": 4,
      "author": 403608,
      "replies": [
        {
          "id": "hsydqnt",
          "text": "That’s a great metaphor",
          "timestamp": "2022-01-16 21:49:15",
          "score": 31,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hszdhhi",
          "text": "or tankies saying they’re gonna “start a revolution”",
          "timestamp": "2022-01-17 01:50:08",
          "score": 15,
          "num_children": 0,
          "author": 329348,
          "replies": []
        },
        {
          "id": "ht0fd3n",
          "text": "Feminists love fighting for rights they already have. lol",
          "timestamp": "2022-01-17 07:08:53",
          "score": 13,
          "num_children": 1,
          "author": 270078,
          "replies": [
            {
              "id": "htk3m2m",
              "text": "Like equal pay? Ya totally",
              "timestamp": "2022-01-21 04:37:06",
              "score": 0,
              "num_children": 1,
              "author": 413044,
              "replies": [
                {
                  "id": "htlqp2q",
                  "text": "Are we really going to rehash the \"77 cents to a dollar\" narrative? That's been debunked multiple times since like 2016! Even hardcore feminists now understand how dumb and nonsensical the wage gap argument is. Heck, this is my first time seeing someone bring it up in over 2 years!\n\nHowever, I've got a question for you. If you feminists are so concerned about women's rights, why do you never talk about how women have basically zero rights in the Middle East? That's where the real fight for equality is at. So, why do you folks never talk about it?",
                  "timestamp": "2022-01-21 14:48:56",
                  "score": 5,
                  "num_children": 1,
                  "author": 270078,
                  "replies": [
                    {
                      "id": "htnv2aq",
                      "text": "Lmfao you don’t believe in the wage gap? This subreddit has some crazy stuff",
                      "timestamp": "2022-01-21 22:39:18",
                      "score": 0,
                      "num_children": 1,
                      "author": 413044,
                      "replies": [
                        {
                          "id": "htsj5gq",
                          "text": "Lol! Typical radical feminist. Embracing debunked, false narratives while ignoring obvious real problems that women face everyday. Thank you for not responding to the question and ultimately proving our point.",
                          "timestamp": "2022-01-22 21:16:04",
                          "score": 3,
                          "num_children": 1,
                          "author": 270078,
                          "replies": [
                            {
                              "id": "hudcjbw",
                              "text": "I’m not sure why you think feminists don’t care about that. Gender equality shit everywhere, Asia, US, or Middle East. Any more questions?",
                              "timestamp": "2022-01-27 00:15:07",
                              "score": 1,
                              "num_children": 1,
                              "author": 413044,
                              "replies": [
                                {
                                  "id": "huety89",
                                  "text": "I've NEVER heard feminists talk about problems women face in the Middle East or in the Islamic world in general. Heck, have you ever talked about it anywhere? If so, send me the link! You're out here complaining about wage gap myths that have been debunked since 2016.",
                                  "timestamp": "2022-01-27 07:22:49",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 270078,
                                  "replies": [
                                    {
                                      "id": "huhmzky",
                                      "text": "I imagine from the way you talk you don’t know any feminists… I don’t archive every feminist post I see so I can’t send it to you. Also you are only exposed to English speaking content which limits discussion to problems in English speaking countries, mostly. \n\nFeminism is about taking one step at a time. There is definitely issues like the one you mentioned that are not discussed enough. If you really do care about gender equality in middle eastern countries, please help spread awareness about it.",
                                      "timestamp": "2022-01-27 20:49:30",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 413044,
                                      "replies": [
                                        {
                                          "id": "huhs7ci",
                                          "text": ">I imagine from the way you talk you don’t know any feminists\n\nI actually know a lot of feminists. Having said that, I think you are living in basically a feminist bubble. And a very small, western bubble at that. So, allow me to educate you. Western women are probably the most privileged group on the planet. Far more than western men. Not saying this was always the case. In fact, I would say this has been the case for maybe a couple of decades. \n\n> Feminism is about taking one step at a time.\n\nFeminism in this day and age, particularly in the West, has proven to be nothing more than a path toward female superiority and the vilification of men. It is also clearly about self aggrandizing rather than giving a voice to the voiceless, i.e. the marginalized. Feminism during the first, second and to some extent, the third wave, had clear and noble goals, which centered around establishing an egalitarian society. None of that is a hallmark of feminism today! \n\n> If you really do care about gender equality in middle eastern countries, please help spread awareness about it.\n\nSo, I assume you don't?",
                                          "timestamp": "2022-01-27 21:21:37",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 270078,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ht0xww9",
          "text": "Uh, what's a neet? :)",
          "timestamp": "2022-01-17 11:06:44",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "ht175rm",
              "text": "\"Not in Education, Employment, or Training\"",
              "timestamp": "2022-01-17 12:56:39",
              "score": 3,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hsydp0o",
      "text": "The patriarchy isn’t real though",
      "timestamp": "2022-01-16 21:48:58",
      "score": 81,
      "num_children": 2,
      "replies": [
        {
          "id": "hszo8e3",
          "text": "True",
          "timestamp": "2022-01-17 03:07:04",
          "score": 16,
          "num_children": 0,
          "author": 194284,
          "replies": []
        },
        {
          "id": "ht69hd0",
          "text": "Yeah it is. Haven't you been issued your man card?  You need it to vote in patriarchal elections for your patriarch of choice. We meet on Sunday afternoons at the pub.",
          "timestamp": "2022-01-18 13:28:10",
          "score": 2,
          "num_children": 1,
          "author": 227146,
          "replies": [
            {
              "id": "ht8g1qi",
              "text": "I’m not a man though",
              "timestamp": "2022-01-18 21:52:13",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "htb9yoi",
                  "text": "Ah well that's why.",
                  "timestamp": "2022-01-19 13:05:58",
                  "score": 2,
                  "num_children": 0,
                  "author": 227146,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hsydrhs",
      "text": "I'm saddened by this because it's actually right.\n\nThey have government, financial funding, media and education fallowing their tune.\n\nThe Duluth model\nGirl centred education\nPositive discrimination\n\nThe future is female\nKillallmen\n\nThey have the resources and power so yes they are the stronger of the two, every time a men's group mentions something about men's issues they get shouted down, censored, erased or sued out of existence by feminist groups.\n\nThey win a lot of arguments purely because of how they wield that power and those resources.\n\nThere's only two ways to beat them, to copy them, their tactics and strategies or to walk away. \n\nTo walk away is the most destructive of the two actions possible, most people think it means segregation I think that's too nihilist, instead it means to force the equality, refuse to help. A woman being attacked so what... Of course that's distasteful but sometimes a war needs to fought on many fronts. \n\nRefuse to date, only fwb \n\nRefuse to talk to any woman without a witness or recording going on and make sure she knows\n\nWhen in work, any hint of a woman flirting with you gets her reported to HR. \n\nA woman approaches you at the gym she gets reported o management. \n\nRefuse to mentor women, refuse to work with them, if you cannot do that ensure any and all interactions are recorded and they know it's happening.\n\nRefuse to help women in work, they are responsible for their own work. If they fail they get no support. \n\nAny resistance is met with, you're my equal this is equality.",
      "timestamp": "2022-01-16 21:49:24",
      "score": 63,
      "num_children": 3,
      "author": 227190,
      "replies": [
        {
          "id": "hsyjlpp",
          "text": "That future will not last long though… show me a civilization that was started and run by women doing all of the difficult jobs and not just the cushy, higher paying jobs. Show me the women digging in mines, driving tractors/semi’s , harvesting fields, building homes outside in the winter… not just the one or two to check the box.. show me the women out there doing these jobs for an entire civilization to be up and running. They will eventually implode because there needs to be a true balance and for them to stop being their own victims.",
          "timestamp": "2022-01-16 22:27:15",
          "score": 24,
          "num_children": 2,
          "author": 303807,
          "replies": [
            {
              "id": "hsyl34m",
              "text": "Exactly my point, a society that removes or denigrates its men cannot stand, never has and never will, there are only two known of worldwide which still exist but they are a relative hellscape.\n\nThey are very small and decreasing in size so effectively dying out. So accepting that men's rights movements cannot win there are really only two options, use their tactics or walk away and force them to accept the equality they have demanded.",
              "timestamp": "2022-01-16 22:37:08",
              "score": 18,
              "num_children": 0,
              "author": 227190,
              "replies": []
            },
            {
              "id": "hsyz68e",
              "text": "It's how civilizations die. Something about sinking ships and rats coming out.",
              "timestamp": "2022-01-17 00:11:47",
              "score": 6,
              "num_children": 0,
              "author": 218700,
              "replies": []
            }
          ]
        },
        {
          "id": "hsyz1zp",
          "text": "Actually, there's another way. Start a war. How? Just burn more fossil fuels, until earth is hard to survive...then the resulting resource wars destroy feminism. Sure, a few hundred million (600-1billion) would not survive it, but if we ensure that the doctrines of equal ass whooping are maintained through the war, then there's more less-colorful birds birds in the ground afterwards. This is of course, an extreme means of winning this conflict. Yet, considering the extreme psychological damage meted of men and boys, it is the logical conclusion to this. I mean, if there's gonna be war anyway, why not use it to solve a problematic doctrine.",
          "timestamp": "2022-01-17 00:10:58",
          "score": -8,
          "num_children": 1,
          "author": 218700,
          "replies": [
            {
              "id": "hszg0xq",
              "text": "Is reddit okay?",
              "timestamp": "2022-01-17 02:08:02",
              "score": 2,
              "num_children": 1,
              "replies": [
                {
                  "id": "hszkpnm",
                  "text": "Fellow pandemonica enjoyer? Usually no.",
                  "timestamp": "2022-01-17 02:41:50",
                  "score": 3,
                  "num_children": 1,
                  "author": 287626,
                  "replies": [
                    {
                      "id": "hszkv1o",
                      "text": "Yes, you're the first person that recognized. I don't use reddit much, but this comment is certainly the most... entertaining? That I've seen in a while.",
                      "timestamp": "2022-01-17 02:42:51",
                      "score": 2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hszli1k",
                          "text": "To be perfectly honest, I only really joined this subreddit because there needs to be a counter balance. There is a heavier weight for women’s issues then men’s issues *in certain cases*. People really only see one or the other but to progress as society we need to be able to recognize issues as a whole versus the ‘us versus them’ mentality most people have.",
                          "timestamp": "2022-01-17 02:47:20",
                          "score": 2,
                          "num_children": 2,
                          "author": 287626,
                          "replies": [
                            {
                              "id": "ht0f5vw",
                              "text": "They are not willing to see men's issues.",
                              "timestamp": "2022-01-17 07:06:38",
                              "score": 5,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "ht0fml9",
                                  "text": "Precisely. If people on *both sides* stopped bickering and decided to actually change things, we would all be better off.",
                                  "timestamp": "2022-01-17 07:11:54",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 287626,
                                  "replies": [
                                    {
                                      "id": "ht0ftnf",
                                      "text": "For that to happen women would have to stop routinely denying the abuse they inflict, and the government has to step in and actually start punishing them.",
                                      "timestamp": "2022-01-17 07:14:13",
                                      "score": 2,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "ht0gjux",
                                  "text": "Men seem to think that way.",
                                  "timestamp": "2022-01-17 07:22:33",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 40541,
                                  "replies": [
                                    {
                                      "id": "ht0ib86",
                                      "text": "See what way",
                                      "timestamp": "2022-01-17 07:43:13",
                                      "score": 1,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "htghfue",
                              "text": "The problem with trying to solve these issues reasonably, is that by their very nature, feminists are unreasonable. What you suggest, is like riding a crocodile across a river, and expecting to get there with all your parts. It has to be an us versus them kind of thing, because that is the only solution they will respond to. It's not like I like war, or the idea of burying millions. Makes me sick to my bones, but it's the only way manhood and masculinity comes out of this standing. All other avenues have been explored, and have been dead-ends. Going our own way, did not work. Reasoning with them, has not worked. Sometimes, when the cancer is too persistent, you cut off that diseased limb, and engineer your children to never face such again.\n\nDrastic, yes. Extreme, yes. Necessary, yes.",
                              "timestamp": "2022-01-20 13:51:09",
                              "score": 1,
                              "num_children": 0,
                              "author": 218700,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ht69ut5",
          "text": "You're misunderstanding what's causing this. Similar to radical extremists men what's making young women into vicious termagants is the broken economy. After everything is back on track the appetite for hate will dry up and extremist groups will die out.\n\nSo all we need to do is fix literally everything. Yay.",
          "timestamp": "2022-01-18 13:31:26",
          "score": 1,
          "num_children": 1,
          "author": 227146,
          "replies": [
            {
              "id": "ht6gkeb",
              "text": "I don't think that's the case, yes I agree when the economy broke in 2008 we saw an explosion in blame, there were in fact hardly any news reports related to race and then in 2008 the news media owned and controlled by the wealthy pushed a narrative of hate towards race and towards men in general. \n\nSo yes I agree with you on that point, I am not so in agreement that fixing the economy is the answer to the underlying issue. \n\nI think then in reality the news cycle gave rise and vent to the massive undercurrent of hidden hatred towards men and traditional women and traditional values and I don't think that's going to go away, even fixing the economy isn't going to push these things back to the fringe because they have become too mainstream for too long. \n\nCertainly long enough for the general public to accept this is the way it is. \n\nI think in reality the only thing that will stop it is women themselves, of course that's asking women to speak up for men, yes and it's about time, those women who enjoy men, those women who want men must speak up and shit down those who demonise all for behaviour of a few, men speaking up get silenced because it's an easy win for feminists to do, they are nothing if not willing to take the easy win, however it's much harder for them to take down a woman, to have a woman who they claim to speak for speaking against them.\n\nAs men we have to remember one of our greatest weaknesses is to try to fix things, to fix an issue whenever a woman says something is a problem, that's has been used against us for too long, the problem is that we cannot fix the brainwashing that happens to feminists, many are openly mentally unstable and claim that being with other openly mentally unstable people and targeting their hate towards others helps them. They have already made up their mind about men, we have a penis and balls, or maybe not depending on your viewpoint, but we are men and by nature of being men we are warmongers and rapists and no amount of truth or facts will change their views, that they benefit from and openly enjoy benevolent sexism and do not see the hypocrisy is irrelevant. \n\nIt's not them who we need to change but those who's views are open to change, that is usually those who are listening, undecided, that's where good women speaking up can make the difference because try as we might speaking up does nothing but get us shut down.\n\nThe end result though is always going to be a race to the bottom, too many women enjoy men and enjoy the collective of feminism, too many enjoy the benefits of benevolent sexism and enjoy the sense of belonging to a group calling themselves feminists who will not speak up but at the same time will claim they actually don't hate men. \n\nThen of course there are the women who don't hate men just some of the things some men do, goes the same for some women, they will not speak up because they believe their views are irrelevant, inconsequential and don't want to face the accusations of being a pick me.\n\nEventually the squeaky wheel gets the grease and these women will lose out, data shows its already begun to happen and will get worse, when it crosses that tipping point who will they have to blame, you guessed it.",
              "timestamp": "2022-01-18 14:24:00",
              "score": 2,
              "num_children": 0,
              "author": 227190,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hsyp8jj",
      "text": "fights the patriarchy?\n\nmore like complains and whines about everything while eating for the millionth time that day (khm bOdY poSitIviTy)",
      "timestamp": "2022-01-16 23:05:02",
      "score": 42,
      "num_children": 2,
      "author": 260289,
      "replies": [
        {
          "id": "hsyvy9b",
          "text": "Oh goodness, the \"body positivity\" is anything but that, they would have a meltdown if a woman decide to lose weight.",
          "timestamp": "2022-01-16 23:50:05",
          "score": 5,
          "num_children": 1,
          "replies": [
            {
              "id": "hsyw3xv",
              "text": "they had a meltdown when Adele decided to lose weight and eventually did, it was crazy",
              "timestamp": "2022-01-16 23:51:09",
              "score": 13,
              "num_children": 1,
              "author": 260289,
              "replies": [
                {
                  "id": "hsywfj1",
                  "text": "Yes, i saw the mess, and i was like, \"what if she decided to lose weight because she wanted to stay healthy, why the rage? I thought you are all about body positivity?\"",
                  "timestamp": "2022-01-16 23:53:14",
                  "score": 6,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hsywn0d",
                      "text": "to them body positivity is only for morbidly obese women. if youre a cancer survivor, an overweight man, a thin person, person with alopecia or anything else, youre not valid in their eyes.",
                      "timestamp": "2022-01-16 23:54:37",
                      "score": 8,
                      "num_children": 2,
                      "author": 260289,
                      "replies": [
                        {
                          "id": "hsyxapa",
                          "text": "So, someone may be a survivor of cancer, managing to fight with courage against that, the efforts would be vain.\n\nBut if someone put themselves on a danger to screw with their health very badly, it’s brave?\n\nI will never understand that.",
                          "timestamp": "2022-01-16 23:59:07",
                          "score": 2,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hsyxfbd",
                              "text": "i dont understand it too. their idea of body positivity is wrong. body positivity SHOULD be for everyone, but sadly well never get that",
                              "timestamp": "2022-01-16 23:59:59",
                              "score": 5,
                              "num_children": 1,
                              "author": 260289,
                              "replies": [
                                {
                                  "id": "hsyxn9g",
                                  "text": "A group should be organized, where the body positivity for all should be a thing,\nBonus if the group would be very well moderated.",
                                  "timestamp": "2022-01-17 00:01:28",
                                  "score": 2,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hsyxuov",
                                      "text": "exactly!",
                                      "timestamp": "2022-01-17 00:02:48",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 260289,
                                      "replies": [
                                        {
                                          "id": "hsyy0kc",
                                          "text": "That would be seriously great, a great place for everyone.",
                                          "timestamp": "2022-01-17 00:03:53",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ht47e4q",
                          "text": "It's not quite that vindictive, but it is highly self-serving. It's positivity and validation for any woman that does not conform to mens' sexual preferences. Female moves away from those standards -> support. She moves toward them -> vitriol.",
                          "timestamp": "2022-01-18 01:23:23",
                          "score": 1,
                          "num_children": 0,
                          "author": 192238,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "htk3sv0",
          "text": "This comment is exactly why we need to fight patriarchy 😮‍💨 so much stereotyping of women and feminists in one sentence",
          "timestamp": "2022-01-21 04:38:39",
          "score": -1,
          "num_children": 0,
          "author": 413044,
          "replies": []
        }
      ]
    },
    {
      "id": "hsychu3",
      "text": "I don't understand feminists. \n\n\nLike the patriarchy harms men and women.\n\nYet it simountansly empowers men and suppresses women?",
      "timestamp": "2022-01-16 21:41:10",
      "score": 69,
      "num_children": 4,
      "author": 67028,
      "replies": [
        {
          "id": "hsydscz",
          "text": "Yeah, they’re doing some mental gymnastics",
          "timestamp": "2022-01-16 21:49:33",
          "score": 37,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hszdzip",
          "text": "so the patriarchy is a system that benefits men and harms women except it doesn’t actually benefit men cuz it harms them (we don’t actually believe that we just say that to make an appeal for non feminists who are skeptical) but it actually benefits them cuz they’re the majority of ceos. also sewage divers but we dont talk about that cuz we dont want women’s equality in those kinds of jobs that only men do. yeah our ideology has no flaws the anti feminists must be sexist misogynists and definitely not pro womens rights supporters who have a problem with extremism",
          "timestamp": "2022-01-17 01:53:46",
          "score": 12,
          "num_children": 0,
          "author": 329348,
          "replies": []
        },
        {
          "id": "hszbq24",
          "text": "Something can be beneficial while causing issues. It puts men in a position of power over women. With that power difference does come issues on either side. I'm sure you wouldn't believe me if I told you some positive medications can have harmful side effects?",
          "timestamp": "2022-01-17 01:37:23",
          "score": -5,
          "num_children": 2,
          "replies": [
            {
              "id": "hszet9w",
              "text": "its quite literally a conspiracy theory. i would be accepting of the idea if women were literally getting turned down from all kinds of jobs across the board just cuz they have a vagina but thats not happening, at least in the first world, and especially not with more powerful positions cuz the vice president is a woman ffs. some jobs are male dominated because, well, women arent as interested in those jobs as men are. simple.",
              "timestamp": "2022-01-17 01:59:44",
              "score": 13,
              "num_children": 1,
              "author": 329348,
              "replies": [
                {
                  "id": "hszf8e7",
                  "text": "It seems hard to write off any notion of male supremacy as a \"conspiracy theory\". Why do you think that men often hold positions of power? And are a majority of the time, the head of the household? It seems a bit. Patriarchal. Dare I say.",
                  "timestamp": "2022-01-17 02:02:45",
                  "score": -7,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "hszgus1",
              "text": "> I'm sure you wouldn't believe me if I told you some positive medications can have harmful side effects?\n\nNo I know some medicines could be addictive and thus ruin thier positives if abused. \n\nAnd still it blows a hole in the whole \"Men always have the upper hand in society\" claim always made by feminists. \n\nIn reality the patriarchy now is a Skelton of what it used to be. In fact there are many ways women dominate men nowadays, things from recieveinging recognition by thier family and peers for thie issues while men are expected to handle it is just one example.",
              "timestamp": "2022-01-17 02:14:02",
              "score": 3,
              "num_children": 1,
              "author": 67028,
              "replies": [
                {
                  "id": "hszhy7j",
                  "text": "Again, an issue from the patriarchy that is bad for men. Men are viewed as the strong ones. The intelligent ones, the stoic ones. Fitting for leading roles I suppose, but then they're seen as weak for having problems. And while yes, things like the law benefit women in some aspects, the sexes are stilled viewed very differently.",
                  "timestamp": "2022-01-17 02:21:52",
                  "score": -3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hszj324",
                      "text": "So like I said earlier the claim made by feminists that the patriarchy only benefits men is false.",
                      "timestamp": "2022-01-17 02:30:05",
                      "score": 6,
                      "num_children": 1,
                      "author": 67028,
                      "replies": [
                        {
                          "id": "hszjn81",
                          "text": "The patriarchy has negative and positive impacts on everyone.",
                          "timestamp": "2022-01-17 02:34:07",
                          "score": 0,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hszjvif",
                              "text": "Well yeah the reason why is because it was a system meant to be worked on by both sides. Women and Men. Logically there were negatives for both sides and positives.",
                              "timestamp": "2022-01-17 02:35:48",
                              "score": 4,
                              "num_children": 1,
                              "author": 67028,
                              "replies": [
                                {
                                  "id": "hszk38c",
                                  "text": "What do you mean by \"worked on by both sides\"?",
                                  "timestamp": "2022-01-17 02:37:19",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hszl6eh",
                                      "text": "I meant that both men and women had to make sacrifices so that it would work. \n\nFor example wives would be supportive of thier husbands and thier husbands would provide for them. \n\nThe patriarchy basically needed men and women to do thier parts for the system to continue functioning.",
                                      "timestamp": "2022-01-17 02:45:04",
                                      "score": 3,
                                      "num_children": 1,
                                      "author": 67028,
                                      "replies": [
                                        {
                                          "id": "hszlmb6",
                                          "text": "True. Why does that still need to carry on into today's society, though? The patriarchy worked for it's time but it's grown outdated by now.",
                                          "timestamp": "2022-01-17 02:48:10",
                                          "score": 2,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "hszm980",
                                              "text": "Because women and men are suffering without it rn. \n\n\nFor example the destruction of the family unit was set off by sexaul liberation movements fueled by feminism in the 1970s. \n\nAnd what has it done? Only cause more issues in people lives. \n\nThe patriarchy made it that Fathers and Mothers are morally obligated to support thier children but nowadays this couldn't be farther than the truth. \n\n\nFor example[1 in 4 children lives without ever having a father figure ](https://www.fatherhood.org/father-absence-statistic)\n\nIt's not a \"Because the patriarchy\" it's because of the degradation of both men and women's underlying moral values. \n\nNot to mention secularism (Seprating  away Church or religion from governments and politics) causes lower birth rates in societies. Femenism is a secular ideology since it's a man made moral ideology and goes against what most religions would say about the relationship between men and women",
                                              "timestamp": "2022-01-17 02:52:46",
                                              "score": 2,
                                              "num_children": 0,
                                              "author": 67028,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ht1gx37",
          "text": "It only harms women it’s literally built by men for men",
          "timestamp": "2022-01-17 14:25:01",
          "score": -5,
          "num_children": 1,
          "replies": [
            {
              "id": "ht1zo20",
              "text": "Yeah the system built by men apparently tells us that women should be protected and are viewed as kind and innocent in most situations. According to the patriarchy men are viewed as disposable in order to protect women and children since they help create the new future of society. \n\n\nThese attitudes are still carried to today's world where women still receive more attention for thier issues and whenever men speaks about theirs, the feminists call them misogynists.",
              "timestamp": "2022-01-17 16:37:49",
              "score": 4,
              "num_children": 0,
              "author": 67028,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hsy5fwo",
      "text": "My dad is not a dog! I won't be a part of your system!",
      "timestamp": "2022-01-16 20:55:09",
      "score": 15,
      "num_children": 1,
      "author": 119886,
      "replies": [
        {
          "id": "ht17zae",
          "text": "So I threw it on the ground!",
          "timestamp": "2022-01-17 13:04:59",
          "score": 2,
          "num_children": 1,
          "author": 40304,
          "replies": [
            {
              "id": "ht1dt6v",
              "text": "Yes, PETA, this comment right here",
              "timestamp": "2022-01-17 13:59:15",
              "score": 3,
              "num_children": 1,
              "author": 119886,
              "replies": [
                {
                  "id": "ht1u2cl",
                  "text": "Maaan, that makes no sense.\n\nMy comment isn't a corporation.\n\nI won't be a part of this system maaan.",
                  "timestamp": "2022-01-17 16:01:06",
                  "score": 1,
                  "num_children": 0,
                  "author": 40304,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hsytgmn",
      "text": "As if the feminists aren't coming here too and pretty much saying waahh anti feminism bad lol. It goes both ways, but do they have the self awareness to recognize that? Nah..",
      "timestamp": "2022-01-16 23:33:42",
      "score": 16,
      "num_children": 0,
      "author": 296100,
      "replies": []
    },
    {
      "id": "hszcqt4",
      "text": "There’s actually a sub againstmensrights? What…the actual fuck.",
      "timestamp": "2022-01-17 01:44:42",
      "score": 10,
      "num_children": 2,
      "author": 410897,
      "replies": [
        {
          "id": "ht0bfxm",
          "text": "That pretty much describes *how* feminism fights \"for men\"",
          "timestamp": "2022-01-17 06:25:58",
          "score": 9,
          "num_children": 0,
          "author": 126706,
          "replies": []
        },
        {
          "id": "ht1xyqb",
          "text": "r/FemaleDatingStrategy is pretty much against men's rights.",
          "timestamp": "2022-01-17 16:26:55",
          "score": 3,
          "num_children": 0,
          "author": 125275,
          "replies": []
        }
      ]
    },
    {
      "id": "hsy4muj",
      "text": "Fighting the patriarchy by making the shittiest memes",
      "timestamp": "2022-01-16 20:50:04",
      "score": 30,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hsy5j83",
      "text": "Reddit moment",
      "timestamp": "2022-01-16 20:55:44",
      "score": 9,
      "num_children": 0,
      "author": 209471,
      "replies": []
    },
    {
      "id": "hsy51ki",
      "text": "MRAs fight the real enemy; feminism\n\nFeminists fight the imaginary enemy; patriarchy",
      "timestamp": "2022-01-16 20:52:37",
      "score": 63,
      "num_children": 2,
      "author": 8174,
      "replies": [
        {
          "id": "hsydq31",
          "text": "Exactly",
          "timestamp": "2022-01-16 21:49:09",
          "score": 15,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hszd8fj",
          "text": "In the west, there is no such thing as patriarchy.",
          "timestamp": "2022-01-17 01:48:16",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hsyrg7n",
      "text": "Yeah, sure, creating laws that disadvantage men and dehumanising and demonising men with narratives such as the patriarchy that they are promoting, ridiculising men's movements (like they do in that meme) and blaming men for their problems.\n\nHow helpful.\n\nAt least they gave me a reminder of why I hate them.",
      "timestamp": "2022-01-16 23:20:04",
      "score": 7,
      "num_children": 0,
      "author": 201388,
      "replies": []
    },
    {
      "id": "hsz4g9n",
      "text": "The feminist: Waaaaaah the patriarchy!😭",
      "timestamp": "2022-01-17 00:47:49",
      "score": 7,
      "num_children": 1,
      "author": 298425,
      "replies": [
        {
          "id": "hsz878a",
          "text": "Yes, I believe most would be upset about male \"superiority\". Does that come as a shock?",
          "timestamp": "2022-01-17 01:12:21",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ht06j4l",
      "text": "It's literally called \"againstmensrights.\"\n\nWhat is wrong with these people.",
      "timestamp": "2022-01-17 05:37:15",
      "score": 8,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hsydjuo",
      "text": "Can’t fight against something that isn’t real, goddammit.",
      "timestamp": "2022-01-16 21:48:05",
      "score": 16,
      "num_children": 0,
      "author": 60645,
      "replies": []
    },
    {
      "id": "hsyj4dm",
      "text": "I want to scratch my eyes out after scrolling the comments! My god, the hypocrisy!",
      "timestamp": "2022-01-16 22:24:06",
      "score": 6,
      "num_children": 0,
      "author": 303807,
      "replies": []
    },
    {
      "id": "hszufu4",
      "text": "At least it says **both** genders, as in the two of them.",
      "timestamp": "2022-01-17 03:52:49",
      "score": 2,
      "num_children": 0,
      "author": 51529,
      "replies": []
    },
    {
      "id": "ht0srgo",
      "text": "Cringe bro hELpiNG BoTh GenDeRS... pfft",
      "timestamp": "2022-01-17 09:57:08",
      "score": 4,
      "num_children": 0,
      "author": 354803,
      "replies": []
    },
    {
      "id": "ht0xvw9",
      "text": "This is so stupid. What patriarchy?! What does that even mean? They \"fight it\"? How does it help anyone? What actions are being taken that help me? Such stupidity.",
      "timestamp": "2022-01-17 11:06:22",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht0zs3i",
      "text": "Do they really think they are helping both genders? Wtf, they're beyond delusional",
      "timestamp": "2022-01-17 11:30:38",
      "score": 4,
      "num_children": 0,
      "author": 309145,
      "replies": []
    },
    {
      "id": "hsya9j1",
      "text": "Isn’t feminism supposed to \"help\" women? Making it as a fight for both genders doesn’t make sense, i believe there is a movement for that.",
      "timestamp": "2022-01-16 21:26:34",
      "score": 9,
      "num_children": 1,
      "replies": [
        {
          "id": "hsyqaho",
          "text": "Yup. Turn up to a feminist space and try to raise men’s issues (because feminism is there to “help women and men”) and you’ll be told to fuck off and set up your own space by them.",
          "timestamp": "2022-01-16 23:12:13",
          "score": 7,
          "num_children": 1,
          "author": 166286,
          "replies": [
            {
              "id": "hsyt4cc",
              "text": "Setting my own space? That won’t be too difficult really.",
              "timestamp": "2022-01-16 23:31:21",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hszfqhk",
                  "text": "Then they will come to tell you how feminism helps men so you don’t need your own space lol",
                  "timestamp": "2022-01-17 02:06:09",
                  "score": 6,
                  "num_children": 1,
                  "author": 238547,
                  "replies": [
                    {
                      "id": "hszg0zb",
                      "text": "By hating men, \n\nIn the west, feminism does very little to nothing, but men doesn’t have much rights, the justice is always taking the same side.",
                      "timestamp": "2022-01-17 02:08:02",
                      "score": 3,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hsye3rs",
      "text": "[removed]",
      "timestamp": "2022-01-16 21:51:35",
      "score": 7,
      "num_children": 1,
      "replies": [
        {
          "id": "hsygdl9",
          "text": "Of course! The patriarchy is so horrible! (Does not apply to dates, where the man must pay, or how men are sent to war, and handle the hard labor jobs, and create the phones they share low quality jokes on)\n\nMasculinity is toxic unless it benefits me or comes from other women.",
          "timestamp": "2022-01-16 22:06:18",
          "score": 5,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hsykmdm",
      "text": "😐",
      "timestamp": "2022-01-16 22:34:04",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht03e85",
      "text": "The MRA: Fights against hate-based attacks against both genders, thus protecting both genders.\nThe feminist: Waaah he called me ugly, imma doxx him!\nThere, fixed it.",
      "timestamp": "2022-01-17 05:08:06",
      "score": 3,
      "num_children": 0,
      "author": 406881,
      "replies": []
    },
    {
      "id": "ht1boiv",
      "text": "why the feminazis so stupid",
      "timestamp": "2022-01-17 13:40:28",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht230g6",
      "text": "\"againstmensrights\" and they claim to help men as well as women? theyre just full of shit",
      "timestamp": "2022-01-17 16:59:10",
      "score": 3,
      "num_children": 0,
      "author": 63250,
      "replies": []
    },
    {
      "id": "hsyieiq",
      "text": "There is a against men rights subreddit? God fucking hell what the actual fuck people how does stuff like that not get banned for i dont know hate speech or sexism i mean what the actual fuck",
      "timestamp": "2022-01-16 22:19:24",
      "score": 10,
      "num_children": 1,
      "author": 13309,
      "replies": [
        {
          "id": "hsyw3sj",
          "text": "Double standard, it’s the only answer, \"hate for thee, not for me\".",
          "timestamp": "2022-01-16 23:51:07",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hsyhwuj",
      "text": "Its only a matter of time before some femcels raid r/mensrights and this subreddit.ofc reddit wont do anything about it tho",
      "timestamp": "2022-01-16 22:16:15",
      "score": 6,
      "num_children": 0,
      "author": 267755,
      "replies": []
    },
    {
      "id": "hsyvbbh",
      "text": "Wait this sub exists without being tooken down???",
      "timestamp": "2022-01-16 23:45:53",
      "score": 2,
      "num_children": 0,
      "author": 144277,
      "replies": []
    },
    {
      "id": "hszlqv5",
      "text": "RATIOOOOOOOOOOOOO",
      "timestamp": "2022-01-17 02:49:05",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht03tmj",
      "text": "thats pretty typical feminism illogic...",
      "timestamp": "2022-01-17 05:12:00",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht08rys",
      "text": "I mean I love the irony of the feminist taking the bravado look of a man to look capable.",
      "timestamp": "2022-01-17 05:58:52",
      "score": 2,
      "num_children": 0,
      "author": 297422,
      "replies": []
    },
    {
      "id": "ht0hqhh",
      "text": "fts... lies across the board.",
      "timestamp": "2022-01-17 07:36:26",
      "score": 2,
      "num_children": 0,
      "author": 279935,
      "replies": []
    },
    {
      "id": "ht1uts1",
      "text": "Third wave feminists only fight for men’s rights if he’s competing in her sport",
      "timestamp": "2022-01-17 16:06:14",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht2046c",
      "text": "lmao, ratio.",
      "timestamp": "2022-01-17 16:40:41",
      "score": 2,
      "num_children": 0,
      "author": 15929,
      "replies": []
    },
    {
      "id": "ht2yd8w",
      "text": "Againstmensrights, how the fuck does such a subreddit even exist?",
      "timestamp": "2022-01-17 20:17:09",
      "score": 2,
      "num_children": 0,
      "author": 307057,
      "replies": []
    },
    {
      "id": "ht3pd6l",
      "text": "I have been infiltrating some of those feminist groups on different social medias, not something as serious, like hour a week, maybe a less and this is the typical delusional thinking. \"Fight the patriarchy\" = I post some dumb one sided FB post so we can talking about how men are dumb animals. Literally the last one was about that, how men are not as emotionally sane or can not experience emotions as deeply as woman. How do you fight patriarchy by that? How to do you fight patriarchy by getting pat on your shoulders by another lady that is single for decade, doing the same meaningless job and crying on fb groups.",
      "timestamp": "2022-01-17 23:14:38",
      "score": 2,
      "num_children": 0,
      "author": 68228,
      "replies": []
    },
    {
      "id": "hsyfhv2",
      "text": "Why is this subreddit even allowed?? Imagine if the genders where switched, makes you think doesn't it?",
      "timestamp": "2022-01-16 22:00:35",
      "score": -7,
      "num_children": 3,
      "author": 101738,
      "replies": [
        {
          "id": "ht00wof",
          "text": "the gender is switched, but mens right apparently dont exist, so there wud be very less likely chance that there would be a antimensright subreddit, and r/FemaleDatingStrategy and r/Feminism is just a cesspool of females hating on men for no reason , bc there arent mens right fighters as toxic as feminists wanting execution of all men",
          "timestamp": "2022-01-17 04:45:52",
          "score": 9,
          "num_children": 0,
          "author": 270603,
          "replies": []
        },
        {
          "id": "ht04qtx",
          "text": "Lemme guess, the patriarchy and the gender pay gap?",
          "timestamp": "2022-01-17 05:20:23",
          "score": 7,
          "num_children": 1,
          "author": 409375,
          "replies": [
            {
              "id": "ht0fwjt",
              "text": "oh sorry I posted this on the wrong post, I wanted to post on this against men rights one",
              "timestamp": "2022-01-17 07:15:09",
              "score": 5,
              "num_children": 1,
              "author": 101738,
              "replies": [
                {
                  "id": "ht2ax90",
                  "text": "Oh ok. My bad",
                  "timestamp": "2022-01-17 17:49:19",
                  "score": 3,
                  "num_children": 0,
                  "author": 409375,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ht0blql",
          "text": "Which one do you mean?",
          "timestamp": "2022-01-17 06:27:41",
          "score": 2,
          "num_children": 1,
          "author": 126706,
          "replies": [
            {
              "id": "ht0g4iz",
              "text": "I posted on the wrong one, wanted to post on the against mens rights sorry",
              "timestamp": "2022-01-17 07:17:41",
              "score": 6,
              "num_children": 1,
              "author": 101738,
              "replies": [
                {
                  "id": "ht0kbiu",
                  "text": "Good luck getting banned there!",
                  "timestamp": "2022-01-17 08:07:22",
                  "score": 5,
                  "num_children": 0,
                  "author": 126706,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hsyd1cr",
      "text": "Both sides are not understanding each other well enough.",
      "timestamp": "2022-01-16 21:44:47",
      "score": -5,
      "num_children": 1,
      "author": 50178,
      "replies": [
        {
          "id": "hsygluw",
          "text": "What do you mean by that?",
          "timestamp": "2022-01-16 22:07:48",
          "score": 2,
          "num_children": 2,
          "replies": [
            {
              "id": "hsyib3f",
              "text": "Not OC but I could probably explain. Both movements fight for (or are supposed to) very similar issues. Parental rights, Education, even sexual harassment just to name a few. The thing is, they only want it for themselves and/or their gender. Both sides get really uncomfortable when you want to include the opposite gender in the issue they’re fighting for. People are also basically banned from any public debate on this topic since the forums don’t allow a different, disagreeing opinion. Stucking themselves in an echo chamber.",
              "timestamp": "2022-01-16 22:18:48",
              "score": 6,
              "num_children": 0,
              "author": 64421,
              "replies": []
            },
            {
              "id": "hsypoua",
              "text": "I mean that both sides are not understanding each other well enough",
              "timestamp": "2022-01-16 23:08:08",
              "score": -2,
              "num_children": 0,
              "author": 50178,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}