{
  "id": "s6h3d2",
  "text": "The alt right playbook\n",
  "timestamp": "2022-01-17 22:37:14",
  "score": 5402,
  "subreddit": "t5_3fdcn",
  "num_children": 17,
  "replies": [
    {
      "id": "ht3jutx",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-01-17 22:37:14",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "ht45kyj",
      "text": "Honestly, I think it's more that they pretend MLK agreed with them all along. They ignore the majority of what he said and did and cherry pick a handful of sentences out of context to make it seem like he would have supported their position.",
      "timestamp": "2022-01-18 01:10:23",
      "score": 158,
      "num_children": 2,
      "author": 65384,
      "replies": [
        {
          "id": "ht5a7iu",
          "text": "Almost like what they do with Jesus. A Jew wanting to provide a better life for poor and under privileged people? Lol as if conservatives would support any part of that.",
          "timestamp": "2022-01-18 06:27:08",
          "score": 54,
          "num_children": 1,
          "author": 285979,
          "replies": [
            {
              "id": "ht6iwgh",
              "text": "The craziest part is is that Jesus never existed. Jesus was created by the Romans as a propaganda tool in order to control the Jewish people who were revolting at the time. By creating a pacifist leader who turned the other cheek, they quashed the rebellion. \n\n\nSee Kenneth Humphreys",
              "timestamp": "2022-01-18 14:41:01",
              "score": 13,
              "num_children": 2,
              "author": 44483,
              "replies": [
                {
                  "id": "ht6yjyk",
                  "text": ">The craziest part is is that Jesus never existed.\n\nOh I agree. The people I reference thoroughly believe he did exist though.",
                  "timestamp": "2022-01-18 16:24:14",
                  "score": 7,
                  "num_children": 0,
                  "author": 285979,
                  "replies": []
                },
                {
                  "id": "htbcegk",
                  "text": "There is more historical evidence for Jesus than there is for Alexander the Great, and most people believe he existed. \n\nYou don't have to believe Jesus is the son of God, but the existence part is non debatable. It's consensus among historians, atheist and religious alike, that Jesus was a historical figure.",
                  "timestamp": "2022-01-19 13:27:06",
                  "score": 0,
                  "num_children": 1,
                  "author": 231811,
                  "replies": [
                    {
                      "id": "hte846z",
                      "text": "[removed]",
                      "timestamp": "2022-01-20 00:46:49",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "htf2dnx",
                          "text": "Lmao ok you know more than the historians who spent decades researching his life. Sure.",
                          "timestamp": "2022-01-20 04:35:05",
                          "score": 2,
                          "num_children": 0,
                          "author": 231811,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ht5ig9i",
          "text": "One of the most infuriating conversations I've ever had was with a conservative who claimed MLK didn't see race and *never* wanted us to examine issues through the lens of race. Obviously this was idiotic on the face of it, but like 10 people linked and quoted the part of the Birmingham letter where he calls out \"white moderates\" and this dipshit *still* claimed otherwise.",
          "timestamp": "2022-01-18 08:02:27",
          "score": 21,
          "num_children": 1,
          "author": 58970,
          "replies": [
            {
              "id": "ht6i4xh",
              "text": "That's just amazing. The guy literally never heard a single speech of King's if he thinks that, and to just pretend he knows everything King... they say progressives live in a bubble you know 😑",
              "timestamp": "2022-01-18 14:35:37",
              "score": 10,
              "num_children": 0,
              "author": 84883,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ht3x2fb",
      "text": "Just like they did with Jesus, Martin Luther and Abraham Lincoln",
      "timestamp": "2022-01-18 00:09:23",
      "score": 174,
      "num_children": 3,
      "author": 75959,
      "replies": [
        {
          "id": "ht5r4v5",
          "text": "I just wanted to say i smile whenever I see your profile. You are so right, God loves everyone, and he would hate to see modern day republican “christians”",
          "timestamp": "2022-01-18 09:57:50",
          "score": 9,
          "num_children": 2,
          "author": 10827,
          "replies": [
            {
              "id": "ht5yd1b",
              "text": "The Yeshua profile pic looks like a dude you’d find down at the pub and have a few drinks with, then come out of it with a new friend",
              "timestamp": "2022-01-18 11:32:22",
              "score": 6,
              "num_children": 0,
              "author": 349826,
              "replies": []
            },
            {
              "id": "huiegno",
              "text": ">God loves everyone\n\nExcept Lgbt people like me",
              "timestamp": "2022-01-27 23:45:47",
              "score": 2,
              "num_children": 0,
              "author": 175052,
              "replies": []
            }
          ]
        },
        {
          "id": "ht5bnc3",
          "text": "Martin Luther was a huge anti semite, do you really like his views?",
          "timestamp": "2022-01-18 06:42:40",
          "score": -20,
          "num_children": 1,
          "author": 395554,
          "replies": [
            {
              "id": "ht5j659",
              "text": "Edit edit: ppl keep downvoting the comment I replied to, but I'm arguing that they're correct. Not sure why I'm upvoted since ppl seem to disagree. Point is that Martin Luther was kind of a piece of shit.\n\nMartin Luther was also a raging misogynist. His goal wasn't to form a protestant church, which is what ended up happening, but instead to simply reform the catholic church. He had good arguments against the catholic church of the time (as there are arguments against it now as well as much of institutionalized Christianity). But he was antiscience, against people like Galileo, who went against church authorities to publish the truth. And again, raging misogyny. You're not off base to be critical of Martin Luther. I say this as a Christian who was raised protestant. People valorize him for his 99 theses, but I'm not so sure that's called for. And as you say, Christian antisemitism is a serious problem and has been for centuries. Martin Luther was part of that problem.\n\nEven MLK had some shortcomings. That said, he was murdered in cold blood while working to further a movement that owed much to the work of black women. So the way I see it, OG Martin Luther was arguably far worse than even Jesus on women's issues. But MLK, while not perfect, has a legacy genuinely worthy of an actual defense in public life and in our history books. Especially when the right seeks to whitewash him.\n\nEdit: also, related to the original comment on this thread, Lincoln himself is also not really a good antiracist figure. But I'll leave explaining that to some else because my thumbs are tired.",
              "timestamp": "2022-01-18 08:11:35",
              "score": 16,
              "num_children": 0,
              "author": 94229,
              "replies": []
            }
          ]
        },
        {
          "id": "htahyo8",
          "text": "reminder Lincoln suppressed free speech during the civil war. the party that cries \"But muh free speech\" when called out on their bullshit, hiding behind a president who actually made certain speech illegal is always hilarious.",
          "timestamp": "2022-01-19 07:31:48",
          "score": 1,
          "num_children": 0,
          "author": 284386,
          "replies": []
        }
      ]
    },
    {
      "id": "ht3qzd9",
      "text": "Immortal Technique is the shit",
      "timestamp": "2022-01-17 23:25:58",
      "score": 61,
      "num_children": 3,
      "author": 109933,
      "replies": [
        {
          "id": "ht4d4a3",
          "text": "I wish he would drop some new shit. I haven't seen anything of his in so damn long",
          "timestamp": "2022-01-18 02:03:51",
          "score": 17,
          "num_children": 1,
          "author": 40674,
          "replies": [
            {
              "id": "ht52j11",
              "text": "For real! Check [this dude](https://kiteemart.bandcamp.com/album/illiquidities-ep) out. Not the same style as Technique but similar subject matter on track 2 and 5 of that album. And crazy bars",
              "timestamp": "2022-01-18 05:12:40",
              "score": 5,
              "num_children": 1,
              "author": 109933,
              "replies": [
                {
                  "id": "ht8c692",
                  "text": "Subject matter is on point with immortal, beats are solid but the flows are a bit jumbled, reminds me of old Dr Dre, delivery wise. He does have some verses that are amazing with the delivery so I can dig it, he sounds like flobots lead singer too which is pretty cool.",
                  "timestamp": "2022-01-18 21:28:36",
                  "score": 2,
                  "num_children": 1,
                  "author": 40674,
                  "replies": [
                    {
                      "id": "ht9zims",
                      "text": "I didn’t think of those comparisons but I can see them. And yeah his flow is pretty dense, it always takes me multiple plays to catch everything he’s saying.",
                      "timestamp": "2022-01-19 04:28:21",
                      "score": 1,
                      "num_children": 0,
                      "author": 109933,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ht4f2dv",
          "text": "He's so [Obnoxious.](https://youtu.be/JYLtRE6m9RQ)",
          "timestamp": "2022-01-18 02:17:13",
          "score": 7,
          "num_children": 1,
          "author": 217845,
          "replies": [
            {
              "id": "ht51xco",
              "text": "Muthafucka can’t I tell what that link is without even clicking it?! Lmao",
              "timestamp": "2022-01-18 05:07:16",
              "score": 4,
              "num_children": 0,
              "author": 109933,
              "replies": []
            }
          ]
        },
        {
          "id": "ht5btmu",
          "text": "Immortal Technique's contradictory nature doesn't make a lot of sense to me. He's socially conscious, but happy to use f****t as a homophobic slur. Maybe he's acknowledged his own cognitive dissonance hypocrite behavior here and stopped it though.\n\nIt's a real head scratcher. And yes, I know this was normal behavior for hip-hop artists, but come on.\n\nI'm not saying cancel the guy, but some explanation of what the fuck his headspace was would be interesting. Some introspective apology or some shit.",
          "timestamp": "2022-01-18 06:44:34",
          "score": 0,
          "num_children": 2,
          "replies": [
            {
              "id": "ht5foa5",
              "text": "I can’t speak for him, but I’m pretty sure it’s because he grew up not only in an era when that was a lot more common than it is now, but also in very rough neighborhoods (and went to prison). \n\nIn those type of environments, toxic masculinity was and still is a defense/survival mechanism. Even guys who don’t believe in it are compelled to act and speak that way, because if they don’t (and especially if they speak out against it), they’re likely to be seen as soft and be targeted by others.\n\nAs Boots from The Coup put it,\n\n[“Every day I pulls a front so nobody pulls my card/ I got a mirror in my pocket and I practice lookin hard”](https://youtu.be/-2dicsWEB4Y)\n\nI’m not justifying it, but I also don’t judge him or others who come from subcultures like that. It’s one of the many harms that impoverishment does to people.",
              "timestamp": "2022-01-18 07:28:27",
              "score": 7,
              "num_children": 2,
              "author": 109933,
              "replies": [
                {
                  "id": "ht5tt9a",
                  "text": "Mad to think that him and Lin-Manuel Miranda went to school together. Two sides of a coin there....",
                  "timestamp": "2022-01-18 10:34:14",
                  "score": 2,
                  "num_children": 1,
                  "author": 10232,
                  "replies": [
                    {
                      "id": "ht65kez",
                      "text": "Two very different life paths. One to prison, the other to art school.",
                      "timestamp": "2022-01-18 12:51:29",
                      "score": 2,
                      "num_children": 0,
                      "author": 283840,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ht99heh",
                  "text": "All of this is true and it's a good take honestly. It's all shit that we're all learning as we've grown - we normalized a lot of straight up shit and frankly treated ourselves like disposable garbage too.\n\nTribe (correct me if I'm wrong) were seemingly the first guys to really go against this and question their programming.\n\nI do absolutely think Immortal Technique has had some introspective thoughts regarding his own behavior whereas Eminem (for example) just doesn't give a fuck and has made his entire career largely out of being just a shock rock controversial solely for the sake of being controversial loudmouth ignoramus.\n\nThere's like legitimately nothing authentic at all about Marshall. Dude is a straight up puppet with talent (which is a shame). He'll say whatever is advantageous for him just like Johnny Rotten.",
                  "timestamp": "2022-01-19 01:12:19",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hta1xc1",
                      "text": "Yeah we all have cultural baggage to shed for sure. I once heard Brother Ali talk about how he regretted having used the f slur in his older music. And it’s been really awesome to see his content progress from mostly ego flexing to messages of universal love and justice!\n\nI haven’t heard Technique talk about it but he strikes me as a humble and educated dude. If he hasn’t yet unpacked that baggage I bet he will when he’s ready. \n\nI don’t recall Tribe explicitly going against that type of programming, but they did have a chiller vibe than most. \n\nI’m not sure if they were the first but if you’ve never heard that Coup album “Kill My Landlord” from my link above, definitely check it out. That was from 1993, and in 94 they dropped “Genocide and Juice.” Both of those were extremely revolutionary especially for that era. \n\nAnd though they probably had some toxic masculine energy due to being from the mean streets of Oakland, their DJ was a woman and a lot of their messages were pro feminist. Like in their song “The Coup” from KML, Boots spits\n\n> The uzis that were once used to kill each other\n\n> are now used to serve and protect the brothers\n\n> And the sisters cuz they packin 45’s and 9’s\n\n> We down for revolution not just down for they behinds\n\nIn 19 fucking 93. Around the same time Snoop and Dre and them were pushing nothing but bitches this and hoes that. No wonder the industry made them household names and blacklisted groups like The Coup, smh\n\nAnd agreed, I was never a fan of Eminem. Obviously talented but his vocal tone is obnoxious to me, and of course so is his shock value content. \n\nI did gain some respect for him a few years back though, when he did that BET cypher shitting on trump. Mainly because he said something to the effect of “if you’re a fan of me and also a fan of him, then fuck off I don’t want you as a fan”\n\nGranted, he could afford to lose fans at that point in his career, and I’m not saying he deserved the Nobel prize or anything. But I respected it because he was one of the few massively popular voices who probably had a lot of trump supporters in his following, some of whom might have taken a step back and reconsidered when they heard that. Anyways",
                      "timestamp": "2022-01-19 04:48:52",
                      "score": 1,
                      "num_children": 0,
                      "author": 109933,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ht5iink",
              "text": "[removed]",
              "timestamp": "2022-01-18 08:03:20",
              "score": 0,
              "num_children": 1,
              "replies": [
                {
                  "id": "ht7a4w6",
                  "text": "Is this satire? Because I feel you're overreacting more than the commenter.",
                  "timestamp": "2022-01-18 17:35:56",
                  "score": 0,
                  "num_children": 0,
                  "author": 345096,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ht3yh3x",
      "text": "“Injustice anywhere is a threat to justice everywhere\"",
      "timestamp": "2022-01-18 00:19:28",
      "score": 13,
      "num_children": 0,
      "author": 76031,
      "replies": []
    },
    {
      "id": "ht462lb",
      "text": "Tom McDonald wishes he was Tech",
      "timestamp": "2022-01-18 01:13:53",
      "score": 8,
      "num_children": 0,
      "author": 392190,
      "replies": []
    },
    {
      "id": "ht3lap8",
      "text": "Sorry, but [THIS](https://www.youtube.com/playlist?list=PLJA_jUddXvY7v0VkYRbANnTnzkA_HMFtQ) is the Alt-Right (Read: Nazi) playbook.",
      "timestamp": "2022-01-17 22:46:48",
      "score": 26,
      "num_children": 1,
      "replies": [
        {
          "id": "ht3m7a2",
          "text": "Yes I know. I wasn’t literally trying to make the connection to the link of the alt right playbook YouTube channel. My title was meant to convey that this is what the alt right always does.",
          "timestamp": "2022-01-17 22:52:50",
          "score": 21,
          "num_children": 1,
          "replies": [
            {
              "id": "ht3mz8r",
              "text": "Oh, I know, but I saw an opportunity to plug the manual on them, and took it.\n\nI'm also rather grumpy atm, because politics.",
              "timestamp": "2022-01-17 22:58:07",
              "score": 24,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ht49462",
      "text": "While the alt-right are trying to claim him, don't forget his letter from the Birmingham Jail:\n\n\"First, I must confess that over the past few years I have been gravely disappointed with the white moderate. I have almost reached the regrettable conclusion that the Negro’s great stumbling block in his stride toward freedom is not the White Citizen’s Council-er or the Ku Klux Klanner, but the white moderate, who is more devoted to 'order' than to justice; who prefers a negative peace which is the absence of tension to a positive peace which is the presence of justice; who constantly says: 'I agree with you in the goal you seek, but I cannot agree with your methods of direct action'; who paternalistically believes he can set the timetable for another man’s freedom; who lives by a mythical concept of time and who constantly advises the Negro to wait for a 'more convenient season.' Shallow understanding from people of good will is more frustrating than absolute misunderstanding from people of ill will. Lukewarm acceptance is much more bewildering than outright rejection.\"",
      "timestamp": "2022-01-18 01:35:43",
      "score": 15,
      "num_children": 0,
      "author": 332113,
      "replies": []
    },
    {
      "id": "ht5leda",
      "text": "\"During the lifetime of great revolutionaries, the oppressing classes constantly hounded them, received their theories with the most savage malice, the most furious hatred and the most unscrupulous campaigns of lies and slander. After their death, attempts are made to convert them into harmless icons, to canonize them, so to say, and to hallow their names to a certain extent for the “consolation” of the oppressed classes and with the object of duping the latter, while at the same time robbing the revolutionary theory of its substance, blunting its revolutionary edge and vulgarizing it.\"\n\n-- Lenin, in the very first paragraph of *The State and Revolution*",
      "timestamp": "2022-01-18 08:40:41",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht4umz7",
      "text": "It was in that Birmingham jail cell that he wrote a warning about political moderates who'd derail the movement and care more about preserving the status quo than making any meaningful change.",
      "timestamp": "2022-01-18 04:06:59",
      "score": 9,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht5hs04",
      "text": "Well, MLK had a lot to say about homosexuality and womens rights the alt right agrees absolutely with.",
      "timestamp": "2022-01-18 07:54:04",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht5fl38",
      "text": "First paragraph of State and Revolution",
      "timestamp": "2022-01-18 07:27:22",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht4aao8",
      "text": "They should look into this bearded German guy that MLK was fond of",
      "timestamp": "2022-01-18 01:44:07",
      "score": 4,
      "num_children": 2,
      "author": 380227,
      "replies": [
        {
          "id": "ht5bnmj",
          "text": "you talking about Abraham Lincoln's pen pal?",
          "timestamp": "2022-01-18 06:42:45",
          "score": 3,
          "num_children": 1,
          "author": 100279,
          "replies": [
            {
              "id": "ht77lwf",
              "text": "You mean the guy Albert Einstein was a big fan of?",
              "timestamp": "2022-01-18 17:20:27",
              "score": 1,
              "num_children": 0,
              "author": 328013,
              "replies": []
            }
          ]
        },
        {
          "id": "ht4ugrk",
          "text": "I don’t know why you’re being downvoted for suggesting that Marx should be read, when mlk himself was a socialist and believed in redistributing economic power and resources. \n\nNote, he said he was a democratic socialist, not a social democrat. King wanted capitalism gone, not reformed.",
          "timestamp": "2022-01-18 04:05:39",
          "score": 10,
          "num_children": 0,
          "author": 226030,
          "replies": []
        }
      ]
    },
    {
      "id": "ht69rgv",
      "text": "History repeats itself. The same people MLK scorned in his day (the white moderate.) today hold his name firmly in obstruction of racial equality.",
      "timestamp": "2022-01-18 13:30:38",
      "score": 0,
      "num_children": 0,
      "author": 90353,
      "replies": []
    },
    {
      "id": "ht7alr0",
      "text": "I think this dodge ram Truck as was peak MLK misappropriation https://www.youtube.com/watch?v=QUsz51Ep39U&ab\\_channel=CNNBusiness",
      "timestamp": "2022-01-18 17:38:49",
      "score": 1,
      "num_children": 0,
      "author": 120473,
      "replies": []
    },
    {
      "id": "huohw8e",
      "text": "Cool",
      "timestamp": "2022-01-29 04:18:54",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht4v3tb",
      "text": "What has the alt right done to pervert MLKs teachings?",
      "timestamp": "2022-01-18 04:10:37",
      "score": -15,
      "num_children": 2,
      "author": 197187,
      "replies": [
        {
          "id": "ht4w436",
          "text": "they have whitewashed him and ignored that he was a socialist?\n\noh and they use the whole \"content of character\" to attack anything that tries to deal with racial discrimination and as a defense of being accused of racism.",
          "timestamp": "2022-01-18 04:18:28",
          "score": 17,
          "num_children": 0,
          "author": 100279,
          "replies": []
        },
        {
          "id": "ht4xf92",
          "text": "Exist. \nCo-opt like one sentence over and over (color of skin/content of character bit, which was about his own children specifically and not white trust fund kids who joined the Gravy Seals).\nCherry-pick. \nIgnore like 99% of what he actually wrote or said. \nUse his criticism of then-contemporary “race theory” to (again, in bad faith) complain about now-contemporary race theory (without knowing what any of these things mean).\nSay he was against “redistribution” of wealth, when he talked about that constantly and actually used the word “redistribution” multiple times.\nSay he would be “appalled” at BLM when he was basically the embodiment/figurehead of the proto-BLM movements.\nAccidentally forget that he was talking about police brutality explicitly 50 years ago while defending police brutality today.",
          "timestamp": "2022-01-18 04:28:54",
          "score": 15,
          "num_children": 0,
          "author": 326816,
          "replies": []
        }
      ]
    }
  ]
}