{
  "id": "s76c5u",
  "text": "Anon describes humanity\n",
  "timestamp": "2022-01-18 19:59:56",
  "score": 11420,
  "subreddit": "t5_2qh4w",
  "num_children": 54,
  "author": 678,
  "replies": [
    {
      "id": "ht7zoqu",
      "text": "\\>find hot rock  \n\\>hot rock make water hot  \n\\>steam turn grug wheel",
      "timestamp": "2022-01-18 20:12:48",
      "score": 1887,
      "num_children": 2,
      "replies": [
        {
          "id": "ht84knm",
          "text": "And somehow it's the cleanest, safest, most advanced, and ideal way we can currently create energy.\n\nYet the general public wants NFTs, crypto, and Teslas which all trace back to dirty coal and environmental destruction",
          "timestamp": "2022-01-18 20:42:24",
          "score": 922,
          "num_children": 19,
          "replies": [
            {
              "id": "ht9dc6v",
              "text": "I'm pretty sure no one thinks NFTs or Tesla are energy sources",
              "timestamp": "2022-01-19 01:40:32",
              "score": 13,
              "num_children": 1,
              "author": 38751,
              "replies": [
                {
                  "id": "ht9ith2",
                  "text": "They're more detrimental to the environment to produce, despite people thinking they're some kind of new-age revolution. Nuclear is less detrimental to the environment than the means by which Teslas and crypto are produced. That thing between your ears is a paperweight",
                  "timestamp": "2022-01-19 02:20:23",
                  "score": -4,
                  "num_children": 3,
                  "replies": [
                    {
                      "id": "ht9zeov",
                      "text": "While i understand where you are coming from, the issue isnt mining or crypto or tesla batteries, but rather the form that energy is being produced. Nordic countries are producing a significant portion of their electricity via renewable sources, should they stop using that energy as they please? If anything, this further drives the point that we should be fighting FOR more renewable sources of energy, rather than stiff innovation for the sake of agendas. I mean, should we stop people from using the internet/tv/radio since most of the electricity provided to it is from \"dirty processes\"? Let people want what they want, fight the good fight and recognize the root of the issues, so that the solution can work for everyone.",
                      "timestamp": "2022-01-19 04:27:27",
                      "score": 3,
                      "num_children": 0,
                      "author": 66568,
                      "replies": []
                    },
                    {
                      "id": "htal5ks",
                      "text": "You're still literally comparing an energy source and an energy sink. Which makes zero sense even if you're right on crypto being horrible for environment.",
                      "timestamp": "2022-01-19 08:11:18",
                      "score": 2,
                      "num_children": 0,
                      "author": 38751,
                      "replies": []
                    },
                    {
                      "id": "htapfdz",
                      "text": "Well, those are still pretty different categories. Teslas are electric cars that only needs better engineering to actually become net positive, and for that we need time and people using, no tech comes out of the box already working perfectly. Crypto on the hand is a pretty useless tech, that might solve some niche problem, but in order to solve it uses a ton of energy in the process. Even if crypto was perfected, it would never be a net positive.",
                      "timestamp": "2022-01-19 09:07:10",
                      "score": 1,
                      "num_children": 0,
                      "author": 314553,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ht91aqz",
              "text": "Almost as if there is a financial interest to certain institutions that nuclear power is bashed in the media and made to look unpopular.",
              "timestamp": "2022-01-19 00:13:24",
              "score": 29,
              "num_children": 1,
              "author": 219004,
              "replies": [
                {
                  "id": "htag18n",
                  "text": "Almost as if nuclear fetishists on reddit don't know what the risks are when this comes up and pretend it's jesustech. It's always muh radioactive bananas and muh more cancer deaths from coal and shit.\n\nMeanwhile I live next to a decommissioned nuclear power plant where the fuel rods have rusted into their *temporary* storage causing concerns about leakage into the nearby river and groundwater and causing a massive cleanup. Another power plant not far away has recently been caught fudging numbers in a massive research scandal of international proportions.\n\nOh, and in the decommissioning process, they discovered *two new reactors* that *should* have been disposed of in the 60s but weren't. As for accidents, even here, even now we're living with the consequences of Chernobyl where we *still* have to \"downfeed\" sheep who have been grazing while in the mountains in order to make the mutton slightly less glowy. It's been 36 years. We were barely even operating a reactor ourselves when Windscale struck so that's two nuclear accidents causing problems for people who were not even remotely involved with them.\n\nI trust nuclear. I don't trust politicians to not over- or under-regulate it, corporations to cut corners on safety or humans operating it not to get lazy or complacent.",
                  "timestamp": "2022-01-19 07:09:20",
                  "score": -1,
                  "num_children": 2,
                  "author": 367951,
                  "replies": [
                    {
                      "id": "htammoa",
                      "text": "You had me riled up in the first half like that shit only happens because people fuck it up nuclear is great. Then reading the last paragraph I can't help but completely agree. God damnit",
                      "timestamp": "2022-01-19 08:30:15",
                      "score": 10,
                      "num_children": 0,
                      "author": 311818,
                      "replies": []
                    },
                    {
                      "id": "htakton",
                      "text": "Well we can use Thorium instead of Uranium now so most of your point is kinda moot.\n\nBut yeah fuck politicians they never do anything right",
                      "timestamp": "2022-01-19 08:07:09",
                      "score": 2,
                      "num_children": 1,
                      "author": 296705,
                      "replies": [
                        {
                          "id": "htals30",
                          "text": "Alternatively we can just build regular, modern power plants but find appropriate places for them. I'd have zero issues with a regular reactor deep in a mountain, far the fuck away from groundwater and where a meltdown means you push a big red button, run away and put up a big sign.\n\nBut we don't do that because it's jesustech where nothing ever goes wrong in any way whatsoever and, when they do, we pretend like eveyrthing is fine relative to averaging out deaths across the plant's lifetime.\n\nI don't want to average out deaths. There's a reason I don't want to live in Tijuana either but it's fine when you average out crime globally.",
                          "timestamp": "2022-01-19 08:19:21",
                          "score": 3,
                          "num_children": 1,
                          "author": 367951,
                          "replies": [
                            {
                              "id": "htam831",
                              "text": "I don't think carving out a mountain is too great for the environment either. TBH unless something kills 80% of the population then society is completely fucked",
                              "timestamp": "2022-01-19 08:25:04",
                              "score": 3,
                              "num_children": 1,
                              "author": 296705,
                              "replies": [
                                {
                                  "id": "htao2eh",
                                  "text": "If you take environmentalism seriously, you simply can't get away from nuclear power. Some countries, like my own, produce net renewable through hydro, solar and wind but that just isn't an option for most.\n\nAnd I don't want to live next to a nuclear power plant because I *have* been and the risks involved are unacceptable. And because I can hear the furious typing: I don't want to live next to a coal power plant either for different reasons.\n\nThe real world is complex. My pet peeve are #IFuckingLoveScience fedoras who ignore the human factor in everything and act as if their system of whatever will definitely work and it's only humans who screw it up.\n\nPersonally, I'm holding out for fusion and all these discussions will be moot.",
                                  "timestamp": "2022-01-19 08:49:03",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 367951,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ht8nrue",
              "text": "I think you confusing the general population with >30 suburban American males.",
              "timestamp": "2022-01-18 22:41:28",
              "score": 40,
              "num_children": 1,
              "replies": [
                {
                  "id": "ht8syit",
                  "text": "That is EXTREMELY easy to do when you don't exist outside of social media",
                  "timestamp": "2022-01-18 23:15:37",
                  "score": 27,
                  "num_children": 0,
                  "author": 39142,
                  "replies": []
                }
              ]
            },
            {
              "id": "ht8ab0z",
              "text": "Idk i think crypto teslas and all this other stuff is a good opportunity to push for more clean energy",
              "timestamp": "2022-01-18 21:17:20",
              "score": 155,
              "num_children": 4,
              "author": 52384,
              "replies": [
                {
                  "id": "ht8biur",
                  "text": "That Tesla charges from coal burning and the battery is pretty gnarly to produce and dispose of.",
                  "timestamp": "2022-01-18 21:24:39",
                  "score": 166,
                  "num_children": 8,
                  "replies": [
                    {
                      "id": "ht8i9ng",
                      "text": "It charges from coal burning just like everything else that uses electricity in a certain area does, unless the nearest power plant is nuclear.  Not sure of the point about Tesla’s, the battery situation could be improved upon for sure but I still think they’re sick.",
                      "timestamp": "2022-01-18 22:06:01",
                      "score": 129,
                      "num_children": 7,
                      "author": 405732,
                      "replies": [
                        {
                          "id": "ht9zzjs",
                          "text": "We don’t have the infrastructure to support all the electric vehicles or metaverse or bitcoin mining even with coal. Imagine if all 10 million people in la needed to charge their car in the summer when the ACs are going and there is a flex alert. The grid would collapse",
                          "timestamp": "2022-01-19 04:32:18",
                          "score": 6,
                          "num_children": 2,
                          "author": 309793,
                          "replies": [
                            {
                              "id": "htacc32",
                              "text": "Oh for sure, I totally agree that the grid needs a lot of work, but that can happen over time just like the swap to EVs, it’s not going to happen overnight but it’ll probably happen.  Also happy cake day!",
                              "timestamp": "2022-01-19 06:27:41",
                              "score": 1,
                              "num_children": 0,
                              "author": 405732,
                              "replies": []
                            },
                            {
                              "id": "htcn24t",
                              "text": "Plug in a few spare aircraft carriers and nuclear cruisers. I think there are a bunch in the mothball fleet.",
                              "timestamp": "2022-01-19 18:37:40",
                              "score": 1,
                              "num_children": 0,
                              "author": 36419,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ht9yaul",
                          "text": "[deleted]",
                          "timestamp": "2022-01-19 04:18:18",
                          "score": 31,
                          "num_children": 2,
                          "replies": [
                            {
                              "id": "htab0ds",
                              "text": "I don’t think I said anything that would be counter intuitive to that did I?  I was just mentioning that if someone thinks that something is wrong with how batteries are charged due to power generation then that’s a bit of a redundancy",
                              "timestamp": "2022-01-19 06:13:59",
                              "score": 17,
                              "num_children": 0,
                              "author": 405732,
                              "replies": []
                            },
                            {
                              "id": "htc77bz",
                              "text": "You’re not that are you, anon?",
                              "timestamp": "2022-01-19 17:00:00",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "htbet0g",
                          "text": "The problem isn't tesla in particular (though of course they have their specific issues). It's cars. Cars of any type are not sustainable, nor even really desirable. The fewer cars we have the better the future will be.\n\nI think it was Eisenhower who said it best: \"Train good, car bad, simple as.\"",
                          "timestamp": "2022-01-19 13:46:36",
                          "score": 3,
                          "num_children": 0,
                          "author": 395253,
                          "replies": []
                        },
                        {
                          "id": "htarsw5",
                          "text": "In the UK, approx half of our electricity supply comes from burning natural gas. \n\nCheckmate atheists",
                          "timestamp": "2022-01-19 09:38:50",
                          "score": 2,
                          "num_children": 0,
                          "author": 310760,
                          "replies": []
                        },
                        {
                          "id": "htcaret",
                          "text": "\"I dislike these things which happen to run on electricity, so let's use enviromentalism to justify my opinion!\" - and then they go and post it on Reddit, happily overlooking how much energy Reddit servers consume every hour.",
                          "timestamp": "2022-01-19 17:22:04",
                          "score": 2,
                          "num_children": 0,
                          "author": 93871,
                          "replies": []
                        },
                        {
                          "id": "ht8jngn",
                          "text": "No doubt they’re sick, and I think it’s the future of auto. But they will never replace the combustion engine fully.",
                          "timestamp": "2022-01-18 22:14:59",
                          "score": 5,
                          "num_children": 6,
                          "replies": [
                            {
                              "id": "ht917i1",
                              "text": "Hydrogen gel.. Which is basically just boiling water ultimately",
                              "timestamp": "2022-01-19 00:12:45",
                              "score": 8,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "ht9ygc3",
                                  "text": "Time is a flat fucking circle",
                                  "timestamp": "2022-01-19 04:19:33",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 250980,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "htawnuu",
                              "text": "Isn’t this like saying the combustion engine will never replace the horse fully?",
                              "timestamp": "2022-01-19 10:42:14",
                              "score": 4,
                              "num_children": 2,
                              "author": 293152,
                              "replies": [
                                {
                                  "id": "htbphuh",
                                  "text": "Yes, fully.",
                                  "timestamp": "2022-01-19 15:04:32",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 43419,
                                  "replies": []
                                },
                                {
                                  "id": "htcbbhz",
                                  "text": "I just went combustion engine back riding a few minutes ago.",
                                  "timestamp": "2022-01-19 17:25:27",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 306634,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "ht8k1om",
                              "text": "I think I mostly agree there, obviously there’s a bit of a classic charm to ICEs but with the way things are headed they’re going to be functionally subpar in due time.",
                              "timestamp": "2022-01-18 22:17:30",
                              "score": 26,
                              "num_children": 3,
                              "author": 405732,
                              "replies": [
                                {
                                  "id": "ht8u7kl",
                                  "text": "Until your electric car breaks and you get fucked repairs from the genius bar",
                                  "timestamp": "2022-01-18 23:24:05",
                                  "score": 34,
                                  "num_children": 2,
                                  "author": 363441,
                                  "replies": [
                                    {
                                      "id": "ht8vge1",
                                      "text": "Oh for sure, that’s something that hopefully can be curbed in time",
                                      "timestamp": "2022-01-18 23:32:37",
                                      "score": 12,
                                      "num_children": 1,
                                      "author": 405732,
                                      "replies": [
                                        {
                                          "id": "ht8xcd1",
                                          "text": "Doubt it. Like any other tech products they're trying to keep those things as black boxes that only corporate approved technicians are allowed to fix.",
                                          "timestamp": "2022-01-18 23:45:47",
                                          "score": 26,
                                          "num_children": 3,
                                          "author": 363441,
                                          "replies": [
                                            {
                                              "id": "ht90ee9",
                                              "text": "Oh I mean, for sure some corporations are going to want to min max that profit and enact scummy policy to do so.  But battery technology is going to grow a lot soon, that’s my prediction anyway, it’s currently what I’m studying and hoping to work in the field of",
                                              "timestamp": "2022-01-19 00:07:04",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 405732,
                                              "replies": [
                                                {
                                                  "id": "ht91p2n",
                                                  "text": "Batteries aren't my main concern, you could build a super sketch diy battery bank if you really wanted to. The bigger problem is the on board electronics that control everything. We already see it happen with current cars where everything gets routed through the infotainment computer. If that breaks then you're fucked. If there's a software issue then you're fucked. If cars go the way of Apple products and a sensor breaks you're fucked.",
                                                  "timestamp": "2022-01-19 00:16:14",
                                                  "score": 7,
                                                  "num_children": 2,
                                                  "author": 363441,
                                                  "replies": [
                                                    {
                                                      "id": "ht94jbe",
                                                      "text": "exactly. see: john deere tractors which have been doing this to its fullest extent since it was technologically possible. farmers get ukrainian software in order to jailbreak the internal computer so they don’t get shafted with costs",
                                                      "timestamp": "2022-01-19 00:35:54",
                                                      "score": 12,
                                                      "num_children": 0,
                                                      "author": 334751,
                                                      "replies": []
                                                    },
                                                    {
                                                      "id": "htamvry",
                                                      "text": "There will be plug and play solutions to these problems, you may have to import them from China or Russia but cars are too big and expensive to remain a closed ecosystem",
                                                      "timestamp": "2022-01-19 08:33:35",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "htasfu0",
                                                          "text": "I hope I'm wrong, but apple has already shown that they can prevent parts swapping with drm built into the parts. Current gen iPhones will lose functionality if you swap in non factory parts, its not a stretch to say that car companies will want to do it too.",
                                                          "timestamp": "2022-01-19 09:47:19",
                                                          "score": 2,
                                                          "num_children": 0,
                                                          "author": 363441,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "ht9ey57",
                                              "text": "Sheeat. \n\nMotor broken? Order new motor. Bolt it on and plug it in.\n\nFixed. No more carburetor rebuilds, distributor caps, cam head leaks, no more any of that bullshit.\n\nJust a simple electric motor that will be hot swappable.",
                                              "timestamp": "2022-01-19 01:52:13",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 4442,
                                              "replies": [
                                                {
                                                  "id": "ht9ikiz",
                                                  "text": ">thinks you will be able to buy the motors\n\n>thinks that they won't be hardware ID'd and need a a special tool only available to first party repair shops to \"calibrate\" them\n\nThe world you knew is over boomer. They don't want you to be able to repair your own stuff, and now they can make it to where you can't.",
                                                  "timestamp": "2022-01-19 02:18:35",
                                                  "score": 13,
                                                  "num_children": 1,
                                                  "author": 363441,
                                                  "replies": [
                                                    {
                                                      "id": "htu9r7m",
                                                      "text": "\"They\"\n\nyou're such a cuck.",
                                                      "timestamp": "2022-01-23 04:35:23",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 4442,
                                                      "replies": [
                                                        {
                                                          "id": "htuaom3",
                                                          "text": ">it took them 4 days to come up with that one\n\nSneed",
                                                          "timestamp": "2022-01-23 04:42:45",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 363441,
                                                          "replies": [
                                                            {
                                                              "id": "htvzqw5",
                                                              "text": "i don't live on reddit, cringelord",
                                                              "timestamp": "2022-01-23 15:26:09",
                                                              "score": 1,
                                                              "num_children": 1,
                                                              "author": 4442,
                                                              "replies": [
                                                                {
                                                                  "id": "htw0ruw",
                                                                  "text": "Calm down my guy, no need to be so angry",
                                                                  "timestamp": "2022-01-23 15:33:21",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "author": 363441,
                                                                  "replies": [
                                                                    {
                                                                      "id": "hu480dl",
                                                                      "text": "Who's angry, friend?",
                                                                      "timestamp": "2022-01-25 05:16:07",
                                                                      "score": 1,
                                                                      "num_children": 1,
                                                                      "author": 4442,
                                                                      "replies": [
                                                                        {
                                                                          "id": "hu4b31e",
                                                                          "text": ">i don't live on reddit\n\n>still absolutely seething a week later",
                                                                          "timestamp": "2022-01-25 05:45:16",
                                                                          "score": 1,
                                                                          "num_children": 1,
                                                                          "author": 363441,
                                                                          "replies": [
                                                                            {
                                                                              "id": "huae4jz",
                                                                              "text": "I recommend [therapy](https://zombo.com/) for you, who can't seem to let things go.",
                                                                              "timestamp": "2022-01-26 12:59:02",
                                                                              "score": 1,
                                                                              "num_children": 1,
                                                                              "author": 4442,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "huc0h4x",
                                                                                  "text": ">still responding \n\n>i don't live on reddit\n\nI think at this point we can consider that one a lie",
                                                                                  "timestamp": "2022-01-26 19:16:58",
                                                                                  "score": 1,
                                                                                  "num_children": 1,
                                                                                  "author": 363441,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "hul4oiz",
                                                                                      "text": "[removed]",
                                                                                      "timestamp": "2022-01-28 14:37:48",
                                                                                      "score": 1,
                                                                                      "num_children": 1,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "hul4qla",
                                                                                          "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```f4gg0t```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
                                                                                          "timestamp": "2022-01-28 14:38:12",
                                                                                          "score": 1,
                                                                                          "num_children": 0,
                                                                                          "author": 184140,
                                                                                          "replies": []
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "hta6o0z",
                                              "text": "That, and the teensy issue of making the last mistake of your life should something go wrong.",
                                              "timestamp": "2022-01-19 05:31:33",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 126618,
                                              "replies": [
                                                {
                                                  "id": "htabayt",
                                                  "text": "If you're rtarded maybe, but this goes beyond self repair. Companies like Apple, John Deer, tesla and who ever makes mcdick's ice cream machines don't want anyone but themselves to be able to repair their stuff. That means no taking it to your local mechanic, no taking it to Juan down the street, not even taking it to get screwed over by the mechanic at the used car dealership.",
                                                  "timestamp": "2022-01-19 06:17:01",
                                                  "score": 5,
                                                  "num_children": 0,
                                                  "author": 363441,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "hta9f33",
                                      "text": "Because the mechanic industry isn’t gonna transition?  There’s still tons of mechanical parts in these vehicles.",
                                      "timestamp": "2022-01-19 05:58:03",
                                      "score": 8,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "htabyvq",
                                          "text": "Its not that there will be no mechanics its that there will be no parts, or you will need a proprietary tool only available to certified technicians to \"calibrate\" new parts. Its already hard enough to get Tesla parts and companies like John Deer and Apple have shown that you can make something basically unserviceable at the end user level through software obfuscation. If you don't think that's where the auto industry is headed, especially with a re-engineering of how cars work, then you're an idiot.",
                                          "timestamp": "2022-01-19 06:23:52",
                                          "score": 10,
                                          "num_children": 5,
                                          "author": 363441,
                                          "replies": [
                                            {
                                              "id": "htafaer",
                                              "text": "I mean yeah, that's assuming Tesla takes over the entire EV and automotive markets.\n\nI'm going to go on a whim and assume there will be others to compete with Tesla in the EV market, companies that would use right to repair as an advantage over Tesla.\n\nElectric cars have been around as long as combustion engines have, and the interest of early 1900 millionaires dictated which way we take transportation (also why we abandoned mass public transportation in favor of everyone having their own car).",
                                              "timestamp": "2022-01-19 07:00:41",
                                              "score": 2,
                                              "num_children": 2,
                                              "author": 365216,
                                              "replies": [
                                                {
                                                  "id": "htafu23",
                                                  "text": "In europe we have public transport bruv, and seems more people use it because its a) cheaper b) usually gets on time",
                                                  "timestamp": "2022-01-19 07:07:01",
                                                  "score": 3,
                                                  "num_children": 1,
                                                  "author": 109689,
                                                  "replies": [
                                                    {
                                                      "id": "htagm0p",
                                                      "text": "Sorry, I should have specified here in the US.",
                                                      "timestamp": "2022-01-19 07:16:08",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 365216,
                                                      "replies": [
                                                        {
                                                          "id": "htagrky",
                                                          "text": "Sometimes im sorry for people in US that dont have a car, also from what i know some places doesnt even consider having buses Yes?",
                                                          "timestamp": "2022-01-19 07:17:58",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 109689,
                                                          "replies": [
                                                            {
                                                              "id": "htahvau",
                                                              "text": "Yeah, for the most part, public transport tends to be less accessible the further away you get from the city.\n\nWe used to have a bigger network of rail lines, but we traded that away for our highway systems.",
                                                              "timestamp": "2022-01-19 07:30:42",
                                                              "score": 1,
                                                              "num_children": 0,
                                                              "author": 365216,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                },
                                                {
                                                  "id": "htailc0",
                                                  "text": ">I mean yeah, that's assuming Tesla takes over the entire EV and automotive markets.\n\n>I'm going to go on a whim and assume there will be others to compete with Tesla in the EV market\n\nWhy do you think other manufacturers won't also lock their shit down? All of the big ones already are trying to, to some extent.\n\n>companies that would use right to repair as an advantage over Tesla.\n\nMost consumers don't give a shit, the popularity of Apple proves that.\n\n>Electric cars have been around as long as combustion engines have, and the interest of early 1900 millionaires dictated which way we take transportation\n\nThe reason why electric cars never caught on until recently was because of battery technology. Its not until the last 15 years that we've had batteries capable of holding enough energy, and capable of holding enough power, for them to be usable as anything other than a novelty.\n\n>also why we abandoned mass public transportation in favor of everyone having their own car\n\nHow I know you've never lived outside of a major city in your life",
                                                  "timestamp": "2022-01-19 07:39:23",
                                                  "score": 2,
                                                  "num_children": 1,
                                                  "author": 363441,
                                                  "replies": [
                                                    {
                                                      "id": "htaqj5m",
                                                      "text": "The Rockefellers did have a huge hand going the direction of the combustion engine over the electric engine.",
                                                      "timestamp": "2022-01-19 09:21:49",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 365216,
                                                      "replies": [
                                                        {
                                                          "id": "htarj3z",
                                                          "text": "Doesn't change the fact that until cheap lithium batteries practical electric cars weren't possible.",
                                                          "timestamp": "2022-01-19 09:35:07",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 363441,
                                                          "replies": [
                                                            {
                                                              "id": "htauu95",
                                                              "text": "Right, lithium batteries for recharge.\n\nAnd I am not saying that replacing car batteries would have been practical either (because lets face it, if we did commit to electricity earlier, we would have battery depots instead of gas stations), but that doesn't change the fact that the decision to go with combustion engines gave it a several decade head start in advancements.",
                                                              "timestamp": "2022-01-19 10:18:56",
                                                              "score": 1,
                                                              "num_children": 0,
                                                              "author": 365216,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "htagjkk",
                                              "text": "A lot of countries have laws specific to car repairs that mean manufacturers have to make their parts available or they won’t be approved for sale",
                                              "timestamp": "2022-01-19 07:15:21",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 15213,
                                              "replies": [
                                                {
                                                  "id": "htairtf",
                                                  "text": "See what I said about needing a proprietary tool.",
                                                  "timestamp": "2022-01-19 07:41:36",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "author": 363441,
                                                  "replies": []
                                                }
                                              ]
                                            },
                                            {
                                              "id": "htbk8az",
                                              "text": "That has nothing to do with electrical engines though that’s just a result of integrating computers into cars, which we started doing a long time ago. You can have an electrical system completely devoid of software.",
                                              "timestamp": "2022-01-19 14:27:36",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 92376,
                                              "replies": [
                                                {
                                                  "id": "htcvi2d",
                                                  "text": "You can't really with how modern electric cars are designed.",
                                                  "timestamp": "2022-01-19 19:29:34",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 363441,
                                                  "replies": [
                                                    {
                                                      "id": "htdb593",
                                                      "text": "You can’t with modern non electric cars either. I don’t know if there are any cars being currently produced that don’t have some software built into them.",
                                                      "timestamp": "2022-01-19 21:05:47",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "author": 92376,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "htf8pn7",
                                              "text": "Bro, I mean this in the nicest way possible, but please shut up.  You are either parroting something you've heard someone else say or don't understand how cars work.\n\nThe only meaningful difference between an ICE and and EV is the engine / electric motor.\n\nAn EV still has brake pads that will wear out (likely faster due to the extra weight), still will need tires (weight applies here too), still has ball joints, control arms, tie rods, springs, shock absorbers...  The list goes on.  All the mechanical stuff that makes a car a car is still there and just as basic as it's always been.\n\nIf you can change the brakes on an 80's econo-box you can do it on a Tesla.  \n\nIt's all the same basic crap.  Literally.  Not like figuratively literally but actually literally.\n\nDo you think that because an EV has no gasoline motor that the power window motors won't fail in 10 years?  Or the electric motor under the hood (floor actually) makes it somehow harder to fix dents or repair body panels after a crash?\n\nLook, I agree that some things will be more difficult, but a car is like 80% ancillary equipment that functions completely independently from the propulsion source. \n\nIf you want to repair your fancy EV yourself you most likely can.",
                                              "timestamp": "2022-01-20 05:30:14",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 130895,
                                              "replies": [
                                                {
                                                  "id": "htfav4m",
                                                  "text": "You've clearly misunderstood my entire point but okay",
                                                  "timestamp": "2022-01-20 05:50:09",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 363441,
                                                  "replies": [
                                                    {
                                                      "id": "hth4jj4",
                                                      "text": ">Its not that there will be no mechanics its that there will be no parts, or you will need a proprietary tool only available to certified technicians to \"calibrate\" new parts. \n\nHow do you calibrate a brake pad?  The process for doing a front end alignment will always be basically the same.  Replacing the AC compressor is still just a basic job.  This is obvious if you've ever actually worked on a car.\n\n\n\n>Its already hard enough to get Tesla parts and companies like John Deer and Apple have shown that you can make something basically unserviceable at the end user level through software obfuscation. \n\nPlease explain how the manufacturer can obfuscate a ball joint.  They can hide the software for the drive system, sure.  They can keep the wiring diagrams secret, but that doesn't affect the majority of the mechanical systems on a car.\n\n\n>If you don't think that's where the auto industry is headed, especially with a re-engineering of how cars work, \n\nOk, I'll bite.  How are they \"re-engineering how cars work\"?  Please explain in as much detail as possible.\n\n\n>then you're an idiot.\n\nFine.  I'm an idiot.",
                                                      "timestamp": "2022-01-20 16:28:06",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 130895,
                                                      "replies": [
                                                        {
                                                          "id": "hthzc00",
                                                          "text": "First you want me to shut up and now you ask me more questions. Make up your mind my guy.",
                                                          "timestamp": "2022-01-20 19:35:23",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 363441,
                                                          "replies": [
                                                            {
                                                              "id": "htis0fu",
                                                              "text": "Yo.  \n\n> Fine.  I'm an idiot.\n\nI think that just about says it all.\n\nOr something.",
                                                              "timestamp": "2022-01-20 22:52:10",
                                                              "score": 1,
                                                              "num_children": 0,
                                                              "author": 130895,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "htap4wr",
                                              "text": "So in your vision of the future, all competent mechanics disappear off the face of the earth and Tesla replaces them with idiots?\n\nAnd for the record I bet there’s 10 non-apple store places within a 25 mile radius of you that could repair your iPhone if it broke.",
                                              "timestamp": "2022-01-19 09:03:16",
                                              "score": 0,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "htaq8kf",
                                                  "text": "Learn to read you rtard",
                                                  "timestamp": "2022-01-19 09:17:50",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 363441,
                                                  "replies": [
                                                    {
                                                      "id": "htaqwx1",
                                                      "text": "There will be no parts?  You are a fucking moron.",
                                                      "timestamp": "2022-01-19 09:26:49",
                                                      "score": 0,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "htas79h",
                                                          "text": "Again learn to read. My position is pretty clear in my comments. Its not my fault that you have a sub 90 iq and are incapable of 1st grade reading comprehension.",
                                                          "timestamp": "2022-01-19 09:44:11",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 363441,
                                                          "replies": [
                                                            {
                                                              "id": "htb1ed5",
                                                              "text": "Day drinking again?",
                                                              "timestamp": "2022-01-19 11:39:29",
                                                              "score": 1,
                                                              "num_children": 0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "ht8sgfi",
                                  "text": "Functionality is only one part of the equation.",
                                  "timestamp": "2022-01-18 23:12:15",
                                  "score": 2,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "ht8ved0",
                                      "text": "Imo the biggest part but very true",
                                      "timestamp": "2022-01-18 23:32:13",
                                      "score": 4,
                                      "num_children": 0,
                                      "author": 405732,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "htbsipy",
                                  "text": "Synthetic fuels.",
                                  "timestamp": "2022-01-19 15:25:10",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 91663,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hta6uor",
                              "text": "[deleted]",
                              "timestamp": "2022-01-19 05:33:18",
                              "score": 1,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "htaglwi",
                                  "text": "Speed from electric doesn’t get me going like speed from explosions and fire. Sorry you can’t compare these things 1:1 they are just not the same.",
                                  "timestamp": "2022-01-19 07:16:06",
                                  "score": 3,
                                  "num_children": 0,
                                  "replies": []
                                },
                                {
                                  "id": "htamkt3",
                                  "text": "We don’t have enough easily accessible lithium for that",
                                  "timestamp": "2022-01-19 08:29:35",
                                  "score": 4,
                                  "num_children": 0,
                                  "author": 8497,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "htbrxy6",
                              "text": "That's what they said about steam engines",
                              "timestamp": "2022-01-19 15:21:17",
                              "score": 1,
                              "num_children": 0,
                              "author": 322244,
                              "replies": []
                            },
                            {
                              "id": "ht9lt69",
                              "text": "Wow so one company's product can't replace the entire previous market fully, you really burned them there",
                              "timestamp": "2022-01-19 02:41:58",
                              "score": -2,
                              "num_children": 1,
                              "author": 261177,
                              "replies": [
                                {
                                  "id": "ht9pbja",
                                  "text": "Nobody is talking to you, I never implied it should. Fuck off child.\n\nI’ve also inhaled helium from a balloon before, with that comment I’m not implying I will switch to helium.",
                                  "timestamp": "2022-01-19 03:07:33",
                                  "score": -3,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "htabyv4",
                          "text": "I wouldn't bank on the battery situation being improved upon. Unless there's new physics discovered.",
                          "timestamp": "2022-01-19 06:23:52",
                          "score": 0,
                          "num_children": 0,
                          "author": 180845,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ht9d7pj",
                      "text": "A coal burning power plant is way more efficient than any IC engine. Powering from the grid is a net gain with just about any fuel source compared to gasoline.",
                      "timestamp": "2022-01-19 01:39:37",
                      "score": 25,
                      "num_children": 2,
                      "author": 384518,
                      "replies": [
                        {
                          "id": "ht9f2ym",
                          "text": "Do you have a source on that?\r  \n\r  \nSource?\r  \n\r  \nA source. I need a source.\r  \n\r  \nSorry, I mean I need a source that explicitly states your argument. This is just tangential to the discussion.\r  \n\r  \nNo, you can't make inferences and observations from the sources you've gathered. Any additional comments from you MUST be a subset of the information from the sources you've gathered.\r  \n\r  \nYou can't make normative statements from empirical evidence.\r  \n\r  \nDo you have a degree in that field?\r  \n\r  \nA college degree? In that field?\r  \n\r  \nThen your arguments are invalid.\r  \n\r  \nNo, it doesn't matter how close those data points are correlated. Correlation does not equal causation.\r  \n\r  \nCorrelation does not equal causation.\r  \n\r  \nCORRELATION. DOES. NOT. EQUAL. CAUSATION.\r  \n\r  \nYou still haven't provided me a valid source yet.\r  \n\r  \nNope, still haven't.\r  \n\r  \nI just looked through all 308 pages of your user history, figures I'm debating a glormpf supporter. A moron.",
                          "timestamp": "2022-01-19 01:53:10",
                          "score": -13,
                          "num_children": 1,
                          "author": 4442,
                          "replies": [
                            {
                              "id": "ht9qnkj",
                              "text": "[deleted]",
                              "timestamp": "2022-01-19 03:17:48",
                              "score": 15,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "htagj8o",
                                  "text": "It's 4chan, they just like mocking \"redditors\" even when they aren't involved.",
                                  "timestamp": "2022-01-19 07:15:14",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 209746,
                                  "replies": [
                                    {
                                      "id": "htalo6u",
                                      "text": "It's a redditor pretending they're a 4chan poster, the only person they're mocking is themselves.",
                                      "timestamp": "2022-01-19 08:17:59",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 118306,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "htr76h8",
                                  "text": "Do you have a source on that?\r  \n\r  \nSource?\r  \n\r  \nA source. I need a source.\r  \n\r  \nSorry, I mean I need a source that explicitly states your argument. This is just tangential to the discussion.\r  \n\r  \nNo, you can't make inferences and observations from the sources you've gathered. Any additional comments from you MUST be a subset of the information from the sources you've gathered.\r  \n\r  \nYou can't make normative statements from empirical evidence.\r  \n\r  \nDo you have a degree in that field?\r  \n\r  \nA college degree? In that field?\r  \n\r  \nThen your arguments are invalid.\r  \n\r  \nNo, it doesn't matter how close those data points are correlated. Correlation does not equal causation.\r  \n\r  \nCorrelation does not equal causation.\r  \n\r  \nCORRELATION. DOES. NOT. EQUAL. CAUSATION.\r  \n\r  \nYou still haven't provided me a valid source yet.\r  \n\r  \nNope, still haven't.\r  \n\r  \nI just looked through all 308 pages of your user history, figures I'm debating a glormpf supporter. A moron.",
                                  "timestamp": "2022-01-22 15:57:54",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 4442,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "htfgfpr",
                          "text": "also it's easier to find out if the coal plant is putting out too much pollution, as opposed to tracking down every Joe Shmoe who cut off and pawned off his catalytic converter.",
                          "timestamp": "2022-01-20 06:46:40",
                          "score": 1,
                          "num_children": 0,
                          "author": 21072,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ht9eadd",
                      "text": "So burning coal is bad but burning oil/gas is good?\n\nTeslas have the potential to NOT run on coal anyways. If we continue to work on stuff like nuclear power",
                      "timestamp": "2022-01-19 01:47:25",
                      "score": 11,
                      "num_children": 2,
                      "author": 152222,
                      "replies": [
                        {
                          "id": "ht9edxq",
                          "text": "The batteries are a problem.",
                          "timestamp": "2022-01-19 01:48:09",
                          "score": 6,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ht9eon6",
                              "text": "Everything is a fucking problem. There is no environmental solution short of biking, which is not an option for most.",
                              "timestamp": "2022-01-19 01:50:19",
                              "score": 16,
                              "num_children": 2,
                              "author": 152222,
                              "replies": [
                                {
                                  "id": "ht9no2k",
                                  "text": "Not an option for most because the modern city is built around the wasteful and polluting single-family detached house and car. Greenhouse gas emissions are a symptom of the problem, and trying to fix the symptom instead of the problem isn't the right approach.",
                                  "timestamp": "2022-01-19 02:55:28",
                                  "score": 5,
                                  "num_children": 2,
                                  "author": 238073,
                                  "replies": [
                                    {
                                      "id": "ht9t9ir",
                                      "text": "While true, its vastly easier to convince people to fix the symptoms, and to actually do it, then to fix the inherent problem with city design. Both is the correct answer.",
                                      "timestamp": "2022-01-19 03:38:21",
                                      "score": 4,
                                      "num_children": 0,
                                      "author": 33690,
                                      "replies": []
                                    },
                                    {
                                      "id": "ht9yvmk",
                                      "text": "No one is stopping you from living in the pod.\n\nHave fun, and don't forget your bug protein",
                                      "timestamp": "2022-01-19 04:23:05",
                                      "score": 3,
                                      "num_children": 0,
                                      "author": 4888,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "hte1hhi",
                                  "text": "Well bikes use steel and plastics. So… walking\n\nBut shoes are made with plastics or leather, and we also consume food to be able to walk…\n\nFood requires killing animals, directly or indirectly and also uses a lot of chemicals again directly or indirectly…\n\nSo yeah.  Mass suicide it is!",
                                  "timestamp": "2022-01-19 23:57:33",
                                  "score": 0,
                                  "num_children": 0,
                                  "author": 97955,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "htbf2b3",
                          "text": "Oil and gas produce less emissions than coal per unit of energy. We still need to transition off of them, but it's not possible to jump ship tomorrow.",
                          "timestamp": "2022-01-19 13:48:38",
                          "score": 1,
                          "num_children": 0,
                          "author": 152019,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ht8g1tg",
                      "text": "Coal burning really isn't that big of a deal everyone acts like it's the worst thing in the world but it's not",
                      "timestamp": "2022-01-18 21:52:14",
                      "score": -7,
                      "num_children": 2,
                      "author": 162372,
                      "replies": [
                        {
                          "id": "ht8qngi",
                          "text": "/pol/ would like to have a word with you",
                          "timestamp": "2022-01-18 23:00:06",
                          "score": 6,
                          "num_children": 0,
                          "author": 89343,
                          "replies": []
                        },
                        {
                          "id": "ht8im44",
                          "text": "Its dangerous to mine, burning it produces a lot of things that are harmful to humans and other life, and its a major contributor to climate change.\n\nIts the worst way of making electricity, other thing going for it is its cheap, though solar seems to be cheaper now.",
                          "timestamp": "2022-01-18 22:08:13",
                          "score": 20,
                          "num_children": 3,
                          "author": 401076,
                          "replies": [
                            {
                              "id": "ht94yu7",
                              "text": "It’s also black",
                              "timestamp": "2022-01-19 00:38:54",
                              "score": 18,
                              "num_children": 0,
                              "author": 4613,
                              "replies": []
                            },
                            {
                              "id": "ht8qg27",
                              "text": ">Coal is dangerous to mine\n\n>Let's mine Lithium which is far deeper than coal and needs coal to mine\n\nReally not thinking it out are we?",
                              "timestamp": "2022-01-18 22:58:46",
                              "score": 9,
                              "num_children": 2,
                              "author": 411578,
                              "replies": [
                                {
                                  "id": "ht9006p",
                                  "text": "Quick math question, what do you think is worse?\n\nA- Widespread usage of coal to produce eletricity for a large percentage of the population\n\nB- Select mining operations for a rare metal",
                                  "timestamp": "2022-01-19 00:04:18",
                                  "score": 8,
                                  "num_children": 1,
                                  "author": 49457,
                                  "replies": [
                                    {
                                      "id": "ht9dopu",
                                      "text": "The mining for the rare metal. Solar panels seem great, the Lithium is extremely rare, it isn't very efficient and barely produces any energy whatsoever unless you have a huge field and at best that covers a few houses if you really don't use electricity that much.\n\nYou can pretend the ambition is worth the trade but this is for the chance of Lithium, not the promise of Lithium.\n\nIf they improve efficiently of Solar Panels then great, maybe it'll be worth it in the future. But as it stands Solar Panels last 25 years at peak efficiency for those low gains then go down to lesser.\n\nIf you want something more renewable Wind Turbines and mills despite being loud as fuck and dangerous to flying wildlife are pretty cheap, and get this can work on a cloudy day.",
                                      "timestamp": "2022-01-19 01:43:04",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 411578,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "ht9ddxt",
                                  "text": "Pointing out that lithium is also dangerous won't make coal mining less dangerous. Really not thinking it out, are we?",
                                  "timestamp": "2022-01-19 01:40:52",
                                  "score": 4,
                                  "num_children": 1,
                                  "author": 44358,
                                  "replies": [
                                    {
                                      "id": "ht9ei1n",
                                      "text": "Did you miss the part where I mentioned to mine Lithium you need coal to power machines? His argument was Coal = bad, Solar Panels= good but ignores you need to use a hell of a lot of coal to possibly get Lithium, it isn't a guarantee.\n\nMining anything is dangerous but you have to go deep for Lithium. The deeper into a vein the more expensive and costly it is.",
                                      "timestamp": "2022-01-19 01:48:58",
                                      "score": 3,
                                      "num_children": 0,
                                      "author": 411578,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "ht8j2pu",
                              "text": "People talk about biomass but coal is significantly cleaner to burn and produces fewer greenhouse gases",
                              "timestamp": "2022-01-18 22:11:12",
                              "score": -5,
                              "num_children": 3,
                              "author": 162372,
                              "replies": [
                                {
                                  "id": "ht8jif4",
                                  "text": "The good: there’s shit loads of it\n\nThe bad: it’s dirty as fuck, this is a fact. There is no such thing as clean coal.",
                                  "timestamp": "2022-01-18 22:14:05",
                                  "score": 15,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "ht8jne3",
                                      "text": "#1 myth about coal\n\nIt's necessarily dirty\n\nhttps://www.washingtonpost.com/opinions/five-myths-about-coal/2015/08/07/9aac05f2-3bd0-11e5-9c2d-ed991d848c48_story.html",
                                      "timestamp": "2022-01-18 22:14:58",
                                      "score": -12,
                                      "num_children": 3,
                                      "author": 162372,
                                      "replies": [
                                        {
                                          "id": "ht8ke6e",
                                          "text": "Wow an opinion piece on WaPo from 2015. I'm not surprised you would link something so verifiably stupid",
                                          "timestamp": "2022-01-18 22:19:44",
                                          "score": 17,
                                          "num_children": 0,
                                          "replies": []
                                        },
                                        {
                                          "id": "ht9dk8a",
                                          "text": "#Big words won't make your narrative true.",
                                          "timestamp": "2022-01-19 01:42:09",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 44358,
                                          "replies": [
                                            {
                                              "id": "ht9duej",
                                              "text": "It was just #1 but Reddit formatting made it big",
                                              "timestamp": "2022-01-19 01:44:11",
                                              "score": -1,
                                              "num_children": 0,
                                              "author": 162372,
                                              "replies": []
                                            }
                                          ]
                                        },
                                        {
                                          "id": "ht8sj7m",
                                          "text": "Hard pass homie, I’ve studied this.",
                                          "timestamp": "2022-01-18 23:12:47",
                                          "score": 4,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "ht8xdx5",
                                  "text": "Coal is literally ancient biomass, idiot. Unless the generator does 100% sequestration of gases, there's a net increase in atmospheric greenhouse gas. The carbon in coal and trees used to be in the air.",
                                  "timestamp": "2022-01-18 23:46:05",
                                  "score": 6,
                                  "num_children": 0,
                                  "author": 6522,
                                  "replies": []
                                },
                                {
                                  "id": "ht8jhkl",
                                  "text": "Cleaner to burn than nuclear energy?",
                                  "timestamp": "2022-01-18 22:13:56",
                                  "score": 5,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "ht8jp9h",
                                      "text": "Than biomass",
                                      "timestamp": "2022-01-18 22:15:17",
                                      "score": 5,
                                      "num_children": 1,
                                      "author": 162372,
                                      "replies": [
                                        {
                                          "id": "ht8k5ka",
                                          "text": "Vehicles and generators typically don't run on wood burning engines\n\nI've never heard anyone talk about biomass energy like it was an actual solution",
                                          "timestamp": "2022-01-18 22:18:12",
                                          "score": 6,
                                          "num_children": 2,
                                          "replies": [
                                            {
                                              "id": "ht8kcef",
                                              "text": "People talk about algae biomass as a legitimate solution and the energy companies even advertise it in their commercials",
                                              "timestamp": "2022-01-18 22:19:25",
                                              "score": 3,
                                              "num_children": 1,
                                              "author": 162372,
                                              "replies": [
                                                {
                                                  "id": "ht8kpeu",
                                                  "text": "Algae won't exist anymore due to all the environmental damage caused by coal and fossil fuels lol\n\nYou're already destroying your lifeline with the very thing you're trying to wean off of",
                                                  "timestamp": "2022-01-18 22:21:42",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "ht8kytd",
                                                      "text": "That's interesting because algal blooms are often cited as a dangerous repercussion of climate change but I guess they won't exist anymore so we don't have to worry!",
                                                      "timestamp": "2022-01-18 22:23:20",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 162372,
                                                      "replies": [
                                                        {
                                                          "id": "ht8nx8u",
                                                          "text": "\"The production of algae -- the foundation of the arctic food web -- depends on the presence of ice. As sea ice diminishes, algae does too\"\n\nSo you can just admit to not knowing anything and I'll believe you. What you're talking about are harmful freshwater algae blooms. So good job barely scratching the surface and still acting like an expert. Dumbass",
                                                          "timestamp": "2022-01-18 22:42:27",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "replies": [
                                                            {
                                                              "id": "ht8obll",
                                                              "text": "Right so all the algae that would be used for biomass energy production would be gone because it's in the arctic and needs ice, yeah what you said totally makes sense",
                                                              "timestamp": "2022-01-18 22:45:00",
                                                              "score": 2,
                                                              "num_children": 1,
                                                              "author": 162372,
                                                              "replies": [
                                                                {
                                                                  "id": "ht8oigk",
                                                                  "text": "Yes, let's create harmful algae to use as an energy source with the same process that destroys helpful algae. My God you're mind-numbingly stupid",
                                                                  "timestamp": "2022-01-18 22:46:14",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "replies": [
                                                                    {
                                                                      "id": "ht8opqp",
                                                                      "text": "Yeah all that algae at energy farms is so harmful to the ecosystem, good thing they're doing that instead of coal",
                                                                      "timestamp": "2022-01-18 22:47:33",
                                                                      "score": 3,
                                                                      "num_children": 1,
                                                                      "author": 162372,
                                                                      "replies": [
                                                                        {
                                                                          "id": "ht8p1pv",
                                                                          "text": "You are the poster child for the dunning Kruger effect right now. This is hilarious",
                                                                          "timestamp": "2022-01-18 22:49:40",
                                                                          "score": 1,
                                                                          "num_children": 1,
                                                                          "replies": [
                                                                            {
                                                                              "id": "ht8p7pz",
                                                                              "text": "Haha right man right nobody ever suggested biomass as a solution and coal is definitely worse than biomass energy",
                                                                              "timestamp": "2022-01-18 22:50:44",
                                                                              "score": 2,
                                                                              "num_children": 1,
                                                                              "author": 162372,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "ht8pzab",
                                                                                  "text": "??? Did you have a stroke? Is your brain short-circuiting because you tried to learn something for once?",
                                                                                  "timestamp": "2022-01-18 22:55:43",
                                                                                  "score": 1,
                                                                                  "num_children": 0,
                                                                                  "replies": []
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "ht91081",
                                              "text": "You can boil water with wood to power a turbine to charge a Tesla... Wood powered Tesla.\n\nObviously burning coal is more practical that wood, gas more practical than coal and slightly less toxic to the finite number of years we have left for exploiting fossil fuels.",
                                              "timestamp": "2022-01-19 00:11:20",
                                              "score": 1,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "ht91caa",
                                                  "text": "That was an extremely stupid train of thought you just exposed me to, thanks",
                                                  "timestamp": "2022-01-19 00:13:42",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "htar4ox",
                      "text": "Don't worry, the world supply of lithium is tiny and running out this decade so that problem will take care of itself soon!",
                      "timestamp": "2022-01-19 09:29:38",
                      "score": 1,
                      "num_children": 1,
                      "author": 189733,
                      "replies": [
                        {
                          "id": "htbq3ti",
                          "text": "Glad you have it all figured out, why aren’t these mega corporations listening to your wisdom?",
                          "timestamp": "2022-01-19 15:08:40",
                          "score": 1,
                          "num_children": 1,
                          "author": 43419,
                          "replies": [
                            {
                              "id": "htbs111",
                              "text": "They're the ones saying it. And governments are acting on it. Where the fuck have you been for the last 10 years?\n\nhttps://qz.com/2087345/chinas-lithium-mining-battery-firms-are-in-an-investment-frenzy/",
                              "timestamp": "2022-01-19 15:21:52",
                              "score": 1,
                              "num_children": 0,
                              "author": 189733,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "htb0xmt",
                      "text": "The point is that city dwellers will feel better and have cleaner air.",
                      "timestamp": "2022-01-19 11:34:08",
                      "score": 1,
                      "num_children": 0,
                      "author": 406060,
                      "replies": []
                    },
                    {
                      "id": "htbvs6m",
                      "text": "While true producing the battery is not the most environmentally friendly, the coal plant is more efficient at producing energy than a combustion engine.",
                      "timestamp": "2022-01-19 15:46:44",
                      "score": 1,
                      "num_children": 0,
                      "author": 224077,
                      "replies": []
                    },
                    {
                      "id": "htfd6o8",
                      "text": "The efficiency is higher. Electric cars pollute less than fossil fuel cars even considering purely fossil-fuel based charging.",
                      "timestamp": "2022-01-20 06:12:40",
                      "score": 1,
                      "num_children": 0,
                      "author": 217768,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ht8u9wa",
                  "text": "Sure, if they were powered by rainbows. They’re powered by coal plants.",
                  "timestamp": "2022-01-18 23:24:31",
                  "score": 4,
                  "num_children": 0,
                  "author": 315136,
                  "replies": []
                },
                {
                  "id": "htb1781",
                  "text": "I can see that argument with Tesla but I don't see how crypto could ever be a driving force for clean energy when every aspect of it is antithetical to clean energy efforts.",
                  "timestamp": "2022-01-19 11:37:13",
                  "score": 1,
                  "num_children": 0,
                  "author": 152670,
                  "replies": []
                },
                {
                  "id": "htaw397",
                  "text": "Crypto uses way too much energy to be clean, it's super dirty.",
                  "timestamp": "2022-01-19 10:35:04",
                  "score": -1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "htax6c9",
                      "text": "but if it used more clean energy it would be cleaner",
                      "timestamp": "2022-01-19 10:48:37",
                      "score": 2,
                      "num_children": 1,
                      "author": 52384,
                      "replies": [
                        {
                          "id": "htc15qn",
                          "text": "Considering we currently need that clean energy for things that are actually important your point is irrelevant. But yeah if y'all want to run your ponzi scheme with no impact on society then go for it.",
                          "timestamp": "2022-01-19 16:21:53",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ht8tsnt",
              "text": "those are all powered by electricity. You can have nuclear power and everything you mentioned, they aren’t competing.",
              "timestamp": "2022-01-18 23:21:18",
              "score": 22,
              "num_children": 2,
              "author": 156862,
              "replies": [
                {
                  "id": "htavyh7",
                  "text": "I swear the internet is more upset about NFTs than they are about coal/gas power.",
                  "timestamp": "2022-01-19 10:33:21",
                  "score": 4,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "ht914mc",
                  "text": ".....where do you think the electricity comes from in the Asian countries mining crypto?",
                  "timestamp": "2022-01-19 00:12:11",
                  "score": 0,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "ht93ojp",
                      "text": "coal.\n\nThat’s not the point though you never answered my question.",
                      "timestamp": "2022-01-19 00:30:14",
                      "score": 5,
                      "num_children": 1,
                      "author": 156862,
                      "replies": [
                        {
                          "id": "ht97c7a",
                          "text": "Because you didn't ask one, genius",
                          "timestamp": "2022-01-19 00:56:08",
                          "score": 9,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ht97w1q",
                              "text": "thats a fair point\n\nI am on drugs tbf",
                              "timestamp": "2022-01-19 01:00:25",
                              "score": 13,
                              "num_children": 0,
                              "author": 156862,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "htaw0j6",
                      "text": "And that's the only way to generate power? Interesting. \n\nWhy have I never seen anyone complain about asian coal industries?",
                      "timestamp": "2022-01-19 10:34:05",
                      "score": 2,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ht9vtvj",
              "text": "[removed]",
              "timestamp": "2022-01-19 03:58:35",
              "score": 6,
              "num_children": 1,
              "replies": [
                {
                  "id": "ht9yg7o",
                  "text": ">What is wrong with you and why are you not more ashamed of yourself?\n\nThat's a more complex question for another day",
                  "timestamp": "2022-01-19 04:19:32",
                  "score": 4,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ht9u89e",
              "text": "pretty sure there are plenty of nuclear power plants creating electricity to charge teslas",
              "timestamp": "2022-01-19 03:45:57",
              "score": 2,
              "num_children": 1,
              "author": 179213,
              "replies": [
                {
                  "id": "ht9ybz5",
                  "text": "Lmfao",
                  "timestamp": "2022-01-19 04:18:34",
                  "score": 0,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hta09wp",
                      "text": "There are nuke plants in the US, coal, wind, solar, hydro. Who is to say what the source is? Comment said Tesla traces back to dirty coal. How is that even an accurate statement to make.",
                      "timestamp": "2022-01-19 04:34:43",
                      "score": 1,
                      "num_children": 0,
                      "author": 179213,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "htamio1",
              "text": "Nah electrics are genuinely cheaper to operate than ICEs from a physics standpoint. NFTs and crypto are scams/used by the rich to launder money more securely",
              "timestamp": "2022-01-19 08:28:50",
              "score": 2,
              "num_children": 0,
              "author": 336563,
              "replies": []
            },
            {
              "id": "ht9mqfq",
              "text": "But muh solber pamble",
              "timestamp": "2022-01-19 02:48:43",
              "score": 4,
              "num_children": 0,
              "author": 31200,
              "replies": []
            },
            {
              "id": "ht926vn",
              "text": "cleanest lul yeah exept for the 2000 metric tons of stuff we have to seal and store safely for 100000 years in the US alone\n\nedit 2000 metric tons per year",
              "timestamp": "2022-01-19 00:19:45",
              "score": -3,
              "num_children": 1,
              "author": 90742,
              "replies": [
                {
                  "id": "ht979fd",
                  "text": "Tell me you don't know shit about nuclear waste without telling me you don't know shit about nuclear waste",
                  "timestamp": "2022-01-19 00:55:32",
                  "score": 12,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ht9ed3z",
              "text": "Wind/Hydro/Solar would like a word with you",
              "timestamp": "2022-01-19 01:47:59",
              "score": 0,
              "num_children": 1,
              "author": 349071,
              "replies": [
                {
                  "id": "ht9iyw7",
                  "text": "Yeah when they all team up to provide a fraction of nuclear they can have a seat at the table",
                  "timestamp": "2022-01-19 02:21:26",
                  "score": 4,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ht9pswn",
                      "text": "Imagine STILL falling for the nuclear meme, after it's been a mainstream source of power for 70 fucking years  \n\n\nIn 77 years, not a single nuclear power plant in human history, anywhere in the world, has turned a profit. Every single one of them requires significant goverment subsidies, and they lose an average of 4.8 billion euros over their lifespan. The only countries that have subsidised nuclear power have done it for military reasons. Nuclear Power being presented as a \"transition energy\" is a talking point put forward by think tanks, because anyone who actually is informed on the issue knows that nuclear power is completely unviable in a competitive market.\r  \n\r  \nhttps://www.diw.de/de/diw\\_01.c.670590.de/publikationen/weekly\\_reports/high\\_priced\\_and\\_dangerous\\_nuclear\\_power\\_is\\_not\\_an\\_option\\_for\\_the\\_climate\\_friendly\\_energy\\_mix.html\r  \n\r  \nhttps://www.kernd.de/kernd-wAssets/docs/fachzeitschrift-atw/artikel/atw\\_2019-10\\_wendland\\_peters.pdf\r  \n\r  \nNuclear power plants are more affected by climate change than any other form of energy on the market. Small changes in atmospheric temperature means that entire reactors have to be shut down. This not only causes blackouts as huge amounts of energy infastructure is no longer accessible, but also causes damage to the reactors themselves that need to be repaired over the course of weeks, as these reactors are not designed to be shut down.\r  \n\r  \nhttps://www.iaee.org/en/publications/ejarticle.aspx?id=2411\r  \n\r  \nNuclear power uses extremely high amounts of fresh water, which is stated to become the most precious resource of the 21st century. You're wasting one of the most valuable, essential, and irreplacable resources on the planet for an inefficient energy source.\r  \n\r  \nhttps://www.sciencedirect.com/science/article/abs/pii/S0301421519300084\r  \n\r  \nWe already have the infrastructure for renewable energy: the only reason coal and gas seem remotely viable is due to significant government subsidies. As soon as government subsidisation of fossil fuels stops, and the free market takes over, fossil fuels will be unable to compete with renewable energy which is cheaper, easier to set up, more resilient to climate change, and more decentralized.\r  \n\r  \nNuclear Energy think tanks has been promising it'll improve and become safe and become economically viable for 50 years, and literally nothing has changed.",
                      "timestamp": "2022-01-19 03:11:15",
                      "score": -1,
                      "num_children": 1,
                      "author": 179047,
                      "replies": [
                        {
                          "id": "ht9yax2",
                          "text": "Ghoul-poster is afraid of rads",
                          "timestamp": "2022-01-19 04:18:19",
                          "score": 7,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ht8izkz",
              "text": "*nuclear waste has entered the chat*",
              "timestamp": "2022-01-18 22:10:38",
              "score": -9,
              "num_children": 4,
              "author": 3611,
              "replies": [
                {
                  "id": "ht8kqn5",
                  "text": "Nuclear waste is only a thing because we're using nuclear tech from the 80s. There has been barely any research of nuclear energy since then because people are too scared to use it.",
                  "timestamp": "2022-01-18 22:21:55",
                  "score": 14,
                  "num_children": 1,
                  "author": 186649,
                  "replies": [
                    {
                      "id": "ht8yjp6",
                      "text": "[deleted]",
                      "timestamp": "2022-01-18 23:54:06",
                      "score": 2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ht8yys0",
                          "text": "The thing is that nuclear waste is still technically usable. The reason why it's dangerous is because it still has nuclear energy in it. By the time it's truly used up, it'd be inert.",
                          "timestamp": "2022-01-18 23:57:01",
                          "score": 4,
                          "num_children": 0,
                          "author": 186649,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ht8mdg6",
                  "text": "How many deads because of nuclear wastes? How many deads because of air pollution? Checkmate.",
                  "timestamp": "2022-01-18 22:32:25",
                  "score": 6,
                  "num_children": 0,
                  "author": 264453,
                  "replies": []
                },
                {
                  "id": "ht8xzqu",
                  "text": "Nuclear waste is reusable in things like medical equipment. Coal waste is reusable in things like killing coral reefs more effectively.",
                  "timestamp": "2022-01-18 23:50:17",
                  "score": 2,
                  "num_children": 0,
                  "author": 48135,
                  "replies": []
                },
                {
                  "id": "ht8jouj",
                  "text": "We know how to contain it. I always thought we should have shot it into space or something but I'm an idiot\n\nThe waste from coal and fossil fuels is immediately worse than nuclear waste",
                  "timestamp": "2022-01-18 22:15:13",
                  "score": 6,
                  "num_children": 3,
                  "replies": [
                    {
                      "id": "ht8rpnk",
                      "text": "Everyone brings up nuclear waste like it's some sort of checkmate, but all you have to do is encase it in steel and concrete inside of the ground. Almost all of the nuclear waste generated by volume is low level garbage and not risky like spent fuel.\n\nExample: Yucca Mountain is perfectly safe to store waste in and was closed due to purely political reasons.",
                      "timestamp": "2022-01-18 23:07:10",
                      "score": 10,
                      "num_children": 0,
                      "author": 204880,
                      "replies": []
                    },
                    {
                      "id": "hta7xhg",
                      "text": "Shooting up nuclear waste into space isn't really a good idea for 2 reasons. 1, if the rocket explodes while in atmosphere that area would be very fucked for a very long time. 2, its kinda expensive with how much there is, its cheaper to just properly design storage that is going to last and store it deep underground in safe areas.",
                      "timestamp": "2022-01-19 05:43:27",
                      "score": 2,
                      "num_children": 0,
                      "author": 377769,
                      "replies": []
                    },
                    {
                      "id": "ht8lf56",
                      "text": "True but that’s assuming no mistakes are made. Coal just means ash and shitty air quality which can be managed to a certain degree. Nuclear waste can be fucked if even one mistake is made during storage. Or if the storage container has a defect. Kinda like the old rusty ones they tried storing underground.",
                      "timestamp": "2022-01-18 22:26:14",
                      "score": -3,
                      "num_children": 1,
                      "author": 3611,
                      "replies": [
                        {
                          "id": "ht8o5ts",
                          "text": "Old rusty ones? No nuclear waste is stored in metal.\n\nWe put them into giant slabs of concrete and drop them into massive pools of water underground. No maintenance, no danger or pollution. Simple and extremely effective.",
                          "timestamp": "2022-01-18 22:43:58",
                          "score": 7,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ht8oro0",
                              "text": "I've learned that having this discussion in this sub is useless due to the amount of confidently incorrect idiots chiming in",
                              "timestamp": "2022-01-18 22:47:53",
                              "score": 5,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "ht8oyto",
                                  "text": "It's because people assume that nuclear tech peaked in Soviet Russia during the 60s.",
                                  "timestamp": "2022-01-18 22:49:10",
                                  "score": 7,
                                  "num_children": 0,
                                  "replies": []
                                },
                                {
                                  "id": "ht8qf6j",
                                  "text": "Nuclear Energy is a good test to see if someone actually wants cleaner, practical energy or not. I think its obviously necessary for the future. Its cleaner than fossil fuels and more reliable than solar and wind, which aren't even \"green\" by the same level of scrutiny anyway.",
                                  "timestamp": "2022-01-18 22:58:36",
                                  "score": 1,
                                  "num_children": 3,
                                  "author": 359233,
                                  "replies": [
                                    {
                                      "id": "ht8yfq8",
                                      "text": "Wind energy! Where the only fuel required is the very wind itself (and new fan blades) you barely need to refuel them at all!",
                                      "timestamp": "2022-01-18 23:53:20",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 48135,
                                      "replies": [
                                        {
                                          "id": "ht95a0k",
                                          "text": "Sure, but its not windy everywhere, all the time",
                                          "timestamp": "2022-01-19 00:41:00",
                                          "score": 0,
                                          "num_children": 1,
                                          "author": 359233,
                                          "replies": [
                                            {
                                              "id": "ht9c0l4",
                                              "text": "I was mostly pointing out how the blades of the fans are also fuel",
                                              "timestamp": "2022-01-19 01:30:45",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 48135,
                                              "replies": [
                                                {
                                                  "id": "ht9eqn3",
                                                  "text": "Well, a little bit of fuel isn't a big problem. Unless its more than a little bit, but I see your point.",
                                                  "timestamp": "2022-01-19 01:50:43",
                                                  "score": 0,
                                                  "num_children": 1,
                                                  "author": 359233,
                                                  "replies": [
                                                    {
                                                      "id": "ht9gbtr",
                                                      "text": "Yeah, fuel doesn't matter. I just find it funny when people say \"absolutely no fuel needed at all!\"",
                                                      "timestamp": "2022-01-19 02:02:14",
                                                      "score": 2,
                                                      "num_children": 1,
                                                      "author": 48135,
                                                      "replies": [
                                                        {
                                                          "id": "ht9hbwe",
                                                          "text": "Of course. How do they think these materials and metals get mined?",
                                                          "timestamp": "2022-01-19 02:09:33",
                                                          "score": 1,
                                                          "num_children": 0,
                                                          "author": 359233,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "ht9elzc",
                                      "text": "I've been a proponent of nuclear energy for years, the modern technology is light-years ahead of what people think about when you say the words. Between modular facilities and reuse of fuel it really is the future of clean energy. Just don't build them on fault lines or let them be run by uneducated factory workers and you're golden. We could be completely green in a decade if the green energy people would get the fuck out of their own way.",
                                      "timestamp": "2022-01-19 01:49:46",
                                      "score": 2,
                                      "num_children": 0,
                                      "replies": []
                                    },
                                    {
                                      "id": "ht8rap4",
                                      "text": "Nuclear energy and FTL travel are two things I wish I could be alive to see fully realized",
                                      "timestamp": "2022-01-18 23:04:21",
                                      "score": 1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "ht8rsg9",
                                          "text": "Well, one is very logical, the other doesn't have any proof of being possible.",
                                          "timestamp": "2022-01-18 23:07:42",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 359233,
                                          "replies": [
                                            {
                                              "id": "ht90z78",
                                              "text": "They both have about the same chance of happening within my lifetime",
                                              "timestamp": "2022-01-19 00:11:08",
                                              "score": 2,
                                              "num_children": 0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "htasy5h",
              "text": "It's a further degree or two removed from people's experience. Most people care more about the products than the infrastructure behind the products. Witness blood diamonds, factory farms, Facebook, &c.\n\nI would say that Tesla vehicles produce less pollution locally. After all, you aren't going to die running a Tesla in a closed garage, unlike an ICE vehicle. And you need to factor transportation costs for the fuel itself. It's much more inefficient to truck around gasoline so that ICE cars have a gasoline distribution network than it is to have an electrical grid.\n\nNFTs and crypto are pure speculation, get-rich-quick bubbles. Teslas are electric cars with middling autonomous driving. Not the same.",
              "timestamp": "2022-01-19 09:54:04",
              "score": 1,
              "num_children": 0,
              "author": 298439,
              "replies": []
            },
            {
              "id": "htavl8q",
              "text": "it traces back to dirty coal because it takes time to build infrastructure for modern renewable energy. There are several countries who are only on renewable already.",
              "timestamp": "2022-01-19 10:28:37",
              "score": 1,
              "num_children": 0,
              "author": 134853,
              "replies": []
            },
            {
              "id": "htb1v44",
              "text": "What are you talking about, Cryptos run off all sorts of power lol, it's whatever the nearest power plants method is, crypto miners don't seek out coal specifically they just plug their computers in and turn them on. They probably subsidise it with solar I'd imagine to save money",
              "timestamp": "2022-01-19 11:44:49",
              "score": 1,
              "num_children": 0,
              "author": 256985,
              "replies": []
            },
            {
              "id": "htb4klw",
              "text": "It's neither the safest nor the most advanced and the general public you've made up for this post doesn't exist.",
              "timestamp": "2022-01-19 12:14:17",
              "score": 1,
              "num_children": 0,
              "author": 263575,
              "replies": []
            },
            {
              "id": "hvtu59x",
              "text": "Invest in nuclear ETFs and wait for the public to come around. Either I or my children will live well. Or the world will die and none of it will matter.",
              "timestamp": "2022-02-06 16:42:07",
              "score": 1,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "htag40z",
              "text": "Not saying I 100% agree with it but the argument Jordan Peterson made on one of his podcasts is that cryptocurrency mining monetizes remote power. It also incentivizes the creation of new renewable power sources in general (there's inevitably going to be a race for it and after the race is over only the people with free power will be able to survive the lower reward rates), which in turn adds to the renewable energy pool for things other than just mining. So NFTs, being mostly based on ethereum, may actually be a good thing for the future of renewable energy.",
              "timestamp": "2022-01-19 07:10:14",
              "score": -1,
              "num_children": 0,
              "author": 209746,
              "replies": []
            },
            {
              "id": "htaezol",
              "text": "Until someone makes a mistake and a whole city is gone.",
              "timestamp": "2022-01-19 06:57:13",
              "score": 0,
              "num_children": 0,
              "author": 46837,
              "replies": []
            }
          ]
        },
        {
          "id": "i49rg0c",
          "text": ".>Long Nose Tribe tells grug he no allowed to use magic rock \n\n.>Long nose tribe tells grug he must keep burning fossil fuel-bunga \n\n.>grug confused",
          "timestamp": "2022-04-11 08:45:50",
          "score": 1,
          "num_children": 0,
          "author": 94376,
          "replies": []
        }
      ]
    },
    {
      "id": "ht8heaa",
      "text": "[deleted]",
      "timestamp": "2022-01-18 22:00:34",
      "score": 259,
      "num_children": 7,
      "replies": [
        {
          "id": "ht8mr1k",
          "text": "Woah this is so deep\n\nEpic post bro😎",
          "timestamp": "2022-01-18 22:34:51",
          "score": 79,
          "num_children": 1,
          "author": 208097,
          "replies": [
            {
              "id": "htayito",
              "text": "thanks",
              "timestamp": "2022-01-19 11:05:15",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "ht9pybg",
          "text": "I hate this so much, to wield incredible power while also being completely incapable of using it effectively",
          "timestamp": "2022-01-19 03:12:26",
          "score": 24,
          "num_children": 0,
          "author": 250979,
          "replies": []
        },
        {
          "id": "hta5mag",
          "text": "Does all this mean if Aliens come to us they will be powered by boiling water?",
          "timestamp": "2022-01-19 05:21:46",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ht8pe8l",
          "text": "Yeah that’s what this post says 👍",
          "timestamp": "2022-01-18 22:51:54",
          "score": 9,
          "num_children": 0,
          "author": 385570,
          "replies": []
        },
        {
          "id": "ht964ps",
          "text": "wait a minute, if we can make a mini star can't we have some sort of solar panel to absorb the energy? in fact, why aren't we combining solar panel technology with nuclear technology now?",
          "timestamp": "2022-01-19 00:47:09",
          "score": 5,
          "num_children": 6,
          "author": 42788,
          "replies": [
            {
              "id": "ht99pzm",
              "text": "It’s way less efficient the only reason solar makes sense is because light from the sun is free",
              "timestamp": "2022-01-19 01:14:07",
              "score": 53,
              "num_children": 2,
              "author": 7598,
              "replies": [
                {
                  "id": "htaj59g",
                  "text": "That is until Apollo stops by and hands us a power bill.",
                  "timestamp": "2022-01-19 07:46:17",
                  "score": 14,
                  "num_children": 1,
                  "author": 269835,
                  "replies": [
                    {
                      "id": "htbtsl2",
                      "text": "Damn it, not again!",
                      "timestamp": "2022-01-19 15:33:43",
                      "score": 1,
                      "num_children": 0,
                      "author": 323775,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "htbap2e",
                  "text": "He’s not wrong though it could marginally Boost efficiency if somehow you could put the sustained fusion reaction inside of a giant ball of solar panels. It could produce a small boost in efficiency if you could somehow spin it without it effecting the real energy production via turbines.",
                  "timestamp": "2022-01-19 13:12:22",
                  "score": 0,
                  "num_children": 0,
                  "author": 346482,
                  "replies": []
                }
              ]
            },
            {
              "id": "ht9nwz0",
              "text": "Photovoltaics convert photons to energy, so they like higher energy wavelengths. Obviously, it also takes much higher temperature to create those higher energy photos, far higher than what we can reasonably contain with current technology. \n\nOn the other hand, heating water to steam can use all wavelengths (meaning infrared is great, which is what we're best at generating) because the water just absorbs energy, and spinning a turbine more efficiently uses that energy than photovoltaics anyway. For scalable electricity generation it's just strictly better.",
              "timestamp": "2022-01-19 02:57:14",
              "score": 8,
              "num_children": 0,
              "author": 261177,
              "replies": []
            },
            {
              "id": "htaw4nk",
              "text": "Stars produce light via blackbody radiation, and the amount of light mostly depends on total surface area. Man-made fusion happens in a thin cloud of magnetized plasma which is compressed into a very small surface area, usually by superconducting magnets or hydraulics, because it's the only way to recreate the extreme pressures that are found in stars due to their gravity.\n\nA deuterium-tritium fusion reactor [produces more neutrons](https://i.imgur.com/rPNIh0l.png) than photons by many orders of magnitude, and scientists are indeed working on neutron capture technology to boil even more water than they normally would from the fusion heat alone. But, it's not easy as solar panels, since high-energy neutrons penetrate thru material, like gamma radiation.",
              "timestamp": "2022-01-19 10:35:32",
              "score": 2,
              "num_children": 0,
              "author": 353259,
              "replies": []
            },
            {
              "id": "htcp9e5",
              "text": "All these other answers are correct, but here's the eli5 version:\n\nStars are very hot and very bright, but they have loads more hotness than brightness, so we use the hotness instead of the brightness for power.",
              "timestamp": "2022-01-19 18:51:05",
              "score": 3,
              "num_children": 0,
              "author": 378369,
              "replies": []
            },
            {
              "id": "hta99ta",
              "text": "we cant create a mini star, its still scifi. thats the problem #1 here. if we could , capturing the *light* from it would be peanuts compared to the raw thermal energy. \n\nfor context, this mini star idea is literally the plot of spider-man 2",
              "timestamp": "2022-01-19 05:56:36",
              "score": 2,
              "num_children": 1,
              "author": 224229,
              "replies": [
                {
                  "id": "htar7ps",
                  "text": "wait spider-man 2 is not a documentary?",
                  "timestamp": "2022-01-19 09:30:45",
                  "score": 3,
                  "num_children": 0,
                  "author": 42788,
                  "replies": []
                }
              ]
            },
            {
              "id": "htbkvm8",
              "text": "Just wait, I'm sure eventually they'll come out and say that solar panels have actually just been boiling water all this time, but they wanted to sound smarter.",
              "timestamp": "2022-01-19 14:32:19",
              "score": 1,
              "num_children": 0,
              "author": 32950,
              "replies": []
            }
          ]
        },
        {
          "id": "htbai0l",
          "text": "This is why district heating is the future.",
          "timestamp": "2022-01-19 13:10:41",
          "score": 1,
          "num_children": 0,
          "author": 346482,
          "replies": []
        },
        {
          "id": "htbz0f3",
          "text": "What's even wilder is that to get tritium fuel for the fusion reactor in the first place, you would separate it via distillation from water vapour created by, you guessed it, boiling water. \n\n>[Stage 1 is a vapour phase catalytic extraction (VPCE) process which extracts the tritium in vapour form. Stage 2 is a cryogenic distillation process which then distills the tritium at low temperatures ... Ontario Power Generation can process up to 2.5 thousand tonnes (2,500 Mg) of heavy water a year, producing about 2.5 kg of tritium with a purity greater than 98%](http://www.nuclearfaq.ca/cnf_sectionD.htm#x5)\n\n^(okay you can get tritium from lithium fission also but still)",
          "timestamp": "2022-01-19 16:08:13",
          "score": 1,
          "num_children": 0,
          "author": 389977,
          "replies": []
        }
      ]
    },
    {
      "id": "ht88e9b",
      "text": "Did anon expect scientists to just find a way to absorb pure energy from uranium?",
      "timestamp": "2022-01-18 21:05:41",
      "score": 370,
      "num_children": 11,
      "author": 17837,
      "replies": [
        {
          "id": "ht8afqu",
          "text": "Yes",
          "timestamp": "2022-01-18 21:18:07",
          "score": 218,
          "num_children": 1,
          "author": 52384,
          "replies": [
            {
              "id": "hx87gun",
              "text": "Would be nice. Hydrolysis is a way to generate energy without boiling water",
              "timestamp": "2022-02-16 21:46:57",
              "score": 2,
              "num_children": 0,
              "author": 93802,
              "replies": []
            }
          ]
        },
        {
          "id": "ht8izgw",
          "text": "He thought it was the tesseract",
          "timestamp": "2022-01-18 22:10:37",
          "score": 121,
          "num_children": 0,
          "author": 678,
          "replies": []
        },
        {
          "id": "ht8tor4",
          "text": "Anon wants a future where you shove chunks of uranium into your battery slot",
          "timestamp": "2022-01-18 23:20:35",
          "score": 35,
          "num_children": 0,
          "author": 39142,
          "replies": []
        },
        {
          "id": "ht95sk6",
          "text": "It's called a [Radioisotope thermoelectric generator](https://en.wikipedia.org/wiki/Radioisotope_thermoelectric_generator), and it's been used on many projects, including both Mars rovers. So, Anon is simply misinformed, just like you.",
          "timestamp": "2022-01-19 00:44:40",
          "score": 77,
          "num_children": 5,
          "replies": [
            {
              "id": "ht9a8oe",
              "text": "Just took a read at that.  Boiling water with uranium is more efficient and cheaper.",
              "timestamp": "2022-01-19 01:17:56",
              "score": 66,
              "num_children": 2,
              "author": 17837,
              "replies": [
                {
                  "id": "ht9r51z",
                  "text": "I remember reading that pacemakers use a different method: electrons are emitted by the decaying isotope and captured by the device for power. Not sure how efficient or scalable that is, but I thought it was pretty cool.",
                  "timestamp": "2022-01-19 03:21:31",
                  "score": 18,
                  "num_children": 3,
                  "author": 92456,
                  "replies": [
                    {
                      "id": "htajkvx",
                      "text": "That's called [Betavoltaics](https://en.wikipedia.org/wiki/Betavoltaic_device)",
                      "timestamp": "2022-01-19 07:51:37",
                      "score": 15,
                      "num_children": 0,
                      "author": 190050,
                      "replies": []
                    },
                    {
                      "id": "hta88k6",
                      "text": "Absolutely cool stuff.",
                      "timestamp": "2022-01-19 05:46:24",
                      "score": 5,
                      "num_children": 0,
                      "author": 17837,
                      "replies": []
                    },
                    {
                      "id": "hvmi6s2",
                      "text": "Betavoltaic pacemakers are in no way used anymore, even though nuclear pacemakers could theoretically be safe there's just no good reason to shove radioactive materials next to someone's heart.\n\nHowever, those fuckers will never run out of power. They tended to outlive their owners, without battery replacement.",
                      "timestamp": "2022-02-04 22:44:28",
                      "score": 4,
                      "num_children": 0,
                      "author": 157710,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "htifot1",
                  "text": "RTGs are used in space because they're robust for a long time without any maintenance at all. Water for boiling must be replenished and the nuclear materials used in nuclear power plants require way more safety precautions than an RTG. Efficiency is not the only factor to consider.",
                  "timestamp": "2022-01-20 21:22:37",
                  "score": 3,
                  "num_children": 0,
                  "author": 380725,
                  "replies": []
                }
              ]
            },
            {
              "id": "ht9mvx8",
              "text": "For when you need at most several hundred watts using huge amounts of highly refined fissile material at horrific efficiency: RTGs",
              "timestamp": "2022-01-19 02:49:49",
              "score": 16,
              "num_children": 1,
              "author": 261177,
              "replies": [
                {
                  "id": "ht9u8a2",
                  "text": "But it lasts for decades without any servicing, which is worth the inefficiency when you can't access it again.",
                  "timestamp": "2022-01-19 03:45:57",
                  "score": 12,
                  "num_children": 0,
                  "author": 277136,
                  "replies": []
                }
              ]
            },
            {
              "id": "ht9rixq",
              "text": "Nope, wrong again.  Simply using heat (nuclear fission) to boil water to turn big steam turbines is still dramatically more efficient.  Turns out \"fire makes water hot and makes spinny wheel go\" is the best we've got so far.",
              "timestamp": "2022-01-19 03:24:33",
              "score": 23,
              "num_children": 1,
              "author": 42347,
              "replies": [
                {
                  "id": "ht9siy0",
                  "text": "Turns out radiating heat energy is a pretty efficient process and water is good at absorbing heat while being cheaper and more abundant than better alternatives. It also exerts great pressure when it becomes steam due to all that energy it absorbed which is good for spinning turbines.",
                  "timestamp": "2022-01-19 03:32:27",
                  "score": 14,
                  "num_children": 1,
                  "author": 121541,
                  "replies": [
                    {
                      "id": "ht9tq74",
                      "text": "Doesn't hurt that water is harmless either.  Water is pretty awesome.",
                      "timestamp": "2022-01-19 03:41:59",
                      "score": 13,
                      "num_children": 1,
                      "author": 42347,
                      "replies": [
                        {
                          "id": "htaj5wm",
                          "text": "And these motherfuckers want to go to Mars, where there is basically no water",
                          "timestamp": "2022-01-19 07:46:29",
                          "score": 10,
                          "num_children": 1,
                          "author": 189288,
                          "replies": [
                            {
                              "id": "htb7dla",
                              "text": "And the one time we try to terraform mars we get annihilated by cockroaches.",
                              "timestamp": "2022-01-19 12:42:10",
                              "score": 3,
                              "num_children": 0,
                              "author": 199548,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ht9tkam",
              "text": "RTG's are based. i wish you could buy them for personal use.",
              "timestamp": "2022-01-19 03:40:41",
              "score": 2,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hta1wv4",
              "text": "But can I build a lightsaber with it?",
              "timestamp": "2022-01-19 04:48:45",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "ht9bjnm",
          "text": "You kid, but it's being researched: https://en.wikipedia.org/wiki/Fission_fragment_reactor",
          "timestamp": "2022-01-19 01:27:17",
          "score": 17,
          "num_children": 1,
          "author": 367080,
          "replies": [
            {
              "id": "ht9xnzy",
              "text": "Extremely interesting, thank you.",
              "timestamp": "2022-01-19 04:13:10",
              "score": 2,
              "num_children": 1,
              "author": 166739,
              "replies": [
                {
                  "id": "htra24o",
                  "text": "Fission electric cell!\nFFR is for propulsion not power.",
                  "timestamp": "2022-01-22 16:17:51",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ht8ln5l",
          "text": "That's what movies said.",
          "timestamp": "2022-01-18 22:27:41",
          "score": 27,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ht9s2ky",
          "text": "I was very disappointed to learn that cold fusion also has the goal of just boiling water.",
          "timestamp": "2022-01-19 03:28:50",
          "score": 7,
          "num_children": 0,
          "author": 63757,
          "replies": []
        },
        {
          "id": "hta3uas",
          "text": "This is possible- it has powered several long-range space probes. \n\nwhen it is possible to use a steam turbine, however, doing so is vastly more efficient. Turning water into extremely hot, high pressure steam to drive a turbine is just the most efficient way to convert heat energy into electricity.",
          "timestamp": "2022-01-19 05:05:42",
          "score": 4,
          "num_children": 0,
          "author": 74088,
          "replies": []
        },
        {
          "id": "htf7ug6",
          "text": "Yes of course what else are they there for, just to boil some fucking water?",
          "timestamp": "2022-01-20 05:22:17",
          "score": 2,
          "num_children": 0,
          "author": 237334,
          "replies": []
        },
        {
          "id": "ht8xfqh",
          "text": "That’s what nuclear plants (BAD) do.",
          "timestamp": "2022-01-18 23:46:26",
          "score": 2,
          "num_children": 0,
          "author": 67973,
          "replies": []
        },
        {
          "id": "ht9vjnf",
          "text": "if we could that would be fucking awsome",
          "timestamp": "2022-01-19 03:56:19",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hta8689",
              "text": "I learned from someone in the comments that we apparently have the tech to do that, its just incredibly expensive and inefficient.",
              "timestamp": "2022-01-19 05:45:47",
              "score": 1,
              "num_children": 0,
              "author": 17837,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ht8097u",
      "text": "Anoonian should drop a red hot stone in his ass, then experience more shit boil.",
      "timestamp": "2022-01-18 20:16:17",
      "score": 32,
      "num_children": 0,
      "author": 3136,
      "replies": []
    },
    {
      "id": "ht85z42",
      "text": "Chernobyl = Slavs too stupid to boil water",
      "timestamp": "2022-01-18 20:50:56",
      "score": 992,
      "num_children": 13,
      "replies": [
        {
          "id": "ht87xek",
          "text": "Spicy water",
          "timestamp": "2022-01-18 21:02:49",
          "score": 247,
          "num_children": 1,
          "author": 260615,
          "replies": [
            {
              "id": "htadxn6",
              "text": "Angry water.",
              "timestamp": "2022-01-19 06:45:15",
              "score": 62,
              "num_children": 1,
              "author": 126926,
              "replies": [
                {
                  "id": "htb0w8g",
                  "text": "Graphite water",
                  "timestamp": "2022-01-19 11:33:41",
                  "score": 7,
                  "num_children": 1,
                  "author": 229886,
                  "replies": [
                    {
                      "id": "htf7yc0",
                      "text": "No that’s the vaccine",
                      "timestamp": "2022-01-20 05:23:15",
                      "score": 2,
                      "num_children": 0,
                      "author": 237334,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ht9cwvw",
          "text": "nah it's slavs can boil so hard that they boil the boiler itself.",
          "timestamp": "2022-01-19 01:37:24",
          "score": 27,
          "num_children": 0,
          "author": 23570,
          "replies": []
        },
        {
          "id": "ht8gbz8",
          "text": "Less about stupidity and more about reckless  incompetence from arrogant management.",
          "timestamp": "2022-01-18 21:53:58",
          "score": 166,
          "num_children": 7,
          "author": 118207,
          "replies": [
            {
              "id": "ht8mcdq",
              "text": "And workers being too scared to be the one to deliver the bad news",
              "timestamp": "2022-01-18 22:32:13",
              "score": 112,
              "num_children": 1,
              "replies": [
                {
                  "id": "ht90rdx",
                  "text": "Communism",
                  "timestamp": "2022-01-19 00:09:33",
                  "score": 96,
                  "num_children": 3,
                  "author": 284662,
                  "replies": [
                    {
                      "id": "htb3lm8",
                      "text": "Communists can’t even boil water. \n\nCompletely unemployable.",
                      "timestamp": "2022-01-19 12:03:58",
                      "score": 14,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "ht9qr1t",
                      "text": "communism is when reactor explodes",
                      "timestamp": "2022-01-19 03:18:33",
                      "score": 61,
                      "num_children": 2,
                      "author": 92456,
                      "replies": [
                        {
                          "id": "ht9tck3",
                          "text": "communism is when the water wasn't boiled right",
                          "timestamp": "2022-01-19 03:39:02",
                          "score": 54,
                          "num_children": 0,
                          "replies": []
                        },
                        {
                          "id": "htw4uqg",
                          "text": "Our reactor",
                          "timestamp": "2022-01-23 16:00:45",
                          "score": 1,
                          "num_children": 0,
                          "author": 251227,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "htceafo",
                      "text": "Communism is when bad",
                      "timestamp": "2022-01-19 17:43:38",
                      "score": 1,
                      "num_children": 0,
                      "author": 325465,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ht99tth",
              "text": "They literally decided to turn off their safety features to run a test to see how good their safety features are.  It’s like if I took off my parachute and jumped out of a plane and tried to then activate my parachute.",
              "timestamp": "2022-01-19 01:14:54",
              "score": 63,
              "num_children": 1,
              "author": 17837,
              "replies": [
                {
                  "id": "ht9eggy",
                  "text": "Slight correction, in your scenario, you had a Bungie cord, that was built to withstand 50x your weight. \n\nYou have it in good confidence that this Bungie cord will work, and it has worked a bunch of times before.\n\nHowever when you jumped off, no one told you the Bungie cord  wasn't on the plane because they were afraid you'd want your money back for the flight since you didn't want to jump anymore",
                  "timestamp": "2022-01-19 01:48:38",
                  "score": 67,
                  "num_children": 1,
                  "author": 61637,
                  "replies": [
                    {
                      "id": "htba4no",
                      "text": "> you had a Bungie cord,\n\n> the Bungie cord wasn't on the plane \n\n\nYou thought you did but you didn’t so you didn’t.",
                      "timestamp": "2022-01-19 13:07:26",
                      "score": 8,
                      "num_children": 0,
                      "author": 346482,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ht995zk",
              "text": "Nerd",
              "timestamp": "2022-01-19 01:09:55",
              "score": 8,
              "num_children": 1,
              "replies": [
                {
                  "id": "htalahj",
                  "text": "Careful guys, this is weapons grade irony.  \nSomeone posting on reddit calling someone else a nerd",
                  "timestamp": "2022-01-19 08:12:59",
                  "score": 1,
                  "num_children": 0,
                  "author": 276575,
                  "replies": []
                }
              ]
            },
            {
              "id": "ht93ifk",
              "text": "I, too, have watched HBO",
              "timestamp": "2022-01-19 00:29:01",
              "score": 29,
              "num_children": 1,
              "author": 94203,
              "replies": [
                {
                  "id": "htaysl3",
                  "text": "R/unnecessarycommas",
                  "timestamp": "2022-01-19 11:08:31",
                  "score": 0,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "hta7o93",
              "text": "Those particular reactors had a pretty bad design flaw as well that is not present in other, more modern reactors.",
              "timestamp": "2022-01-19 05:41:02",
              "score": 6,
              "num_children": 0,
              "author": 289238,
              "replies": []
            },
            {
              "id": "ht9vyns",
              "text": "Came here to say this too",
              "timestamp": "2022-01-19 03:59:39",
              "score": 1,
              "num_children": 0,
              "author": 249197,
              "replies": []
            },
            {
              "id": "htayoyt",
              "text": "That's just a long way of saying stupidity",
              "timestamp": "2022-01-19 11:07:20",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "ht9w26f",
          "text": "Too stupid or too efficient? Seems to me they boiled all the water",
          "timestamp": "2022-01-19 04:00:25",
          "score": 12,
          "num_children": 0,
          "author": 199360,
          "replies": []
        },
        {
          "id": "ht9rdaf",
          "text": "To be fair, they did boil the water. Just a little bit too much.",
          "timestamp": "2022-01-19 03:23:19",
          "score": 10,
          "num_children": 0,
          "author": 160734,
          "replies": []
        },
        {
          "id": "ht943v6",
          "text": "Tubgirl = Far-east scientists push the boundaries on hot water technology",
          "timestamp": "2022-01-19 00:32:57",
          "score": 8,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ht8itdc",
          "text": "Communist government too stupid to allocate resources for safe water boiling",
          "timestamp": "2022-01-18 22:09:31",
          "score": 40,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "htanjs2",
          "text": "fukushima = boiling water needed a stove with safety features in case shit goes wrong, but stove with safety features too expensive\n\nthree mile island = boiling water, some bad gas escaped but stove with safety features worked as expected so only small mouse fart escape instead of big hippo diarrhoea",
          "timestamp": "2022-01-19 08:42:15",
          "score": 4,
          "num_children": 0,
          "author": 357010,
          "replies": []
        },
        {
          "id": "ht8kzg7",
          "text": "Unironically true.",
          "timestamp": "2022-01-18 22:23:26",
          "score": 12,
          "num_children": 0,
          "author": 186649,
          "replies": []
        },
        {
          "id": "htb5dxg",
          "text": "Not great, not terrible",
          "timestamp": "2022-01-19 12:22:43",
          "score": 3,
          "num_children": 0,
          "author": 105280,
          "replies": []
        },
        {
          "id": "htbow48",
          "text": "Communists too stupid to boil water",
          "timestamp": "2022-01-19 15:00:20",
          "score": 2,
          "num_children": 0,
          "author": 174337,
          "replies": []
        },
        {
          "id": "htavsmu",
          "text": "\\*Soviets too stupid to boil water",
          "timestamp": "2022-01-19 10:31:16",
          "score": 1,
          "num_children": 0,
          "author": 19631,
          "replies": []
        },
        {
          "id": "htw4sjy",
          "text": "Ivan, water too hot. What do",
          "timestamp": "2022-01-23 16:00:21",
          "score": 1,
          "num_children": 0,
          "author": 251227,
          "replies": []
        }
      ]
    },
    {
      "id": "ht81z32",
      "text": "Photovoltaic cells are the only different way of generating power, not as efficient as boiling water, though.",
      "timestamp": "2022-01-18 20:26:41",
      "score": 394,
      "num_children": 10,
      "author": 364487,
      "replies": [
        {
          "id": "ht83f4q",
          "text": "Wind/Water turbines?",
          "timestamp": "2022-01-18 20:35:23",
          "score": 130,
          "num_children": 5,
          "replies": [
            {
              "id": "ht86w4u",
              "text": "Forgot about those, they have the same basic function though, spin a turbine using water/air which is what the boiling water does. The boiling water spins a turbine to create electricity.",
              "timestamp": "2022-01-18 20:56:31",
              "score": 190,
              "num_children": 3,
              "author": 364487,
              "replies": [
                {
                  "id": "ht8gc5r",
                  "text": "There is also piezoelectricity which generates power from pressure changes, you don't need to spin a turbine for those either",
                  "timestamp": "2022-01-18 21:54:00",
                  "score": 79,
                  "num_children": 3,
                  "author": 162372,
                  "replies": [
                    {
                      "id": "ht8hkyr",
                      "text": "I mean if you want to bring that up I guess we should also list thermoelectrics, every variety of fuel cell, and every variety of battery. We’re only talking about scalable energy generation methods here.",
                      "timestamp": "2022-01-18 22:01:44",
                      "score": 98,
                      "num_children": 3,
                      "author": 309915,
                      "replies": [
                        {
                          "id": "ht8im4r",
                          "text": "Don't forget about pony power",
                          "timestamp": "2022-01-18 22:08:13",
                          "score": 45,
                          "num_children": 1,
                          "author": 162372,
                          "replies": [
                            {
                              "id": "ht8kv9i",
                              "text": "Cum power",
                              "timestamp": "2022-01-18 22:22:42",
                              "score": 26,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "ht8mhza",
                                  "text": "[deleted]",
                                  "timestamp": "2022-01-18 22:33:14",
                                  "score": 29,
                                  "num_children": 3,
                                  "replies": [
                                    {
                                      "id": "ht8qwuo",
                                      "text": "Turtle Power",
                                      "timestamp": "2022-01-18 23:01:49",
                                      "score": 14,
                                      "num_children": 0,
                                      "author": 397786,
                                      "replies": []
                                    },
                                    {
                                      "id": "htahfnq",
                                      "text": "based.",
                                      "timestamp": "2022-01-19 07:25:34",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 296769,
                                      "replies": []
                                    },
                                    {
                                      "id": "htb0wos",
                                      "text": "Oof",
                                      "timestamp": "2022-01-19 11:33:50",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 148530,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "htabn2y",
                          "text": "What about friendship",
                          "timestamp": "2022-01-19 06:20:32",
                          "score": 9,
                          "num_children": 1,
                          "author": 169948,
                          "replies": [
                            {
                              "id": "htb9k99",
                              "text": "Dunbar's number means the power of friendship is nonscalable",
                              "timestamp": "2022-01-19 13:02:21",
                              "score": 1,
                              "num_children": 0,
                              "author": 162453,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "htw5987",
                          "text": "Superman turning a crank",
                          "timestamp": "2022-01-23 16:03:26",
                          "score": 1,
                          "num_children": 0,
                          "author": 251227,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ht8l9vv",
                      "text": "Piezoelectricity is absurdly inefficient though, it's like 6%",
                      "timestamp": "2022-01-18 22:25:17",
                      "score": 31,
                      "num_children": 1,
                      "author": 175797,
                      "replies": [
                        {
                          "id": "ht8xktl",
                          "text": "Who cares what it looks like today though\n\nAll of our power generating methods got more efficient over time",
                          "timestamp": "2022-01-18 23:47:25",
                          "score": 7,
                          "num_children": 3,
                          "replies": [
                            {
                              "id": "ht969ch",
                              "text": "Not really. Piezo and TEGs have stayed around 5-6 percent efficient for many decades. Nobody can figure out how to improve them so far.",
                              "timestamp": "2022-01-19 00:48:04",
                              "score": 29,
                              "num_children": 1,
                              "author": 90020,
                              "replies": [
                                {
                                  "id": "ht97zmv",
                                  "text": "Interesting, thanks for the info!",
                                  "timestamp": "2022-01-19 01:01:10",
                                  "score": 7,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "ht9lxfa",
                                      "text": "It's really a shame actually. There's so many applications for TEGs because they are basically compact heat pumps with no moving parts, and there's no end of places you could stick 'em to harvest waste heat if they weren't so inefficient. Whoever figures out how to make them even close to as efficient as modern solar panels will become an overnight billionaire.",
                                      "timestamp": "2022-01-19 02:42:49",
                                      "score": 19,
                                      "num_children": 0,
                                      "author": 90020,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "ht9mbf1",
                              "text": "Some methods are just fundamentally inefficient. Part of the reason it looks like generation gets more efficient over time is we avoid the dumb ones.",
                              "timestamp": "2022-01-19 02:45:39",
                              "score": 8,
                              "num_children": 0,
                              "author": 261177,
                              "replies": []
                            },
                            {
                              "id": "ht91pl8",
                              "text": "The only reason research can even be done on tech that starts out so inefficient is from socialised investments, since private entities would never bankroll something like that. Capitalism stifles innovation.",
                              "timestamp": "2022-01-19 00:16:20",
                              "score": -4,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "ht9e6ck",
                                  "text": "Rofl, what a retarded conclusion to end at",
                                  "timestamp": "2022-01-19 01:46:36",
                                  "score": 7,
                                  "num_children": 0,
                                  "replies": []
                                },
                                {
                                  "id": "ht9a2xg",
                                  "text": "and then there's this McRetard",
                                  "timestamp": "2022-01-19 01:16:45",
                                  "score": 6,
                                  "num_children": 0,
                                  "author": 60119,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "htaxks4",
                      "text": "Not just pressure, temperature too.",
                      "timestamp": "2022-01-19 10:53:35",
                      "score": 1,
                      "num_children": 0,
                      "author": 318502,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ht9p98j",
                  "text": "no boiling water in a Stirling engine, although it does require air to heat up and expand",
                  "timestamp": "2022-01-19 03:07:04",
                  "score": 3,
                  "num_children": 1,
                  "author": 54208,
                  "replies": [
                    {
                      "id": "htatoc6",
                      "text": "It gets heat from hot rock too.",
                      "timestamp": "2022-01-19 10:03:39",
                      "score": 4,
                      "num_children": 0,
                      "author": 165967,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "htajxc2",
                  "text": "Use the turbine to spin another turbine?",
                  "timestamp": "2022-01-19 07:55:54",
                  "score": 1,
                  "num_children": 0,
                  "author": 7324,
                  "replies": []
                }
              ]
            },
            {
              "id": "htacyq1",
              "text": "Wind and water turbines are just using water the sun boiled.",
              "timestamp": "2022-01-19 06:34:35",
              "score": 10,
              "num_children": 1,
              "author": 88124,
              "replies": [
                {
                  "id": "htae18k",
                  "text": "You don't need water to have air currents.",
                  "timestamp": "2022-01-19 06:46:22",
                  "score": 3,
                  "num_children": 0,
                  "author": 126926,
                  "replies": []
                }
              ]
            },
            {
              "id": "ht9o2yn",
              "text": "Same principle, but the sun is the power source that's powering the movement of the fluid through the turbines.",
              "timestamp": "2022-01-19 02:58:25",
              "score": 3,
              "num_children": 0,
              "author": 154098,
              "replies": []
            },
            {
              "id": "ht9y4xd",
              "text": "Wind turbines are just taking the hot water out of the equation but it's still just the magneto reluctance of the conductors and fluxes",
              "timestamp": "2022-01-19 04:16:58",
              "score": 2,
              "num_children": 0,
              "author": 191324,
              "replies": []
            },
            {
              "id": "htce57b",
              "text": "Both involves water boiling at some point",
              "timestamp": "2022-01-19 17:42:44",
              "score": 1,
              "num_children": 0,
              "author": 289671,
              "replies": []
            }
          ]
        },
        {
          "id": "ht9bmg9",
          "text": "Dude just forgot about hydroelectric, wind, wave and current turbines",
          "timestamp": "2022-01-19 01:27:51",
          "score": 15,
          "num_children": 2,
          "author": 16551,
          "replies": [
            {
              "id": "ht9z13d",
              "text": "And internal combustion engines.\n\nEdit: Though Hydroelectric, wind, and ICEs are all just turbines, so they're technically the same as a reactor.\n\nPhotovoltaic is different in that it doesn't rely on using some other energy to turn a turbine. Waves can be used to drive linear actuators though, which are marginally different from turbines.\n\nBut yeah, there are a couple different ways we can turn non-electrical energy into electrical energy, most of the time we use turbines, and photovoltaic is one of the exceptions.",
              "timestamp": "2022-01-19 04:24:19",
              "score": 19,
              "num_children": 0,
              "author": 204288,
              "replies": []
            },
            {
              "id": "htd659q",
              "text": "Hydroelectric, wave, and current are just unboiled water",
              "timestamp": "2022-01-19 20:35:17",
              "score": 2,
              "num_children": 0,
              "author": 365948,
              "replies": []
            }
          ]
        },
        {
          "id": "ht8r7z2",
          "text": "Horsepower my guy",
          "timestamp": "2022-01-18 23:03:51",
          "score": 8,
          "num_children": 1,
          "author": 358181,
          "replies": [
            {
              "id": "ht8syui",
              "text": "How much horsepower does it take to cook Swedish meatballs?",
              "timestamp": "2022-01-18 23:15:41",
              "score": 13,
              "num_children": 1,
              "author": 286571,
              "replies": [
                {
                  "id": "ht9zhkw",
                  "text": "At least two",
                  "timestamp": "2022-01-19 04:28:06",
                  "score": 6,
                  "num_children": 0,
                  "author": 404954,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ht9wfyw",
          "text": "Geothermal energy?",
          "timestamp": "2022-01-19 04:03:27",
          "score": 2,
          "num_children": 1,
          "author": 392108,
          "replies": [
            {
              "id": "htb3tuj",
              "text": "thats just another way to boil water lol",
              "timestamp": "2022-01-19 12:06:24",
              "score": 11,
              "num_children": 1,
              "author": 115534,
              "replies": [
                {
                  "id": "htbkg9m",
                  "text": "Ah shit",
                  "timestamp": "2022-01-19 14:29:11",
                  "score": 6,
                  "num_children": 0,
                  "author": 392108,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "htace12",
          "text": "Chemical fuel cells",
          "timestamp": "2022-01-19 06:28:17",
          "score": 1,
          "num_children": 0,
          "author": 294043,
          "replies": []
        },
        {
          "id": "htb3rpz",
          "text": "I think people brining up other power generating methods. When you saw photovoltaic cells are the only other way, you mean the other way to be spinning a big wheel right? not boiling water. \n\nEvery other suggestion i have read here are about spinning wheels. \n\nof course i am making a big assumption about what you meant because what you said does imply something else.",
          "timestamp": "2022-01-19 12:05:47",
          "score": 1,
          "num_children": 1,
          "author": 115534,
          "replies": [
            {
              "id": "htb44s6",
              "text": "Yeah, I meant that there's not many scalable options for energy generation that don't rely on spinning a turbine or wheel of some sort. Even solar has draw backs and can't be scaled because of energy storage. So as it stands, the most viable methods are spinning the wheel, with nuclear being the most bang for buck and environmentally friendly.",
              "timestamp": "2022-01-19 12:09:39",
              "score": 1,
              "num_children": 0,
              "author": 364487,
              "replies": []
            }
          ]
        },
        {
          "id": "htbfa10",
          "text": "Tidal storage or hydro?",
          "timestamp": "2022-01-19 13:50:19",
          "score": 1,
          "num_children": 0,
          "author": 152019,
          "replies": []
        },
        {
          "id": "htd5gtl",
          "text": "So, you’re right about photovoltaic cells specifically, but here’s something to potentially ruin OP’s day even more.\n\nMany solar plants don’t use photovoltaic cells. They—wait for it—boil water.\n\nIf you’re ever seen pictures of solar power plants that [look like this](https://www.energy.gov/sites/default/files/2017/11/f39/crescent%20dunes.jpg), those aren’t solar panels arrayed in a circle. They’re parabolic mirrors. Each mirror is angled so that they all reflect the sun’s rays directly onto a bulb at the top of the tower in the center. That bulb becomes incredibly hot, and that heat is used to… boil water.",
          "timestamp": "2022-01-19 20:31:04",
          "score": 1,
          "num_children": 0,
          "author": 365948,
          "replies": []
        },
        {
          "id": "htdqua6",
          "text": "You can generate electricity from thermoelectric generators as well just no where near as good as solar panels",
          "timestamp": "2022-01-19 22:43:55",
          "score": 1,
          "num_children": 0,
          "author": 306876,
          "replies": []
        },
        {
          "id": "hte77l0",
          "text": "There is also fuel cells, no water boiling involved. The way it works is pretty cool, basically making energy the same way our bodies do, but less efficiently.",
          "timestamp": "2022-01-20 00:40:05",
          "score": 1,
          "num_children": 0,
          "author": 120911,
          "replies": []
        }
      ]
    },
    {
      "id": "ht8n3b5",
      "text": "American culture is centered around boiling water. They have holidays for boiling water. They killed hundreds of thousands of white men to boil water. They listen to boiling water. They elect boiling water as their president. They dress and act like they're boiling water. They draw the entirety of their modern culture from boiling water. They take sassy showers of boiling water. They watch sportsball on a TV powered by boiling water. Their biggest event of the year involves throwing parties in honor of water being boiled. They use boiling water drinks like \"coffee\" and \"tea\". When you say \"Steam\" they're not thinking of online game store. They're thinking of the boiling water.",
      "timestamp": "2022-01-18 22:37:03",
      "score": 199,
      "num_children": 5,
      "author": 214375,
      "replies": [
        {
          "id": "ht9l1ru",
          "text": "\\>[tfw your country is the best at boiling water](https://i.kym-cdn.com/photos/images/facebook/002/031/095/21d.jpg)",
          "timestamp": "2022-01-19 02:36:26",
          "score": 39,
          "num_children": 0,
          "author": 73229,
          "replies": []
        },
        {
          "id": "ht90l9t",
          "text": "Made for 212 degree water.",
          "timestamp": "2022-01-19 00:08:25",
          "score": 22,
          "num_children": 2,
          "author": 389242,
          "replies": [
            {
              "id": "hta7nak",
              "text": "Built for the Big Boiling Cauldron",
              "timestamp": "2022-01-19 05:40:46",
              "score": 8,
              "num_children": 0,
              "author": 214375,
              "replies": []
            },
            {
              "id": "ht9ace3",
              "text": "That's some pretty hot water",
              "timestamp": "2022-01-19 01:18:41",
              "score": 3,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hta7td0",
          "text": "I boil my water in the microwave like a real American",
          "timestamp": "2022-01-19 05:42:22",
          "score": 5,
          "num_children": 0,
          "author": 289238,
          "replies": []
        },
        {
          "id": "ht9szy9",
          "text": "You should write a steampunk fiction.",
          "timestamp": "2022-01-19 03:36:13",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ht9miie",
          "text": "[deleted]",
          "timestamp": "2022-01-19 02:47:06",
          "score": 0,
          "num_children": 2,
          "replies": [
            {
              "id": "hta75he",
              "text": "Reddit",
              "timestamp": "2022-01-19 05:36:06",
              "score": 7,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ht9npxw",
              "text": "Replace boiling water with joggers",
              "timestamp": "2022-01-19 02:55:50",
              "score": 12,
              "num_children": 1,
              "author": 374789,
              "replies": [
                {
                  "id": "ht9ovhg",
                  "text": "[deleted]",
                  "timestamp": "2022-01-19 03:04:15",
                  "score": -1,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "hta6zxu",
                      "text": "It's black",
                      "timestamp": "2022-01-19 05:34:39",
                      "score": 4,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "htfktrx",
                      "text": "replace joggers with the n word and you have the classic copypasta",
                      "timestamp": "2022-01-20 07:37:39",
                      "score": 2,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ht8hybd",
      "text": "That boiled water produces steam which goes through a turbine, generating power. It's the most efficient form of energy we've ever come up with.",
      "timestamp": "2022-01-18 22:04:03",
      "score": 25,
      "num_children": 3,
      "replies": [
        {
          "id": "ht8mvmf",
          "text": "In theory you could get a bit better performance by using a different liquid compound, but water is cheap and generally safe so there's not really a good ROI",
          "timestamp": "2022-01-18 22:35:41",
          "score": 20,
          "num_children": 2,
          "author": 361525,
          "replies": [
            {
              "id": "ht9vfii",
              "text": "The energy of the phase change in water is really high, there's not a lot that's better that also wouldn't cost significantly more to utilize due to either the extreme temperatures of the phase change, or caustic nature. https://en.wikipedia.org/wiki/Phase-change_material\n\nWater is really ideal as a very high energy, relatively low temperature of phase change, and low reactivity.",
              "timestamp": "2022-01-19 03:55:23",
              "score": 7,
              "num_children": 0,
              "author": 277136,
              "replies": []
            },
            {
              "id": "ht9uh0r",
              "text": "[deleted]",
              "timestamp": "2022-01-19 03:47:50",
              "score": 3,
              "num_children": 1,
              "replies": [
                {
                  "id": "htcov0j",
                  "text": "You will if there's a steam leak that's invisible and slices a dude's arm off.",
                  "timestamp": "2022-01-19 18:48:39",
                  "score": 1,
                  "num_children": 0,
                  "author": 404973,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ht9okxx",
          "text": "Really depends on your definition of efficiency. By many definitions hydroelectric is probably more efficient, but it doesn't scale well.",
          "timestamp": "2022-01-19 03:02:05",
          "score": 2,
          "num_children": 2,
          "author": 261177,
          "replies": [
            {
              "id": "ht9tvct",
              "text": "Hydro is ~90٪, compared to current nukes 25-30 and really high temperature ones 60. So yeah",
              "timestamp": "2022-01-19 03:43:08",
              "score": 3,
              "num_children": 0,
              "author": 33690,
              "replies": []
            },
            {
              "id": "hta8k6t",
              "text": "Its also very geography dependent, cant build hydro anywhere",
              "timestamp": "2022-01-19 05:49:34",
              "score": 1,
              "num_children": 0,
              "author": 377769,
              "replies": []
            }
          ]
        },
        {
          "id": "htaypex",
          "text": "what if you just make energy. like 100% effecient. No solar, no boil. Just create energy",
          "timestamp": "2022-01-19 11:07:29",
          "score": 1,
          "num_children": 0,
          "author": 238994,
          "replies": []
        }
      ]
    },
    {
      "id": "hta35k1",
      "text": "No, I agree. I completely get it. It is insane to me we are perfectly centrifuging natural uranium to ensure we have enough of a heavy isotope so we can initiate a chain reaction of atomic nuclei ejecting protons, all of which is to excite the atoms of water, usually to push a turbine to collect the energy.\n\n&#x200B;\n\nWe boil water with fancy rocks as the pure sum of our knowledge. It's weird.",
      "timestamp": "2022-01-19 04:59:32",
      "score": 16,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht8ci5k",
      "text": "surprisingly profound",
      "timestamp": "2022-01-18 21:30:36",
      "score": 16,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht8stwz",
      "text": ">Year 10\\^14  \n>  \n>Live on a topopolis in andromed  \n>  \n>Matrioshka brain just cracked zero point energy  \n>  \n>Still water being boiled to get energy for my ultracoomer simulations",
      "timestamp": "2022-01-18 23:14:46",
      "score": 44,
      "num_children": 1,
      "replies": [
        {
          "id": "ht9jq6u",
          "text": "Aren’t Dyson spheres just massive solar panels? No water boiling needed.",
          "timestamp": "2022-01-19 02:26:51",
          "score": 7,
          "num_children": 2,
          "author": 244191,
          "replies": [
            {
              "id": "htacshr",
              "text": "Twist : Dyson spheres are mirrors refocusing sunlight to vaporize a common universal liquid, thereby accelerating it and you know the rest. Turbines, copper coils, magnets, blah, blah, blah.",
              "timestamp": "2022-01-19 06:32:42",
              "score": 23,
              "num_children": 0,
              "author": 180845,
              "replies": []
            },
            {
              "id": "htifv1p",
              "text": "You're correct.",
              "timestamp": "2022-01-20 21:23:37",
              "score": 1,
              "num_children": 0,
              "author": 380725,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ht898s4",
      "text": "Damn power generation is based",
      "timestamp": "2022-01-18 21:10:54",
      "score": 14,
      "num_children": 1,
      "replies": [
        {
          "id": "htaohuh",
          "text": "Dam power generation is based",
          "timestamp": "2022-01-19 08:54:40",
          "score": 4,
          "num_children": 1,
          "author": 219030,
          "replies": [
            {
              "id": "htc6w3y",
              "text": "Reddit tier",
              "timestamp": "2022-01-19 16:58:03",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ht8rg0i",
      "text": "If you have a conductive fluid flow and you set up a magnetic field across it, the field will pull electrons one way and protons the other, thus generating an electric potential that can power stuff.  IIRC some plants use this setup in auxiliary loops.\n\nDownside, it's not nearly as efficient as turbines, plus you still have to boil water to get it to move.  Oh, and you have to study magnetohydrodynamics.",
      "timestamp": "2022-01-18 23:05:22",
      "score": 12,
      "num_children": 1,
      "author": 250838,
      "replies": [
        {
          "id": "ht8t9nt",
          "text": "Fucking nerd. Your mom studies magnetohydrodynamics.",
          "timestamp": "2022-01-18 23:17:43",
          "score": 9,
          "num_children": 1,
          "author": 286571,
          "replies": [
            {
              "id": "ht9amz4",
              "text": "And your mother studies in megaphallodynamics",
              "timestamp": "2022-01-19 01:20:48",
              "score": 9,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ht8qt2y",
      "text": "boilers make up 80% of the world's electrical production, most of it is coal powered. Electric cars are coal powered cars. LOL",
      "timestamp": "2022-01-18 23:01:08",
      "score": 10,
      "num_children": 1,
      "replies": [
        {
          "id": "ht9u5tz",
          "text": "Coal power is still cleaner then ICE engines, but as for a fun one, some solar plants use mirrors to boil water, which then turns a turbine. You can't escape from the bubbly water.",
          "timestamp": "2022-01-19 03:45:25",
          "score": 6,
          "num_children": 1,
          "author": 33690,
          "replies": [
            {
              "id": "htco9my",
              "text": "Coal power is not cleaner than ICE engines. You have to look at the entire emissions spectrum and the energy lost in transmission. Coal is much worse. Thankfully, it is being replaced. Natural gas is significantly better.",
              "timestamp": "2022-01-19 18:45:00",
              "score": 1,
              "num_children": 1,
              "author": 412733,
              "replies": [
                {
                  "id": "htcx8ye",
                  "text": "It is when you include all of the emissions management systems. An Ice vehicle can't do much more then its catalytic converter. So replacing an ICE car with an electric one reduces pollution even on an all coal grid, and the more mix of other sources you have the better it is. Gas plants are always better then coal though.",
                  "timestamp": "2022-01-19 19:40:21",
                  "score": 0,
                  "num_children": 0,
                  "author": 33690,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ht88xd1",
      "text": "NOOOOOO EVERYTHING IS MADE UP OF MATTER AND ENERGY IM GONNA GO CRY ABOUT IT!!!!!!",
      "timestamp": "2022-01-18 21:08:57",
      "score": 105,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht8tnqz",
      "text": "You could say he's steaming mad",
      "timestamp": "2022-01-18 23:20:23",
      "score": 8,
      "num_children": 1,
      "replies": [
        {
          "id": "ht9mqal",
          "text": "[deleted]",
          "timestamp": "2022-01-19 02:48:41",
          "score": -1,
          "num_children": 1,
          "replies": [
            {
              "id": "ht9pn0a",
              "text": "take this heckin upd00t and get outerino!1!¡!",
              "timestamp": "2022-01-19 03:09:58",
              "score": 3,
              "num_children": 0,
              "author": 206657,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ht8kqwf",
      "text": "History, mabye.\n\nBut closed loop Supercritical Co2 turbines are the future. The torque to size ratio is enormous compared to high pressure steam. Furthermore, despite the higher initial cost, Supercritical Co2 turbines require much less maintenance over time.",
      "timestamp": "2022-01-18 22:21:57",
      "score": 19,
      "num_children": 1,
      "author": 172202,
      "replies": [
        {
          "id": "hta3z4z",
          "text": "on the other hand, water is water. it's so cheap its basically free.",
          "timestamp": "2022-01-19 05:06:52",
          "score": 3,
          "num_children": 1,
          "author": 74088,
          "replies": [
            {
              "id": "hta7dar",
              "text": "Water is not free or cheep, not on the scales you need for nuclear power generation. Supercritical Co2 is almost entirely a closed loop, as in, you use the same Co2 over and over.\n\nWater is reused to some extent in both light and heavy water reactors, but it is mostly treated as a consumable resource. In cities water typically costs $30 per 20M\\^3.\n\nYou would think tapping off a stream or lake in the middle of knowhere would be cheaper but with the EPA, the department of fish and wildlife, not to mention the steep state level taxes quickly add up costs.\n\n&#x200B;\n\nEDIT:word",
              "timestamp": "2022-01-19 05:38:09",
              "score": 6,
              "num_children": 2,
              "author": 172202,
              "replies": [
                {
                  "id": "hta7zzr",
                  "text": "There is water literally just sitting in lakes and the ocean and no one will charge you for taking any of it.",
                  "timestamp": "2022-01-19 05:44:06",
                  "score": 5,
                  "num_children": 3,
                  "author": 289238,
                  "replies": [
                    {
                      "id": "htabsbd",
                      "text": "Oh really? Are those ducks. Are those ducks at the pond also free?",
                      "timestamp": "2022-01-19 06:22:02",
                      "score": 6,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "htd70i5",
                      "text": "The ocean water is salt water, which first needs to be made fresh before it’s useful, unless you want to shut down your power plant twice a day to clean out an entire Reddit comment sections’ worth of built-up salt. That drives up the cost significantly.\n\nFresh water from rivers and lakes certainly makes it easier, but you still probably want to distill it to avoid mineral build-up over time, and it’s also a pretty limited resource. There’s actually not that much fresh water on the planet and we kinda need it.\n\nAlso, governments absolutely *will* charge you for trying to take water sitting in a lake. If you’re a massive cartoonishly evil megacorp like Nestlé, there are ways around that. But you can’t just go and drain a lake whenever you need water.",
                      "timestamp": "2022-01-19 20:40:35",
                      "score": 3,
                      "num_children": 1,
                      "author": 365948,
                      "replies": [
                        {
                          "id": "htdiu96",
                          "text": "TL;DR",
                          "timestamp": "2022-01-19 21:52:01",
                          "score": 0,
                          "num_children": 0,
                          "author": 289238,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "htbbp70",
                      "text": "\\*Nestlé has entered the chat.",
                      "timestamp": "2022-01-19 13:21:11",
                      "score": 1,
                      "num_children": 0,
                      "author": 29320,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "htd7md5",
                  "text": "Can’t the water in steam turbines be recycled near endlessly? It’s basically just a way to transform heat energy into mechanical energy, right? You boil the water into steam, the steam moves a turbine, why can’t you capture the steam and let it cool back into water to be cycled back into the turbine?",
                  "timestamp": "2022-01-19 20:44:18",
                  "score": 2,
                  "num_children": 1,
                  "author": 365948,
                  "replies": [
                    {
                      "id": "htdwvnr",
                      "text": "The problem is water is kind of terrible when it comes to energy transfer. It takes a huge amount of energy to bring it up to temperature and MUCH longer to let it cool down. When you see pictures of the stereotypical nuclear reactor with the iconic cooling towers bellowing steam a fair amount is being recaptured, but not all of it. That's why nuclear power is specifically well suited for colder climates. \n\nThere are about 9 unique types of reactor layouts that are in use today around the world (about 300 designs that work on paper, but are just not cost effective/safe enough). The amount of water consumed and not recycled varies quite a lot depending on the design but I have heard the older generation 2 reactors use around 20 billion liters per year. Now that's not to say the water is destroyed, its being put back into the environment cleaner than it went in, but its still a drain on the ecosystems. \n\nSupercritical Co2 is highly efficient at converting heat into mechanical energy and then rejecting the waste heat before being recycled. Also, High pressure Co2 has a HUGE range of temperatures it can be used at (400c at 40Mpa) which means the reactor can dump more heat energy in to the coolant without risking over-pressure. And, dry Supercritical Co2 has next to zero reactivity with most metals. High pressure steam will slowly eat pipes, turbines, etc., whereas dry Supercritical Co2 wont. AND to top it all off, high radiation has a tendency to break apart compounds (water turns into Hydrogen and Oxygen). These gasses during normal operations are recombine and put back into the system, BUT if something went wrong like, oh I dunno, a tsunami hits the structure. All that hydrogen and oxygen is free to float around and eventually explode. That's what happened to fukushima daiichi, the explosion everyone saw (and began to panic over) was a buildup of hydrogen and oxygen in the framework of the building. Co2 when bombarded with radiation is MUCH less likely to break up due to the carbon bonds.",
                      "timestamp": "2022-01-19 23:24:56",
                      "score": 2,
                      "num_children": 1,
                      "author": 172202,
                      "replies": [
                        {
                          "id": "hteh7aq",
                          "text": "[removed]",
                          "timestamp": "2022-01-20 01:54:50",
                          "score": 2,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "htejsa1",
                              "text": "Which is true, It would nearly be impossible to retrofit a PWR to Co2. But I still believe the benefits outweigh the drawbacks.",
                              "timestamp": "2022-01-20 02:13:54",
                              "score": 1,
                              "num_children": 0,
                              "author": 172202,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ht8w6sl",
      "text": "And Americans have the Pinnacle in water boiling technology: the microwave",
      "timestamp": "2022-01-18 23:37:43",
      "score": 7,
      "num_children": 0,
      "author": 345770,
      "replies": []
    },
    {
      "id": "ht8u538",
      "text": "There exist other methods. RTGs for example use stirling engines, not steam turbines. Betavoltaic batteries have no moving parts at all, they use a semiconductor sheath surrounding the fuel which functions similarly to solar panels to convert the beta particles into current.",
      "timestamp": "2022-01-18 23:23:37",
      "score": 4,
      "num_children": 0,
      "author": 90020,
      "replies": []
    },
    {
      "id": "ht9pl3g",
      "text": "All these Scientists and engineers risking their lives to boil water with Uranium, whilst I can just switch on my kettle with a flick of a switch.",
      "timestamp": "2022-01-19 03:09:34",
      "score": 4,
      "num_children": 0,
      "author": 25452,
      "replies": []
    },
    {
      "id": "ht8gqu8",
      "text": "Hot water is pretty dope tho.",
      "timestamp": "2022-01-18 21:56:30",
      "score": 3,
      "num_children": 0,
      "author": 295519,
      "replies": []
    },
    {
      "id": "ht8lrg1",
      "text": "I feel this comment so fucking hard",
      "timestamp": "2022-01-18 22:28:27",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht8w8pj",
      "text": "Well, we do have a lot of it around us and it only turns back into water after we boil it and it never goes anywhere really....anyway, it seems sensible to use it to spin the copper wheelies against the thing to make the electrics and all.",
      "timestamp": "2022-01-18 23:38:05",
      "score": 3,
      "num_children": 0,
      "author": 169417,
      "replies": []
    },
    {
      "id": "ht8zfl5",
      "text": "*Cries in coal poisoning*",
      "timestamp": "2022-01-19 00:00:18",
      "score": 3,
      "num_children": 0,
      "author": 92401,
      "replies": []
    },
    {
      "id": "htckad0",
      "text": "Such is the fate of carbon based life forms.",
      "timestamp": "2022-01-19 18:20:46",
      "score": 3,
      "num_children": 0,
      "author": 209191,
      "replies": []
    },
    {
      "id": "ht8igak",
      "text": "\"You said you were going to stop with the boiling water\"",
      "timestamp": "2022-01-18 22:07:12",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht9ahh8",
      "text": "Steam goes chuu chuu.",
      "timestamp": "2022-01-19 01:19:43",
      "score": 2,
      "num_children": 0,
      "author": 335450,
      "replies": []
    },
    {
      "id": "ht9nrp3",
      "text": "wait a second...\n\nwater cooled pc",
      "timestamp": "2022-01-19 02:56:11",
      "score": 2,
      "num_children": 1,
      "author": 169157,
      "replies": [
        {
          "id": "htd6p9y",
          "text": "Oh shit… wait a second. Water slides. Omg how many other applications use water?",
          "timestamp": "2022-01-19 20:38:41",
          "score": 1,
          "num_children": 0,
          "author": 135971,
          "replies": []
        }
      ]
    },
    {
      "id": "ht9vz1m",
      "text": "Brah, ima boil water so hard that it splits into separate elements...\n\nthen when those elements recombine, Ima steal the energy from them combining and use that to power cars and boats and shit.",
      "timestamp": "2022-01-19 03:59:44",
      "score": 2,
      "num_children": 0,
      "author": 400209,
      "replies": []
    },
    {
      "id": "ht9wy5o",
      "text": "\\>hot pussy make me coom  \n\\>stuck dick in the heating pipe  \n\\>Keep coom in the pipe until local water supply is 80% of my coom",
      "timestamp": "2022-01-19 04:07:30",
      "score": 2,
      "num_children": 0,
      "author": 84344,
      "replies": []
    },
    {
      "id": "hta73c3",
      "text": "Just need to replace cars with trains and powered sidewalks. Just fucking trains everywhere. Trains in the sky trains in the ground trains running through your ass.",
      "timestamp": "2022-01-19 05:35:32",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "htaajyv",
      "text": "Anon is wrong. In the future there will be new ways to make fire, so that we can boil water.",
      "timestamp": "2022-01-19 06:09:19",
      "score": 2,
      "num_children": 0,
      "author": 88414,
      "replies": []
    },
    {
      "id": "htabseq",
      "text": "The best solar power is boiling water. Although geothermal the water is already boiled, so big plus there.",
      "timestamp": "2022-01-19 06:22:03",
      "score": 2,
      "num_children": 0,
      "author": 180845,
      "replies": []
    },
    {
      "id": "htabviw",
      "text": "I always wonder if we could manipulate the weather to create controlled and sustained hurricanes. If you could harness the power of a hurricane you could power the world 100x over.\n\nIt'd be incredibly complicated, an unfathomable number of variables. But I feel like it could be done.\n\nEasier option would be tapping into volcanoes, which we already *sort of* do.. But I don't think we take full advantage. There's enough energy under Yellowstone to power the US for centuries. \n\nPlus, if you bleed it off slow, maybe it won't blow up the Western Hemisphere, which would be nice.",
      "timestamp": "2022-01-19 06:22:55",
      "score": 2,
      "num_children": 1,
      "author": 30671,
      "replies": [
        {
          "id": "htbfcnv",
          "text": "Hurricanes hit Louisiana as punishment. I don’t want them to stop.",
          "timestamp": "2022-01-19 13:50:53",
          "score": 1,
          "num_children": 0,
          "author": 170472,
          "replies": []
        }
      ]
    },
    {
      "id": "htb0sqj",
      "text": "Atompunk is just neo-steampunk",
      "timestamp": "2022-01-19 11:32:32",
      "score": 2,
      "num_children": 0,
      "author": 152670,
      "replies": []
    },
    {
      "id": "htb6c8f",
      "text": "Chill man, we are just monkeys.",
      "timestamp": "2022-01-19 12:32:17",
      "score": 2,
      "num_children": 0,
      "author": 264954,
      "replies": []
    },
    {
      "id": "htbegnk",
      "text": "Anon clearly doesnt own an air fryer",
      "timestamp": "2022-01-19 13:43:54",
      "score": 2,
      "num_children": 0,
      "author": 185346,
      "replies": []
    },
    {
      "id": "htcg2e1",
      "text": "It gets better: water makes steam, steam spins wheel and wheel spins magnets, that make electricity",
      "timestamp": "2022-01-19 17:54:36",
      "score": 2,
      "num_children": 0,
      "author": 133634,
      "replies": []
    },
    {
      "id": "ht8d6b6",
      "text": "It’s actually true, Nukecucks will try and deny that it’s just a spicy rock that pushes a steam powered turbine. \n\nIt’s not some black messa shit, it’s technology and have had from 1712 just swapping compressed carbon with MuH uRaYeUm - losers.",
      "timestamp": "2022-01-18 21:34:40",
      "score": 8,
      "num_children": 2,
      "replies": [
        {
          "id": "ht8ykwf",
          "text": ">5 day account\n\n>3k comment karma\n\n>shit opinions",
          "timestamp": "2022-01-18 23:54:20",
          "score": 31,
          "num_children": 1,
          "author": 201559,
          "replies": [
            {
              "id": "ht9oygn",
              "text": ">thinking comment karma matters",
              "timestamp": "2022-01-19 03:04:51",
              "score": 2,
              "num_children": 1,
              "author": 261177,
              "replies": [
                {
                  "id": "hta5n94",
                  "text": "Bro 3k karma in 5 days is literally impossible. Sus user",
                  "timestamp": "2022-01-19 05:22:01",
                  "score": 4,
                  "num_children": 2,
                  "author": 201559,
                  "replies": [
                    {
                      "id": "htbf6uj",
                      "text": "You could put a normie opinion on askreddit or a witty reply a couple times and get 3k in an hour",
                      "timestamp": "2022-01-19 13:49:37",
                      "score": 2,
                      "num_children": 0,
                      "author": 170472,
                      "replies": []
                    },
                    {
                      "id": "htaehlh",
                      "text": "It’s not if you are actually based",
                      "timestamp": "2022-01-19 06:51:28",
                      "score": 0,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hta7h1q",
          "text": "[removed]",
          "timestamp": "2022-01-19 05:39:08",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hta7hgp",
              "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```🤡```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
              "timestamp": "2022-01-19 05:39:15",
              "score": 1,
              "num_children": 0,
              "author": 184140,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ht8wrze",
      "text": "Is this how it really works?",
      "timestamp": "2022-01-18 23:41:49",
      "score": 1,
      "num_children": 6,
      "author": 251654,
      "replies": [
        {
          "id": "ht8xnhc",
          "text": "Yes. Those huge white plumes coming out of nuke plants are just steam.",
          "timestamp": "2022-01-18 23:47:56",
          "score": 8,
          "num_children": 1,
          "replies": [
            {
              "id": "ht91kcs",
              "text": "Well shit",
              "timestamp": "2022-01-19 00:15:18",
              "score": 1,
              "num_children": 0,
              "author": 251654,
              "replies": []
            }
          ]
        },
        {
          "id": "htabapa",
          "text": "Yes.\n\nAll electricity except solar comes back to spinning a turbine. You can do it with wind, water, steam, your legs, etc.\n\nThe turbine just spins a shaft, which is spinning a magnet in a coil, moving electrons, creating an electric current.",
          "timestamp": "2022-01-19 06:16:56",
          "score": 4,
          "num_children": 1,
          "author": 30671,
          "replies": [
            {
              "id": "htadk05",
              "text": "Your mom spins my shaft",
              "timestamp": "2022-01-19 06:41:03",
              "score": 3,
              "num_children": 1,
              "author": 118540,
              "replies": [
                {
                  "id": "htapyof",
                  "text": "Sounds painful",
                  "timestamp": "2022-01-19 09:14:12",
                  "score": 2,
                  "num_children": 0,
                  "author": 247170,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ht8yuf7",
          "text": "Well there’s solar and wind power, but wind just uses air instead of steam to spin a turbine anyways",
          "timestamp": "2022-01-18 23:56:11",
          "score": 2,
          "num_children": 0,
          "author": 201559,
          "replies": []
        },
        {
          "id": "ht9zgke",
          "text": "No. It's a complete lie. In reality uranium make squirrels running fast and spin the wheel.",
          "timestamp": "2022-01-19 04:27:52",
          "score": 1,
          "num_children": 0,
          "author": 316251,
          "replies": []
        },
        {
          "id": "htbif76",
          "text": "There are two types of rods in a reactor, fuel rods and control rods. \n\nFuel rods are made up of pellets of Uranium, control rods are made up of Boron. The control rods are raised and lowered into the reactor core, this helps manage the reaction and prevents pressure from building too quickly. Think of it like a big oval, there’s all these little uranium fuel rods in the bottom half, and bigger boron rods in the top, the boron rods can lower down through holes precisely their size to manage the reaction. \n\nThe hot gas heats up water, the steam pushes a turbine. Cold gas and water keep the reactor cool. \n\nThere are four steps for the containment of a nuclear reactor:\n\n- The casing around the fuel\n\n- The metal fuel cladding tubes\n\n- The reactor and the coolant system\n\n- The containment building\n\nThe containment building is airtight and should be able to withstand an airliner colliding into it. \n\nBack in the 80s and 90s nuclear power was demonized as unsafe, you can see it in shows from back then. Lisa Simpson protests nuclear power many times although (had Homer not been involved in it) it would be much cleaner than any of the other options at the time. Chernobyl and Fukushima made the public opinion even worse, but Chernobyl was negligence on many different levels and let’s be honest, a 9.0 earthquake and then big ass tsunami coming in at Fukushima probably wasn’t expected by the Japanese. Nuclear power began operating commercially in the US in ‘58, there are currently 94 reactors in 56 plants and there have been three fatalities from one explosion in 1961. Nuclear power gets safer and safer but because of the name and the idiots who ran the Soviet government it’s the energy we should ban, not coal, not gas, we should ban the clean one in an age where large cities have a permanent smog from how bad air pollution is.",
          "timestamp": "2022-01-19 14:14:25",
          "score": 1,
          "num_children": 0,
          "author": 170472,
          "replies": []
        },
        {
          "id": "htbsvva",
          "text": "Yes. Nuclear fission gives off heat, evaporating water to make steam, this steam turns turbines producing energy for our use",
          "timestamp": "2022-01-19 15:27:38",
          "score": 1,
          "num_children": 0,
          "author": 159042,
          "replies": []
        }
      ]
    },
    {
      "id": "ht90mca",
      "text": "He's out of line, but he's not wrong!",
      "timestamp": "2022-01-19 00:08:38",
      "score": 1,
      "num_children": 0,
      "author": 296738,
      "replies": []
    },
    {
      "id": "ht96csn",
      "text": "[removed]",
      "timestamp": "2022-01-19 00:48:45",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "ht96d5q",
          "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```sandniggers```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
          "timestamp": "2022-01-19 00:48:50",
          "score": 1,
          "num_children": 0,
          "author": 184140,
          "replies": []
        }
      ]
    },
    {
      "id": "ht96wbi",
      "text": "This thought has been in my head since Chernobyl!",
      "timestamp": "2022-01-19 00:52:48",
      "score": 1,
      "num_children": 0,
      "author": 110594,
      "replies": []
    },
    {
      "id": "ht9flt9",
      "text": "We need more water then",
      "timestamp": "2022-01-19 01:56:57",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ht9vf00",
      "text": "Wait till they hear about mirror focused solar...",
      "timestamp": "2022-01-19 03:55:16",
      "score": 1,
      "num_children": 0,
      "author": 62156,
      "replies": []
    },
    {
      "id": "hta2sji",
      "text": "I think about this daily.",
      "timestamp": "2022-01-19 04:56:22",
      "score": 1,
      "num_children": 0,
      "author": 327102,
      "replies": []
    },
    {
      "id": "htajt89",
      "text": "its posts like this that keep me on this f##@&ing rscist, everyphobic,fascist shitboard.",
      "timestamp": "2022-01-19 07:54:29",
      "score": 1,
      "num_children": 0,
      "author": 259230,
      "replies": []
    },
    {
      "id": "htal84i",
      "text": "Wait!! We have almost emulated a sun through magnetic confinament, to boil some water.",
      "timestamp": "2022-01-19 08:12:11",
      "score": 1,
      "num_children": 0,
      "author": 334619,
      "replies": []
    },
    {
      "id": "htaufux",
      "text": "Good anon u can jerk off in peace now",
      "timestamp": "2022-01-19 10:13:43",
      "score": 1,
      "num_children": 0,
      "author": 395174,
      "replies": []
    },
    {
      "id": "htauyfr",
      "text": "I mean it's that or it's about spinning something really, *really* fast so we can get the copper coils to generate electricity.\n\nI think solar's the only one to *not* do that.",
      "timestamp": "2022-01-19 10:20:26",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "htb0j09",
      "text": "I totally feel this screenshot - I have had a rant like this in the past",
      "timestamp": "2022-01-19 11:29:22",
      "score": 1,
      "num_children": 0,
      "author": 203513,
      "replies": []
    },
    {
      "id": "htbf3tz",
      "text": "This calls for a cup of tea.",
      "timestamp": "2022-01-19 13:48:57",
      "score": 1,
      "num_children": 0,
      "author": 298464,
      "replies": []
    },
    {
      "id": "htby7v0",
      "text": "Everything but solar, wind, and hydroelectric is boil water to turn thing to make electricity. Literally only solar isn't turn thing make electricity",
      "timestamp": "2022-01-19 16:02:44",
      "score": 1,
      "num_children": 0,
      "author": 296567,
      "replies": []
    },
    {
      "id": "htfe0xb",
      "text": ".",
      "timestamp": "2022-01-20 06:21:18",
      "score": 1,
      "num_children": 0,
      "author": 404965,
      "replies": []
    }
  ]
}