{
  "id": "s9ib31",
  "text": "Anon murders EA\n",
  "timestamp": "2022-01-21 19:10:01",
  "score": 12068,
  "subreddit": "t5_2qh4w",
  "num_children": 51,
  "author": 389018,
  "replies": [
    {
      "id": "hto4zl8",
      "text": ">very disappointed\n\ni just imagine EA trying hard to wave its finger at the userbase, which had the actual decency of not wasting their own money on a piece of shit game.",
      "timestamp": "2022-01-21 23:43:20",
      "score": 60,
      "num_children": 1,
      "author": 350202,
      "replies": [
        {
          "id": "htrb5v6",
          "text": "From a business perspective, I would:\n\n* set this BF in the 1950s cold war. Reason being: save money reusing assest from BF1/BFV (*53 Berlin uprising, 56 hungarian revolt, 54 vietnam, 50 Korea, 56 Suez, 55 Algeirs*) two: its an era not commonly used, so it appears \"fresh\" without having to actually change much.\n* Make the only female charachters ones you have to buy, make them young (18yo-24yo) hot looking (no feminist ugly), differnet personalities (like the blond, the redhead, the brunette, asian, black etc). Fanboys will simp buy them.\n* make the game midly ruthless, no pandering to weak players, this seems mean but it will give it a sense of prestige.\n* Limit the Campaign to normal maps with bots, with cut scenes between each, claim it \"teachs people how to play\" which BF fanboys will regurgitate as a positive.\n* Add new \"features\" (that aren't really), like tiny maps with 300 people, or bot mode, front line mode that takes 15 battle maps to win and goes on for 15 hours, maps with 27 objective points.\n\nI think I could make a BF for 1/4 cost, thats still more polished then 2042.",
          "timestamp": "2022-01-22 16:25:20",
          "score": 17,
          "num_children": 2,
          "replies": [
            {
              "id": "htrd55f",
              "text": "Have you ever managed a team?",
              "timestamp": "2022-01-22 16:38:42",
              "score": 8,
              "num_children": 0,
              "author": 272672,
              "replies": []
            },
            {
              "id": "httvb2a",
              "text": ">Make the only female charachters ones you have to buy, make them young (18yo-24yo) hot looking (no feminist ugly), differnet personalities (like the blond, the redhead, the brunette, asian, black etc). Fanboys will simp buy them.\n\nMr. Director, you forgot that between the women being paywalled and all of them being hot you will attract the ire of the obese 56% women and balding bearded men that write content for gaming magazines. Rest is pretty spot on. Hell Star Wars Battlefront 1 and 2 (the real ones) did what you suggest with their campaigns, and their campaigns are well loved, especially the second one.",
              "timestamp": "2022-01-23 02:49:54",
              "score": 4,
              "num_children": 0,
              "author": 214375,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hto8un1",
      "text": "why would they make a good game when you dumbfuck gamers keep buying them, year after year?",
      "timestamp": "2022-01-22 00:09:19",
      "score": 60,
      "num_children": 3,
      "replies": [
        {
          "id": "htqhclm",
          "text": "Exactly right, it’s just basic business. They have no reason to invest money and time into making a good game when they know that at least a few thousand morons will buy the pre release $120 ultra deluxe bundle regardless of the quality of the game. Why make a penny selling a pound of gold when you can make a pound from selling a ton of shit",
          "timestamp": "2022-01-22 12:20:34",
          "score": 11,
          "num_children": 0,
          "author": 237370,
          "replies": []
        },
        {
          "id": "htqpv76",
          "text": "What would happen if one studio made a genuinely good AAA game today? Would they make gazillions of dollars as everyone is so damn starved for quality nowadays? Or do zoomers .. actively dislike good games or something? Would it make less money than the current AAA shit like CoDs and Battlefields and Fortnites?\n\nIt's fucking weird how little quality seems to matter to game performance nowadays, or how it seems to actively *hurt* games to be actually fun play.",
          "timestamp": "2022-01-22 13:44:26",
          "score": 3,
          "num_children": 1,
          "author": 176146,
          "replies": [
            {
              "id": "htrd4st",
              "text": "Making a good game costs money and time, and  maybe garner a few new consumers so in the end for an established franchise you would have higher production cost for old customers + a few new ones. Producers figured out you can cut costs drastically, make an unfinished alpha/beta test, add in a battle pass + microtransactions and then peddle it off for the same price to the die hard loyal consumers of said franchise/cult who make up most of the end users of the game and will also go on to invest money into cosmetics and battle passes. This is something a new consumer probably wouldn’t do. Ultimately it doesn’t make sense for the owners of an established franchise to invest money into making a good game since increasing cost of production to garner new consumers yields diminishing returns. Instead it makes sense to cut costs by copy/pasting games and use marketing techniques to get existing consumers to basically buy the same game again and again and then buy all the cosmetics and passes again and again. If people were economically intelligent, this practise would never exist, but since they aren’t, predatory game development is something you should anticipate to exist until people wise up and stop buying shit games.",
              "timestamp": "2022-01-22 16:38:38",
              "score": 1,
              "num_children": 0,
              "author": 237370,
              "replies": []
            }
          ]
        },
        {
          "id": "htqu4ta",
          "text": "Escpaists(gamers) have the same areas of their brain active that hardcore religious also have ([study 1](https://www.oxfordhandbooks.com/view/10.1093/oxfordhb/9780199935420.001.0001/oxfordhb-9780199935420-e-8)) ([study 2](https://www.tandfonline.com/doi/10.1080/17470919.2016.1257437)), but with none of the benefits like a moral compass, sense of mission, hope, no-nihilism, etc/\n\nYou'll often see gamers talk about \"true fans\"(true believers), and whats \"canon (holy text) & soybetas on r|nintendo saying shit like: \"*I have faith in Nintendos will \\_\\_\\_\\_\\_\\_\\_\\_*\" or \"*I have faith in Miyamotos godlike power to \\_\\_\\_\\_\\_\\_\\_\\_\\_*\" (never saw so many people talk about thier \"faith\" as nintendo fans).",
          "timestamp": "2022-01-22 14:20:51",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "htna382",
      "text": ">2008 + 12 + 2\n\n>thinking anything you buy is made for you and not the people that sold it to you",
      "timestamp": "2022-01-21 20:32:13",
      "score": 627,
      "num_children": 3,
      "author": 170031,
      "replies": [
        {
          "id": "htngzvs",
          "text": "2008-2013 had so many amazing games. It was the end of an era where the grunts in the trenches produced solid gold and timeless gems. Anything after that period was a shameless cash grab. I blame \"Early-access\" for destroying the industry and encouraging half-excreted turds to be pushed to market for idiots to devour",
          "timestamp": "2022-01-21 21:13:23",
          "score": 466,
          "num_children": 24,
          "replies": [
            {
              "id": "htnxn9o",
              "text": "and preorder, buying yet-to-be-published games for $60+, and battle pass later. Its like milking the unmilkable",
              "timestamp": "2022-01-21 22:55:31",
              "score": 16,
              "num_children": 0,
              "author": 335047,
              "replies": []
            },
            {
              "id": "hto49l3",
              "text": "[deleted]",
              "timestamp": "2022-01-21 23:38:30",
              "score": 8,
              "num_children": 1,
              "replies": [
                {
                  "id": "htoeloh",
                  "text": ">when players recommend it a lot that means it's probably good\n\nSteam borderline doesn't have a negative, the worst you usually see is \"Mixed\". \"Mostly Positive\" is like a D+/C-.",
                  "timestamp": "2022-01-22 00:48:23",
                  "score": 6,
                  "num_children": 1,
                  "author": 96083,
                  "replies": [
                    {
                      "id": "htoz0js",
                      "text": "Yup, even \"very positive\" just means it's decent. Anything lower than that is probably crap.",
                      "timestamp": "2022-01-22 03:11:16",
                      "score": 1,
                      "num_children": 1,
                      "author": 205361,
                      "replies": [
                        {
                          "id": "htpu6km",
                          "text": "Not always. Many games have bad reviews for stupid reasons, or temporary ones.",
                          "timestamp": "2022-01-22 07:46:08",
                          "score": 2,
                          "num_children": 1,
                          "author": 403133,
                          "replies": [
                            {
                              "id": "htq92w9",
                              "text": "Review bombing is pretty rare, and there's usually a reason for it (although not always). It is something to keep in mind, but the vast majority of the games with bad reviews deserve their rating.",
                              "timestamp": "2022-01-22 10:43:45",
                              "score": 1,
                              "num_children": 0,
                              "author": 205361,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "htnrwta",
              "text": "Deep Rock Galactic is a good game from recent times.",
              "timestamp": "2022-01-21 22:19:33",
              "score": 29,
              "num_children": 1,
              "author": 46126,
              "replies": [
                {
                  "id": "htoz2gt",
                  "text": "ROCK AND STONE",
                  "timestamp": "2022-01-22 03:11:39",
                  "score": 8,
                  "num_children": 1,
                  "author": 50798,
                  "replies": [
                    {
                      "id": "htp4hvc",
                      "text": "FOR CARL!!",
                      "timestamp": "2022-01-22 03:51:10",
                      "score": 7,
                      "num_children": 0,
                      "author": 65668,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hto08u8",
              "text": "A lot of the games I consider an instant classic now are relatively much smaller productions that are often made by the talent that quit all the major studios after being forced to eat too much shit by mong executives and disappointed customers. \n\nIt'll be a while yet until we get a generation of respectable AAA stuff again because the big publishers are still operating on the pump and dump mtx bait meta.",
              "timestamp": "2022-01-21 23:12:14",
              "score": 6,
              "num_children": 0,
              "author": 402866,
              "replies": []
            },
            {
              "id": "htp6dam",
              "text": "I blame freshly graduated MBAs moving into that industry and forcing developers to implement clever revenue schemes instead of just making games and selling them.",
              "timestamp": "2022-01-22 04:05:14",
              "score": 15,
              "num_children": 1,
              "author": 17127,
              "replies": [
                {
                  "id": "htp9sg3",
                  "text": "1000% people who don't play games invaded the business end of video games and ruined it all",
                  "timestamp": "2022-01-22 04:32:31",
                  "score": 13,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "htomaue",
              "text": "Go play bad company 2 and its *still* good today",
              "timestamp": "2022-01-22 01:41:45",
              "score": 5,
              "num_children": 0,
              "author": 256987,
              "replies": []
            },
            {
              "id": "htnv7bd",
              "text": "There's basically a pendulum between Japanese and Western games where the eras where one is shit the other is good. Even though Western games have fallen off a cliff over the past 5 or 6 years Japan's been absolutely killing it. Salvation lies in weebdom until the West gets its shit together and Japan inevitably enters another nosedive.",
              "timestamp": "2022-01-21 22:40:10",
              "score": 47,
              "num_children": 1,
              "author": 200702,
              "replies": [
                {
                  "id": "htnx0im",
                  "text": "> Salvation lies in weebdom\n\nweebdom is a jewish psyop to emasculate the west. Or maybe westerners are just huge betas. In any case, repent for your sins brother.",
                  "timestamp": "2022-01-21 22:51:30",
                  "score": 35,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "htot621",
                      "text": "lmao yeah it's Japan, one of the most homogenous and insular nations, participating in your Jewish psyop, definitely not all the landfills worth of media coming out of LA and NY, 2 of the top 5 cities in the WORLD in terms of Jewish population.\n\nJapanese games and shows are like the only major media in the world still being written by actual creative minds looking to have fun telling a story rather than armchair activists looking for a soapbox to insert their cookie cutter pOwErFuL sTaTeMeNtS about the goodthink of the week so they can all circlejerk about how progressive they are on twitter and call everything else pRoBlEmAtIc.\n\nMost modern anime is made from light novels written by extremely based ex-NEETs who give zero fucks about political correctness, and is adapted by people with actual reverence for the source material, rather than some hacky blue checkmark who was handed the job by a billionaire studio exec for playing the goodthink game and actively looking to twist and pervert the source to suit their own shallow sociopolitical ends with hamfisted metaphor after hamfisted metaphor.\n\nAll it takes is to look how many of these LA twitter goblins are constantly complaining about Japanese media and trying to pressure them to conform to the stranglehold the new progressive cult of standards and practices has on Western media to see where the line is drawn.",
                      "timestamp": "2022-01-22 02:30:05",
                      "score": 29,
                      "num_children": 2,
                      "author": 200702,
                      "replies": [
                        {
                          "id": "htpgnhs",
                          "text": "Lmao exactly. What the fuck do you expect when our socioeconomic system commodifies every single thing, everything is cheapened and price tagged. It's literally what we preach, they gotta learn how to work in it and not be a poor.",
                          "timestamp": "2022-01-22 05:31:02",
                          "score": 2,
                          "num_children": 0,
                          "replies": []
                        },
                        {
                          "id": "htp0ij4",
                          "text": "There's a difference between normal japanese media and the kind of shit turbovirgin NEETs are into. Think Metal Gear vs degenerate dating sim #451. Just like there probably is a culinary community in the west, and then there are the degenerates who watch Nikocado Avocado. \n\nI was kidding about the psyop, weebs are just gigantic betas.  Don't pretend for a second that most 4chan weebs like the \"based\" japanese media. That's a minority, most are pedos in denial that jack off to vtubers. You may like Metal Gear or shit like Sekiro, do you really want to be put in the same bag as addicted coomers who can only jack off to lolis? You're not the same.\n\nAt least I hope you're not, kek.",
                          "timestamp": "2022-01-22 03:22:01",
                          "score": 6,
                          "num_children": 2,
                          "replies": [
                            {
                              "id": "htp61cs",
                              "text": "Okay I am fully on board with you in that case. Hell I don't even watch that much anime but I'd say at least like 60-70% of the total anime fanbase are absolute subhumans. But like you've said those people generally actively dislike the good shit and are often too dumb to even understand the meanings. You look through comment sections discussing amazing series and die a little inside when it's mostly r'etards complaining about how two characters didn't kiss or whatever.\n\nBut the point is at least in Japan the good stuff isn't being *actively filtered* from coming into being at all, which is the sad state of what's become of things in popular Western media for the past half decade or so. It's like this completely sanitized lowest common denominator environment where the only thing that matters is meta-optics with \"representation\" and social messages.\n\nIronically by trying to push this stuff so hard they are ruining the *creative* diversity of media, as everything just converges into the same set of multicultural actors making the same pop culture jokes and conveying the same shallow messages, just dressed up in different costumes as they stick their hands up the asses of established IPs and puppet them for cash and retweets. Because people no longer care about the creative aspect, it's a distant second. It's just a giant circlejerk around a tired facsimile of vicarious empowerment.",
                              "timestamp": "2022-01-22 04:02:43",
                              "score": 2,
                              "num_children": 0,
                              "author": 200702,
                              "replies": []
                            },
                            {
                              "id": "htrhg5z",
                              "text": ">There's a difference between normal japanese media and the kind of shit turbovirgin NEETs are into. Think Metal Gear vs degenerate dating sim #451.\n\nThe point is that both of these are currently the only ones capable of creating genuinely creative art",
                              "timestamp": "2022-01-22 17:06:40",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "httf0te",
                                  "text": "If you like jacking off to children, yeah, it's creative enough.\n\nWhy on earth do you even defend degenerate cucked as fuck dating sims? Dude. \"genuinely creative art\". Cut the shit brother, they're as generic as they come, hence the #451. \n\nI swear weebs always come up with the dumbest shit to defend their pedophilia.",
                                  "timestamp": "2022-01-23 00:52:30",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "htw2yz8",
                                      "text": "Didn't notice you are unironically a normie",
                                      "timestamp": "2022-01-23 15:48:15",
                                      "score": 3,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "htw7ckc",
                                          "text": "And you're a [beta who's afraid of approaching women](https://www.reddit.com/r/4chan/comments/sae53w/anon_and_i_are_the_same/httx1f6/?context=3), which is probably the reason why you're a weeb. You wouldn't feel the need to cope with degenerate japanese cartoons if you weren't afraid of girls, actual girls not 2d lolis.\n\nSo that makes us evenly retarded, brother.\n\nOn a real note, don't be afraid and go for it, approach women with zero fear like a low inhib chad, the results will unironically cure you from weebdom and from thinking that shitty japanese media is \"based\".\n\nGood luck on your journey bro.",
                                          "timestamp": "2022-01-23 16:17:28",
                                          "score": 1,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "htwf1yi",
                                              "text": ">Good luck on your journey bro.\n\nThanks bro",
                                              "timestamp": "2022-01-23 17:07:25",
                                              "score": 1,
                                              "num_children": 0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "htotdxt",
                      "text": "[removed]",
                      "timestamp": "2022-01-22 02:31:38",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "htotdzl",
                          "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```faget```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
                          "timestamp": "2022-01-22 02:31:39",
                          "score": 1,
                          "num_children": 0,
                          "author": 184140,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "htoofod",
              "text": "Maybe don't be a *person with diminished mental capabilities (because I can't say the r-slur - I thought this was 4chan) and only look at AAA games. You want to tell me Rimworld is bad? Factorio? Prison Architect? Battle Brothers? Dead Cells? Noita?\n\nThere are plenty of amazing games, but if you keep buying stuff from EA and then complaining, really you have only yourself to blame.",
              "timestamp": "2022-01-22 01:56:42",
              "score": 15,
              "num_children": 1,
              "author": 301484,
              "replies": [
                {
                  "id": "htpu241",
                  "text": "Oh shit someone mentioning noita\n\n&#x200B;\n\nCheck out Caves of qud",
                  "timestamp": "2022-01-22 07:44:44",
                  "score": 2,
                  "num_children": 0,
                  "author": 403133,
                  "replies": []
                }
              ]
            },
            {
              "id": "htoemf3",
              "text": "I agree for the most part, but more so that a lot of franchises we all love(d) peaked back then. However, I think one of the best games I've played in my life was Metro Exodus (particularly on hardest difficulty.)",
              "timestamp": "2022-01-22 00:48:31",
              "score": 3,
              "num_children": 1,
              "author": 142926,
              "replies": [
                {
                  "id": "htpu9vk",
                  "text": "Metro exodus enhanced edition with ray tracing n shit was so fucking good. What an experience",
                  "timestamp": "2022-01-22 07:47:12",
                  "score": 1,
                  "num_children": 0,
                  "author": 403133,
                  "replies": []
                }
              ]
            },
            {
              "id": "htnjqby",
              "text": "[deleted]",
              "timestamp": "2022-01-21 21:29:47",
              "score": 140,
              "num_children": 9,
              "replies": [
                {
                  "id": "htnkacy",
                  "text": "Never played it, but I know the poles are based so I respect the franchise",
                  "timestamp": "2022-01-21 21:33:07",
                  "score": 180,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "htnlkuz",
                      "text": "[deleted]",
                      "timestamp": "2022-01-21 21:40:50",
                      "score": 104,
                      "num_children": 4,
                      "replies": [
                        {
                          "id": "htnr2x9",
                          "text": ">What is Cyberpunk2077\n\nlmao",
                          "timestamp": "2022-01-21 22:14:26",
                          "score": 139,
                          "num_children": 5,
                          "author": 22271,
                          "replies": [
                            {
                              "id": "htnrwp4",
                              "text": "While release Witcher 3 is a much better game, it was still incredibly broken and buggy for a lot of people on launch. \n\nI saw the cyberpunk fiasco coming a mile away.",
                              "timestamp": "2022-01-21 22:19:31",
                              "score": 74,
                              "num_children": 2,
                              "author": 61620,
                              "replies": [
                                {
                                  "id": "htopmnq",
                                  "text": "The problem with cyberpunk was not the bugs, every big RPG has a ton of that on release. The problem is that they promised so many features that didn’t get delivered.",
                                  "timestamp": "2022-01-22 02:05:12",
                                  "score": 69,
                                  "num_children": 3,
                                  "author": 70464,
                                  "replies": [
                                    {
                                      "id": "htp4z37",
                                      "text": "Agreed, every time the game comes up all you hear talked about are bugs, only occasionally people point out that the game didn't have nearly as much depth (although im pretty sure I remember a quote where they excused the lack of map size with map verticality which is barely seen in the full release so in that case its a lack of height) than was promised during the hype building phase of the games marketing. \n\n&#x200B;\n\nIt's basically just a generic FPS with a half baked cyberpunk story, all the bugs just made it an unplayable generic FPS with a half baked cyberpunk story.",
                                      "timestamp": "2022-01-22 03:54:38",
                                      "score": 30,
                                      "num_children": 1,
                                      "author": 228387,
                                      "replies": [
                                        {
                                          "id": "htsf98h",
                                          "text": "I thought that the \"depth\" was never about physical dimensions of the map (although it helps).  I thought it was that CDPR promised an organic world that seemed like a real city, one with tons of interactability and little bustling with life.  And on top of that, people wanted a widely branching story with lots of diverse character options/development.",
                                          "timestamp": "2022-01-22 20:49:35",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 45609,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "htopvz1",
                                      "text": "Indeed, it was like Fallout 3 all over again.",
                                      "timestamp": "2022-01-22 02:07:01",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 111285,
                                      "replies": []
                                    },
                                    {
                                      "id": "htor4hv",
                                      "text": "Ehhhh, I’m pretty sure despite cut features, the biggest problem was still bugs. All games have cut features, some even on the level of cyberpunk, the diference is that cyberpunk used said features in interviews and gave hints at such possibilities only to not deliver in the end.\n\nThe bigger issue is that they released a game that didn’t just have bugs, it was straight up broken for many people in many diferent ways. It was a defective product.\n\nCyberpunk is still a decent, if mediocre, product when it’s working fine. It failed hard because it was broken, they can always convince the player base with those promised features later, like No Man’s Sky and Fallout 76 did. (And yes, I personally still hate fallout 76, but the fleshing out of content for those few specific fans who do play and enjoy it is undeniable) \n\nSony pulled it from their storefront FFS. Unprecedented for a game of its supposed caliber.\n\nI highly doubt that any future content Cyberpunk releases will make up for their failure of a launch, but remain open to the idea. That being said it took them so long to fix all the biggest bugs, I have to wonder what the state of the future of the game is.",
                                      "timestamp": "2022-01-22 02:15:44",
                                      "score": -2,
                                      "num_children": 0,
                                      "author": 61620,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "humbiah",
                                  "text": "Yet still not as shit as cyberpunk's release, despite how much more time and budget cyberpunk had. Weird, almost like your point is retarded",
                                  "timestamp": "2022-01-28 19:05:51",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "humebdn",
                                      "text": "A company that is know for having buggy releases, had a buggy release despite budget. And I foresaw it in the face of it getting delayed multiple times and obviously not being ready.\n\nYea. I’m so dumb my dude. /s",
                                      "timestamp": "2022-01-28 19:23:27",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 61620,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "htns8sr",
                              "text": "Like every other cdpr game pre-patches. Remember witcher 1 pre ee? Five npc models, missing dialogue, crashes, messed up subtitles. W3 also had bunch of bugs and still has but at least those are bethesda like funny ones. Unfortunately didnt play w2 on launch. But withcher at least had good story, characters going on compared to cyberounk.",
                              "timestamp": "2022-01-21 22:21:36",
                              "score": 21,
                              "num_children": 2,
                              "author": 201518,
                              "replies": [
                                {
                                  "id": "htoapsf",
                                  "text": "Is cyberpunk decent now?\nBeen waiting to try it.",
                                  "timestamp": "2022-01-22 00:21:53",
                                  "score": 4,
                                  "num_children": 4,
                                  "author": 299395,
                                  "replies": [
                                    {
                                      "id": "htog5zr",
                                      "text": "I had a 8.5/10 experience buying it right after launch.\n\nThere were a few hilarious bugs. Getting out of moving cars, jumping a wall and flying across the map.\n\nSome annoying shit like inventory management.\n\nSome easy shit to abuse, i.e. selling hundreds of sodas and making a fat wedge.\n\nNot enough people around, and if they were it lagged like fuck even on my 2080Ti. Ray tracing confounded the issue.\n\nLove the game though.\n\nThere's still a lot more they can do, too.",
                                      "timestamp": "2022-01-22 00:59:14",
                                      "score": 5,
                                      "num_children": 1,
                                      "author": 158348,
                                      "replies": [
                                        {
                                          "id": "htqdn7g",
                                          "text": "Honestly I played it day one On my xbox one s, little to no bugs. Finished it on my series x 2 weeks later And it was perfect, no problems at all. Other people I know who played it had a similar experience. I feel the internet made it seem way worse than it was. I give it a 8.5/10. Had a really Great story.",
                                          "timestamp": "2022-01-22 11:38:05",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 57680,
                                          "replies": [
                                            {
                                              "id": "htqi4sl",
                                              "text": "how tf were you able to play it on your one s?\n\nI had to give my brother my series x so he can play the game since he had a terrible experience on his xbone.",
                                              "timestamp": "2022-01-22 12:29:07",
                                              "score": 2,
                                              "num_children": 0,
                                              "author": 38731,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "htpzfg4",
                                      "text": "It got rpg story of the year or something on the steam awards",
                                      "timestamp": "2022-01-22 08:46:30",
                                      "score": 2,
                                      "num_children": 0,
                                      "replies": []
                                    },
                                    {
                                      "id": "htonaog",
                                      "text": "It's about 7 or 8/10 ATM depending on how the characters grow on you, but if you wait a year it might be a slightly better 7 or 8/10 game.",
                                      "timestamp": "2022-01-22 01:48:45",
                                      "score": 1,
                                      "num_children": 0,
                                      "replies": []
                                    },
                                    {
                                      "id": "htqi8it",
                                      "text": "Honestly right now it's the greatest it's ever been. I couldn't stand the lack of NPCs or the game breaking glitches, but now it runs smooth (still crashes but only sometimes, not every hour) and the world feels very fleshed out. NPCs are abundant, cars are dynamic and not so unnatural in movement.. it's actually really playable now. \n\nYou will still have some glitches, but overall I'd give it a 8/10 on a good day.",
                                      "timestamp": "2022-01-22 12:30:13",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 342401,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "htpwmpr",
                                  "text": "this comment made me realize that W3 has vehicular combat and chases unlike CP2077 lul",
                                  "timestamp": "2022-01-22 08:14:03",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 307769,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "htoa098",
                              "text": ">CDPR gets off someone else's back and writes their first original story\n\n>it's shit\n\nLike late Game of Thrones",
                              "timestamp": "2022-01-22 00:17:09",
                              "score": 16,
                              "num_children": 0,
                              "author": 96083,
                              "replies": []
                            },
                            {
                              "id": "hto8mo6",
                              "text": "Doesn't have to be a good game to be based. Sometimes it's nuttimportant",
                              "timestamp": "2022-01-22 00:07:47",
                              "score": 2,
                              "num_children": 0,
                              "replies": []
                            },
                            {
                              "id": "htq83mk",
                              "text": "Cyberpunk was mostly a victim of hype, the PR for the game hyped the shit out of it and the devs couldn't keep up with the demands. \n\nThe game is still miles better than most AAA games released recently despite the bugs and yet it will go down as a complete failure.",
                              "timestamp": "2022-01-22 10:31:47",
                              "score": 1,
                              "num_children": 0,
                              "author": 256036,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "htog2a5",
                          "text": "Being a mostly flat country between giants certainly doesn't help their defence",
                          "timestamp": "2022-01-22 00:58:30",
                          "score": 3,
                          "num_children": 0,
                          "author": 294388,
                          "replies": []
                        },
                        {
                          "id": "hto2pzw",
                          "text": "To be fair, these days they are doing a way better job than Western Europe is",
                          "timestamp": "2022-01-21 23:28:22",
                          "score": 5,
                          "num_children": 0,
                          "author": 399065,
                          "replies": []
                        },
                        {
                          "id": "htnqqig",
                          "text": "*Laughs in Ukraine*",
                          "timestamp": "2022-01-21 22:12:16",
                          "score": 0,
                          "num_children": 1,
                          "author": 129202,
                          "replies": [
                            {
                              "id": "hto6g89",
                              "text": "GET OUT OF HERE STALKER",
                              "timestamp": "2022-01-21 23:53:03",
                              "score": 0,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hu0c6am",
                      "text": "not based enough to have their game anywhere close to playable on launch lol",
                      "timestamp": "2022-01-24 11:57:53",
                      "score": 2,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hto6ryw",
                  "text": "Good game that had it's weaknesses. Best ever? Not by an Olympic long toss",
                  "timestamp": "2022-01-21 23:55:15",
                  "score": 12,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hto8s4s",
                      "text": "Best game ever is a subjective term.",
                      "timestamp": "2022-01-22 00:08:49",
                      "score": 2,
                      "num_children": 1,
                      "author": 259558,
                      "replies": [
                        {
                          "id": "htofukd",
                          "text": "Super Mario 64 game of the year every year 1964-2022.",
                          "timestamp": "2022-01-22 00:56:59",
                          "score": 5,
                          "num_children": 1,
                          "author": 286340,
                          "replies": [
                            {
                              "id": "htouq19",
                              "text": "I still need to play Super Marios 4-63",
                              "timestamp": "2022-01-22 02:41:00",
                              "score": 9,
                              "num_children": 0,
                              "author": 374866,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "htnu556",
                  "text": "And in 2021 CDPR is the laughingstock of the world. Eastern Europe was just a decade behind the rest of the world in game development meta, as they are with everything else.",
                  "timestamp": "2022-01-21 22:33:31",
                  "score": 43,
                  "num_children": 2,
                  "author": 323538,
                  "replies": [
                    {
                      "id": "hto7grr",
                      "text": "Theyve only made one good game, and that's Witcher 3 after 2 big swings and missed with 1 and 2. Even Witcher 3 is kinda dumb with clunky controls, extremely long cutscenes, and wannabe Souls combat. I don't know why everyone was so hyped for Cyberpunk",
                      "timestamp": "2022-01-21 23:59:55",
                      "score": 10,
                      "num_children": 3,
                      "author": 284662,
                      "replies": [
                        {
                          "id": "hto8np4",
                          "text": "Witcher 3 is honestly fantastic and a lot of people, including myself, thought it was mostly the same people working on CP2077",
                          "timestamp": "2022-01-22 00:07:58",
                          "score": 26,
                          "num_children": 2,
                          "author": 259558,
                          "replies": [
                            {
                              "id": "htonzzc",
                              "text": "The story is great but the skill based side of it is a mess",
                              "timestamp": "2022-01-22 01:53:37",
                              "score": 6,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "htprv3p",
                                  "text": "Well the story wasn't created by them so figures",
                                  "timestamp": "2022-01-22 07:20:30",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 213107,
                                  "replies": []
                                },
                                {
                                  "id": "htq0p2n",
                                  "text": "It's not",
                                  "timestamp": "2022-01-22 09:01:06",
                                  "score": -1,
                                  "num_children": 1,
                                  "author": 259558,
                                  "replies": [
                                    {
                                      "id": "htq1b18",
                                      "text": "Compare RPGs of these days or even then  with that, even the layout of the skills and whatnot is jam-packed af",
                                      "timestamp": "2022-01-22 09:08:24",
                                      "score": 2,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "htohegs",
                              "text": "I had more fun playing the mini card game than the actual ine",
                              "timestamp": "2022-01-22 01:07:43",
                              "score": 1,
                              "num_children": 0,
                              "author": 37541,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "htob846",
                          "text": "Extremely long cutscenes can work if the story/characters can support it. Final Fantasy XIII has around a combined 8 hours of cutscenes, so probably 15-20% of your time ingame will be watching a movie. It actually works out pretty well imo, especially if you played it near release with the jawdropping-for-2009 graphics (that have aged pretty well).",
                          "timestamp": "2022-01-22 00:25:21",
                          "score": 8,
                          "num_children": 1,
                          "author": 96083,
                          "replies": [
                            {
                              "id": "htw5xvc",
                              "text": "Are you unironically defending...Final Fantasy 13?",
                              "timestamp": "2022-01-23 16:08:00",
                              "score": 1,
                              "num_children": 1,
                              "author": 175388,
                              "replies": [
                                {
                                  "id": "htx0jam",
                                  "text": "[Yes](https://imgur.com/QSDCjSe)",
                                  "timestamp": "2022-01-23 19:25:16",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 96083,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "htpa7z7",
                          "text": "Have you played Witcher 2? I'm not gonna argue it's an all-time great but I really enjoyed it. The story was well paced and the graphics were absolutely gorgeous.",
                          "timestamp": "2022-01-22 04:36:03",
                          "score": 6,
                          "num_children": 0,
                          "author": 50403,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "htowihv",
                      "text": "CP2077 is still one of the best looking games on PC",
                      "timestamp": "2022-01-22 02:53:36",
                      "score": 0,
                      "num_children": 1,
                      "author": 312610,
                      "replies": [
                        {
                          "id": "htprz8a",
                          "text": "Pretty looking turd is still just a turd",
                          "timestamp": "2022-01-22 07:21:42",
                          "score": 2,
                          "num_children": 1,
                          "author": 213107,
                          "replies": [
                            {
                              "id": "hts8wkv",
                              "text": "Ok? Was this what the guy I was replying to talking about?",
                              "timestamp": "2022-01-22 20:06:15",
                              "score": 0,
                              "num_children": 0,
                              "author": 312610,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "htonn1u",
                  "text": "I know I'll get downvoted, the story is fantastic, but the rpg side of it is a cluster fuck",
                  "timestamp": "2022-01-22 01:51:08",
                  "score": 8,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "htqd3d9",
                      "text": "The combat is so fucking boring too",
                      "timestamp": "2022-01-22 11:31:43",
                      "score": 2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "htqfykv",
                          "text": "The only thing that game has going is the story and people keep on talking about the graphics like it's revolutionary af, nobody makes RPGs like that anymore, look at gow for example, If you looked closely you would have seen cp2077 was going to be a cluster fuck",
                          "timestamp": "2022-01-22 12:04:49",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "htqgd40",
                              "text": "And the story is from the books lmao",
                              "timestamp": "2022-01-22 12:09:32",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "htp7n8t",
                  "text": "You mean the most overrated game of all time",
                  "timestamp": "2022-01-22 04:15:16",
                  "score": 8,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "htodt16",
                  "text": "It was the best game I didn’t like. I don’t know why I didn’t like it. I gave it a solid 50 hours and always only found it okay. I guess I never really fell in love with the plot or cast, and I let the nitpicks I had form my opinion.\n\nFor example, after trudging through so much bad writing in other video games, parts such as spending a good portion of the game helping a dysfunctional family I genuinely despised the lot of got to me. Then smaller things such as “Ciri would have lived if you didn’t follow her to that meeting” as an in game option just sounded filthy.\n\nGaunter O’Dimm though? One of the best characters I’ve ever seen.",
                  "timestamp": "2022-01-22 00:42:58",
                  "score": 4,
                  "num_children": 0,
                  "author": 27083,
                  "replies": []
                },
                {
                  "id": "htojklb",
                  "text": "I didn't care for it.",
                  "timestamp": "2022-01-22 01:22:37",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hto9tq6",
                  "text": "Yeah but they fucked up cyberpunk so horrendously that their name is still dirty. CDPR are gonna have to deliver above and beyond on their next title or it’ll be the death of them.",
                  "timestamp": "2022-01-22 00:15:56",
                  "score": 0,
                  "num_children": 0,
                  "author": 207878,
                  "replies": []
                },
                {
                  "id": "htpijfv",
                  "text": "I know nothing about the Witcher series except that I'm trying to watch the show and I'm completely baffled. Should I jump right into playing 3?",
                  "timestamp": "2022-01-22 05:47:32",
                  "score": 1,
                  "num_children": 0,
                  "author": 398570,
                  "replies": []
                }
              ]
            },
            {
              "id": "hto01jl",
              "text": "Ever wonder why indie hit it off lately?",
              "timestamp": "2022-01-21 23:10:55",
              "score": 2,
              "num_children": 0,
              "author": 37188,
              "replies": []
            },
            {
              "id": "htofjv3",
              "text": "Early access and pre purchase are cancer.\n\nBug fixes patches are cringe.",
              "timestamp": "2022-01-22 00:54:54",
              "score": 2,
              "num_children": 1,
              "author": 75642,
              "replies": [
                {
                  "id": "htpuh62",
                  "text": "Bug fixes patches are cringe only if the developers use the players as beta testers. They're still necessary",
                  "timestamp": "2022-01-22 07:49:32",
                  "score": 1,
                  "num_children": 0,
                  "author": 403133,
                  "replies": []
                }
              ]
            },
            {
              "id": "htostyc",
              "text": "The year -5 did not have any video games",
              "timestamp": "2022-01-22 02:27:46",
              "score": 2,
              "num_children": 0,
              "author": 365215,
              "replies": []
            },
            {
              "id": "htot2kq",
              "text": "It's not like AAA games aren't also mostly shit. Early access did innovatively allow indie devs to also sell out though",
              "timestamp": "2022-01-22 02:29:26",
              "score": 2,
              "num_children": 1,
              "author": 365215,
              "replies": [
                {
                  "id": "htouii8",
                  "text": "Oh AAA games are only going to get worse, but early access gave carte blanche to every dev who wanted a quick cash grab from their unfinished garbage",
                  "timestamp": "2022-01-22 02:39:31",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "htoekmm",
              "text": "[Black](https://en.m.wikipedia.org/wiki/Black_(video_game) came out and somehow went completely under the radar as a blend of game and cinematic experience.",
              "timestamp": "2022-01-22 00:48:11",
              "score": 3,
              "num_children": 1,
              "author": 136732,
              "replies": [
                {
                  "id": "htowiu7",
                  "text": "Yeah, because the PS2 is just the best platform for an FPS",
                  "timestamp": "2022-01-22 02:53:40",
                  "score": 3,
                  "num_children": 0,
                  "author": 1081,
                  "replies": []
                }
              ]
            },
            {
              "id": "htoqu5r",
              "text": ">Anything after that period was a shameless cash grab\n\nBloodborne was 2015. DS3 2016. God of War 2018. Ori 2015. Hollow Knight 2015. Dead Cells 2017. I could go on and on. What a stupid fucking comment.",
              "timestamp": "2022-01-22 02:13:44",
              "score": 0,
              "num_children": 2,
              "author": 167823,
              "replies": [
                {
                  "id": "htor97v",
                  "text": "Wow, a few diamonds in the rough. The industry truly is saved with that handful of games keeping the industry together. What a stupid fucking comment\n\nHoly shit the faggooter who replied to me instantly blocked me because he's incapable of having an actual discussion. Absolute reddit moment. Rest in piss, you won't be missed. Fuckin bozo",
                  "timestamp": "2022-01-22 02:16:41",
                  "score": 4,
                  "num_children": 3,
                  "replies": [
                    {
                      "id": "htosw99",
                      "text": "Lmao ur so pissed that people enjoy new games. Go back to your cave and jack off grandpa.\n\nEDIT: Lmao ur so unbelievably pissed that u swapped to an alt just to throw a temper tantrum. Get a life grandpa",
                      "timestamp": "2022-01-22 02:28:12",
                      "score": 2,
                      "num_children": 4,
                      "author": 167823,
                      "replies": [
                        {
                          "id": "htov2a5",
                          "text": "[removed]",
                          "timestamp": "2022-01-22 02:43:24",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "htov2zf",
                              "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```bitch```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
                              "timestamp": "2022-01-22 02:43:32",
                              "score": 2,
                              "num_children": 0,
                              "author": 184140,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "htqklka",
                          "text": "LoL, look at these manchildren fighting over shit made for kids.",
                          "timestamp": "2022-01-22 12:54:17",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        },
                        {
                          "id": "htrjx7p",
                          "text": "Calm down.",
                          "timestamp": "2022-01-22 17:22:46",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        },
                        {
                          "id": "htovaf6",
                          "text": "You got so ass blasted you needed to block me to avoid my reply? That's a sure sign of a screaming urrtard too anally annihilated to come up with a coherent reply. Rest in piss bozo you won't be missed, we can always find you and fuck with you no matter how hard you try to hide. Bussy",
                          "timestamp": "2022-01-22 02:45:00",
                          "score": -1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "htpuets",
                              "text": "Cringe as fuck",
                              "timestamp": "2022-01-22 07:48:46",
                              "score": 0,
                              "num_children": 2,
                              "author": 403133,
                              "replies": [
                                {
                                  "id": "htpv0lo",
                                  "text": "Soooo you blocked me too? And you're talking about cringe? Sheesh...",
                                  "timestamp": "2022-01-22 07:55:36",
                                  "score": 0,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "htpvvad",
                                      "text": "Dumbass stop accusing people of blocking you. What the fuck is this shit lmao? Fucking mongoloid. Maybe you were banned. Lmaooo what a fucking idiot",
                                      "timestamp": "2022-01-22 08:05:20",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 403133,
                                      "replies": [
                                        {
                                          "id": "htpw8ak",
                                          "text": "I mean I can tell you're afraid to have a conversation because you don't have the IQ to make a point. You think everyone gets their opinion from a third party because you can't imagine thinking for yourself. What a weak-minded loser",
                                          "timestamp": "2022-01-22 08:09:27",
                                          "score": -1,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "htpxjfy",
                                              "text": "Bruh in my other comment I specifically said I don't read reviews or care about them. Or dID yOu BlOcK mE???",
                                              "timestamp": "2022-01-22 08:24:27",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 403133,
                                              "replies": [
                                                {
                                                  "id": "htq0lg3",
                                                  "text": "Idk I can reply to everyone except you. I assumed you got so butthurt as a result of being outwitted and so objectively demolished that you couldn't stand to read another reply. I guess you proved that you're simply a cowardly cuck as opposed to a detached plebeian",
                                                  "timestamp": "2022-01-22 08:59:57",
                                                  "score": -1,
                                                  "num_children": 2,
                                                  "replies": [
                                                    {
                                                      "id": "htq2f4p",
                                                      "text": "Holy fuckin brainlet babyrage.",
                                                      "timestamp": "2022-01-22 09:22:08",
                                                      "score": 2,
                                                      "num_children": 0,
                                                      "author": 135582,
                                                      "replies": []
                                                    },
                                                    {
                                                      "id": "htq3iuj",
                                                      "text": "Get therapy you mongoloid",
                                                      "timestamp": "2022-01-22 09:35:38",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "author": 403133,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "htpv3bg",
                                  "text": "From my other reply which you couldn't bear for some reason, maybe a soy overdose:\n\nI don't get gaming recommendations from YouTube channels like some kind of mongoloid. You can feel free to read paid reviews and gobble up the salty loads of AAA developers shoving hot excrement down your throat. I'll be here playing games I enjoy",
                                  "timestamp": "2022-01-22 07:56:29",
                                  "score": 0,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "htpvsfj",
                                      "text": "Lmao I don't read reviews. But I don't even say \"everything bad\" \"everything good\" beacause only a manchild would say that. You mosly hear about shit games because you choose to filter that information. There are many great games.",
                                      "timestamp": "2022-01-22 08:04:28",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 403133,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "htqdc5i",
                      "text": "\"lmao all games are shit nowadays\"\n\n&#x200B;\n\n\"here are examples of great games released recently\"\n\n&#x200B;\n\n&#x200B;\n\n\"Noooo how dare you cherry pick games like that, you have to list every single good game in existence otherwise your argumentarino is invalid!!!\"\n\n&#x200B;\n\nDo you have a shred of self awareness man?",
                      "timestamp": "2022-01-22 11:34:33",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "htpud53",
                      "text": "Nah man he's right. There's an endless list of \"diamonds in the rough\". Just play better games and stop trusting shit youtube channels like ign gamer rant or skillup",
                      "timestamp": "2022-01-22 07:48:14",
                      "score": 0,
                      "num_children": 0,
                      "author": 403133,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "htr3ute",
                  "text": "Those games are mids",
                  "timestamp": "2022-01-22 15:34:40",
                  "score": 1,
                  "num_children": 0,
                  "author": 189835,
                  "replies": []
                }
              ]
            },
            {
              "id": "htnxcjf",
              "text": "[deleted]",
              "timestamp": "2022-01-21 22:53:37",
              "score": -1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hto39ks",
                  "text": "I’m willing to say it was technologically pretty great.\n\nNot actually a great game. It was alright.",
                  "timestamp": "2022-01-21 23:31:56",
                  "score": 8,
                  "num_children": 1,
                  "author": 100894,
                  "replies": [
                    {
                      "id": "hto50yv",
                      "text": "The iconic weapon of the series having the durability of toilet paper and needing half an hour to recharge was kind of a boneheaded decision, for example.\n\nOkay game. Not great. Not even a very good Zelda game, tbh.",
                      "timestamp": "2022-01-21 23:43:36",
                      "score": 9,
                      "num_children": 3,
                      "author": 98908,
                      "replies": [
                        {
                          "id": "hto5rqn",
                          "text": "I got to the end of Hyrule Castle, looked at the door to Ganon, looked out at the game I hadn’t even *mostly* completed (as far as “endgame stuff” is concerned), said “nah”, and walked in to the final boss.\n\nI have genuinely never played another game where I didn’t turn back when given the opportunity before the final boss. Usually I want to go out and “finish” at least a few optional things. I was just tired at the end of BotW; the prospect of playing more of it was completely unappetizing, and killing Ganon felt like a formality.",
                          "timestamp": "2022-01-21 23:48:31",
                          "score": 10,
                          "num_children": 1,
                          "author": 100894,
                          "replies": [
                            {
                              "id": "hto6uk0",
                              "text": "Because the game is wide but shallow. Like a big kiddie pool, and equally full of piss. Piss being what passes for 'dungeons' in BotW.",
                              "timestamp": "2022-01-21 23:55:44",
                              "score": 10,
                              "num_children": 0,
                              "author": 98908,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "htoa52v",
                          "text": "Also damage, armour and health systems being completely broken. Shrines mostly being bad at best, and unholy wastes of time at worst. The beast dungeons being too small and easy.",
                          "timestamp": "2022-01-22 00:18:02",
                          "score": 5,
                          "num_children": 1,
                          "author": 136489,
                          "replies": [
                            {
                              "id": "htspds1",
                              "text": "Yep. That's why I didn't like it much.",
                              "timestamp": "2022-01-22 21:58:28",
                              "score": 1,
                              "num_children": 0,
                              "author": 98908,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hton3a1",
                          "text": "Because physics is the weapon in that game. Not swords.",
                          "timestamp": "2022-01-22 01:47:18",
                          "score": 2,
                          "num_children": 0,
                          "author": 211191,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "htoo7lr",
              "text": "[removed]",
              "timestamp": "2022-01-22 01:55:06",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "htoo7nn",
                  "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```retard```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
                  "timestamp": "2022-01-22 01:55:07",
                  "score": 0,
                  "num_children": 0,
                  "author": 184140,
                  "replies": []
                }
              ]
            },
            {
              "id": "htq1676",
              "text": "Really? I blame mobile gaming.",
              "timestamp": "2022-01-22 09:06:39",
              "score": 1,
              "num_children": 0,
              "author": 413126,
              "replies": []
            },
            {
              "id": "htqekqe",
              "text": "Generally, from early 2000s to 2013/14. I'm including 2014 because Shadow of Mordor, Wolfenstein, Dragon Age Inquisition, Dark souls 2, This war of mine, Talos principle.",
              "timestamp": "2022-01-22 11:48:51",
              "score": 1,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "htqk7bb",
              "text": "I said it on 4chan years ago:\n\nOne day zoomer will be saying \"games of the late 00s early 10s were the best games ever\".\n\nNow I'm saying it again: gen A will be saying \"games of the late 10s early for 20s were the best games ever\"",
              "timestamp": "2022-01-22 12:50:22",
              "score": 1,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hts1dhp",
              "text": "Plenty of indies released after 2013 were great (Slay the Spire comes to mind).",
              "timestamp": "2022-01-22 19:15:43",
              "score": 1,
              "num_children": 0,
              "author": 87299,
              "replies": []
            },
            {
              "id": "htw5fqv",
              "text": "Let me guess, you grew up with 360? Gaming was already heavily HEAVILY polluted with fucking trash by 2008. Only DS and PSP were consistently good during that generation, and for those two half their games weren't localized.",
              "timestamp": "2022-01-23 16:04:38",
              "score": 1,
              "num_children": 0,
              "author": 175388,
              "replies": []
            },
            {
              "id": "htptzxd",
              "text": "\\>anything after that period was a shameless cashgrab\n\nThat's when your opinion stops mattering",
              "timestamp": "2022-01-22 07:44:02",
              "score": 0,
              "num_children": 0,
              "author": 403133,
              "replies": []
            }
          ]
        },
        {
          "id": "hto3ouj",
          "text": "2008 plus 12 plus 2?  please explain",
          "timestamp": "2022-01-21 23:34:42",
          "score": 4,
          "num_children": 3,
          "author": 211405,
          "replies": [
            {
              "id": "htppnl8",
              "text": "Do you know what year it is",
              "timestamp": "2022-01-22 06:57:07",
              "score": 10,
              "num_children": 0,
              "author": 156108,
              "replies": []
            },
            {
              "id": "htq0ll9",
              "text": "2022 feller.",
              "timestamp": "2022-01-22 09:00:00",
              "score": 3,
              "num_children": 2,
              "author": 196707,
              "replies": [
                {
                  "id": "htq4rqk",
                  "text": "Yeah but why split it up like that... 2008 crisis? 2 years pandemic?",
                  "timestamp": "2022-01-22 09:50:52",
                  "score": 2,
                  "num_children": 1,
                  "author": 314676,
                  "replies": [
                    {
                      "id": "htq55dx",
                      "text": "No. It's a 4Chan meme to split up years like that. 2019+3 etc.",
                      "timestamp": "2022-01-22 09:55:32",
                      "score": 3,
                      "num_children": 2,
                      "author": 196707,
                      "replies": [
                        {
                          "id": "htqft8x",
                          "text": "Dont spoonfeed you absolute shitter",
                          "timestamp": "2022-01-22 12:03:08",
                          "score": 4,
                          "num_children": 0,
                          "author": 14716,
                          "replies": []
                        },
                        {
                          "id": "htq5f1m",
                          "text": "Ah OK, thanks.",
                          "timestamp": "2022-01-22 09:58:46",
                          "score": 2,
                          "num_children": 0,
                          "author": 314676,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hueeot0",
                  "text": "thanks.. but what is the joke part?",
                  "timestamp": "2022-01-27 04:51:13",
                  "score": 1,
                  "num_children": 0,
                  "author": 211405,
                  "replies": []
                }
              ]
            },
            {
              "id": "hto6q7j",
              "text": "I'll tell you when you're older",
              "timestamp": "2022-01-21 23:54:56",
              "score": 16,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "htqawwf",
          "text": "Why bother paying testers for your broken concept when people will PAY YOU instead? You won't even need an official launch. Game will be dead long before that ever happens.",
          "timestamp": "2022-01-22 11:05:55",
          "score": 1,
          "num_children": 0,
          "author": 211534,
          "replies": []
        }
      ]
    },
    {
      "id": "htnttir",
      "text": ">making it free to play\n\nWhat about all those people who paid more tha 50 bucks for that game?",
      "timestamp": "2022-01-21 22:31:31",
      "score": 152,
      "num_children": 8,
      "replies": [
        {
          "id": "htnu6ir",
          "text": "They get a special cosmetic for their least played weapon/class",
          "timestamp": "2022-01-21 22:33:45",
          "score": 273,
          "num_children": 2,
          "replies": [
            {
              "id": "htpyxaq",
              "text": "Clown Costume",
              "timestamp": "2022-01-22 08:40:41",
              "score": 80,
              "num_children": 0,
              "author": 181619,
              "replies": []
            },
            {
              "id": "htptsmb",
              "text": "It's all bright pink or orange making you easy to spot.",
              "timestamp": "2022-01-22 07:41:43",
              "score": 14,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "htnvrq3",
          "text": "You got to play the game in early access. Thanks for the testing unpaid tester!",
          "timestamp": "2022-01-21 22:43:43",
          "score": 113,
          "num_children": 2,
          "author": 45411,
          "replies": [
            {
              "id": "htog8jd",
              "text": "*negative-paid",
              "timestamp": "2022-01-22 00:59:43",
              "score": 18,
              "num_children": 0,
              "author": 96083,
              "replies": []
            },
            {
              "id": "htnybvy",
              "text": "Beta testers are like reddit jannies, unpaid.",
              "timestamp": "2022-01-21 22:59:55",
              "score": 33,
              "num_children": 0,
              "author": 216833,
              "replies": []
            }
          ]
        },
        {
          "id": "htonjt6",
          "text": "I like how that would help *monetize* the game better, but not actually help the game be more fun. Like their problem isn't that they made a game that isn't fun to play, the problem to them is that we aren't buying loot crates and battle passes in a game we aren't enjoying.\n\nThey're speaking as if to share holders, \"disappointing\" means their returns were disappointing, not the gameplay itself. They've progressed so far up their own asses that the product they make is irrelevant to them, it's GAME SEQUEL 5 and GAME SEQUEL 4 made 400m so if 5 only makes 100m then the problem is that we haven't figured out how to trick the idiots out of their money yet, not that they made a game that is objectively unenjoyable when compared even to previous sequels let alone other games being made.\n\nThis is one of the many problems with companies becoming monopolistic and 3 or 4 companies buying all the other game producers. At a certain point they feel  they don't have to try to compete and so don't try to make a good game, but rather a game that will sell. They know \"next biggest competitor studios\" isn't releasing their similar game until 3rd quarter next year, so in their minds they're due all the money and sales until then, and it's completely baffling to them that even tho there are no strong competitors to their shitty title that it isn't earning what they expect \"Generic shooter game sequel 5\" to earn.\n\nIn short, they no longer make games for you and I to enjoy, they make games that they think will make shareholders happy, gamers enjoyability of the game is secondary, the primary concern is that whatever players they do capture will pay out the expected return on the game.",
          "timestamp": "2022-01-22 01:50:31",
          "score": 21,
          "num_children": 2,
          "author": 175020,
          "replies": [
            {
              "id": "htqg9gz",
              "text": "I think the future is a sort of game engine that allows common people to make decent games, when that happens ea and everybody else will die",
              "timestamp": "2022-01-22 12:08:22",
              "score": 2,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "htr0th4",
              "text": "You know, if they could release one really good solid title, then just sell map packs for years to follow, that would be dope. Games get stale when you know the maps better than you know your own neighborhood. New maps keep good games fresh.",
              "timestamp": "2022-01-22 15:12:31",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "htnvr1p",
          "text": "50 less bucks to spend on light pink and blue stockings I guess",
          "timestamp": "2022-01-21 22:43:37",
          "score": 35,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "htnytni",
          "text": "That's what you deserve for paying to be a beta tester.",
          "timestamp": "2022-01-21 23:03:05",
          "score": 30,
          "num_children": 1,
          "author": 312722,
          "replies": [
            {
              "id": "htoiojk",
              "text": "The beta was free. They played the beta and went like, yeah that's worth 50+ bucks",
              "timestamp": "2022-01-22 01:16:28",
              "score": 11,
              "num_children": 0,
              "author": 405710,
              "replies": []
            }
          ]
        },
        {
          "id": "hto4zci",
          "text": "they're paypigs so they get off to it",
          "timestamp": "2022-01-21 23:43:18",
          "score": 12,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hto03ln",
          "text": "They get to know how sexuallly r-traded they are.",
          "timestamp": "2022-01-21 23:11:17",
          "score": 0,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "htob31h",
          "text": "They're coping and seething hardcore rn",
          "timestamp": "2022-01-22 00:24:23",
          "score": 1,
          "num_children": 0,
          "author": 143323,
          "replies": []
        }
      ]
    },
    {
      "id": "htnoeps",
      "text": "In 20 years people will look at EA like Folgers coffee. It was what was there before better things came along.",
      "timestamp": "2022-01-21 21:57:55",
      "score": 65,
      "num_children": 1,
      "replies": [
        {
          "id": "htpity9",
          "text": "The best part of waking up... Yeah this analogy doesn't work at all",
          "timestamp": "2022-01-22 05:50:12",
          "score": 7,
          "num_children": 1,
          "author": 398570,
          "replies": [
            {
              "id": "htqsbz1",
              "text": "Lol I’m not sure why I thought of the comparison, but I was thinking more how companies like Folgers brought a product from obscurity to being a staple in everybody’s home. \n\nEA has done a lot to popularize gaming in the same way I guess",
              "timestamp": "2022-01-22 14:05:44",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "htnit5o",
      "text": "[deleted]",
      "timestamp": "2022-01-21 21:24:18",
      "score": 199,
      "num_children": 4,
      "replies": [
        {
          "id": "htnmkmk",
          "text": "[deleted]",
          "timestamp": "2022-01-21 21:46:52",
          "score": 56,
          "num_children": 3,
          "replies": [
            {
              "id": "htnwji9",
              "text": "It's the workshop that makes it good for me. It added so much replay value",
              "timestamp": "2022-01-21 22:48:35",
              "score": 11,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "htpxlp0",
              "text": "[deleted]",
              "timestamp": "2022-01-22 08:25:11",
              "score": 3,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "htsgj1i",
              "text": "What's it like? I've been dying for any multiplayer fps to replace siege",
              "timestamp": "2022-01-22 20:58:17",
              "score": 1,
              "num_children": 1,
              "author": 402866,
              "replies": [
                {
                  "id": "htsi7b7",
                  "text": "[deleted]",
                  "timestamp": "2022-01-22 21:09:35",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "htsj4vq",
                      "text": "I'm down for any match based shooter that just has good gunplay, decent maps and an active playerbase. Siege went from tactical fps to an even shittier overwatch with way more cheaters.",
                      "timestamp": "2022-01-22 21:15:58",
                      "score": 1,
                      "num_children": 1,
                      "author": 402866,
                      "replies": [
                        {
                          "id": "htsn710",
                          "text": "[deleted]",
                          "timestamp": "2022-01-22 21:43:28",
                          "score": 2,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "htsof3z",
                              "text": "Nah just anything with objectives that primarily involve shooting other players, I liked BFBC2 and BF4 for example",
                              "timestamp": "2022-01-22 21:51:46",
                              "score": 1,
                              "num_children": 0,
                              "author": 402866,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "htnz5fy",
          "text": "I mean planetside is great but if you are new you will die again and again and again. OFten without getting any kills. Even mediocre players have a few 100 hours. But please come people feed the machine.",
          "timestamp": "2022-01-21 23:05:08",
          "score": 25,
          "num_children": 1,
          "author": 103786,
          "replies": [
            {
              "id": "htopaim",
              "text": "> I mean planetside is great but if you are new you will die again and again and again.\n\nOr if you're poor bloody infantry",
              "timestamp": "2022-01-22 02:02:48",
              "score": 4,
              "num_children": 2,
              "author": 333089,
              "replies": [
                {
                  "id": "htoqky3",
                  "text": "Sorry I can't hear you over the sound of my LA +C4 combo",
                  "timestamp": "2022-01-22 02:11:54",
                  "score": 3,
                  "num_children": 0,
                  "author": 82461,
                  "replies": []
                },
                {
                  "id": "htpmyzv",
                  "text": "Did they nerf the assault role with the rocket launchers n st uff? I recall them being an absolute pain in the ass to kill if I didnt get the jump on them or run an iron sighted bolt action sniper to head hunt with. I remember also dumping lots of reavers and scythes with the stryker. Or going burster max. Or partnering upwith a few g uys on vanu with the hit-scan laser AV weapon.\n\nGod the lancer was amazing to run. Get a group of 8 dudes and all of you running the lancer? Any vehicle in render di stance dies before it can do anything.",
                  "timestamp": "2022-01-22 06:30:04",
                  "score": 2,
                  "num_children": 0,
                  "author": 364598,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hto0nyp",
          "text": "BF4 is still a good time",
          "timestamp": "2022-01-21 23:14:59",
          "score": 18,
          "num_children": 1,
          "author": 215311,
          "replies": [
            {
              "id": "hto8n37",
              "text": "[deleted]",
              "timestamp": "2022-01-22 00:07:51",
              "score": 15,
              "num_children": 1,
              "replies": [
                {
                  "id": "htobnqk",
                  "text": "[deleted]",
                  "timestamp": "2022-01-22 00:28:17",
                  "score": 10,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "htp89cc",
                      "text": "I was watching crowbcats video on it and I was thinking to myself \"I'd play the shit out of that what the hell happened?!\"\n\nThat would've scratched the itch Epic cancelling the Unreal Tournament reboot left.",
                      "timestamp": "2022-01-22 04:20:11",
                      "score": 3,
                      "num_children": 0,
                      "author": 391419,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "htsy58v",
          "text": "Is PS2 still kicking around? I used to play around 2012-2014ish. I know they merged the servers a couple years ago so that population numbers were back to high levels. My old outfit disbanded and I never found a good replacement.",
          "timestamp": "2022-01-22 22:57:05",
          "score": 1,
          "num_children": 0,
          "author": 214375,
          "replies": []
        }
      ]
    },
    {
      "id": "hto1eky",
      "text": "I think making a 30 day free to play beta to get feed back before publishing a game would be a good idea. Just remember, triple a games go through hundreds of people before being published, they have no excuse for making shitty games.",
      "timestamp": "2022-01-21 23:19:47",
      "score": 21,
      "num_children": 2,
      "replies": [
        {
          "id": "htpl11x",
          "text": "They had beta for this game(though it was for a week only I think), and I tried it, immediately realized this is still a half baked piece of shit that dont deserve $60, lmao. \"Gamers\" are so mcretard if they tried the beta and still went to buy this piece of shit",
          "timestamp": "2022-01-22 06:10:58",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "htpq3my",
              "text": "[removed]",
              "timestamp": "2022-01-22 07:01:49",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "htpq3nz",
                  "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```retard```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
                  "timestamp": "2022-01-22 07:01:49",
                  "score": -1,
                  "num_children": 0,
                  "author": 184140,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "htogiee",
          "text": "Halo Infinite had like a 6-month beta and it paid off. Except for playlists, Slayer (team deathmatch) should've been a dedicated mode on day 1 and not randomized.",
          "timestamp": "2022-01-22 01:01:36",
          "score": 6,
          "num_children": 0,
          "author": 96083,
          "replies": []
        }
      ]
    },
    {
      "id": "hto3eg9",
      "text": "I can't believe anyone even still touches this shit",
      "timestamp": "2022-01-21 23:32:50",
      "score": 19,
      "num_children": 0,
      "author": 16307,
      "replies": []
    },
    {
      "id": "htoa65g",
      "text": "Free to play? EA? I don't think so. They'll find a way to suck money out of people and it will be despicable. I assure you.",
      "timestamp": "2022-01-22 00:18:14",
      "score": 15,
      "num_children": 1,
      "author": 228822,
      "replies": [
        {
          "id": "htobf5x",
          "text": "Hey, gamer, thank you for playing our \"free\" game, costs 5 bucks to unlock the next weapon",
          "timestamp": "2022-01-22 00:26:41",
          "score": 13,
          "num_children": 1,
          "author": 143323,
          "replies": [
            {
              "id": "htococq",
              "text": "It'll turn into pubg type of marketing. Just garbage skins that ass no value.",
              "timestamp": "2022-01-22 00:35:12",
              "score": 8,
              "num_children": 0,
              "author": 228822,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "htnxiuw",
      "text": "Nobody is going to make games that are actually good again until mcretards stop buying shitty ones just to feel something",
      "timestamp": "2022-01-21 22:54:43",
      "score": 120,
      "num_children": 6,
      "author": 394962,
      "replies": [
        {
          "id": "htpebj3",
          "text": "AAAtard is only aware of the existence of games with >$100mil budgets",
          "timestamp": "2022-01-22 05:10:51",
          "score": 42,
          "num_children": 0,
          "author": 387664,
          "replies": []
        },
        {
          "id": "htpuqod",
          "text": "Most people are too returded to actually try new genres and experiment with their tastes. Once I did so my favourite genres completely shifted. Immersive sims and crpgs are the way",
          "timestamp": "2022-01-22 07:52:29",
          "score": 12,
          "num_children": 0,
          "author": 403133,
          "replies": []
        },
        {
          "id": "htoyrzx",
          "text": "McDonald's?",
          "timestamp": "2022-01-22 03:09:34",
          "score": 1,
          "num_children": 0,
          "author": 73659,
          "replies": []
        },
        {
          "id": "httul2t",
          "text": "No matter how many dicks a certain indie game company rams up my ass, it knows I'll still pay $11 a month (plus tip) to click rocks in order to turn a smaller number into a bigger number, and it acts accordingly.",
          "timestamp": "2022-01-23 02:44:34",
          "score": 1,
          "num_children": 0,
          "author": 214375,
          "replies": []
        },
        {
          "id": "htpszxn",
          "text": "Except FROM, Creative Assembly, Larian, whoever made Horizon Zero Dawn, Santa Monica, and many more I’m missing. Ya hyperbolic asshat.",
          "timestamp": "2022-01-22 07:32:50",
          "score": -3,
          "num_children": 0,
          "author": 182381,
          "replies": []
        },
        {
          "id": "htqmug8",
          "text": "Seems to be a shift in gaming demographics:\n\nHeres the most popular games (currently): for 13-18yos : spider man, fortnite, animal crossing, genshin impact, FNAF help wanted, etc\n\nAnd in 2012 for 13-18yo): black ops 2, Counter strike global offensive, mass effect 3, spec ops the line, battlefield 3, gears of war 2\n\nIDK but it seems like things have gotten wimpy, in that the kind of stuff older zoomers played when they were little kids, is now stuff young zoomers play as teens.",
          "timestamp": "2022-01-22 13:16:38",
          "score": 0,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hto2dhl",
      "text": "Making a good game was never an option.",
      "timestamp": "2022-01-21 23:26:06",
      "score": 15,
      "num_children": 0,
      "author": 90611,
      "replies": []
    },
    {
      "id": "htnjsvr",
      "text": "I mean if you bought this game you’re dumb lol",
      "timestamp": "2022-01-21 21:30:12",
      "score": 249,
      "num_children": 4,
      "author": 67973,
      "replies": [
        {
          "id": "hto01b3",
          "text": "Correct",
          "timestamp": "2022-01-21 23:10:52",
          "score": 54,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "htol9ne",
          "text": "Well I mean the greedy shits did claim the devs were ahead of schedule. \nAnd then they released a broken turd that's also been smeared and stepped and pissed on. Good luck polishing that. If you then play it regardless of the alpha development state its in, you slowly realize the game suffers even more from bad decisions, or just lack of decisiveness actually ... it's not what the trailers showed in terms of direction. The marketing we did get turned out pretty dishonest, but generally it was shallow and secretive in it's messages too. That was a red flag which I'll give you. I saw that but I was hopeful. I dreeeaamt of this franchise restored. \nSo thank fuck for refunds.",
          "timestamp": "2022-01-22 01:34:29",
          "score": 21,
          "num_children": 5,
          "author": 71811,
          "replies": [
            {
              "id": "htor5es",
              "text": ">trusting EA",
              "timestamp": "2022-01-22 02:15:55",
              "score": 50,
              "num_children": 1,
              "author": 174015,
              "replies": [
                {
                  "id": "htqbe28",
                  "text": ">trusting any AAA company",
                  "timestamp": "2022-01-22 11:11:35",
                  "score": 17,
                  "num_children": 0,
                  "author": 409953,
                  "replies": []
                }
              ]
            },
            {
              "id": "htpyg24",
              "text": "The game had a free open beta with all its issues clearly visible.",
              "timestamp": "2022-01-22 08:35:02",
              "score": 16,
              "num_children": 1,
              "author": 213107,
              "replies": [
                {
                  "id": "htq0pg5",
                  "text": "That beta was an absolute shitshow. It's hilarious that they let people play a build which was so incredibly broken and lacking polish, I couldn't believe it. \"Hi, here's our completely not fit-for-public-viewing game, pls preorder\".",
                  "timestamp": "2022-01-22 09:01:14",
                  "score": 18,
                  "num_children": 1,
                  "author": 198108,
                  "replies": [
                    {
                      "id": "htq7du0",
                      "text": "\"Oh that beta is maaaany months old it's jUst to test server stability\" \n\"We've known aaaall the issues for a long time don't worry\" \nFuck.",
                      "timestamp": "2022-01-22 10:22:58",
                      "score": 10,
                      "num_children": 0,
                      "author": 71811,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "htq7peq",
              "text": "Yeah you're completely right guys. At least I learned.",
              "timestamp": "2022-01-22 10:26:56",
              "score": 3,
              "num_children": 0,
              "author": 71811,
              "replies": []
            },
            {
              "id": "htpd146",
              "text": "Bro i will not read your pathetic excuses in 2022 you’re just dumb. You’re an idiot.",
              "timestamp": "2022-01-22 04:59:40",
              "score": 15,
              "num_children": 0,
              "author": 67973,
              "replies": []
            },
            {
              "id": "htqlyqc",
              "text": "Nah this is just excuses. Just accept that you're an idiot.",
              "timestamp": "2022-01-22 13:07:45",
              "score": 1,
              "num_children": 1,
              "author": 131332,
              "replies": [
                {
                  "id": "htqsdhv",
                  "text": "Bruh I already did.   \nAlso dunno why it's really such a problem to you that I bought it and got my money back later but ok.",
                  "timestamp": "2022-01-22 14:06:06",
                  "score": 1,
                  "num_children": 1,
                  "author": 71811,
                  "replies": [
                    {
                      "id": "hu4an7s",
                      "text": "It's not about the money it's about the mindset, idiot",
                      "timestamp": "2022-01-25 05:41:04",
                      "score": 1,
                      "num_children": 0,
                      "author": 131332,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "htqj5p6",
          "text": "Many such cases. Did hear the trailer got them pretty hyped.",
          "timestamp": "2022-01-22 12:39:47",
          "score": 2,
          "num_children": 1,
          "author": 321981,
          "replies": [
            {
              "id": "htqo9na",
              "text": "Cause they’re morons",
              "timestamp": "2022-01-22 13:30:00",
              "score": 0,
              "num_children": 0,
              "author": 67973,
              "replies": []
            }
          ]
        },
        {
          "id": "htosn2y",
          "text": "I am lmao, stopped playing like a month ago and uninstalled, got insurgency on the winter sale and been having a blast",
          "timestamp": "2022-01-22 02:26:25",
          "score": 2,
          "num_children": 0,
          "author": 394657,
          "replies": []
        }
      ]
    },
    {
      "id": "htnvp8j",
      "text": "I cant wait for Bad Company 2043",
      "timestamp": "2022-01-21 22:43:17",
      "score": 12,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hto72pk",
      "text": "The hype for this game was ridiculous",
      "timestamp": "2022-01-21 23:57:16",
      "score": 38,
      "num_children": 5,
      "author": 123706,
      "replies": [
        {
          "id": "htprxwc",
          "text": "I must admit, the trailer was pretty good and felt a bit hyped. But then I remembered the previous 3 (or has it been 4, at this point I don't even) Battlefield releases.\n\nAnd still, people are defending this piece of shit.",
          "timestamp": "2022-01-22 07:21:19",
          "score": 9,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "htpjp0u",
          "text": "[BUT MUH LOOPZOOK](https://i.imgur.com/FTgynf3.jpg)",
          "timestamp": "2022-01-22 05:58:13",
          "score": 6,
          "num_children": 0,
          "author": 298806,
          "replies": []
        },
        {
          "id": "htonvsa",
          "text": "Really? I didn't even know it existed until my feed was flooded by \\r\\Games posts talking about how bad it is.\n\nHalo Infinite had way more hype.",
          "timestamp": "2022-01-22 01:52:49",
          "score": 15,
          "num_children": 1,
          "author": 96083,
          "replies": [
            {
              "id": "htpuwo2",
              "text": "it's absolutely impossible that you didn't know about it",
              "timestamp": "2022-01-22 07:54:22",
              "score": 8,
              "num_children": 1,
              "author": 403133,
              "replies": [
                {
                  "id": "htq52ls",
                  "text": "Certainly possible with this pandemic, I heard of 2042 about 3 times compared the 1000 times I’ve heard about B5. Everything is just out of place",
                  "timestamp": "2022-01-22 09:54:32",
                  "score": 2,
                  "num_children": 0,
                  "author": 253308,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "htr3p1z",
          "text": "I preordered it. I love battlefield games and was looking forward to battlefield 4 remake. But I played it and didn’t like it at all. Uninstalled after the first week only trying a couple times. At this point I don’t know if I’m even going to try new games but just stick to the ones I have.",
          "timestamp": "2022-01-22 15:33:33",
          "score": 2,
          "num_children": 2,
          "author": 317716,
          "replies": [
            {
              "id": "htsycvz",
              "text": "Good idea. \n\nMature gamer logic.\n\nStick with what you enjoy",
              "timestamp": "2022-01-22 22:58:34",
              "score": 2,
              "num_children": 0,
              "author": 123706,
              "replies": []
            },
            {
              "id": "htrymr3",
              "text": "You get exactly what you fucking deserve.",
              "timestamp": "2022-01-22 18:57:48",
              "score": 1,
              "num_children": 1,
              "author": 181188,
              "replies": [
                {
                  "id": "htryyvd",
                  "text": "I know :[",
                  "timestamp": "2022-01-22 18:59:58",
                  "score": 1,
                  "num_children": 0,
                  "author": 317716,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "htoxy9a",
          "text": "I don't remember anyone being that excited after the open weekend. There were alarm bells at that point.",
          "timestamp": "2022-01-22 03:03:43",
          "score": 4,
          "num_children": 2,
          "author": 405721,
          "replies": [
            {
              "id": "htpgg9j",
              "text": "\"Dont worry, it's an early build\"\n\n\n-the idiots who tried defending the beta",
              "timestamp": "2022-01-22 05:29:16",
              "score": 11,
              "num_children": 0,
              "author": 174753,
              "replies": []
            },
            {
              "id": "htqqqrv",
              "text": "The reveal trailer that was one long fanservice, coupled with them announcing they were getting rid of classes, was enough for me to write it off as shit. Whaddaya know, I was right.",
              "timestamp": "2022-01-22 13:52:06",
              "score": 1,
              "num_children": 0,
              "author": 86989,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "htnz2ze",
      "text": "Bf3 is the best battlefield you ever made . How did it go so wrong ? My god was that game fun . Noshar canal conquest is the only reason bf2042 hasn’t been uninstalled",
      "timestamp": "2022-01-21 23:04:42",
      "score": 25,
      "num_children": 2,
      "replies": [
        {
          "id": "htpqpat",
          "text": "Bf4 is just a better Bf3",
          "timestamp": "2022-01-22 07:08:04",
          "score": 2,
          "num_children": 3,
          "author": 354941,
          "replies": [
            {
              "id": "htpz5cl",
              "text": "Ready? Fight!",
              "timestamp": "2022-01-22 08:43:14",
              "score": 4,
              "num_children": 0,
              "author": 181619,
              "replies": []
            },
            {
              "id": "htqfjtf",
              "text": "My memory blends together I honestly can’t even tell bf3 and bf4 apart.  Whatever had the map pack seasons . One I think was like gulf of Oman and they had a close quarter dlc which was intense and I think lastly they had a map pack witb dirt bikes",
              "timestamp": "2022-01-22 12:00:08",
              "score": 3,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "htr5r1w",
              "text": "respectfully disagree, bf3 maps were so much better",
              "timestamp": "2022-01-22 15:47:58",
              "score": 3,
              "num_children": 0,
              "author": 46277,
              "replies": []
            }
          ]
        },
        {
          "id": "hw1o8h6",
          "text": "> Bf3 is the best battlefield you ever made\n\nNah dude, BF2 was a much more polished game.\n\nIt even had mod tools.",
          "timestamp": "2022-02-08 05:15:42",
          "score": 1,
          "num_children": 0,
          "author": 8249,
          "replies": []
        }
      ]
    },
    {
      "id": "htoapja",
      "text": "Be honest: everyone knew this games launch was going to be shit. Tons of over-promising only for them to take out base game features and add in ones nobody asked for.\n\nIt should be common knowledge that every EA game launch is shit for 2 weeks to a month",
      "timestamp": "2022-01-22 00:21:50",
      "score": 12,
      "num_children": 1,
      "author": 143323,
      "replies": [
        {
          "id": "htplsci",
          "text": "Bf5 is still shit years later",
          "timestamp": "2022-01-22 06:18:18",
          "score": 6,
          "num_children": 1,
          "author": 335880,
          "replies": [
            {
              "id": "htpp1fm",
              "text": "I mean hey, just like their lead person said: don't like it, don't buy it",
              "timestamp": "2022-01-22 06:50:41",
              "score": 5,
              "num_children": 1,
              "author": 143323,
              "replies": [
                {
                  "id": "htqot3m",
                  "text": "AAAtard",
                  "timestamp": "2022-01-22 13:34:56",
                  "score": 2,
                  "num_children": 0,
                  "author": 131332,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "htomid2",
      "text": "Dice in 2011: skilled and passionate developers \n\nDice in 2021: all senior developers left, replaced with amateurs and diversity hires.\n\nSame applies for Bioware",
      "timestamp": "2022-01-22 01:43:13",
      "score": 41,
      "num_children": 1,
      "replies": [
        {
          "id": "htphs0n",
          "text": "Lmao imagine thinking this is the cause instead of the end result of developers being beholden to execs who are beholden to shareholders and the board of directors\n\nThis happens to literally every single game dev that gets bought out by a publicly traded company\n\nLook at blizzard and what happened to wow and OW, it takes about 7 years for the effects of being bought out to manifest visibly to the consumer\n\nThis is also why privately held companies like valve can produce masterpieces like HL Alyx on their own schedule, because they aren't operating on the whim of their stock price",
          "timestamp": "2022-01-22 05:40:48",
          "score": 2,
          "num_children": 1,
          "author": 385635,
          "replies": [
            {
              "id": "htpmay4",
              "text": "It’s easy to blame execs every time a studio farts out another incomplete game. But we should also hold the developers to a higher standard instead of giving them a pass and putting all the blame on the executives. \n\nIf you’ve been following the news, you’d know that every big name that worked on BF3&4 have since left the company.",
              "timestamp": "2022-01-22 06:23:23",
              "score": 13,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "htol3ck",
      "text": "Someone give me the rundown on BF2042, it’s shit?",
      "timestamp": "2022-01-22 01:33:15",
      "score": 5,
      "num_children": 3,
      "author": 316968,
      "replies": [
        {
          "id": "htp52ig",
          "text": "Read the room",
          "timestamp": "2022-01-22 03:55:19",
          "score": 7,
          "num_children": 1,
          "author": 277292,
          "replies": [
            {
              "id": "htp9nba",
              "text": "I can’t read",
              "timestamp": "2022-01-22 04:31:22",
              "score": 5,
              "num_children": 0,
              "author": 316968,
              "replies": []
            }
          ]
        },
        {
          "id": "htpd002",
          "text": "[deleted]",
          "timestamp": "2022-01-22 04:59:24",
          "score": 0,
          "num_children": 1,
          "replies": [
            {
              "id": "htpkehw",
              "text": "But... Does it have hardcore mode?",
              "timestamp": "2022-01-22 06:04:51",
              "score": 2,
              "num_children": 2,
              "author": 372372,
              "replies": [
                {
                  "id": "htpvagr",
                  "text": "Yes, but the playerbase is quickly dying, and the developers keep removing maps and gamemodes",
                  "timestamp": "2022-01-22 07:58:44",
                  "score": 2,
                  "num_children": 0,
                  "author": 403133,
                  "replies": []
                },
                {
                  "id": "htplgku",
                  "text": "Not sure",
                  "timestamp": "2022-01-22 06:15:09",
                  "score": 1,
                  "num_children": 0,
                  "author": 49773,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "htqtdwg",
          "text": "I personally think the badness is over hyped.  It’s just people on a band wagon shitting on something because gamers love bandwagoning and shitting on things.\n\nAlso, the most popular first person shooter format lately has been Battle Royal, which 2042 doesn’t have.  Going back to playing a giant team death match can feel kind of lame after playing thrilling battle royal games for the past couple years.\n\nI’ve had fun playing 2042, but I’m also not a whiny brat…",
          "timestamp": "2022-01-22 14:14:40",
          "score": 1,
          "num_children": 1,
          "author": 75702,
          "replies": [
            {
              "id": "htr416a",
              "text": "This is spot on. If it’s not BR I don’t give a shit. Nothing else is thrilling.",
              "timestamp": "2022-01-22 15:35:54",
              "score": 2,
              "num_children": 0,
              "author": 317716,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "htoq37z",
      "text": "/v/ hates video games more than Anita could ever dream to.",
      "timestamp": "2022-01-22 02:08:25",
      "score": 3,
      "num_children": 0,
      "author": 49814,
      "replies": []
    },
    {
      "id": "htpb1uy",
      "text": "Turns out when you make a good series into a COD knockoff people don’t like it",
      "timestamp": "2022-01-22 04:42:51",
      "score": 3,
      "num_children": 0,
      "author": 397993,
      "replies": []
    },
    {
      "id": "htn93y2",
      "text": "Battlefield is an overrated franchise, and then when you add in EA it’s awful.\n\nChrist, I forgot battlefield was Reddit: the video game.",
      "timestamp": "2022-01-21 20:26:24",
      "score": 283,
      "num_children": 12,
      "author": 370839,
      "replies": [
        {
          "id": "htnmnpi",
          "text": "Bf4 is casual gold. Awesome game and imo games today don't have the graphical fidelity it had.",
          "timestamp": "2022-01-21 21:47:22",
          "score": 70,
          "num_children": 0,
          "author": 353283,
          "replies": []
        },
        {
          "id": "htnssn5",
          "text": "bf1 and 4 are awesome",
          "timestamp": "2022-01-21 22:25:01",
          "score": 58,
          "num_children": 1,
          "replies": [
            {
              "id": "htrv07b",
              "text": "Bf1? The one where they pretend women and brown peopke played any significant role in WWI?",
              "timestamp": "2022-01-22 18:34:16",
              "score": -1,
              "num_children": 2,
              "replies": [
                {
                  "id": "htrw9xq",
                  "text": "no thats bf5",
                  "timestamp": "2022-01-22 18:42:33",
                  "score": 7,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hts7zb7",
                      "text": "My bad they all start to blend together.",
                      "timestamp": "2022-01-22 19:59:56",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "htrwayp",
                  "text": "and its in ww2",
                  "timestamp": "2022-01-22 18:42:44",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "htnge2y",
          "text": "Lol Bad Company 2 was one of the best games of all time. BF3+4 were good despite the rocky launch of 4.\n\nThere were server browsers, custom lobbies, huge maps, tons of viable weapons, great mechanics, absolutely insane sound design. All of those are missing from the past dozen COD games and the most recent Halo. I'm not gonna sit here and suck off EA because they're trash. But to say the Battlefield franchise was a weak shooter is objectively false",
          "timestamp": "2022-01-21 21:09:47",
          "score": 354,
          "num_children": 10,
          "replies": [
            {
              "id": "htntgyg",
              "text": "Bad Company 2 was amazing in so many ways. I spend way too much time playing that game.",
              "timestamp": "2022-01-21 22:29:18",
              "score": 115,
              "num_children": 1,
              "author": 280263,
              "replies": [
                {
                  "id": "htoanjf",
                  "text": "Fuck how I miss the BC2 days. What was it like 2009 or 2010ish? Remember me and my cousin used to camp in the other team spawn and bobby trap everything. We reconnected somewhat over BF1, but it was short lived with adult life and all that.\n\nI should call him",
                  "timestamp": "2022-01-22 00:21:28",
                  "score": 46,
                  "num_children": 2,
                  "author": 267973,
                  "replies": [
                    {
                      "id": "htoc7jh",
                      "text": "Bc2 had so many excellent maps for multiplayer. I remember playing on map over and over every day in swuad death match.",
                      "timestamp": "2022-01-22 00:32:02",
                      "score": 17,
                      "num_children": 0,
                      "author": 153210,
                      "replies": []
                    },
                    {
                      "id": "htpg4p3",
                      "text": "The PC servers are still up and there are lots of people in them!",
                      "timestamp": "2022-01-22 05:26:26",
                      "score": 4,
                      "num_children": 0,
                      "author": 380275,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "htnyil8",
              "text": "Battlefield 4 is one of my favourite games, they put a lot of heart into making the Multiplayer an experience with awe mixed in.\n\nThe soundtrack, the diversity of the maps, the sound design, the way the Sun is animated, and the way teamwork is promoted and makes a difference.\n\nI’ll never forget the way it sounded on my headphones rushing into my first Operation Locker.",
              "timestamp": "2022-01-21 23:01:06",
              "score": 63,
              "num_children": 0,
              "author": 108575,
              "replies": []
            },
            {
              "id": "hto6t1z",
              "text": "Lucky me! BC2 was the only BF I played.",
              "timestamp": "2022-01-21 23:55:27",
              "score": 17,
              "num_children": 1,
              "replies": [
                {
                  "id": "htoisrg",
                  "text": "Bro same. I remember I made some good online friends on there. They haven't logged back in in nine years though...",
                  "timestamp": "2022-01-22 01:17:16",
                  "score": 5,
                  "num_children": 0,
                  "author": 262734,
                  "replies": []
                }
              ]
            },
            {
              "id": "htp938n",
              "text": "If they basically remastered BC2 as a modern BR, they could fully compete with CoD but instead they made some half compete abomination that makes CoD look like a polished title. Really fumbled the bag on this one",
              "timestamp": "2022-01-22 04:26:50",
              "score": 7,
              "num_children": 0,
              "author": 41458,
              "replies": []
            },
            {
              "id": "htpcqft",
              "text": "more people need to remember 2142",
              "timestamp": "2022-01-22 04:57:06",
              "score": 3,
              "num_children": 0,
              "author": 49773,
              "replies": []
            },
            {
              "id": "htoatjc",
              "text": "I'm gonna say it: I enjoyed Battlefield Hardline.",
              "timestamp": "2022-01-22 00:22:35",
              "score": 3,
              "num_children": 0,
              "author": 143323,
              "replies": []
            },
            {
              "id": "htoccko",
              "text": ">Lol Bad Company 2 was one of the best games of all time\n\nLiterally wasn't even one of the best BF games. Bad Company is where the rot started, where they started flirting with console-CoDism.",
              "timestamp": "2022-01-22 00:32:59",
              "score": -7,
              "num_children": 1,
              "author": 125488,
              "replies": [
                {
                  "id": "htod5pm",
                  "text": "Ok go play red orchestra then you turbo-autismo",
                  "timestamp": "2022-01-22 00:38:30",
                  "score": 15,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "htodckk",
                      "text": "My autism is served by ArmA. I play BF for a more casual experience. BC was just turbo-casual CoD shite, though.\n\nLol get mad BC cucks. Your game sucked compared to mainline entries.",
                      "timestamp": "2022-01-22 00:39:50",
                      "score": -4,
                      "num_children": 1,
                      "author": 125488,
                      "replies": [
                        {
                          "id": "htox785",
                          "text": "naw it wasn't.  it was high ttk and ALL weapons you have to lead your shots.  bullets moved slow.  \n\nas well as vehicles and destructible environment, and squads.",
                          "timestamp": "2022-01-22 02:58:27",
                          "score": 4,
                          "num_children": 0,
                          "author": 74153,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "htnrzh4",
              "text": "Go back",
              "timestamp": "2022-01-21 22:20:00",
              "score": -11,
              "num_children": 2,
              "author": 370839,
              "replies": [
                {
                  "id": "htntaaq",
                  "text": "Go back to better days? If only.",
                  "timestamp": "2022-01-21 22:28:07",
                  "score": 17,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hto1o0f",
                  "text": "but he's already here?",
                  "timestamp": "2022-01-21 23:21:29",
                  "score": 4,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "htu1wkh",
              "text": "Server browsers are not coming back because developers don't want people to see how few servers/players there are.",
              "timestamp": "2022-01-23 03:39:29",
              "score": 1,
              "num_children": 0,
              "author": 32461,
              "replies": []
            },
            {
              "id": "htqktlj",
              "text": "\n\n\"______ battlefield game was great because I grew up with it\"",
              "timestamp": "2022-01-22 12:56:27",
              "score": -1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "htoa7mp",
          "text": "It's a completely unique and awesome franchise, that offers the full spectrum of warfare unlike any other. What other franchise allows you to fight any major war in the last 100 years using weapons, vehicles, ships and aircraft? It's just that it's gone to shit because of a combination of greed and incompetence.",
          "timestamp": "2022-01-22 00:18:31",
          "score": 26,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "htod7u5",
          "text": "1942 was fucking groundbreaking my man. FPS done with vehicles and aircraft? In what, 2002? Dude, cmon.",
          "timestamp": "2022-01-22 00:38:55",
          "score": 17,
          "num_children": 1,
          "author": 312158,
          "replies": [
            {
              "id": "htqf9g2",
              "text": "BF1942, BF Vietnam, BF2 and BF2142 were the best ones",
              "timestamp": "2022-01-22 11:56:46",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "htpsblm",
          "text": "Ironically, this is an extremely reddit tier opinion",
          "timestamp": "2022-01-22 07:25:23",
          "score": 10,
          "num_children": 1,
          "author": 39683,
          "replies": [
            {
              "id": "htv78nl",
              "text": "Only thing more would have been to recommend some Nintendo game that exists purely fuelled by 90s nostalgia",
              "timestamp": "2022-01-23 10:41:39",
              "score": 2,
              "num_children": 0,
              "author": 365643,
              "replies": []
            }
          ]
        },
        {
          "id": "htothcb",
          "text": "As someone who played a ton of BF3 and 4, I think you’re actually right. Looking back, the biggest attraction was pretty much ‘it’s more modern than CS, and it’s not CoD’.",
          "timestamp": "2022-01-22 02:32:18",
          "score": 2,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "htogdf3",
          "text": "Battlefield is fucking lit, too bad they people making it are fucktards",
          "timestamp": "2022-01-22 01:00:39",
          "score": 7,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "htnzyka",
          "text": "Careful, you'll trigger the plebs",
          "timestamp": "2022-01-21 23:10:22",
          "score": 0,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hto7jz1",
          "text": "Imagine having an opinion this shitty.",
          "timestamp": "2022-01-22 00:00:31",
          "score": 0,
          "num_children": 0,
          "author": 319274,
          "replies": []
        },
        {
          "id": "htntb1c",
          "text": "And what is a better FPS game, sir?",
          "timestamp": "2022-01-21 22:28:15",
          "score": -1,
          "num_children": 6,
          "replies": [
            {
              "id": "htnw8ox",
              "text": "Insurgency and the sequel is fun but quite grounded. It's a lot harder to run and gun like in battlefield if that style of gameplay is your thing",
              "timestamp": "2022-01-21 22:46:41",
              "score": 11,
              "num_children": 2,
              "replies": [
                {
                  "id": "htnz5in",
                  "text": "> insurgency\n\nDead and no AU servers",
                  "timestamp": "2022-01-21 23:05:09",
                  "score": 0,
                  "num_children": 3,
                  "replies": [
                    {
                      "id": "hto0rp3",
                      "text": "Really? I played it up until 3 months ago until I had to stop because of work and there were still lots of populated servers.",
                      "timestamp": "2022-01-21 23:15:40",
                      "score": 3,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "htosard",
                      "text": "False, recently bought it and the matchmaking is faster than in other games. Plus on PC theres always around 3k people online",
                      "timestamp": "2022-01-22 02:24:00",
                      "score": 3,
                      "num_children": 0,
                      "author": 394657,
                      "replies": []
                    },
                    {
                      "id": "hto4xux",
                      "text": "SteamStats say otherwise lmfao.",
                      "timestamp": "2022-01-21 23:43:00",
                      "score": 5,
                      "num_children": 0,
                      "author": 14103,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "htp7tt3",
                  "text": "Insurgency is like Great Value Battlefield",
                  "timestamp": "2022-01-22 04:16:45",
                  "score": 0,
                  "num_children": 0,
                  "author": 409846,
                  "replies": []
                }
              ]
            },
            {
              "id": "htnvqrj",
              "text": "Dude just casually asking for a list of hundreds of games",
              "timestamp": "2022-01-21 22:43:34",
              "score": 24,
              "num_children": 1,
              "author": 170031,
              "replies": [
                {
                  "id": "htnyu6x",
                  "text": "Name 5",
                  "timestamp": "2022-01-21 23:03:11",
                  "score": -1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "htnzz4w",
                      "text": "Doom\n\nDoom 2\n\nDuke Nukem 3D\n\nRise of the Triad\n\nBlood\n\nThere’s 5 old ass build engine titles that are better. Want a few from source engine? Want me to just start listing every FPS that wasn’t billed as a “halo killer” on PS3?",
                      "timestamp": "2022-01-21 23:10:28",
                      "score": 1,
                      "num_children": 4,
                      "author": 170031,
                      "replies": [
                        {
                          "id": "hto720r",
                          "text": "90s graphics puts the ADHD zoomer off in 3, 2, 1,",
                          "timestamp": "2022-01-21 23:57:08",
                          "score": 16,
                          "num_children": 2,
                          "replies": [
                            {
                              "id": "htp19pm",
                              "text": "May I recommend SWAT 4?",
                              "timestamp": "2022-01-22 03:27:37",
                              "score": 4,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "htpw1fq",
                                  "text": "Any day. I have been playing that recently because of Ready or Not and man. I believe it’s better than ready or not.",
                                  "timestamp": "2022-01-22 08:07:16",
                                  "score": 3,
                                  "num_children": 1,
                                  "author": 363201,
                                  "replies": [
                                    {
                                      "id": "htq2fvb",
                                      "text": "It very well may be a back 4 blood/left 4 dead scenario. Hopefully not.\n\nSWAT 4 is just a really good game.",
                                      "timestamp": "2022-01-22 09:22:24",
                                      "score": 3,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hto8aad",
                              "text": "Doom Eternal.",
                              "timestamp": "2022-01-22 00:05:26",
                              "score": 10,
                              "num_children": 1,
                              "author": 322519,
                              "replies": [
                                {
                                  "id": "htouxwt",
                                  "text": "Doom Eternal is cringe but still better than BF",
                                  "timestamp": "2022-01-22 02:42:32",
                                  "score": 4,
                                  "num_children": 0,
                                  "author": 200702,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "htofl15",
                          "text": "as a 30 year old i couldn't have come up with a shittier boomer list myself. the games listed are old outdated games that only someone with nostalgia glasses would put anywhere above mediocre.",
                          "timestamp": "2022-01-22 00:55:07",
                          "score": 15,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "htp165w",
                              "text": "I'm 23 and played the old Dooms for history's sake. Fantastic games, and I have nostalgia for them because my older brother used to play them a lot while I watched.\n\nWhile you can easily see how groundbreaking they are, it's like playing half life 1 or 2 or gta 3 nowadays. Great games and you can have fun with them but haven't aged that well.",
                              "timestamp": "2022-01-22 03:26:54",
                              "score": 4,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "htoayei",
                          "text": ">Rise of the Triad\n\nYou watch Civvie don't you?",
                          "timestamp": "2022-01-22 00:23:30",
                          "score": 1,
                          "num_children": 0,
                          "author": 143323,
                          "replies": []
                        },
                        {
                          "id": "htokybt",
                          "text": "Okay, and any modern games with an active multiplayer?",
                          "timestamp": "2022-01-22 01:32:16",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "htp1d88",
                              "text": "Not modern but has an active multiplayer scene, SWAT 4 is one of the best fps games of all time.\n\nAnd if you happen to be in love with the police, then you're probably going to love it even more.\n\nNot sponsored kek.",
                              "timestamp": "2022-01-22 03:28:22",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hto6x8v",
              "text": "GoldenEye",
              "timestamp": "2022-01-21 23:56:14",
              "score": 3,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "htnwuw8",
              "text": "Half-Life.",
              "timestamp": "2022-01-21 22:50:32",
              "score": 7,
              "num_children": 1,
              "author": 410475,
              "replies": [
                {
                  "id": "htnza7y",
                  "text": "We are talking multiplayer games anon.",
                  "timestamp": "2022-01-21 23:05:59",
                  "score": 7,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hto14x5",
                      "text": "Still Half-Life",
                      "timestamp": "2022-01-21 23:18:04",
                      "score": 5,
                      "num_children": 1,
                      "author": 410475,
                      "replies": [
                        {
                          "id": "hto1ef1",
                          "text": "I try to go back and play through HL2 every few years.",
                          "timestamp": "2022-01-21 23:19:45",
                          "score": 7,
                          "num_children": 1,
                          "author": 136370,
                          "replies": [
                            {
                              "id": "hto1z1k",
                              "text": "The OG for me, goddamn it’s such a good game.",
                              "timestamp": "2022-01-21 23:23:28",
                              "score": 7,
                              "num_children": 1,
                              "author": 410475,
                              "replies": [
                                {
                                  "id": "hto2izb",
                                  "text": "Yeah i played HL1 so many times as a kid that if you showed me a screenshot or hell, describe the area you are currently at; I could probably figure out in a few seconds. I do enjoy the Black Mesa remake as well.",
                                  "timestamp": "2022-01-21 23:27:06",
                                  "score": 6,
                                  "num_children": 1,
                                  "author": 136370,
                                  "replies": [
                                    {
                                      "id": "hto337a",
                                      "text": "I’m looking forward to the steamdeck so I have a good excuse to play Blueshift and opfor again.",
                                      "timestamp": "2022-01-21 23:30:47",
                                      "score": 5,
                                      "num_children": 2,
                                      "author": 410475,
                                      "replies": [
                                        {
                                          "id": "hto76js",
                                          "text": "Men of culture here i see",
                                          "timestamp": "2022-01-21 23:58:00",
                                          "score": 5,
                                          "num_children": 0,
                                          "replies": []
                                        },
                                        {
                                          "id": "htog5uu",
                                          "text": "Opponent force! I forgot about that game!!",
                                          "timestamp": "2022-01-22 00:59:12",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 62860,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "htoavuk",
              "text": "Modern setting multiplayer game? Squad, Escape from Tarkov, ArmA 3, Insurgency Sandstorm are all infinitely better than any of the trash produced in the BF franchise after Battlefield 2.",
              "timestamp": "2022-01-22 00:23:01",
              "score": 2,
              "num_children": 0,
              "author": 150374,
              "replies": []
            },
            {
              "id": "htog3z8",
              "text": "Halo 1\n\nHalo 2\n\nHalo 3\n\nHalo Reach\n\nHalo Infinite",
              "timestamp": "2022-01-22 00:58:50",
              "score": 2,
              "num_children": 0,
              "author": 96083,
              "replies": []
            }
          ]
        },
        {
          "id": "htpukoa",
          "text": "Battlefield 1 is incredible",
          "timestamp": "2022-01-22 07:50:38",
          "score": 1,
          "num_children": 0,
          "author": 403133,
          "replies": []
        }
      ]
    },
    {
      "id": "htp3edy",
      "text": "\\>god our game is preforming really bad. How can we make the next one sell better?\n\n\\>I got it! And just follow me here... what if... we make it a soulless free to play cash grab\n\n\\>brilliant. People love those.",
      "timestamp": "2022-01-22 03:43:14",
      "score": 9,
      "num_children": 1,
      "author": 273567,
      "replies": [
        {
          "id": "htq5hz3",
          "text": "A lot of people do love those, those games seem to stay afloat so it means someone is paying them.I hope I never meet a person who pays for free games.",
          "timestamp": "2022-01-22 09:59:45",
          "score": 4,
          "num_children": 0,
          "author": 242367,
          "replies": []
        }
      ]
    },
    {
      "id": "htohabd",
      "text": "They killed a game starting to thrive for this lol",
      "timestamp": "2022-01-22 01:06:55",
      "score": 3,
      "num_children": 0,
      "author": 59965,
      "replies": []
    },
    {
      "id": "htqq15l",
      "text": "More diversity should do the trick.",
      "timestamp": "2022-01-22 13:45:55",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "htoxfth",
      "text": "The last good game EA made was 007: Nightfire on the Gamecube",
      "timestamp": "2022-01-22 03:00:07",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "htprlfh",
      "text": "The best part of this game is the portal. Being able to play multiple old battlefield maps and game modes through one title is awesome. The main game however is shit",
      "timestamp": "2022-01-22 07:17:38",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "htq1gjx",
      "text": "Bruh... Imagine the epic buttfugg on those who paid full price on launch, not to mention those idiots who paid for the deluxe edition.\nEA should die already.",
      "timestamp": "2022-01-22 09:10:25",
      "score": 2,
      "num_children": 0,
      "author": 321632,
      "replies": []
    },
    {
      "id": "htq870l",
      "text": "Just came here to suggest people start playing HELL LET LOOSE!!!!!",
      "timestamp": "2022-01-22 10:32:56",
      "score": 2,
      "num_children": 0,
      "author": 103703,
      "replies": []
    },
    {
      "id": "htp5jep",
      "text": "Triple A games suck and are souless",
      "timestamp": "2022-01-22 03:58:54",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "htn2xh3",
      "text": "what do people even want from Battlefield? I don't understand the problem.",
      "timestamp": "2022-01-21 19:48:56",
      "score": -2,
      "num_children": 13,
      "author": 120753,
      "replies": [
        {
          "id": "htn7vsu",
          "text": "Batrlefield 3 with better graphics, BF4 gunplay and BFV movement / spread, spotting etc.",
          "timestamp": "2022-01-21 20:19:03",
          "score": 92,
          "num_children": 2,
          "replies": [
            {
              "id": "htn970j",
              "text": "This is all i want Tbh.",
              "timestamp": "2022-01-21 20:26:56",
              "score": 24,
              "num_children": 1,
              "author": 252168,
              "replies": [
                {
                  "id": "htnawt2",
                  "text": "Yeah instead we got some generic buggy mess of a \"hero shooter\" with no good maps, no teamwork and no UI.\n\nEven if it was flawless in terms of bugs, it's still rotten to the core in mechanics and would have a similar fate. It's not Battlefield and the audience they were going for isn't interested either and hence we have >6k playersbat any given time.",
                  "timestamp": "2022-01-21 20:37:07",
                  "score": 33,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "hto2qv0",
              "text": "Give me bayonet charge",
              "timestamp": "2022-01-21 23:28:32",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "htn6bgc",
          "text": "A good game.",
          "timestamp": "2022-01-21 20:09:29",
          "score": 52,
          "num_children": 1,
          "author": 338080,
          "replies": [
            {
              "id": "htn7th3",
              "text": "classic Twitter rant with no content..",
              "timestamp": "2022-01-21 20:18:39",
              "score": -5,
              "num_children": 1,
              "author": 120753,
              "replies": [
                {
                  "id": "htnkfvq",
                  "text": "Your mama has content.",
                  "timestamp": "2022-01-21 21:34:02",
                  "score": 16,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "htnmwci",
                      "text": "She gives me her DLC for free.",
                      "timestamp": "2022-01-21 21:48:49",
                      "score": 8,
                      "num_children": 1,
                      "author": 398062,
                      "replies": [
                        {
                          "id": "htnt0im",
                          "text": "to bad her free DLC is HIV",
                          "timestamp": "2022-01-21 22:26:24",
                          "score": 10,
                          "num_children": 1,
                          "author": 358660,
                          "replies": [
                            {
                              "id": "htnx5co",
                              "text": "this mf got bars",
                              "timestamp": "2022-01-21 22:52:22",
                              "score": 4,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hto4c16",
                                  "text": "yall 9 years old",
                                  "timestamp": "2022-01-21 23:38:58",
                                  "score": -4,
                                  "num_children": 1,
                                  "author": 120753,
                                  "replies": [
                                    {
                                      "id": "hto4hok",
                                      "text": "cold af",
                                      "timestamp": "2022-01-21 23:40:01",
                                      "score": 3,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "htn7rp6",
          "text": "We want Battlefield. Not a zoomer hero shooter with no campaign, no weapon variety and no soul.",
          "timestamp": "2022-01-21 20:18:21",
          "score": 45,
          "num_children": 0,
          "author": 366383,
          "replies": []
        },
        {
          "id": "htnszee",
          "text": "Not fucking specialists with clown skins.",
          "timestamp": "2022-01-21 22:26:12",
          "score": 15,
          "num_children": 2,
          "author": 309067,
          "replies": [
            {
              "id": "htntw7v",
              "text": "Yeah the McKay and Boris Xmas Skins were really something... Apparently the insider guys got to vote and it was downvoted to hell but they went with it anyway.",
              "timestamp": "2022-01-21 22:31:59",
              "score": 5,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hto49ax",
              "text": "who tf cries because a of fucking skins wtf",
              "timestamp": "2022-01-21 23:38:27",
              "score": -9,
              "num_children": 1,
              "author": 120753,
              "replies": [
                {
                  "id": "hto893j",
                  "text": "Cause im not 5 and it looks like shit",
                  "timestamp": "2022-01-22 00:05:14",
                  "score": 9,
                  "num_children": 1,
                  "author": 309067,
                  "replies": [
                    {
                      "id": "hto8p6v",
                      "text": "because you personally don't like them and your parents don't want to buy skins for you there shouldn't be any?",
                      "timestamp": "2022-01-22 00:08:16",
                      "score": -4,
                      "num_children": 1,
                      "author": 120753,
                      "replies": [
                        {
                          "id": "hto9ubs",
                          "text": "Lol",
                          "timestamp": "2022-01-22 00:16:03",
                          "score": 2,
                          "num_children": 0,
                          "author": 309067,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "htnbicx",
          "text": "There's a pretty good post that does a pretty good job explaining everything \\*worse\\* than they were in previous games. And that's just a comparison to other Battlefield titles, there are many features that could be added from other games, that could enhance the Battlefield series.\n\nFor the post, just go to Battlefield2042 and search for top of all year, its the first post. I was originally intending to link it myself, but for some reason that's apparently not allowed and I can't post a link to a different subreddits post. The post is really good if you genuinely want to know the issues people have with the game, so I do recommend taking the few minutes to check it out.",
          "timestamp": "2022-01-21 20:40:43",
          "score": 3,
          "num_children": 0,
          "author": 14669,
          "replies": []
        },
        {
          "id": "hto2poh",
          "text": "I just want BF4 with 2022 graphics",
          "timestamp": "2022-01-21 23:28:19",
          "score": 4,
          "num_children": 1,
          "author": 13252,
          "replies": [
            {
              "id": "hto46yt",
              "text": "then people would cry about it beeing the same game? u can't make everyone happy.. isn't there a mode when u can basically play the old games on new graphics?",
              "timestamp": "2022-01-21 23:38:01",
              "score": 0,
              "num_children": 2,
              "author": 120753,
              "replies": [
                {
                  "id": "htqzhmh",
                  "text": "The only thing they like is: intellectually/creativily stagnant lame ass nostoliga.\n\n\"OMG they're remastering Battlefield 3, OH MY GOD I JUSTED CUMMED!\"",
                  "timestamp": "2022-01-22 15:02:30",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "htp06ap",
                  "text": "Battlefield fans don't know what they want, they just jump on a hype train to abandon as soon as the game launches, just see how the popular opinion about Battlefield V changed after this new one launched",
                  "timestamp": "2022-01-22 03:19:33",
                  "score": -2,
                  "num_children": 0,
                  "author": 374426,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hto6wns",
          "text": "go to the 2042 subreddit, sort posts by top rated of all time, click first post",
          "timestamp": "2022-01-21 23:56:08",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "hto782x",
              "text": "I think having less of everything is normal on most games since more and more stuff comes with updates... aoe 2 has much more civs then aoe 4 too but everyone atleast understands that there will be more with time..",
              "timestamp": "2022-01-21 23:58:17",
              "score": 1,
              "num_children": 2,
              "author": 120753,
              "replies": [
                {
                  "id": "hto8chv",
                  "text": "if the live service model is moving towards a system where we get things like server browsers, scoreboards, and radical changes to the core mechanics of the game instead of content updates like maps, guns, skins, etc. id be more than happy to finally drop gaming as a hobby because that's fucking ridiculous lmao.\n\nin any case that's not what's happening here because it's pretty clear DICE is just inept and didn't have enough time to develop this game before pushing it out the door for the holidays. but yeah this game is pretty much a downgrade in every aspect minus visuals, which don't really matter because the game is horribly optimized. as for that list, that's what people want from battlefield",
                  "timestamp": "2022-01-22 00:05:51",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "htok17e",
                  "text": "aoe4 needs to fix there game before they release more civs",
                  "timestamp": "2022-01-22 01:25:48",
                  "score": 1,
                  "num_children": 1,
                  "author": 405710,
                  "replies": [
                    {
                      "id": "htok5ty",
                      "text": "I just don't like it when my units stop chasing the enemy after killing one of them. I think the rest is fine? or am I missing something",
                      "timestamp": "2022-01-22 01:26:42",
                      "score": 1,
                      "num_children": 1,
                      "author": 120753,
                      "replies": [
                        {
                          "id": "hton4fx",
                          "text": "The biggest problem is that the meta is ridiculous unbalanced, even on a casual level. On a competitive level it's unplayable bc you have to abuse bugs and bad mechanics to win",
                          "timestamp": "2022-01-22 01:47:32",
                          "score": 1,
                          "num_children": 0,
                          "author": 405710,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "htn8xyo",
          "text": "I am not a Battlefield player, and my experience has been as little as some free trials and watching videos, but I can assure you the problem I always hear is \"it feels the same, but worse\".\n\nHard to believe, but every couple releases updates the engine build for better graphics, accurate math and fancy lighting, so some things break in the way, the bigger the change the more it breaks, and from what I have seen it has become worse and worse since 4.\n\nBut it's ok, new games have bugs. But Battlefield isn't a new game, it always looks like the old bf3 with nicer pixels and new expansions, it feels like it too (BF1 and 5 had the tone change, so I won't speak for those since what I noticed was a lot of change towards the older war shooters). People want either something new or something better, and 2042 kind of doesn't look like either.\n\nInb4 CoD/Fifa, CoD always tries a bit of new and constantly messes up, but it changes, that's enough. Fifa is, well, the same game I played on ps2, but it gets more polished and more content is added, it doesn't *need* to be new.",
          "timestamp": "2022-01-21 20:25:24",
          "score": 5,
          "num_children": 0,
          "author": 87762,
          "replies": []
        },
        {
          "id": "htn6lgs",
          "text": "I’m not sure, I haven’t played 2042. From my experience though I stopped playing battlefield after Bad Company and Vietnam. The game play after just felt.. off. Like they wanted to be somewhere near COD. That’s just my opinion by my gaming experience, but damn all I’ve heard about Battlefield after has been rubbish.",
          "timestamp": "2022-01-21 20:11:11",
          "score": 5,
          "num_children": 1,
          "author": 348586,
          "replies": [
            {
              "id": "htn7m9d",
              "text": "I always here people saying it's shit but they never say what exactly is shit or what they can do better",
              "timestamp": "2022-01-21 20:17:26",
              "score": 2,
              "num_children": 1,
              "author": 120753,
              "replies": [
                {
                  "id": "htnqsaw",
                  "text": "My main issue with the game is how uncoordinated teams can be. I’ve had so many games where all of the objectives go to the other team because my team ends up hyperfocusing on one shitty objective.",
                  "timestamp": "2022-01-21 22:12:35",
                  "score": 3,
                  "num_children": 0,
                  "author": 273546,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "htni326",
          "text": "[deleted]",
          "timestamp": "2022-01-21 21:19:57",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hto4hrn",
              "text": "I didn't feel any difference between 4 and this one tbh",
              "timestamp": "2022-01-21 23:40:02",
              "score": -1,
              "num_children": 0,
              "author": 120753,
              "replies": []
            }
          ]
        },
        {
          "id": "hto3av2",
          "text": "They're gamers. They cry about anything",
          "timestamp": "2022-01-21 23:32:10",
          "score": -4,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hto0rqb",
          "text": "Neither does EA",
          "timestamp": "2022-01-21 23:15:40",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "htonwqs",
          "text": "Just look at that side by side pic of BF3 vs 2042. It’s in the battlefield sub. The graphics have gotten much worse",
          "timestamp": "2022-01-22 01:53:00",
          "score": 1,
          "num_children": 0,
          "author": 79660,
          "replies": []
        }
      ]
    },
    {
      "id": "hto0gtb",
      "text": "[deleted]",
      "timestamp": "2022-01-21 23:13:41",
      "score": -1,
      "num_children": 5,
      "replies": [
        {
          "id": "htob845",
          "text": "Stop giving EA money",
          "timestamp": "2022-01-22 00:25:21",
          "score": 14,
          "num_children": 0,
          "author": 143323,
          "replies": []
        },
        {
          "id": "hto6zyq",
          "text": "Lmao paying 100$ for battlefield😂",
          "timestamp": "2022-01-21 23:56:44",
          "score": 32,
          "num_children": 1,
          "author": 142683,
          "replies": [
            {
              "id": "htok97a",
              "text": "Imagine being this retarded",
              "timestamp": "2022-01-22 01:27:21",
              "score": 15,
              "num_children": 1,
              "author": 329735,
              "replies": [
                {
                  "id": "htp0qek",
                  "text": "Who tf buys the yearly cod or battlefield lamoo and gets the digital deluxe version 😂",
                  "timestamp": "2022-01-22 03:23:37",
                  "score": 9,
                  "num_children": 1,
                  "author": 142683,
                  "replies": [
                    {
                      "id": "htpv29a",
                      "text": "Battlefield releases every 3 years",
                      "timestamp": "2022-01-22 07:56:08",
                      "score": 3,
                      "num_children": 0,
                      "author": 403133,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hto7rdy",
          "text": "How's often is that happening, and which would piss you off the most if I play free?",
          "timestamp": "2022-01-22 00:01:55",
          "score": 4,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "htpv373",
          "text": "Idiot",
          "timestamp": "2022-01-22 07:56:26",
          "score": 2,
          "num_children": 0,
          "author": 403133,
          "replies": []
        },
        {
          "id": "htqeo7h",
          "text": "Get fricked idiot kek",
          "timestamp": "2022-01-22 11:49:57",
          "score": 1,
          "num_children": 0,
          "author": 225759,
          "replies": []
        }
      ]
    },
    {
      "id": "htp0v6u",
      "text": "> Anon: EA make poopy game.\n\n> Reddit: OHHHH BUUUUURN! How will EA ever recover from such biting commentary??",
      "timestamp": "2022-01-22 03:24:37",
      "score": 0,
      "num_children": 0,
      "author": 233608,
      "replies": []
    },
    {
      "id": "htnrb91",
      "text": "Make this Anon go viral..",
      "timestamp": "2022-01-21 22:15:50",
      "score": 1,
      "num_children": 0,
      "author": 60000,
      "replies": []
    },
    {
      "id": "htodbzt",
      "text": "Hell Let Loose is a perfect game for the battlefield players that feel left in the rain. However, you must communicate and not run out in the open. You'll just get blasted lmao",
      "timestamp": "2022-01-22 00:39:44",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "htnzarl",
      "text": "Top 5 battlefield of all time .\n\n1) bad company 2\n2) bf3\n3) bad company 1\n4) bfbc2 Vietnam expansion \n5) bf5",
      "timestamp": "2022-01-21 23:06:05",
      "score": -6,
      "num_children": 1,
      "replies": [
        {
          "id": "hto0b1l",
          "text": "Putting bfV in your top five and not recognizing bf1, you're a joke.",
          "timestamp": "2022-01-21 23:12:38",
          "score": 20,
          "num_children": 2,
          "author": 389027,
          "replies": [
            {
              "id": "htoo8gp",
              "text": "Bf1 was a clunky arcade shooter and the gun play was garbage . Spam hellreigal and grenades rinse repeat .\n\nBf5 started off bad but got good once they fixed some major issues . Pacific theater saved the game , and it would of went on to be even better had we gotten more maps eastern front , fall of Berlin , d day etc bht they canceled the content to make this piece of shjt game",
              "timestamp": "2022-01-22 01:55:16",
              "score": 4,
              "num_children": 1,
              "replies": [
                {
                  "id": "htpbzq6",
                  "text": "hell yeah pacific theater launch was hype. Game was doing really well FINALLY and then they cut the cord",
                  "timestamp": "2022-01-22 04:50:48",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "htqfnh2",
                      "text": "Solomon island launch playlist with the conquest/ breakthrough mix was the most fun I had on bf5 at any point",
                      "timestamp": "2022-01-22 12:01:17",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "htrd09o",
                          "text": "dont forget when Underground came out",
                          "timestamp": "2022-01-22 16:37:48",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hto39cz",
              "text": "BFV would've been unironically the best battlefield game if they had pumped more content into it",
              "timestamp": "2022-01-21 23:31:54",
              "score": 5,
              "num_children": 0,
              "author": 77393,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "htnzwne",
      "text": "Imagine being a gamer.",
      "timestamp": "2022-01-21 23:10:01",
      "score": -1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hto71ez",
      "text": "I hope they add more female soldiers",
      "timestamp": "2022-01-21 23:57:01",
      "score": -2,
      "num_children": 0,
      "author": 59387,
      "replies": []
    },
    {
      "id": "htny1m8",
      "text": "Great idea but sounds expensive how about something cheaper",
      "timestamp": "2022-01-21 22:58:05",
      "score": 1,
      "num_children": 0,
      "author": 31200,
      "replies": []
    },
    {
      "id": "htodcp7",
      "text": "[removed]",
      "timestamp": "2022-01-22 00:39:51",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "htodcu5",
          "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```retards```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
          "timestamp": "2022-01-22 00:39:53",
          "score": -1,
          "num_children": 0,
          "author": 184140,
          "replies": []
        }
      ]
    },
    {
      "id": "htou42i",
      "text": "Anon is making ketamine",
      "timestamp": "2022-01-22 02:36:44",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "htp72bt",
      "text": "Lmao they can suck a ding dong at this point. What did they expect when the majority of their playerbase are tactical warfare simulation lovers?",
      "timestamp": "2022-01-22 04:10:38",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "htpntcx",
      "text": "Just release regular content. Instead of waiting for 6 months after everyone has already lost interest.",
      "timestamp": "2022-01-22 06:38:18",
      "score": 1,
      "num_children": 0,
      "author": 116184,
      "replies": []
    },
    {
      "id": "htpsbp5",
      "text": "You know Tom Henderson isnt ea right.",
      "timestamp": "2022-01-22 07:25:25",
      "score": 1,
      "num_children": 1,
      "author": 292204,
      "replies": [
        {
          "id": "htpvmt3",
          "text": "He leaked the shit out of this game",
          "timestamp": "2022-01-22 08:02:42",
          "score": 2,
          "num_children": 0,
          "author": 403133,
          "replies": []
        }
      ]
    },
    {
      "id": "htqbq3j",
      "text": "Sorry for being out of the loop, but what happened to this game? It probably had one of the coolest trailer drops for a game I've seen. Did it turn out shit?",
      "timestamp": "2022-01-22 11:15:30",
      "score": 1,
      "num_children": 0,
      "author": 203635,
      "replies": []
    },
    {
      "id": "htqbsgj",
      "text": "Kid: I want to play call of duty\n\nMom: we have call of duty at home\n\nAt home:",
      "timestamp": "2022-01-22 11:16:18",
      "score": 1,
      "num_children": 0,
      "author": 203635,
      "replies": []
    },
    {
      "id": "htqdalj",
      "text": "They should go with F2P at the start.... but the open beta was a shit show... and u need a good gpu to play this.... but atm they are overpriced",
      "timestamp": "2022-01-22 11:34:01",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "htqhyog",
      "text": "I can't comment about other people, but with shortage of pc parts and the rising cost to upgrade an existing pc is the issue for me. On a Titan X (maxwell) I can play it on Low settings max. I won't spend money on a game which I can't enjoy the full graphical experience.",
      "timestamp": "2022-01-22 12:27:17",
      "score": 1,
      "num_children": 0,
      "author": 16602,
      "replies": []
    },
    {
      "id": "htqwygv",
      "text": "I was one of those dummies who jumped into the game hoping to get another battlefield 3 at launch sort of experience.\n\nLucky me, Deep Rock Galactic was free on PS plus this month and I haven't looked back",
      "timestamp": "2022-01-22 14:43:18",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "htsyqsc",
      "text": "You just st make one game and you update it graphically and optionally. Like RUST.",
      "timestamp": "2022-01-22 23:01:13",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "htopvet",
      "text": "Make a battle royale you cowards",
      "timestamp": "2022-01-22 02:06:54",
      "score": 0,
      "num_children": 0,
      "author": 103883,
      "replies": []
    },
    {
      "id": "htptimv",
      "text": "> Making a good game. \n\nInstead of blatantly and vaguely saying it, talk details and how-to.",
      "timestamp": "2022-01-22 07:38:35",
      "score": 0,
      "num_children": 0,
      "author": 234536,
      "replies": []
    }
  ]
}