{
  "id": "sh186a",
  "text": "“Ireland is no longer a Catholic country. We are now a pluralist country with Catholic laws that we are gradually dismantling. The most important next step is removing the anachronistic control that the Catholic Church has over the education of our children,” it said in a statement.\n",
  "timestamp": "2022-01-31 13:27:10",
  "score": 21043,
  "subreddit": "t5_2qh2p",
  "num_children": 134,
  "author": 186992,
  "replies": [
    {
      "id": "hv1fhiy",
      "text": "Hello r/all, Welcome to r/atheism!\n\nPlease read our [Commandments](http://www.reddit.com/r/atheism/wiki/guidelines) and [FAQ](http://www.reddit.com/r/atheism/wiki/FAQ) before commenting. If you follow the rules and act civilly we can avoid a lot of bans. While everyone is welcome here, this sub is intended for atheists to discuss things of interest to us. This means that a wide variety of subjects are on-topic here. This is not a sub about just atheism.\n\nRemember: The mods do not choose which posts get voted up the frontpage. They remove the posts that violate the [Commandments](/r/atheism/w/guidelines); they don't police quality.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*",
      "timestamp": "2022-01-31 20:23:14",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "huzsinc",
      "text": "Banning abortion really fucked them over.  Now the younger generation greatly outvotes the older, and they're done with the Catholic church.",
      "timestamp": "2022-01-31 14:04:13",
      "score": 1702,
      "num_children": 11,
      "replies": [
        {
          "id": "huzz6wm",
          "text": "it often amazes me when the wind of change is already coming, but the old geezers just hang onto their beliefs to the point where the next generations use their resistance as a rallying point and vote them out. my country was also deeply religious at my grandma's time, but their constant conservative nay-saying to everything just caused the next generations vote for the progress. now the church has very little political power any more.",
          "timestamp": "2022-01-31 14:53:37",
          "score": 824,
          "num_children": 10,
          "author": 372426,
          "replies": [
            {
              "id": "huzzxa7",
              "text": "Now do the U.S.",
              "timestamp": "2022-01-31 14:58:49",
              "score": 776,
              "num_children": 9,
              "author": 186992,
              "replies": [
                {
                  "id": "hv010uk",
                  "text": "Covid is doing the heavy lifting for us.",
                  "timestamp": "2022-01-31 15:06:27",
                  "score": 368,
                  "num_children": 6,
                  "replies": [
                    {
                      "id": "hv028mh",
                      "text": "Not really.  The death rates are bad, but they're distributed in such a way that it won't make any difference in terms of their absence from the voting pool.  On the other hand, there's a religious/political extremist movement that is gaining strength and a political class that is both on board with extremism and is actively taking steps to strengthen their power despite demographic changes.",
                      "timestamp": "2022-01-31 15:14:45",
                      "score": 279,
                      "num_children": 6,
                      "author": 171841,
                      "replies": [
                        {
                          "id": "hv0bstm",
                          "text": "The heavy lifting isn’t the death rate, it is all the people who broke their weekly church habit  who realized they don’t need it.",
                          "timestamp": "2022-01-31 16:17:56",
                          "score": 199,
                          "num_children": 4,
                          "author": 165486,
                          "replies": [
                            {
                              "id": "hv0n28t",
                              "text": "Most of the real nutjobs I've met didn't attend church much to begin with.",
                              "timestamp": "2022-01-31 17:27:44",
                              "score": 114,
                              "num_children": 2,
                              "author": 318505,
                              "replies": [
                                {
                                  "id": "hv2x2u4",
                                  "text": "The true crazy fundamentalists are the ones who “practice church at home” because their too whack for even the church going Christians.",
                                  "timestamp": "2022-02-01 02:33:20",
                                  "score": 26,
                                  "num_children": 1,
                                  "author": 370599,
                                  "replies": [
                                    {
                                      "id": "hv3jscx",
                                      "text": "amen",
                                      "timestamp": "2022-02-01 05:39:00",
                                      "score": 6,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "hv221zc",
                                  "text": "Exactly. Religion is accessory to flash when being called out on bullshit, bigotry or fascist rhetoric, but make no mistake - they believe in god only slightly more than my atheist ass.\n\nFor the true believers, they need meds and a case worker. Belief at this point is a mental illness.",
                                  "timestamp": "2022-01-31 22:47:53",
                                  "score": 39,
                                  "num_children": 2,
                                  "author": 68253,
                                  "replies": [
                                    {
                                      "id": "hv4o7s9",
                                      "text": "Church and religion pushes a lot of the fake news onto their people who blindly agree. Especially in mega churches.",
                                      "timestamp": "2022-02-01 13:25:30",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 280981,
                                      "replies": []
                                    },
                                    {
                                      "id": "hv4qnpi",
                                      "text": "[removed]",
                                      "timestamp": "2022-02-01 13:45:27",
                                      "score": 0,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hv5c3js",
                                          "text": "I can’t tell if you should have a /s or not. If you’re serious, seek help.",
                                          "timestamp": "2022-02-01 16:12:00",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 68253,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hv0g3md",
                              "text": "This is anecdotal, but I suspect that people not attending church is actually leading to a lot of the religious radicalization that we're seeing now.  This sounds counterintuitive but here's what I've seen with some of my relatives:  When they go to church, they're told what to believe and in order to maintain a large enough base of followers the church leadership has to try to appeal to at least somewhat mainstream views.  Your typical middle class family in the suburbs isn't likely to attend a church that focuses on JFK coming back to life in Dallas or how Bill Gates put invisible 5G chips in medicine that was made in Germany.  It's just too ridiculous and most people would be repelled by that.  As a result, church membership kept some of the craziest ideas in check to a limited degree, and as a result kept some people from becoming more extreme in their views.\n\nAs a result of people leaving churches in accelerating numbers, a lot of people who have little to no critical thinking skills have been cut adrift without a paddle.  They get their news from the internet and from extreme TV networks that cater to whatever amount of nonsense that they will believe in -- this can range from political extremism that isn't physically impossible (e.g. the big lie), to actually batshit insane stuff (flat Earth).  This also significantly blurs the lines between their religious ideas and general political ideas, as well as everything else in between.  \n\nThere's no foundational doctrine and everyone can go belief shopping whenever they want.  They change ideas often without realizing it, believing that they are consistent because their core ideology is one based on their feelings of rage rather than real ideas.  For many of us that view subreddits like this one, we came from a religious background, went through a process, then came out the other side often with an affinity for science and logic.  Obviously not all atheists do that, but those of us that went through such a process tend to believe that's what happens to most of us.  Instead, a significant number of people just jump from one crazy belief system to another, because they never understood the foundational logical problems in the first place.\n\nIn any case sorry for going off on a long reply to a one sentence comment but I think it's dangerous to underestimate the situation people can find themselves in when they leave organized churches.  We're seeing a lot of people who are replacing something bad with something worse.",
                              "timestamp": "2022-01-31 16:44:59",
                              "score": 171,
                              "num_children": 14,
                              "author": 171841,
                              "replies": [
                                {
                                  "id": "hv0wjmq",
                                  "text": "Don't be sorry - you've articulated a complex situation that can be started simplistically from say a person getting the drug/alcohol monkey off their back and merely replacing it with the jesus-chimp (sorry Chimps!), which evolved to what we've collectively got now. And you spelled that out beautifully. I've been thinking a lot about our society concerning this, but it's been very fragmented in my mind.",
                                  "timestamp": "2022-01-31 18:25:44",
                                  "score": 43,
                                  "num_children": 0,
                                  "author": 17781,
                                  "replies": []
                                },
                                {
                                  "id": "hv0nv4z",
                                  "text": "Totally agree. They believe anything on Facebook it's crazy",
                                  "timestamp": "2022-01-31 17:32:36",
                                  "score": 28,
                                  "num_children": 0,
                                  "author": 199584,
                                  "replies": []
                                },
                                {
                                  "id": "hv0yk0n",
                                  "text": "> Instead, a significant number of people just jump from one crazy belief system to another, because they never understood the foundational logical problems in the first place.\n\nYep. And their religion and their parents wanted them that way, as it made them easier to control. And now their ignorance of good epistemology has set them free... in the stupidest way possible.",
                                  "timestamp": "2022-01-31 18:38:01",
                                  "score": 22,
                                  "num_children": 0,
                                  "author": 160537,
                                  "replies": []
                                },
                                {
                                  "id": "hv150h4",
                                  "text": "I think your on to something. This rings true in several ways.\n\nI myself fell into conspiracy theories around 9-11. It was after I had broken out of Jehovah's witnesses (very sheltered), and in my search for the truth (after realizing everything I was taught to believe was a lie) I was very susceptible to conspiracy theory ideas. Eventually I found science, but it took a few years and lots of critical thinking and research. And I don't think most people would do that research. At least not in a way that they are honest with themselves.",
                                  "timestamp": "2022-01-31 19:17:45",
                                  "score": 16,
                                  "num_children": 2,
                                  "author": 92306,
                                  "replies": [
                                    {
                                      "id": "hv181ez",
                                      "text": "I was on a similar path to you, but broke out of a very extreme evangelical cult.  They used a lot of horrific techniques used to keep people in compliance.  I was faced with the idea of being basically not just excommunicated from my religious group but from my actual family if I had even so much as asked the wrong questions to the wrong person.  \n\nIn any case, what really planted the seeds of doubt in my mind was reading Carl Sagan's book \"The Demon Haunted World\" after I really liked the movie Contact and read the book.  Especially after reading about the dragon in his garage I really couldn't help but question more and more of the Bible and I felt like the scales fell from my eyes (to use religious terms) and eventually I couldn't help but not be a part of that religion anymore.\n\nHowever, despite being a fan of science and reading more books like Sagan's, I found myself veering into some wacky territory.  I really liked the whole UFO thing and a friend eventually turned me onto a book by Zecharia Sitchin that seems like it was the inspiration for the \"Ancient Aliens\" TV show.  I also remember watching Fahrenheit 9/11 or whatever that was and falling into the narratives exposed there too, when it comes to 9/11 conspiracy theories.  I hadn't yet developed my personal sense of logic and a good understanding of how to research things beyond what was presented to me.  I was also still very naïve and couldn't comprehend that someone could make a compelling case for utter bullshit.\n\nUltimately, it took probably a decade after leaving my religious background, through a lot of effort to develop my logic, my skepticism, my research abilities, and my general understanding of how things work to try to catch up to what seems to be innate to a lot of well educated people.  I'm still far from perfect and nobody I grew up with that has left the same cult I was in has gone in the direction I have.  The closest is probably one of my siblings but they still had to replace the cult for a more mainstream church.  Deprogramming is not easy and I don't think it's something people can easily do without help.",
                                      "timestamp": "2022-01-31 19:36:45",
                                      "score": 13,
                                      "num_children": 1,
                                      "author": 171841,
                                      "replies": [
                                        {
                                          "id": "hv196yq",
                                          "text": "Yeah a lot of what you just said sounds very very familiar. I too lost not only everyone I ever knew but my parents as well. I learned to cope by pretending they are dead. Not nice, but it's a way of coping. And it took me a solid decade to get to a place where my head was screwed on right.\n\nI love Carl Sagan. And Christopher Hitchens. Wish I knew about them when they were alive.\n\nAnd yes, deprogramming is extremely hard. It takes a lot of work and time. And no two people are the same. I have seen people I grew up with fall back into another religion after leaving. I think on some level it's easier to tell yourself well that group got it wrong, but these people don't believe that... And next thing you know you traded one lie for another. Looking at the bigger picture is hard. Especially when everyone you know is a believer. It can be a lonely road depending on your circumstances.",
                                          "timestamp": "2022-01-31 19:43:58",
                                          "score": 6,
                                          "num_children": 0,
                                          "author": 92306,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "hv4vcmd",
                                      "text": "Iirc, the most likely people to vote religious fundamentalism and fascism are people who claim to be very religious but don’t attend regularly. That means they are getting their religious programming from TV and that they are already an unpleasant enough person that they couldn’t get along with others at a community church.",
                                      "timestamp": "2022-02-01 14:20:49",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 260014,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "hv10wn0",
                                  "text": "ok so I’ve seen this trend happening a lot IRL\n\nI live in the deep south where a lot of these conspiracy theories do indeed get parroted from the pulpit-and have heard stories from multiple people about how they left xyz church because they were too *liberal* now. \n\nI live in two different worlds; my home has an internet connection so I’m aware that people exist with views like mine-but literally none of those are people I’ve met irl-besides my wife",
                                  "timestamp": "2022-01-31 18:52:23",
                                  "score": 11,
                                  "num_children": 1,
                                  "author": 165559,
                                  "replies": [
                                    {
                                      "id": "ihg5k34",
                                      "text": "I know your situation is more complex that I can understand but I'd like to encourage you to move. No one should have to live surrounded by idiots. And if you have kids who knows how they will be influenced.",
                                      "timestamp": "2022-07-24 13:56:12",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 313862,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "hv0xrzf",
                                  "text": "Saved. This feels like something a historian will read one day with chills",
                                  "timestamp": "2022-01-31 18:33:16",
                                  "score": 6,
                                  "num_children": 0,
                                  "author": 247908,
                                  "replies": []
                                },
                                {
                                  "id": "hv2zo96",
                                  "text": "You bring up a good point. There aren't alot of community groups or clubs for people to belong to if they leave the church and aren't prepared for the lack of support that some of them might suddenly face and not be used to. They are more  vulnerable to being picked up by one extremist fringe group or another even if the group isn't directly religious since we as a society often don't offer much for them to belong to besides organized religion these days. \n\nI would hear alot about this issue in undergrad with alot of courses in political science/political theory. There's a famous book called \"Bowling Alone\" that discusses how a lot of the social groups and clubs that were popular in the mid-20th century (ex. bowling leagues, Elks Lodge, VFW, etc.) have basically collapsed which has caused our social capital to diminish greatly with the exception of church organizations or social events with co-workers. \n\n I could see how having alot of these more secular social organizations and clubs receiving little support or new members today could drive people towards more extremist groups (or to more cultlike religious groups) if they are really dependent on support structures like that. I guess you could say that having nothing to replace the church for some people who need that support can cause some issues in societies like ours that really no longer emphasize those types of connections in real life.",
                                  "timestamp": "2022-02-01 02:51:57",
                                  "score": 4,
                                  "num_children": 0,
                                  "author": 109053,
                                  "replies": []
                                },
                                {
                                  "id": "hv13jf5",
                                  "text": "Part of me kind of hopes we are all wrong, there is a God, and that when we die all these batshit insane wackjobs that claim to speak for God get what's coming to them....",
                                  "timestamp": "2022-01-31 19:08:32",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 322750,
                                  "replies": []
                                },
                                {
                                  "id": "hv1tdj2",
                                  "text": "Damn that's a hell of a point",
                                  "timestamp": "2022-01-31 21:50:52",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 193603,
                                  "replies": []
                                },
                                {
                                  "id": "hv48e6t",
                                  "text": "I think this could be called a **'spiritual vacuum'**, where individuals progressing out of religion lack the *spiritual affirmation* they received in there beliefs. Hence they experience a void and like you said seek a form a of validation and affirmation in something else... which can be problematic sometimes...\n\nI remember studying **TS Elliots** works at school and talking about exactly this in my essays, his *suite of poetry (Preludes, Prufrock, The Hollow Men)* embodies a transition into modernism away from the paradigms of religion within the Victorian era and follows exactly what you we're talking about where previously religious individuals are lost and seek validation via facades to fill the void.",
                                  "timestamp": "2022-02-01 10:39:57",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 178478,
                                  "replies": []
                                },
                                {
                                  "id": "hv0zbso",
                                  "text": "This is very insightful, and rings true with my observations. Thanks for sharing.",
                                  "timestamp": "2022-01-31 18:42:45",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 275842,
                                  "replies": []
                                },
                                {
                                  "id": "hv13k4u",
                                  "text": "Extremely well put. Mirrors my own thoughts.",
                                  "timestamp": "2022-01-31 19:08:39",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 370147,
                                  "replies": []
                                },
                                {
                                  "id": "hv18u96",
                                  "text": "Additionally, the extremists understand that no one just suddenly starts to believe the crazier stuff. They point out real instances of wrong doing and corruption that everyone can see in the real world. They take advantage of people's very real and valid frustrations with modern society and give them a nice, simple answer and a promise of hope. It's really not surprising that so many people fall down the rabbit hole.",
                                  "timestamp": "2022-01-31 19:41:46",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 134999,
                                  "replies": []
                                },
                                {
                                  "id": "hv3kp41",
                                  "text": "I do think you are right. However, it should be noted that the crazies are never a large number. \n\nI figure about 10-15% of the population is crazy. Some of them at the left extreme, but more often at the right extreme.\n\nGoing back to where this discussion started. Demographics are clearly moving towards more progressive politics. Conservative Hispanics are the only numerically significant trend in the opposite direction.\n\nNate Silver calculated if every eligible voter in Texas would vote, Texas would be Democratic. Yes, the state that just implemented the most draconian abortion law.\n\nVoter suppression is currently keeping Republicans in power in quite a few states, which is why Texas is not yet Ireland. But demographically, it's basically already there.",
                                  "timestamp": "2022-02-01 05:48:02",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 279462,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hv0ochj",
                              "text": "They joined Q. They’ll vote for even more extreme stuff.",
                              "timestamp": "2022-01-31 17:35:29",
                              "score": 7,
                              "num_children": 0,
                              "author": 286960,
                              "replies": []
                            },
                            {
                              "id": "hv13o20",
                              "text": "Consider that the HCA winners are mostly those who would certainly be quite vocal and active during an election campaign. I suspect one side of the aisle will have to work harder to energize their base than in previous years. Of course, the opposite is doing their part to keep things even by shitting all over their campaign promises and alienating their voters every chance they get, so I guess we'll see...",
                              "timestamp": "2022-01-31 19:09:20",
                              "score": 1,
                              "num_children": 0,
                              "author": 406050,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hv02hps",
                          "text": "The numbers are grossly under reported, especially in Florida.  Florida has a solid chance of turning blue based solely on the death rate.",
                          "timestamp": "2022-01-31 15:16:30",
                          "score": 58,
                          "num_children": 6,
                          "replies": [
                            {
                              "id": "hv0gvb1",
                              "text": "Don’t worry, Deathsantis and the Republicans will just Gerrymander the districts to ensure a W.",
                              "timestamp": "2022-01-31 16:49:43",
                              "score": 14,
                              "num_children": 1,
                              "author": 186992,
                              "replies": [
                                {
                                  "id": "hv0idkq",
                                  "text": "they'll try, but gerrymandering only goes so far.  (much farther than I'd like but even so)  The gop is 3-5 cycles away from having zero chance to win if things don't change.  Losing the boomers to you know...old age death, will cripple their numbers beyond the point of being able to win, no matter how hard they cheat.  At that point they have to change or go with something much more direct, and scary.",
                                  "timestamp": "2022-01-31 16:59:02",
                                  "score": 11,
                                  "num_children": 3,
                                  "author": 74641,
                                  "replies": [
                                    {
                                      "id": "hv0oljt",
                                      "text": "They’ll make it harder and harder for voters who aren’t likely to vote for them.",
                                      "timestamp": "2022-01-31 17:37:02",
                                      "score": 11,
                                      "num_children": 0,
                                      "author": 286960,
                                      "replies": []
                                    },
                                    {
                                      "id": "hv0p256",
                                      "text": "There already going with the dangerous and scary. It’s happening right now.",
                                      "timestamp": "2022-01-31 17:39:54",
                                      "score": 6,
                                      "num_children": 0,
                                      "author": 38405,
                                      "replies": []
                                    },
                                    {
                                      "id": "hv1l3bp",
                                      "text": "One more presidential term by Trump or a Trump-wannabe will be the final kick to turn to country blue. Whether the Repugs can counter this by a soft coup of electoral manipulation is hard to tell.",
                                      "timestamp": "2022-01-31 20:58:22",
                                      "score": 3,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hv039pi",
                              "text": "I can't remember where, but supposedly the number of people moving to Florida who are politically right-leaning will offset that and then some.  We've seen that in Texas as well, where in the election between Ted Cruz and Beto O'Rourke, the [newcomers to Texas voted solidly for Cruz while lifelong Texans voted more for Beto](https://www.dallasnews.com/news/politics/2018/11/09/native-texans-voted-for-native-texan-beto-o-rourke-transplants-went-for-ted-cruz-exit-poll-shows/).",
                              "timestamp": "2022-01-31 15:21:46",
                              "score": 45,
                              "num_children": 6,
                              "author": 171841,
                              "replies": [
                                {
                                  "id": "hv069mn",
                                  "text": "That's because the people coming from New York and California are moving from the red parts of those states.",
                                  "timestamp": "2022-01-31 15:41:39",
                                  "score": 29,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hv0g90f",
                                      "text": "Yeah, but not just those really blue states.\n\nThey’re moving away from PA, WI, and MI as well.\n\nHopefully blowing their chances at still-competitive swing states.",
                                      "timestamp": "2022-01-31 16:45:55",
                                      "score": 9,
                                      "num_children": 0,
                                      "author": 144492,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "hv057z5",
                                  "text": "I guess we'll see just how badly the numbers have been under reported then.",
                                  "timestamp": "2022-01-31 15:34:47",
                                  "score": 26,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hv1ku2q",
                                      "text": "Nah, that’s what Gerrymandering and racist voting laws are for!",
                                      "timestamp": "2022-01-31 20:56:46",
                                      "score": 4,
                                      "num_children": 1,
                                      "author": 289479,
                                      "replies": [
                                        {
                                          "id": "hv1s7y1",
                                          "text": "can't gerrymander a governor election.  But yeah, racist voting laws.",
                                          "timestamp": "2022-01-31 21:43:27",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "hv0l7kk",
                                  "text": "This is what I’m seeing, anecdotally, in California. Every Republican I know is either moving to, or wants to move to, Florida/Texas/Tennessee/Idaho",
                                  "timestamp": "2022-01-31 17:16:27",
                                  "score": 16,
                                  "num_children": 2,
                                  "author": 301429,
                                  "replies": [
                                    {
                                      "id": "hv1kbt0",
                                      "text": "My brother whom I've been moderately estranged from just bought a house in Texas on the gulf coast. \n\nIt seems nuts to me to buy a house at the perfect conjunction of heat and hurricanes. But he goes on and on about how nice and friendly everybody is which I hear as a roundabout way of saying everybody in the area he selected is white.\n\nHe doesn't retire from his pretty sweet job here in California for a few more years but he plans to just let the new house sit empty until he can move. Also seems pretty nuts.",
                                      "timestamp": "2022-01-31 20:53:34",
                                      "score": 7,
                                      "num_children": 0,
                                      "replies": []
                                    },
                                    {
                                      "id": "hv27ivz",
                                      "text": "Yup. This is why conservatives think there’s some kind of mass exodus from CA… there sort of is, but it’s mainly just the nutjobs. The real population hasn’t actually changed much, and polling data shows that most Californians feel as positive as ever about their state, no real change. But if you’re in a Fox bubble and all your crazy friends are moving to Idaho it probably seems like everyone’s leaving. In my experience it’s mainly the craziest of the crazies who are leaving, and even the (already very conservative) people in the places they’re moving to fucking hate them because they’re so wildly unreasonable.",
                                      "timestamp": "2022-01-31 23:25:05",
                                      "score": 3,
                                      "num_children": 1,
                                      "author": 290094,
                                      "replies": [
                                        {
                                          "id": "hv4bo9m",
                                          "text": "Look at the bright side, if some nut from Cali moves to Texas, the average IQ in both states goes up.",
                                          "timestamp": "2022-02-01 11:20:50",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "hv0pkb9",
                                  "text": "[deleted]",
                                  "timestamp": "2022-01-31 17:43:00",
                                  "score": 16,
                                  "num_children": 3,
                                  "replies": [
                                    {
                                      "id": "hv0prwq",
                                      "text": "All the D voters that I know of from Texas end up in Colorado instead.  That could just be because Houston and Florida are more similar than different.",
                                      "timestamp": "2022-01-31 17:44:18",
                                      "score": 11,
                                      "num_children": 0,
                                      "author": 171841,
                                      "replies": []
                                    },
                                    {
                                      "id": "hv11lmx",
                                      "text": "Move to AZ, we need more help swinging this state over.",
                                      "timestamp": "2022-01-31 18:56:35",
                                      "score": 4,
                                      "num_children": 1,
                                      "author": 53757,
                                      "replies": [
                                        {
                                          "id": "hv4wx2r",
                                          "text": "My daughter is moving to Arizona for grad school; she votes blue!",
                                          "timestamp": "2022-02-01 14:32:01",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 46669,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "hv1bkjv",
                                      "text": "I think at this point, Texas is more of a swing state than Florida, which will probably be red for the foreseeable future.",
                                      "timestamp": "2022-01-31 19:58:41",
                                      "score": 5,
                                      "num_children": 0,
                                      "author": 97632,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "hv0l8no",
                                  "text": "That also means that the states the conservatives are moving *from* is getting less conservative.  Maybe not enough to swing the state though.",
                                  "timestamp": "2022-01-31 17:16:38",
                                  "score": 9,
                                  "num_children": 0,
                                  "author": 313473,
                                  "replies": []
                                },
                                {
                                  "id": "hv0otgz",
                                  "text": "Ok this explains a lot. Had never heard this before and can say, anecdotally, I’ve watched the state I grew up in robbed by shitty boomer politicians and newcomers. Austin has high rises all over downtown when not a single Austin native I knew wanted the skyline to change at the time. Couldn’t find a single native that voted for it but it passed. Rent doubled in a years time (800 to 1600) in the early 2000s. For all of my years here, it’s been one step forward three steps back and seemingly driven by people that are nothing like any Texans I’ve ever known.",
                                  "timestamp": "2022-01-31 17:38:24",
                                  "score": 4,
                                  "num_children": 0,
                                  "author": 38405,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hv0hs5l",
                              "text": "even so, even if the numbers were 10 times what we know, that's still not enough to make a dramatic demographic change.  Though it certainly might be enough to swing elections in close states like florida, which would expedite change in a hurry.",
                              "timestamp": "2022-01-31 16:55:23",
                              "score": 5,
                              "num_children": 0,
                              "author": 74641,
                              "replies": []
                            },
                            {
                              "id": "hv0wqjx",
                              "text": "Maybe - but they've still got fringe leadership over there...",
                              "timestamp": "2022-01-31 18:26:54",
                              "score": 2,
                              "num_children": 1,
                              "author": 17781,
                              "replies": [
                                {
                                  "id": "hv0xbrn",
                                  "text": "Can't gettymander the governor election.",
                                  "timestamp": "2022-01-31 18:30:31",
                                  "score": 2,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hv19z7d",
                                      "text": "Honestly, I'm at a crossroads in my life, and will likely have to move to a lower COL state from my current state of escalating prices; AZ. \n\nWhile there are progressive cities in FL the thought of living in a place surrounded by reds terrifies me. Especially if a civil war breaks out - which may happen in 2024. I don't think the lunatic fringe government in FL is going to change in my lifetime (I'll be 65 this year).\n\nWhat everyone us talking about in this entire thread; people moving to their like-minded states - is exactly the preparation; consciously, or not - that is needed for a 21st Century civil war.",
                                      "timestamp": "2022-01-31 19:48:50",
                                      "score": 3,
                                      "num_children": 0,
                                      "author": 17781,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hv0lgzp",
                              "text": "Really? Thats insane.",
                              "timestamp": "2022-01-31 17:18:04",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            },
                            {
                              "id": "hv05529",
                              "text": "Lol yeah.....no it doesn’t",
                              "timestamp": "2022-01-31 15:34:16",
                              "score": -3,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hv0le2r",
                          "text": "It's not just people dying that is losing votes. Think about how many people experience permanent disability from covid, as well as long haul symptoms. Couple that with republicans dismantling voting rights. A person who has permanent shortness of breath can't stand in a voting line for hours, and also can't mail in a ballot because that has been gutted. Tht very definition of shooting yourself in the foot.",
                          "timestamp": "2022-01-31 17:17:34",
                          "score": 7,
                          "num_children": 0,
                          "author": 291978,
                          "replies": []
                        },
                        {
                          "id": "hv04wz9",
                          "text": "Give it time. Basically everyone who's still unvaxxed will be that way forever, and Covid isn't going anywhere.",
                          "timestamp": "2022-01-31 15:32:44",
                          "score": 9,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hv071aq",
                              "text": "The problem is that as long as too many people remain unvaccinated, and our government continues to have a slow approval process as we're seeing with the omicron vaccines, we're going to have more variants that evade vaccines pop up and it's possible that there will be some new one that has worse outcomes for everyone.\n\nFor the record I'm extremely pro-vaccination and got my shots, boosters, and my kids got their shots as soon as available.  Omicron is getting a lot of people who were even boosted that I know (but generally, my family are some of the few people we know that wear masks generally still.)  Right now things seem like once the Omicron wave is done we should be good but it seems like that happens with every new wave.",
                              "timestamp": "2022-01-31 15:46:38",
                              "score": 13,
                              "num_children": 0,
                              "author": 171841,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hv0x967",
                          "text": "Yeah, if we just banned unvaxxed people from the hospitals altogether it would help a lot.",
                          "timestamp": "2022-01-31 18:30:04",
                          "score": 3,
                          "num_children": 0,
                          "author": 160537,
                          "replies": []
                        },
                        {
                          "id": "hv063cy",
                          "text": "Good thing we have that oh so wonderful second amendment.",
                          "timestamp": "2022-01-31 15:40:31",
                          "score": -8,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hv0mvve",
                      "text": "The way things are going I would bet money that Trump is going to be president in 2024. People need to do some lifting themselves",
                      "timestamp": "2022-01-31 17:26:39",
                      "score": 9,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hv0nyd2",
                          "text": "Oh, but he won in 2020, and you can't get elected more than twice. So he can't run again. /s",
                          "timestamp": "2022-01-31 17:33:07",
                          "score": 13,
                          "num_children": 1,
                          "author": 244333,
                          "replies": [
                            {
                              "id": "hv0xwum",
                              "text": "I see what you did there 😉\n\nSo - what will he say at press conference, on the campaign trail when someone says that to him?\n\n\"Oh, I didn't really win - hee, hee!\"",
                              "timestamp": "2022-01-31 18:34:07",
                              "score": 4,
                              "num_children": 0,
                              "author": 17781,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hv0kxew",
                      "text": "When it comes to conservatism yes more broadly across the country. We will see major impacts in swing states. But Florida and Texas are attracting conservatives from New York and California respectively.",
                      "timestamp": "2022-01-31 17:14:43",
                      "score": 3,
                      "num_children": 1,
                      "author": 377737,
                      "replies": [
                        {
                          "id": "hv3gope",
                          "text": "That won't make much difference in relation to how those states have been turned into living nightmares. The blue politicians have done horrible jobs and that's going to have a strong effect.\n\nEspecially in California... Greetings from San Jose",
                          "timestamp": "2022-02-01 05:09:27",
                          "score": 0,
                          "num_children": 0,
                          "author": 333663,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hv15f0u",
                      "text": "6-3 SCOTUS, shit low approvals for both the president and Vice President, terrible prognosis for the 2022 election. \n\nCOVID killed the blue wave, not GOP destroying democracy and freedom. \n\nAdd to that that young people either don’t vote or vote as their parents. \n\nI’ll cheer when the Christian Right is gone from power.",
                      "timestamp": "2022-01-31 19:20:17",
                      "score": 4,
                      "num_children": 1,
                      "author": 242458,
                      "replies": [
                        {
                          "id": "hv2ao7x",
                          "text": "Actually the young people do vote, but eliminating student debt was the promise and Biden went back on it, so that may hurt",
                          "timestamp": "2022-01-31 23:47:34",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hv1qvvc",
                      "text": "Banning books, dismantling education and weaponised misinformation is the boomer way of fighting back",
                      "timestamp": "2022-01-31 21:34:57",
                      "score": 1,
                      "num_children": 0,
                      "author": 183351,
                      "replies": []
                    },
                    {
                      "id": "hv3jot6",
                      "text": "Nope. You notice that the places that lose the most people are big cities where people are crammed in so tight that they can't help but get infected? And most of those are in places where the voters are dem or progressive. Yeah, lots of anti-vaxers/maskers are dying, but they make sure that they have lots of brainwashed,  conspiracy believing kids to take their places.",
                      "timestamp": "2022-02-01 05:38:02",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hv0i05v",
                  "text": "I mean, we're getting there. Millennials and Gen-Z are significantly less religious than their elders, and unlike the older generations we know what it's like to grow up under the yoke of religious oppression, so I think we'll cast it off eventually.",
                  "timestamp": "2022-01-31 16:56:45",
                  "score": 17,
                  "num_children": 0,
                  "author": 261330,
                  "replies": []
                },
                {
                  "id": "hv0lpqg",
                  "text": "The abortion bans and overturning Roe v. Wade just may do it. It’s sad some women may die to spur the change.",
                  "timestamp": "2022-01-31 17:19:33",
                  "score": 10,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hv0nc0c",
                  "text": "Gotta get the dinosaurs to stop fucking running! Why anyone in their 70s or 80s thinks so highly of themselves to believe their the ones who should be running a country in the year 2022 is baffling to me. It's a huge red flag of a god complex. And yet, they run and run and run and stiffle any younger progressive candidates future. It would be baffling that they'd be so short sighted concerning the future of their party, and yet it's obvious they don't give af about anyone but themselves to of course they don't care...",
                  "timestamp": "2022-01-31 17:29:22",
                  "score": 9,
                  "num_children": 0,
                  "author": 218593,
                  "replies": []
                },
                {
                  "id": "hv29byb",
                  "text": "Came here to say this!!!! \nUS next! If religious people want to live according to religious laws, they can. But dont force the rest of us to.",
                  "timestamp": "2022-01-31 23:38:02",
                  "score": 3,
                  "num_children": 0,
                  "author": 191335,
                  "replies": []
                },
                {
                  "id": "hv3a91y",
                  "text": "7 fucking Catholics on the Supreme Court.  \n\nThe pope now controls the laws in the US.",
                  "timestamp": "2022-02-01 04:13:36",
                  "score": 2,
                  "num_children": 0,
                  "author": 231951,
                  "replies": []
                },
                {
                  "id": "hv0h2dx",
                  "text": "Thankfully, religion still has very little place in public education in the States.\n\nReligion in the classroom is the one thing that's prevented me to moving back to Ireland.",
                  "timestamp": "2022-01-31 16:50:56",
                  "score": 3,
                  "num_children": 2,
                  "author": 121530,
                  "replies": [
                    {
                      "id": "hv0p1hr",
                      "text": ">> The Pledge of Allegiance to the Flag: \"I pledge allegiance to the Flag of the United States of America, and to the Republic for which it stands, one Nation under God\n\n\nDo you guys still indoctrinate every kid with making them recite this weird shite?",
                      "timestamp": "2022-01-31 17:39:47",
                      "score": 21,
                      "num_children": 2,
                      "author": 75406,
                      "replies": [
                        {
                          "id": "hv0rjnv",
                          "text": "Yes, children do recite the pledge in public schools. Students are not legally required to participate and teachers are prohibited from retaliating against those who choose to abstain.\n\nThe “under God” wasn’t even part of the original pledge, yet Christians cling to it with a vengeance.",
                          "timestamp": "2022-01-31 17:55:03",
                          "score": 8,
                          "num_children": 0,
                          "author": 12906,
                          "replies": []
                        },
                        {
                          "id": "hv0tduc",
                          "text": "Agreed—so weird. As far as I know, yes, many schools still do this.",
                          "timestamp": "2022-01-31 18:06:20",
                          "score": 3,
                          "num_children": 1,
                          "author": 121530,
                          "replies": [
                            {
                              "id": "hv169cv",
                              "text": "Yeah, seems god still has his hand in the American pie",
                              "timestamp": "2022-01-31 19:25:36",
                              "score": 2,
                              "num_children": 0,
                              "author": 75406,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hv14tuk",
                      "text": "I’m guessing you don’t currently live in the Bible Belt or in a rural area.",
                      "timestamp": "2022-01-31 19:16:37",
                      "score": 2,
                      "num_children": 0,
                      "author": 106713,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hv1nchm",
                  "text": "Gerrymandering prevents this",
                  "timestamp": "2022-01-31 21:12:31",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hv1t69g",
                  "text": "We are trying.",
                  "timestamp": "2022-01-31 21:49:35",
                  "score": 1,
                  "num_children": 0,
                  "author": 295848,
                  "replies": []
                }
              ]
            },
            {
              "id": "hv0bqxo",
              "text": "Same in Quebec! (And elsewhere in Canada, but a recognized social revolution in Quebec...)",
              "timestamp": "2022-01-31 16:17:36",
              "score": 11,
              "num_children": 1,
              "author": 137103,
              "replies": [
                {
                  "id": "hv0vazx",
                  "text": "...and Ontario.  Why we continue to publicly fund Catholic education is beyond me in this day and age.",
                  "timestamp": "2022-01-31 18:18:10",
                  "score": 3,
                  "num_children": 1,
                  "author": 393626,
                  "replies": [
                    {
                      "id": "hv0xojy",
                      "text": "Sorry, I meant to reply one level up... Quebec has, for the most part, divorced themselves from the church and secularized their schools. \n\nGrowing up in NB, our French schools (who were Catholic but no uniforms nor mass) were secularized in the mid 90s. I thought traditional Catholic schools with uniforms were just an American movies thing, until I met Ontarians at university!",
                      "timestamp": "2022-01-31 18:32:42",
                      "score": 3,
                      "num_children": 0,
                      "author": 137103,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hv17sjb",
              "text": "It's funny, generations always complain that the next generation is ruining everything, yet progress marches on and everything tends to work out. If we look back at what we celebrate in society, how many of them are driven by conservatism? It's usually liberal ideals that push for things like universal suffrage, free education, free healthcare, etc. I can't think of one conservative change in western society that is celebrated.\n\nIt goes beyond religion though with things like climate change, the older generation are actively and maliciously sabotaging future generations to keep their lifestyles.\n\nI also look at countries like the US and UK debt levels, and it seems like the older generation is sabotaging the younger generation just to keep taxes low. Someone has to pay back all that money surely.",
              "timestamp": "2022-01-31 19:35:13",
              "score": 8,
              "num_children": 1,
              "author": 179063,
              "replies": [
                {
                  "id": "hv3t6h6",
                  "text": "in a lot of places the sabotaging has led to a noticeable worse quality of life for the next generation. one example is housing. my grandparents generation could easily afford building a house on their wages, even when granpa was the only person bringing in money. nowdays a warehouse worker doesn't have to worry about owning a house and grandpa's generation attributes this for his grandkids' generation being useless and lazy.",
                  "timestamp": "2022-02-01 07:21:25",
                  "score": 3,
                  "num_children": 0,
                  "author": 372426,
                  "replies": []
                }
              ]
            },
            {
              "id": "hv0jdq6",
              "text": "my favorite books are part of a hard scifi series by Scott Westerfeld (author of Uglies) where the terran emperor has discovered the secret to immortality. but the symbiont that grants immortality must be administered after death and is only granted to casualties of war and important statesmen. the senate is split along party lines between the Gray Party (made up of the Venerated Dead) and the Pink Party (the living). \n\n\ntldr it's basically a very drawn out political allegory saying that big changes happen only with the turning of generations, and without it society will stagnate.",
              "timestamp": "2022-01-31 17:05:14",
              "score": 6,
              "num_children": 0,
              "author": 29311,
              "replies": []
            },
            {
              "id": "hv0q2u3",
              "text": "Yea I was reading about this somewhere the other day. People in power, that have been in power for a long time, never cede any minor point even if it might cause them to maintain power for longer than they would have otherwise. Same thing is happening in the US, people can’t even raise the minimum wage from 7.25 (and other stuff) and everyone is pissed off. At some point people will be voted out, but worse people also might be voted in.",
              "timestamp": "2022-01-31 17:46:08",
              "score": 6,
              "num_children": 1,
              "author": 9794,
              "replies": [
                {
                  "id": "hv0s2n6",
                  "text": "the irony is that quite often if they'd yield in some hot potato issue, the immediate heat would go away and people would think they've 'won', even when they only got one minor change in. instead the old geezers go 'no-no-no' on everything, until the critical mass is achieved and people actually start voting someone else.",
                  "timestamp": "2022-01-31 17:58:17",
                  "score": 4,
                  "num_children": 1,
                  "author": 372426,
                  "replies": [
                    {
                      "id": "hv2ay48",
                      "text": "Yep, or a complete revolution sweeping them out, forcing all the changes through. Like Free education, healthcare and housing and sick leave,",
                      "timestamp": "2022-01-31 23:49:31",
                      "score": 5,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hv0mn4e",
              "text": "I will take an extreme example but it's a very clear one. During WW2 the priest of the French volunteer unit fighting on the eastern front under a German uniform with a French shoulder patch refused to wear it because the only flag of France was the white banner with Fleurs de Lys. It was an 80y old fighting for the same cause that prevented the restoration of the monarchy in 1870... exactly in his formating years... and his grandfather probably fought the French revolution, something like that. Even for the radicals of the 1940s he was a weird one.",
              "timestamp": "2022-01-31 17:25:09",
              "score": 3,
              "num_children": 0,
              "author": 94876,
              "replies": []
            },
            {
              "id": "hv0ywrb",
              "text": "\"but thier constant conservative nay-saying to anything just caused the next generations vote for the progress\"\n\n  \n\n\nI like to call this the footloose effect.",
              "timestamp": "2022-01-31 18:40:13",
              "score": 3,
              "num_children": 0,
              "author": 82760,
              "replies": []
            },
            {
              "id": "hv47c04",
              "text": "Very well put and great summary.",
              "timestamp": "2022-02-01 10:26:13",
              "score": 2,
              "num_children": 0,
              "author": 297750,
              "replies": []
            },
            {
              "id": "hv1mdge",
              "text": "May I ask what country you live in? Could they use a bass-playing woodworker and a nurse with two small kids?",
              "timestamp": "2022-01-31 21:06:19",
              "score": 1,
              "num_children": 1,
              "author": 364341,
              "replies": [
                {
                  "id": "hv3s37w",
                  "text": "Finland.",
                  "timestamp": "2022-02-01 07:08:34",
                  "score": 2,
                  "num_children": 0,
                  "author": 372426,
                  "replies": []
                }
              ]
            },
            {
              "id": "hv26m5z",
              "text": "What country?",
              "timestamp": "2022-01-31 23:18:50",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hv3s1k2",
                  "text": "finland",
                  "timestamp": "2022-02-01 07:08:03",
                  "score": 2,
                  "num_children": 0,
                  "author": 372426,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hv0imfl",
          "text": "This is why the white Christian Nationalists in the U.S never actually banned abortion nation wide even when they had maximum political power under Trump. \n\nThey know that without the infinite saber rattling they would lose the army of single issue voters who only care about abortion and would not vote Republican otherwise.\n\nBy actually banning abortion the Irish turned off the fear and rage machine that motivates religious voters and gave a common cause to unite younger voters.\n\nI really wish our religious conservative monsters in the U.S weren't so good at sowing division and turning people into hate and fear fueled zombies that show up at every election.",
          "timestamp": "2022-01-31 17:00:33",
          "score": 61,
          "num_children": 3,
          "author": 16094,
          "replies": [
            {
              "id": "hv28uug",
              "text": "Meh… I don’t know how many “single-issue voters” are *actually* single-issue voters. “Stopping baby murderers” rolls off the tongue, but I have very little faith that these people would vote differently if abortion was no longer an issue. Maybe they’d switch to guns, or other “religious freedom” bullshit issues, or whatever, but the darker motivations behind supporting modern conservatism are still going to be there even if their excuse changes.",
              "timestamp": "2022-01-31 23:34:38",
              "score": 14,
              "num_children": 0,
              "author": 290094,
              "replies": []
            },
            {
              "id": "hv29iu6",
              "text": "And yet Texas happened.\n\nI kind of feel like the Conservatives are caught up in their own momentum to the point that they've forgotten to play the game.",
              "timestamp": "2022-01-31 23:39:24",
              "score": 6,
              "num_children": 1,
              "author": 265193,
              "replies": [
                {
                  "id": "hv2b95j",
                  "text": "Well, public polling suggests Governor Abbott has a very low approval rating after this decision.",
                  "timestamp": "2022-01-31 23:51:39",
                  "score": 1,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "hv2cl1l",
                      "text": "Doesn't matter unless it makes a difference in the next election. And in a deep red state like Texas I doubt it will be enough to tank him.",
                      "timestamp": "2022-02-01 00:01:05",
                      "score": 5,
                      "num_children": 1,
                      "author": 265193,
                      "replies": [
                        {
                          "id": "hv2eysg",
                          "text": "Voter turnout that almost threw him out was 40%. \nThe police unions are throwing their night into whoever isn’t abbot. Will that cost him quite a bit.",
                          "timestamp": "2022-02-01 00:18:40",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hv2qhjh",
                              "text": "Unfortunately it's all at the point of \"I'll believe it when I see it\". I do hope its true though. People say Texas is more purple than Red, but until they actually swing the governor to blue I don't really think it's true.",
                              "timestamp": "2022-02-01 01:45:46",
                              "score": 2,
                              "num_children": 0,
                              "author": 265193,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hv3c9y8",
                      "text": "Not that low sadly. About 43% last I checked.",
                      "timestamp": "2022-02-01 04:30:40",
                      "score": 1,
                      "num_children": 1,
                      "author": 202982,
                      "replies": [
                        {
                          "id": "hv3ur1b",
                          "text": "That is below president Biden and these same people are saying he is incredibly unpopular,",
                          "timestamp": "2022-02-01 07:40:34",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hv4q51b",
                              "text": "It's about the same as where Biden is now, maybe one or two points behind. Neither one is \"incredibly\" unpopular, just mildly unpopular.",
                              "timestamp": "2022-02-01 13:41:20",
                              "score": 1,
                              "num_children": 1,
                              "author": 202982,
                              "replies": [
                                {
                                  "id": "hv7b9ah",
                                  "text": "My point is governor abbot calling Biden incredibly unpopular is throwing stones in a glass house",
                                  "timestamp": "2022-02-01 23:34:44",
                                  "score": 1,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hv489jp",
              "text": ">This is why the white Christian Nationalists in the U.S never actually banned abortion nation wide even when they had maximum political power under Trump.\n\nUmmm...you do realize that abortion wasn't legalized by Congress and the President, right?  It was legal nationwide because of Supreme Court rulings.  And the SC justices appointed by Trump are very much on the verge of reversing those rulings.",
              "timestamp": "2022-02-01 10:38:17",
              "score": 1,
              "num_children": 0,
              "author": 234239,
              "replies": []
            }
          ]
        },
        {
          "id": "hv1ayke",
          "text": "That's what happened in Romania. Nicolae Ceaușescu banned abortion and 22 years later when the first generation of kids born as a result of his decision grew up rioters took to the streets and ended his dictatorship with an any% speedrun trial and execution.",
          "timestamp": "2022-01-31 19:54:53",
          "score": 16,
          "num_children": 0,
          "author": 106867,
          "replies": []
        },
        {
          "id": "hv0uwbi",
          "text": "The abortion referendum and Gay Marriage referendum had solid majorities across large sections of the society. A majority of older voters in fact voted to removed the 8th ammendment in 2018. \n\nIreland has gone through a through social change and there's been socially cohesive change across the board. It's unlike the US where there are these battleground issues where one section of society outvoted/outspent etc",
          "timestamp": "2022-01-31 18:15:40",
          "score": 17,
          "num_children": 0,
          "author": 276109,
          "replies": []
        },
        {
          "id": "hv0mqwl",
          "text": "Iran has kinda the same situation but without a fair voting system...",
          "timestamp": "2022-01-31 17:25:48",
          "score": 8,
          "num_children": 1,
          "author": 94876,
          "replies": [
            {
              "id": "hv0siun",
              "text": "Unfortunately, the US is headed toward a theocracy much like Iran.\n\nEdit: This would be my worst nightmare. I sincerely hope it never happens.",
              "timestamp": "2022-01-31 18:01:01",
              "score": 14,
              "num_children": 1,
              "author": 12906,
              "replies": [
                {
                  "id": "hv216b6",
                  "text": "Money rules in the USA, not god. You live under a rock?",
                  "timestamp": "2022-01-31 22:42:01",
                  "score": -1,
                  "num_children": 1,
                  "author": 140839,
                  "replies": [
                    {
                      "id": "hv3xpcb",
                      "text": "As an atheist, I don’t believe in God. So I would never suggest that an imaginary entity could rule anything. \n\nEvangelicals on the other hand, are a huge voting block and have been active in trying to take over the US government for decades. They have infiltrated all levels of government including the Supreme Court. They don’t hide the fact that their goal is to turn the US into a theocracy. \n\nBy “money rules” I assume you are talking about billionaires. I doubt that many of them would stand in the way of a right wing theocracy since they would stand to benefit financially.",
                      "timestamp": "2022-02-01 08:17:42",
                      "score": 3,
                      "num_children": 0,
                      "author": 12906,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hv0hn72",
          "text": "Thank goodness.",
          "timestamp": "2022-01-31 16:54:33",
          "score": 3,
          "num_children": 0,
          "author": 289785,
          "replies": []
        },
        {
          "id": "hv3yxu4",
          "text": "I hope the same will happen to Poland.",
          "timestamp": "2022-02-01 08:33:47",
          "score": 2,
          "num_children": 0,
          "author": 220247,
          "replies": []
        },
        {
          "id": "hv16bqw",
          "text": "The older generation has Stockholm syndrome. \nThe intergenerational trauma caused is beyond comprehension. I feel like my generation got a chance to tackle it, but my parents are still nuzzled into \"the nuns ran the schools and hospitals better, at least they were clean\". They were humiliated and beaten on the regular until they had to leave at thirteen to support their families. I don't even know where to start with what's wrong with all of us. \n\nMy great granny had her child out of \"wedlock\" and the child was put in a orphanage; she was put in a laudry (forced labour). Theirs is at least is story where they met later in life. The GG never did have anymore children and died in the workhouse on her third bout of TB as an old women.\n \nFuck the fucking church who took over where the Crown left off.",
          "timestamp": "2022-01-31 19:26:01",
          "score": 1,
          "num_children": 0,
          "author": 75457,
          "replies": []
        },
        {
          "id": "hv1f2kp",
          "text": "I’m hoping the US follows suite. \n\nWe are two steps away from losing abortion in the Supreme Court. It’s about to be abundantly clear to an entire generation of Americans that the separation of Church and State is worth fighting for.",
          "timestamp": "2022-01-31 20:20:39",
          "score": 1,
          "num_children": 0,
          "author": 13459,
          "replies": []
        },
        {
          "id": "hv1qr9u",
          "text": "So maybe we should \"let\" the extremist minority weirdo right ban abortion in America, if they're so eager to hang themselves by their own rope.",
          "timestamp": "2022-01-31 21:34:08",
          "score": 1,
          "num_children": 1,
          "author": 69892,
          "replies": [
            {
              "id": "hv1sepj",
              "text": "...nah...",
              "timestamp": "2022-01-31 21:44:41",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hv45vje",
          "text": "Can you imagine the horrors that would befall that generation if the church were back in it's full power? Absolute bloodbath. Religion poisions *absolutely everything it touches*.",
          "timestamp": "2022-02-01 10:07:00",
          "score": 1,
          "num_children": 0,
          "author": 243035,
          "replies": []
        }
      ]
    },
    {
      "id": "huzv8o3",
      "text": "I'm so jealous for you guys. Poland seems to be going in the opposite direction and it makes my cry sometimes.",
      "timestamp": "2022-01-31 14:24:55",
      "score": 387,
      "num_children": 8,
      "author": 75752,
      "replies": [
        {
          "id": "huzwv2z",
          "text": "Oh, like the US. I feel your pain.",
          "timestamp": "2022-01-31 14:36:53",
          "score": 175,
          "num_children": 2,
          "author": 40941,
          "replies": [
            {
              "id": "hv0gvtl",
              "text": "In the US it very much seems like the last desperate actions of a dying ideology. Younger folks are more and more progressive, and even by overall percentage this country is still solidly pro-choice. There is a reason Republicans are doing everything in their power to disenfranchise voters and gerrymander districts and it's because they can't win otherwise. Fortunately for the rest of us the best they can do is delay the inevitable.",
              "timestamp": "2022-01-31 16:49:49",
              "score": 140,
              "num_children": 2,
              "replies": [
                {
                  "id": "hv0t0s8",
                  "text": "If the US went to a popular vote system it'd be one of the most progressive nations in an election cycle.",
                  "timestamp": "2022-01-31 18:04:07",
                  "score": 77,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hv0yfvd",
                      "text": "Voting democrat isn't voting progressive. Biden hasn't done shit so far but same old same old neoliberal bull.\n\nProgressive candidates like Sanders and AOC are not as popular as reddit would have you believe. They aren't likely to win anything major without a massive change in the country's politics",
                      "timestamp": "2022-01-31 18:37:19",
                      "score": 43,
                      "num_children": 5,
                      "author": 51594,
                      "replies": [
                        {
                          "id": "hv2mplh",
                          "text": ">Progressive candidates like Sanders and AOC are not as popular as reddit would have you believe. They aren't likely to win anything major without a massive change in the country's politics\n\n\nI think what you mean to say is progressive candidates aren't as popular among the ruling elite as you would think. Or wouldn't think. Idk. \n\nUS politics is [run by a small select](https://www.bbc.com/news/blogs-echochambers-27074746) few of very powerful mem and women.\n\ndon't conflate who wins presidency, who sits in congress, who sits in scotus, or who sits in local government as popular opinion. That is definitely not how American politics works.\n\n*Smacks american politics - this baby can fit so much corruption in it",
                          "timestamp": "2022-02-01 01:18:00",
                          "score": 20,
                          "num_children": 0,
                          "author": 184835,
                          "replies": []
                        },
                        {
                          "id": "hv15ank",
                          "text": "It could go the way of making republicans extinct due to unpopularity that the new choice is classic democrat and actual progressives becomes a feasible choice to make since we no longer have to keep literal traitors in check at all times.",
                          "timestamp": "2022-01-31 19:19:31",
                          "score": 14,
                          "num_children": 1,
                          "author": 289265,
                          "replies": [
                            {
                              "id": "hv1cuag",
                              "text": "Sure thing buddy.",
                              "timestamp": "2022-01-31 20:06:37",
                              "score": 1,
                              "num_children": 0,
                              "author": 51594,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "iczmu00",
                          "text": "I agree Biden is the most Conservative person on the planet he is the establishment of America. He hasn't had a real job in 50 years what the hell does he know about the real world?",
                          "timestamp": "2022-06-19 21:36:12",
                          "score": 2,
                          "num_children": 0,
                          "author": 93349,
                          "replies": []
                        },
                        {
                          "id": "hv1h9fm",
                          "text": "I mean even if biden tried to do smth hed be blocked by the basically 50/50 split in congress",
                          "timestamp": "2022-01-31 20:34:28",
                          "score": 2,
                          "num_children": 1,
                          "author": 374384,
                          "replies": [
                            {
                              "id": "hv201rv",
                              "text": "Sure didn't stop congress from trying to pass a bipartisan bill that would limit nurse wages. \n\nCongress is not as 50/50 split as they or the media want you to believe. They're just out to protect their money first and foremost",
                              "timestamp": "2022-01-31 22:34:32",
                              "score": 4,
                              "num_children": 1,
                              "author": 51594,
                              "replies": [
                                {
                                  "id": "hv2l8zu",
                                  "text": "When i say 50/50 split i mean by party lines rather than by belief. Most members of congress are absolutely trying to protect their money but when it comes to hot-button topics (most of what biden promised during his campaign) they will generally vote alongside their voterbase as losing their position is much worse for them in the long term, regardless of what would benefit them in the short term. Most people dont care enough to even know or care about the bill you mentioned, which allowed the congresspeople to vote for what benefits them rather than the people",
                                  "timestamp": "2022-02-01 01:07:17",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 374384,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hv3rhv4",
                          "text": "Sanders is literally the most popular US senator",
                          "timestamp": "2022-02-01 07:01:45",
                          "score": 1,
                          "num_children": 0,
                          "author": 60678,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hv0xe32",
                  "text": "I'm really interested in this, any chance you would have a link with some statistics or something showing how things are changing? If not no worries",
                  "timestamp": "2022-01-31 18:30:54",
                  "score": 5,
                  "num_children": 0,
                  "author": 231444,
                  "replies": []
                }
              ]
            },
            {
              "id": "hv0oz0i",
              "text": "When was the last time you drove by a church? These institutions are crumbling.",
              "timestamp": "2022-01-31 17:39:21",
              "score": 9,
              "num_children": 2,
              "author": 363193,
              "replies": [
                {
                  "id": "hv1pztm",
                  "text": "???? Where are you that you don’t constantly drive by churches? I’m in a relatively non-religious state and still am surrounded by them",
                  "timestamp": "2022-01-31 21:29:14",
                  "score": 4,
                  "num_children": 1,
                  "author": 211850,
                  "replies": [
                    {
                      "id": "hv1qouk",
                      "text": "Oh there are a ton of churches by me, and they are all empty. Like no one goes anymore, [here](https://news.gallup.com/poll/341963/church-membership-falls-below-majority-first-time.aspx) is a gallop poll showing the decline.",
                      "timestamp": "2022-01-31 21:33:42",
                      "score": 2,
                      "num_children": 0,
                      "author": 363193,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hv6ehgb",
                  "text": "Megachurches are picking up the slack.",
                  "timestamp": "2022-02-01 20:07:28",
                  "score": 1,
                  "num_children": 1,
                  "author": 40941,
                  "replies": [
                    {
                      "id": "hv6fdho",
                      "text": "Average church attendance is [going down](https://news.gallup.com/poll/341963/church-membership-falls-below-majority-first-time.aspx). They aren't.",
                      "timestamp": "2022-02-01 20:13:06",
                      "score": 1,
                      "num_children": 1,
                      "author": 363193,
                      "replies": [
                        {
                          "id": "hv6ktct",
                          "text": "I see this a lot, but I'm not so sure. We've got several long-time employees who are choosing to quit rather than comply with vaccine mandates, for example. Lots of churches in my neighborhood, and nearly all my family remains religious. \n\nBut I hope you're right!",
                          "timestamp": "2022-02-01 20:46:51",
                          "score": 1,
                          "num_children": 0,
                          "author": 40941,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hv00svs",
          "text": "Because religion is a very useful political tool, especially for the proto-fascists that keep popping up.",
          "timestamp": "2022-01-31 15:04:56",
          "score": 39,
          "num_children": 0,
          "author": 81958,
          "replies": []
        },
        {
          "id": "hv0zvi5",
          "text": "Yeah, Poland is still very religious, but it seems to be secularizing pretty fast. Especially since COVID and protests regarding abortion, they seemed to hit church quite a bit.\nIt also depends if you live in big city or in the country.",
          "timestamp": "2022-01-31 18:46:06",
          "score": 12,
          "num_children": 1,
          "author": 309183,
          "replies": [
            {
              "id": "hvr12wv",
              "text": "Classically, as Poland always is, it is devided into two oposing secotors, unfortunatelly in this case the government being for stuff like banning abortion and basically ignoring the protests, but this whole controversy could be just a way of distracting the public from all the tax shenanigans going on",
              "timestamp": "2022-02-05 22:46:04",
              "score": 1,
              "num_children": 0,
              "author": 172143,
              "replies": []
            }
          ]
        },
        {
          "id": "hv095b1",
          "text": "As an American who recently visited Poland, yep.",
          "timestamp": "2022-01-31 16:00:40",
          "score": 8,
          "num_children": 0,
          "author": 28106,
          "replies": []
        },
        {
          "id": "hv16op7",
          "text": "Just move to Ireland. \n\nWe have loads of Polish people already. \n\nI love going to the Polish shop and buying 5 different types of sausage.\n\nKabanos for everyone!",
          "timestamp": "2022-01-31 19:28:19",
          "score": 7,
          "num_children": 1,
          "author": 136449,
          "replies": [
            {
              "id": "hv1by1w",
              "text": "Moved to Switzerland. We don't really have Polish shops here, not like in Ireland or the UK :(",
              "timestamp": "2022-01-31 20:01:03",
              "score": 2,
              "num_children": 1,
              "author": 75752,
              "replies": [
                {
                  "id": "hv49mb2",
                  "text": "how is it?",
                  "timestamp": "2022-02-01 10:55:36",
                  "score": 1,
                  "num_children": 1,
                  "author": 36527,
                  "replies": [
                    {
                      "id": "hv4a424",
                      "text": "Not enough poles i guess. There is an eastern European shop in Zürich that carries some Polish products, but most of offer is from Balkans and Russia. I went to a polish shop once in Dublin and it felt like I'm in Żabka :)",
                      "timestamp": "2022-02-01 11:01:45",
                      "score": 1,
                      "num_children": 0,
                      "author": 75752,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hv3k8wy",
          "text": "For a party that politicizes and exploits national tragedies including Smolensk, it is no surprise. Send Kazynski to the gallows!",
          "timestamp": "2022-02-01 05:43:33",
          "score": 4,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hv16n5o",
          "text": "Man Poland have had it hard for so long now. I really hope the younger generation rebels. The cycle needs to be broken so you can get some sensible and secular democracy. \n\nTake care and stay safe!",
          "timestamp": "2022-01-31 19:28:02",
          "score": 3,
          "num_children": 1,
          "author": 242458,
          "replies": [
            {
              "id": "hv1c4bf",
              "text": "My whole hope is in the new generation. They're already much more impervious to the catholic bullshit and i hope this trend will go on.",
              "timestamp": "2022-01-31 20:02:08",
              "score": 2,
              "num_children": 1,
              "author": 75752,
              "replies": [
                {
                  "id": "hv3z6ah",
                  "text": "Unfortunately, there are also a lot of young people that vote for Konfederacja (even worse than PIS).",
                  "timestamp": "2022-02-01 08:36:48",
                  "score": 1,
                  "num_children": 1,
                  "author": 220247,
                  "replies": [
                    {
                      "id": "hv40d06",
                      "text": "I used to be one of them in high school (although it wasn't konfederacja yet, another kind of korwinism). Many of us did, and we grew out of that. Mistakes are a part of growing up.",
                      "timestamp": "2022-02-01 08:52:37",
                      "score": 2,
                      "num_children": 0,
                      "author": 75752,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hv4ft5y",
          "text": "It's just temporary because they feel pressured. The religious are kicking and screaming as they're dying out.",
          "timestamp": "2022-02-01 12:07:46",
          "score": 1,
          "num_children": 0,
          "author": 143492,
          "replies": []
        }
      ]
    },
    {
      "id": "huzuslo",
      "text": "\"Allowing children to leave the classroom during religion class\" is a good way for kids to be marked as \"different\" unless they're the majority of kids.  Religious indoctrination simply needs to be removed from schools.  Ireland should make establishing secular schools a priority.",
      "timestamp": "2022-01-31 14:21:35",
      "score": 453,
      "num_children": 9,
      "replies": [
        {
          "id": "huzzk1b",
          "text": "Absolutely correct. We do have (I'm Irish) what are called \"Educate together\" schools, which are wonderful interfaith schools, but there are very few of them. The Catholic church control most of the public schools, and in many cases the educate together schools have to bargain and deal with the church to use church owned facilities.\n\nIn one case, parents of children going to an educate together school were told their students wouldn't be able to start the term at the school because the catholic church decided that they need the space the educate together school was using, so they didn't have the room for all of the students they had planned to enroll.\n\nNot only that, but when I was in school, I was regularly told that \"If you didn't want a catholic education, you shouldn't have come to a catholic school\". Which is bullshit, since the only options I had *were* catholic schools (I didn't get a place in the educate together school).",
          "timestamp": "2022-01-31 14:56:13",
          "score": 127,
          "num_children": 9,
          "author": 226173,
          "replies": [
            {
              "id": "hv01a4t",
              "text": ">he Catholic church control most of the public schools,\n\nYikes...",
              "timestamp": "2022-01-31 15:08:13",
              "score": 52,
              "num_children": 2,
              "replies": [
                {
                  "id": "hv06l76",
                  "text": "Oh yeah, it's normal here, even today...",
                  "timestamp": "2022-01-31 15:43:45",
                  "score": 17,
                  "num_children": 1,
                  "author": 226173,
                  "replies": [
                    {
                      "id": "hv0qhjh",
                      "text": "Is homeschooling an option in Ireland? I've been eyeing moving there with my two young kids but no way they are going to a Catholic school. Try as you might, I'll never believe dinosaur and human coexisted.",
                      "timestamp": "2022-01-31 17:48:37",
                      "score": 1,
                      "num_children": 8,
                      "author": 159143,
                      "replies": [
                        {
                          "id": "hv0ushu",
                          "text": "I can only speak for myself but I'm 29 and went to a \"Catholic\" school here but we were never taught anything regressive like that. Now, we did take a lot of time out of our normal study to practice and prepare for our first Communion and Confirmation but aside from that, it was a standard, decent education. And that was back in the 90's. I can only assume any religious aspect has been scaled back since then.",
                          "timestamp": "2022-01-31 18:15:00",
                          "score": 13,
                          "num_children": 1,
                          "author": 345689,
                          "replies": [
                            {
                              "id": "hv10v17",
                              "text": "Texas has been known for that shit but that's Texas.",
                              "timestamp": "2022-01-31 18:52:07",
                              "score": 3,
                              "num_children": 0,
                              "author": 159143,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hv14arn",
                          "text": "I'm 37, i went to a catholic school. My daughter is going to an educate together and my son will start there in a few years. I'm glad we have the option, as other people have said these schools are few and far between but growing in popularity. I had a friend who was a jehovas witness, well his parents were, he wouldnt be religous at all. He just didnt attend the religous stuff and school, which really isnt much anyway. During religous class he could get a head start on his homework and wasnt singled out by anyone for being \"different\".",
                          "timestamp": "2022-01-31 19:13:19",
                          "score": 7,
                          "num_children": 1,
                          "author": 76694,
                          "replies": [
                            {
                              "id": "hv150hm",
                              "text": "Ah, well that's good to hear. On another church related item, did anything ever come about that story about that church location they found with numerous dead babies? I can't fully remember it but something about taking babies from young single mothers.",
                              "timestamp": "2022-01-31 19:17:45",
                              "score": 2,
                              "num_children": 1,
                              "author": 159143,
                              "replies": [
                                {
                                  "id": "hv2cird",
                                  "text": "That was in Tuam in co.Galway. The scandal in the wake of that helped push so many people away from the church. Nothing much happened with it in regards to prosecutions etc. Most of the people involved are long gone.",
                                  "timestamp": "2022-02-01 00:00:38",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 76694,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hv174y0",
                          "text": "Er, Catholics don’t believe dinosaurs and humans coexisted. They believe in evolution and the Big Bang and have for decades. (Atheist, former Catholic speaking. Now, they don’t want you trying to peek _before_ the Big Bang, and they believe human evolution was divinely inspired.)",
                          "timestamp": "2022-01-31 19:31:06",
                          "score": 5,
                          "num_children": 1,
                          "author": 376590,
                          "replies": [
                            {
                              "id": "hv17eyc",
                              "text": "Some maybe but there is sure some craziness here in the US, especially Texas, that claim that.",
                              "timestamp": "2022-01-31 19:32:52",
                              "score": 0,
                              "num_children": 0,
                              "author": 159143,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hv15iug",
                          "text": "Homeschooling is a thing here but not common at all. I've lived here for 23 years and only met one person who was ever homeschooled here. To my knowledge there is a process that must be followed to be granted permission for homeschooling.\n\nThe person I know who was homeschooled did a PLC when they were meant to be in 6th year. They then used those points to get into university so they managed to avoid the leaving certificate all together.\n\nThroughout my schooling years I moved around Ireland a lot and attended many schools (all of which were Catholic, primary & secondary). These schools aren't awful but they definitely have religious practices and classes that have no place in schools (especially for young children).\n\nPersonally I'd guess that the limited social interaction of homeschooling would be more damaging than the Catholic practices that your children will endure, should they attend a Catholic school. Even when I was in school the children didn't take religion seriously and most are smart enough to not fall for it (when I was in secondary school I'd assume about 5% of my year were religious, and maybe only 2% seriously).\n\nEither way, best of luck to you and your family!",
                          "timestamp": "2022-01-31 19:20:56",
                          "score": 3,
                          "num_children": 1,
                          "author": 323295,
                          "replies": [
                            {
                              "id": "hv1703a",
                              "text": "Well the only thing stopping me currently is the $17k+ fee to get my dogs into the country. I have plenty of education and experience for the visa program and all that jazz. Had a few interviews that went well. But dang the dog fee and the fact that the visa isn't 100% guaranteed to renew at 5 years. Lot of money to drop then turn around in 5 years to do it again.",
                              "timestamp": "2022-01-31 19:30:16",
                              "score": 2,
                              "num_children": 1,
                              "author": 159143,
                              "replies": [
                                {
                                  "id": "hv18wvf",
                                  "text": "Wow, I had no idea moving with dogs was so expensive. Is the visa renewal dependent upon your employer?",
                                  "timestamp": "2022-01-31 19:42:14",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 323295,
                                  "replies": [
                                    {
                                      "id": "hv19o1b",
                                      "text": "Yeah, it's for 5 years then ether your current employer has to renew your contract or your given something like 6 months to find a new company to sponsor you. Then I think at 10 years you can start to apply for citizenship. The dog thing is because they have to be flown by a registered carrier. Plus I have 3 so it's expensive. They'll be gone in 10 or less, my kids in college in 12, so I don't have too far until a lot of restrictions get removed.",
                                      "timestamp": "2022-01-31 19:46:55",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 159143,
                                      "replies": [
                                        {
                                          "id": "hv2bmz3",
                                          "text": "Interesting",
                                          "timestamp": "2022-01-31 23:54:21",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hv0vbu5",
                          "text": "Homeschooling is not a thing in Ireland. You have to send your kids to school. But even though most schools are Catholic they teach the majority of stuff without the influence of religion. \n\nEven then there are still a decent amount of not religious schools around.",
                          "timestamp": "2022-01-31 18:18:19",
                          "score": 5,
                          "num_children": 1,
                          "author": 338872,
                          "replies": [
                            {
                              "id": "hv17boc",
                              "text": ">Homeschooling is not a thing in Ireland.\n\nThat is not true. You absolutely can. I know people who have.\n\n*\"You have a constitutional right to educate your children at home. If you choose to home-school your child, you do not need a formal teaching qualification. You do not need to follow the national curriculum but you must ensure that your child receives a certain minimum education.\"*\n\nSource: [https://www.citizensinformation.ie/en/education/the\\_irish\\_education\\_system/home\\_education.html](https://www.citizensinformation.ie/en/education/the_irish_education_system/home_education.html)",
                              "timestamp": "2022-01-31 19:32:17",
                              "score": 3,
                              "num_children": 1,
                              "author": 305380,
                              "replies": [
                                {
                                  "id": "hv18noj",
                                  "text": "It's possible if you have a formal teaching qualification which the majority of people don't. It's definitely possible but not something most people can do.",
                                  "timestamp": "2022-01-31 19:40:37",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 338872,
                                  "replies": [
                                    {
                                      "id": "hv19zuy",
                                      "text": "Did you read that quote? *\"If you choose to home-school your child,* ***you do not need a formal teaching qualification***.\"",
                                      "timestamp": "2022-01-31 19:48:57",
                                      "score": 4,
                                      "num_children": 1,
                                      "author": 305380,
                                      "replies": [
                                        {
                                          "id": "hv1lr4q",
                                          "text": "Wow I'm fucking blind. I literally read it twice and missed it.",
                                          "timestamp": "2022-01-31 21:02:28",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 338872,
                                          "replies": [
                                            {
                                              "id": "hv22nzz",
                                              "text": "It's the Irish educational system. I blame the church!",
                                              "timestamp": "2022-01-31 22:51:59",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 305380,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hv0xo2b",
                          "text": "I believe it's legal, but they don't like it. They try very hard to discourage it. I don't know a lot about it, but you're not likely to have a huge amount of support if you decide to go that route.",
                          "timestamp": "2022-01-31 18:32:38",
                          "score": 1,
                          "num_children": 0,
                          "author": 226173,
                          "replies": []
                        },
                        {
                          "id": "hv16mkx",
                          "text": "Yes. I live in Ireland and have a good friend who homeschooled their kids K-12. (Don't worry, they are not crazies: the kids learned evolution etc, went to TCD and such.) Anyway, if you have questions and want to be put in touch with someone who knows the score, send me a private message.\n\nAlso, I'm Jewish and have kids in school here. Can tell you about the options, but with a very small amount of effort you can find a good school which is either not Catholic, or Catholic in name only but not really. Like the German School, Saint Killians.",
                          "timestamp": "2022-01-31 19:27:56",
                          "score": 1,
                          "num_children": 0,
                          "author": 305380,
                          "replies": []
                        },
                        {
                          "id": "hvr25lg",
                          "text": "It's not like it is something terrible that ruins the entire education.\n\nA child can sit throught 1-2 more lessons a weak, it's nothing hard, and i believe you can sign them out",
                          "timestamp": "2022-02-05 22:53:58",
                          "score": 1,
                          "num_children": 1,
                          "author": 172143,
                          "replies": [
                            {
                              "id": "hvrh3ow",
                              "text": "I guess, coming from the US, it utterly scared me. Yes, I know, not all religious people are nut like in the bible belt of the US. But anyways, by the time I can actually move over the pond my kids will be graduated probably.",
                              "timestamp": "2022-02-06 00:47:14",
                              "score": 1,
                              "num_children": 0,
                              "author": 159143,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hv2c81n",
                  "text": "This is the No Child's Behind Left policy...",
                  "timestamp": "2022-01-31 23:58:32",
                  "score": 1,
                  "num_children": 0,
                  "author": 333968,
                  "replies": []
                }
              ]
            },
            {
              "id": "hv0d72i",
              "text": "We used to have a similar issue in the Netherlands. Went to a Christian school with a Jewish name and half the students were muslim. They had no other options in the area. Gosh and I hated ‘religious class’ so much. They were meant to teach us about religion around the world. I learned *nothing*. All they did was talk about the bible. And my muslim classmates had to accept it. Yuck! Thankfully it’s way less now.",
              "timestamp": "2022-01-31 16:26:44",
              "score": 18,
              "num_children": 1,
              "author": 207635,
              "replies": [
                {
                  "id": "hv0p4bh",
                  "text": "Exactly, this is why I am so skeptical of \"world religion\" class, it is very rarely actually about \"world religions\".",
                  "timestamp": "2022-01-31 17:40:16",
                  "score": 11,
                  "num_children": 1,
                  "author": 226173,
                  "replies": [
                    {
                      "id": "hv1cpgs",
                      "text": "A good way to avoid problems is by banning priests from teaching most of these classes. One or another lecture is fine but the main teacher of this classes should be a religious scholar not a priest.",
                      "timestamp": "2022-01-31 20:05:48",
                      "score": 8,
                      "num_children": 1,
                      "author": 228385,
                      "replies": [
                        {
                          "id": "hv21ugf",
                          "text": "They've basically done that here. Even when I was in school, there were no priests who were teachers, or working in the school, but the school was owned by the church and had a catholic ethos.",
                          "timestamp": "2022-01-31 22:46:30",
                          "score": 5,
                          "num_children": 1,
                          "author": 226173,
                          "replies": [
                            {
                              "id": "hv2wz92",
                              "text": "Oh crap",
                              "timestamp": "2022-02-01 02:32:37",
                              "score": 2,
                              "num_children": 0,
                              "author": 228385,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hv0h0lt",
              "text": "Even then there's no option for a zero religion education.",
              "timestamp": "2022-01-31 16:50:37",
              "score": 7,
              "num_children": 0,
              "author": 140514,
              "replies": []
            },
            {
              "id": "hv0sp5y",
              "text": "One of the things I like about being from the North. To say we have are fair share of religious issues would be an understatement but at least integrated schools were kind of forced through with the cease fire.\n\nI distinctly remember in school there were 6 of us that had exemptions from any religious assembly attendance or RE class and it was allowed and protected by law.",
              "timestamp": "2022-01-31 18:02:07",
              "score": 4,
              "num_children": 1,
              "author": 225642,
              "replies": [
                {
                  "id": "hv0xtwi",
                  "text": "That sounds like a good idea, but yeah, I'm sure they are afraid of the consequences if they force religion on people in the north!",
                  "timestamp": "2022-01-31 18:33:37",
                  "score": 3,
                  "num_children": 0,
                  "author": 226173,
                  "replies": []
                }
              ]
            },
            {
              "id": "hv16lm0",
              "text": "I remember the first ET schools. They were in prefabs and constantly had to engage in utter nonsense with the church.",
              "timestamp": "2022-01-31 19:27:46",
              "score": 3,
              "num_children": 1,
              "author": 75457,
              "replies": [
                {
                  "id": "hv17ev2",
                  "text": "Yes, I remember the prefabs! Never went to one, but I saw them. I'd rather be in a prefab in an ET school than in a catholic school though.",
                  "timestamp": "2022-01-31 19:32:51",
                  "score": 3,
                  "num_children": 0,
                  "author": 226173,
                  "replies": []
                }
              ]
            },
            {
              "id": "hv10pqu",
              "text": "> but there are very few of them.\n\nThe one I tried to enroll in, we were too late, I would have had to put names down at birth. It was 300% oversubscribed 2 years before the start date.",
              "timestamp": "2022-01-31 18:51:14",
              "score": 1,
              "num_children": 1,
              "author": 161728,
              "replies": [
                {
                  "id": "hv17j0q",
                  "text": "Wow, is it that bad? When was that, recently? I've been out of school a long time now, so I was hoping things had gotten a bit better.",
                  "timestamp": "2022-01-31 19:33:35",
                  "score": 1,
                  "num_children": 1,
                  "author": 226173,
                  "replies": [
                    {
                      "id": "hv1dq9o",
                      "text": "It's kinda gotten better. All schools now have a common, more sane onboarding scheme that starts a year before enrollment, that goes some way to stop people signing up to every school in every area.",
                      "timestamp": "2022-01-31 20:12:13",
                      "score": 1,
                      "num_children": 1,
                      "author": 161728,
                      "replies": [
                        {
                          "id": "hv2bhdz",
                          "text": "That's good, at least!",
                          "timestamp": "2022-01-31 23:53:16",
                          "score": 1,
                          "num_children": 0,
                          "author": 226173,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hv15rwc",
              "text": "Sounds like the right trajectory and you are winning ground. Do not let it stop, kick that church out into the ocean. Go 🇮🇪!",
              "timestamp": "2022-01-31 19:22:30",
              "score": 1,
              "num_children": 1,
              "author": 242458,
              "replies": [
                {
                  "id": "hv186mu",
                  "text": "Absolute, I think we're heading that way!",
                  "timestamp": "2022-01-31 19:37:39",
                  "score": 1,
                  "num_children": 0,
                  "author": 226173,
                  "replies": []
                }
              ]
            },
            {
              "id": "hv1k6b3",
              "text": "The government school system here in Canberra Australia is purely secular. The concept of an interfaith school would belong purely in the private school system. My local secular government school had zero religious instruction, religious Xmas carols are not sung at Xmas and religion stays out of everything. If kids want to do religion it’s done outside of school. For this atheist, it’s been wonderful.",
              "timestamp": "2022-01-31 20:52:36",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hv2jqnl",
                  "text": "Yeah! That's the way it should be! But the CC are still holding on to their grip on education here, unfortunately.",
                  "timestamp": "2022-02-01 00:56:09",
                  "score": 1,
                  "num_children": 0,
                  "author": 226173,
                  "replies": []
                }
              ]
            },
            {
              "id": "hv2bhas",
              "text": "I heard that is changing.",
              "timestamp": "2022-01-31 23:53:15",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hv4fqcf",
                  "text": "I certainly hope so, yeah.",
                  "timestamp": "2022-02-01 12:06:54",
                  "score": 1,
                  "num_children": 0,
                  "author": 226173,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hv0atdt",
          "text": "I have an alternative:\n\nSome years back now, my wife went to a German public school (government funded for the general population for people from places where this is termed differently) and the priest would come into the room for religious instruction.  This was bizarre to me (In the US, these schools are supposed to be separate from religious schools).  But she seemed to think this was a normal German thing in the Catholic regions of the country.\n\nWell, after the regular teacher left, there was some time before the priest came into the room. One kid realized if he went into one of the cubbies he wouldn't be missed as the priest wasn't paying attention or taking attendance, and he much preferred relaxing in the dark to religious classes.  Before long, the cubbies were filling.  \n\nEventually the class was half empty (my wife was too afraid to climb into her own).  Someone eventually coughed or cleared their throat, and the priest went to a cubby and discovered a kid in there.  He started opening the others to find the rest of the missing students.  She doesn't remember them getting in trouble, probably because the priest would look foolish confessing such a thing.",
          "timestamp": "2022-01-31 16:11:35",
          "score": 15,
          "num_children": 2,
          "author": 324257,
          "replies": [
            {
              "id": "hv0lchb",
              "text": "The only proper alternative is to do like France: No religion at public schools.  The curriculum includes learning about religions during middle age crusade history lessons, but that's about it.",
              "timestamp": "2022-01-31 17:17:18",
              "score": 13,
              "num_children": 0,
              "author": 195151,
              "replies": []
            },
            {
              "id": "hv0kuna",
              "text": "This made me LOL",
              "timestamp": "2022-01-31 17:14:15",
              "score": 4,
              "num_children": 0,
              "author": 322979,
              "replies": []
            }
          ]
        },
        {
          "id": "huzvb1o",
          "text": "In my AMERICAN Catholic middle school anyone who said they didn’t believe in god was looked at like they had covid in 2020 lol, and when I told the school why it was wrong to make us take religion classes they did not give a FUCK",
          "timestamp": "2022-01-31 14:25:24",
          "score": 49,
          "num_children": 2,
          "replies": [
            {
              "id": "huzxeb3",
              "text": "Were you unaware that you were in a Catholic school? With Catholics?",
              "timestamp": "2022-01-31 14:40:45",
              "score": 42,
              "num_children": 3,
              "author": 120778,
              "replies": [
                {
                  "id": "hv09z51",
                  "text": "Spoiler alert, most parents just put their kids in catholic school regardless of what the kids want, doesn't mean the kids are always religious.",
                  "timestamp": "2022-01-31 16:06:07",
                  "score": 27,
                  "num_children": 3,
                  "author": 361240,
                  "replies": [
                    {
                      "id": "hv0ijm4",
                      "text": "That isn't necessarily because of religion - Catholic schools as a whole are very rigorous academically - and produce graduates with higher academic achievement on average, and they earn more money post graduation.\n\nIn my area, I would definitely send kids to the catholic school over the public school because it correlates to a much higher chance of being successful.  Just tell them not to become catholic.",
                      "timestamp": "2022-01-31 17:00:04",
                      "score": 10,
                      "num_children": 3,
                      "author": 3950,
                      "replies": [
                        {
                          "id": "hv0xcsb",
                          "text": "I don't disagree, though I would go farther and say that the reason these schools are rigorous, and also, why the students are often more successful than average, is because they're often located in high-income areas. And socioeconomic status is one of the biggest indicators of success for kids. As someone who grew up adjacent to these kinds of families, trust me when I say it's almost impossible to fail when your family is bending over backwards to bankroll your success, academically or otherwise.\n\nHell, I lived down the street from a kid who came from a rich family, he had private tutors, lots of extra curriculars, and his family even paid for a private martial arts instructor to come to their house multiple times a week for training instead of going to one of the many dojos around town. Not that any of this is bad, but man, having all this support, it would be nearly impossible to fail.",
                          "timestamp": "2022-01-31 18:30:41",
                          "score": 13,
                          "num_children": 1,
                          "author": 262475,
                          "replies": [
                            {
                              "id": "hv10x43",
                              "text": "That's true, and correlation != causation.  However, I think putting your kids into that peer group also means they are pushed harder to excel, as they need to outcompete other kids that have those support systems to be #1.",
                              "timestamp": "2022-01-31 18:52:28",
                              "score": 2,
                              "num_children": 0,
                              "author": 3950,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hv0ise3",
                          "text": "Oh for sure, just pointing out that just becuase a kid is in catholic school doesn't mean they're catholic, and in my experience there are quite a few kids who fall out of the religion by the time they graduate.",
                          "timestamp": "2022-01-31 17:01:34",
                          "score": 6,
                          "num_children": 0,
                          "author": 361240,
                          "replies": []
                        },
                        {
                          "id": "hv169j5",
                          "text": "You’re not worried about the systematic abuse and financially supporting the oldest and largest pedophile and abuse ring in the world then?",
                          "timestamp": "2022-01-31 19:25:38",
                          "score": 1,
                          "num_children": 0,
                          "author": 242458,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hv0a620",
                      "text": "Great. If I'm in an engineering school I expect to learn about engineering, and to be looked at strangely when I say something like \"jet fuel can't melt steel beams.\"\n\nRead the room, is all I'm saying.\n\nEdit: to those of you who think I'm a 9/11 conspiracy nut, please re-read my comment and consider the context that OP THOUGHT IT WAS ODD THAT HIS LACK OF FAITH WAS CONSIDERED ODD IN A RELIGIOUS SCHOOL.",
                      "timestamp": "2022-01-31 16:07:21",
                      "score": -1,
                      "num_children": 2,
                      "author": 120778,
                      "replies": [
                        {
                          "id": "hv0cg0a",
                          "text": "Ok you really think 9/11 was an inside job",
                          "timestamp": "2022-01-31 16:22:01",
                          "score": -3,
                          "num_children": 0,
                          "author": 78925,
                          "replies": []
                        },
                        {
                          "id": "hv0d94m",
                          "text": "There are so many ways the goverment can and do fuck people up but no, theyre gonna intentionally ram 2 jet planes in the towers. Yeah makes total sense",
                          "timestamp": "2022-01-31 16:27:05",
                          "score": -2,
                          "num_children": 0,
                          "author": 78925,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hv3cttl",
                      "text": "Or that the parents are religious. Sometimes Catholic school is just the most affordable option for a decent education.",
                      "timestamp": "2022-02-01 04:35:24",
                      "score": 1,
                      "num_children": 0,
                      "author": 202982,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "huzxpgv",
                  "text": "Yep I should’ve already saw how me not being listened to at home would’ve been the same at school… now I’m an adult and they can’t hold this independent meat sack down",
                  "timestamp": "2022-01-31 14:42:59",
                  "score": 12,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hv0yssh",
                  "text": "I mean, I didn't know I attended a Catholic primary school until like a decade later.\n\nThere wasn't any praying (just a false rumour that one teacher would make you pray each morning) and no focus on Christianity. There were the religious holidays but those are also celebrated at public schools because they're cultural at this point.",
                  "timestamp": "2022-01-31 18:39:32",
                  "score": 1,
                  "num_children": 1,
                  "author": 206824,
                  "replies": [
                    {
                      "id": "hv10ho8",
                      "text": "> I didn't know I attended a Catholic primary school until like a decade later\n\nI guess I just don't understand how that's even possible. Where I'm from, every catholic school is associated with a parish, they all wear uniforms, nuns/priests teach some (if not all) classes and catechism is very much a required class.",
                      "timestamp": "2022-01-31 18:49:53",
                      "score": 1,
                      "num_children": 0,
                      "author": 120778,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hv0yh4b",
              "text": "I didn't even know that my primary school (in the Netherlands) had been Catholic until a decade later. I know of others that are also pretty much Catholic in name only.\n\nThere were rumours that one teacher would have everyone pray before class, but that turned out to be false.\n\nBesides the holidays (that were more cultural than religious) the only real religious thing was children going to church for an hour once a week for maybe 8 weeks. It was to prepare for the First Communion and in my class about 20% did that including me. I can guarantee that in my class at least nobody really got what it was all about. Nobody actually believed the stories. It didn't help that we had some sort of assignment book that was themed after [Jip and Janneke](https://en.wikipedia.org/wiki/Jip_and_Janneke) who are pretty simple book characters with no religion included at all. Makes me wonder if they even licensed it.\n\nWe were all excited about it though. We were promised gifts! I got more gifts than I got for my birthday. One classmate got an expensive PC! My cousin got an evil pony for his.",
              "timestamp": "2022-01-31 18:37:32",
              "score": 1,
              "num_children": 0,
              "author": 206824,
              "replies": []
            }
          ]
        },
        {
          "id": "hv0iu0o",
          "text": "I think freedom of religion should be removed. It's already covered by freedom of speech and the right to assembly. No reason to give religious people extra freedoms over the rest of us. Especially not in a secular state.",
          "timestamp": "2022-01-31 17:01:51",
          "score": 3,
          "num_children": 1,
          "author": 62469,
          "replies": [
            {
              "id": "hv0vzcs",
              "text": "I agree that religious people should not have any special privileges. However in the US, “freedom of religion” means that the government can’t force anyone into a particular religion. We must never loose the right to free thinking. \n\nFreedom of speech does not do the same thing. If the US government eliminated freedom of religion, they could still mandate the Christian religion on all of us.",
              "timestamp": "2022-01-31 18:22:19",
              "score": 7,
              "num_children": 0,
              "author": 12906,
              "replies": []
            }
          ]
        },
        {
          "id": "hv0eul4",
          "text": "I agree with you but I'm from Quebec Canada and we did exactly this year's ago and it wasn't that bad. 20 years ago when I was young all the school had their Catholic class at the same time and everyone who didn't wanted to participate (was in that group cause not baptised) had a mixed class with all the students from every age with a lesson that was more like philosophy. every years there were more and more students opting out of Catholicism and soon enough they just removed the class because the majority were not taking it.\n\nit's not perfect but as a transition it worked at least here and no kid understand religion enough to bully on that. we were 4/20 opting out of the class only but most kids were jealous of us because most of our classes were watching movies and discussing morality / debating about some specific things in the movie while they were reading the bible. or maybe the teachers did a good job making them understand that not everyone believe in God but most bullying were about clothing not leaving during the religious class.",
          "timestamp": "2022-01-31 16:37:09",
          "score": 5,
          "num_children": 0,
          "author": 277096,
          "replies": []
        },
        {
          "id": "hv1sc50",
          "text": "This is a lot harder to achieve than you think it is. Belief in catholism has definitely and drastically declined but catholism as a culture hasn't. Things like communion and confirmation aren't really about devoting yourself to your faith so much as a rite of passage for young kids in Ireland. It's a big deal here, kids make so much money, get a party, get toys, get to visit their whole extended family. It's as big as a 21st in America in its cultural significance. \n\nAll year in second class and sixth class, they get time off class to practice. They get roles, they learn songs, they go on trips to the church and stop and get McDonald's on the way back. It's a milestone for them. While a lot of people are all for moving away from strict Catholic ideology being the foundation of the country, a lot less people would be supportive of abolishing catholism in primary schools because they want their kids to experience those events, even if the family as a whole aren't religious. \n\nAs for the adults, there's huge parties and meals to celebrate, most parties are held in pubs and they get locked and have a sing song, there's a DJ and music and a dancefloor. The whole family gets in for pictures and afterwards the school will hold a picture day where they wear their special clothes and get a professional portrait done of their child that people pass down for generations. \n\nThe majority of kids in Ireland would be heartbroken if that was to be phased out, a lot of adults would push back on it. I don't see that happening any time soon. It's a huge part of the national identity and culture, that's why it's not even really being considered as a factor",
          "timestamp": "2022-01-31 21:44:13",
          "score": 1,
          "num_children": 0,
          "author": 410088,
          "replies": []
        },
        {
          "id": "hv2i8h4",
          "text": "Yes and no, they already let some kids leave for religion class when I was back in primary school, and  if anything kids just jealous that they got to leave a boring class 😅",
          "timestamp": "2022-02-01 00:44:41",
          "score": 1,
          "num_children": 0,
          "author": 69725,
          "replies": []
        },
        {
          "id": "hvr1j1g",
          "text": "Exactly, this is a personal thing only a parent should be able to teach and any kind of mass teaching of it is obviously an attempts of forcing the government's beieves on the population",
          "timestamp": "2022-02-05 22:49:24",
          "score": 1,
          "num_children": 0,
          "author": 172143,
          "replies": []
        },
        {
          "id": "hv3cliq",
          "text": "Tbh, I'm not sure it's such a bad thing to have government involved in religion. The government is generally pretty incompetent. The US has a free market for religion, which means religions have to compete for followers. In Europe, most countries have a state church of some kind, which does not have to compete and therefore has little incentive to evangelize.",
          "timestamp": "2022-02-01 04:33:27",
          "score": -1,
          "num_children": 0,
          "author": 202982,
          "replies": []
        }
      ]
    },
    {
      "id": "huzsq52",
      "text": "I’m pleasantly amazed at how far Ireland has moved on the religious spectrum over the past couple of decades. Éirinn go Brách.",
      "timestamp": "2022-01-31 14:05:50",
      "score": 227,
      "num_children": 4,
      "author": 315599,
      "replies": [
        {
          "id": "hv0ap2m",
          "text": "Finding several hundred dead kids in a septic tank on church property will do that.",
          "timestamp": "2022-01-31 16:10:47",
          "score": 67,
          "num_children": 2,
          "author": 187338,
          "replies": [
            {
              "id": "hv0zsin",
              "text": "Not in Poland. The government would just blame them gays",
              "timestamp": "2022-01-31 18:45:35",
              "score": 19,
              "num_children": 0,
              "author": 255218,
              "replies": []
            },
            {
              "id": "hv39if1",
              "text": "Both Canada and US don’t bat an eye at mass graves of children.",
              "timestamp": "2022-02-01 04:07:34",
              "score": 5,
              "num_children": 1,
              "author": 413513,
              "replies": [
                {
                  "id": "hv3evcm",
                  "text": "True. Mass grave at an Indian boarding school in my state barely went beyond the local news.",
                  "timestamp": "2022-02-01 04:53:13",
                  "score": 1,
                  "num_children": 0,
                  "author": 187338,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "huzz5pe",
          "text": "Totally agree: ppl will complain naturally, but reversing a whole history will take decades. But it’s one step at a time: divorce was a good start in the 90s. Slowly people stop believing in magic. Many Irish people will tick catholic in the census without actually considering whether or not they believe in magic.",
          "timestamp": "2022-01-31 14:53:23",
          "score": 54,
          "num_children": 1,
          "author": 268777,
          "replies": [
            {
              "id": "hv0h5x4",
              "text": "Condoms were legalized in 1985",
              "timestamp": "2022-01-31 16:51:32",
              "score": 21,
              "num_children": 1,
              "author": 140514,
              "replies": [
                {
                  "id": "hv0iaf1",
                  "text": "You sinner. Don’t bring that up. God is watching.",
                  "timestamp": "2022-01-31 16:58:29",
                  "score": 8,
                  "num_children": 0,
                  "author": 268777,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hv1xnxp",
          "text": "I’m American and studied abroad in Cork in the mid-2000s. I was pretty conservative and religious. \n\nI was quite surprised by how progressive Ireland was and how (largely) irrelevant religion was, at least compared to the US. \n\nThe friends I met there caused me to slowly re-evaluate my politics and eventually religious beliefs— atheist today and fairly progressive.",
          "timestamp": "2022-01-31 22:18:49",
          "score": 5,
          "num_children": 0,
          "author": 266888,
          "replies": []
        },
        {
          "id": "hv32m3j",
          "text": "Ireland is becoming pretty awesome in many respects.",
          "timestamp": "2022-02-01 03:13:49",
          "score": 2,
          "num_children": 1,
          "author": 247771,
          "replies": [
            {
              "id": "hv3cyyw",
              "text": "They're also pushing the envelope of democracy through their experiments with sortition. More countries should replicate the Irish citizens' assemblies.",
              "timestamp": "2022-02-01 04:36:38",
              "score": 1,
              "num_children": 0,
              "author": 202982,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hv04ib9",
      "text": "The headline makes it sounds like this is a quote from the Irish government but it's actually a request from Atheist Ireland to the UN.",
      "timestamp": "2022-01-31 15:30:00",
      "score": 42,
      "num_children": 1,
      "author": 352472,
      "replies": [
        {
          "id": "hv41enx",
          "text": "Very misleading first paragraph of that article for sure.",
          "timestamp": "2022-02-01 09:06:48",
          "score": 1,
          "num_children": 1,
          "author": 248470,
          "replies": [
            {
              "id": "hv41h5y",
              "text": "I think OP made it worse by editorialising the title, maybe worth reporting if that goes against the rules.",
              "timestamp": "2022-02-01 09:07:45",
              "score": 1,
              "num_children": 0,
              "author": 352472,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "huzvkcy",
      "text": "As someone who was educated in Ireland from age 12-25 I applaud this but this is going to be an *up hill battle*. When Ireland founded as a state the government didn't construct an education system because the Church had already built one. 90% of all primary schools and 70% of all secondary schools are owned by the Church (mostly Catholic but some Anglican). And let me reiterate the land and buildings these schools are on are the *property* of these religious institutions. These schools teach their religion as a subject during school hours.  Outside of any urban center most children have no options other than a religious school. Even within any city it is difficult to get into the few secular public schools. As a result most principals in Ireland are either clergy or they answer directly to clergy.    \n\n\nIf anyone has any questions please feel free to ask.",
      "timestamp": "2022-01-31 14:27:20",
      "score": 111,
      "num_children": 10,
      "author": 140514,
      "replies": [
        {
          "id": "huzx3hm",
          "text": "As most European democracies, Ireland has, to my knowledge, the option to take over private property into the public hand, if the interest of the public outweighs the interest of the private owner.\n\nI am reasonably sure they won't do that, at least not for another 2 decades, but they might get there eventually.\n\n\"#nationalizechurchholdings\"",
          "timestamp": "2022-01-31 14:38:34",
          "score": 61,
          "num_children": 5,
          "author": 335275,
          "replies": [
            {
              "id": "hv012to",
              "text": "Eminent domain is the term. They should definitely do it!",
              "timestamp": "2022-01-31 15:06:49",
              "score": 25,
              "num_children": 1,
              "author": 259813,
              "replies": [
                {
                  "id": "hv0ltw1",
                  "text": "If their laws are anything like the US eminent domain laws, which I assume since they’re both rooted in English law, I would think the price would be exorbitant, since the government needs to compensate a land owner at a “fair market rate.” And the sum total of all schools in a region is a lot of land and infrastructure.",
                  "timestamp": "2022-01-31 17:20:15",
                  "score": 10,
                  "num_children": 2,
                  "author": 301429,
                  "replies": [
                    {
                      "id": "hv11ptn",
                      "text": ">since the government needs to compensate a land owner at a “fair market rate.”\n\nIn theory yes, in actuality it's the government that determines what a \"fair market rate\" is. So they will only pay as much as they feel they should.",
                      "timestamp": "2022-01-31 18:57:19",
                      "score": 5,
                      "num_children": 0,
                      "author": 290947,
                      "replies": []
                    },
                    {
                      "id": "hv25hve",
                      "text": "An empty school is nearly worthless. I don’t think there’s much value in these buildings unless zoning is very different in Ireland vs. USA.",
                      "timestamp": "2022-01-31 23:11:12",
                      "score": 1,
                      "num_children": 0,
                      "author": 259813,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hv11euy",
              "text": ">  the option to take over private property into the public hand, if the interest of the public outweighs the interest of the private owner.\n\nThere's also the small matter of the Catholic Church in Ireland owing the government *[hundreds of millions of euro](https://www.thejournal.ie/religious-abuse-compensation-3278789-Mar2017/)* in child abuse reparations. We just need to call that in.",
              "timestamp": "2022-01-31 18:55:28",
              "score": 17,
              "num_children": 2,
              "author": 161728,
              "replies": [
                {
                  "id": "hv2372s",
                  "text": "Catholic and anglican churches in Australia are selling their properties to fund reparations. And some of them are worth quite a bit:\n\n[https://www.abc.net.au/news/2021-12-09/byron-bay-country-churches-for-sale/100685618](https://www.abc.net.au/news/2021-12-09/byron-bay-country-churches-for-sale/100685618)",
                  "timestamp": "2022-01-31 22:55:36",
                  "score": 7,
                  "num_children": 0,
                  "author": 64562,
                  "replies": []
                },
                {
                  "id": "hv12owz",
                  "text": "Ah yes easy to overlook, as always.",
                  "timestamp": "2022-01-31 19:03:16",
                  "score": 2,
                  "num_children": 0,
                  "author": 335275,
                  "replies": []
                }
              ]
            },
            {
              "id": "hv1n5bq",
              "text": "Definitely time for another dissolution of the monistaries.",
              "timestamp": "2022-01-31 21:11:16",
              "score": 3,
              "num_children": 0,
              "author": 260534,
              "replies": []
            },
            {
              "id": "hv0f5vi",
              "text": "I posted this in reply below but I'll repost it to the top response:\n\nI don't disagree with you. However,  Ireland had a very long history of colonial landlords evicting tenants. As a result it is extremely difficult to evict anyone from anything in Irish law. Even if the government tried the religious order have a solid defense in court:\r  \n\"Why do you want to evict this school?\"\r  \n\r  \n\"So we can turn it into a school.\"\r  \n\r  \nIt basically requires new legislation or, more likely, a referendum. It could happen in the years ahead but no one in authority or opposition has suggested that yet.",
              "timestamp": "2022-01-31 16:39:09",
              "score": 5,
              "num_children": 1,
              "author": 140514,
              "replies": [
                {
                  "id": "hv0wo61",
                  "text": "I'm thinking of Montreal, where they have huge old churches being made into things like gyms because so many of them are abandonded, as church attendance went down something extreme like 95% in a short period of time.\n\nJust build new schools over time and let the churches along with all their associated buildings be abandoned organically over time.",
                  "timestamp": "2022-01-31 18:26:30",
                  "score": 1,
                  "num_children": 1,
                  "author": 401593,
                  "replies": [
                    {
                      "id": "hv0x6jv",
                      "text": "Good luck with that happening in Ireland",
                      "timestamp": "2022-01-31 18:29:37",
                      "score": 1,
                      "num_children": 1,
                      "author": 140514,
                      "replies": [
                        {
                          "id": "hv0zsuj",
                          "text": "Why? Isn't this headline evidence of that process happening?\n\nLet the churches keep their schools. If no one enrolls once there are secular choices, who cares?",
                          "timestamp": "2022-01-31 18:45:38",
                          "score": 1,
                          "num_children": 1,
                          "author": 401593,
                          "replies": [
                            {
                              "id": "hv2dh9k",
                              "text": "Where are you going to build them? Who is going to build them? Where is the money to buy the land, building materials and contractors going to come from? \n\nLet's say Ireland decides to build a new school in Ireland to replace every religious school. That would require every tradesman in Ireland for years. Ireland already has a housing crisis from lack of homes being built. People want to have secular schools but they want places to live more.",
                              "timestamp": "2022-02-01 00:07:36",
                              "score": 3,
                              "num_children": 0,
                              "author": 140514,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hv0v4wl",
              "text": "Compulsory purchase orders they're called here. It would be massively expensive unfortunately.",
              "timestamp": "2022-01-31 18:17:08",
              "score": 2,
              "num_children": 1,
              "author": 276109,
              "replies": [
                {
                  "id": "hv12jwg",
                  "text": "Tax the big American companies who evade corporate tax rates in the rest of Europe by having European HCs in Ireland. One tax year with actual business taxes should suffice /s\n\nI didn't say it would be easy ;)",
                  "timestamp": "2022-01-31 19:02:24",
                  "score": 2,
                  "num_children": 0,
                  "author": 335275,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "huzyxk9",
          "text": "I went to an all boys secondary school in Dublin (2004-2009) that used to be run by the Marist Brothers, there was only one brother and he thought geography. I never had to do a religion classes or never felt like I was at a Christian school. I personally don't think the Catholic church had any involvement in my education except for the building. Every exam I did was state level and the people in charge of the school where all employed by the state. I don't know anybody I grew up with that went to other state schools would say they went to Catholic schools.",
          "timestamp": "2022-01-31 14:51:46",
          "score": 11,
          "num_children": 1,
          "author": 91183,
          "replies": [
            {
              "id": "hv0g1x7",
              "text": "Out of curiosity when did you sit the Leaving Cert?   \nThe issue of religion *in* school is a bigger deal in primary schools in Ireland. One of the issues in secondary schools is the Church could decide what *wouldn't* be taught in school. Sex education being a big one.   \n\n\nI went to two secondary schools in Ireland and one of them started every day by making us go to a cold drafty hall and sing hymns. A lot of the teachers would make us pray before class in both schools. We had to go to mass once a month on a Friday. It's honestly great that your education was through a thinner filter of religion, but it is completely arbitrary how much religion is or isn't allowed in Irish schools.",
              "timestamp": "2022-01-31 16:44:42",
              "score": 6,
              "num_children": 1,
              "author": 140514,
              "replies": [
                {
                  "id": "hv0k4d9",
                  "text": "2009 is when I sat my leaving certificate and we where also taught sexual education in primary and secondary school. The only time I ever had to say a prayer was \"our lady\" at the end of everyday in primary school. But my memories from that aren't as reliable as my memories of secondary school.\n\nYeah I didn't realize how bad other schools had it. It was honestly a good school and the administration where good too.",
                  "timestamp": "2022-01-31 17:09:46",
                  "score": 5,
                  "num_children": 1,
                  "author": 91183,
                  "replies": [
                    {
                      "id": "hv0on8b",
                      "text": "It's trending better but it's extremely non-uniform. I did the leaving in 2003. My Sex Ed was not having sex ed, which was an improvement on the previous curriculum of fear and lies.",
                      "timestamp": "2022-01-31 17:37:19",
                      "score": 8,
                      "num_children": 2,
                      "author": 140514,
                      "replies": [
                        {
                          "id": "hv0pwsv",
                          "text": "I think I did my primary school sex Ed in 2003 I was in 6th class I think they thought us because we where heading to secondary school. \n\nI went to an all boys school but there was an all girls school up the road and they use to get let out to the village for lunch at the same time. Teen pregnancy was a problem so the girls school built a massive gymnasium and a canteen to keep them inside and the rate dropped. Then we all had to do sex Ed after that.",
                          "timestamp": "2022-01-31 17:45:08",
                          "score": 3,
                          "num_children": 0,
                          "author": 91183,
                          "replies": []
                        },
                        {
                          "id": "hv0vron",
                          "text": "I did my leaving cert in 1999 and we had sex-ed classes",
                          "timestamp": "2022-01-31 18:21:01",
                          "score": 1,
                          "num_children": 1,
                          "author": 27760,
                          "replies": [
                            {
                              "id": "hv0x3en",
                              "text": "Yup, massive inconsistencies across Ireland",
                              "timestamp": "2022-01-31 18:29:05",
                              "score": 3,
                              "num_children": 1,
                              "author": 140514,
                              "replies": [
                                {
                                  "id": "hv11bz5",
                                  "text": "It was a community school established by two religious orders and a local vocational committee\n\nNot secular by any means, probably typical of schools in the greater Dublin area at the time",
                                  "timestamp": "2022-01-31 18:54:59",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 27760,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "huzwz7m",
          "text": "Fun fact: The church is the largest landowner in the world.",
          "timestamp": "2022-01-31 14:37:43",
          "score": 8,
          "num_children": 1,
          "author": 40941,
          "replies": [
            {
              "id": "huzzr3z",
              "text": "Its most definitely the Queen of England.",
              "timestamp": "2022-01-31 14:57:37",
              "score": 0,
              "num_children": 2,
              "author": 91183,
              "replies": [
                {
                  "id": "hv0glx7",
                  "text": "I wanted to disagree with you but I looked it up and the largest estimate for the RC Church I could find was 177 million acres. For QEII it was 6.6 *billion*.",
                  "timestamp": "2022-01-31 16:48:07",
                  "score": 9,
                  "num_children": 1,
                  "author": 140514,
                  "replies": [
                    {
                      "id": "hv0iux8",
                      "text": "Yeah it's because she technically owns Australia, Canada, and other commonwealth countries.",
                      "timestamp": "2022-01-31 17:02:00",
                      "score": 4,
                      "num_children": 2,
                      "author": 91183,
                      "replies": [
                        {
                          "id": "hv0oht0",
                          "text": "Really? That’s funny. Do all of those countries have property taxes? If so, I guess they should send her the bill! 😬",
                          "timestamp": "2022-01-31 17:36:24",
                          "score": 3,
                          "num_children": 1,
                          "author": 261363,
                          "replies": [
                            {
                              "id": "hv0ov4p",
                              "text": "Technically she is the head of state in these countries. My friend moved to Canada in 2014 and is now a citizen. He said he had to pledge elegance to the queen to naturalize.",
                              "timestamp": "2022-01-31 17:38:41",
                              "score": 4,
                              "num_children": 1,
                              "author": 91183,
                              "replies": [
                                {
                                  "id": "hv0r9pu",
                                  "text": "Aware. I didn’t think anyone interpreted that as any form of ownership though.",
                                  "timestamp": "2022-01-31 17:53:22",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 261363,
                                  "replies": [
                                    {
                                      "id": "hv0y91v",
                                      "text": "Imagine if the queen started demanding rent",
                                      "timestamp": "2022-01-31 18:36:09",
                                      "score": 5,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hv0yxir",
                                          "text": "Hehe. The queen is granted infinite power, so long as she choose not to use any of it. In fact, I'm Emperor of the World, the queen and all world governments submit to me. But as of now, I have seen no reason to tell them what to do, so I let them carry on. Why have you never heard of this, you may ask? Illuminati.",
                                          "timestamp": "2022-01-31 18:40:21",
                                          "score": 4,
                                          "num_children": 0,
                                          "author": 261363,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "hv2zg14",
                          "text": "TL;DR she owns owns like 500,000 - 600,000 acres.\n\nOk I looked into it. When you remove the silly things like the Queen owning countries her property is still complicated. She essentially owns things as if she were three different people:\n\n1. The Crown Estate\n2. The Duchy of Lancaster\n3. Elizabeth Windsor\n\nThe Crown estate is a set of properties owned by the \"Crown\".  The sovereign legally owns these properties but she willingly signed over all the profits from these lands to the government in return for a fixed annual stipend that amounts to roughly  a quarter of the annual profits. These lands total roughly 300,000 acres. A new monarch is under no *legal* obligation to sign over these lands but every monarch has done so for nearly 300 years.\n\nThe Dutchy of Lancaster is the private estate of the British sovereign. The sovereign is entitled to the profits of this portfolio and can manage it as she likes but she is not entitled to the capital or any profits from the sale of the capital as those are the property of the estate and are held in trust for the next sovereign. However the cash profits *can* be used to buy property that is hers and not the property of the Dutchy. These lands are roughly 50,000 acres in size.\n\nAs a regular person she has a bunch of properties she owns. These include two estates bought by her ancestors. Balmoral in Scotland (50,000 acres) was bought by her great grandfather Prince Albert (who was not a monarch) with his own money and it passed to his eldest son on his wife's (Queen Victoria) death. Sandringham (20,000 acres) was bought by QEII's grandfather, Edward II, from profits his estate accrued while he was a child (The Prince of Wales has the Dutchy of Cornwall that acts similarly to Lancaster in function).  Theses estate had to be bought from Edward VIII by his brother when he abdicated as they had no legal connection to the monarch. Since then QEII has made a ton of investments with the profits from these private holdings as well as the profits of Lancaster. As it turned out buying land in the last 70 years was a good investment. She also made a bunch of money off of horses and other enterprises.\n\nShe claims to pay taxes but she is never audited because she legally isn't obliged to pay them so we don't really know quite how much land she owns but somewhere in the ballpark of half a million acres seems reasonable.",
                          "timestamp": "2022-02-01 02:50:19",
                          "score": 3,
                          "num_children": 0,
                          "author": 140514,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hv6ep8r",
                  "text": "They're in cahoots in any case!",
                  "timestamp": "2022-02-01 20:08:50",
                  "score": 1,
                  "num_children": 0,
                  "author": 40941,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "huzymta",
          "text": "Just one question.  Is the concept of eminent domain foreign to Irish law?",
          "timestamp": "2022-01-31 14:49:38",
          "score": 3,
          "num_children": 2,
          "replies": [
            {
              "id": "hv12eno",
              "text": "> eminent domain\n\nIt's called *CPO ([Compulsory Purchase Order](https://www.citizensinformation.ie/en/housing/losing_your_home/compulsory_purchase_and_compensation.html))* in Ireland",
              "timestamp": "2022-01-31 19:01:30",
              "score": 2,
              "num_children": 0,
              "author": 161728,
              "replies": []
            },
            {
              "id": "hv0goff",
              "text": "I answer above. It's historically complicated.",
              "timestamp": "2022-01-31 16:48:33",
              "score": 1,
              "num_children": 0,
              "author": 140514,
              "replies": []
            }
          ]
        },
        {
          "id": "hv01ewc",
          "text": "So, like there's no education ministry?",
          "timestamp": "2022-01-31 15:09:07",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "hv03itn",
              "text": "There is a minister of education and a state department of education. All exams in Ireland are controlled by the department of education.",
              "timestamp": "2022-01-31 15:23:27",
              "score": 3,
              "num_children": 1,
              "author": 91183,
              "replies": [
                {
                  "id": "hv0l68f",
                  "text": "How does it work then? Why isnt the ministry building schools? Why isnt the ministry banning religious education? Im sorry I just dont get it...",
                  "timestamp": "2022-01-31 17:16:14",
                  "score": 3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hv0mfjq",
                      "text": "Simple answer the church had too much power on the island and owned all the school houses and land. \n\nIn the generations before the church had a huge say in what the state dose e.g abortion bans, no divorces, no condoms. But through the democrat process we the people of Ireland voted to change the constitution through a referendum and there is nothing the church can do about that. \n\nSupposably you have to do religion as part of your state exam. I didn't do it in my leaving certificate I don't know how I managed that but thank fuck.",
                      "timestamp": "2022-01-31 17:23:52",
                      "score": 2,
                      "num_children": 1,
                      "author": 91183,
                      "replies": [
                        {
                          "id": "hv0on0y",
                          "text": "Got that.",
                          "timestamp": "2022-01-31 17:37:17",
                          "score": 3,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hv0az3j",
          "text": "Eminent domain those catholic fucks. Take the land and buildings as payment for decades of abuse",
          "timestamp": "2022-01-31 16:12:36",
          "score": 1,
          "num_children": 2,
          "author": 294937,
          "replies": [
            {
              "id": "hv0eunp",
              "text": "I don't disagree but Ireland had a very long history of colonial landlords evicting tenants. As a result it is extremely difficult to evict anyone from anything in Irish law. Even then they have a solid defense,   \n\"Why do you want to evict this school?\" \n\n\"So we can turn it into a school.\"  \n\n\nIt basically requires new legislation or, more likely, a referendum. It could happen in the years ahead but no one in authority or opposition has suggested that yet.",
              "timestamp": "2022-01-31 16:37:10",
              "score": 2,
              "num_children": 0,
              "author": 140514,
              "replies": []
            },
            {
              "id": "hv0ntnm",
              "text": "Even more simply, could just ban religious schools?",
              "timestamp": "2022-01-31 17:32:21",
              "score": 1,
              "num_children": 0,
              "author": 15159,
              "replies": []
            }
          ]
        },
        {
          "id": "hv14y35",
          "text": "Currently in the Irish education system (I'm in 6th year, secondary school). Honestly most religion classes were us just sitting around and talking to each other. None of my classmates really paid attention. We just said what they wanted to hear and move on, most of us just saw it as an easy A in our Junior Cert. In Senior Cycle it just turned into our CSPE class. We talked about war, abortion and death penalty stuff. I live in Cork, close to the city centre tho so I imagine it might be more tightly run in the countryside.\n\nMy point is that a lot of people attend these catholic schools because they have a pretty good reputation, not because they're Catholic. So even if they have a hard time getting it out of the education system, Most of us just dont really care about it. (In my experience).",
          "timestamp": "2022-01-31 19:17:21",
          "score": 1,
          "num_children": 0,
          "author": 403421,
          "replies": []
        },
        {
          "id": "hv17490",
          "text": "This is the reason why schools ran by churches should be outlawed in every country. They have no place in democracy.",
          "timestamp": "2022-01-31 19:30:59",
          "score": 1,
          "num_children": 0,
          "author": 242458,
          "replies": []
        },
        {
          "id": "hv29ft2",
          "text": "Just have the Irish government sue the Catholic Church for any number of terrible things they had a hand in. Offer to settle for all the school land in the country.",
          "timestamp": "2022-01-31 23:38:47",
          "score": 1,
          "num_children": 1,
          "author": 260107,
          "replies": [
            {
              "id": "hv2clf9",
              "text": "This is flippant and ultimately disrespectful to the many victims of these crimes:\nhttps://youtu.be/Q9qf--oIavQ",
              "timestamp": "2022-02-01 00:01:10",
              "score": 1,
              "num_children": 1,
              "author": 140514,
              "replies": [
                {
                  "id": "hv3nqlr",
                  "text": "That may be but I’m failing to see trying to get some amount of compensation for the Catholic Church’s crimes as disrespectful, particularly if it would go a long way (secular education) to preventing similar crimes in the future.",
                  "timestamp": "2022-02-01 06:19:43",
                  "score": 1,
                  "num_children": 1,
                  "author": 260107,
                  "replies": [
                    {
                      "id": "hv42ksi",
                      "text": "Imagine you get raped and the restitution awarded to you is someone else getting your rapists house",
                      "timestamp": "2022-02-01 09:22:22",
                      "score": 1,
                      "num_children": 1,
                      "author": 140514,
                      "replies": [
                        {
                          "id": "hv7yqdc",
                          "text": "Imagine that someone else getting the rapist’s house ensures they and others like them do not get raped.",
                          "timestamp": "2022-02-02 02:17:33",
                          "score": 1,
                          "num_children": 0,
                          "author": 260107,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hv1wuya",
          "text": "So you're telling me WAY back when, it was the church who first took on the task of educating the people of Ireland? Love how Reddit will gloss over this fact and only focus on the fact that it's the church and not the fact that the church literally was educating the masses. Sure, maybe you can say they had an agenda as well, spreading their religion, but where would education be without that? All you have are hypotheticals.",
          "timestamp": "2022-01-31 22:13:28",
          "score": 0,
          "num_children": 1,
          "replies": [
            {
              "id": "hv28u4r",
              "text": "Ahhh the immune to irony guy who shows up on r/atheism to make bad faith arguments. I for one shall not participate.",
              "timestamp": "2022-01-31 23:34:29",
              "score": 1,
              "num_children": 0,
              "author": 140514,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hv064pw",
      "text": "Great! Keep going until every religious tentacle is dethroned and evicted, not letting Talibangelicals take its place.",
      "timestamp": "2022-01-31 15:40:45",
      "score": 19,
      "num_children": 1,
      "author": 115155,
      "replies": [
        {
          "id": "hv0x2p8",
          "text": "I’ve been calling them the Christian Taliban, but I much prefer your term “Talibangelicals.” I hope the term becomes widespread. Kudos.",
          "timestamp": "2022-01-31 18:28:58",
          "score": 9,
          "num_children": 0,
          "author": 12906,
          "replies": []
        }
      ]
    },
    {
      "id": "hv0a8f4",
      "text": "With or without religion, good people can behave well and bad people can do evil; but for good people to do evil - that takes religion.\nSteven Weinberg",
      "timestamp": "2022-01-31 16:07:46",
      "score": 10,
      "num_children": 0,
      "author": 196647,
      "replies": []
    },
    {
      "id": "hv01wt9",
      "text": ">it said in a statement.\n\nLol what? Why not just use the article title instead of the word salad that has been copied and pasted in its place?",
      "timestamp": "2022-01-31 15:12:32",
      "score": 9,
      "num_children": 1,
      "author": 174315,
      "replies": [
        {
          "id": "hv18yrz",
          "text": "It's one of the paragraphs from the article, but it's massively out of context. The title implies Ireland said it, but it's actually Atheist Ireland, an atheist association with about 500 members.",
          "timestamp": "2022-01-31 19:42:33",
          "score": 3,
          "num_children": 0,
          "author": 8903,
          "replies": []
        }
      ]
    },
    {
      "id": "huzxogr",
      "text": "I wish it happens in Poland soon",
      "timestamp": "2022-01-31 14:42:47",
      "score": 26,
      "num_children": 2,
      "author": 166769,
      "replies": [
        {
          "id": "hv00i0u",
          "text": "I wish it happens in the US soon as well... and the rest of the world tbh.",
          "timestamp": "2022-01-31 15:02:50",
          "score": 11,
          "num_children": 1,
          "author": 400114,
          "replies": [
            {
              "id": "hv0s97b",
              "text": "You wish what would happen in the US?",
              "timestamp": "2022-01-31 17:59:23",
              "score": -1,
              "num_children": 1,
              "author": 136198,
              "replies": [
                {
                  "id": "hv0wjjt",
                  "text": "Religion getting its hands off government, education, and just massive portions of life in general.",
                  "timestamp": "2022-01-31 18:25:43",
                  "score": 4,
                  "num_children": 0,
                  "author": 400114,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hv0azov",
          "text": "Already seen two women dead because of the abortion ban in the space of five months. They’re sending a message loud and clear to half of their population on just how much their lives are valued, and it isn’t landing well.",
          "timestamp": "2022-01-31 16:12:43",
          "score": 6,
          "num_children": 0,
          "author": 187338,
          "replies": []
        }
      ]
    },
    {
      "id": "hv02n6v",
      "text": "TFW Ireland is less controlled by religious extremists than America.\n\nFuck the Christian right.",
      "timestamp": "2022-01-31 15:17:32",
      "score": 32,
      "num_children": 3,
      "author": 88790,
      "replies": [
        {
          "id": "hv0wu5o",
          "text": "Isn’t it funny that the “godless” groups are always more morally upstanding than the religious extremists?",
          "timestamp": "2022-01-31 18:27:31",
          "score": 10,
          "num_children": 0,
          "author": 74499,
          "replies": []
        },
        {
          "id": "hv09qyu",
          "text": "We're at a point now where a lot of funding for religious organizations in Ireland comes from the US. This was especially obvious during the recent election where the only anti abortion party (albeit a very small one with one seat from a guy who defected from another party) coated towns in posters. There's only one place all the money came from...",
          "timestamp": "2022-01-31 16:04:38",
          "score": 9,
          "num_children": 0,
          "author": 56201,
          "replies": []
        },
        {
          "id": "hv1l1on",
          "text": "It's obviously goes a bit deeper than that but it is am interesting comparison to make and shows just how bad things can get when one party is so beholden to a religious set of ideals.\n\nIreland has been burned so badly with Catholic Church scandals that a whole generation grew up not in fear of them, but intolerable of them and it showed when they hit voting age.\n\nWe were more than happy, for the most part, to legalise abortion and gay marriage, move with the times and get on it with it whereas in the US these are still legitimate political rallying points, still very much in the public discourse. That only comes from having 1 party in a 2 party system be so entrenched in their religion they can't smell how bad their own shit smells.",
          "timestamp": "2022-01-31 20:58:05",
          "score": 1,
          "num_children": 0,
          "author": 30334,
          "replies": []
        }
      ]
    },
    {
      "id": "hv094p6",
      "text": "While Evangelicals are doing the opposite - with monied backers - in the USA.",
      "timestamp": "2022-01-31 16:00:33",
      "score": 16,
      "num_children": 1,
      "author": 342657,
      "replies": [
        {
          "id": "hv0wddt",
          "text": "They have been packing the Supreme Court with right wing Christians. This will have devastating consequences for many decades.",
          "timestamp": "2022-01-31 18:24:41",
          "score": 9,
          "num_children": 1,
          "author": 12906,
          "replies": [
            {
              "id": "hy70c9n",
              "text": "I agree and we're already seeing the impacts, with overt displays against women's rights and continuining Roberts' Federalist Society attack on non-white voting rights.",
              "timestamp": "2022-02-24 03:50:43",
              "score": 2,
              "num_children": 0,
              "author": 342657,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "huzytl8",
      "text": "Ireland's emergence from being essentially a backwater defined by Medieval religious conflicts only a mere generation ago, to being wealthy, secular nation is both shocking and exemplary. Well done, Ireland.",
      "timestamp": "2022-01-31 14:50:59",
      "score": 30,
      "num_children": 1,
      "author": 100253,
      "replies": [
        {
          "id": "hv05akn",
          "text": "erm it isn't nor wasn't religious conflict - invasion and plantation by Britain.",
          "timestamp": "2022-01-31 15:35:16",
          "score": 8,
          "num_children": 2,
          "author": 117956,
          "replies": [
            {
              "id": "hv16nfo",
              "text": "It very much was religious. Catholic vs protestant, north vs south, Irish vs British. Doesnt matter what you call it but it was still a religious conflict",
              "timestamp": "2022-01-31 19:28:05",
              "score": 4,
              "num_children": 2,
              "author": 37860,
              "replies": [
                {
                  "id": "hv1z7qr",
                  "text": "Am from NI. It's a tribal conflict , Nationalist v Loyalist; indigenous v colonist (heritage).  Not religious.",
                  "timestamp": "2022-01-31 22:29:01",
                  "score": 3,
                  "num_children": 3,
                  "author": 117956,
                  "replies": [
                    {
                      "id": "hv27swm",
                      "text": "No it had tons of religious aspects, but they pretended as if it did not",
                      "timestamp": "2022-01-31 23:27:04",
                      "score": 1,
                      "num_children": 0,
                      "author": 278503,
                      "replies": []
                    },
                    {
                      "id": "icznwih",
                      "text": "Only Irish and British are the same race and cannot be visually distinguished unlike Hutus and Tursis or Tibetian and Han or Norse and Lapps",
                      "timestamp": "2022-06-19 21:44:48",
                      "score": 1,
                      "num_children": 0,
                      "author": 93349,
                      "replies": []
                    },
                    {
                      "id": "hv20etp",
                      "text": "Well considering most (if not all) loyalists are protestant and nationalists are catholic i think that proves my point",
                      "timestamp": "2022-01-31 22:36:55",
                      "score": -1,
                      "num_children": 0,
                      "author": 37860,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hv3dahk",
                  "text": "Both sides were different religions as they are from different cultures, historically, different countries, but the conflict was not about religion. Obviously, as in any long standing animosity between 2 people's, their differences were highlighted. That doesn't make religion the basis of the conflict.",
                  "timestamp": "2022-02-01 04:39:25",
                  "score": 1,
                  "num_children": 0,
                  "author": 287700,
                  "replies": []
                }
              ]
            },
            {
              "id": "hv1hohm",
              "text": "It was hugely religious, I remember as a kid being told which streets you couldn't go down depending on Catholic or Protestant, scary times.",
              "timestamp": "2022-01-31 20:37:04",
              "score": 1,
              "num_children": 2,
              "author": 289409,
              "replies": [
                {
                  "id": "hv25anb",
                  "text": "Ask Wolfetone, casement, Parnell and plenty more Protestants whether it as about religion or Irish independence",
                  "timestamp": "2022-01-31 23:09:49",
                  "score": 1,
                  "num_children": 0,
                  "author": 215793,
                  "replies": []
                },
                {
                  "id": "hv335gz",
                  "text": "Sometimes it’s hard to know if something is tribal or religious because they can be so tightly bound. Think of the Israel / Palestine conflict. Could you really say that’s a religious conflict? They don’t seem to have a single theological point of conflict. It’s just “this group wants that group out.” That’s tribal IMO but the venn diagram with religion is a perfect match.",
                  "timestamp": "2022-02-01 03:17:54",
                  "score": 1,
                  "num_children": 0,
                  "author": 247771,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "huzytqo",
      "text": "ALLELUIAH!",
      "timestamp": "2022-01-31 14:51:01",
      "score": 4,
      "num_children": 0,
      "author": 182568,
      "replies": []
    },
    {
      "id": "hv1bf0b",
      "text": "This needs to happen in the US fast",
      "timestamp": "2022-01-31 19:57:43",
      "score": 3,
      "num_children": 0,
      "author": 228883,
      "replies": []
    },
    {
      "id": "hv3h57u",
      "text": "When the Irish drove out the British colonizers about a hundred years ago what remained was weak in terms of government and governance - except the Church had been there for hundreds of years too. \n\nThe Church was a powerful institution with a deeply devout population, and so it was literally written into the constitution of the country that was new to being a nation-state. Not only did the Church dominate the spiritual life, it dominated the political life, and education, and hospitals, and it was a huge landowner. (NB: England and France had violent land reforms that wrested away the land holdings from the Church. Ireland never had that.)\n\nBut it provided little to no moral leadership for much of the late 20th century, at a time when there was a lot of violence and civil strife. As a new generation grew up and wanted change, it began to question the Church. The Church’s response was basically stfd and stfu, we are the Church and you are Ireland so you will do what we say. This was not an appropriate response to an increasingly educated and politically aware populace.\n\nSo that populace started to change things, first with a constitutional referendum to allow divorce. (Divorce had been not just illegal but actually unconstitutional.) The Church strongly resisted that, but lost. And that showed that the power of the Church could be beaten.\n\nThen, around the world the revelations of the Church being complicit in serious abuse began to come out in basically all the Catholic countries. And it began to come out in Ireland too, but it was arguably far worse. What also came out in Ireland was the inhuman treatment of unmarried mothers and their babies and children. These people were turned into slaves in institutions literally owned and run by the Church. Many died. The ones that did not die were sepal and the children were adopted out, the mothers were sent away, shamed and humiliated, without their children or even a community to go home too. And there was no abortion as that was unconstitutional too.\n\nThe only way to get an abortion was to go across the sea to England and get an abortion there, where it was legal. But that took time and money and if one was poor or without the means to take several days off for travel and lodging and medical procedures it just didn’t happen. Then, a medical emergency happened to a young female doctor. She was Indian, working in Ireland. (I believe she was Hindu.) Her pregnancy spontaneously aborted and began to go septic. She was taken to the hospital and needed emergency surgery to remove the mass that was now poisoning her - but the Catholic hospital refused to perform or to allow the procedure. She was a doctor and knew what needed to be done to save her life. She begged, but the doctors and the hospital refused. She died.\n\nThis was a huge scandal, especially coming as it did around the time of priests being pedophiles and nuns running slaving and torture houses.\n\nThe people went back to the constitution and with another referendum made birth control legal (it had been constitutionally illegal) and also legalized abortion.\n\nThe Church had been deeply committed to the wrong side of criminality and immorality for a long time, and the young populace of this young country started to say “no more”. But it wasn’t just the young people. Many of the middle aged and old people who had had to silently tolerate the dominance of the Church began to not only vote, but to fall away from the institution. \n\nIn fact the two major political parties that had run the country with the cooperation of the Church began to lose much of their constituency to the third party that had been around for a long time but had been demonized by the Church for their stand on divorce, birth control, and abortion. They had also been shunned by the other parties because they were not for the status quo, but for change, and for reuniting the country.\n\nThe people of the country still need to reform their systems of education and health care, as well as restructure many political, social, and economic structures - and it looks like they are slowly achieving things.",
      "timestamp": "2022-02-01 05:13:43",
      "score": 3,
      "num_children": 0,
      "author": 342338,
      "replies": []
    },
    {
      "id": "hv15ru3",
      "text": "Religious education in primary school is outright indoctrination and exclusionary to those who aren't Catholic.\n\nIn my class, we spent 1 - 2 times a week going to the local church to prepare for our confirmation. This would take up a considerable amount of time, in which those who weren't Catholic were thrown into another class, receiving no education and often told to \"read a book\", essentially entertain yourselves.\n\nThis waste of time was also added upon by the amount of preparation we would do IN CLASS. And don't forget morning prayers. And if you had a hardcore religious person for your teacher, you were pretty much fucked education-wise no matter your beliefs.\n\nIt's insane that young Irish people aren't more thick considering how much valuable education time was wasted doing religious bollox.\n\nOh yeah, and secondary school religious class was near impossible to get out of. And even if you did, you were essentially shunned by the religion teachers. This class is meant to teach a few religions equally. But my teacher was a nutjob who spent two weeks reading out from the book about Judaism and the rest of the three year term was spent learning about Christianity.\n\nWhen I write it out like this, it really makes me realise how fucked it all is.",
      "timestamp": "2022-01-31 19:22:30",
      "score": 3,
      "num_children": 0,
      "author": 385277,
      "replies": []
    },
    {
      "id": "huzv6mq",
      "text": "BASED",
      "timestamp": "2022-01-31 14:24:30",
      "score": 6,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv06jzq",
      "text": "Good on you Ireland. Getting out from Catholicism is a step away from fascist tendencies. Like seriously, way to fucking go. That's progress!",
      "timestamp": "2022-01-31 15:43:32",
      "score": 7,
      "num_children": 1,
      "author": 258007,
      "replies": [
        {
          "id": "iczoef2",
          "text": "You do know that Hitler considered religion to be a Jewish plot don't you? The nazis killed more priests than the bolshaviks did",
          "timestamp": "2022-06-19 21:48:46",
          "score": 1,
          "num_children": 1,
          "author": 93349,
          "replies": [
            {
              "id": "iczonxj",
              "text": "The nazis killed a lot of their own. It's a fascist go to move. That being said, the Roman Catholic church was the official state church of fascism effective 1929 to 1985. Lateran treaty.",
              "timestamp": "2022-06-19 21:50:51",
              "score": 1,
              "num_children": 1,
              "author": 258007,
              "replies": [
                {
                  "id": "iczpqfo",
                  "text": "Hitler killed 80% of the Polish clergy. And declared Catholism \"the personification of human failure\". \n\nHe killed the brownshirts as they had outlived their usefulness and could challenge him and he killed the pervious poltical class as they where a threat. He believed that religion created duel loyalties. You can't worship the fuehrer and devoted yourself to the reich if you believe in the higher power of god. Nazism is/was an anti religious cult.",
                  "timestamp": "2022-06-19 21:59:32",
                  "score": 1,
                  "num_children": 1,
                  "author": 93349,
                  "replies": [
                    {
                      "id": "iczqhal",
                      "text": "Nazism, like all fascism, is an anti-everything cult. You'll notice they had no issues knifing half of their own people to get the ball rolling in the Night of the Long Knives.\n\nYou'll find no argument from me about them eventually taking issue with church. That didn't stop them from using the church to push fascism, nor did it stop the church profiting from it. \n\nOf course they'll purge actually good people who oppose fascism. Purging people certainly wasn't limited to the Jews. Homosexuality, cripples and the elderly weren't desirable either. Nazis were pretty much anti everybody but their in group. \n\nAnd they were happy to use other groups to get them there, and then predictably kill those ladders off when they were done with them. \n\nIt's what fascists do. Discard people as soon as their usefulness has ended.",
                      "timestamp": "2022-06-19 22:05:34",
                      "score": 1,
                      "num_children": 0,
                      "author": 258007,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "huzwkwq",
      "text": "Absolutely! In my country we also still have religions sponsoring or running schools and its always caused a lot of problems! There's a law in our constitution that allows freedom of education however their teachings methods have always included bible/qu'ran study, prayers and religious service. Completely \"optional\" of course.\n\nI think all schools must be secular and religion has no place in education. However there are still many that argue that parents should have the option to put their kids in a school of their choice.",
      "timestamp": "2022-01-31 14:34:47",
      "score": 6,
      "num_children": 0,
      "author": 56797,
      "replies": []
    },
    {
      "id": "hv0cs9l",
      "text": "Religious indoctrination isn't freedom at all.",
      "timestamp": "2022-01-31 16:24:09",
      "score": 5,
      "num_children": 0,
      "author": 392469,
      "replies": []
    },
    {
      "id": "hv02pzw",
      "text": "The shitty thing about Ireland is they are going to multi-denominational schools instead of non-denominational. They're still keeping religion in their education, because they have apparently learned nothing.",
      "timestamp": "2022-01-31 15:18:06",
      "score": 6,
      "num_children": 3,
      "author": 403163,
      "replies": [
        {
          "id": "hv0ht8h",
          "text": "These things take generations, sadly.\n\nUsing an only-semi-related American example: lead (Pb) in household paint, gasoline, and cookware.\n\nLead in paint was banned in the 1970s.  Lead in gasoline wasn't fully phased out until 1996.  NOBODY on the Supreme Court, in either house of the national legislature, or in the White House is young enough to have never been exposed to lead in car exhaust; nearly all older members have been exposed in their homes.\n\nSo, at least until GenZ (and/or their generational successors) is an active, elected, political super-majority...American politics will be tainted with literal brain-damaged boomers, Gen Xers, and millennials who grew up huffing lead fumes anywhere there were cars.\n\nFor sufficient change to occur, atheists need to have sustained political power for at least a generation.",
          "timestamp": "2022-01-31 16:55:34",
          "score": 3,
          "num_children": 0,
          "author": 185216,
          "replies": []
        },
        {
          "id": "hv17voh",
          "text": "That's a harsh assessment of the Educate Together schools in Ireland and their ethos. \n\nIt's very progressive and inclusive.",
          "timestamp": "2022-01-31 19:35:46",
          "score": 3,
          "num_children": 0,
          "author": 391342,
          "replies": []
        },
        {
          "id": "hv0s2k7",
          "text": "What would be the difference in teaching? Or are you saying schools should teach nothing about religion? I think it's a good subject to help promote critical thinking.",
          "timestamp": "2022-01-31 17:58:16",
          "score": 2,
          "num_children": 1,
          "author": 202005,
          "replies": [
            {
              "id": "hv0xcpz",
              "text": "It's presented in a way of all the religions being valid with no atheist representation. Still way better than a Catholic curriculum, but still sending the wrong message.",
              "timestamp": "2022-01-31 18:30:40",
              "score": 1,
              "num_children": 1,
              "author": 403163,
              "replies": [
                {
                  "id": "hv0y0ov",
                  "text": "Are you sure about that? I've looked up educate together and they specifically say they teach atheism and agnosticism.\n\nhttps://www.educatetogether.ie/about/ethical-education/primary/#:~:text=In%20Educate%20Together%20schools%2C%20the,Ethical%20Education%20Curriculum%20is%20taught.&text=Learn%20Together%20teaches%20students%20about,any%20one%20worldview%20over%20another.\n\n>Strand 3: Belief Systems\nThe aim of this strand is to develop in children an understanding and awareness of the teachings of religious and non-theistic belief systems. We teach about the main world religions: Christianity; Islam; Judaism: Buddhism; Hinduism and Sikhism as well as Humanism; Atheism and Agnosticism.",
                  "timestamp": "2022-01-31 18:34:45",
                  "score": 3,
                  "num_children": 1,
                  "author": 202005,
                  "replies": [
                    {
                      "id": "hv0zxmn",
                      "text": "I've heard they are the best option and researching them for my children",
                      "timestamp": "2022-01-31 18:46:28",
                      "score": 1,
                      "num_children": 1,
                      "author": 403163,
                      "replies": [
                        {
                          "id": "hv10tbr",
                          "text": "Still though, what would you prefer to that?",
                          "timestamp": "2022-01-31 18:51:50",
                          "score": 2,
                          "num_children": 0,
                          "author": 202005,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hv0gsx7",
      "text": "I thought my ancestors left cause the great famine. Turns out they survived that but the religious stuff is what threw a wrench in  the gears",
      "timestamp": "2022-01-31 16:49:19",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv0hh7n",
      "text": "“[…] it said in a statement.” — whose statement? Bad title!",
      "timestamp": "2022-01-31 16:53:30",
      "score": 2,
      "num_children": 0,
      "author": 385734,
      "replies": []
    },
    {
      "id": "hv0iggm",
      "text": "USA next please! 🤞🏼",
      "timestamp": "2022-01-31 16:59:32",
      "score": 2,
      "num_children": 0,
      "author": 11016,
      "replies": []
    },
    {
      "id": "hv0iray",
      "text": "Education...you mean brainwashing so they won't report the molestation.",
      "timestamp": "2022-01-31 17:01:23",
      "score": 2,
      "num_children": 0,
      "author": 80914,
      "replies": []
    },
    {
      "id": "hv0zxva",
      "text": "I'm from the other part of Ireland that everyone fights about. Im 37. So i grew up past the worst of the troubles. But even in my day I remember the fighting over religion. The hate that people held towards some just because of what side of the Christian religion you are on. My kids are 15 and 12. And grew and grow up without religion. I will not indoctrinate them into hate. I hope Northern Ireland will follow Ireland and get the archaic laws based on religion out to fuck.",
      "timestamp": "2022-01-31 18:46:30",
      "score": 2,
      "num_children": 0,
      "author": 273957,
      "replies": []
    },
    {
      "id": "hv112iw",
      "text": "UP THE LADS!!!!🇮🇪🇮🇪🇮🇪",
      "timestamp": "2022-01-31 18:53:23",
      "score": 2,
      "num_children": 0,
      "author": 269780,
      "replies": []
    },
    {
      "id": "hv13djv",
      "text": "Y'all got any room over there for two more? It's either there or Scotland...my mom looks ginger so I can pass as Irish too",
      "timestamp": "2022-01-31 19:07:31",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv15rhi",
      "text": "How about if the Catholic Church hands all schools and grounds under its control over to the state, not as a big solution, but simply as the initial step of showing genuine contrition for the rape, murder, and horrific abuse of untold thousands of innocent children and women in Ireland. We can talk about appropriate punishment later, after they've had a chance to actually show remorse.",
      "timestamp": "2022-01-31 19:22:26",
      "score": 2,
      "num_children": 0,
      "author": 305380,
      "replies": []
    },
    {
      "id": "hv1ek3h",
      "text": "We have a long way to go! They're embedded in our education system. Have you read the constitution, it's a prayer book. The Dail and council meetings all start with a prayer, they ridiculed Ming when he wouldn't stand for the prayer",
      "timestamp": "2022-01-31 20:17:27",
      "score": 2,
      "num_children": 0,
      "author": 61879,
      "replies": []
    },
    {
      "id": "hv1ulet",
      "text": "Who is “it”? What representative of Ireland at the un? Or did Ireland itself yell this?",
      "timestamp": "2022-01-31 21:58:42",
      "score": 2,
      "num_children": 0,
      "author": 115922,
      "replies": []
    },
    {
      "id": "hv27wsk",
      "text": "Well done Ireland! A small step forward!",
      "timestamp": "2022-01-31 23:27:51",
      "score": 2,
      "num_children": 0,
      "author": 134565,
      "replies": []
    },
    {
      "id": "hv2brfe",
      "text": "Shout out to the main left party, Sinn Fein, who have had the nationalisation of the school system and the creation of a secular state in their manifesto for many years.",
      "timestamp": "2022-01-31 23:55:13",
      "score": 2,
      "num_children": 0,
      "author": 333968,
      "replies": []
    },
    {
      "id": "hv2j8pu",
      "text": "Oh heavens, thank god for that! Lol.",
      "timestamp": "2022-02-01 00:52:25",
      "score": 2,
      "num_children": 0,
      "author": 228373,
      "replies": []
    },
    {
      "id": "hv2o6p8",
      "text": "And it won't hurt you a bit, remember Sinead -she who laughs last.",
      "timestamp": "2022-02-01 01:28:55",
      "score": 2,
      "num_children": 0,
      "author": 127424,
      "replies": []
    },
    {
      "id": "hv32zdp",
      "text": "Applause, Ireland!!!!",
      "timestamp": "2022-02-01 03:16:37",
      "score": 2,
      "num_children": 0,
      "author": 132674,
      "replies": []
    },
    {
      "id": "hv3exei",
      "text": "Welcome to the 21st century, cousins!\n\nSlainte!",
      "timestamp": "2022-02-01 04:53:43",
      "score": 2,
      "num_children": 0,
      "author": 127450,
      "replies": []
    },
    {
      "id": "hv3ykyd",
      "text": "Curious if you think this is true, why just in recent months has a catholic Saint being honered with a Bank Holiday. Not catholic my arse",
      "timestamp": "2022-02-01 08:29:00",
      "score": 2,
      "num_children": 0,
      "author": 147910,
      "replies": []
    },
    {
      "id": "hv0hfwq",
      "text": "This is where we'll be in 30 years.  Millenials and Gen z are rejecting religion at far too high of rates for the religious right's dominance to survive once our parents and grandparents start dying of old age.",
      "timestamp": "2022-01-31 16:53:16",
      "score": 3,
      "num_children": 1,
      "author": 74641,
      "replies": [
        {
          "id": "hv0yu9i",
          "text": "I thought that 50 years ago when my generation seemed to be all hippies. I don’t know how the hell we ended up with so many right wing Christians. I hope the up and coming generations will do better than we did.",
          "timestamp": "2022-01-31 18:39:47",
          "score": 2,
          "num_children": 0,
          "author": 12906,
          "replies": []
        }
      ]
    },
    {
      "id": "hv0jpon",
      "text": "I want to immigrate to Ireland",
      "timestamp": "2022-01-31 17:07:15",
      "score": 2,
      "num_children": 2,
      "author": 174461,
      "replies": [
        {
          "id": "hv12xi3",
          "text": "Find an Irish Grandparent - collect your Irish Passport.",
          "timestamp": "2022-01-31 19:04:45",
          "score": 1,
          "num_children": 0,
          "author": 161728,
          "replies": []
        },
        {
          "id": "hv17cr2",
          "text": "Do what I did and marry and Irish person. \n\nIt was neither quick, nor easy, but it worked.",
          "timestamp": "2022-01-31 19:32:29",
          "score": 1,
          "num_children": 1,
          "author": 136449,
          "replies": [
            {
              "id": "hv2gqm8",
              "text": "Hm I know an Irish person, but I'll have to ask her if I can marry her.",
              "timestamp": "2022-02-01 00:33:00",
              "score": 1,
              "num_children": 0,
              "author": 174461,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hv0qgz5",
      "text": "Do the Catholic schools still hit kids? I went to school in Navan over 40 years ago and I remember how often they hit you with the rod/pointer they carried around. I'm Canadian and I lived in Ireland for about a year and a half as a kid.",
      "timestamp": "2022-01-31 17:48:32",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "hv0s7c1",
          "text": "No, teachers don't hit kids in Ireland.",
          "timestamp": "2022-01-31 17:59:04",
          "score": 2,
          "num_children": 1,
          "author": 202005,
          "replies": [
            {
              "id": "hv0sc14",
              "text": "That's good to hear. It wasn't a good memory.",
              "timestamp": "2022-01-31 17:59:52",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hv154na",
      "text": "Holy shit I’m moving to Ireland",
      "timestamp": "2022-01-31 19:18:28",
      "score": 2,
      "num_children": 0,
      "author": 9114,
      "replies": []
    },
    {
      "id": "hv0sfsn",
      "text": "I still remember when I was watching an Irish streamer  that was horrified by Americans doing the pledge of alligence in schools, but found the daily prayer in Irish schools completely normal",
      "timestamp": "2022-01-31 18:00:30",
      "score": 1,
      "num_children": 0,
      "author": 208831,
      "replies": []
    },
    {
      "id": "hv0t190",
      "text": "So, if someone from the US were to ever relocate due to it's shittier and shittier political climate is Ireland a viable option?",
      "timestamp": "2022-01-31 18:04:12",
      "score": 1,
      "num_children": 0,
      "author": 353070,
      "replies": []
    },
    {
      "id": "hv131ph",
      "text": "*happy Protestant noises*",
      "timestamp": "2022-01-31 19:05:28",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv1kw0h",
      "text": "The government of Ireland impresses me more and more every year. Their morality is truly inspired by compassion and respect for objective truths, end less and less by doctrines of superstition. Maybe I should move there? If Humpty Dumpty gets elected again here in the USA I need an escape plan.",
      "timestamp": "2022-01-31 20:57:06",
      "score": 1,
      "num_children": 0,
      "author": 219481,
      "replies": []
    },
    {
      "id": "hv1t7y7",
      "text": "Im moving to ireland",
      "timestamp": "2022-01-31 21:49:52",
      "score": 1,
      "num_children": 0,
      "author": 327398,
      "replies": []
    },
    {
      "id": "hv2ig83",
      "text": "Uh huh.  And what step is pedo not a crime?",
      "timestamp": "2022-02-01 00:46:23",
      "score": 1,
      "num_children": 1,
      "author": 319985,
      "replies": [
        {
          "id": "hv2z6fc",
          "text": "The first step into the Vatican.",
          "timestamp": "2022-02-01 02:48:23",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hv02ix6",
      "text": "[removed]",
      "timestamp": "2022-01-31 15:16:44",
      "score": -8,
      "num_children": 2,
      "replies": [
        {
          "id": "hv0djr2",
          "text": "Username checks out.",
          "timestamp": "2022-01-31 16:28:55",
          "score": 4,
          "num_children": 0,
          "author": 15056,
          "replies": []
        },
        {
          "id": "hv05tpg",
          "text": "Not for long, you theocrat assholes",
          "timestamp": "2022-01-31 15:38:45",
          "score": 6,
          "num_children": 2,
          "author": 199436,
          "replies": [
            {
              "id": "hv0pdk6",
              "text": "The gates of Hell shall not prevail against Her...",
              "timestamp": "2022-01-31 17:41:50",
              "score": -5,
              "num_children": 2,
              "author": 171079,
              "replies": [
                {
                  "id": "hv13nzw",
                  "text": "Thought Christ was a dude.  So trans IS okay…",
                  "timestamp": "2022-01-31 19:09:19",
                  "score": 2,
                  "num_children": 1,
                  "author": 199436,
                  "replies": [
                    {
                      "id": "hv24xs3",
                      "text": "\"Her\" refers to the Catholic Church, come on how you're smarter than that\n\nGod, y'all aren't even good atheists",
                      "timestamp": "2022-01-31 23:07:21",
                      "score": -3,
                      "num_children": 1,
                      "author": 171079,
                      "replies": [
                        {
                          "id": "hv3a7o8",
                          "text": "This is just me playing with the troll",
                          "timestamp": "2022-02-01 04:13:18",
                          "score": 1,
                          "num_children": 1,
                          "author": 199436,
                          "replies": [
                            {
                              "id": "hv3ai25",
                              "text": "trans folk are cool tho, dw",
                              "timestamp": "2022-02-01 04:15:40",
                              "score": 1,
                              "num_children": 1,
                              "author": 171079,
                              "replies": [
                                {
                                  "id": "hv4yxm1",
                                  "text": "Frankly I don’t care in the slightest what the Catholic Church considers okay.  They consider moving pedophiles around and shielding them from legal consequences okay, so forgive me if I could give a shit.",
                                  "timestamp": "2022-02-01 14:46:02",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 199436,
                                  "replies": [
                                    {
                                      "id": "hv514nz",
                                      "text": "The privy is just down the hall sir",
                                      "timestamp": "2022-02-01 15:01:12",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 171079,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hv1d1ec",
                  "text": "Maybe 1 or 2 generations and your god is gonna be nothing but a weird chapter in human history where we believed in magic and talking snakes",
                  "timestamp": "2022-01-31 20:07:51",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "hv1ivho",
              "text": "So tolerant",
              "timestamp": "2022-01-31 20:44:30",
              "score": 1,
              "num_children": 0,
              "author": 67257,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "huzzm31",
      "text": "Good for them!",
      "timestamp": "2022-01-31 14:56:37",
      "score": 1,
      "num_children": 0,
      "author": 351680,
      "replies": []
    },
    {
      "id": "hv01vkq",
      "text": "Wow, that's awesome.",
      "timestamp": "2022-01-31 15:12:18",
      "score": 1,
      "num_children": 0,
      "author": 350676,
      "replies": []
    },
    {
      "id": "hv02fsx",
      "text": "Good for them.",
      "timestamp": "2022-01-31 15:16:08",
      "score": 1,
      "num_children": 0,
      "author": 313026,
      "replies": []
    },
    {
      "id": "hv0eqcn",
      "text": "Germany could cut a piece of that",
      "timestamp": "2022-01-31 16:36:26",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv0knl0",
      "text": "I want to be an Irish Fisherman when I grow up. \n\n:-)",
      "timestamp": "2022-01-31 17:13:04",
      "score": 1,
      "num_children": 0,
      "author": 232138,
      "replies": []
    },
    {
      "id": "hv0n28z",
      "text": "Good on them. Fuck the CC Corp.",
      "timestamp": "2022-01-31 17:27:44",
      "score": 1,
      "num_children": 0,
      "author": 302522,
      "replies": []
    },
    {
      "id": "hv0naaw",
      "text": "You said it.",
      "timestamp": "2022-01-31 17:29:05",
      "score": 1,
      "num_children": 0,
      "author": 205854,
      "replies": []
    },
    {
      "id": "hv0ncnv",
      "text": "Do Ontario next.",
      "timestamp": "2022-01-31 17:29:29",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv0nfyv",
      "text": "Well at least let them keep the sex Ed parts, you know those Catholic priests and sex",
      "timestamp": "2022-01-31 17:30:02",
      "score": 1,
      "num_children": 0,
      "author": 222341,
      "replies": []
    },
    {
      "id": "hv0o537",
      "text": "We still have that problem in Canada. 🇨🇦. Ontario has 2 school systems fully publicly funded. Time to get rid of the duplication and religious indoctrination.",
      "timestamp": "2022-01-31 17:34:14",
      "score": 1,
      "num_children": 0,
      "author": 166199,
      "replies": []
    },
    {
      "id": "hv0p32l",
      "text": "I’m Irish. When we had religion class in secondary school (age 11/12 to 17/18) we would just watch movies or do homework for other classes. When we were in primary school (age 5-11/12) we were basically forced to learn all about the Catholic faith and practice it and complete our communion and confirmation and learn how to say full prayers in English and Irish.",
      "timestamp": "2022-01-31 17:40:03",
      "score": 1,
      "num_children": 2,
      "author": 30464,
      "replies": [
        {
          "id": "hv0rzmu",
          "text": "Do you happen to know how this specific reaction against state Catholicism has affected the sentiment for and against reunification in the North?",
          "timestamp": "2022-01-31 17:57:46",
          "score": 1,
          "num_children": 1,
          "author": 218168,
          "replies": [
            {
              "id": "hv0xvzm",
              "text": "I think some of the staunch protestant unionists in the north now fear that rather than being too religious (as was their mantra) the people in the republic are now too godless.",
              "timestamp": "2022-01-31 18:33:58",
              "score": 1,
              "num_children": 1,
              "author": 95839,
              "replies": [
                {
                  "id": "hv19bc4",
                  "text": "But we’re godless in Britain too! :)",
                  "timestamp": "2022-01-31 19:44:43",
                  "score": 1,
                  "num_children": 1,
                  "author": 218168,
                  "replies": [
                    {
                      "id": "hv1a4d0",
                      "text": "Indeed we are but I think parts of NI buck that trend. Not as bad as it was a few decades ago thankfully.",
                      "timestamp": "2022-01-31 19:49:43",
                      "score": 1,
                      "num_children": 0,
                      "author": 95839,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hv0xjg6",
          "text": "You should read the autobiography of Professor Noel Fitzpatrick on Irish education",
          "timestamp": "2022-01-31 18:31:50",
          "score": 1,
          "num_children": 0,
          "author": 95839,
          "replies": []
        }
      ]
    },
    {
      "id": "hv0qc9o",
      "text": "Fuck yes, go Ireland!",
      "timestamp": "2022-01-31 17:47:44",
      "score": 1,
      "num_children": 0,
      "author": 191471,
      "replies": []
    },
    {
      "id": "hv0re25",
      "text": "Is Ireland the “it”?",
      "timestamp": "2022-01-31 17:54:06",
      "score": 1,
      "num_children": 1,
      "author": 287091,
      "replies": [
        {
          "id": "hv0xbm4",
          "text": "\"It\" is the atheist association of Ireland. I was confused too.",
          "timestamp": "2022-01-31 18:30:29",
          "score": 2,
          "num_children": 0,
          "author": 95839,
          "replies": []
        }
      ]
    },
    {
      "id": "hv0rhoe",
      "text": "Taxing them should be next",
      "timestamp": "2022-01-31 17:54:43",
      "score": 1,
      "num_children": 0,
      "author": 325955,
      "replies": []
    },
    {
      "id": "hv0rvld",
      "text": "Yeah, the Catholic Church has taken a hell of a PR hit in the last couple of years, particularly wrt education. Try googling \"Murphy report\" and \"Bon Secours Tuam\" for some ideas why.",
      "timestamp": "2022-01-31 17:57:05",
      "score": 1,
      "num_children": 1,
      "author": 59953,
      "replies": [
        {
          "id": "hv0x63s",
          "text": "When the pope--that paedo protector--JP2 visited tickets were at a premium to see hom. I think half of Ireland turned out.\n\nWhen Frankie pitched up, the church could not give away the tickets.",
          "timestamp": "2022-01-31 18:29:33",
          "score": 1,
          "num_children": 0,
          "author": 95839,
          "replies": []
        }
      ]
    },
    {
      "id": "hv0sr4y",
      "text": "as an American, I'm jealous.  We have thousands of contiguous square miles of the bible belt filled with insulated antediluvian fucking fat farm Fox fundies who steadfastly refuse to learn where the sun goes at night with disproportionate voting power voting for more fundie shit.",
      "timestamp": "2022-01-31 18:02:27",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv0td6w",
      "text": "About time",
      "timestamp": "2022-01-31 18:06:13",
      "score": 1,
      "num_children": 0,
      "author": 75787,
      "replies": []
    },
    {
      "id": "hv0u832",
      "text": "Lol, classic only reading the title. ‘It’ being ….. atheism Ireland. Wonder why they said that😂",
      "timestamp": "2022-01-31 18:11:32",
      "score": 1,
      "num_children": 0,
      "author": 200648,
      "replies": []
    },
    {
      "id": "hv0v9ux",
      "text": "Holy shit I love Ireland",
      "timestamp": "2022-01-31 18:17:59",
      "score": 1,
      "num_children": 0,
      "author": 166848,
      "replies": []
    },
    {
      "id": "hv0vmg7",
      "text": "It?",
      "timestamp": "2022-01-31 18:20:08",
      "score": 1,
      "num_children": 0,
      "author": 225275,
      "replies": []
    },
    {
      "id": "hv0vx2b",
      "text": "When I moved to Cork in 1994, people would cross themselves on the bus when it went past grottos to the Virgin Mary. When I left just five years later, no-one crossed themselves. When I went back in 2017 there was a billboard in front of one of the local grottos. The Catholic Church protecting child rapists and destroying the lives of those children and families.",
      "timestamp": "2022-01-31 18:21:55",
      "score": 1,
      "num_children": 0,
      "author": 409187,
      "replies": []
    },
    {
      "id": "hv0y7u9",
      "text": "Now if only the usa had the balls to do that",
      "timestamp": "2022-01-31 18:35:57",
      "score": 1,
      "num_children": 0,
      "author": 299173,
      "replies": []
    },
    {
      "id": "hv0z2et",
      "text": "Good! I hope all other countries with religion in their governing laws follow suit.",
      "timestamp": "2022-01-31 18:41:10",
      "score": 1,
      "num_children": 0,
      "author": 231641,
      "replies": []
    },
    {
      "id": "hv109mx",
      "text": "Will you be the first athiest country eventually?",
      "timestamp": "2022-01-31 18:48:30",
      "score": 1,
      "num_children": 0,
      "author": 263149,
      "replies": []
    },
    {
      "id": "hv10rxi",
      "text": "Another reason I'm thinking of moving there",
      "timestamp": "2022-01-31 18:51:36",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv11knb",
      "text": "feels super relatable to issues with church and state in utah",
      "timestamp": "2022-01-31 18:56:25",
      "score": 1,
      "num_children": 0,
      "author": 227950,
      "replies": []
    },
    {
      "id": "hv12sdo",
      "text": "Damn. How much it has changed in 20 odd years. Insane",
      "timestamp": "2022-01-31 19:03:51",
      "score": 1,
      "num_children": 0,
      "author": 322750,
      "replies": []
    },
    {
      "id": "hv13egq",
      "text": "Meanwhile in America evangelical organizations are trying really hard to impose anachronistic control over the education of our children! Wheeee!",
      "timestamp": "2022-01-31 19:07:41",
      "score": 1,
      "num_children": 0,
      "author": 156230,
      "replies": []
    },
    {
      "id": "hv1gqjl",
      "text": "That’s such a great use of the word anachronistic.",
      "timestamp": "2022-01-31 20:31:07",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv1gwv7",
      "text": "almost brings tears to my eyes. fuck the church in ireland. really fuck them",
      "timestamp": "2022-01-31 20:32:14",
      "score": 1,
      "num_children": 0,
      "author": 42586,
      "replies": []
    },
    {
      "id": "hv1h7r0",
      "text": "And finding the child corpses.",
      "timestamp": "2022-01-31 20:34:10",
      "score": 1,
      "num_children": 0,
      "author": 80946,
      "replies": []
    },
    {
      "id": "hv1hsgz",
      "text": "Fantastic! Now do the US please!!!!!!!",
      "timestamp": "2022-01-31 20:37:46",
      "score": 1,
      "num_children": 0,
      "author": 125407,
      "replies": []
    },
    {
      "id": "hv1jv5n",
      "text": "The Catholic church are in retreat in Ireland but there not gone yet...I see signs of revival of Catholic nonsense online...I think they've seen what the far right have done online and see that even seemingly lost causes can be turned around. \n\nEven in retreat, I suspect it will be decades before CBS and Mercy convent schools are rebranded or replaced...if it happens at all. \n\nThese schools are pretty good, you don't tend to mess with what's not broken. I went to a large Mercy convent school which was really good.",
      "timestamp": "2022-01-31 20:50:42",
      "score": 1,
      "num_children": 0,
      "author": 228376,
      "replies": []
    },
    {
      "id": "hv1kqju",
      "text": "This is great news.",
      "timestamp": "2022-01-31 20:56:09",
      "score": 1,
      "num_children": 0,
      "author": 63916,
      "replies": []
    },
    {
      "id": "hv1lxx8",
      "text": "Bro thats good shit",
      "timestamp": "2022-01-31 21:03:39",
      "score": 1,
      "num_children": 0,
      "author": 78000,
      "replies": []
    },
    {
      "id": "hv1p08d",
      "text": "I'd post this to r/upliftingnews but I've been banned for posting things like this to r/upliftingnews.",
      "timestamp": "2022-01-31 21:22:59",
      "score": 1,
      "num_children": 0,
      "author": 254853,
      "replies": []
    },
    {
      "id": "hv1p6fc",
      "text": "Well done. *golf claps*",
      "timestamp": "2022-01-31 21:24:03",
      "score": 1,
      "num_children": 0,
      "author": 204487,
      "replies": []
    },
    {
      "id": "hv1pxlr",
      "text": "Pretty amazing how low the % of people that read the article is",
      "timestamp": "2022-01-31 21:28:50",
      "score": 1,
      "num_children": 0,
      "author": 385135,
      "replies": []
    },
    {
      "id": "hv1vtlc",
      "text": "Same with Australia. \n\nI'm sick of churches having so much power over our government. Especially Hillsong. \n\nI really thought things would change when an Atheist (Julia Gillard) became prime minister but she still buckled under the pressure from the church. \n\nThere's some real masked men running this country.",
      "timestamp": "2022-01-31 22:06:38",
      "score": 1,
      "num_children": 0,
      "author": 96116,
      "replies": []
    },
    {
      "id": "hv1vvnk",
      "text": "Well now that we have an influx of religiously devout catholics resettling here from\nabroad that’s going to be hard.",
      "timestamp": "2022-01-31 22:07:01",
      "score": 1,
      "num_children": 0,
      "author": 71223,
      "replies": []
    },
    {
      "id": "hv1zbb9",
      "text": "The Church brought this upon itself for ignoring priests and other religious who\npreyed on children. I cannot understand why this was a worldwide problem but it seems the Church does not believe what it instructs its congregations.",
      "timestamp": "2022-01-31 22:29:40",
      "score": 1,
      "num_children": 0,
      "author": 215065,
      "replies": []
    },
    {
      "id": "hv23ixs",
      "text": "But if they kick the Catholic clergy to the curb, who will they get to molest their children?\n\nThose animals have centuries of experience in doing that. They gonna bring in some amateurs, or what?",
      "timestamp": "2022-01-31 22:57:48",
      "score": 1,
      "num_children": 0,
      "author": 114177,
      "replies": []
    },
    {
      "id": "hv27sr3",
      "text": "\"It\"?  Like the nation of Ireland grew sentient or what?",
      "timestamp": "2022-01-31 23:27:02",
      "score": 1,
      "num_children": 0,
      "author": 176666,
      "replies": []
    },
    {
      "id": "hv282nb",
      "text": "Each generation is doomed to discover what has already been discovered. Yesterday’s hippies are today’s reactionary right wingers.",
      "timestamp": "2022-01-31 23:29:00",
      "score": 1,
      "num_children": 0,
      "author": 254843,
      "replies": []
    },
    {
      "id": "hv2ba7t",
      "text": "Hell yea!",
      "timestamp": "2022-01-31 23:51:52",
      "score": 1,
      "num_children": 0,
      "author": 266213,
      "replies": []
    },
    {
      "id": "hv2ch5e",
      "text": "One generation out from being able to claim an Irish (and by extension EU!) passport. Damn it all.",
      "timestamp": "2022-02-01 00:00:20",
      "score": 1,
      "num_children": 0,
      "author": 44782,
      "replies": []
    },
    {
      "id": "hv2idbp",
      "text": "Good call.",
      "timestamp": "2022-02-01 00:45:44",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv2v4wj",
      "text": "Amen! <said ironically",
      "timestamp": "2022-02-01 02:19:21",
      "score": 1,
      "num_children": 0,
      "author": 261101,
      "replies": []
    },
    {
      "id": "hv2y5gy",
      "text": "I’m of Irish decent, may I return home?",
      "timestamp": "2022-02-01 02:40:59",
      "score": 1,
      "num_children": 0,
      "author": 208961,
      "replies": []
    },
    {
      "id": "hv2zbwc",
      "text": "👏🏻👏🏻👏🏻Cheers for you, Ireland! \n\n🇮🇪❤️🇨🇴",
      "timestamp": "2022-02-01 02:49:30",
      "score": 1,
      "num_children": 0,
      "author": 291025,
      "replies": []
    },
    {
      "id": "hv2zm1b",
      "text": "What a terribly written article",
      "timestamp": "2022-02-01 02:51:30",
      "score": 1,
      "num_children": 0,
      "author": 76962,
      "replies": []
    },
    {
      "id": "hv2zsin",
      "text": "What’s it gonna take to emigrate to Ireland?",
      "timestamp": "2022-02-01 02:52:48",
      "score": 1,
      "num_children": 0,
      "author": 203789,
      "replies": []
    },
    {
      "id": "hv3354u",
      "text": "Who is it? Like It?????",
      "timestamp": "2022-02-01 03:17:50",
      "score": 1,
      "num_children": 0,
      "author": 49397,
      "replies": []
    },
    {
      "id": "hv37dk8",
      "text": "Religion is evil.",
      "timestamp": "2022-02-01 03:50:27",
      "score": 1,
      "num_children": 0,
      "author": 376608,
      "replies": []
    },
    {
      "id": "hv38nyd",
      "text": "Fuck yeah, go Ireland!",
      "timestamp": "2022-02-01 04:00:41",
      "score": 1,
      "num_children": 0,
      "author": 15644,
      "replies": []
    },
    {
      "id": "hv39aoc",
      "text": "Love it!",
      "timestamp": "2022-02-01 04:05:49",
      "score": 1,
      "num_children": 0,
      "author": 205008,
      "replies": []
    },
    {
      "id": "hv39nhr",
      "text": "That needs to happen in Canada too.",
      "timestamp": "2022-02-01 04:08:43",
      "score": 1,
      "num_children": 0,
      "author": 348915,
      "replies": []
    },
    {
      "id": "hv3do47",
      "text": "It said? Ireland? Did someone interview the country of Ireland and the country spoke like a person?",
      "timestamp": "2022-02-01 04:42:42",
      "score": 1,
      "num_children": 0,
      "author": 225505,
      "replies": []
    },
    {
      "id": "hv3g0vd",
      "text": "*But of course all the decisions of that officer would have to be ratified at a special bi-weekly meeting by a simple majority in the case of internal affairs, or a 2/3 majority in the case of more major issues...*",
      "timestamp": "2022-02-01 05:03:27",
      "score": 1,
      "num_children": 0,
      "author": 167686,
      "replies": []
    },
    {
      "id": "hv47xi3",
      "text": "How I wish it happened here, in my brainwashed, religious country...",
      "timestamp": "2022-02-01 10:33:57",
      "score": 1,
      "num_children": 0,
      "author": 321850,
      "replies": []
    },
    {
      "id": "hv49iy3",
      "text": "I wish other countries could see the damage done by the Catholic religion and do the same thing.  They are criminal organization that needs to be dismantled.",
      "timestamp": "2022-02-01 10:54:25",
      "score": 1,
      "num_children": 0,
      "author": 259252,
      "replies": []
    },
    {
      "id": "hv4m87l",
      "text": "  \nThis story was written by one of those English muppets in the north.  Amach amach, Ireland is for the Irish!",
      "timestamp": "2022-02-01 13:08:46",
      "score": 1,
      "num_children": 0,
      "author": 330648,
      "replies": []
    },
    {
      "id": "hv4ml7w",
      "text": "O boy...what'll Belfast say?",
      "timestamp": "2022-02-01 13:11:55",
      "score": 1,
      "num_children": 0,
      "author": 229068,
      "replies": []
    },
    {
      "id": "hv4pumw",
      "text": "Great to see, too.",
      "timestamp": "2022-02-01 13:39:00",
      "score": 1,
      "num_children": 0,
      "author": 14301,
      "replies": []
    },
    {
      "id": "hv5hew3",
      "text": "**Question:** Which side won the Irish War of Independence?\n\n**Answer:** The Catholic Church!!",
      "timestamp": "2022-02-01 16:44:40",
      "score": 1,
      "num_children": 0,
      "author": 281448,
      "replies": []
    },
    {
      "id": "hv8axkp",
      "text": "Evangelical/Fundie Christians be like: \"Yes, evil pagan Catholics are losing their influence\"\n\n(finds out that the Irish are becoming more non-religious)\n\nEvangelical/Fundie Christians: NO NOT LIKE THAT",
      "timestamp": "2022-02-02 03:44:07",
      "score": 1,
      "num_children": 0,
      "author": 408587,
      "replies": []
    },
    {
      "id": "hv8xs2q",
      "text": "Translation: The church is going down and we're not going down with them......",
      "timestamp": "2022-02-02 07:14:07",
      "score": 1,
      "num_children": 0,
      "author": 106178,
      "replies": []
    },
    {
      "id": "hvo3jwj",
      "text": "Then make your own schools",
      "timestamp": "2022-02-05 06:27:27",
      "score": 1,
      "num_children": 0,
      "author": 319755,
      "replies": []
    },
    {
      "id": "hvo3mjk",
      "text": "Ireland still majority Catholic take the L",
      "timestamp": "2022-02-05 06:28:16",
      "score": 1,
      "num_children": 0,
      "author": 319755,
      "replies": []
    },
    {
      "id": "hw3om2y",
      "text": "This is dum, theyre just normal kids....this is for creeps",
      "timestamp": "2022-02-08 16:53:13",
      "score": 1,
      "num_children": 0,
      "author": 262007,
      "replies": []
    },
    {
      "id": "hwdjbmp",
      "text": "Who said?",
      "timestamp": "2022-02-10 15:19:03",
      "score": 1,
      "num_children": 0,
      "author": 172583,
      "replies": []
    },
    {
      "id": "hxrj5t1",
      "text": "GOOD!!!",
      "timestamp": "2022-02-20 23:21:06",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv13l30",
      "text": "Lmfao what bs Ireland is more than 3/4 Irish \n\nY’all obsessed with wiping religion away it’s sad. Can’t be atheists and still allow religion to exist",
      "timestamp": "2022-01-31 19:08:49",
      "score": -7,
      "num_children": 2,
      "replies": [
        {
          "id": "hv1de5y",
          "text": "This is the dumbest take. Catholics make dtupid and  ignorant political decisions, not to mention the catholic church actively supporting pedophiles. Religion isn't being wiped away, people are just slowly coming to their senses.",
          "timestamp": "2022-01-31 20:10:06",
          "score": 5,
          "num_children": 1,
          "replies": [
            {
              "id": "hv1dvai",
              "text": "[removed]",
              "timestamp": "2022-01-31 20:13:06",
              "score": -2,
              "num_children": 2,
              "replies": [
                {
                  "id": "hv1egcb",
                  "text": "Yes catholic individuals support pedophiles and make political decisions for your government. Are you dumb? Have you ever supported the Catholic church in any way? Then you support pedophiles. And we are literally talking on a post about removing political influence of catholics. Learn to read next time you comment.",
                  "timestamp": "2022-01-31 20:16:48",
                  "score": 5,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "hv1ewo3",
                      "text": "Lol.\n\nHave you ever voted? Or supported who you’ve voted for? If you’re American, then the people you voted for all send bomb strikes to the Middle East and you are supporting the genocide of thousands of people.\n\nThat’s not how that works. You can be support something and still be against other parts of it. \n\nDoes that mean that Muslims are all supporters of killing Gay people? Do you honestly believe that?",
                      "timestamp": "2022-01-31 20:19:39",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "hv1ff9a",
                      "text": "If you support getting rid of religions does that mean you support Hitler by your logic since he was an atheist and hated Christian’s and Jews?",
                      "timestamp": "2022-01-31 20:22:50",
                      "score": -1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hv1htlo",
                          "text": " Nice \n\nEveryone that disagrees with me is literally hitler™\n\nHitler hated christian's what? What did christian do",
                          "timestamp": "2022-01-31 20:37:58",
                          "score": 3,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hv1mgp4",
                              "text": "Smh people like you are so m uneducated.\n\nPeople hate christians places, especially Catholics. That’s why you see people in the west hating on Catholics bc they’re a minority.\n\n\nHating religion and intolerance will lead you to Hitler path. Not obviously killing people but a similar mentality. \n\nhttps://www.washingtonpost.com/history/2019/04/20/hitler-hated-judaism-he-loathed-christianity-too/\n\n“In Hitler’s eyes Christianity was a religion fit only for slaves,” wrote Alan Bullock “Hitler, A Study in Tyranny,” a seminal biography. “Its teaching, he declared, was a rebellion against the natural law of selection by struggle of the fittest.”\n\nAnd here’s a few attacks and murders of Catholics, modern day and older huge ones.\n\nhttps://amp.cnn.com/cnn/2019/05/12/africa/burkina-faso-church-attack/index.html\n\nhttps://www.catholicnewsagency.com/amp/news/248547/report-17-christians-killed-every-day-in-nigeria-in-first-half-of-2021\n\nhttps://amp.theguardian.com/world/2019/may/02/persecution-driving-christians-out-of-middle-east-report\n\nhttps://en.m.wikipedia.org/wiki/1860_civil_conflict_in_Mount_Lebanon_and_Damascus\n\nLook into anthropology. Religions have to do with culture and actively being against religions is against the cultures. I respect Hinduism, Buddhism, Judaism and Islam. I think they’re beautiful. I especially think Buddhism and Indigenous religions are beautiful. You can be against the anti lgbt sentiments in some religions and the corruption or issues within it and still not say it’s trash. \n\nBut if you say all Catholics support pedophiles you’re spreading hate and divisiveness. You shouldn’t want Catholicism to crumble you should want it to improve and modernize. Like you shouldn’t want the USA to crumble, you should want it to do better",
                              "timestamp": "2022-01-31 21:06:52",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hv2ee1x",
                  "text": "Saying that countries like Saudi Arabia and Pakistan are ruled by islamists really isn't a hot take.",
                  "timestamp": "2022-02-01 00:14:20",
                  "score": 3,
                  "num_children": 1,
                  "author": 163644,
                  "replies": [
                    {
                      "id": "hv2eliw",
                      "text": "No? When did I say that??? Look at my links.\n\n“Catholics have been murdered”\n\n“Well that isn’t a surprise it’s minority” like wow atheists and their empathy",
                      "timestamp": "2022-02-01 00:15:50",
                      "score": 0,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hv21i7k",
          "text": "Catholicism is effectively dying in Ireland. I'm Irish, churches are empty except at christmas or easter. 20% of Irish priests have died in the last 3 years. Secular weddings are growing at an exponential rate. Divorce, Gay marriage and abortion have all been legalised by referendum in the last 25 years (Gay marriage and abortion by very large majorities). You mention below that 75% of Irish people are catholic but that number is down from almost 90% two decades ago.",
          "timestamp": "2022-01-31 22:44:13",
          "score": 1,
          "num_children": 1,
          "author": 313954,
          "replies": [
            {
              "id": "hv2zfgh",
              "text": "Didn't you hear him? Irish = Catholic, no exception.\n\n/s\n\nThat guy has nationality and religion so thoroughly tangled he'll never be able to figure it out.",
              "timestamp": "2022-02-01 02:50:12",
              "score": 3,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hv13x28",
      "text": "Probably gonna be Islamic, with Sharia law.  \n\nI'll miss the Jameson's.",
      "timestamp": "2022-01-31 19:10:55",
      "score": -8,
      "num_children": 3,
      "author": 266300,
      "replies": [
        {
          "id": "hv2ijsw",
          "text": "Stop pluralising it, the drink is called jameson, not bloody jamesons, grids my fing gears when people say, can I've a jamesons. How about cokes and a fantas",
          "timestamp": "2022-02-01 00:47:10",
          "score": 3,
          "num_children": 1,
          "author": 367485,
          "replies": [
            {
              "id": "hv52p7l",
              "text": "Check your spelling and grammar.  Without the  '  , its wrong, with the  '  , its acceptable.",
              "timestamp": "2022-02-01 15:11:55",
              "score": 1,
              "num_children": 1,
              "author": 266300,
              "replies": [
                {
                  "id": "hv56xjy",
                  "text": "No its not its called Jameson. Never jamesons, nor is it called tescos or. Marks and spencers, hate when people pluralise stuff for no reason, like aldis and lidls",
                  "timestamp": "2022-02-01 15:39:33",
                  "score": 1,
                  "num_children": 0,
                  "author": 367485,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hv1t6it",
          "text": "Stay out then, we don’t want attitudes such as yours.",
          "timestamp": "2022-01-31 21:49:37",
          "score": 2,
          "num_children": 0,
          "author": 217605,
          "replies": []
        },
        {
          "id": "hv4n4y5",
          "text": "In 2001 when the UK census came out I remember reading a blog that predicted that, because of the small increase in the number of people who gave their religion as Muslim, within ten years the UK would be \"Britainistan\", overrun by Muslims and under sharia law. \n\nI remember this only because the blogger was so fragile that when I left a comment to explain why this almost certainly wouldn't happen, he deleted it. Twice.\n\nWell, here we are 20 years later and no sane person would argue that the UK is any kind of \"Britainistan\", so it's safe to describe that swivel-eyed old blogger as an ignorant reactionary bigot. \n\nAh, the early 2000s. We've come a long way.",
          "timestamp": "2022-02-01 13:16:31",
          "score": 1,
          "num_children": 0,
          "author": 300607,
          "replies": []
        }
      ]
    },
    {
      "id": "hv0lyal",
      "text": "Hell yeah, now closely watch the crime rate.",
      "timestamp": "2022-01-31 17:20:58",
      "score": -3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv15ne0",
      "text": "disgusting",
      "timestamp": "2022-01-31 19:21:43",
      "score": -3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv0i44n",
      "text": "Holy KEK",
      "timestamp": "2022-01-31 16:57:25",
      "score": -2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv17s1w",
      "text": "”It said in a statement” - who is *it* in this context?",
      "timestamp": "2022-01-31 19:35:08",
      "score": -2,
      "num_children": 1,
      "author": 364805,
      "replies": [
        {
          "id": "hv1awfo",
          "text": "It is really amazing the things you can learn just by reading the linked article,.",
          "timestamp": "2022-01-31 19:54:31",
          "score": 3,
          "num_children": 0,
          "author": 322687,
          "replies": []
        }
      ]
    },
    {
      "id": "hv1lbds",
      "text": "[removed]",
      "timestamp": "2022-01-31 20:59:47",
      "score": -2,
      "num_children": 2,
      "replies": [
        {
          "id": "hv1z4oc",
          "text": "Coming from the r/conspiracy anti-vaxxer.",
          "timestamp": "2022-01-31 22:28:28",
          "score": 2,
          "num_children": 0,
          "author": 62120,
          "replies": []
        },
        {
          "id": "hv2epnm",
          "text": "Gotta love religious folk who think they have a monopoly on morality.",
          "timestamp": "2022-02-01 00:16:40",
          "score": 1,
          "num_children": 0,
          "author": 163644,
          "replies": []
        }
      ]
    },
    {
      "id": "hv2uxr9",
      "text": "Atheism cringe, catholic Ireland based, or better then Protestant north Ireland",
      "timestamp": "2022-02-01 02:17:56",
      "score": -2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv1f5p0",
      "text": "My parents immigrated here to the America from Ireland about 75 years ago along with 90% of their siblings. My parents were great people but they were super religious super Catholic, and whenever I went back to Ireland it amazed me how they mixed a partying lifestyle with this very devout Catholicism. Now it's like things are flip-flopping in each country and I think maybe it's time that I went back to the old country",
      "timestamp": "2022-01-31 20:21:12",
      "score": -1,
      "num_children": 0,
      "author": 41463,
      "replies": []
    },
    {
      "id": "hv1jl26",
      "text": "Wait. Ireland simply *doesn't have* a public school system? How the hell did they get admitted to the EU?",
      "timestamp": "2022-01-31 20:48:57",
      "score": -1,
      "num_children": 2,
      "author": 260534,
      "replies": [
        {
          "id": "hv1kb71",
          "text": "I mean in practice it does have a public school system, but was just one that was to a large degree started by the church, and is often still on land owned by the church. But teachers are paid by the government and there are fewer and fewer nuns and Christian brothers in charge of the schools.",
          "timestamp": "2022-01-31 20:53:27",
          "score": 1,
          "num_children": 0,
          "author": 228376,
          "replies": []
        },
        {
          "id": "hv1uv9g",
          "text": "We do. The schools may have a catholic ethos as they were founded by catholic orders decades ago, but the teachers are all non priest/nun lay people. I went to a Catholic school (Marist Brothers founded it) and we had protestant and muslim kids in my year. Our religion classes (40 mins once a week) were spent watching movies or having table quizzes. We had sex education where contraceptives were recommended too. This was 20+ years ago.",
          "timestamp": "2022-01-31 22:00:27",
          "score": 1,
          "num_children": 1,
          "author": 86470,
          "replies": [
            {
              "id": "hv1zma5",
              "text": "OK, but are there schools where religion isn't an issue in any way? As in, no religion classes, and the religion of the students really doesn't come up much, if at all?",
              "timestamp": "2022-01-31 22:31:41",
              "score": 1,
              "num_children": 0,
              "author": 260534,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hv2g48h",
      "text": "Ah it isn't so bad in Ireland. If you're a yank you probably have a more Old Testament idea of what it's like in a \"Catholic School\". \n\n\nReally it's just you say a prayer when you get in, before you eat, and before you go home. This is Primary Schooling from 4-12 years old. You will usually learn a parable during the week (prodigal son...etc) or some  songs.\n\n\nThen the school organises your First Communion for when you are 8, and your Confirmation for when you are 12 which are big enough religious events. They're more treated as a reason to throw a party for the adults and hire out a bouncy castle for the kids.\n\n\nWhen you arrive into the Secondary Schooling from 13-17/18 religion becomes a twice a week class. It stops being a Catholic thing and becomes a thing about world religions. You learn about the structure of other religions and how it affects people's cultures. Usually it involves getting speakers in for different religions and field trips to any places of worship. (Synagogue, Mosque, etc...)\n\n\nQuite generally the problem is that Catholic Primary Schools are just way better than non-Catholic ones because they have much better support and better funding. This means that parents will try their hardest to get their children into them. I've heard of it happening where a protestant family from England would get their child baptised to ensure they are guaranteed a spot. But it's also very frequent that if their is for example enough Muslim children then they will usually be taken out and taught their own stuff.\n\n\nThe Catholic Church lost major credibility because of the huge pedophile scandal and young people generally voting against their most oppressive laws. The only ones that are effecting young people is Alcohol sale times which I don't give a shite about really.",
      "timestamp": "2022-02-01 00:28:06",
      "score": -1,
      "num_children": 0,
      "author": 413370,
      "replies": []
    }
  ]
}