{
  "id": "si301f",
  "text": "Feminism summed up in a single image\n",
  "timestamp": "2022-02-01 19:16:47",
  "score": 542,
  "subreddit": "t5_2zaj2",
  "num_children": 10,
  "author": 217945,
  "replies": [
    {
      "id": "hv6fl8r",
      "text": "They want to cherry pick equality. Special privileges and opt outs for them. Special laws and punishments for us.",
      "timestamp": "2022-02-01 20:14:27",
      "score": 30,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv6e6sd",
      "text": "They want female supremacy",
      "timestamp": "2022-02-01 20:05:37",
      "score": 55,
      "num_children": 4,
      "replies": [
        {
          "id": "hv6fvd0",
          "text": "They can want all they like, sooner or later they're going to have to back up their bullshit.",
          "timestamp": "2022-02-01 20:16:11",
          "score": 14,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hvbw9b9",
          "text": "What they'll get is bred out of existence. Lol",
          "timestamp": "2022-02-02 21:20:57",
          "score": 1,
          "num_children": 0,
          "author": 402389,
          "replies": []
        },
        {
          "id": "hx1dcqv",
          "text": "Alright, ok, NO.\n\n Feminism is a \"Doctrine that advocates equality between men and women, and the extension of the role of women in society\". \n\nWomen who want female supremacy are not feminists. They're female supremacists.",
          "timestamp": "2022-02-15 14:22:34",
          "score": 1,
          "num_children": 0,
          "author": 61249,
          "replies": []
        },
        {
          "id": "hv6kvyn",
          "text": "No we don’t. Why do you think this lol so stupid",
          "timestamp": "2022-02-01 20:47:18",
          "score": -53,
          "num_children": 6,
          "author": 29826,
          "replies": [
            {
              "id": "hv6yjnb",
              "text": "Because men have no legal privileges over women (in USA at least). You can try naming examples of legal privileges that men have. They do not exist.",
              "timestamp": "2022-02-01 22:11:10",
              "score": 35,
              "num_children": 1,
              "author": 105852,
              "replies": [
                {
                  "id": "hv8x5zm",
                  "text": "Men have so many privileges over women are you insane",
                  "timestamp": "2022-02-02 07:06:44",
                  "score": -16,
                  "num_children": 2,
                  "author": 29826,
                  "replies": [
                    {
                      "id": "hv967u3",
                      "text": "Go ahead, name them",
                      "timestamp": "2022-02-02 09:01:17",
                      "score": 7,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hv9692b",
                          "text": "https://projecthumanities.asu.edu/content/male-privilege-checklist",
                          "timestamp": "2022-02-02 09:01:44",
                          "score": 1,
                          "num_children": 2,
                          "author": 29826,
                          "replies": [
                            {
                              "id": "hv9fm27",
                              "text": "What a crock of shit, every single claimed privilege in there is nothing more than assumptions and probably wrapped in a bunch of maybes none of which is actually a privilege of any sort. \n\nLet's take just one of the so called privileges, not being raped, bullshit, rape as a crime for women, something women suffer across the western world for the last 10 years has been falling, while for men and boys being raped or sexually assaulted by both men and women is rising and rising in some areas it's the fastest growing crime with women being the main perpetrators of the crime. \n\nFucking moron, try looking for actual data not bullshit feminist rhetoric.",
                              "timestamp": "2022-02-02 11:02:37",
                              "score": 11,
                              "num_children": 1,
                              "author": 227190,
                              "replies": [
                                {
                                  "id": "hv9izr0",
                                  "text": "Everything on this list is empirically backed lol, it’s all from psychological studies. What are you talking about? Rape cases are drastically increasing, 1 in 5 women have been harassed/assaulted and 99% of perpetrators are men. If you looked at the actual data you’d know how fucking stupid you sound lol",
                                  "timestamp": "2022-02-02 11:42:29",
                                  "score": -1,
                                  "num_children": 2,
                                  "author": 29826,
                                  "replies": [
                                    {
                                      "id": "hv9jjyu",
                                      "text": "Being harassed and even assaulted is not being raped, fart rape is not rape, eye rape is not rape, rape proven in a court of law is rape fucking moron. \n\nIf you knew half of what you claim you'd be at least half awake, sadly you rely on studies done where there is no peer review, psychological studies where self identification is the gold standard meaning not one shred of evidence out forward can be counted as reliable by any stretch of the imagination.",
                                      "timestamp": "2022-02-02 11:48:43",
                                      "score": 9,
                                      "num_children": 1,
                                      "author": 227190,
                                      "replies": [
                                        {
                                          "id": "hv9k05i",
                                          "text": "Being harassed and assaulted is bad though…? And it’s an extremely prevalent problem among women and any attempts by us to speak out about it is met with angry incels saying we deserved it or are lying. Rape culture is oppression. You’re assuming a lot lol, I’m literally in the stem field and study psychology, I know what I’m talking about",
                                          "timestamp": "2022-02-02 11:53:33",
                                          "score": 0,
                                          "num_children": 3,
                                          "author": 29826,
                                          "replies": [
                                            {
                                              "id": "hv9khkd",
                                              "text": "But it's not rape you fucking moron stop trying to compare the two",
                                              "timestamp": "2022-02-02 11:58:52",
                                              "score": 4,
                                              "num_children": 1,
                                              "author": 227190,
                                              "replies": [
                                                {
                                                  "id": "hv9ksqi",
                                                  "text": "They all fall under rape culture. Which feminists are trying to abolish lol, how anyone can have a problem with that I’ll never understand",
                                                  "timestamp": "2022-02-02 12:02:12",
                                                  "score": 3,
                                                  "num_children": 2,
                                                  "author": 29826,
                                                  "replies": [
                                                    {
                                                      "id": "hva12gt",
                                                      "text": "Your claim of rape culture is also totally asinine and false, first rape is an horrific crime that nobody should ever have to experience let alone live with afterwards, second any man accused of rape is crucified through two courts, first the court of public opinion and second the court of the land.\n\nYour argument bases itself on the false premise that evidence should not be challenged in an open court, evidence or the bar of evidence is too high. \n\nBut you have no solid acceptable arguements that you can possibly make to propose a solution to your fantasy problem, other than to say believeallwomen. \n\nBelief is fine but evidence is what counts, unless of course you're actually going to say evidence should have nothing to do with it in which case I accuse you of being a rapist and child molester and because I identify as a woman I am to be believed and I now require no evidence to support my claims.",
                                                      "timestamp": "2022-02-02 14:20:59",
                                                      "score": 5,
                                                      "num_children": 1,
                                                      "author": 227190,
                                                      "replies": [
                                                        {
                                                          "id": "hvbz1lo",
                                                          "text": "Just a bystander here… She *still* hasn’t answered your first question, which was to provide a legal benefit men have that women don’t. LOL",
                                                          "timestamp": "2022-02-02 21:37:31",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 332706,
                                                          "replies": [
                                                            {
                                                              "id": "hvc4jdx",
                                                              "text": "And that is a fair point. Thanks for keeping us on track.",
                                                              "timestamp": "2022-02-02 22:11:14",
                                                              "score": 1,
                                                              "num_children": 0,
                                                              "author": 227190,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    },
                                                    {
                                                      "id": "hv9m948",
                                                      "text": "We don't live in a rape culture. Rapists are harshly punished by the court of law, male rapists serve longer terms than female rapists, and just the accusation of rape is enough to ruin a man's life. If you need an example of that last one, Brett Kavanaugh. Tell me, how the fuck is there a rape culture?",
                                                      "timestamp": "2022-02-02 12:17:18",
                                                      "score": 3,
                                                      "num_children": 1,
                                                      "author": 105852,
                                                      "replies": [
                                                        {
                                                          "id": "hv9mrue",
                                                          "text": "Bro 2/3 rape cases go unreported, and the incarceration rates for rapists are extremely low, only 25 out of every 1000 sexual assault perpetrators will go to jail \n\nhttps://www.rainn.org/statistics/criminal-justice-system\n\nI don’t see how you can say the accusation of rape can ruin a mans life when the statistics show that in actual cases of rape and assault, the perpetrator rarely sees any consequences",
                                                          "timestamp": "2022-02-02 12:22:28",
                                                          "score": 2,
                                                          "num_children": 1,
                                                          "author": 29826,
                                                          "replies": [
                                                            {
                                                              "id": "hv9nf39",
                                                              "text": "How do we know they happen if they'r unreported? The moment law enforcement know they happen, they get reported. Also if people don't report that they've been raped, they're only contributing to their own suffering. As for incarceration rates, a lot of rape cases are difficult to judge because they're reduced to he-said she-said arguments.  It's very possible legitimate racists get let go because there isn't enough evidence to accuse, but I also don't want innocent people getting locked up because of false accusations",
                                                              "timestamp": "2022-02-02 12:28:55",
                                                              "score": 3,
                                                              "num_children": 1,
                                                              "author": 105852,
                                                              "replies": [
                                                                {
                                                                  "id": "hv9o9ka",
                                                                  "text": "Because people have studied this. Most women don’t report the rape because of the very low incarceration rate, it’s not worth the trauma of having to go through the legal process where you’re constantly questioned, accused of lying etc and in the end it’s only a 17% chance of the rapist being convicted. False rape accusations only make up 2-10% of all allegations, as a man you’re statistically more likely to be raped yourself than falsely accused.",
                                                                  "timestamp": "2022-02-02 12:37:10",
                                                                  "score": 2,
                                                                  "num_children": 3,
                                                                  "author": 29826,
                                                                  "replies": [
                                                                    {
                                                                      "id": "hva9hqc",
                                                                      "text": "> False rape accusations only make up 2-10% of all allegations\n\nNo. Only 2-10% of accusations are proven true. Only 2-10% of accusations are proven to be either false or an accurate description of a noncriminal event. Anyone claiming the remaining 80%+ are all true or all false is being disingenuous. There isn't enough evidence to know what happened in those cases.\n\n> a man you’re statistically more likely to be raped yourself than falsely accused.\n\nOn one hand, you are talking falsely accused to the police. Friend group, workplace, school, social media, etc accusations don't count as accusations but will still cause a lot of distress.\n\nOn the other hand you also ignore the fact that most raped men are raped by women and it isn't counted as rape.\n\nSo I think your statement is probably still correct but in bad faith on multiple fronts.",
                                                                      "timestamp": "2022-02-02 15:18:24",
                                                                      "score": 2,
                                                                      "num_children": 0,
                                                                      "author": 65062,
                                                                      "replies": []
                                                                    },
                                                                    {
                                                                      "id": "hva1b49",
                                                                      "text": "If they don't report it then two things arise first your data is false and second I'd argue that it is reported, if a woman goes to the hospital to get a rape kit done then it must be reported by medical staff to the relevant people, so not only is your assertion false but your premise is also false.",
                                                                      "timestamp": "2022-02-02 14:22:39",
                                                                      "score": 1,
                                                                      "num_children": 0,
                                                                      "author": 227190,
                                                                      "replies": []
                                                                    },
                                                                    {
                                                                      "id": "hvardls",
                                                                      "text": "This is a holy war that will never end. \n\nI agree with both sides. Both men and women are fucking raving morons.",
                                                                      "timestamp": "2022-02-02 17:08:47",
                                                                      "score": 1,
                                                                      "num_children": 0,
                                                                      "replies": []
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "hv9z04u",
                                              "text": "Stop it. Get some help.",
                                              "timestamp": "2022-02-02 14:06:04",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 167310,
                                              "replies": []
                                            },
                                            {
                                              "id": "hvaw2xz",
                                              "text": "You sound like an entitled SJW halfway through undergrad, blind to your own privilege, 19 with zero life experience and not half a clue what the fuck you're talking about. Those numbers are seriously fucking skewed so please do some research outside of a biased classroom before you come here speaking on real world matters. Go fix your clown makeup, get back in your tiny little clown car with all your other shitty little warriors and pull up somewhere else. Like the bottom of a canyon for example, it'd be a much more productive effort.",
                                              "timestamp": "2022-02-02 17:37:19",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 93185,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "hva7z45",
                                      "text": "Ahhh you see we do know the stats and who manipulated them. That's why we are anti-feminist. You either don't know the background or just ignore it to hate men. Either way, you sound like a sexist moron to those of us who are educated on rape statistics.\n\n\nFor statistical reporting, rape has been carefully defined as forced *penetration of the victim* in most of the world. Please listen to this feminist professor Mary P Koss explain that a woman raping a man isn't rape. Hear her explain in her own voice just a few years ago - https://clyp.it/uckbtczn.  I encourage you to listen to what she is saying.  (Really.  Listen to it! Think about it from a man's perspective.)\n\nShe is considered the foremost expert on sexual violence in the US.  **She is the one that started the 1 in 4 American college women is sexually assaulted myth by counting all sorts of things the \"victims\" didn't.**  A man misinterpreting a situation going in for a kiss and then backing off when she pulls back, puts up her hand, or turns her cheek is counted as a sexual assault on a woman even if she doesn't think it was.  **As you hear in her own words the woman's studies professor and trusted expert that literally wrote the book on measuring prevalence of sexual violence does not call a woman drugging and riding a man bareback rape ... or even label it sexual assault ... it is merely \"unwanted contact\"** \n\nYou see she has been saying this for decades **and** was instrumental in creating the methodologies most (including the US and many other government agencies around the world) use for gathering rape statistics.  E.g. \n\nDetecting the Scope of Rape : A Review of Prevalence Research Methods. Author: Mary P. Koss. Journal of Interpersonal Violence Volume: 8 Issue: 2 Dated: (**June 1993**) Page: 206\n\n> > > Although consideration of male victims is within the scope of the legal statutes, **it is important to restrict the term rape to instances where male victims were penetrated by offenders. It is inappropriate to consider as a rape victim a man who engages in unwanted sexual intercourse with a woman.**\n\nSrc: http://boysmeneducation.com/wp-content/uploads/2014/01/Koss-1993-Detecting-the-Scope-of-Rape-a-review-of-prevalence-research-methods-see-p.-206-last-paragraph.pdf\n\nShe is an advisor to the CDC, FBI, Congress, and researchers around the world and promoting the idea that men cannot be raped by women.  There **was** a proposal to explicitly include forced envelopment in the latest FBI update to the definition of rape but after a closed door meeting with her and N.O.W. lobbiests, it mysteriously disappeared.  She has many many followers and fellow researchers that follow her methodology and quote her studies.  That is where most people get the idea rape is just a man on woman crime.  Men are fairly rarely penetrated and it is almost always by another man.\n\nMost people talking about sexual violence refer to the \"rape\" (penetrated) numbers as influenced by Mary Koss's methodologies, but in the US the CDC also gathered the data for \"made to penetrate\" (enveloped) in the 2010, 2011, 2012, and 2015 NISVS studies.\n\nAs an example lets look at the 2011 survey numbers:\nhttps://www.cdc.gov/mmwr/preview/mmwrhtml/ss6308a1.htm\n\n> **an estimated 1.6% of women (or approximately 1.9 million women) were raped in the 12 months before taking the survey**\n\nand\n\n> The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\n\nvs\n\n> **an estimated 1.7% of men were made to penetrate a perpetrator in the 12 months preceding the survey**\n\nand \n\n> Characteristics of Sexual Violence Perpetrators\n**For female rape victims, an estimated 99.0% had only male perpetrators**. In addition, an estimated 94.7% of female victims of sexual violence other than rape had only male perpetrators. For male victims, the sex of the perpetrator varied by the type of sexual violence experienced. **The majority of male rape victims (an estimated 79.3%) had only male perpetrators**. For three of the **other forms of sexual violence, a majority of male victims had only female perpetrators: being made to penetrate (an estimated 82.6%)**, sexual coercion (an estimated 80.0%),\n\nSo if made to penetrate happens each year as much as rape then by most people's assumed definition of rape then men are half of rape victims.  **If 99% of rapists are men and 83% of \"made to penetrators\" are women ... then an estimated 42% of the perpetrators of nonconsensual sex in 2011 were women.**\n\nBut since made to penetrate is not rape, the narrative is that men are rapists and women are victims and boys/men that are victims are victims of men. Therefore most of the gender studies folks create programs to teach men not to rape (e.g. /r/science/comments/3rmapx/science_ama_series_im_laura_salazar_associate/).  Therefore there is justification for having gendered rape support services which means almost none for males victimized by females.  **These misleading stats are ammo to tell men to shut up about rape because 1 in 5 women are raped vs \"only\" 1 in 71 men** and dismiss raped men because men are one group \"nearly all the men were raped by other men\" so somehow raped men are to blame because they are men...\n\nAnd before you think that was just one study, it wasn't.  The prior year numbers have been really close between the sexes most years.\n\n\n2010 survey results - \nhttps://www.cdc.gov/violenceprevention/pdf/cdc_nisvs_ipv_report_2013_v17_single_a.pdf\n\n2012 survey results -\nhttps://www.cdc.gov/violenceprevention/pdf/NISVS-StateReportBook.pdf\n\n2015 survey results - \nhttps://www.cdc.gov/violenceprevention/pdf/2015data-brief508.pdf\n\nScientific American - https://www.scientificamerican.com/article/sexual-victimization-by-women-is-more-common-than-previously-known\n\n*data revealed that over one year, men and women were equally likely to experience nonconsensual sex, and most male victims reported female perpetrators. Over their lifetime, 79 percent of men who were “made to penetrate” someone else (a form of rape, in the view of most researchers) reported female perpetrators. Likewise, most men who experienced sexual coercion and unwanted sexual contact had female perpetrators.*\n\nAnd non CDC study...\n\n*A recent study of youth found, strikingly, that females comprise 48 percent of those who self-reported committing rape or attempted rape at age 18-19.*\n\nThe Atlantic - https://www.theatlantic.com/science/archive/2016/11/the-understudied-female-sexual-predator/503492/\n\nAnother non CDC study...\n\n*a 2014 study of 284 men and boys in college and high school found that 43 percent reported being sexually coerced, with the majority of coercive incidents resulting in unwanted sexual intercourse. Of them, 95 percent reported only female perpetrators.*\n\nAnd another non CDC study...\n\n*National Epidemiologic Survey on Alcohol and Related Conditions found in a sample of 43,000 adults little difference in the sex of self-reported sexual perpetrators. Of those who affirmed that they had ‘ever forced someone to have sex with you against their will,’ 43.6 percent were female and 56.4 percent were male.”*\n\nTime - http://time.com/3393442/cdc-rape-numbers\n\n*when asked about experiences in the last 12 months, men reported being “made to penetrate”—either by physical force or due to intoxication—at virtually the same rates as women reported rape (both 1.1 percent in 2010, and 1.7 and 1.6 respectively in 2011).*\n\n\nIf my information is not enough, try reading these five threads by problem_redditor with lots more studies and references.\n\nhttps://np.reddit.com/r/MensRights/comments/oc2yp0/some_sources_on_sexual_abuse_of_men_and_boys_part/\n\nJust maybe, rape isn't a gendered issue and we should stop treating it like one.  But if we acknowledge that, then we would have to point the blame at \"rapists\", rather than \"men\".\n\nAnd it isn't just the US.  \n\nFeminists lobbied against gender neutral rape laws in India, so women are not rapists and men victimized by women are not rape victims. https://www.timesofindia.com/india/Activists-join-chorus-against-gender-neutral-rape-laws/articleshow/18840879.cms\n\nSo a woman physically forcing sex on a man is not a rape in India, but a man breaking an engagement after having sex with his fiancee is a rape.\n\nIsraeli feminists were concerned if a woman raping a man was recognized by law, a man could threaten to make false accusations against the woman after the man raped her in order to keep her from reporting. Apparently false accusations are a problem for women, so they fixed this by blocking the legislation that would have made rape a gender neutral crime.\n\nhttps://m.jpost.com/Israel/Womens-groups-Cancel-law-charging-women-with-rape\n\nNepal feminists also blocked legislation there ...\n\n> Women’s rights activists had criticised the draft ordinance saying it wasn’t empathetic towards the plight of the victims. They said that having a provision saying even men could be victims of rape could could further weaken the women rape victims’ fight for justice.\n\nhttps://kathmandupost.com/national/2020/12/11/ordinance-amends-law-on-rape-but-fails-to-recognise-rape-of-boy-child-and-sexual-minorities\n\n**Even if you only care about women, you should still stop women from raping because the majority of men convicted of raping women were sexually violated by adult women when they were boys.**  Multiple studies in the US, UK, and Canada have shown this.  Around 10 of them cited here.\n\nhttp://empathygap.uk/?p=1993#_Toc498111528\n\nSo women not raping, and rape by women being acknowledged as traumatic and treated with compassion, would probably stop a lot of women from getting raped in the future.  That *should* matter *if* the goal is to stop women from getting raped rather than to demonize men",
                                      "timestamp": "2022-02-02 15:08:13",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 65062,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hv9zfbu",
                              "text": "You're brainwashed.",
                              "timestamp": "2022-02-02 14:09:09",
                              "score": 2,
                              "num_children": 0,
                              "author": 167310,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hvb149t",
                      "text": "Ok, I'll bite. Name all the legal rights men have that women don't. After, I'll let you know the legal rights women have that men don't.",
                      "timestamp": "2022-02-02 18:07:53",
                      "score": 1,
                      "num_children": 0,
                      "author": 294229,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hv73gmu",
              "text": "Lol you better come back too",
              "timestamp": "2022-02-01 22:42:41",
              "score": 11,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hv722gu",
              "text": "This has to be the lames attempt to tell a lie that I've ever seen!",
              "timestamp": "2022-02-01 22:33:39",
              "score": 17,
              "num_children": 1,
              "author": 287753,
              "replies": [
                {
                  "id": "hv8y27q",
                  "text": "Why are you assuming I’m lying? Genuinely",
                  "timestamp": "2022-02-02 07:17:30",
                  "score": -6,
                  "num_children": 1,
                  "author": 29826,
                  "replies": [
                    {
                      "id": "hv91hq7",
                      "text": "I didn't said you lied, I just said it's a lame attempt to tell a lie. There's a difference",
                      "timestamp": "2022-02-02 08:00:01",
                      "score": 1,
                      "num_children": 1,
                      "author": 287753,
                      "replies": [
                        {
                          "id": "hv9354o",
                          "text": "That doesn’t make sense bro",
                          "timestamp": "2022-02-02 08:20:53",
                          "score": 1,
                          "num_children": 1,
                          "author": 29826,
                          "replies": [
                            {
                              "id": "hv93k1v",
                              "text": "Feminism doesn't make sense",
                              "timestamp": "2022-02-02 08:26:20",
                              "score": 4,
                              "num_children": 1,
                              "author": 287753,
                              "replies": [
                                {
                                  "id": "hv93kwo",
                                  "text": "How?",
                                  "timestamp": "2022-02-02 08:26:39",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 29826,
                                  "replies": [
                                    {
                                      "id": "hvb18ju",
                                      "text": "Because it's a female supremacy movement.",
                                      "timestamp": "2022-02-02 18:08:38",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 294229,
                                      "replies": [
                                        {
                                          "id": "hvb2qcc",
                                          "text": "It just blatantly isn’t though.",
                                          "timestamp": "2022-02-02 18:17:57",
                                          "score": -1,
                                          "num_children": 1,
                                          "author": 29826,
                                          "replies": [
                                            {
                                              "id": "hvb2vjb",
                                              "text": "Whatever gets you through the night.",
                                              "timestamp": "2022-02-02 18:18:52",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 294229,
                                              "replies": [
                                                {
                                                  "id": "hvb3erl",
                                                  "text": "You’re the delusional one here. Imagine denying blatant societal facts lol",
                                                  "timestamp": "2022-02-02 18:22:09",
                                                  "score": 0,
                                                  "num_children": 0,
                                                  "author": 29826,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hv8b0o5",
              "text": "Just because you don't want it doesn't mean there isn't a lot of people that don't want to be superior just bcs of something like gender, religion...\n\nLike there are plenty of examples of feminists skewing statistics to push the narrative.\n\nLike CDC making separate when rapes someone and when woman rapes someone.\n\nJust Google CDC rape definition.\nBy that definition when a woman fucks a passed out guy it wouldn't be rape.",
              "timestamp": "2022-02-02 03:44:46",
              "score": 11,
              "num_children": 1,
              "author": 180640,
              "replies": [
                {
                  "id": "hv8y8to",
                  "text": "No feminist wants female supremacy. We literally just want equality. Even the most radical of feminists don’t want to oppress men, the most radical idea put forth by feminists is total separation from men. Even the most radical feminists don’t want to rape, abuse, traffic, degrade etc men, that’s just what men want to do to us and you can’t accept that you’re the only ones who think like this.",
                  "timestamp": "2022-02-02 07:19:44",
                  "score": -3,
                  "num_children": 4,
                  "author": 29826,
                  "replies": [
                    {
                      "id": "hvaqtlg",
                      "text": "Oh yeah. \n\nBecause you were appointed to speak for THEM ALL right.",
                      "timestamp": "2022-02-02 17:05:23",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hvavazs",
                          "text": "No I’m just a feminist and have feminist beliefs lol",
                          "timestamp": "2022-02-02 17:32:34",
                          "score": 1,
                          "num_children": 0,
                          "author": 29826,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hvaxccn",
                      "text": "There are plenty of examples of feminists skewing statistics to push the narrative.\n\nLike CDC making separate when rapes someone and when woman rapes someone.\n\nJust Google CDC rape definition.\nBy that definition when a woman fucks a passed out guy it wouldn't be rape.",
                      "timestamp": "2022-02-02 17:44:57",
                      "score": 1,
                      "num_children": 0,
                      "author": 93185,
                      "replies": []
                    },
                    {
                      "id": "hvbb4s1",
                      "text": "You know that CDC doesn't count when women rapes a man as a rape right?\n\nJust Google CDC rape definition. By that definition it wouldn't go into it. This easily skews statistics. Oh and it was heavily pushed by a feminist Marie P. Kerry.\n\nOr the violence against women. Which ignores all the data that show violent women. Like that stuff is even hurting women. When a women notices that she is abusive and tries to seek help she gets told: \"oh your husband just provoked you\"\n\nOr that feminists in India were fighting against gender neutral law. Because it will hurt women.\n\nSame thing happened in Israel. They had plenty of cases where mother raped her own son and couldn't be properly prosecuted because of how the law was made.\n\nLike this stuff is worse than you thought.\n\nI always compare it to communism.\nSounds good on paper but in reality it limps on both legs.",
                      "timestamp": "2022-02-02 19:09:48",
                      "score": 1,
                      "num_children": 1,
                      "author": 180640,
                      "replies": [
                        {
                          "id": "hvfdqiq",
                          "text": "As a feminist I’m against this, feminists are the ones trying to express that men can be raped/abused etc too. It’s the patriarchy that has come up with this idea that men are strong and can’t be abused by a woman.",
                          "timestamp": "2022-02-03 15:03:36",
                          "score": 1,
                          "num_children": 2,
                          "author": 29826,
                          "replies": [
                            {
                              "id": "hvfhsq3",
                              "text": "You know there are feminists and feminists.\n\nLike Marry P. Koss that was trying to push this as much as possible.\n\nLike she is the reason why CDC and FBI have this definition.\n\nLike you cannot throw patriarchy at everything a lot of the times it is done by specific people. Sometimes they are even trying to push their agenda.",
                              "timestamp": "2022-02-03 15:30:02",
                              "score": 2,
                              "num_children": 1,
                              "author": 180640,
                              "replies": [
                                {
                                  "id": "hvfi43m",
                                  "text": "Yes I understand that, but it’s important to recognise that especially in this wave of feminism, we don’t agree with everything every other feminist does or wants. There are many factions of feminism and many waves, each with differing views. This current wave of feminism is critical of people like this",
                                  "timestamp": "2022-02-03 15:32:04",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 29826,
                                  "replies": [
                                    {
                                      "id": "hvfjyh2",
                                      "text": "Well if you want to say that it's critical of those things then you have to explain for example all those movies which are heavily pushed to portray men = bad, woman = good. Oh and there are plenty of them.",
                                      "timestamp": "2022-02-03 15:43:50",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 180640,
                                      "replies": [
                                        {
                                          "id": "hvfkivk",
                                          "text": "Dude have you ever watched a movie? What about how women have consistently been objectified, sexualised, characterised as incompetent, a bitch, or just purely there for decoration. The portrayal of women in media has always been incredibly sexist, so now women are making movies with powerful strong women. Why is that what you’re focusing on instead of how horribly women have always been depicted? Some women are purposefully making “woman good man bad” movies to make the point about how men have always depicted women and how shitty it is, so it’s to draw attention to that issue because unfortunately men won’t see this problem unless it directly effects them",
                                          "timestamp": "2022-02-03 15:47:28",
                                          "score": 0,
                                          "num_children": 1,
                                          "author": 29826,
                                          "replies": [
                                            {
                                              "id": "hvflevm",
                                              "text": "So you are fighting fire with fire.\n\nDo you know what you will have left, only ashes.",
                                              "timestamp": "2022-02-03 15:52:59",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 180640,
                                              "replies": [
                                                {
                                                  "id": "hvfy115",
                                                  "text": "Nothing else works. Men have dismissed feminism the whole time it’s been a thing.",
                                                  "timestamp": "2022-02-03 17:10:09",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 29826,
                                                  "replies": [
                                                    {
                                                      "id": "hvg13ct",
                                                      "text": "At first a lot of men were supporting feminism so this one is not accurate at all.\n\nThis is like black people have it bad so let's complain about white people.\n\nAnd just so you know according to Facebook 90% of all \"hate speech\" is directed towards white people and man.\n\nOh and they turned off automatic deleting for those.\n\nSo example \"kill all white people\" not automatically deleted.\n\nBut \"kill all black people\" will be automatically deleted.",
                                                      "timestamp": "2022-02-03 17:28:33",
                                                      "score": 2,
                                                      "num_children": 1,
                                                      "author": 180640,
                                                      "replies": [
                                                        {
                                                          "id": "hvg1x0v",
                                                          "text": "So you just don’t understand societal oppression and hate speech lol",
                                                          "timestamp": "2022-02-03 17:33:32",
                                                          "score": 0,
                                                          "num_children": 1,
                                                          "author": 29826,
                                                          "replies": [
                                                            {
                                                              "id": "hvg2ytb",
                                                              "text": "I am from post communist country.\n\nWe technically have hate speech. And \"kill all ...\" Is pretty much definition of hate speech.",
                                                              "timestamp": "2022-02-03 17:39:48",
                                                              "score": 2,
                                                              "num_children": 1,
                                                              "author": 180640,
                                                              "replies": [
                                                                {
                                                                  "id": "hvg3t3u",
                                                                  "text": "Yes but a woman saying “kill all men” as a joke and men collectively saying “kill all women”, or “rape all women” was the exact response to this trend, are completely different. When men say “kill/rape all women” it has power behind it because we live in a patriarchy where men have actually and routinely kill and rape women. Whereas women saying “kill all men” as a joke has no actual consequences because women are beneath men socially speaking. Women don’t actually go around killing men like men do to us. It’s punching up vs punching down. And women saying this as a response to being constantly berated under the patriarchy and just being done with it isn’t the same as men just wanting to kill and rape women",
                                                                  "timestamp": "2022-02-03 17:44:47",
                                                                  "score": -1,
                                                                  "num_children": 1,
                                                                  "author": 29826,
                                                                  "replies": [
                                                                    {
                                                                      "id": "hvgewhv",
                                                                      "text": "As I have previously gave you the CDC's statistics for rape.\n\nWomen victims: 1 270 000\n\nMen victims: 1 267 000\n\nOf course that is only when we take into account when women rapes a man that it is a rape aka made to penetrate\n\nOh and most perpetrators against men were woman.\n\nAnd still most murder victims are men, most suicides are men, most work related deaths are men. Like men are dying more than women but hey \"kill all men\" sure like you need to do something to kill more of them.\n\nAnd women don't go around killing men? Well some women do and kill people just as some men go and kill people.\n\nhttps://www.scotsman.com/news/crime/teen-who-murdered-boy-while-pregnant-boasting-about-being-man-hater-549144\n\nProud man-hater killing his boyfriend sure it doesn't happen right?\n\nPunching is still punching.\n\nAnd okay by the same narrative we were the first country to be occupied by Nazi. They even had a plan how to deal with us bcs we were close to Germany plan was like this: those that can be germanalized will be germanalized, those that can't, will be killed, enslaved or kicked out of country.\n\nSo you now knowing the context it will be okay for me to say \"kill all Germans\" but not okay for Germans to say \"kill all Slavs\"\n\nNo both are bad and none should be done or said. Doesn't matter which is worse none should be done.\n\nSame with Russia, we were under communism practically right after WW2, it took around 40 years for communism to end. Then Russia is still doing plenty of bad shit.\n\nRecently it looks like our two ammunition explosions in 2016 might even be done by russian spies.\n\nOr how Russia is planning to invade Ukraine, or how Belarus with support from Russia took plenty of immigrants only to send them to polish border.\n\nAnd still saying \"kill all Russians\" is stupid.\n\nOr when Muslims were going, killing and enslaving Eastern Europeans (propably where the word slave came from \"Slavs\") \n\nIt is still stupid to say \"kill all Muslims\"\n\nSame with Christianity, they came there we were forced to be Christians for a big chunk of history. We had our own religion they often burned the how to call it \"house of religion? Maybe just something like church\" and build the Christian church on its place.\n\nWe had so many fights with crusaders on out territory that it is not imaginable. \n\nBasically for centuries forcing Christianity down our throat by Luxemburgs, and Habsburgs...\n\nAnd still saying \"kill all Christians\" is stupid.\n\nPlus aren't you offended at rape jokes? Like you can joke about killing 50% of the population but men cannot make a rape joke. Plus majority of rape jokes aren't even aimed at women, it is at other men.\n\nTldr; punching is punching, if you are trying to excuse punching then you are the problem",
                                                                      "timestamp": "2022-02-03 18:50:55",
                                                                      "score": 2,
                                                                      "num_children": 1,
                                                                      "author": 180640,
                                                                      "replies": [
                                                                        {
                                                                          "id": "hvggjm6",
                                                                          "text": "Show me a source for these stats, because every source I’ve seen has the same statistics: men are 99% of all perpetrators of sexual violence and 91% of victims are female. That’s more or less universal in most of western society.  \n\n“Most murder victims are men, most suicides are men, most work related deaths are men. Like men are dying more than women but hey kill all men” \n\nOkay, how is that women’s fault? How is that feminism’s fault? Men are the majority of perpetrators of violence and murder, not women. Women attempt suicide more than men, men only have higher suicide rates bc they usually opt for guns, whereas women are more likely to try and overdose. And yet I never see any campaigns for women’s mental health, only ever men’s. Men created the patriarchy and the idea that men shouldn’t express their emotions, which is why so many men lack a good support system and can’t talk about their feelings, leading to depression. That’s men’s fault again, not women’s. \n\nI am offended by rape jokes because they’re disgusting. Like I already explained, making jokes when you’re punching up is not the same as making offensive jokes about classes of people “beneath” you, that’s just being oppressive and an asshole. It’s not the same because there’s a power imbalance",
                                                                          "timestamp": "2022-02-03 19:00:52",
                                                                          "score": 0,
                                                                          "num_children": 2,
                                                                          "author": 29826,
                                                                          "replies": [
                                                                            {
                                                                              "id": "hvgh6ef",
                                                                              "text": "> Show me a source for these stats, because every source I’ve seen has the same statistics\n\nLies. I've shown you twice now.\n\nhttps://old.reddit.com/r/antifeminists/comments/si301f/feminism_summed_up_in_a_single_image/hvgeiz6/\n\nThe user above is quoting CDC data.\n\n[NISVS 2010](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf) showed that in the past 12 months, 1.1% of men were made to penetrate and 1.1% of women were raped. Look at Table 2.1 and 2.2 on pages 18 and 19 respectively.\n\n[NISVS 2011](https://www.cdc.gov/mmwr/pdf/ss/ss6308.pdf) showed that in the past 12 months, 1.7% of men were made to penetrate and 1.6% of women were raped. Look at Table 1 on page 5.\n\n[NISVS 2012](https://www.cdc.gov/violenceprevention/pdf/NISVS-StateReportBook.pdf) showed that in the past 12 months, 1.7% of men were made to penetrate and 1.0% of women were raped. Look at Table A.1 and A.5 on pages 217 and 222 respectively.\n\n[NISVS 2015](https://www.cdc.gov/violenceprevention/pdf/2015data-brief508.pdf) showed that in the past 12 months, 0.7% of men were made to penetrate and 1.2% of women were raped. Look at Table 1 and 2 on page 15 and 16 respectively\n\n\nVaries a bit from year to year, but pretty even overall. The numbers for perpetrators vary a little from year to year too. Something like 79-84% of made to penetrate (nonconsensual envelopment) victims are victimized  by women. Something like 96-99% of rape (nonconsensual penetration) victims are victimized by men. So in the 2010s, it averages out that a typical year has about 60% men and 40% women as perpetrators of nonconsensual sex outside prisons.\n\nAgain, in 2010s about equal victims and 60/40 perpetrator split between the sexes.",
                                                                              "timestamp": "2022-02-03 19:04:44",
                                                                              "score": 1,
                                                                              "num_children": 1,
                                                                              "author": 65062,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "hvgib0g",
                                                                                  "text": "More recent findings are saying different things though. I’m from the uk, and the definition of rape these studies use is “Sexual violence’ is a term we use to describe any sexual activity or act that happened without consent.” So not gender specific, allowing for the possibility of female perpetrators. Even still, 1 out of every 5 women have experienced sexual assault/rape vs only 1 in 20 men. Even in the “rape by penetration only” definition, 7.1% of women experienced rape/sexual assault vs only 0.5% of men. \n\nhttps://rapecrisis.org.uk/get-informed/about-sexual-violence/statistics-sexual-violence/",
                                                                                  "timestamp": "2022-02-03 19:11:48",
                                                                                  "score": 1,
                                                                                  "num_children": 1,
                                                                                  "author": 29826,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "hvgj9p8",
                                                                                      "text": "> Even in the “rape by penetration only” definition, 7.1% of women experienced rape/sexual assault vs only 0.5% of men.\n\nBecause most men are raped by women and most women don't penetrate their victim. In the UK, a woman can only legally rape if she assists a man in raping someone. Penetration by a penis is required for rape there.\n\nIf you stop minimizing sexual violence against men with the \"only\"'s you'd have a lot more allies to stop sexual violence.",
                                                                                      "timestamp": "2022-02-03 19:17:50",
                                                                                      "score": 1,
                                                                                      "num_children": 1,
                                                                                      "author": 65062,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "hvgm2yk",
                                                                                          "text": "I’m not minimising it, I’m just saying statistically it happens to women a lot more, the fact that that’s even up for debate at all is laughable. You’re against feminism, the fight for gender equality, and just refuse to listen or think critically when all the statistical evidence is in our favour. There’s nothing I can say that’s going to change people like yours’ minds because you just refuse to budge",
                                                                                          "timestamp": "2022-02-03 19:35:30",
                                                                                          "score": 0,
                                                                                          "num_children": 1,
                                                                                          "author": 29826,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "hvgpdov",
                                                                                              "text": "Well you are minimizing it. You repeatedly say that 99% of  rapists are men and men are the problem when it isn't true in the common definition of the word rape, use words like \"only\" when talking about male victims,  call the government data showing that women rape men often \"laughable\". That is minimizing the majority of male victims. I wrote a long reply to your now deleted \"that's just not true\" comment with links to legal sites proving it is. You are very ignorant of the law and the facts even in your own country. I'm not surprised. You are a feminist quoting feminist manipulated data and refuse to look at the gender neutral data.",
                                                                                              "timestamp": "2022-02-03 19:56:11",
                                                                                              "score": 1,
                                                                                              "num_children": 1,
                                                                                              "author": 65062,
                                                                                              "replies": [
                                                                                                {
                                                                                                  "id": "hvgqt8h",
                                                                                                  "text": "You’re delusional I’m not engaging with you anymore",
                                                                                                  "timestamp": "2022-02-03 20:05:23",
                                                                                                  "score": 1,
                                                                                                  "num_children": 0,
                                                                                                  "author": 29826,
                                                                                                  "replies": []
                                                                                                }
                                                                                              ]
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            },
                                                                            {
                                                                              "id": "hvgrl7l",
                                                                              "text": "1. Recent study found that 91% of middle aged men who commited suicide asked for help.\n\nMen die more even if the same method is used 1.4 timed the women rate.\n\nIf you die on first try then you cannot commit suicide again.\n\nAnd this is not only in the US this is everywhere, guns are predominant only in the US but like in my country I never saw a gun in real life, don't know anyone who owns a gun, 0 school shooting and still more men die than women.\n\nI think I know what source you found. When you click it further it is from \"violence against women\" and \"CDC\"\nSoo...\n\nAnd sure here is the source\n\nhttps://www.google.com/url?sa=t&source=web&rct=j&url=https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf&ved=2ahUKEwiTxdaAneT1AhXD_KQKHYhtDsoQFnoECAQQAQ&usg=AOvVaw0llriZBfbRzw1sTJS4AmLh\n\nAnd once again just so you know they don't count when woman rapes a man as a rape so. The summary that they have 1 in 5 women and 1 in 71 men is kinda useless.\n\nLook at page 18 and 19 (or if you want to go by document page it is 28 and 29)\nIn the last 12 months.\n\nWomen rape victims: 1 270 000\n\nMen made to penetrate (rape) victims: 1 267 000\n\nPlus in many countries it is defined legally that only man can rape. That brings cases like in India where porn addict 16 old girl raped her minor brother, she conceived, admitted that she raped him and the boy was sent to juvenile.\n\nOr the cases in Israel when mother rapes their son it is not recognized by law so they cannot persecute her properly.\n\nPretty much the same rape definition that CDC has is the same as in UK, so by law woman cannot be a rapist.\n\nIf you still don't believe that women are capable of sexual violence to this degree then there is still.\n\nHighest rate of domestic violence being in lesbian couples.\n\nSame sex sexual violence among inmates is 3 times higher in women prisons than men prisons.\n\nAnd I haven't seen s much about men's mental health, pretty much the only thing is the one video about men saying they have no one to turn to when they feel sad.\n\nAnd here is women's mental health\n\nhttps://wmhnv.org.au/news/8th-world-congress-on-womens-mental-health-in-paris-france-in-march/\n\nhttps://www.mhfaindia.com/index.php/news/celebrating-womens-mental-health-work-place\n\nAnd I think all that body positivity and health at every size is predominantly for women too.\n\nPlus like hey man had to make their own one. Why not make your own too. \nBut I think it would turn from women have mental health issues to patriarchy oppresive and all our issues are because of men really quickly.\n\nJust like you have all of that breast cancer awareness and marches and there is next to nothing about testicular cancer.",
                                                                              "timestamp": "2022-02-03 20:10:28",
                                                                              "score": 1,
                                                                              "num_children": 0,
                                                                              "author": 180640,
                                                                              "replies": []
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hvgdmyi",
                              "text": "> feminists are the ones trying to express that men can be raped/abused etc too\n\n\"by other men\" is how feminists frame it after removing nearly all the female rapists from the statistics",
                              "timestamp": "2022-02-03 18:43:19",
                              "score": 1,
                              "num_children": 1,
                              "author": 65062,
                              "replies": [
                                {
                                  "id": "hvge3hu",
                                  "text": "Overall men are FAR more likely to be an abuser. 99% of all perpetrators of sexual assault/rape are male. That’s not feminists skewing the facts, that’s the actual statistic. https://stoprape.humboldt.edu/statistics",
                                  "timestamp": "2022-02-03 18:46:06",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 29826,
                                  "replies": [
                                    {
                                      "id": "hvgeiz6",
                                      "text": "That is after skewing the statistics by calling nonconsensual envelopment \"made to penetrate\", \"forced to penetrate\", or \"unwanted contact\" which are forms of \"other sexual violence\" rather than \"rape\" or \"sexual assault\". I already explained that yesterday.\n\nhttps://old.reddit.com/r/antifeminists/comments/si301f/feminism_summed_up_in_a_single_image/hva7z45/?context=3",
                                      "timestamp": "2022-02-03 18:48:41",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 65062,
                                      "replies": [
                                        {
                                          "id": "hvgevdj",
                                          "text": "The cdc is American. All other western countries have the same statistics for rape, despite not going by that definition",
                                          "timestamp": "2022-02-03 18:50:43",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 29826,
                                          "replies": [
                                            {
                                              "id": "hvgezpt",
                                              "text": "Koss's methodology is used by *most* countries. She is an expert in the field and advised governments around the world. Read her CV.\n\nAlso, didn't you just quote US statistics above?",
                                              "timestamp": "2022-02-03 18:51:26",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 65062,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hvadb1o",
                      "text": "> No feminist wants female supremacy. We literally just want equality. \n\nWhy create laws with unequal healthcare access? Why manipulate rape and DV stats in order to reinforce your idea that those things are about \"violence against women\" and men don't need help too? Why publish articles that say its okay to hate men? Why create sexist public policy like the Duluth Model of Domestic Violence Intervention? Why push for laws that only prevent rapist *fathers* from getting custody rights instead of any parent convicted for the act of conception? Why the Hayden rider to the ERA? \n\nWhy the rampant sexism in your own comments?",
                      "timestamp": "2022-02-02 15:42:50",
                      "score": 0,
                      "num_children": 0,
                      "author": 65062,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hv8g199",
              "text": "Why are you even here?",
              "timestamp": "2022-02-02 04:22:46",
              "score": 8,
              "num_children": 1,
              "author": 373757,
              "replies": [
                {
                  "id": "hv8wo5t",
                  "text": "I just came across this subreddit and am very confused because everything that’s claimed about feminism is just blatantly false",
                  "timestamp": "2022-02-02 07:01:01",
                  "score": -1,
                  "num_children": 1,
                  "author": 29826,
                  "replies": [
                    {
                      "id": "hv8xbyh",
                      "text": "Like what exactly",
                      "timestamp": "2022-02-02 07:08:43",
                      "score": 6,
                      "num_children": 1,
                      "author": 338775,
                      "replies": [
                        {
                          "id": "hv8y0vr",
                          "text": "That we want female supremacy, hate men, complain about nothing when we have legitimate goals etc",
                          "timestamp": "2022-02-02 07:17:03",
                          "score": -1,
                          "num_children": 2,
                          "author": 29826,
                          "replies": [
                            {
                              "id": "hv9xkey",
                              "text": "Well first are you really a feminist or just female?...",
                              "timestamp": "2022-02-02 13:55:17",
                              "score": 2,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hv9yjsz",
                                  "text": "Both lol",
                                  "timestamp": "2022-02-02 14:02:43",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 29826,
                                  "replies": [
                                    {
                                      "id": "hvav4bc",
                                      "text": "Lol both she says. I sympathize with feminists. Extreme feminists can burn, all of them.",
                                      "timestamp": "2022-02-02 17:31:26",
                                      "score": 0,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hvavl0r",
                                          "text": "Why? What have feminists done? Even the most radical feminists only want separation from men. Literally what has feminism done to warrant this hatred? Do you all just really hate women that much?",
                                          "timestamp": "2022-02-02 17:34:15",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 29826,
                                          "replies": [
                                            {
                                              "id": "hvlnbsw",
                                              "text": "Maybe it's the media that paints the picture of women wanting men to burn. Or for there to just magically be no men. Or for men to be the slaves of women, some ridiculous notion. Or even all the stereotypes that men are morons and cavemen and the entire lot only think about sex 247. I wish more men in the minority had the power to change that narrative.",
                                              "timestamp": "2022-02-04 19:27:27",
                                              "score": 1,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "hvmj926",
                                                  "text": "Right and what about the narrative that society paints about women? The ones that has actual societal repercussions for us, like being far more likely to be raped/abused, looked over and dismissed constantly, never being listened to, always having to police your facial expressions, body language, tone etc to keep yourself safe from men and also even in our own homes, we’re so accustomed to the male gaze and constantly being perceived that we can’t even relax. What about the narrative of women as over emotional, when men are the ones who go on shooting sprees and punch holes in walls over an Xbox game and end up committing violence, mostly against women. What about the narrative that women are less intelligent and less competent than men, when the top two highest IQs in recorded history were both from women, women consistently outperform men in academia etc but our accomplishments are always dismissed and it’s just societally assumed that men are better. Women are oppressed, that’s a societal fact. The fact that that’s even up for debate is ridiculous, like you are so accustomed to privilege that you are blind to women’s experiences and are just so happy to not listen to the facts, and women telling you their experiences, and you just want to dismiss all of that and think that men are somehow the victims when they’re not",
                                                  "timestamp": "2022-02-04 22:51:48",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 29826,
                                                  "replies": [
                                                    {
                                                      "id": "hvml8fp",
                                                      "text": "Okay. \n\nThere are good PEOPLE, and BAD PEOPLE. \n\nIt just so happens the bad men took control of this society THOUSANDS of years ago. These are the people that started creating that narrative you're talking about. \n\nThey're probably dead by now. It's the descendants... You know, corporation executives and world leaders, men with **ACTUAL POWER**...\n\nI'm black and a first generation American citizen. I'm DEFINITELY not one of the \"all men\" you're referring to here. \n\n(As usual what's new) \n\n(There are plenty women that aren't abused and that support the traditional patriarchy. They are probably your first problem. Priority easily before most of the men that you women THINK are your problems, that you women waste days and years arguing with online for NOTHING)",
                                                      "timestamp": "2022-02-04 23:04:58",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "hvmlefg",
                                                          "text": "There are SOCIETAL STRUCTURES and INSTITUTIONALISED DISCRIMINATION against certain groups. God you people don’t understand sociology at all",
                                                          "timestamp": "2022-02-04 23:06:06",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 29826,
                                                          "replies": [
                                                            {
                                                              "id": "hvmu02k",
                                                              "text": "Naw man you're just triggered that's it. \n\n\"You people\" the difference is all feminists act like you do. And men tend to actually be different. \n\nYour damn witch hunt feminists just basically spend 247 hunting the men you're supposed to avoid. That's why you keep lashing out at me. You're fuckin confused and it's annoying AF. Sorry Ms. Edgelord Jr. \n\nEDIT **WTF DO I HAVE TO DO WITH SOCIETAL STRUCTURES??? When I say you people and all feminists it's because you people and all feminists actually act like whiny children...**\n\nFucking go after the patriarchy. Stop wasting time on fuckin Reddit this site is useless. \n\nIn the meantime yes your shit makes no sense sorry.\n\nEDIT FUCKING 2 I hope you come correct. I really don't give a f--- but I'm trying to reason here. Your snapping off at the keyboard isn't doing shit for anyone.",
                                                              "timestamp": "2022-02-05 00:07:14",
                                                              "score": 1,
                                                              "num_children": 1,
                                                              "replies": [
                                                                {
                                                                  "id": "hvohd3c",
                                                                  "text": "I’m just “triggered” because I’m pointing out societal oppression? I just want gender equality bro lol. Yeah feminists act like I do - they also point out societal oppression, that’s the point. “Men tend to actually be different” men are the most violent group of people, 99% of all perpetrators of rape/sexual assault are male. Men stalk us, harass us, belittle us etc constantly and it’s not fair, that’s what feminism is trying to address. If you refuse to see that then you’re denying reality. I’m not acting like a whiny child for wanting equality you idiot, you’re the child here, like I’m pointing out structural inequality which is a blatant undeniable fact, and you men can’t handle it and start insulting me. All I’ve got from this sub is vitriolic hatred for genuinely just trying to discuss the topic. The only people angry and whining here are you men, I’m calm lol stop trying to paint me as a whiny irrational woman. You are the children here, let’s not get it twisted",
                                                                  "timestamp": "2022-02-05 09:17:50",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "author": 29826,
                                                                  "replies": [
                                                                    {
                                                                      "id": "hvoq9w1",
                                                                      "text": "And that's my fucking point. \n\nUnplug from Reddit smfh. Look - \n\n**I'm just another regular human being here, just like you (hell, MAYBE). I am NOT one of these woman hating incel creepers that sit and troll on social media 24-7 and bitch. That being said, you women are accomplishing NOTHING here online but sounding just like them.** \n\nThis Reddit BS isn't the place for real change. It's just another social media app for people to waste time on, and that's all people are doing here. \n\nAt least I'm one of the minority actually trying to communicate with people directly instead of being scared to communicate like most other people are in modern times. \n\nAnd yes it's fucking annoying and ridiculous. You sound like a child having a tantrum. Do you have an actual progressive discussion? Or is it just more of the same? \n\nDo I look like Harvey Weinstein to you? I mean -",
                                                                      "timestamp": "2022-02-05 11:17:28",
                                                                      "score": 2,
                                                                      "num_children": 1,
                                                                      "replies": [
                                                                        {
                                                                          "id": "hvoqlcf",
                                                                          "text": "The problem is I have a progressive discussion, and everything I’ve been saying is a genuine societal issue that I’m trying to talk about, you’re just dismissing me. That’s the problem. Every time women try to bring up how maybe men should stop treating us like shit, we’re just dismissed as being whiny children, when in reality women deal with oppression every day and want that to change, the men who reply to this with hatred and disdain are the ones throwing a tantrum here. Why are you on an anti feminist subreddit? Like that’s childish, like being part of a group that doesn’t believe in gravity and then when you’re like “but it’s a scientific fact” and you respond with STOP WHINING YOU FUCKING STUPID BITCH STOP CRYING AND ACTUALLY DO SOMETHING ABOUT IT” when EVERY attempt is met with the same attitude. You are the child here.",
                                                                          "timestamp": "2022-02-05 11:21:43",
                                                                          "score": 0,
                                                                          "num_children": 2,
                                                                          "author": 29826,
                                                                          "replies": [
                                                                            {
                                                                              "id": "hvoquyn",
                                                                              "text": "Nooo, the problem is you complaining the same way all other extreme man hating feminists do. \n\nYou act like you want positive change and then rape this establishment that anger et cetera.\n\nThings everyone on planet earth already know, INCLUDING THE WOMEN THAT DEFEND THE PATRIARCHY... \n\nHell instead of the same old complaining at least get those weirdos straightened out... \n\nBecause right now you sound like you're not that educated and can't literally comprehend my statements.",
                                                                              "timestamp": "2022-02-05 11:25:13",
                                                                              "score": 2,
                                                                              "num_children": 1,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "hvoqyk2",
                                                                                  "text": "You’re the embodiment of the Dunning-Kruger effect.",
                                                                                  "timestamp": "2022-02-05 11:26:33",
                                                                                  "score": 0,
                                                                                  "num_children": 1,
                                                                                  "author": 29826,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "hvor19j",
                                                                                      "text": "Not at all but thanks for the extra insult. Smfh. \n\nSame shit smh. \n\nEDIT Do you even realize I'm actually trying to reason with you?",
                                                                                      "timestamp": "2022-02-05 11:27:36",
                                                                                      "score": 2,
                                                                                      "num_children": 1,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "hvor5g0",
                                                                                          "text": "Me: “I want women to not be oppressed”\nMen: *insult me*\nMe: *same energy back*\nMen: “see this is why nobody takes you feminists seriously”",
                                                                                          "timestamp": "2022-02-05 11:29:08",
                                                                                          "score": 0,
                                                                                          "num_children": 1,
                                                                                          "author": 29826,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "hvoth78",
                                                                                              "text": "Really had to go back and read just to remember how this started. \n\nOkay - Again - \n\nWhat you're angry about is a society that was conditioned thousands of years ago. It takes way more than complaining to change that. And the incel men you \"feminists\" obsess over, they don't give a shit. So arguing with them - good luck -",
                                                                                              "timestamp": "2022-02-05 11:58:47",
                                                                                              "score": 1,
                                                                                              "num_children": 1,
                                                                                              "replies": [
                                                                                                {
                                                                                                  "id": "hvotq89",
                                                                                                  "text": "Yeah it will take men actually acknowledging the problem and working with us to create gender equality. But you refuse. You make anti-feminist subreddits and claim that women aren’t actually oppressed. Nothing will change until we all acknowledge and dismantle the problem, but you refuse. How can you sit and criticise me for “complaining” on Reddit over my own oppression, yet you’re here in an anti feminist subreddit denying reality and trying to paint men as the victim when they aren’t. You are the reason why feminism isn’t being taken seriously and therefore no progress towards equality is being made, because you’re all too childish to see what’s right in front of you.",
                                                                                                  "timestamp": "2022-02-05 12:01:58",
                                                                                                  "score": 0,
                                                                                                  "num_children": 1,
                                                                                                  "author": 29826,
                                                                                                  "replies": [
                                                                                                    {
                                                                                                      "id": "hvotvz1",
                                                                                                      "text": "Dude. \n\nMyself and many other men already acknowledge all the fuckin problems. \n\n**WE'RE NOT THE ONES IN POWER THOUGH.** \n\nAnd you're too angry. Seriously, calm down and realize not even every man in these sub groups is the type of guy you assume he is.",
                                                                                                      "timestamp": "2022-02-05 12:03:57",
                                                                                                      "score": 2,
                                                                                                      "num_children": 1,
                                                                                                      "replies": [
                                                                                                        {
                                                                                                          "id": "hvou843",
                                                                                                          "text": "So you agree that women are oppressed?",
                                                                                                          "timestamp": "2022-02-05 12:08:05",
                                                                                                          "score": 0,
                                                                                                          "num_children": 1,
                                                                                                          "author": 29826,
                                                                                                          "replies": [
                                                                                                            {
                                                                                                              "id": "hvow8p3",
                                                                                                              "text": "Fucking duh. Jesus.",
                                                                                                              "timestamp": "2022-02-05 12:32:19",
                                                                                                              "score": 1,
                                                                                                              "num_children": 1,
                                                                                                              "replies": [
                                                                                                                {
                                                                                                                  "id": "hvowalo",
                                                                                                                  "text": "Then why are you on this subreddit lol, the solution to women’s oppression is feminism",
                                                                                                                  "timestamp": "2022-02-05 12:32:55",
                                                                                                                  "score": -1,
                                                                                                                  "num_children": 2,
                                                                                                                  "author": 29826,
                                                                                                                  "replies": [
                                                                                                                    {
                                                                                                                      "id": "hvowd9c",
                                                                                                                      "text": "No it's not, by far. THAT'S well one of the reasons I'm here. \n\nFeminism is just another failed religion.",
                                                                                                                      "timestamp": "2022-02-05 12:33:45",
                                                                                                                      "score": 5,
                                                                                                                      "num_children": 1,
                                                                                                                      "replies": [
                                                                                                                        {
                                                                                                                          "id": "hvoy0fn",
                                                                                                                          "text": "🙄",
                                                                                                                          "timestamp": "2022-02-05 12:51:45",
                                                                                                                          "score": -1,
                                                                                                                          "num_children": 1,
                                                                                                                          "author": 29826,
                                                                                                                          "replies": [
                                                                                                                            {
                                                                                                                              "id": "hvoyb6e",
                                                                                                                              "text": "**EXACTLY** \n\nDon't lose your way over fake movements and agendas. Think, plan, and get ahead in life. It's the only way to really win. \n\nYou can stop expecting any world government to pass magical laws and regulations now.",
                                                                                                                              "timestamp": "2022-02-05 12:54:50",
                                                                                                                              "score": 0,
                                                                                                                              "num_children": 0,
                                                                                                                              "replies": []
                                                                                                                            }
                                                                                                                          ]
                                                                                                                        }
                                                                                                                      ]
                                                                                                                    },
                                                                                                                    {
                                                                                                                      "id": "hvunbrg",
                                                                                                                      "text": "Feminism just made my life worse and every single man afraid to be alone in a room with me so idk what you’re on about",
                                                                                                                      "timestamp": "2022-02-06 19:55:12",
                                                                                                                      "score": 1,
                                                                                                                      "num_children": 0,
                                                                                                                      "replies": []
                                                                                                                    }
                                                                                                                  ]
                                                                                                                }
                                                                                                              ]
                                                                                                            }
                                                                                                          ]
                                                                                                        }
                                                                                                      ]
                                                                                                    }
                                                                                                  ]
                                                                                                }
                                                                                              ]
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            },
                                                                            {
                                                                              "id": "hvorecj",
                                                                              "text": "> 99% of all perpetrators of rape/sexual assault are male\n\nand\n\n> everything I’ve been saying is a genuine societal issue\n\npick one.",
                                                                              "timestamp": "2022-02-05 11:32:23",
                                                                              "score": 1,
                                                                              "num_children": 1,
                                                                              "author": 65062,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "hvorfhp",
                                                                                  "text": "That’s a fact you fucking moron",
                                                                                  "timestamp": "2022-02-05 11:32:46",
                                                                                  "score": 1,
                                                                                  "num_children": 1,
                                                                                  "author": 29826,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "hvorn2t",
                                                                                      "text": "For the fourth time, no it isn't. It is a distorted feminist talking point only possible after counting women raping men as \"other sexual violence\" rather than \"rape\" or \"sexual assault\".  There is nothing genuine about it.",
                                                                                      "timestamp": "2022-02-05 11:35:27",
                                                                                      "score": 1,
                                                                                      "num_children": 1,
                                                                                      "author": 65062,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "hvoroo9",
                                                                                          "text": "No. You are denying reality.",
                                                                                          "timestamp": "2022-02-05 11:36:00",
                                                                                          "score": 1,
                                                                                          "num_children": 1,
                                                                                          "author": 29826,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "hvos0h9",
                                                                                              "text": "Let's see  I have repeatedly given you a ton of sources proving it. You keep saying I'm wrong and citing the same biased rape statistics I have demonstrated have been manipulated by feminists. How is that being genuine? Ohh wait, it isn't as I pointed out above.",
                                                                                              "timestamp": "2022-02-05 11:40:13",
                                                                                              "score": 1,
                                                                                              "num_children": 1,
                                                                                              "author": 65062,
                                                                                              "replies": [
                                                                                                {
                                                                                                  "id": "hvos1yn",
                                                                                                  "text": "The fact that you genuinely think this is so fucking funny dude",
                                                                                                  "timestamp": "2022-02-05 11:40:45",
                                                                                                  "score": 1,
                                                                                                  "num_children": 1,
                                                                                                  "author": 29826,
                                                                                                  "replies": [
                                                                                                    {
                                                                                                      "id": "hvos7hr",
                                                                                                      "text": "It's easier to see the truth if you aren't heavily invested in a sexist ideology.",
                                                                                                      "timestamp": "2022-02-05 11:42:42",
                                                                                                      "score": 1,
                                                                                                      "num_children": 1,
                                                                                                      "author": 65062,
                                                                                                      "replies": [
                                                                                                        {
                                                                                                          "id": "hvoseig",
                                                                                                          "text": "Exactly bro. It’s almost like we’ve been socialised within a patriarchy and oppression of women is so normalised that you can’t see it. That you are blind to women’s lived experiences because of your gender and genuinely believe these women are complaining about nothing. Since we are socialised to dismiss women and we’re characterised as whiny children with no legitimate concerns. It’s almost like there’s a correlation here.",
                                                                                                          "timestamp": "2022-02-05 11:45:13",
                                                                                                          "score": 1,
                                                                                                          "num_children": 1,
                                                                                                          "author": 29826,
                                                                                                          "replies": [
                                                                                                            {
                                                                                                              "id": "hvosn3n",
                                                                                                              "text": "Exactly babe. It’s almost like we’ve been socialised to believe there is patriarchy and women are oppressed. Oppression of men is so normalised that you can’t see it. That you are blind to men’s lived experiences because of your gender and genuinely believe these men are complaining about nothing - like getting raped and abused by women without any support services for them. We are socialised to dismiss men and we’re characterised as whiny incels with no legitimate concerns. It’s almost like there’s a correlation here.\n\nFeminist propaganda isn't reality. You think you know men's lived experiences, but you have a *very* distorted view of the average man's life experiences because of your ideology. Dare to look at the unbiased rape and intimate partner violence data at least.",
                                                                                                              "timestamp": "2022-02-05 11:48:16",
                                                                                                              "score": 2,
                                                                                                              "num_children": 1,
                                                                                                              "author": 65062,
                                                                                                              "replies": [
                                                                                                                {
                                                                                                                  "id": "hvosplt",
                                                                                                                  "text": "The fact that you genuinely think this is astonishing",
                                                                                                                  "timestamp": "2022-02-05 11:49:08",
                                                                                                                  "score": 1,
                                                                                                                  "num_children": 0,
                                                                                                                  "author": 29826,
                                                                                                                  "replies": []
                                                                                                                }
                                                                                                              ]
                                                                                                            }
                                                                                                          ]
                                                                                                        }
                                                                                                      ]
                                                                                                    }
                                                                                                  ]
                                                                                                }
                                                                                              ]
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hvads0p",
                              "text": "You judge feminism based on the dictionary definition.\n\nWe judge feminism based on the actions of the influential feminist researchers, professors, lobbiests, public policy makers, journalists, authors, politicians, and protesters and the \"real feminists\" using their work rather than calling out their sexism, bias, bigotry, data manipulation, outright lies, etc.",
                              "timestamp": "2022-02-02 15:45:48",
                              "score": 1,
                              "num_children": 1,
                              "author": 65062,
                              "replies": [
                                {
                                  "id": "hvauz5j",
                                  "text": "You judge feminism based on skewed statistics, illogical thinking and a lack of awareness of what it actually is. You anti feminists use the same arguments now as you did back when women were fighting for the right to vote back in the 20s. Everything you think about feminism is a product of anti feminist propaganda, if you actually knew what it was then you wouldn’t be against it",
                                  "timestamp": "2022-02-02 17:30:33",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 29826,
                                  "replies": [
                                    {
                                      "id": "hvb2lck",
                                      "text": "> You judge feminism based on skewed statistics, illogical thinking and a lack of awareness of what it actually is.\n\nYes. Exactly! I judge them on that. If they'd stop and admit is it sexist bigotry and work for equality of all people we'd get along a lot better.",
                                      "timestamp": "2022-02-02 18:17:05",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 65062,
                                      "replies": [
                                        {
                                          "id": "hvb2ox3",
                                          "text": "🙄",
                                          "timestamp": "2022-02-02 18:17:43",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 29826,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hvb0sa4",
              "text": "Oh, look. Another feminist has come to tell us how privileged we are and how oppressed they are.",
              "timestamp": "2022-02-02 18:05:50",
              "score": 2,
              "num_children": 1,
              "author": 294229,
              "replies": [
                {
                  "id": "hvb12l2",
                  "text": "Yes because it’s a societal fact. “Oh look, another scientist telling us global warming is happening and the climate is going to suffer” like that’s how stupid you sound",
                  "timestamp": "2022-02-02 18:07:36",
                  "score": 1,
                  "num_children": 0,
                  "author": 29826,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hv73dkn",
      "text": "**YUUUP**",
      "timestamp": "2022-02-01 22:42:08",
      "score": 6,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv7762n",
      "text": "All feminists are violent supremacist terrorists",
      "timestamp": "2022-02-01 23:06:58",
      "score": 16,
      "num_children": 2,
      "author": 101843,
      "replies": [
        {
          "id": "hv9xfff",
          "text": "When I first read this I read it as \"All women\" 😂 damn what a mistake -",
          "timestamp": "2022-02-02 13:54:14",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "hv9xkz2",
              "text": "Plenty of women are not feminists and plenty of men are feminists",
              "timestamp": "2022-02-02 13:55:24",
              "score": 5,
              "num_children": 1,
              "author": 101843,
              "replies": [
                {
                  "id": "hvav9fz",
                  "text": "Love your username LOL",
                  "timestamp": "2022-02-02 17:32:18",
                  "score": 3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hvb72ot",
                      "text": "Thank you",
                      "timestamp": "2022-02-02 18:44:42",
                      "score": 2,
                      "num_children": 0,
                      "author": 101843,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hvae03h",
          "text": "Nah. A lot of them are just ignorant and bought into the propaganda. Many are pawns.",
          "timestamp": "2022-02-02 15:47:14",
          "score": 4,
          "num_children": 0,
          "author": 65062,
          "replies": []
        }
      ]
    },
    {
      "id": "hv7cr1x",
      "text": "Perfect description.",
      "timestamp": "2022-02-01 23:45:04",
      "score": 8,
      "num_children": 0,
      "author": 332264,
      "replies": []
    },
    {
      "id": "hv7yzzf",
      "text": "Feminism is dumb\n\nMen and Women should have equal pay and rights in all countries. The only thing differentiating us is you have a Y chromosome and i dont.",
      "timestamp": "2022-02-02 02:19:26",
      "score": 8,
      "num_children": 3,
      "author": 395061,
      "replies": [
        {
          "id": "hvdayo2",
          "text": "Men and women do have equal pay. Equal rights? Not so much. Men are behind in rights by a mile.",
          "timestamp": "2022-02-03 02:59:47",
          "score": 2,
          "num_children": 1,
          "author": 325689,
          "replies": [
            {
              "id": "hvddcgt",
              "text": "Women only earn 84% of what men earn with the same experience and education on average.",
              "timestamp": "2022-02-03 03:17:11",
              "score": 0,
              "num_children": 1,
              "author": 395061,
              "replies": [
                {
                  "id": "hvddkes",
                  "text": "Women also don’t work as many hours on average. The “wage gap” is false. The earnings gap is real. There’d be zero men in the work force if women produced the exact same output at a cheaper rate.",
                  "timestamp": "2022-02-03 03:18:49",
                  "score": 2,
                  "num_children": 0,
                  "author": 325689,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hwdcr2g",
          "text": "Go look up the definition of feminism. That's literally what it's about. It's not about women being superior. It's about everyone being equal. And any self proclaimed feminist who tells you different, doesn't understand feminism either.",
          "timestamp": "2022-02-10 14:34:57",
          "score": 1,
          "num_children": 1,
          "author": 189367,
          "replies": [
            {
              "id": "hwdf7o8",
              "text": "Feminism is female supremacy.",
              "timestamp": "2022-02-10 14:51:57",
              "score": 1,
              "num_children": 1,
              "author": 29049,
              "replies": [
                {
                  "id": "hwdfw8d",
                  "text": "LMAO go look up the definition right now because no it is not, you brainwashed idiot.",
                  "timestamp": "2022-02-10 14:56:34",
                  "score": 1,
                  "num_children": 1,
                  "author": 189367,
                  "replies": [
                    {
                      "id": "hwdfxya",
                      "text": "cope.",
                      "timestamp": "2022-02-10 14:56:53",
                      "score": 1,
                      "num_children": 1,
                      "author": 29049,
                      "replies": [
                        {
                          "id": "hwdg4re",
                          "text": "Yeah, facts dont lie but if you just refuse to look at them you can pretend they aren't there, right?",
                          "timestamp": "2022-02-10 14:58:09",
                          "score": 1,
                          "num_children": 1,
                          "author": 189367,
                          "replies": [
                            {
                              "id": "hwdgakx",
                              "text": "The facts are the feminism is female supremacy. If you cared about men you would be against mandatory draft of men, the anti male bias in the court system, education system, and social benefit system.",
                              "timestamp": "2022-02-10 14:59:15",
                              "score": 2,
                              "num_children": 2,
                              "author": 29049,
                              "replies": [
                                {
                                  "id": "hwdgj4c",
                                  "text": "No, the fact is you are refusing to look at the definition of feminism because it doesnt fit your internalized misogynistic narrative. Keep trying sweetheart. Maybe one day you'll realize that there is more to life than male validation.",
                                  "timestamp": "2022-02-10 15:00:47",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 189367,
                                  "replies": [
                                    {
                                      "id": "hwdgqqz",
                                      "text": "Misogyny doesn’t exist nor has it ever existed. Women have been treated well throughout history especially in the modern era. Our societies are built to coddle and protect women, which isn’t bad but it is bad when we actively discriminate against men. Feminism is an incredibly discriminatory movement.",
                                      "timestamp": "2022-02-10 15:02:13",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 29049,
                                      "replies": [
                                        {
                                          "id": "hwdh0x1",
                                          "text": "Haha is that what you have to say to make your bf love you? You must live such a sad existence. You know that's not true. You just want to be loved so badly you'll agree with anything your misogynistic boyfriend says to get his approval.",
                                          "timestamp": "2022-02-10 15:04:07",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 189367,
                                          "replies": [
                                            {
                                              "id": "hwdh518",
                                              "text": "Looks like you can’t refute my points. You resort to insults, it’s a very typical feminist behavior.",
                                              "timestamp": "2022-02-10 15:04:51",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 29049,
                                              "replies": [
                                                {
                                                  "id": "hwdhn3v",
                                                  "text": "Lmao I cant refute your points, say the one who cant look up a simple definition because she wants to push her misogynistic pick me bullshit. Okay keep telling yourself that 🤡😂",
                                                  "timestamp": "2022-02-10 15:08:09",
                                                  "score": 1,
                                                  "num_children": 2,
                                                  "author": 189367,
                                                  "replies": [
                                                    {
                                                      "id": "hwdhpvc",
                                                      "text": "You haven’t refuted my points yet.",
                                                      "timestamp": "2022-02-10 15:08:39",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 29049,
                                                      "replies": [
                                                        {
                                                          "id": "hwdi3f2",
                                                          "text": "Oh yeah, I definitely have. You just refuse to acknowledge the facts. You still won't look up the definition of feminism because you dont want me to be right and you think if you just keep saying the same pick me bullshit some man will swoop in and say even dumber shit to try and shut me up.",
                                                          "timestamp": "2022-02-10 15:11:03",
                                                          "score": 0,
                                                          "num_children": 1,
                                                          "author": 189367,
                                                          "replies": [
                                                            {
                                                              "id": "hwdi75c",
                                                              "text": "Feminism is female supremacy.",
                                                              "timestamp": "2022-02-10 15:11:43",
                                                              "score": 1,
                                                              "num_children": 1,
                                                              "author": 29049,
                                                              "replies": [
                                                                {
                                                                  "id": "hwdieua",
                                                                  "text": "Refusing to acknowledge facts doesnt make you right. It makes you stupid. But sure if that's what you want to tell yourself so you can feel like men like you",
                                                                  "timestamp": "2022-02-10 15:13:07",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "author": 189367,
                                                                  "replies": [
                                                                    {
                                                                      "id": "hwdil50",
                                                                      "text": "If only you took your own advice.",
                                                                      "timestamp": "2022-02-10 15:14:16",
                                                                      "score": 1,
                                                                      "num_children": 1,
                                                                      "author": 29049,
                                                                      "replies": [
                                                                        {
                                                                          "id": "hwdiztb",
                                                                          "text": "Says the one who refuses to look up a simple definition. Do you need help? I can walk you through how to use google",
                                                                          "timestamp": "2022-02-10 15:16:54",
                                                                          "score": 1,
                                                                          "num_children": 1,
                                                                          "author": 189367,
                                                                          "replies": [
                                                                            {
                                                                              "id": "hwdj1pp",
                                                                              "text": "Feminism is female supremacy.",
                                                                              "timestamp": "2022-02-10 15:17:15",
                                                                              "score": 1,
                                                                              "num_children": 1,
                                                                              "author": 29049,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "hwdjkzk",
                                                                                  "text": "So is that yes to walking you through google?",
                                                                                  "timestamp": "2022-02-10 15:20:44",
                                                                                  "score": 1,
                                                                                  "num_children": 1,
                                                                                  "author": 189367,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "hwdjs23",
                                                                                      "text": "Feminism can claim to be about equality all they want but their actions prove otherwise.",
                                                                                      "timestamp": "2022-02-10 15:22:00",
                                                                                      "score": 1,
                                                                                      "num_children": 1,
                                                                                      "author": 29049,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "hwdjubr",
                                                                                          "text": "So you admit to refusing the truth. Got it.",
                                                                                          "timestamp": "2022-02-10 15:22:24",
                                                                                          "score": 1,
                                                                                          "num_children": 2,
                                                                                          "author": 189367,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "hwdjy66",
                                                                                              "text": "It’s you that is refusing the truth or to even see the other side. Men have valid criticisms and concerns of feminism.",
                                                                                              "timestamp": "2022-02-10 15:23:06",
                                                                                              "score": 2,
                                                                                              "num_children": 0,
                                                                                              "author": 29049,
                                                                                              "replies": []
                                                                                            },
                                                                                            {
                                                                                              "id": "hwdk1c5",
                                                                                              "text": "I had fun, your blocked now. Enjoy being a single lady.",
                                                                                              "timestamp": "2022-02-10 15:23:40",
                                                                                              "score": 2,
                                                                                              "num_children": 0,
                                                                                              "author": 29049,
                                                                                              "replies": []
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    },
                                                    {
                                                      "id": "hwency8",
                                                      "text": "Hey that’s a really condescending and immature way to talk to other people. You’re more then welcome to have a different opinion, and to elaborate on your way of seeing things, but there is absolutely no reason to become personal, ugly or resort to name calling.",
                                                      "timestamp": "2022-02-10 19:23:22",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "hwdgpxa",
                                  "text": "Also you have no idea if I am for or against those things. You're literally making assumptions based on what you think I think feminism is, but the problem is you dont actually know me and I know what feminism is.",
                                  "timestamp": "2022-02-10 15:02:04",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 189367,
                                  "replies": [
                                    {
                                      "id": "hwdgwcf",
                                      "text": "Anti Feminists have documented feminisms actions and motivations very well. You identifying as a feminist tells me all I need to know about your beliefs which are inherently anti male.",
                                      "timestamp": "2022-02-10 15:03:16",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 29049,
                                      "replies": [
                                        {
                                          "id": "hwdharf",
                                          "text": "\"Antifeminists\" are just misogynists. I'm not anti male in anyway. That's why I'm love with an amazing one. You are once again making assumptions based on what you think feminism is.",
                                          "timestamp": "2022-02-10 15:05:54",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 189367,
                                          "replies": [
                                            {
                                              "id": "hwdhgtg",
                                              "text": "Anti feminists are those who stand up to the tyranny of feminism and advocate for males.",
                                              "timestamp": "2022-02-10 15:06:59",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 29049,
                                              "replies": [
                                                {
                                                  "id": "hwdholt",
                                                  "text": "Wrong lmao",
                                                  "timestamp": "2022-02-10 15:08:26",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 189367,
                                                  "replies": [
                                                    {
                                                      "id": "hwdhs4e",
                                                      "text": "Misogyny doesn’t exist.",
                                                      "timestamp": "2022-02-10 15:09:04",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 29049,
                                                      "replies": [
                                                        {
                                                          "id": "hwdi5ie",
                                                          "text": "Wrong 🤷‍♀️",
                                                          "timestamp": "2022-02-10 15:11:26",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 189367,
                                                          "replies": [
                                                            {
                                                              "id": "hwdi98m",
                                                              "text": "Misogyny doesn’t exist.",
                                                              "timestamp": "2022-02-10 15:12:06",
                                                              "score": 1,
                                                              "num_children": 1,
                                                              "author": 29049,
                                                              "replies": [
                                                                {
                                                                  "id": "hwdihif",
                                                                  "text": "You spelled \"misandry\" wrong",
                                                                  "timestamp": "2022-02-10 15:13:36",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "author": 189367,
                                                                  "replies": [
                                                                    {
                                                                      "id": "hwdinmq",
                                                                      "text": "If you hate men you don’t have to be on an anti feminist sub.",
                                                                      "timestamp": "2022-02-10 15:14:43",
                                                                      "score": 1,
                                                                      "num_children": 1,
                                                                      "author": 29049,
                                                                      "replies": [
                                                                        {
                                                                          "id": "hwdj7je",
                                                                          "text": "I dont hate men. I hate you, specifically, which is why I'm here 😘 if you hadn't tried to rekindle last night's conversation, I wouldn't be here. So you only have yourself to thank",
                                                                          "timestamp": "2022-02-10 15:18:19",
                                                                          "score": 1,
                                                                          "num_children": 1,
                                                                          "author": 189367,
                                                                          "replies": [
                                                                            {
                                                                              "id": "hwdj992",
                                                                              "text": "cope.",
                                                                              "timestamp": "2022-02-10 15:18:37",
                                                                              "score": 1,
                                                                              "num_children": 1,
                                                                              "author": 29049,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "hwdjp11",
                                                                                  "text": "Do you have trouble coping with the truth? Is that why you keep saying that?",
                                                                                  "timestamp": "2022-02-10 15:21:27",
                                                                                  "score": 1,
                                                                                  "num_children": 1,
                                                                                  "author": 189367,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "hwdjt3u",
                                                                                      "text": "cope.",
                                                                                      "timestamp": "2022-02-10 15:22:11",
                                                                                      "score": 1,
                                                                                      "num_children": 0,
                                                                                      "author": 29049,
                                                                                      "replies": []
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hv8g85o",
          "text": "Its that Y chromosome that's the fucking issue.",
          "timestamp": "2022-02-02 04:24:19",
          "score": -1,
          "num_children": 0,
          "author": 373757,
          "replies": []
        }
      ]
    },
    {
      "id": "hv78v40",
      "text": "\\*Not valid with any other offer\\*",
      "timestamp": "2022-02-01 23:18:29",
      "score": 4,
      "num_children": 0,
      "author": 250768,
      "replies": []
    },
    {
      "id": "hw6bwiu",
      "text": "That’s because (this might surprise you), we cannot be equal. There are certain things that women need and there are certain things that men need. For example, infant circumcision needs to be made illegal, there should be more support in society for mens mental health and suicide awareness. Then women need things like the right to choose what they do with their bodies (abortion, birth control, tubal ligation), and to not be told they are worth less if they dress a certain way or have sex with so many men or have children.",
      "timestamp": "2022-02-09 03:09:28",
      "score": 2,
      "num_children": 1,
      "author": 293314,
      "replies": [
        {
          "id": "hw6mih8",
          "text": "I completely agree with your statement, just that feminists completely miss out of the Men's part of needs and only focus on the Women's needs, and then bash any men for wanting more",
          "timestamp": "2022-02-09 04:29:31",
          "score": 1,
          "num_children": 1,
          "author": 217945,
          "replies": [
            {
              "id": "hw6sbr0",
              "text": "That’s the idea. Feminism is women’s rights, we fight for ours. Your mens rights groups fight for men’s rights. The individuals ignoring the opposites rights are the problem, not the group itself.",
              "timestamp": "2022-02-09 05:18:51",
              "score": 2,
              "num_children": 1,
              "author": 293314,
              "replies": [
                {
                  "id": "hw6wd41",
                  "text": "Sure",
                  "timestamp": "2022-02-09 05:56:57",
                  "score": 1,
                  "num_children": 0,
                  "author": 217945,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hv7kdbd",
      "text": "yeah until i get hired at most jobs for having moob cleavage, there is no equality. its delusional to think there is equality.",
      "timestamp": "2022-02-02 00:38:00",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hv820wt",
      "text": "There's a difference between equal and identical.",
      "timestamp": "2022-02-02 02:40:10",
      "score": 1,
      "num_children": 1,
      "author": 17448,
      "replies": [
        {
          "id": "hv8zf0s",
          "text": "What’s the difference?",
          "timestamp": "2022-02-02 07:33:59",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hv90z89",
              "text": "amogus",
              "timestamp": "2022-02-02 07:53:26",
              "score": 2,
              "num_children": 0,
              "author": 267820,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}