{
  "id": "sl7vs8",
  "text": "Catcalled\n",
  "timestamp": "2022-02-05 14:13:28",
  "score": 776,
  "subreddit": "t5_2zaj2",
  "num_children": 29,
  "author": 226225,
  "replies": [
    {
      "id": "hvppee3",
      "text": "I remember a video some years ago where a feminist woman went walking about NYC to capture street harassment. It was mostly black men who did it (to their chagrin), and a lot of times the guys would tell the woman to smile, which to them is as bad as saying, \"I wanna eat that pussy!\" Their goal was to raise awareness and garner support for making catcalling a crime.\n\nThere were a lot of parody videos after that, some men did the experiment too and were cat called by women and gay men. Overall the message was that women were overreacting, and if any anti-street harassment legislation were enacted, it would mostly affect black men. \n\nThe issue is watered down when spoken of, feminists will conflate being followed with catcalling, or when the catcall is extremely sexual. Saying \"looking sexy today\" is not the same thing as saying \"8 inches is awaiting, princess.\" Just other behaviors not associated with catcalling and extreme examples that depict catcalling as some serious societal ill. Even trying to do cold approaches are considered catcalling and street harassment to these people.\n\nCatcalling when not overtly sexual is ok with me.",
      "timestamp": "2022-02-05 16:30:01",
      "score": 149,
      "num_children": 5,
      "author": 191085,
      "replies": [
        {
          "id": "hvqwuz2",
          "text": "This kind of aggressively forward approach seems to be what a strong proportion of BW want.",
          "timestamp": "2022-02-05 22:14:28",
          "score": 18,
          "num_children": 4,
          "author": 161889,
          "replies": [
            {
              "id": "hvrswbp",
              "text": "When i develop mind reading as a skill i might risk being cancelled",
              "timestamp": "2022-02-06 02:18:25",
              "score": 7,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hvwofd0",
              "text": "BW?",
              "timestamp": "2022-02-07 04:57:29",
              "score": 2,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hwnq3pd",
              "text": "You making the assertion that black women are attracted to being approached aggressively, damn bro you’re ignorant. You don’t even realize what women want and desire, and I’ll tell you right now, most women do not like being approached so aggressively regardless of race.",
              "timestamp": "2022-02-12 16:02:24",
              "score": 1,
              "num_children": 2,
              "author": 216472,
              "replies": [
                {
                  "id": "hwpjzjm",
                  "text": "Dude, dudette; learn to read.\n\nI said a \"strong *proportion* of BW\", not \"BW\".",
                  "timestamp": "2022-02-12 23:33:11",
                  "score": 2,
                  "num_children": 1,
                  "author": 161889,
                  "replies": [
                    {
                      "id": "hwplys5",
                      "text": "Yeah you really don’t have the right to speak upon black women and how they like to be approached, so I guess you’re the one whose stoopid.",
                      "timestamp": "2022-02-12 23:47:30",
                      "score": 0,
                      "num_children": 1,
                      "author": 216472,
                      "replies": [
                        {
                          "id": "hwpmtyx",
                          "text": "You really are dumb.",
                          "timestamp": "2022-02-12 23:53:46",
                          "score": 1,
                          "num_children": 1,
                          "author": 161889,
                          "replies": [
                            {
                              "id": "hwpmwhf",
                              "text": "Awhh thank you so kind of you 🙏",
                              "timestamp": "2022-02-12 23:54:15",
                              "score": 1,
                              "num_children": 0,
                              "author": 216472,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i8nxwn7",
                  "text": "Nice try. Don’t believe you.",
                  "timestamp": "2022-05-15 05:36:51",
                  "score": 1,
                  "num_children": 0,
                  "author": 72318,
                  "replies": []
                }
              ]
            },
            {
              "id": "hwh8sa7",
              "text": "Making  that assumption isn’t wise if you ask me. A lot of black women are realizing a good majority of black men don’t desire or want them, let alone give them the time of their day, which is making these black women realize their worth and value. They’re realizing that it’s dumb to go after their own group of men (black men) who blatantly have put them down for decades just to uplift non black women. Ofc you wouldn’t know that right? Have you even spoken to black women or have any idea of what their dynamics and preferences they have in men?",
              "timestamp": "2022-02-11 07:33:12",
              "score": 1,
              "num_children": 2,
              "author": 216472,
              "replies": [
                {
                  "id": "hwn3vwt",
                  "text": "Yo, I'm black, with black sisters, cousins, friends and girlfriends.\n\nYour assertion that \"black men are not desiring of black women\" is complete bunk, almost stoopid.",
                  "timestamp": "2022-02-12 13:13:34",
                  "score": 7,
                  "num_children": 2,
                  "author": 161889,
                  "replies": [
                    {
                      "id": "hwvul5s",
                      "text": "Actually though, dating app statistics do show that black women are the least desired among all races of women from all races of men. \n\nThere are multiple studies on this, I advise you just take a quick look. A lot of dating coaches actually advise black women to open up their dating habits to other races because they’re not getting married to black men at the rate they want.",
                      "timestamp": "2022-02-14 07:28:13",
                      "score": 2,
                      "num_children": 0,
                      "author": 157936,
                      "replies": []
                    },
                    {
                      "id": "hwnpgd5",
                      "text": "So why is it so common that a lot of black men will show that type of bag ILR towards their own women? I’m not arguing with you about your anecdotals. Black women have gotten shit ok by their own men and other groups for more than long enough. I honestly don’t give a fuck if you’re black, it still stands that a lot of black men don’t desire or want to date black women. Look at whose praised and worshiped more in media, look at whose trying to emulate black wines and their features. Don’t get me started on colorism dude, you should know that too well since you’re a black man right?",
                      "timestamp": "2022-02-12 15:58:02",
                      "score": 1,
                      "num_children": 1,
                      "author": 216472,
                      "replies": [
                        {
                          "id": "hwpjsvm",
                          "text": "You are stoopid. You're throwing around assertions as though they apply to 100% of people.\n\nGet off your dick.",
                          "timestamp": "2022-02-12 23:31:49",
                          "score": 2,
                          "num_children": 0,
                          "author": 161889,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hwzguir",
                  "text": "Personally, my dating preference isn't based on race. But growing up I never had white, Hispanic or Asian women constantly mock and ridicule me for being a gamer or an anime geek. It was only black girls that did that. You claim that black women were always put down, but in most cases, y'all throw the first punch. I always had a hard time with black chicks growing up, simply because I wasn't hood or ghetto. Even my own parents would call me a f****t or a pussy for preferring to stay inside to draw, read manga and play video games.",
                  "timestamp": "2022-02-15 02:21:25",
                  "score": 1,
                  "num_children": 0,
                  "author": 219923,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hwh96vo",
          "text": "Reading that you justify catcalling as long as it’s not inherently sexual, is alarming. Lemme know if you ever decide to become a father and have a daughter, tell her you don’t give a fuck if grown ass men sexualize her and make inappropriate comments. I’ve been verbally harassed since I was about 13 or 14, I’m 20 now. It doesn’t feel good when men try to “holler” and get my attention like I’m a dog, it’s quite demeaning if you ask me. And did you ever think once that some areas of New York are primarily occurred by black people, so it’s not an issue just pertaining to black urban communities like you insinuated in your OP. Your whole comment makes me physically ill.",
          "timestamp": "2022-02-11 07:38:10",
          "score": 1,
          "num_children": 0,
          "author": 216472,
          "replies": []
        },
        {
          "id": "hxi9tjm",
          "text": "it was never trying to make cat calling a crime lmao it was supposed to show how women are harassed (verbally) every single day but of course u guys have to make it about yourselves",
          "timestamp": "2022-02-18 22:44:19",
          "score": 1,
          "num_children": 0,
          "author": 255741,
          "replies": []
        },
        {
          "id": "hvqwl78",
          "text": "> It was mostly black men who did it\n\nSo you're just not gonna mention the part where that video was heavily edited to make it look like it was mostly black men, when in reality it was men of all races?",
          "timestamp": "2022-02-05 22:12:21",
          "score": -24,
          "num_children": 2,
          "author": 169342,
          "replies": [
            {
              "id": "hvr2b8u",
              "text": "No it was mostly back men, they were recording for 10 hours and only got about two minutes of content. They literally put every single encounter they had into the video which lead to stuff like men saying “hello” being included. Tbf though it was an urban area but that’s only because they wouldn’t get any content if they did it in other areas",
              "timestamp": "2022-02-05 22:55:08",
              "score": 18,
              "num_children": 1,
              "replies": [
                {
                  "id": "hvrhioh",
                  "text": "No it wasn't. They admitted that it was their editing that made it seem that way\n\nhttps://www.npr.org/sections/codeswitch/2014/11/01/360422087/hollaback-video-calls-out-catcallers-but-cuts-out-white-men\n\n> \"We regret the unintended racial bias in the editing of the video that over represents men of color. Although we appreciate Rob's support, we are committed to showing the complete picture. It is our hope and intention that this video will be the start of a series to demonstrate that the type of harassment we're concerned about is directed toward women of all races and ethnicities and conducted by an equally diverse population of men.\"",
                  "timestamp": "2022-02-06 00:50:28",
                  "score": -6,
                  "num_children": 1,
                  "author": 169342,
                  "replies": [
                    {
                      "id": "hvrj5r5",
                      "text": "Look at the wording used, “unintended racial bias” and rest of the paragraph is used to backtrack that. It’s a PR move, they know that saying it was an accident would net way less backlash then just saying black men did it more. They literally have nothing to gain from over representing black people and as I established before they included every encounter they got in the video so there’s no room for racist editing",
                      "timestamp": "2022-02-06 01:03:17",
                      "score": 11,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hvrjgo4",
                          "text": "Ah yes, because we all know that whenever anyone does anything racist, they are always upfront about their racist intentions and never lie to make it sound unintentional. \n\nWhatever lol Not surprised \"anti-feminists\" also eat up racist bullshit.",
                          "timestamp": "2022-02-06 01:05:39",
                          "score": -7,
                          "num_children": 2,
                          "author": 169342,
                          "replies": [
                            {
                              "id": "hvrqv9m",
                              "text": "Where's the full video then?",
                              "timestamp": "2022-02-06 02:02:49",
                              "score": 5,
                              "num_children": 0,
                              "replies": []
                            },
                            {
                              "id": "hvrjkgk",
                              "text": "That’s literally got nothing to do with what I said. Are you sure you’re replying to the right comment?",
                              "timestamp": "2022-02-06 01:06:27",
                              "score": 6,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hvr0odo",
              "text": "Are you trolling or serious? I ask because I saw the video, it was like 10 minutes long I think. She was walking around clearly less maintained areas of NYC and such, the guys I saw looked black and Latino. I *heard* some of the guys were actors, and I noticed a good number of the catcall's were from guys not seen and were implied to be directed at the woman walking in front of a camera.\n\nThe whole \"experiment\" seemed kinda bullshit to me, but I'm open to learning more.",
              "timestamp": "2022-02-05 22:43:05",
              "score": 12,
              "num_children": 1,
              "author": 105870,
              "replies": [
                {
                  "id": "hvrhprw",
                  "text": "> \"We regret the unintended racial bias in the editing of the video that over represents men of color. Although we appreciate Rob's support, we are committed to showing the complete picture. It is our hope and intention that this video will be the start of a series to demonstrate that the type of harassment we're concerned about is directed toward women of all races and ethnicities and conducted by an equally diverse population of men.\"\n\nhttps://www.npr.org/sections/codeswitch/2014/11/01/360422087/hollaback-video-calls-out-catcallers-but-cuts-out-white-men\n\nThe video is years old and has been \"debunked\" many times over - they edited out white men to give the appearance of being largely black men who were catcalling.",
                  "timestamp": "2022-02-06 00:51:57",
                  "score": 3,
                  "num_children": 1,
                  "author": 169342,
                  "replies": [
                    {
                      "id": "hvrqr9q",
                      "text": "It's \"debunked\" when they have released the full video. Have they?",
                      "timestamp": "2022-02-06 02:01:59",
                      "score": 7,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hvwxwhj",
          "text": "first off have you ever been catcalled, and what about 12 year old girls who are catcalled and whistled at on the street when they're a CHILD, women dont need to be sexualized, plus if it doesnt happen to u no one cares whether or not you think its sexual it doesnt happen to u.",
          "timestamp": "2022-02-07 06:29:41",
          "score": 0,
          "num_children": 0,
          "author": 66512,
          "replies": []
        }
      ]
    },
    {
      "id": "hvpkk4i",
      "text": "$10 she tells him the next time she throws a bitch fit over something stupid",
      "timestamp": "2022-02-05 15:57:09",
      "score": 70,
      "num_children": 1,
      "replies": [
        {
          "id": "hvrvg2q",
          "text": "This. This is the one.",
          "timestamp": "2022-02-06 02:38:03",
          "score": 9,
          "num_children": 1,
          "author": 301831,
          "replies": [
            {
              "id": "hvwolq4",
              "text": ".:.. that makes no sense. punctuation saves lives mate!",
              "timestamp": "2022-02-07 04:59:03",
              "score": 0,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hvpr46i",
      "text": "Catcalling, like almost everything feminists complain about, is exceptionally rare in the US and limited to highly urban environments. I live in affluent white suburbs and I've never seen a single instance of catcalling in my life (40 yrs).",
      "timestamp": "2022-02-05 16:41:26",
      "score": 69,
      "num_children": 7,
      "author": 19561,
      "replies": [
        {
          "id": "hvqx3cv",
          "text": "I've seen it once -- when the managers at work did a \"kiss the pig\" fundraiser.",
          "timestamp": "2022-02-05 22:16:17",
          "score": 6,
          "num_children": 0,
          "author": 233031,
          "replies": []
        },
        {
          "id": "hxq31ft",
          "text": "People really got on my shit for being skeptical of the claim that most women experienced this",
          "timestamp": "2022-02-20 17:16:34",
          "score": 3,
          "num_children": 0,
          "author": 352347,
          "replies": []
        },
        {
          "id": "hvrytvz",
          "text": "nope, i’ve seen it happen a lot and i live in a small town in iowa.",
          "timestamp": "2022-02-06 03:04:44",
          "score": 1,
          "num_children": 2,
          "author": 55455,
          "replies": [
            {
              "id": "hvwonyk",
              "text": "lies",
              "timestamp": "2022-02-07 04:59:37",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hvwqs5k",
                  "text": "?? bro what",
                  "timestamp": "2022-02-07 05:18:56",
                  "score": 1,
                  "num_children": 0,
                  "author": 55455,
                  "replies": []
                }
              ]
            },
            {
              "id": "hvwt53c",
              "text": "shouldnt it be skeet, then yeet?🤣",
              "timestamp": "2022-02-07 05:41:18",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hvvmowy",
          "text": "Rare? I'm 13 and I've already been catcalled 3 times.",
          "timestamp": "2022-02-07 00:00:04",
          "score": 0,
          "num_children": 4,
          "author": 231310,
          "replies": [
            {
              "id": "hvvn0i0",
              "text": "Your post history reveals you are a lying troll. Adios",
              "timestamp": "2022-02-07 00:02:30",
              "score": 5,
              "num_children": 1,
              "author": 19561,
              "replies": [
                {
                  "id": "hvvnxiv",
                  "text": "How am I a lying troll? Because I speak out against men like you?",
                  "timestamp": "2022-02-07 00:09:20",
                  "score": 0,
                  "num_children": 1,
                  "author": 231310,
                  "replies": [
                    {
                      "id": "hvwornp",
                      "text": "if you’re 13, you shouldn’t be soeaking at all. bc you LITERALLY know nothing about anything. back to the books kid",
                      "timestamp": "2022-02-07 05:00:31",
                      "score": 3,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hvwooid",
              "text": "more lies",
              "timestamp": "2022-02-07 04:59:45",
              "score": 2,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hvx2h2t",
              "text": "I believe you sis. I started experiencing catcalling as a young teenager as well. It’s sad.",
              "timestamp": "2022-02-07 07:20:57",
              "score": 1,
              "num_children": 0,
              "author": 268918,
              "replies": []
            },
            {
              "id": "hwzh3lo",
              "text": "I constantly got told how handsome i looked by older women, even in front of my mom. And i was only 12. Your point?",
              "timestamp": "2022-02-15 02:23:24",
              "score": 1,
              "num_children": 1,
              "author": 219923,
              "replies": [
                {
                  "id": "hwzss9r",
                  "text": "Bro I'm literally on your side. I am fully aware that woman can make uncomfortable and unsolicited comments to men as well. My point? Catcalling happens to young children all the time. You, 12. Me, 13. Others, much younger. But this post, or this comment, is saying that catcalling doesn't exist and how it isn't rare. You are purely trying to start an argument with me.",
                  "timestamp": "2022-02-15 03:57:46",
                  "score": 1,
                  "num_children": 1,
                  "author": 231310,
                  "replies": [
                    {
                      "id": "hxchwk6",
                      "text": "I still don't like you.",
                      "timestamp": "2022-02-17 19:23:47",
                      "score": 1,
                      "num_children": 1,
                      "author": 219923,
                      "replies": [
                        {
                          "id": "hxf1pv8",
                          "text": "The only reason you don't like me is bc I'm a feminist. Get a life. You still hate feminists even when their always on your side.",
                          "timestamp": "2022-02-18 06:51:55",
                          "score": 1,
                          "num_children": 2,
                          "author": 231310,
                          "replies": [
                            {
                              "id": "hxf1yox",
                              "text": "Any movement that paints me as q villain for having a penis is a hate group. The alt right hates me dor being black, so now the alt left hates me for being a man? Fuck that!",
                              "timestamp": "2022-02-18 06:54:48",
                              "score": 1,
                              "num_children": 1,
                              "author": 219923,
                              "replies": [
                                {
                                  "id": "hxis561",
                                  "text": "I'm sorry you feel that way, but feminists do not hate men. What we don't like is inequality. Weather you choose to believe it or not, it does exist. Woman experience sexism everyday, and feminists are working to stop it. You might here feminists say \"I hate all men\" which isn't okay to say, but what they mean is that they hate the things some men do to woman",
                                  "timestamp": "2022-02-19 01:00:12",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 231310,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hxf3516",
                              "text": "I hate feminists. It's a gratuitous movement in a society where women have the most privilege.",
                              "timestamp": "2022-02-18 07:08:41",
                              "score": 1,
                              "num_children": 1,
                              "author": 219923,
                              "replies": [
                                {
                                  "id": "hxisdck",
                                  "text": "I'm sorry? Explain situations where women have more privilege",
                                  "timestamp": "2022-02-19 01:01:59",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 231310,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hvwz0j5",
          "text": "wow you've never seen it so it must not be true, what fact is backing your knowledge sir? because i can name multiple instances where it has happened and multiple sites that prove you wrong.",
          "timestamp": "2022-02-07 06:41:39",
          "score": 0,
          "num_children": 0,
          "author": 66512,
          "replies": []
        },
        {
          "id": "hvqkbyr",
          "text": "[deleted]",
          "timestamp": "2022-02-05 20:37:06",
          "score": -21,
          "num_children": 1,
          "replies": [
            {
              "id": "hvqnhwk",
              "text": "So are you dumb enough to think that every community has the same problems? Catcalling is equally a problem in New York City and Charlotte? Same situation in Billings and Orlando?\n\nGet real",
              "timestamp": "2022-02-05 21:02:43",
              "score": 19,
              "num_children": 1,
              "author": 19561,
              "replies": [
                {
                  "id": "hvqqrzh",
                  "text": "[deleted]",
                  "timestamp": "2022-02-05 21:28:18",
                  "score": -15,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hvqt84v",
                      "text": "You are an idiot. Feel better now?\n\nWhen you provide catcalling research by community, write back. Until then, fuck off",
                      "timestamp": "2022-02-05 21:47:01",
                      "score": 6,
                      "num_children": 1,
                      "author": 19561,
                      "replies": [
                        {
                          "id": "hvqtb0p",
                          "text": "[deleted]",
                          "timestamp": "2022-02-05 21:47:38",
                          "score": -12,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hvqv7ut",
                              "text": "I'm not emotional. Just don't care about you at all.",
                              "timestamp": "2022-02-05 22:01:58",
                              "score": 6,
                              "num_children": 0,
                              "author": 19561,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hy1dwig",
          "text": "This statement is so fucking false its actually tone deaf",
          "timestamp": "2022-02-23 00:37:44",
          "score": 0,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hvpddpk",
      "text": "So many women get the sexual attention the average man could only dream of and all they can do is whine about it",
      "timestamp": "2022-02-05 15:05:32",
      "score": 120,
      "num_children": 7,
      "author": 97840,
      "replies": [
        {
          "id": "hvs0e1m",
          "text": "But recently an article was posted to a news site of a woman who had a breakdown because she went to a bar alone and no one talked to her or tried to hit on her.  You literally can't win.",
          "timestamp": "2022-02-06 03:17:00",
          "score": 10,
          "num_children": 0,
          "author": 106790,
          "replies": []
        },
        {
          "id": "hvpejko",
          "text": "I understand that and I’m not a feminist by any means (I’m a MRA and anti feminist lol) but you do realize that random sexual comments, being sexually harassed, and having people continue with sexual comments and such after you’ve asked them to stop and said no many times isn’t something you should dream of?? Catcalling is really weird and gross lmao",
          "timestamp": "2022-02-05 15:14:07",
          "score": 46,
          "num_children": 3,
          "author": 381950,
          "replies": [
            {
              "id": "hvpkwnc",
              "text": "I mean... excessive catcalling, sure. If they don't stop after you've told them you don't like it, that's sexual harassment, isn't it? But catcalling in general isn't bad. Some women like it. Just know when to stop, I guess.",
              "timestamp": "2022-02-05 15:59:33",
              "score": 35,
              "num_children": 2,
              "author": 185955,
              "replies": [
                {
                  "id": "hvplu68",
                  "text": "And also if it's actually fucking catcalling...\n\n\\-------------------------- \n\n\"HEY!.. NICE TITS BABY!!\" - catcalling.\n\n\"excuse miss... would you happen to know which way is \"x\" street?\" - NOT catcalling.",
                  "timestamp": "2022-02-05 16:05:54",
                  "score": 42,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hvrm5st",
                      "text": "Exactly!",
                      "timestamp": "2022-02-06 01:26:49",
                      "score": 3,
                      "num_children": 0,
                      "author": 381950,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hvrmeat",
                  "text": "Agreed. I still think catcalling is kinda weird but maybe thats cuz I’m a woman lol. I think there’s a line between blatant creepiness/sexual harassment territory vs “hey can I get your number?” And saying sorry if she says no. My point was the “hey I wonder how that ass feels” is creepy and weird from a random stranger regardless if they stop or not. Like I said maybe it’s cuz I’m a woman so I view it differently than men feminist or not I think majority of women are against it.",
                  "timestamp": "2022-02-06 01:28:41",
                  "score": 3,
                  "num_children": 1,
                  "author": 381950,
                  "replies": [
                    {
                      "id": "hvs9c7o",
                      "text": "I mean, you're probably right on that one. That sorta thing is creepy. But I mean, the line is... maybe slightly above where you said? I think anything past \"That <insert article of clothing> looks good on you!\" is risky territory. Maybe not off limits but you'd be playing with fire.",
                      "timestamp": "2022-02-06 06:56:33",
                      "score": 3,
                      "num_children": 0,
                      "author": 185955,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "hvt6dz7",
              "text": "I agree but I honesty wouldn't mind it happening to me, I'd be over the moon.",
              "timestamp": "2022-02-06 13:44:24",
              "score": 1,
              "num_children": 0,
              "author": 404040,
              "replies": []
            },
            {
              "id": "hvwoxez",
              "text": "i agree. its disgusting childish and possibly dehumanizing, but only to the weakest of mind and spirit. “sticks and stones” and all that jazz",
              "timestamp": "2022-02-07 05:01:59",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hvq5mea",
          "text": "Idk why reddit recommended me this post but it did. was curious to check out the comments considering the sub it's on so here I am. \n\nI'm a woman. I was first catcalled when I was 9y/o walking home from the bus stop after the school bus dropped me off. a few older guys (probably in their 20s) blew whistles and started commenting when I walked by. I was a literal child back then. Didn't even know the word 'sex' let alone 'sexual attention'. I never told anyone at home because I didn't know what happened in the first place. I felt weird/disgusted. Couldn't get it out of my head for a few days. I was able to move past it but never forgot the incident. \n\nin case you're wondering \"but what were you wearing??\" , I was wearing the school uniform i.e, trousers, shirt, sweater, school shoes.\n\nthis wasn't the last incident. many more followed after that. for A LOT of us (people who have been catcalled), it started before the age of 10. would you still tell us to \"stop whining and enjoy since you're getting attention from men\".  to add something to this, I'm a lesbian(not because of this incident, i already had crushes on girls since i was 4-5) I'm definitely not looking for attention from men.",
          "timestamp": "2022-02-05 18:23:51",
          "score": 3,
          "num_children": 3,
          "author": 253804,
          "replies": [
            {
              "id": "hvr43dp",
              "text": "Your experience is valid. We may not agree much with feminists here, but we don't hate women.\n\nWhat you were wearing is only important as far as context goes, it never means you deserve to feel unsafe. Did you feel unsafe? Like were the circumstances more than just some random dudes being creepy?",
              "timestamp": "2022-02-05 23:08:23",
              "score": 6,
              "num_children": 1,
              "author": 105870,
              "replies": [
                {
                  "id": "hvrxrwp",
                  "text": "What I was wearing doesn't matter i know that. I just mentioned it because I've seen plenty of people ask that before even a \"I'm sorry you had to go through that\". I wasn't trying to say that all the people here hate women I'm sorry if it came that way but that person literally said something that I thought was bs. \n\nit was broad daylight and there were people around but they could've followed me if they wanted and i wouldn't have been able to do anything because we're not really taught to deal with these kinda situations. even if they were *just* being creepy, it still doesn't justify their actions. it's still wrong",
                  "timestamp": "2022-02-06 02:56:22",
                  "score": 4,
                  "num_children": 1,
                  "author": 253804,
                  "replies": [
                    {
                      "id": "hvwpf7m",
                      "text": "catcalling and pedo behavior are not comparable in any sense of the word. stop associating the two. and lets keep this discussion about ADULTS WITH REAL LIFE PROBLEMS (talking to you slugbgrry)",
                      "timestamp": "2022-02-07 05:06:25",
                      "score": 2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hvxx8yy",
                          "text": "so according to you, ADULT WOMEN getting murdered for ignoring/ rejecting a stranger who catcalled them is not a real life problem?",
                          "timestamp": "2022-02-07 13:28:09",
                          "score": 1,
                          "num_children": 1,
                          "author": 253804,
                          "replies": [
                            {
                              "id": "hvxxe4w",
                              "text": "murder and catcalling are not synonymous. stop withbthe emotional false equivalencies please and thank you. child",
                              "timestamp": "2022-02-07 13:29:21",
                              "score": 2,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hvxxryb",
                                  "text": "catcalling in some cases leads to murder, acid attacks, rapes etc. but I guess connecting the dots isn't your cup of tea. \n\nI'll gladly be a smart kid than an adult with the wit of a donkey. have a great day/night",
                                  "timestamp": "2022-02-07 13:32:39",
                                  "score": 1,
                                  "num_children": 3,
                                  "author": 253804,
                                  "replies": [
                                    {
                                      "id": "hwzhxkn",
                                      "text": "Considering that most crimes are commited by people the victim knows, i call bull on your claim.",
                                      "timestamp": "2022-02-15 02:30:01",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 219923,
                                      "replies": [
                                        {
                                          "id": "hx4xcn0",
                                          "text": "tell that to all the acid attack victims and rape survivors in my country. you can be an anti feminist but still believe women but nah you're determined to do the opposite",
                                          "timestamp": "2022-02-16 05:08:31",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 253804,
                                          "replies": [
                                            {
                                              "id": "hx4ysxm",
                                              "text": "I only believe evidence. Women have capitalized on fake rape accusations, so blame them.",
                                              "timestamp": "2022-02-16 05:22:36",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 219923,
                                              "replies": [
                                                {
                                                  "id": "hx50gdl",
                                                  "text": "Just making sure that we're on the same page, I'm most talking about*my* country which isn't the US or anywhere in the west for that matter",
                                                  "timestamp": "2022-02-16 05:39:17",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 253804,
                                                  "replies": [
                                                    {
                                                      "id": "hx50wwd",
                                                      "text": "OH, you mean the places where feminism IS ACTUALLY needed. My bad, I take back all the messed up stuff I said.",
                                                      "timestamp": "2022-02-16 05:44:00",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "author": 219923,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "hvxy0lb",
                                      "text": "wow. gaslighting and lumping for emotional validation. im GenX kiddo. youre F’ed from my perspective 🤣🤣🤣 best of luck",
                                      "timestamp": "2022-02-07 13:34:40",
                                      "score": 1,
                                      "num_children": 0,
                                      "replies": []
                                    },
                                    {
                                      "id": "hvxy4e8",
                                      "text": "oh. and donkeys are extremely intelligent. you could be so lucky",
                                      "timestamp": "2022-02-07 13:35:32",
                                      "score": 1,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hvvlx81",
              "text": "I'm 13, first time I was catcalled was 12 years old. I was wearing my school uniform, probably the most modest thing I could have possibly been wearing. The boys at my school make comments about my body all the time. I feel disgusting. The comments these men are making are so hurtful..I'm appalled people even think like this. So disappointed.",
              "timestamp": "2022-02-06 23:54:16",
              "score": 2,
              "num_children": 0,
              "author": 231310,
              "replies": []
            },
            {
              "id": "hwzhpnp",
              "text": "I don't really care or find you valid at all. In fact you're a thin-skinned nuisance.",
              "timestamp": "2022-02-15 02:28:18",
              "score": 1,
              "num_children": 1,
              "author": 219923,
              "replies": [
                {
                  "id": "hx4xnyt",
                  "text": "i don't really care about your opinion? you can say earth is flat and I'd still feel bad for you. i also feel bad for all the women in your life especially your mom because*damn* it must be hard for her",
                  "timestamp": "2022-02-16 05:11:34",
                  "score": 1,
                  "num_children": 1,
                  "author": 253804,
                  "replies": [
                    {
                      "id": "hx4z0v4",
                      "text": "My mom is dead, you uppity c**t. And I respect the women of my life. I just hate you. Don't extrapolate my disdain for you onto them.",
                      "timestamp": "2022-02-16 05:24:47",
                      "score": 1,
                      "num_children": 1,
                      "author": 219923,
                      "replies": [
                        {
                          "id": "hx50rd4",
                          "text": "I'm sorry for your loss \n\n\nyou respect the women in your life but if someone was to tell you that she got catcalled while on her way to meet up with you and then got a rape threat by the same stranger for ignoring him, i bet you'd react the best way possible. ignore her and tell her what she experienced didn't happened. got it! \n\nyou hate the one teenager in the world who is already a queer woman in a third world country because she talked about her experience and you(a privileged person) didn't like it because they haven't seen/experienced it themselves",
                          "timestamp": "2022-02-16 05:42:25",
                          "score": 1,
                          "num_children": 2,
                          "author": 253804,
                          "replies": [
                            {
                              "id": "hx51alg",
                              "text": "I'm a black male. I have no privileges. Go to hell. I don't owe you anything, even sympathy. You are not anyone I care about, and whatever happens to you has no impact on me. I only care about my small circle of friends. Not the world. Not you.",
                              "timestamp": "2022-02-16 05:47:52",
                              "score": 1,
                              "num_children": 0,
                              "author": 219923,
                              "replies": []
                            },
                            {
                              "id": "hx5236d",
                              "text": "What reason or incentive would I have to believe or trust you? You're a complete stranger to me. Being a woman from the alphabet community doesn't automatically make you some saint who should always be believed.",
                              "timestamp": "2022-02-16 05:56:08",
                              "score": 1,
                              "num_children": 1,
                              "author": 219923,
                              "replies": [
                                {
                                  "id": "hx52qp4",
                                  "text": "I never said you should believe me or sympathize with me? \n\nJust don't come up here gaslighting me into thinking that what I experienced didn't happen and I'm bullsh**ing. If you can't care about anyone else but the people around you, that doesn't mean you have to be a bitch to everyone else. You don't believe me? don't reply to my comment. simple as that. i didn't ask you for your validation. \n\nbeing a black man that too probably in a western country doesn't make you a saint who can never do wrong things either. I bet you hav better things to do than argue with someone because i know I do. Hope you have a good day/night. \n\nincase you still didn't get it: there's no need to reply to this (or any of my) comment either.",
                                  "timestamp": "2022-02-16 06:03:04",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 253804,
                                  "replies": [
                                    {
                                      "id": "hxch19m",
                                      "text": "No one is gaslighting you. It's noy gaslighting to take a neutral position and say that I don't trust you without evidence. I also hate you, and DONT CARE about what happened to you. Even if you were a sex slave for Epstein himself. No one is trying to manipulate you. I'm straight up saying that I don't care about you, even if there's proof you're telling the truth.",
                                      "timestamp": "2022-02-17 19:18:22",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 219923,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hvpilhd",
          "text": " Imagine you decided to go to the grocery store, let's say you're wearing a hoodie and some jeans. Now, on your way there this HUGE guy, like, a good 4-5 inches taller, who has a muscle structure and strength you could never wish to achieve, is leering at you, shouting how fuckable you are, and what he would do to you. Even decides to follow you for a while. The only thing you can do is walk faster, or politely try to joke him away, because deescalation is the only safe option you have. Feels nice, right? \n That is the kind of sexual attention woman \"whine about\". I'm in no way a feminist, but I'm sick and tired of people minimizing actual creepy fucking guys making us feel unsafe and uncomfortable.",
          "timestamp": "2022-02-05 15:43:35",
          "score": -4,
          "num_children": 10,
          "author": 374773,
          "replies": [
            {
              "id": "hvqs8rd",
              "text": "You described something different from catcalling. Catcalling usually doesn't include following the person. Way to move the goalposts.\n\nIf some huge guy complemented my looks, I'd laugh it off and move on.",
              "timestamp": "2022-02-05 21:39:29",
              "score": 12,
              "num_children": 1,
              "author": 104517,
              "replies": [
                {
                  "id": "hvr0log",
                  "text": "I described a personal experience. It started out as the creep just screaming that he \"would ruin my ass and pretty face\" and then followed me down a few blocks, after i ignored him. My initial response was to a comment that said we \"whine about sexual attention\", not just catcalling.  There's a big difference between \"Hey, i think you're gorgeous/pretty/cute\" (you know, a genuine compliment) and explicit descriptions of what that person would do to you.(catcalling and actual sexual harassment). The first would make my day and boost my confidence, the later would make me uncomfortable, and very aware of the biological disadvantages in strength and size that i have. There's a difference",
                  "timestamp": "2022-02-05 22:42:31",
                  "score": 1,
                  "num_children": 0,
                  "author": 374773,
                  "replies": []
                }
              ]
            },
            {
              "id": "hvpnbjq",
              "text": "Yea, that happens every time you go to the grocery store right! Must be so difficult in your world, with all these creeps constantly harassing you",
              "timestamp": "2022-02-05 16:16:09",
              "score": 28,
              "num_children": 2,
              "author": 220394,
              "replies": [
                {
                  "id": "hvq4ws8",
                  "text": "Strawman much? Never once did i say that it happens every day, and that those harassments happen \"constantly\". I was just trying to get across how uncomfortable and unsafe those situations feel. Get some perspective and empathy.  Would you honestly be comfortable with a man making those kinds of comments to you?\nNo, i do not find a guy trying to get to know a girl or just complimenting her to \nbe \"creepy\", or a soon to be rapist. That's fucking stupid. But equating honest to god harassment to just attention is disgustinga",
                  "timestamp": "2022-02-05 18:15:25",
                  "score": -7,
                  "num_children": 2,
                  "author": 374773,
                  "replies": [
                    {
                      "id": "hvq5tqb",
                      "text": "but you have still invented a story taken to extremes to show how hard it is to be a woman. No one is saying that bad things dont happen and that creeps dont exist.\n\nYou decided to make a comment about how women have it worse when every piece of evidence says that men are more likely victims of violent crime.",
                      "timestamp": "2022-02-05 18:25:54",
                      "score": 6,
                      "num_children": 1,
                      "author": 220394,
                      "replies": [
                        {
                          "id": "hvq6deq",
                          "text": "Dude, you honestly should get a medal for those mental gymnastics. All i said was catcalling, i.e blatant disgusting sexual remarks, makes women feel unsafe and uncomfortable. Described how it actually feels.That it's a bad thing and not 'positive attention\". THAT'S IT. Never once did i say that \"all men are rapists\" or that they're all creepy. Please stop putting words into my mouth",
                          "timestamp": "2022-02-05 18:31:11",
                          "score": -3,
                          "num_children": 0,
                          "author": 374773,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hvq7cxw",
                      "text": "And your \"example\" wasn't a strawman?",
                      "timestamp": "2022-02-05 18:39:20",
                      "score": 5,
                      "num_children": 1,
                      "author": 213390,
                      "replies": [
                        {
                          "id": "hvq7vzl",
                          "text": "My example was a detailed description of how sexual harassment actually feels. To point out that it is no way a positive thing.\nHow is that a strawman, exactly?",
                          "timestamp": "2022-02-05 18:43:47",
                          "score": 3,
                          "num_children": 1,
                          "author": 374773,
                          "replies": [
                            {
                              "id": "hvq8xjs",
                              "text": "The discussion is about \"cat calling\". Your \"example\" was of being stalked: \"Even decides to follow you for a while.\"",
                              "timestamp": "2022-02-05 18:52:57",
                              "score": 6,
                              "num_children": 1,
                              "author": 213390,
                              "replies": [
                                {
                                  "id": "hvqaoq1",
                                  "text": "My \"example\" is a personal experience of being cat called and followed for a few streets.  That behaviour is vile. How is me sharing my own experience to point out that it is not positive sexual attention and should be taken seriously, in response to OP's comment a strawman? I thought only rabid feminists ignore experiences and perspectives if it does not follow their naritive.",
                                  "timestamp": "2022-02-05 19:06:31",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 374773,
                                  "replies": [
                                    {
                                      "id": "hvqbqh3",
                                      "text": "And... now you are changing the subject.\n\nI answered your question.  You either don't know what a strawman is, or are simply unwilling to admit you were wrong.",
                                      "timestamp": "2022-02-05 19:14:23",
                                      "score": 5,
                                      "num_children": 1,
                                      "author": 213390,
                                      "replies": [
                                        {
                                          "id": "hvqcu3c",
                                          "text": "I have a feeling you don't know what a strawman is. \nOP: woman whine about sexual attention\nMe: it's not positive attention, here's a detailed description from personal experience of what's it like.\n\nAnd yeah, if you check back to OP's comment, no where did he specify \"catcalling\", just \"sexual attention\" \n\nSo where exactly is the strawman? This is just getting ridiculous.",
                                          "timestamp": "2022-02-05 19:22:57",
                                          "score": 3,
                                          "num_children": 0,
                                          "author": 374773,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hvprvt8",
                  "text": "where did the person above imply that it happens every time?\n\nedit: y’all downvoted me for asking a question damn",
                  "timestamp": "2022-02-05 16:46:26",
                  "score": -11,
                  "num_children": 1,
                  "author": 274666,
                  "replies": [
                    {
                      "id": "hvpsdgh",
                      "text": "Does it matter, its a fantasy story jumping to an insane conclusion that every man who gives you a compliment is a trying to rape you, thats what that comment is",
                      "timestamp": "2022-02-05 16:49:37",
                      "score": 18,
                      "num_children": 1,
                      "author": 220394,
                      "replies": [
                        {
                          "id": "hvpsrwi",
                          "text": "no it’s not, the example OP gave was someone shouting how fuckable someone is, and that i don’t think is a compliment. and where did OP’s comment imply that every man who compliments you is trying to rape you? OP said, and I quote\n\n> I’m sick and tired of people minimizing actual creepy fucking guys making us feel unsafe and uncomfortable.\n\nOP is talking about guys who are creepy, not guys in general.",
                          "timestamp": "2022-02-05 16:52:14",
                          "score": -5,
                          "num_children": 2,
                          "author": 274666,
                          "replies": [
                            {
                              "id": "hvptxma",
                              "text": "Women find normal guys, so creepy, a guy strolling the neighborhood, is equated with a stalker.",
                              "timestamp": "2022-02-05 16:59:47",
                              "score": 14,
                              "num_children": 1,
                              "author": 186492,
                              "replies": [
                                {
                                  "id": "hvpub5u",
                                  "text": "it’s no lie that there are *some* men out there who can be creepy, no doubt about that right? i know and agree that there is a number of women who consider some men to be creepy for the randomest things, and i find that distasteful as well. but OP isn’t talking about a situation where the guy is a normal guy, she mentioned that in this situation the man says something extremely distasteful.",
                                  "timestamp": "2022-02-05 17:02:15",
                                  "score": -2,
                                  "num_children": 1,
                                  "author": 274666,
                                  "replies": [
                                    {
                                      "id": "hvq5cra",
                                      "text": "I'm not saying creepy guys don't exist. I'm saying women apply this label so broadly it's turning into the new racism. I know a guy who literally was that story. is a personal one, a friend was labeled a creepy stalker for roaming a neighborhood he lived in, commiting no crimes, just smiling and waving. What are guys supposed to do at that point, sit at home 24/7? Or leave and be labeled a creep. Maybe walk around and attempt social interactions? Nope, as the video of a woman walking around new york shows, you shouldn't even attempt that.",
                                      "timestamp": "2022-02-05 18:21:08",
                                      "score": 6,
                                      "num_children": 1,
                                      "author": 186492,
                                      "replies": [
                                        {
                                          "id": "hvq5rhj",
                                          "text": "i agree, as i stated on my comment above, it is distasteful when some women do that. it is not something that i condone and i don’t speak for everyone but i would find it weird if someone close to me found nothing wrong with it.\n\ni don’t think we disagree, i was just saying that i don’t think OP isn’t acting like the type of person both of us are talking about. OP was providing a perspective on a comment which was also talking about women. \n\nhave a nice day",
                                          "timestamp": "2022-02-05 18:25:19",
                                          "score": 0,
                                          "num_children": 1,
                                          "author": 274666,
                                          "replies": [
                                            {
                                              "id": "hvqj4xy",
                                              "text": "I guess now my question would be, what's your point?",
                                              "timestamp": "2022-02-05 20:24:53",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 186492,
                                              "replies": [
                                                {
                                                  "id": "hvrsxp1",
                                                  "text": "my point isn’t to do with your comments, you replied to one of mine and thus we had this conversation. i was replying to someone else, you can scroll up and see.",
                                                  "timestamp": "2022-02-06 02:18:43",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "author": 274666,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hvptg54",
                              "text": "the entire story is about a guy getting a confidence boost from being cat called, then someone decided to change a story to a warped version 'well its worse when it happens to us because we get stalked and raped!', its exactly the same as the usual bs from feminists, doesnt matter what happens to a man, they will twist a story and imagine women have it worse, men die in war, women most affected, this right here is the exact same thing",
                              "timestamp": "2022-02-05 16:56:37",
                              "score": 8,
                              "num_children": 1,
                              "author": 220394,
                              "replies": [
                                {
                                  "id": "hvptxja",
                                  "text": "but OP replied to a comment that specifically talked about women. OP responded to another comment which was also talking about women and provided a different perspective. how did OP say it’s worse when it happens to women? OP possibly tried to portray that catcalling is bad by providing a hypothetical situation.",
                                  "timestamp": "2022-02-05 16:59:47",
                                  "score": 5,
                                  "num_children": 0,
                                  "author": 274666,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hvpomp6",
              "text": "That's a weird way to describe a reddit mod.",
              "timestamp": "2022-02-05 16:24:55",
              "score": 3,
              "num_children": 0,
              "author": 19115,
              "replies": []
            },
            {
              "id": "hvqqo4a",
              "text": "As a tall well built man, every occasion out involving a venue serving alcohol will have guys, esp the short gym rat “bro dudes” trying to prove a point by attempting to pick a fight with me whilst intoxicated. It’s a real physical threat to my well being and one wrong occasion getting out of hand could change the trajectory of my life permanently. So yes, de escalation as a skill is a fine art to be learned as part of social skills in general. I don’t just “feel” unsafe or uncomfortable, but have a very real threat of my skull being caved in because someone wants to feel macho.",
              "timestamp": "2022-02-05 21:27:28",
              "score": 2,
              "num_children": 1,
              "author": 73960,
              "replies": [
                {
                  "id": "hvqyejn",
                  "text": "Men are statistically more likely to be victims of violent crime. And i am in no way minimizing the dangers and disadvantages of your gender. My response was to a comment That minimized actual sexual harassment, called it sexual attention, that we whined about. My comment was describing a situation that i experienced, showing just how uncomfortable and sometimes scary those kinds of vile comments and advances can feel.",
                  "timestamp": "2022-02-05 22:26:05",
                  "score": 2,
                  "num_children": 0,
                  "author": 374773,
                  "replies": []
                }
              ]
            },
            {
              "id": "hvvibuv",
              "text": ">there this HUGE guy, like, a good 4-5 inches taller, who has a muscle structure and strength you could never wish to achieve, is leering at you, shouting how fuckable you are\n\nBut i ain't intimidated by guys bigger than me. \n\n>The only thing you can do is walk faster, or politely try to joke him away\n\nI can also tell him to get lost or he's gonna catch these hands! I am not a helpless child, i know how to stand up for myself&defend myself.",
              "timestamp": "2022-02-06 23:27:55",
              "score": 2,
              "num_children": 0,
              "author": 221208,
              "replies": []
            },
            {
              "id": "hvptpxr",
              "text": "That's equating the vast minority of incidents with what normally happens. Women are not followed by men daily, nor is this a common occurrence in Western society.",
              "timestamp": "2022-02-05 16:58:23",
              "score": 8,
              "num_children": 0,
              "author": 186492,
              "replies": []
            },
            {
              "id": "hvpofna",
              "text": "Agreed. People who try to minimize this are incels lmao",
              "timestamp": "2022-02-05 16:23:36",
              "score": -11,
              "num_children": 0,
              "author": 361344,
              "replies": []
            },
            {
              "id": "hvr77eb",
              "text": "That’s not catcalling.",
              "timestamp": "2022-02-05 23:31:41",
              "score": 1,
              "num_children": 0,
              "author": 119846,
              "replies": []
            },
            {
              "id": "hwzi2fi",
              "text": "There's feeling unsafe and there's BEING IN IMMINENT DANGER. Just because you're too afraid if the world doesn't mean that you're automatically in danger.",
              "timestamp": "2022-02-15 02:31:04",
              "score": 1,
              "num_children": 0,
              "author": 219923,
              "replies": []
            },
            {
              "id": "hvqrai5",
              "text": "Which isn't going to happen or amount to anything because unless big straw man is a sociopath, they don't want to be detained or possibly registered as a sex offender. So no, your post is a false dichotomy. The fact is women have more privileges, more legal recourse, more assumption of innocence and correctness, and they are over reacting.",
              "timestamp": "2022-02-05 21:32:16",
              "score": -2,
              "num_children": 1,
              "replies": [
                {
                  "id": "hvqzadl",
                  "text": "Except i was describing a personal experience, and just how it felt in response to OP'S comment calling it \"sexual attention, that we whine about\". Thank god situations like that only happened a handful of times in my life time, and i do not think that 99,9% of men are like that. And the whole nobody will do that, because they can get arrested argument... Really? Crime doesn't exist? Usually, the demented creeper's who act like that don't really take consequences into consideration. How does me trying to point out that sexual harassment is not just something we \"whine about\" and is a rather scary thing, have anything to do with our privilege in the court system?",
                  "timestamp": "2022-02-05 22:32:38",
                  "score": 3,
                  "num_children": 0,
                  "author": 374773,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hvqpzd3",
          "text": "men and women think very differently men like it, women don’t",
          "timestamp": "2022-02-05 21:22:07",
          "score": -1,
          "num_children": 1,
          "author": 255741,
          "replies": [
            {
              "id": "hvrnlq7",
              "text": "It’s more of WHO likes it rather than the gender.",
              "timestamp": "2022-02-06 01:38:03",
              "score": 5,
              "num_children": 0,
              "author": 60645,
              "replies": []
            }
          ]
        },
        {
          "id": "hvvljzv",
          "text": "Listen here. I am a 13 year old girl. I have been catcalled on the street 3 times. I have been whistled at, honked at, pointed at. The boys at my school have discussions about how much they want to have sex with me and what they want to do to me. They will randomly tell me how sexy I look in whatever outfit and CONSTANTLY point out how my body looks. I will never see myself the same way. I have no self esteem. They have made me only be able to see myself as a sexual object. I am 13! Why do you think it's okay for random men to make sexual comments to young women? (and before you ask, \"wElL wHat wErE yOu wEaRiNg\" a fucking school uniform is what I was wearing.",
          "timestamp": "2022-02-06 23:51:34",
          "score": 1,
          "num_children": 1,
          "author": 231310,
          "replies": [
            {
              "id": "hvwimiw",
              "text": "Usually when guys view girls as sex objects it’s because they don’t have much to offer other than their body’s",
              "timestamp": "2022-02-07 04:07:37",
              "score": 1,
              "num_children": 1,
              "author": 97840,
              "replies": [
                {
                  "id": "hvwjm6i",
                  "text": "No you're so right, it's my fault that I look the way I do. Not their fault for saying disrespectful things. It's mine! Thanks for opening my eyes",
                  "timestamp": "2022-02-07 04:15:49",
                  "score": 1,
                  "num_children": 1,
                  "author": 231310,
                  "replies": [
                    {
                      "id": "hvwpt4z",
                      "text": "he may have meant the BOYS have nothing more to offer. but at this point, i think youre a troll an adult and a predator. i think you shld go away before things become difficult for you.",
                      "timestamp": "2022-02-07 05:09:56",
                      "score": 2,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hvzfaqn",
          "text": "Sexual attention does not equal good attention in an environment where it’s unwarranted",
          "timestamp": "2022-02-07 19:37:59",
          "score": 1,
          "num_children": 0,
          "author": 131219,
          "replies": []
        }
      ]
    },
    {
      "id": "hvqlaoy",
      "text": "Women hate getting catcalled **by men they're not attracted to**.",
      "timestamp": "2022-02-05 20:45:07",
      "score": 21,
      "num_children": 1,
      "author": 5211,
      "replies": [
        {
          "id": "hvwpub8",
          "text": "exactly",
          "timestamp": "2022-02-07 05:10:14",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hvq6f3x",
      "text": "What an amazing spouse. Going above and beyond the call of duty by ambushing her husband (and mocking him afterward) in order to artificially boost his self-confidence but mainly to make her point. Humanitarian of the year.",
      "timestamp": "2022-02-05 18:31:34",
      "score": 13,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hvwqabj",
      "text": "last xmas i was in a bar, part of the “Santa Crawl” xmas bar crawl. im 40. divorced. was looking pretty good that night. place was packed w college kids. my friends at the time were in their mid 20’s. anyway, got groped multiple times on my trips to the bar. didnt even bother looking for the culprits as im not concerned with it. it doesnt affect my self esteem. it doesnt stop me from making money paying bills eating and sleeping. its idiots having fun and it LITERALLY does not hurt me in any way. time for adults to adult, no?",
      "timestamp": "2022-02-07 05:14:20",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hvqnofd",
      "text": "I got catcalled by few girls today and now my self esteem is high again i know this reaction is wrong but i don't feel like ugly shit anymore",
      "timestamp": "2022-02-05 21:04:09",
      "score": 11,
      "num_children": 1,
      "author": 154253,
      "replies": [
        {
          "id": "hvqvpbg",
          "text": "Your reaction isn't \"wrong\" at all. You got catcalled. It's a compliment. However crude it may be considered, it still shows you that someone finds you attractive. You have every right to feel more confident and validated because of it.",
          "timestamp": "2022-02-05 22:05:36",
          "score": 11,
          "num_children": 0,
          "author": 10126,
          "replies": []
        }
      ]
    },
    {
      "id": "hvqup57",
      "text": "I’ve been telling people this. Most men appreciate attention of the sexual nature, regardless of where, who, or how it is done. Obviously if it is becoming way too touchy nearing rape and the man is VERY repulsed by the woman then he won’t like it, BUT men and women will probably not ever understand each other on this.",
      "timestamp": "2022-02-05 21:58:05",
      "score": 7,
      "num_children": 1,
      "author": 61696,
      "replies": [
        {
          "id": "hvtb18q",
          "text": "If u take into account that in a societal context women are seen to be dominated or won over, prey in other words, you can kind of see why they would consider catcalling threatening. Also they are teached by a young age to be afraid of the viles of man, which granted I believe makes them overhaul safer in certain contexts due to being always on the lookout for things like these, but really puts men in a spot to be feared which has certain consequences for them. If anything gender roles are wild, I dont see why we would NEED to follow them.",
          "timestamp": "2022-02-06 14:23:58",
          "score": 1,
          "num_children": 1,
          "author": 86953,
          "replies": [
            {
              "id": "hvwqlxn",
              "text": "wow. some of the words you used aren’t even words. wanna try again?",
              "timestamp": "2022-02-07 05:17:20",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hw7new4",
                  "text": "Nah, is cool if u dont understand complicated sentences, we are in reddit after all",
                  "timestamp": "2022-02-09 11:25:55",
                  "score": 1,
                  "num_children": 0,
                  "author": 86953,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hvprqj9",
      "text": "“i got some women from work to catcall him” is that not fucking weird? \n\nalso, catcalling sucks, regardless of gender. it’s disgusting and i don’t know why some people try to minimise as if it’s not gross",
      "timestamp": "2022-02-05 16:45:28",
      "score": 16,
      "num_children": 0,
      "author": 274666,
      "replies": []
    },
    {
      "id": "hvqsiwa",
      "text": "People offended by a little bit of catcalling are overly sensitive... Just like almost everyone today.",
      "timestamp": "2022-02-05 21:41:36",
      "score": 7,
      "num_children": 1,
      "author": 288573,
      "replies": [
        {
          "id": "hvscur9",
          "text": "Reminds me of that one girl on TV who was complaining that a man went up to her and asked what's wrong when she was crying on the street",
          "timestamp": "2022-02-06 07:40:56",
          "score": 5,
          "num_children": 1,
          "author": 101738,
          "replies": [
            {
              "id": "hvwpy7u",
              "text": "not sure how obscure this clip is you’re referencing but a link may help🤣",
              "timestamp": "2022-02-07 05:11:14",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hvx26kg",
                  "text": "It was on one of Think before you sleep YouTube videos but I can't find it",
                  "timestamp": "2022-02-07 07:17:35",
                  "score": 1,
                  "num_children": 0,
                  "author": 101738,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hvt2y2q",
      "text": "I like how feminists use “catcalling” as if people still do that, this isn’t the 50s. I’ve been around bars and clubs for awhile and I have NEVER witnessed someone being catcalled, much less a woman.",
      "timestamp": "2022-02-06 13:12:22",
      "score": 5,
      "num_children": 1,
      "author": 105469,
      "replies": [
        {
          "id": "hvvne3a",
          "text": "[deleted]",
          "timestamp": "2022-02-07 00:05:19",
          "score": -1,
          "num_children": 1,
          "replies": [
            {
              "id": "hvvnkqb",
              "text": ">13\n\n>catcalled in public\n\nSure kiddo.",
              "timestamp": "2022-02-07 00:06:40",
              "score": 3,
              "num_children": 1,
              "author": 105469,
              "replies": [
                {
                  "id": "hvvnvc1",
                  "text": "You can't fathom the idea of a man catcalling a young girl on the street? I was walking up to my friends, probably 7-10 feet away. Some guy walked passed me, turned around briefly, looked me up and down, and whistled.",
                  "timestamp": "2022-02-07 00:08:53",
                  "score": -2,
                  "num_children": 0,
                  "author": 231310,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hvpiad8",
      "text": "I have been \"catcalled\" by women, (albeit only a couple of times im my whole life) and i did not like it. It made me feel uncomfortable and wanting to get away from the situation. So i understand them in that regard. I've never catcalled women myself.\n\nI have also been butt grabbed from behind by a random girl passing by in the street when i was in scotland in my 20s (im from spain, it was back in the 1999-2000, and that type of behavior is totally unespected in spain. It happened to me twice in edimburgh. Normally the perpetrator was either fat or ugly, needless to say. It is shocking and distasteful... so... yeah, horrible behavior no matter the gender.",
      "timestamp": "2022-02-05 15:41:22",
      "score": 18,
      "num_children": 2,
      "author": 88621,
      "replies": [
        {
          "id": "hvpq48q",
          "text": "I perfectly relate to you. I’ve recently been catcalled by girls and I’ve honestly never felt more weirded out and just straight-up creeped out and annoyed.\n\nI’ve also been groped a few times which was even worse. It’s honestly sickening how society and especially feminists thinks sexual harassment/assault is a positive thing once the genders are reversed.",
          "timestamp": "2022-02-05 16:34:47",
          "score": 0,
          "num_children": 1,
          "author": 8712,
          "replies": [
            {
              "id": "hvpz9m5",
              "text": "Bro, i wish a girl catcalled me, I would remember it all my life. Its so frustrating and depressing to be attracted so much to women and think that like 80% of them are cute at least, but to always be rejected and never receive one sign of being attractive to the other sex.\n\n I would trade my life if I could have a girl call me cute one time.",
              "timestamp": "2022-02-05 17:34:30",
              "score": 9,
              "num_children": 1,
              "author": 363335,
              "replies": [
                {
                  "id": "hvqoini",
                  "text": "It's not good to thirst for women.It will only drag you down.",
                  "timestamp": "2022-02-05 21:10:40",
                  "score": 4,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hvwqtsk",
          "text": "it repulsed you because you know that if you responded in any way you’d be decried as a rapist and the cops wld prolly be called",
          "timestamp": "2022-02-07 05:19:21",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hvpwf92",
      "text": "Making a sexual comment to someone is cat calling but most of the time it's literally just compliments. Men would do a lot to get compliments. If that's their biggest problem then they don't actually have problems",
      "timestamp": "2022-02-05 17:16:07",
      "score": 7,
      "num_children": 0,
      "author": 42408,
      "replies": []
    },
    {
      "id": "hvrdm98",
      "text": "I feel like I've seen this story before, but the timestamp says it was last week. Maybe there should be a term for feminist deja vu for when they repeat the same behavior.",
      "timestamp": "2022-02-06 00:20:20",
      "score": 2,
      "num_children": 0,
      "author": 258630,
      "replies": []
    },
    {
      "id": "hvu5is8",
      "text": "Don't harass people",
      "timestamp": "2022-02-06 17:57:03",
      "score": 2,
      "num_children": 1,
      "author": 64749,
      "replies": [
        {
          "id": "hvwr300",
          "text": "agreed. leave others the fukk alone. completely alone. refuse to even make eye contact. when a woman looks at you because she wants to see if your looking at her, look up and away and gafaw and pssht and roll your eyes in disgust. i actually do this and its fun😉",
          "timestamp": "2022-02-07 05:21:41",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hvq4rud",
      "text": "It's a compliment most of the times.",
      "timestamp": "2022-02-05 18:13:24",
      "score": 5,
      "num_children": 2,
      "author": 60163,
      "replies": [
        {
          "id": "hvq5ztg",
          "text": "I already posted this comment but I'll copy paste it for you and u/boomboxspence :\n\nI'm a woman. I was first catcalled when I was 9y/o walking home from the bus stop after the school bus dropped me off. a few older guys (probably in their 20s) started whistling and commenting when I walked by. I was a literal child back then. Didn't even know the word 'sex' let alone 'sexual attention'. I never told anyone at home because I didn't know what happened in the first place. I felt weird/disgusted. Couldn't get it out of my head for a few days. I was able to move past it but never forgot the incident. \n\nin case you're wondering \"but what were you wearing??\" , I was wearing the school uniform i.e, trousers, shirt, sweater, school shoes.\n\nthis wasn't the last incident. many more followed after that. for A LOT of us (people who have been catcalled), it started before the age of 10. would you still tell us to \"enjoy since you're getting attention from men\" ?\n\nto add something to this, I'm a lesbian(not because of this incident, i already had crushes on girls since i was 4-5) so I'm definitely not looking for attention from men.",
          "timestamp": "2022-02-05 18:27:36",
          "score": -6,
          "num_children": 3,
          "author": 253804,
          "replies": [
            {
              "id": "hvqxpyi",
              "text": "We said most of the time it's compliments. If it's sexual harassment then it's bad.",
              "timestamp": "2022-02-05 22:20:57",
              "score": 2,
              "num_children": 1,
              "author": 42408,
              "replies": [
                {
                  "id": "hvrx9ak",
                  "text": "are you a woman or afab? then I think you wouldn't understand what I'm trying to say. you know what a compliment is? \"hey I saw you from over there and thought you're very good looking, have a great day\" is a compliment. \"hey girl you should smile more\" or \"where you going sexy\" is not. \n\nI hope you understand the point I'm trying to make here.",
                  "timestamp": "2022-02-06 02:52:16",
                  "score": 0,
                  "num_children": 1,
                  "author": 253804,
                  "replies": [
                    {
                      "id": "hvsj2hp",
                      "text": "I'm a trans man. Telling someone to smile is a compliment",
                      "timestamp": "2022-02-06 09:01:36",
                      "score": 1,
                      "num_children": 1,
                      "author": 42408,
                      "replies": [
                        {
                          "id": "hvsp8we",
                          "text": "then I think you have a different definition of compliment because I'm a woman and if some random guy on the street told me to smile, I'd be livid. \n\nyou don't have to be a woman to understand us",
                          "timestamp": "2022-02-06 10:24:37",
                          "score": 1,
                          "num_children": 1,
                          "author": 253804,
                          "replies": [
                            {
                              "id": "hvsxfrp",
                              "text": "What's wrong with it? It's a good thing and men would be happy to hear that",
                              "timestamp": "2022-02-06 12:12:28",
                              "score": 1,
                              "num_children": 1,
                              "author": 42408,
                              "replies": [
                                {
                                  "id": "hvt8kgo",
                                  "text": "well, i can't speak for all women but everyone I've seen is not okay with it. why do you think it's a compliment?  \n\nit is often interpreted as misogynistic (idk if anti feminists believe in that). women have heard it a lot and even in the situations where it's not necessary. again, why does a random man on the street wants to see me smile and why the hell does he think would even smile for him? is he so entitled to women that he feels that we should do whatever he wants? (the reason I'm using he/him pronouns here is because all of my and my friends' catcallers/abusers have been cishet men)",
                                  "timestamp": "2022-02-06 14:03:30",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 253804,
                                  "replies": [
                                    {
                                      "id": "hvtnsqk",
                                      "text": "Because he wants to see you happy? What's wrong with smiling? It's not misogynistic at all.",
                                      "timestamp": "2022-02-06 15:59:22",
                                      "score": 0,
                                      "num_children": 1,
                                      "author": 42408,
                                      "replies": [
                                        {
                                          "id": "hvtsss6",
                                          "text": "what's that logic 💀\nseriously you can just say \"I'll make excuses for catcallers\" and stop this conversation but you're actively engaging in it. there's no point in explaining things to someone who wants to stay ignorant. have a great day/night",
                                          "timestamp": "2022-02-06 16:33:05",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 253804,
                                          "replies": [
                                            {
                                              "id": "hvttl29",
                                              "text": "Cat calling is making sexual comments, not just telling someone to smile. If that's your problem then you've got no real problems",
                                              "timestamp": "2022-02-06 16:38:21",
                                              "score": 0,
                                              "num_children": 0,
                                              "author": 42408,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hvrowg6",
              "text": "Men hear variations on this story a lot. We never really see anything like it happening, but we hear it a lot. \n\nWe have no way, of course, of knowing if it's true. Because, generally, by default, we tend to assume people tell the truth, but we also know that an awful lot of women's victimhood stories are lies... told because the appearance of victimhood empowers women. \n\nSo, left unable to know, we ask the only question we can actually ask, which is... \"why are you telling us this?\"\n\nDo you expect us to do something about it? Do you somehow think we are responsible for protecting you? \n\nBecause we aren't. That ship sailed sometime around 1965. \n\nSo if you want sympathy, complain to other women. If you want help, call the police. They, at least, are getting paid. I owe you nothing.",
              "timestamp": "2022-02-06 01:48:06",
              "score": 2,
              "num_children": 1,
              "replies": [
                {
                  "id": "hvryxpk",
                  "text": "I'm not expecting anyone to protect me. I'm almost an adult and should be capable of doing that myself. \n\nthe only reason I mentioned it is because alot of people are saying things like \"women get more attention and still whine about it\" or \"it's a compliment most of the times\" like the other person said. I didn't say it to get sympathy from strangers on the internet because I don't think there's a point in doing that. \n\n\n>We have no way, of course, of knowing if it's true.\n\nit's not my job to convince you of something I experienced. you're free to believe me or ignore me. your choice. even if you think I'm lying, there are still millions out there who experience catcalling before they even hit puberty. just because you haven't experienced something doesn't mean our experiences are less valid. \n\n\n>I owe you nothing.\n\nI, surprisingly, never said that you or anyone in this thread owes me. I replied to a comment that said harassment is a compliment and was only implying how is it a compliment to a child who's not even 10 yet. compliments are friendly and lighthearted so I can assure you, catcalling is not a compliment.",
                  "timestamp": "2022-02-06 03:05:35",
                  "score": 1,
                  "num_children": 0,
                  "author": 253804,
                  "replies": []
                }
              ]
            },
            {
              "id": "hvs2jq7",
              "text": "If it's not a compliment and plain harassment then it is wrong and should be reported.\n\nI said it's compliment most of the times (which doesn't mean always).",
              "timestamp": "2022-02-06 04:06:19",
              "score": 0,
              "num_children": 2,
              "author": 60163,
              "replies": [
                {
                  "id": "hvs5oec",
                  "text": "i still stand by what I said. a compliment is \"hey you're very good looking. have a great day\". \"you should smile more\" or \" hey sexy where you going\" is harassment. unfortunately most of the times it's harassment. \n\nand yeah reddit was glitching haha I faced the same issue",
                  "timestamp": "2022-02-06 06:10:29",
                  "score": 3,
                  "num_children": 1,
                  "author": 253804,
                  "replies": [
                    {
                      "id": "hvt7d0z",
                      "text": "I agree that compliment and catcalls are different. The reason I said most catcalls are harassment because every time a guy compliments a women feminists consider it catcalling. And so most people consider compliments to females as catcalls.",
                      "timestamp": "2022-02-06 13:53:04",
                      "score": 0,
                      "num_children": 1,
                      "author": 60163,
                      "replies": [
                        {
                          "id": "hvt7l1z",
                          "text": "Whoa reddit stopped glitching. I thought the glitch is gonna stay forever.",
                          "timestamp": "2022-02-06 13:55:02",
                          "score": 1,
                          "num_children": 0,
                          "author": 60163,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hvs2omw",
                  "text": "Why the fuck is reddit glitching is like this. I commented and it said something went wrong and didn't post it so tried two more times and now the same comment is posted three times.",
                  "timestamp": "2022-02-06 04:11:39",
                  "score": 1,
                  "num_children": 0,
                  "author": 60163,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hvqjt2z",
          "text": "A lot of the times it’s a compliment from people who think they are entitled to a response. And before someone says “it’s not hard to say thank you,” it is. Replying at all seems like an invitation for them to continue.\n\nThere have been many times men have followed me into bars, cafes, while walking my dog, and to my car because I kept walking while they were yelling “compliments” at me. If I say “thank you” they want to keep talking and get mad if I say I’m busy or have to go. Catcalling, to me, is simply a power play.\n\nWhile I understand that sometimes certain people take their catcalling disdain to the extreme, it can and often does lead to incredibly awful situations that eventually begin to dictate what routes you take or times are best to run errands. It also happens most often when you’re alone because it makes you an easier target. \n\nShit like that eventually gets to you and makes you paranoid to the point where even the “nicer” guys feel threatening.",
          "timestamp": "2022-02-05 20:32:25",
          "score": -1,
          "num_children": 1,
          "author": 115253,
          "replies": [
            {
              "id": "hvwr93k",
              "text": "valid. but can we stop pretending that it happens every day every where you go? please and thank you gaslighter",
              "timestamp": "2022-02-07 05:23:16",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hvp7j5n",
      "text": "I don't see the point of this post. Catcalling is wrong. You don't need to be a feminist to know that.",
      "timestamp": "2022-02-05 14:20:05",
      "score": 15,
      "num_children": 2,
      "replies": [
        {
          "id": "hvp87b8",
          "text": "How wrong is it tho? Punishable by law wrong? Or just asshole wrong.",
          "timestamp": "2022-02-05 14:25:29",
          "score": 23,
          "num_children": 1,
          "replies": [
            {
              "id": "hvpeulq",
              "text": "[deleted]",
              "timestamp": "2022-02-05 15:16:23",
              "score": -3,
              "num_children": 2,
              "replies": [
                {
                  "id": "hvphh3f",
                  "text": "Mate you seem to have misunderstood my comment. And I didn't say you were a feminist.\n\nIn English, when we say \"how wrong is it\" it's like \"how bad is it\", like how far do you go in your judgement, you know?\n\nIt has nothing to do with the question \"how is it wrong\".\n\nSo no I'm not \"wondering why that's wrong\" because we already agree that it's wrong.",
                  "timestamp": "2022-02-05 15:35:29",
                  "score": 9,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hvrmlx1",
                      "text": "Yes yes my bad. I completely misread it as “how IS IT wrong”. That’s my bad lmao and I only put I’m not a feminist cuz someone else said I seem like one cuz I don’t agree with catcalling so I was stating “this is coming from a MRA/anti feminist perspective so you don’t have to worry about me attacking you with bullshit claims I was just making a point” type thing but yeah my bad for completely misunderstanding what you wrote. Apologies bro lol",
                      "timestamp": "2022-02-06 01:30:18",
                      "score": 1,
                      "num_children": 1,
                      "author": 381950,
                      "replies": [
                        {
                          "id": "hvsff93",
                          "text": "No worries bro. I like your genuine response here.\n\nAlso, I can relate to the part where they call you a feminist for thinking catcalling is bad... Sometimes I say some things that I think should still remain in favour of women (because I'm more in favour of traditional gender roles) and I get insulted in here lol.\n\nIt's funny because if I say I'm for traditional roles to feminists, they say I'm opressing women, but if I say it to anti-feminists they say I'm opressing men. When tbh I think it's just the right amount of balance.\n\nBut it's fine, I still learn new things from other people that disagree with me, as long as they don't censor people.\n\nHave a good week bro.",
                          "timestamp": "2022-02-06 08:14:24",
                          "score": 2,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "hvrf1yb",
                  "text": ">And no I’m not a feminist \n\nX to doubt",
                  "timestamp": "2022-02-06 00:31:24",
                  "score": 0,
                  "num_children": 1,
                  "author": 258630,
                  "replies": [
                    {
                      "id": "hvrm4ho",
                      "text": "Lmao i think feminists are fucking stupid and oppressive towards men and women who aren’t in their hive mind. I just don’t understand why someone doesn’t understand how catcalling is wrong. That’s my whole point.\nEdit: I completely and utterly misread the original comment I replied to so disregard my whole argument lol. I was confused cuz I thought he typed “how is it wrong to catcall someone” when he didn’t type that at all lol. But no, I was saying I’m not a feminist because feminists on this sub are fucking insane and derogatory to anyone who dares disagree with them.",
                      "timestamp": "2022-02-06 01:26:32",
                      "score": 2,
                      "num_children": 1,
                      "author": 381950,
                      "replies": [
                        {
                          "id": "hvrol1k",
                          "text": "Most men, like the husband of the woman in the post, aren't piles of hypersensitive mush with a victim complex, so they either see catcalling as a compliment or they are indifferent towards it.",
                          "timestamp": "2022-02-06 01:45:40",
                          "score": 1,
                          "num_children": 2,
                          "author": 258630,
                          "replies": [
                            {
                              "id": "hvwrhe1",
                              "text": "nicely stated! well done mate",
                              "timestamp": "2022-02-07 05:25:27",
                              "score": 2,
                              "num_children": 0,
                              "replies": []
                            },
                            {
                              "id": "hvrr394",
                              "text": "Okay but I’m not talking about catcalling as in just a compliment. I’m talking about catcalling as in “lemme tap that pussy baby” type shit. I’m not a sensitive pile of mush with a victim complex by any means considering I work with maximum security male inmates as a woman and deal with blatant sexual harassment on a daily from those guys. Although it’s what I signed up for, it puts a way darker view on it when it happens on the street. So I view people doing that shit as civilians to me with the same aspect of a hardened criminal saying that. I think lots of women are so quick to play victim though and claim catcalling = flirting when that’s not the case. Just to be clear when I say catcalling is gross I’m referring to as I said, weird, nasty, unprompted sexual remarks that you’d be ashamed to say in front of a judge. I guess it’s my own fault for not being able to calm my brain when I’m off duty but officer or not, hearing someone say something super creepy is terrifying when you know they can follow you home, etc.",
                              "timestamp": "2022-02-06 02:04:31",
                              "score": 1,
                              "num_children": 1,
                              "author": 381950,
                              "replies": [
                                {
                                  "id": "hvruhq3",
                                  "text": "You and I have wildly different viewpoints on the respectability of judges. That aside, inmates trying to get a rise out of female staff is more a product of the environment than anything else and not a reflection of life outside of a prison. Put anyone in a cage then take away what makes a person civilized and even polite people will start lashing out in crude ways. \n\nThey're not your coworkers and they're not obligated to be nice or professional with you. They're involuntary prisoners that get treated like sub human trash by a group of people who are *usually* on power trips. At the end of your day you go home, at the end of their day the next shift of guards arrives to fuck with them. There are very few things they could say that would be actually inappropriate considering their position. \n\nIf their goading really affects you that much then why not find a different vocation?",
                                  "timestamp": "2022-02-06 02:30:46",
                                  "score": 1,
                                  "num_children": 3,
                                  "author": 258630,
                                  "replies": [
                                    {
                                      "id": "hvry57h",
                                      "text": "Lmao I never said it bothers me. I understand it’s part of the job and you’re dead wrong if you think people treat them like shit. People are so quick to be fired if they say mean shit. Idk who you think we are but you’re wrong. I understand that not everyone is an inmate and I never ever said they’re obligated to treat me with respect lmao. I love what I do and I do it damn well so yeah no I’m not finding a new job. Keep in mind I work in max security not just some minimum camp lol. These guys were like this on the outside. We have murderers, serial killers, child rapists and killers, etc. if you think we’re making them uncivilized then you have a rude awakening coming. If these guys were on the streets they’d do much fucking worse than simply catcall females lol. Once again they are not treated like trash. Considering the inmates just assaulted one of my buddies just because he didn’t get him the cleaning supplies he demanded within 15 minutes, you need to check the facts lol. I can only speak for the prison I work at. If you seriously want to defend people you’d cry if you had them as your neighbor because “you’d do that too if you were in their position” then that makes you side with the worst of the worst. Inmates are human and deserve to be treated as such but that does NOT mean we put up with any form of harassment. Idk where you assumed I expect them to treat me like my co workers treat \nMe but I don’t appreciate a lesson in my line of work from someone who’s never spent a day in uniform clearly.",
                                      "timestamp": "2022-02-06 02:59:19",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 381950,
                                      "replies": [
                                        {
                                          "id": "hvrztox",
                                          "text": "That's alot of angy over getting called out for expecting hardened prisoners from the US penal system (the most dysfunctional 1st world penal system) to be cordial and professional. Looks like you also heavily edited your previous comment to sound like less of an entitled twat. \n\nYeah, the sexual remarks from the inmates definitely don't affect you. That's why you're so upset about them, because they *don't* matter to you.",
                                          "timestamp": "2022-02-06 03:12:34",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 258630,
                                          "replies": [
                                            {
                                              "id": "hvs01q6",
                                              "text": "Lmao bro what even. I’m not angry I’m trying to explain how things actually work. It’s pretty hard to anger me. Especially online lol. I didn’t edit any of these comments lol. Sorry you feel that way? And for the like, 15th time, I don’t expect them to be polite at all. I’d love to see you cite where I said that lol. I’ve explained that I don’t expect shit from them.",
                                              "timestamp": "2022-02-06 03:14:16",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 381950,
                                              "replies": [
                                                {
                                                  "id": "hvs0wip",
                                                  "text": "In my experience the more \"lmao\"s and \"lol\"s that get added to a statement the more agitated the speaker is. Also you and I both know your previous comment was whining about how \"inappropriate\" it is for the inmates to \"flirt\" with you. It's why I pointed out that there are very few things that are inappropriate for an inmate to say considering their situation. I get that you were embarrassed, but editing your comments like that just makes you look more pathetic.",
                                                  "timestamp": "2022-02-06 03:21:06",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 258630,
                                                  "replies": [
                                                    {
                                                      "id": "hvs19ex",
                                                      "text": "Bro I didn’t edit anything I seriously don’t see why I would. You’re gonna think what you’re gonna think but I don’t care enough to re read every last one of my comments and edit them AFTER they’ve been replied to unless I had a huge typo or something. My comment was far from whining and was simply explaining shit to you. And once again bro, if you’re gonna side with pedophiles and other horrible people to justify more horrible things, that says a lot about you. Keep advocating for people you’d never want to babysit your kids! Great idea! Anyways, I got shit to do, this is quite a shit fest lol. Have a nice night man.",
                                                      "timestamp": "2022-02-06 03:24:00",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 381950,
                                                      "replies": [
                                                        {
                                                          "id": "hvs2bme",
                                                          "text": "\"Catcalling is bad because inmates to it to me at my job. ~~it's so inappropriate~~ I know what I signed up for and I'm not affected by it.\"\n\n\"The fuck do you expect from inmates, they're there all day.\"\n\n\"Why are you defending inmates, reeeeeeeeeeeeee!\" \n\nI'll leave you with one of my favorites: You're not a clown, you're the whole circus.",
                                                          "timestamp": "2022-02-06 03:57:27",
                                                          "score": 1,
                                                          "num_children": 0,
                                                          "author": 258630,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "hvryhd6",
                                      "text": "And considering the PTSD rates of correctional officers are 3x higher than veterans and 2x higher than cops (https://amp.theguardian.com/us-news/2015/may/20/corrections-officers-ptsd-american-prisons) , this job effects every officer female or male outside the walls. Their sexual comments roll off my back as for most officers they can say the same but you have to realize when you work in a place like this, it messes up your world view.",
                                      "timestamp": "2022-02-06 03:02:00",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 381950,
                                      "replies": []
                                    },
                                    {
                                      "id": "hvryooq",
                                      "text": "Anyways, I’m not here to argue. You have your views and opinions and I have mine. All in all bro, I respect what you’re saying. Have a nice night mate.",
                                      "timestamp": "2022-02-06 03:03:34",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 381950,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hvpzkrs",
          "text": "Expressing attraction in somebody should be wrong.",
          "timestamp": "2022-02-05 17:36:24",
          "score": 0,
          "num_children": 1,
          "author": 363335,
          "replies": [
            {
              "id": "hvq0jyr",
              "text": "Catcalling is different from \"expressing attraction\"",
              "timestamp": "2022-02-05 17:42:36",
              "score": 3,
              "num_children": 1,
              "replies": [
                {
                  "id": "hvq1xpn",
                  "text": "If you like someone's shirt, you say nice shirt, if you like somebody's ass, you say nice butt or ass. I dont see whats so scandalous. If she doesnt say anything or says that she isnt interested, you leave her alone and thats the end of that.\n\nHow do you think its acceptable to express atraction? I know there are more polite ways, I was just saying that a more direct approach shouldnt be demonized as much, but im interested about what you think is appropriate",
                  "timestamp": "2022-02-05 17:51:24",
                  "score": 7,
                  "num_children": 3,
                  "author": 363335,
                  "replies": [
                    {
                      "id": "hvsj3dc",
                      "text": "Cat calling is absolutely not the same as complimenting someone. _the act of shouting harassing and often sexually suggestive, threatening, or derisive comments at someone publicly_ -- Merriam Webster.",
                      "timestamp": "2022-02-06 09:01:56",
                      "score": 2,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "hvu5w1t",
                      "text": "Huge self report. If someone doesn't wanna hear someone talk about their body that's their right.",
                      "timestamp": "2022-02-06 17:59:28",
                      "score": 0,
                      "num_children": 1,
                      "author": 64749,
                      "replies": [
                        {
                          "id": "hvwrt7n",
                          "text": "its also their right to stay out of public view. and wtf is “self report”?",
                          "timestamp": "2022-02-07 05:28:33",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hvzsvq6",
                              "text": "This guy hasn't played the hit game amogus.\n\nBro just because you see someone in a public doesn't give you the right to say sexual comments. Writing a two page essay excusing this behavior is a self report. \n\nBro this is some victim blaming shit also, shouldn't women have the right to walk on the street without being harassed. \n\nHuge self reporting",
                              "timestamp": "2022-02-07 21:05:22",
                              "score": 1,
                              "num_children": 0,
                              "author": 64749,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hvwrpk7",
                      "text": "your entire participation here is a self contradiction. if you’ve misstyped or typo’d you should do a little editing, bc as of now youve made zero sense",
                      "timestamp": "2022-02-07 05:27:35",
                      "score": 0,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hvslumh",
      "text": "The women who are really against cat calling are those that never gets cat called, those that dont receive compliments for their looks.\n\nThe most vocal women against cat calling always seems to be rather ugly, both inside and outside.",
      "timestamp": "2022-02-06 09:38:29",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hvr3ykk",
      "text": "I don’t understand why women can’t take a simple compliment from a stranger who went out of their way to give it to them. It just seems rude to me.",
      "timestamp": "2022-02-05 23:07:23",
      "score": 2,
      "num_children": 1,
      "author": 157017,
      "replies": [
        {
          "id": "hvvmgcj",
          "text": "When you say compliment, do you mean \"Your tits look good in that shirt.\" Or \"I like your shirt.\"? Because there are lots of men out there who think pointing out a woman's body is a compliment. Of course we won't take a simple \"compliment\" if you're saying we have a nice ass. I'm 13, and last year I had lots of problems with the boys sexually harassing and saying disgusting things to me. (nice boobs, nice ass, etc) and when they were called out on it, they claimed it was a compliment. No woman is going to respect you if you say things like that.",
          "timestamp": "2022-02-06 23:58:16",
          "score": 2,
          "num_children": 0,
          "author": 231310,
          "replies": []
        }
      ]
    },
    {
      "id": "hvpiudw",
      "text": "It really depends on the person. I would be uncomfortable if some random person makes a sexual comment about me.",
      "timestamp": "2022-02-05 15:45:19",
      "score": 3,
      "num_children": 1,
      "author": 371371,
      "replies": [
        {
          "id": "hvwrzg2",
          "text": "sexual comment or an innocent compliment from an entity you find to be unattractive???",
          "timestamp": "2022-02-07 05:30:10",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hvpu6o3",
      "text": "I’ve found the best way to stop cat callers is to humiliate them. Usually it’s a guy in a group trying to look cool in front of his friends. If you make the friends laugh at the catcaller’s expense, it’ll shut him down right quick. It’s a lot faster and easier than pretending to “feel threatened” by it.",
      "timestamp": "2022-02-05 17:01:26",
      "score": -4,
      "num_children": 2,
      "author": 109440,
      "replies": [
        {
          "id": "hvrg1to",
          "text": "Ah, the \"just be a cunt\" approach. It works really well shutting down most social behaviors actually.",
          "timestamp": "2022-02-06 00:39:06",
          "score": 2,
          "num_children": 1,
          "author": 258630,
          "replies": [
            {
              "id": "hvs36ko",
              "text": "Why the fuck not, if someone is sexually harassing me?",
              "timestamp": "2022-02-06 04:30:10",
              "score": 0,
              "num_children": 1,
              "author": 109440,
              "replies": [
                {
                  "id": "hvws56l",
                  "text": "no agree with you. the guy above is being a little overly simple on the topic. he’s clearly the guy in the group that was just laughed at for a failed catcall. u have struck a chord",
                  "timestamp": "2022-02-07 05:31:40",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hvwsa2z",
          "text": "i wanna see a woman reply with the likes of “a loud voice doesn’t make up for a small dick!” oh how i wld die laughing at that very moment!\n\nedit; i bet youre a blast at parties (totally serious here)",
          "timestamp": "2022-02-07 05:32:58",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hvyltef",
              "text": "I try not to body shame, even when I’m really mad at someone. Even if I don’t hurt their feelings with my comment, I could easily hurt the feelings of the guy standing next to him on the street who didn’t do anything wrong. I try not to let my words hurt innocent people, as tempting as it is sometimes.",
              "timestamp": "2022-02-07 16:25:55",
              "score": 1,
              "num_children": 0,
              "author": 109440,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hvpks56",
      "text": "Catcalling is not something good",
      "timestamp": "2022-02-05 15:58:41",
      "score": -2,
      "num_children": 0,
      "author": 133723,
      "replies": []
    },
    {
      "id": "hvpffrn",
      "text": "He didn't care if some of her friends were ugly.",
      "timestamp": "2022-02-05 15:20:42",
      "score": -2,
      "num_children": 0,
      "author": 13540,
      "replies": []
    },
    {
      "id": "hvr1nif",
      "text": "Now imagine if that was done by sleazy gay dudes",
      "timestamp": "2022-02-05 22:50:17",
      "score": 0,
      "num_children": 2,
      "author": 22741,
      "replies": [
        {
          "id": "hvr3xgx",
          "text": "That’s still a compliment lol. Men don’t get told we’re attractive. We just depend on our own confidence.",
          "timestamp": "2022-02-05 23:07:09",
          "score": 7,
          "num_children": 1,
          "author": 378915,
          "replies": [
            {
              "id": "hvr50x1",
              "text": "I would run the other direction if a sleazy gay dude came onto me like that.",
              "timestamp": "2022-02-05 23:15:23",
              "score": -1,
              "num_children": 2,
              "author": 22741,
              "replies": [
                {
                  "id": "hvrgclk",
                  "text": "Good for you, sounds like you weren't shat on as much as most guys were growing up.",
                  "timestamp": "2022-02-06 00:41:22",
                  "score": 1,
                  "num_children": 0,
                  "author": 258630,
                  "replies": []
                },
                {
                  "id": "hvwsfvf",
                  "text": "sleazy gays are usually peddos or extremely immature",
                  "timestamp": "2022-02-07 05:34:30",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hvsgird",
          "text": "So many guys live their lives, slogging in fields, mines and other dangerous locations without any one there to even acknowledge their hardwork. \n\nSo many of my friends, are working extra hours to sustain their family by working extra hours and when they go home they are met by their entitled housewives who make them wash dishes (because gender equality), they get bullied into buying liabilities over assets and even then hear no thank yous. They get no love or recognition for hardwork. I cannot enumerate the number of men who complain about sexless marriages.\n\nTo get a compliment, even if it was a gay man, would mean the world for these men. You are delusional and privileged, because you got attention, validation just for existing and the latent ability to birth another human. You cannot understand male struggle.",
          "timestamp": "2022-02-06 08:28:35",
          "score": 0,
          "num_children": 0,
          "author": 146422,
          "replies": []
        }
      ]
    },
    {
      "id": "hvr9rn8",
      "text": "Women don't like being told \"smile\" because 1. That's no one's business if anyone smiles or not 2. Women are pressured to look and act a certain way just like men are pressured to look and act a certain way. When a man says smile he doesn't think about all the annoying pressure women deal with in their personal lives, just like a woman who tells a man to look more tough when it isn't necessary doesn't think about the annoying pressure he deals with in his personal life. \n\nAbout the catcalls and \"smile\" comments, women feel uncomfortable because they are physically weaker, more emotionally sensitive, and aren't as filled with horny testerone as men (nothing wrong with men being filled with it, just matters how you act on it) so they don't want all the attention usually. Men and women have biological differences, as I've explained, so to act like women should equally be into getting catcalled as men are is not realistic. So if you KNOW someone is uncomfortable with something, why do it to them? It usually shows one is power hungry if they keep doing things to people when they know they don't like it. If men don't like when women complain about certain things, should women say, \"It's not rape, it's just me talking, you should be thankful, stop telling us women to stop\"? No, women shouldn't complain (unless maybe it's something that personally effects the woman like a guy not doing his share of the chores that were agreed upon ). Men and women should try to stop doing things that bother each other. Isn't it good to respect boundaries? I'm moreso talking about the overt catcalling versus a guy just saying \"hello\" lol.\n\nAlso, when tons of guys are catcalling etc. what are we supposed to do, say thank you and get the number of all 100 men who said something to us? I can understand saying thank you to some but I mean there are too many guys to keep saying the same \"thank you\" over and over to and women usually don't want 100 strangers' phone numbers.\n\nI've had men say really stupid things to me when I was downtown at 19 years old. I was in an ice cream place and I ordered dark chocolate flavor. A black customer said, \"You like dark chocolate?\" He pointed to his body and said, \"You think you can handle *me*?\" That's very disrespectful, wasn't a simple hello. Another time I walked on a sidewalk downtown and a group of men waiting for the bus parted like the Red Sea with a line on either side of me. As I walked down the aisle of annoying ass motherfuckers, one guy said \"Look at her eyes!\" Another said, \"Look at her legs.\" Another, \"Look at her boots!\" Another, \"Look at her BOOBS!\" They all sounded overly mesmerized and I did not feel comfortable. Why do this to women? Btw, I was covered head to toe in an appropriate outfit that barely showed any cleavage. It's not like I had my ass cheeks hanging out of tiny shorts and a tiny shirt that bares my stomach and the upper half of my breasts. I'd hope most men can understand these things are worse than saying \"hello\" instead of thinking they're just as innocent (I know a lot of men understand, I'm not upset with the men here who already understand).",
      "timestamp": "2022-02-05 23:50:57",
      "score": -4,
      "num_children": 1,
      "author": 263569,
      "replies": [
        {
          "id": "hvsfe7q",
          "text": "I agree with you when you say that there are biological differences. But everything else you say revolves around the axiom that \"women are special and they should be coddled\". \n\nI say F that. Feminist fought for equality, they disregarded biological differences and pushed women towards more manly roles in the society. Broke the western civilisation's social fabric. And now that you are facing the consequences of equality, you become an \"intellectual\" and pioneer on the biological differences. \n\nShame on you. We are just laughing at the feminazi logic. \nNone of us here believe in equality of sexes(from biological perspective). \n\nAnd I never thought asking some one to 'smile' was a form of harrasment. You are so privileged that you need to manufacture problems and then you blame men for it.\nYou get so much attention and validation from society just for existing that you complain about it. Shame on you bigot.\n\nAnd when you mentioned men making descriptive remarks, I understand that it can be uncomfortable. But men communicate overtly. I'm sure it was not what was said but who said it that annoyed you. If a man you were attracted to, said the same things you won't mind. I have seen my popular friends say things to women, with positive effect, that would be accounted to harrasment if someone less attractive would have said it.",
          "timestamp": "2022-02-06 08:14:02",
          "score": 1,
          "num_children": 1,
          "author": 146422,
          "replies": [
            {
              "id": "hvsrmw3",
              "text": "I'm not a feminist, so you're making assumptions about my political views. I don't believe in equality, but I believe in respecting both sexes because I just said men and women should respect each other's boundaries. So you didn't comprehend what I was saying. \n\nNothing I said makes me a bigot because I didn't say women deserve special treatment. I said women should respect men's boundaries too, such as women should not complain as much. [Edit: I should have remembered to include that to me equal respect means women shouldn't assume a man wants to hear things like \"You like chocolate, you think you can handle me?\" or \"Look at his biceps!\" from an overly mesmerized stranger either.]\n\nYou're assuming I wouldn't mind a man saying those descriptive things to me if he were attractive. No, when I was trying to force myself to be bi and had gained some attraction to men I did NOT like when any attractive man said that stuff to me in public either and I wouldn't like it from a woman either. You are assuming women want to hear random sexual things from hot men and from knowing many bi/heterosexual women, they do NOT like any random men saying sexually suggestive things in public especially like \"Oh you like dark chocolate, you think you can *handle* me?\" and \"Look at her hair! Look at her legs! Look at her boots! Look at her BOOBS!\" A lot of women don't want these comments from overly mesmerized strangers. You sound as bad as a feminazi who believes all men want things that I know men don't want. \n\nMost women in public who wouldn't mind a man talking to them want *mutually respectful conversation* where a man isn't asking if the woman can *handle him sexually* or *announcing* to the public that she has nice breasts. They'd want a man to talk about nonsexual things such as if she's looking at a magazine the man *politely* comments on what she's reading then they start talking about other nonsexual things. Then when he *politely* says, \"You're very beautiful, would you like to get dinner sometime?\" (I'm not implying men have to pay or that woman can't ask a guy out) that is very different from men sounding overly mesmerized while asking sexual questions or announcing to other men, \"Look at her this! Look at her that!\" The language and tone of those overly mesmerized men was not one of mutual conversation or calm politeness. It's so bizarre to hear anyone assume most women would want an attractive stranger to act how the men treated me. From many women I've known, lots of sources from other people, the internet, and from what I've observed in public and at parties from sober and drunk heterosexual social interaction, your assumption is wrong about what most women want. \n\nAlso, I didn't say that saying \"smile\" was harassment so that's another thing you are misunderstanding.",
              "timestamp": "2022-02-06 10:56:47",
              "score": -1,
              "num_children": 1,
              "author": 263569,
              "replies": [
                {
                  "id": "hvstg95",
                  "text": "Men deal with women for sexual access for most part. Yes, some men are tactless and say things that might make you uncomfortable. But to force yourself in male spaces, dress certain way and act certain way and then question why men are approaching you? \n\nWe talk to our male friends when we want to talk about non sexual things. In casual settings, every male-female interaction has a sexual undertone whether you like it not.",
                  "timestamp": "2022-02-06 11:21:05",
                  "score": 2,
                  "num_children": 1,
                  "author": 146422,
                  "replies": [
                    {
                      "id": "hvsxy9n",
                      "text": "Women are forcing themselves in male spaces by walking downtown where there are normal stores for people to buy necessities or places to eat food? Don't know if you're referring to me, but I wasn't dressing or acting in a sexual way. I barely showed cleavage, so that was the only merely \"sexual thing.\" As for acting, I didn't act like anything, just regular minding my own business. Most days I wore tops that went up to my neck and I still got men acting overly mesmerized and saying stupid things. Even when I wore baggy clothes that were not fashionable at all. At that age, my face was gorgeous without make up and that's something I couldn't change but I sometimes wore baggy unfashionable clothes (and no make up) that went up to my neck and down my ankles to prevent sexual harassment (was one reason) yet men acted so perverted regardless. Even a business man in a suit and in an expensive car said \"Hey! Come heeere!\" with giant eyes and a slow creepy voice when I wore the baggy clothes/tennis shoes that hid my shape and that situation made NO sense. At that point especially, those particular men really are just dogs. [Edit: the business man also smirked all creepy and beckoned me with his finger. Total fucking creep. Some men are just creeps.]\n\nJust because I showed hardly any cleavage that day doesn't mean men can treat me disrespectfully just like how women who see muscular men in showy sleeveless shirts with muscular cleavage shouldn't say \"you like dark chocolate, you think you can handle me?\" or announce \"Look at his biceps!\" And just like women should control their overly emotional state by not giving attitude men don't wanna hear, men need to control their testosterone levels by not saying sexually disrespectful things. Equal respect. \n\nMy dad always says men should not treat women disrespectfully and calls men who treat women how I was treated \"scum.\" He criticizes men's behavior a lot. Even he knows how to be respectful, and he's a fucking masculine bodybuilder who used to be a criminal in the hood before marriage (and isn't proud of that last part) yet he's not the one making excuses for men. So if he can be more respectful than some men, I guess no man has an excuse. It's usually the more masculine men who know how to treat women well. I think this may show men who are the less respectful ones *and* the men who make excuses for those men are usually beta males. I've seen this pattern many times in different environments. \n\nNo I don't think every male-female interaction has a sexual undertone. I've seen attractive people in high schools, universities, jobs, public places, etc. talk to very unattractive people of the opposite sex just to socialize and build community. It sounds anti-male to assume men always have a sexual thing when talking to women. Sex is a big thing that can permeate various aspects of life, but not every single thing is about sex.",
                      "timestamp": "2022-02-06 12:18:44",
                      "score": 0,
                      "num_children": 1,
                      "author": 263569,
                      "replies": [
                        {
                          "id": "hvt06ye",
                          "text": "> Just because I showed hardly any cleavage that day doesn't mean men can treat me disrespectfully just like how women who see muscular men in showy sleeveless shirts with muscular cleavage shouldn't say \"you like dark chocolate, you think you can handle me?\"\n\nYour original comment talked about the difference between men and women. And here again you try to equalise the genders.\n\nMen are the ones who approach women (while women look pretty and wait till someone approaches), I have friends who are very successful with women but I have never heard any of them being approached by a random lady down the road. Also as I said earlier, Men communicate overtly. Some men are tactless and some men are socially inept to understand time and the setting. \nI am not making excuses for anyone. Also eve-teasing is a punishable offense, and if you have been eve-teased, you can get legal recourse. \n\nBut this hashtag:metoo garb is over the top. I think there are many women on the face of the planet who would trade their places with you. Many would happily accept being called \"come here babe\" or \"your smile is pretty\", over being grapes, tortured, forced to wear burqas or restricted from formal schooling and child marriages as is prevalent in the rest of the world. Stop manufacturing problems. When men are not doing anything productive, they are labelled broke, dead beat, useless etc by the society. No one cares for them or respects them. Many men go through this - I'm sure no woman has experienced this either. But I have heard no man complain about his ordeal. I have heard no broke dude question why no woman respects him and gives him no sexual access. Men have accepted the hypergamous nature of women and we don't complain. However women cannot accept that men are in constant search of sexual access. They want attention and validation but don't want to be sexualised too.",
                          "timestamp": "2022-02-06 12:44:04",
                          "score": 0,
                          "num_children": 1,
                          "author": 146422,
                          "replies": [
                            {
                              "id": "hvt3das",
                              "text": "Christ, just because women have it worse in other parts of the world that doesn't mean it's ok to say sexual things to a woman you don't know. Or even to a man one doesn't know. \"Come here babe\" Who the heck wants to hear that? If men lack the respect and social skills to have a normal conversation and flirt politely, that is their problem. Just like if women lack the control over their emotional minds (generally speaking, I'm not saying all women are overly emotional) it doesn't give them the right to just yell and whine if they can't express their feelings in a controlled manner. [Edit: \"come here babe\" isn't as bad if done with a more polite, friendly, or humorous tone.]\n\nYour logic is saying that because the Middle East has terrible things then that means the West can get away with less bad behavior. What a lazy, entitled mentality. You are too blind to get that if a man can't approach a woman with respect and vice versa then they have NO class. Do you get it? Bad behavior means no class, no manners. If that's how you want to be or what you want to support, it's like saying \"other people are doing PCP everyday, so that means I can smoke meth twice a week\" without realizing that reveals how much you lack class and self-discipline. Both sexes need to exercise respect and self-restraint instead of acting so entitled and beyond reproach! \"Your smile is pretty\" is not bad and I thought I made that clear with my example earlier of how most women prefer to be approached. Most women would trade places with me? HAHAHAHA What male fantasy world are you living in?! I'm trying to give you the cold, hard truth that women are NOT as interested in the overt comments as much as men think. Maybe you don't, but a lot of men watch porn and those porn stars are not a realistic depictions of how women want men to act. If your friends got many women with overt comments then they probably scored HOES, not classy women. The women I've seen who like overt stuff are usually HOES.",
                              "timestamp": "2022-02-06 13:16:31",
                              "score": 0,
                              "num_children": 1,
                              "author": 263569,
                              "replies": [
                                {
                                  "id": "hvt869q",
                                  "text": "I don't see how words of validation can be seen as something so horrible that you need to write paragraphs about it, when there are actual problems that women face throughout the world. \n\nI doesn't matter if women are not interested, men will shoot their shots. If you think it is harrasment, then you can approach law enforcement and use legal recourse. I don't condone a man forcing himself on a woman. \n\n> If your friends got many women with overt comments then they probably scored HOES, not classy women.\n\nMe and my friends are confident enough to approach women and tell them that we are interested in them. Obviously one  has to be tactful. I have never approached a woman as a \"friend\" with hidden intentions. And I used my friends as an example of how even the best of the guys are not approached by women and they have to be the one to initiate conversations. There are some guys who don't know how to approach women, and it is their fault. They pay the price too with. I don't see it as a huge problem that western privileged women need to cry and write paragraphs about. And if some one is physically forcing himself on a girl, it is sexual harrasment and amounts to prison time.",
                                  "timestamp": "2022-02-06 14:00:11",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 146422,
                                  "replies": [
                                    {
                                      "id": "hvtdv2f",
                                      "text": "Most of your last paragraph is pretty reasonable. However, I don't think it's useless whining to address tactlessness. Like I said, terrible problems in the Middle East doesn't make tactlessnes or disrespect a non-issue, it's just a lesser issue. Most feminists who address tactlessness aren't claiming it's worse than the problems women face in the Middle East. Plus, what is the average American person going to do to help women in the Middle East? That's something mostly political figures, organizations, etc. with greater power would do. I hope women get help in the Middle East, don't get me wrong. Women in America have the right to address issues here too whether or not it's major. Men have worse problems than women yelling and complaining at them, but I still think women shouldn't yell and complain if that behavior isn't fitting for the situation. In other words, everyone should work toward bettering their behavior and treating people with respect regardless of what's going on halfway across the world.",
                                      "timestamp": "2022-02-06 14:46:36",
                                      "score": 0,
                                      "num_children": 1,
                                      "author": 263569,
                                      "replies": [
                                        {
                                          "id": "hvwsso2",
                                          "text": "this sub thread has spiralled way outta control",
                                          "timestamp": "2022-02-07 05:37:54",
                                          "score": 0,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hwzhas7",
      "text": "2 white girls in a car catcalled me saying that i had a nice ass. Best day of my fucking life. Should've gotten their numbers.",
      "timestamp": "2022-02-15 02:25:00",
      "score": 1,
      "num_children": 0,
      "author": 219923,
      "replies": []
    },
    {
      "id": "hzcmu4q",
      "text": "Whistling at girls is kinda weird",
      "timestamp": "2022-03-04 18:57:07",
      "score": 1,
      "num_children": 0,
      "author": 316826,
      "replies": []
    },
    {
      "id": "hvt63iy",
      "text": "Truth is women hate being catcalled by men but men love being catcalled by women. If some men say otherwise, it's because they've been taught that way through all this double standards stuff. Stop lying to yourselves.",
      "timestamp": "2022-02-06 13:41:47",
      "score": -1,
      "num_children": 0,
      "author": 404040,
      "replies": []
    }
  ]
}