{
  "id": "szycdq",
  "text": "Feminist \"Facts\"\n",
  "timestamp": "2022-02-24 01:44:31",
  "score": 623,
  "subreddit": "t5_2zaj2",
  "num_children": 27,
  "author": 24804,
  "replies": [
    {
      "id": "hy6uxic",
      "text": "Is this faulty math an example of why there aren’t more women in STEM which leads to the pay differential they’re always complaining about?",
      "timestamp": "2022-02-24 03:08:54",
      "score": 53,
      "num_children": 0,
      "author": 304888,
      "replies": []
    },
    {
      "id": "hy718ym",
      "text": "This is like saying \"2 out of every 10 homeless people are women!!! This is a gendered issue, we need to help womennnnnn!!!!\"",
      "timestamp": "2022-02-24 03:57:54",
      "score": 45,
      "num_children": 1,
      "replies": [
        {
          "id": "hy8u1xm",
          "text": "That is also exactly what they have to say about homelessness😂",
          "timestamp": "2022-02-24 14:37:05",
          "score": 7,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hy6l87f",
      "text": "why are they making every issue a gendered issue",
      "timestamp": "2022-02-24 01:56:19",
      "score": 123,
      "num_children": 5,
      "author": 371371,
      "replies": [
        {
          "id": "hy6v8al",
          "text": "They make everything a gendered issue until it comes to doing things like paying for dates, changing tires or repairing a roof in the middle of summer. I’ve yet to hear a feminist discuss gender equality then.",
          "timestamp": "2022-02-24 03:11:12",
          "score": 76,
          "num_children": 1,
          "author": 304888,
          "replies": [
            {
              "id": "hy8sldb",
              "text": "Or going to war.\n\nBut dare to launch a movie without a woman kicking ass in the front lines...",
              "timestamp": "2022-02-24 14:26:42",
              "score": 15,
              "num_children": 1,
              "author": 168267,
              "replies": [
                {
                  "id": "hy8ten9",
                  "text": "Yes, they love to see movies where a skinny woman beats the shit out of a man who’s foot taller and outweighs her by 100 pounds. They like performance feminism that makes it appear that women can do anything. But, when a tire is flat, they’re suddenly helpless.",
                  "timestamp": "2022-02-24 14:32:30",
                  "score": 7,
                  "num_children": 1,
                  "author": 304888,
                  "replies": [
                    {
                      "id": "hy935jj",
                      "text": "I know right",
                      "timestamp": "2022-02-24 15:37:35",
                      "score": 4,
                      "num_children": 0,
                      "author": 220159,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "hy7wapm",
          "text": "Because they are spoiled bitches.",
          "timestamp": "2022-02-24 08:58:13",
          "score": 11,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hy8uj5v",
          "text": "They're playing on emotions. Say \"Cancel student debt for all\" and a lot of people, very reasonably I might add, respond with \"no, that'll cause more issues than it's worth, there are bigger problems with doing that, etc.\"\n\nSay \"cancel student debt for women\" and suddenly the emotions are changed. It's now about helping \"poor, manipulated\" women, and \"well, at least it's not EVERYONE.\"\n\nI don't understand why all of feminism is succinctly wrapped up in \"It should not cost *me.*\" \n\n1. Give me an entitlement but expect nothing in return from *me*.\n2. Pay for all my food, drinks, children, but expect nothing from *me*.\n3. Provide exceptional welfare benefits, preferential treatment in the judicial courts and courts of public opinion, but expect nothing from *me*.\n4. Let me act and misbehave in numerous ways, including ways that are destructive to myself, people around me, and society overall, don't judge me, give me a pass, but expect no such leniency from *me.*\n5. Let me hold you, your family, your group(s), your society, your history, etc. to an unachievable standard. Let me complain when no one can meet such standard. But don't expect changes in my standards, or me to meet those same standards, from *me*.\n\nAt the end of it all, it's selfishness and pride.",
          "timestamp": "2022-02-24 14:40:28",
          "score": 7,
          "num_children": 1,
          "author": 398446,
          "replies": [
            {
              "id": "hyb7j8z",
              "text": "Thank you for this one!",
              "timestamp": "2022-02-24 23:39:22",
              "score": 1,
              "num_children": 0,
              "author": 269934,
              "replies": []
            }
          ]
        },
        {
          "id": "hy8ns80",
          "text": "Because they don't have the guts to resolve their own issues. They eventually drag men into their own problems.",
          "timestamp": "2022-02-24 13:50:31",
          "score": 5,
          "num_children": 1,
          "author": 323533,
          "replies": [
            {
              "id": "hy936r4",
              "text": "Yes",
              "timestamp": "2022-02-24 15:37:48",
              "score": 2,
              "num_children": 0,
              "author": 220159,
              "replies": []
            }
          ]
        },
        {
          "id": "hy980if",
          "text": "For people never forget that eeeeverything affects women and that the have 0 rights...",
          "timestamp": "2022-02-24 16:08:18",
          "score": 1,
          "num_children": 0,
          "author": 215939,
          "replies": []
        }
      ]
    },
    {
      "id": "hy7aix2",
      "text": "Bad at math, science, and generally anything useful? Become a feminist and talk about things you don’t understand with the intensity of the sun.",
      "timestamp": "2022-02-24 05:13:18",
      "score": 14,
      "num_children": 0,
      "author": 104276,
      "replies": []
    },
    {
      "id": "hy77km7",
      "text": "It's a fun woke way to twist that women are outpacing men in higher education.",
      "timestamp": "2022-02-24 04:48:55",
      "score": 10,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hy7sblr",
      "text": "Another war, another feminists MIA. Donbas has been evacuating, and men are not allowed to evacuate. If equality is the name of things, then shouldn't women also not be allowed to leave. In war, we are not equal, and in peace we are? What kind of bullshit is that?\n\nSome may say caring for the kids leaving is part of it, but there are social systems capable of handling parenting. Also, any 16 year old boy up to 60 year old men are not allowed to leave (those above this age are pensioners who are also not leaving). So there seems to be an interesting silence there. Speaks volumes, that 16 year old girls are not also told to stay and fight. The mother arguments does not work there, and who says a father should die for others?\n\nVery clear illustrations of the hypocrisy of feminism, and the idea that men and women are equal. Regardless comrades, keep going your own way.",
      "timestamp": "2022-02-24 08:10:25",
      "score": 9,
      "num_children": 0,
      "author": 218700,
      "replies": []
    },
    {
      "id": "hy6sccl",
      "text": "Women are less likely to get jobs that pay enough to actually pay off the debt, and college is crafted to shit on men in favor of these women. They dug their own grave.",
      "timestamp": "2022-02-24 02:49:22",
      "score": 34,
      "num_children": 0,
      "author": 42538,
      "replies": []
    },
    {
      "id": "hy6wf2l",
      "text": "Would canceling student loan debt stimulate the economy in favor of the people, I’m wondering if it would allow people to have more buying power within their communities?",
      "timestamp": "2022-02-24 03:20:18",
      "score": 8,
      "num_children": 5,
      "author": 383608,
      "replies": [
        {
          "id": "hy7tejb",
          "text": "Note really. The best way to go is to set up a government subsidized education system. Subsidized meaning you still pay for accommodation and about 30% of tuition. Then begin restructuring how these loans are paid. You only pay if you're actually working, and it doesn't affect anything in your life. You are required to pay, but it is an isolated loan.\n\nThis is how most reasonable countries do it. Mine effectively solved the problem of education expense by making it a mostly taxpayer issue. The little that's left can be loaned to a student, and the accommodation may also come from the loan.\n\nWhat the job requirement does, is it encourages the government to pass policies that would increase job opportunities. This essentially makes the loan pay itself. The isolated loan also means one can take business loans, and that improves job opportunities, and the fact that people can actually pay the loans. The truly open market also means business is easy to start and thoroughly competitive (which forces self- imposed higher quality regulations apart from those in policy).\n\nI could write a whole article on how exactly to solve this. But I'm not American, so Americans will have to come up with their own solutions. That said, phuck feminism!",
          "timestamp": "2022-02-24 08:23:03",
          "score": 3,
          "num_children": 1,
          "author": 218700,
          "replies": [
            {
              "id": "hy982tf",
              "text": "Seems pretty legit to me, the student loan system seems like a bit of a money grab to be honest.\n\nDoes your country also have a great medical system?",
              "timestamp": "2022-02-24 16:08:42",
              "score": 2,
              "num_children": 1,
              "author": 383608,
              "replies": [
                {
                  "id": "hyafcn2",
                  "text": "Sort of. The country is like 58 years, so not everything is fully implemented. But we have a medical insurance system that works...long as you pay the 5$ minimum monthly fee.",
                  "timestamp": "2022-02-24 20:38:54",
                  "score": 1,
                  "num_children": 0,
                  "author": 218700,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hy7agwn",
          "text": "Umm where do you think they can cancel it from. They cant just pay 1.7 trillion from no where. Plus they cant tell corpos to suck it cause it would make the industry collapse causing lower college admission rates",
          "timestamp": "2022-02-24 05:12:50",
          "score": 5,
          "num_children": 1,
          "author": 121458,
          "replies": [
            {
              "id": "hy970yx",
              "text": "I’m unsure how they would, could it be similar to a “bailout”?\n\nWould be great if you had some intel on how it would work?\n\nI’m more so curious of if the pros would outweigh the cons and what they would be?\n\nThe industry I work in make it harder for upward mobility due to student loan debt.",
              "timestamp": "2022-02-24 16:02:05",
              "score": 2,
              "num_children": 1,
              "author": 383608,
              "replies": [
                {
                  "id": "hy9klbc",
                  "text": "Well, the problem is that the govt cant suddenly pay put 2 trillion. It just doesnt have that much money lying around. Its already in debt itself. Plus, its gonna just create more dependants, people will just start getting loans without consequences. A significant problem is that people take loans for stupid degrees like art history or gender studies. Like in normal loans, they ask for collateral and do a background check. But those companies pay for degrees with no job prospects? They do this cause they know that no matter what, theyll get money as even bankruptcy cant clear student loans.",
                  "timestamp": "2022-02-24 17:26:54",
                  "score": 1,
                  "num_children": 0,
                  "author": 121458,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hy8w2yz",
          "text": "That's a fair point and worth discussing.  But making it a gendered issue is dishonest.",
          "timestamp": "2022-02-24 14:51:13",
          "score": 2,
          "num_children": 1,
          "author": 139408,
          "replies": [
            {
              "id": "hy98pas",
              "text": "I guess you could say it’s dishonest but it is attention grabbing. \nIf you post a stat on mental health I’ll raise an eyebrow but when you say “men’s mental health” and post a stat comparing it to women’s mental health it grabs my attention deeper, personally it may be because the label speaks to me.",
              "timestamp": "2022-02-24 16:12:35",
              "score": 1,
              "num_children": 0,
              "author": 383608,
              "replies": []
            }
          ]
        },
        {
          "id": "hy73um2",
          "text": "It would significantly lower the stress of people in their 20s as well as reduce worker willingness to put up with workplace bullshit.",
          "timestamp": "2022-02-24 04:18:32",
          "score": 4,
          "num_children": 0,
          "author": 258630,
          "replies": []
        },
        {
          "id": "hzlze5l",
          "text": "Well, the government always seems to find the money when they want to go war though.",
          "timestamp": "2022-03-06 19:20:46",
          "score": 1,
          "num_children": 0,
          "author": 135805,
          "replies": []
        }
      ]
    },
    {
      "id": "hy7jiho",
      "text": "Oh look, women wanting more free shit at the expense of everyone else...what a surprise!!! Why should I pay off your loan for a 3yr degree in \"feminist dance theory\"? You're stunning & brave and don't need no man...pay your own god damn way in life you lazy bitch.",
      "timestamp": "2022-02-24 06:36:01",
      "score": 7,
      "num_children": 1,
      "author": 207855,
      "replies": [
        {
          "id": "hy94nr9",
          "text": "“Feminist dance theory” is that how you get a PhD in stripperology?",
          "timestamp": "2022-02-24 15:47:11",
          "score": 2,
          "num_children": 1,
          "author": 339351,
          "replies": [
            {
              "id": "hy9kkkh",
              "text": "feminists could just learn this from their moms tbh",
              "timestamp": "2022-02-24 17:26:46",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hy79ok3",
      "text": "Women are more likely to get degrees that will ***NEVER*** pay for themselves , if not absolutely useless bullshit with no real field of employment.",
      "timestamp": "2022-02-24 05:06:13",
      "score": 7,
      "num_children": 0,
      "author": 390282,
      "replies": []
    },
    {
      "id": "hy6ozqp",
      "text": "People fail to see that feminism causes more problems than it fixes.",
      "timestamp": "2022-02-24 02:24:17",
      "score": 22,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hy74ui7",
      "text": "Why tf do they have to bring sexism into it",
      "timestamp": "2022-02-24 04:26:37",
      "score": 6,
      "num_children": 0,
      "author": 314968,
      "replies": []
    },
    {
      "id": "hy7edtd",
      "text": "Affirmative action math",
      "timestamp": "2022-02-24 05:47:06",
      "score": 6,
      "num_children": 0,
      "author": 225518,
      "replies": []
    },
    {
      "id": "hy7hl56",
      "text": "That's 54% of the total. Not two thirds, it's like 12% off from being two thirds. It's much much closer to half.",
      "timestamp": "2022-02-24 06:17:17",
      "score": 4,
      "num_children": 0,
      "author": 31701,
      "replies": []
    },
    {
      "id": "hy7ui7p",
      "text": "Maths is part of the paitrarchy",
      "timestamp": "2022-02-24 08:36:23",
      "score": 6,
      "num_children": 0,
      "author": 27702,
      "replies": []
    },
    {
      "id": "hy8fib4",
      "text": "A bunch of graduates with majors in gender studies...",
      "timestamp": "2022-02-24 12:40:25",
      "score": 6,
      "num_children": 0,
      "author": 157435,
      "replies": []
    },
    {
      "id": "hy6v3da",
      "text": " Because men are more willing to work in college, we must punish men? Ok.",
      "timestamp": "2022-02-24 03:10:09",
      "score": 14,
      "num_children": 1,
      "replies": [
        {
          "id": "hy6v4rm",
          "text": "[removed]",
          "timestamp": "2022-02-24 03:10:26",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hy6ph3w",
      "text": "Anyone have stats on how many woman and men hold degrees in the US? Seems like it is important to know the proportion of women who have debt vs men who have debt... Otherwise the numbers have no context.",
      "timestamp": "2022-02-24 02:27:54",
      "score": 11,
      "num_children": 0,
      "author": 312440,
      "replies": []
    },
    {
      "id": "hy88exc",
      "text": "Going to university is a choice. The debt that you take on for that choice is your own dumb fault. If you can't afford it, either be smart and earn a scholarship, don't go, or suck it up. Taxpayers shouldn't foot the bill for your dumb choices.",
      "timestamp": "2022-02-24 11:25:21",
      "score": 4,
      "num_children": 0,
      "author": 188174,
      "replies": []
    },
    {
      "id": "hy7u84q",
      "text": "Let's ignore the fact that more women go to college but focus on the fact that, that means more student debt for them. Must be a gender issue. Those damn men again! lol",
      "timestamp": "2022-02-24 08:32:59",
      "score": 3,
      "num_children": 0,
      "author": 177632,
      "replies": []
    },
    {
      "id": "hy8tlpn",
      "text": "Oh my god🤣\n\nMore proof that you can't just create an imaginary social justice movement for your gender, especially when the other gender is MUCH more oppressed than you are at any socioeconomic level other than Super Duper Rich. Dumbasses.",
      "timestamp": "2022-02-24 14:33:53",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hy8vhhw",
      "text": "The post demonstrates that there is one gender gap in education.  Women seem to be getting an inferior education.  I mean, they can't even do basic mathematics",
      "timestamp": "2022-02-24 14:47:09",
      "score": 2,
      "num_children": 1,
      "author": 139408,
      "replies": [
        {
          "id": "hyrdxmo",
          "text": "No just the school system has been tainted so that girls can freeload and do nothing. Let me explain. Group work is bullshit. In school there is always group work and the group is mostly female with a small bit of males always. The groups are graded by what they produce in the end so there is no serpration the grading is the same for all. If the girls want to do nothing they can. If the boy does not want to fail or boy they must do all the work themselves in order not to. The reason behind this is that they can ask to be resigned and give the reason but they will be denied always. Plus both male and female teachers favor female students.\n\nEdit: group work is a major part is school now. Just about every day or 3.",
          "timestamp": "2022-02-28 09:46:56",
          "score": 1,
          "num_children": 1,
          "author": 373757,
          "replies": [
            {
              "id": "hyrysgs",
              "text": "Dude, I was just taking a snarky dig at the Twitter poster for having her math wrong.",
              "timestamp": "2022-02-28 13:42:35",
              "score": 1,
              "num_children": 0,
              "author": 139408,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hy6mugf",
      "text": "Nah man. Just cancel all of it equally",
      "timestamp": "2022-02-24 02:08:17",
      "score": 5,
      "num_children": 1,
      "replies": [
        {
          "id": "hy72292",
          "text": "Why should taxpayers pay for some hooch that takes liberal arts, or gender, or women’s studies?\n\nI don’t want to be on the hook for *that*. That doesn’t help our society one bit.",
          "timestamp": "2022-02-24 04:04:20",
          "score": 10,
          "num_children": 0,
          "author": 67712,
          "replies": []
        }
      ]
    },
    {
      "id": "hy775li",
      "text": "[Allāhu ʾakbar](https://m.youtube.com/watch?v=Hqbd7BdOofw)",
      "timestamp": "2022-02-24 04:45:33",
      "score": 3,
      "num_children": 1,
      "replies": [
        {
          "id": "hy7aanz",
          "text": "Wtf-",
          "timestamp": "2022-02-24 05:11:21",
          "score": 4,
          "num_children": 1,
          "author": 101933,
          "replies": [
            {
              "id": "hy7vcjo",
              "text": "Yeah women’s march as a organization has a…. Problematic record of controversies.",
              "timestamp": "2022-02-24 08:46:35",
              "score": 4,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hy9d5vo",
      "text": "Yikes",
      "timestamp": "2022-02-24 16:40:23",
      "score": 1,
      "num_children": 0,
      "author": 308859,
      "replies": []
    },
    {
      "id": "hyd8u97",
      "text": "Twitter really doesn't like maths lol.",
      "timestamp": "2022-02-25 11:14:55",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzm00d9",
      "text": "Aren’t these the same people constantly bragging about how more women are getting degrees?\n\nBut at what cost? Men are doing the math and seeing it’s not worth it, go to trade school and learn a useful skill not subjective arts degree.",
      "timestamp": "2022-03-06 19:25:03",
      "score": 1,
      "num_children": 0,
      "author": 135805,
      "replies": []
    }
  ]
}