{
  "id": "t09lcl",
  "text": "When war begins, feminism takes refuge in the kitchen.\n",
  "timestamp": "2022-02-24 12:14:46",
  "score": 912,
  "subreddit": "t5_2zaj2",
  "num_children": 57,
  "author": 384022,
  "replies": [
    {
      "id": "hy8outa",
      "text": "Equality only when it's convenient.",
      "timestamp": "2022-02-24 13:58:55",
      "score": 255,
      "num_children": 3,
      "author": 394886,
      "replies": [
        {
          "id": "hycavka",
          "text": "Yep. They aren’t falling all over themselves for manual labor jobs (even high paying ones) either.",
          "timestamp": "2022-02-25 04:36:38",
          "score": 25,
          "num_children": 1,
          "author": 332706,
          "replies": [
            {
              "id": "hyrbd0n",
              "text": "Which is what traditional women were doing in the WW's",
              "timestamp": "2022-02-28 09:12:28",
              "score": 8,
              "num_children": 0,
              "author": 82106,
              "replies": []
            }
          ]
        },
        {
          "id": "hycd2zp",
          "text": "and zero accountability.",
          "timestamp": "2022-02-25 04:56:06",
          "score": 18,
          "num_children": 0,
          "author": 5390,
          "replies": []
        },
        {
          "id": "hy9wqno",
          "text": "The sad truth, well said.",
          "timestamp": "2022-02-24 18:42:40",
          "score": 41,
          "num_children": 0,
          "author": 134015,
          "replies": []
        }
      ]
    },
    {
      "id": "hy8q76q",
      "text": "Feminism stops when they might actually have to put the money where their mouths are.\n\nSorry sweethearts but you wanted equality it's about time to put up, you had your chance to shut up long ago and you blew it.",
      "timestamp": "2022-02-24 14:09:04",
      "score": 111,
      "num_children": 0,
      "author": 227190,
      "replies": []
    },
    {
      "id": "hy8tx6w",
      "text": "\" . . . if the house catches fire those *feminists* start twisting their hair into pigtails, 'I'm just a girl!' and run out first . . .\"  --Bill Burr",
      "timestamp": "2022-02-24 14:36:09",
      "score": 99,
      "num_children": 1,
      "author": 138651,
      "replies": [
        {
          "id": "hyasy45",
          "text": "lol love that stand up of his.",
          "timestamp": "2022-02-24 22:02:14",
          "score": 19,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hy8uoob",
      "text": "Well what a surprise to absolutely NO-ONE.\n\nEquality only when convenient and safe.",
      "timestamp": "2022-02-24 14:41:33",
      "score": 63,
      "num_children": 0,
      "author": 207855,
      "replies": []
    },
    {
      "id": "hy8q53a",
      "text": "All that female empowerment",
      "timestamp": "2022-02-24 14:08:36",
      "score": 74,
      "num_children": 2,
      "author": 157435,
      "replies": [
        {
          "id": "hyae59h",
          "text": "This is what I call female empowerment: [https://www.instagram.com/p/CaWcdfKoMcv/](https://www.instagram.com/p/CaWcdfKoMcv/)\n\nAre there all men among soldiers?",
          "timestamp": "2022-02-24 20:31:29",
          "score": 7,
          "num_children": 1,
          "author": 394886,
          "replies": [
            {
              "id": "hyawsls",
              "text": "Suddenly I want to fight russia for some reason",
              "timestamp": "2022-02-24 22:26:53",
              "score": 6,
              "num_children": 1,
              "author": 179627,
              "replies": [
                {
                  "id": "hyb5bgz",
                  "text": "You can fight it by not assisting it but anyway.",
                  "timestamp": "2022-02-24 23:23:42",
                  "score": 5,
                  "num_children": 0,
                  "author": 394886,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i01g0uk",
          "text": "You comment on every anti-women thread. Who hurt you?",
          "timestamp": "2022-03-09 23:42:58",
          "score": 0,
          "num_children": 0,
          "author": 25603,
          "replies": []
        }
      ]
    },
    {
      "id": "hy8u2rl",
      "text": "Don't accept their offer. Automate the kitchen, build cloning vats. Equality was demanded, and it shall be given in full.",
      "timestamp": "2022-02-24 14:37:16",
      "score": 34,
      "num_children": 1,
      "author": 218700,
      "replies": [
        {
          "id": "hyen6iq",
          "text": "I want to clone myself, at least a 100 times and let them loose",
          "timestamp": "2022-02-25 17:44:22",
          "score": 2,
          "num_children": 0,
          "author": 8366,
          "replies": []
        }
      ]
    },
    {
      "id": "hy8pxh0",
      "text": "Wow why am I not surprised",
      "timestamp": "2022-02-24 14:07:02",
      "score": 31,
      "num_children": 1,
      "author": 101933,
      "replies": [
        {
          "id": "hycns2o",
          "text": "[removed]",
          "timestamp": "2022-02-25 06:44:28",
          "score": -2,
          "num_children": 1,
          "replies": [
            {
              "id": "hyd1w8q",
              "text": "[removed]",
              "timestamp": "2022-02-25 09:43:05",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hyd20tp",
                  "text": "[removed]",
                  "timestamp": "2022-02-25 09:44:48",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hyd2kz0",
                      "text": "[removed]",
                      "timestamp": "2022-02-25 09:52:16",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hyd2nwm",
                          "text": "[removed]",
                          "timestamp": "2022-02-25 09:53:20",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hyd2u0g",
                              "text": "[removed]",
                              "timestamp": "2022-02-25 09:55:40",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hyd2xgu",
                                  "text": "[removed]",
                                  "timestamp": "2022-02-25 09:56:59",
                                  "score": 1,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hy8sth8",
      "text": "If only subs like feminism would post posts like these. I'd so love to hear what feminists have to say about this.",
      "timestamp": "2022-02-24 14:28:16",
      "score": 41,
      "num_children": 1,
      "author": 296100,
      "replies": [
        {
          "id": "hy9ejjr",
          "text": "These ppl don’t represent all feminists",
          "timestamp": "2022-02-24 16:49:06",
          "score": -19,
          "num_children": 1,
          "author": 11818,
          "replies": [
            {
              "id": "hy9gdlz",
              "text": "Of course not. I'm just super curious what your average feminist (not people like the ones in the post) would say. I don't often really see feminists calling out other feminists on their nonsense, besides the terfy radfems which they would say isn't feminists at all.",
              "timestamp": "2022-02-24 17:00:37",
              "score": 17,
              "num_children": 1,
              "author": 296100,
              "replies": [
                {
                  "id": "hyab9pi",
                  "text": "I feel gross posting here but here’s some feminist perspective:\n\nThe patriarchal influence that forces women to stay in the kitchen and have babies is the same patriarchal influence that forces men to be breadwinners and go to war. Wouldn’t the world be better if neither of those pressures existed? Wouldn’t it be nice if governments who wanted to wage pointless wars on other countries for oil or other resources had to convince men and women it was a cause worth dying for, or else they wouldn’t have armies to do it? Or better yet, wouldn’t it be better to solve our problems in more peaceful ways?\n\nIn a war scenario, it’s obviously better to cook and clean than to literally die, so I understand the (unfunny and insensitive) jokes being made in the OP, but it’s not a binary choice—the people should have more power here, and shouldn’t be used as pawns of our governments, and realizing that we’re all victims in this scenario is the first step to building that solidarity.",
                  "timestamp": "2022-02-24 20:13:47",
                  "score": -13,
                  "num_children": 4,
                  "author": 329435,
                  "replies": [
                    {
                      "id": "hyanzuv",
                      "text": "A patriarchy that benefits women and priviledges them so they do not have to go to war? That sound stupid\n\n1) There's no patriarchy, if with the same rules, men tend to rule and reach higher positions, that doesn't make it a patriarchy.\n2) Its OBVIOUS that men are stronger than women, so that is why men go to war and rule the most dangerous jobs.\n3) It is a fact and scientifically proven that women are hypergamic, so they will always tend to reach men in higher positions than them. So if he works all day and pays all the bills, who's the one to take most of the care of the child and the house? Women also has to do tasks, and to demand that is not an \"oppresion\".",
                      "timestamp": "2022-02-24 21:32:01",
                      "score": 16,
                      "num_children": 1,
                      "author": 180227,
                      "replies": [
                        {
                          "id": "hyenn29",
                          "text": "I hate that hypergamic stuff. Women eventually find out you have money so you can’t tell if they like your or the money",
                          "timestamp": "2022-02-25 17:47:16",
                          "score": 2,
                          "num_children": 0,
                          "author": 8366,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "hyat5l5",
                      "text": "> the same patriarchal influence that forces men to be breadwinners and go to war.\n\nVisitor from /all here, didn't even know this sub existed nor do I care to frequent it, but I do have a question regarding your quote above. You say this as if men are the reason for wars and conflict... as if no other female leader has ever done or would ever do the same?\n\nI'm all for agreeing the patriarchy exists and causes problems, but to lump the cause of war on the lap of patriarchy comes off as fallacious.",
                      "timestamp": "2022-02-24 22:03:33",
                      "score": 13,
                      "num_children": 1,
                      "author": 307291,
                      "replies": [
                        {
                          "id": "hyax73c",
                          "text": "I’m not saying war comes from the patriarchy (though there’s some argument for that that I won’t get into in this comment). I’m saying gendered expectations for the roles men and women take on during war come from the patriarchy, which pigeonholes women into nurturing roles and men into military roles. Again, of the two, men obviously have the shorter end of the stick. In reality though, no one should be forced into either role. Some men are more weak and nurturing, and some women are more strong and militaristic. That doesn’t mean we should have a draft that forces men and women into war equally—just that we should question it anytime our governments force us into any role.",
                          "timestamp": "2022-02-24 22:29:31",
                          "score": -8,
                          "num_children": 1,
                          "author": 329435,
                          "replies": [
                            {
                              "id": "hyaxrbu",
                              "text": "I appreciate your response. Thank you.",
                              "timestamp": "2022-02-24 22:33:10",
                              "score": 6,
                              "num_children": 0,
                              "author": 307291,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hyavxtl",
                      "text": "Making a few minor adjustments to your statement and yes Im in complete agreement with this statement:\n\n~~The patriarchal influence~~ The traditional gender roles or traditional gender influences that forces women to stay in the kitchen and have babies is the same patriarchal influence that forces men to be breadwinners and go to war. Wouldn’t the world be better if neither of those pressures existed? Wouldn’t it be nice if governments who wanted to wage pointless wars on other countries for oil or other resources had to convince men and women it was a cause worth dying for, or else they wouldn’t have armies to do it? Or better yet, wouldn’t it be better to solve our problems in more peaceful ways?\n\n>In a war scenario, it’s obviously better to cook and clean than to literally die, so I understand the (unfunny and insensitive) jokes being made in the OP, but it’s not a binary choice—the people should have more power here, and shouldn’t be used as pawns of our governments, and realizing that we’re all victims in this scenario is the first step to building that solidarity.\n\nObvoiusly its better to cook and clean than it is to literally die, like youre pointing out. While it may be an unfunny and insensitive joke the OP is making, they do also have a point. Feminists will often advocate for equality and the abolishment of traditional gender roles when it benefits them, but when traditional gender roles does benefit them, they will often be in favor of such inequality and won't call for the abolishment of the traditional gender roles that do benefit them. Its this kind of weird hypocrisy and double standards within the feminist movement that made me as a woman be critical of feminism and take a stand against it, as I cant support double standards. \n\nAs the saying goes \"Equality.. when convienent.. or equality, but only when it benefit myself\". Thats a huge issue I wish feminism would address. Lots of feminists are fine with inequality between the sexes, and men being treated in discriminatory ways, so long as it doesnt affect themselves or other women negatively. Lots of feminists also hold the view that since they have been discriminated against by men, or that since women are \"systemically oppressed\", that that gives them the right to discriminate against men. In my opinion, two wrongs dont make a right, but theres a lot of this \"tit for tat\" kind of rhetoric circling around in feminist groups, which is part of why I could never in good faith call myself a feminist. \n\nLike if you want to abolish traditional gender roles as a feminist, you dont advocate for how you wanna stay at home and cook and clean and be the postergirl for traditional gender roles as soon as war breaks out. It would make you look disingenous and fake and take away your credibility as a feminist who preaches about equality and abolishing gender roles.",
                      "timestamp": "2022-02-24 22:21:22",
                      "score": 10,
                      "num_children": 1,
                      "author": 296100,
                      "replies": [
                        {
                          "id": "hyaxxaj",
                          "text": "I really don’t think that’s an attitude any real feminists hold. If it is, they should read more feminist literature or take a class on it. Feminists basically agree that the patriarchy hurts men too and want to remove those inequalities as well. The documentary The Mask You Live In covers some of this really well.",
                          "timestamp": "2022-02-24 22:34:14",
                          "score": -3,
                          "num_children": 1,
                          "author": 329435,
                          "replies": [
                            {
                              "id": "hyb1yxr",
                              "text": "Well, that attitude is the impression myself, OP and a lot of other people get from feminists, for the reasons I just explained. \n\n>If it is, they should read more feminist literature or take a class on it.\n\nFeminist literature? It was part of my course at uni last year. A feminist class? I took one myself at uni and the class and literature only solidified the current negative impression I have on feminism today.. so yeah I doubt them Reading feminist literature is going to help. For someone who's already a feminist, it's probably going to entrench them further into the ideology of feminism. I'm not sure subscibing to an ideology is the best way to be a critical and independent thinker, but hey that's just my thoughts.\n\n\n>Feminists basically agree that the patriarchy hurts men too and want to remove those inequalities as well.\n\nThen why do a large amount of feminists blame men for all their issues? I've seen plenty of feminists in feminism subs here on Reddit twisting lots of statistics into showing that women are the victims and men are the oppressors no matter what the statistics show, and that women are hurt the most by patriarchy blah blah, and that the issues men are hurt by are nowhere near as bad as the ones women are hurt by. Do feminists remove inequalities by treating men in such discriminatory ways? Cause that's what they do when they downplay or invalidate mens issues and solely or mainly focus on women's issues. \n\nPersonally I don't believe we (in the western world at least) live in a patriarchy. I believe there's traditional gender roles that influence people in positive and negative ways. I also believe in egalitarianism or the equal and fair treatment of both men and women, which feminism has greatly failed at.\n\n>The documentary The Mask You Live In covers some of this really well.\n\nI'll have a look at it, thanks.",
                              "timestamp": "2022-02-24 23:01:08",
                              "score": 9,
                              "num_children": 0,
                              "author": 296100,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "hyaxekl",
                      "text": "[removed]",
                      "timestamp": "2022-02-24 22:30:52",
                      "score": 3,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hyaycjn",
                          "text": "Being expected (and often forced through drafts) to go die for your country is dystopian and something most feminists would be extremely critical of. Men are oppressed too in that sense. Feminism doesn’t mean women want to be dominant to men—it’s a movement to end all gender-based subordination that affects everyone.",
                          "timestamp": "2022-02-24 22:37:02",
                          "score": 0,
                          "num_children": 0,
                          "author": 329435,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hy8uyvo",
      "text": "If we ever use the draft maybe we can take some of those ladies out of the kitchen.",
      "timestamp": "2022-02-24 14:43:32",
      "score": 25,
      "num_children": 0,
      "author": 380134,
      "replies": []
    },
    {
      "id": "hy93iap",
      "text": "Equal pay until it's time to pay",
      "timestamp": "2022-02-24 15:39:51",
      "score": 24,
      "num_children": 1,
      "author": 72416,
      "replies": [
        {
          "id": "hy9s54l",
          "text": "Or maybe it’s because no one wants to go to war. There’s been disabled Twitter users that have used this same format saying “if ww3 breaks out I’m gonna just stay home and be crippled” even though some of these people advocate for the equal treatment of disabled people, no one wants to fucking die smartass",
          "timestamp": "2022-02-24 18:13:51",
          "score": -11,
          "num_children": 2,
          "author": 131219,
          "replies": [
            {
              "id": "hy9snep",
              "text": "maybe... but seems that everyone wants to go to the bathroom when the dinner bill comes...",
              "timestamp": "2022-02-24 18:17:00",
              "score": 10,
              "num_children": 1,
              "author": 72416,
              "replies": [
                {
                  "id": "hy9t4li",
                  "text": "Yeah so do men. You don’t see men being super stoked to participate in mandated war. You’re acting like men want to be drafted, they want to get up and leave too. The draft shouldn’t exist. Simple.",
                  "timestamp": "2022-02-24 18:19:57",
                  "score": -2,
                  "num_children": 1,
                  "author": 131219,
                  "replies": [
                    {
                      "id": "hyd2rat",
                      "text": "Can you show me the thread of images of men's posts about wanting to go to the kitchen and cook/clean instead of being drafted? What about the one where men throw away their values out of fear? Lol good luck with that.",
                      "timestamp": "2022-02-25 09:54:38",
                      "score": 8,
                      "num_children": 1,
                      "author": 105843,
                      "replies": [
                        {
                          "id": "hyeie7v",
                          "text": "Yeah I can actually. Back during the Vietnam war and World War Two, there were many men that either purposefully injured themselves, claimed insanity, and even claimed homosexuality in order to avoid the draft or be dishonorably discharged. The thing is, these chicks are cracking jokes about it and those dudes actually acted on it 🤷🏾‍♀️",
                          "timestamp": "2022-02-25 17:14:17",
                          "score": -2,
                          "num_children": 3,
                          "author": 131219,
                          "replies": [
                            {
                              "id": "hyemy0i",
                              "text": "he asked you for pictures/screenshoots, not words",
                              "timestamp": "2022-02-25 17:42:52",
                              "score": 3,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hyen4o6",
                                  "text": "Sorry I don’t have any pictures or screenshots from actual historical events dipshit",
                                  "timestamp": "2022-02-25 17:44:03",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 131219,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "hyf5els",
                              "text": "I'm not that interested in arguing your points because they're stupid points and you're stupid for thinking it proves you to be correct or right in any way, but I'll humor you one more time. You bring up ww2 which was the scariest war to get drafted into (probably) and the Vietnam war which was more complicated because it was jungle warfare on their home land and alot of people didn't even want a part of that war in general, for personal beliefs and etc. You're painting these men like wimps for trying to avoid near certain death for a cause they may not even believe in (in the wars you mentioned that was an expected outcome from participation). And you draw a comparison to these women joking about avoiding being potentially drafted, even though they ALMOST CERTAINLY wouldn't be on the front lines to any degree that a man who is drafted would be. Who's the real wimp in that situation? I'll tell you - it's these women who are joking about avoiding it. Just a side note aswell, I don't need to tell you what happens to the civilians of the losing side in wars do I? You fight or you lose.",
                              "timestamp": "2022-02-25 19:39:51",
                              "score": 3,
                              "num_children": 1,
                              "author": 105843,
                              "replies": [
                                {
                                  "id": "hyf6bzz",
                                  "text": "Okay well what about anti draft men’s rights activists. They don’t want to be a part of war either. Also you asked me a question, so you actually are interested in arguing. If you aren’t don’t ask questions. It’s not complicated. Also these women don’t want to be drafted not because their women but because no one wants to go to war. I also never once implied that people that didn’t want to get drafted were wimps. Besides, more complicated than what? The war that we currently aren’t even in? Nor do we extensively know details about? Okay man cool. Anyway if you don’t want to argue, don’t there’s literally nothing holding you here.",
                                  "timestamp": "2022-02-25 19:45:52",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 131219,
                                  "replies": [
                                    {
                                      "id": "hyf7zst",
                                      "text": "It's just so hard to even try to argue, your skull is either entirely air or too dense to function. Every point you bring up is incorrect or you're just grasping at straws drawing conclusions over some bullshit statistic or what have you. It's an L communicating with you. Everything you say is wrong, what do I do about that? Eventually you'll get banned from the sub and you'll either go away for good or you'll come back on a different account. Either way, you're boring.",
                                      "timestamp": "2022-02-25 19:56:33",
                                      "score": 0,
                                      "num_children": 1,
                                      "author": 105843,
                                      "replies": [
                                        {
                                          "id": "hyfbudd",
                                          "text": "If you want to believe that I’m wrong, that’s your prerogative",
                                          "timestamp": "2022-02-25 20:22:00",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 131219,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "hyrc22p",
                              "text": "Yeah, the arguing maintaining ideology in this situation is very much hard to do, I've always said that I wouldn't go to war but if the Queen said I'd do. Just waiting for the order...",
                              "timestamp": "2022-02-28 09:21:49",
                              "score": 1,
                              "num_children": 1,
                              "author": 82106,
                              "replies": [
                                {
                                  "id": "hysr7sv",
                                  "text": "Yeah probably because it’s illegal to reject a draft order. No one actually wants to go to war",
                                  "timestamp": "2022-02-28 17:04:22",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 131219,
                                  "replies": [
                                    {
                                      "id": "hysxqpu",
                                      "text": "Not even draft, just a plea on radio or news is enough for me.",
                                      "timestamp": "2022-02-28 17:45:55",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 82106,
                                      "replies": [
                                        {
                                          "id": "hysygqw",
                                          "text": "Most people would rather avoid war and violence at all cost. More power to you if you take that perspective but most people don’t work like that. That’s why it’s a completely rational thing that people don’t want to be a part of the draft. Women, men, feminists, men’s rights activists. It doesn’t matter who, if you were to ask any group to take up arms if they weren’t being directly threatened, most people would not.",
                                          "timestamp": "2022-02-28 17:50:27",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 131219,
                                          "replies": [
                                            {
                                              "id": "hyt07co",
                                              "text": "That's where my ideology and your reasoning match, you're last sentence. If the Queen were to plea, I believe it would be a situation where the UK has started to lose the war or when the war has took a turn to where it is a very likely probability that the people of the UK would be threatened. Not the same threat you mean, but a threat none the less.",
                                              "timestamp": "2022-02-28 18:01:22",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 82106,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i01ffo6",
              "text": "Agree completely! The only person on this thread with a sound and logical mind.",
              "timestamp": "2022-03-09 23:38:43",
              "score": 1,
              "num_children": 0,
              "author": 25603,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hy938tr",
      "text": "Sooo they don't know what women did in WWII?",
      "timestamp": "2022-02-24 15:38:10",
      "score": 8,
      "num_children": 0,
      "author": 214475,
      "replies": []
    },
    {
      "id": "hy99qlx",
      "text": "They deserve to be sent to the Front Line",
      "timestamp": "2022-02-24 16:19:00",
      "score": 17,
      "num_children": 0,
      "author": 311397,
      "replies": []
    },
    {
      "id": "hy8q6nw",
      "text": "Is their a \\# to find these posts on twitter?",
      "timestamp": "2022-02-24 14:08:57",
      "score": 15,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hy8txbp",
      "text": "I mean, if they truly don't want equality now, that's fine, its their choice. They just have to realize that they can't go changing their minds again once the war is over. Its either equality now, or equality never. Unfortunately, I don't think they got the memo on that.",
      "timestamp": "2022-02-24 14:36:11",
      "score": 22,
      "num_children": 0,
      "author": 354850,
      "replies": []
    },
    {
      "id": "hyacusm",
      "text": "We already know, that feminism is not realistic.",
      "timestamp": "2022-02-24 20:23:33",
      "score": 6,
      "num_children": 0,
      "author": 77091,
      "replies": []
    },
    {
      "id": "hyb2j9q",
      "text": "they think they’d be on the front line. if women get drafted, I think they’d be placed in medical positions or something similar. no need to be scared lmao",
      "timestamp": "2022-02-24 23:04:53",
      "score": 5,
      "num_children": 1,
      "author": 81564,
      "replies": [
        {
          "id": "hyd3t3v",
          "text": "Exactly",
          "timestamp": "2022-02-25 10:08:48",
          "score": 3,
          "num_children": 0,
          "author": 105843,
          "replies": []
        }
      ]
    },
    {
      "id": "hy8ylo8",
      "text": "[deleted]",
      "timestamp": "2022-02-24 15:08:04",
      "score": 16,
      "num_children": 2,
      "replies": [
        {
          "id": "hy90iwg",
          "text": "Dang!... Listen, if world war 3 does break out... you run for the hills.\n\nWar is the ultimate equalizer (men get killed, women get raped and killed - see WW2)\n\nStay safe...",
          "timestamp": "2022-02-24 15:20:42",
          "score": 12,
          "num_children": 1,
          "replies": [
            {
              "id": "hy91md0",
              "text": "[deleted]",
              "timestamp": "2022-02-24 15:27:48",
              "score": 4,
              "num_children": 2,
              "replies": [
                {
                  "id": "hy94yp3",
                  "text": "Yeah... but you also do NOT want to be a pregnant woman in the middle of a war... (also see WW2)",
                  "timestamp": "2022-02-24 15:49:09",
                  "score": 5,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hyawos9",
                  "text": "[deleted]",
                  "timestamp": "2022-02-24 22:26:12",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hyi076q",
          "text": "There are 4 posts from unverified women, nothing is happening you dingus.",
          "timestamp": "2022-02-26 10:18:02",
          "score": 1,
          "num_children": 0,
          "author": 157417,
          "replies": []
        }
      ]
    },
    {
      "id": "hybg5l1",
      "text": "Stay over there and be independent",
      "timestamp": "2022-02-25 00:40:55",
      "score": 4,
      "num_children": 0,
      "author": 33570,
      "replies": []
    },
    {
      "id": "hydj9yj",
      "text": "You know what I find funny, that for the longest time modern feminists have been fighting for more women in the military and the idea that they can do the job better than male soldiers.\n\nAnd now when a time comes for them to prove their argument right, they back peddle harder than a NFL defense running back. \n\n(Forgive the lack of football position knowledge, have seen sports in a while)",
      "timestamp": "2022-02-25 13:05:32",
      "score": 3,
      "num_children": 2,
      "author": 245260,
      "replies": [
        {
          "id": "hyi0i8l",
          "text": "Come on you have to see for yourself how stupid your comment is? You are commenting on 4 posts of people that might not even be women let alone feminists and you have to acknowledge that even id these are real women than they are probably not the ones that fought for women in the military to begin with?? \n\nYou do know that people are individuals yes?",
          "timestamp": "2022-02-26 10:22:12",
          "score": 1,
          "num_children": 0,
          "author": 157417,
          "replies": []
        },
        {
          "id": "hzlnqq5",
          "text": "They never cared about large numbers of women in the military until the 1970s/80s when the military started offering financial incentives to get poor people to volunteer.\n\nContrast that with the 50s/60s when most men,particularly 18,19 and 20 year olds had no choice in whether they served and yet 21 plus women could vote for the very politicians who were sending the men to war while they had no obligation to serve themselves.\n\nFeminists obsess over male power and privilege yet they’re never willing to examine their own privileges. When there’s an infrastructure in place they willingly take advantage of which allows them the option of being in the kitchen seems to be lost on feminists.",
          "timestamp": "2022-03-06 18:01:20",
          "score": 1,
          "num_children": 0,
          "author": 135805,
          "replies": []
        }
      ]
    },
    {
      "id": "hy9dqml",
      "text": "[deleted]",
      "timestamp": "2022-02-24 16:43:57",
      "score": 15,
      "num_children": 1,
      "replies": [
        {
          "id": "hy9s7zf",
          "text": "Or maybe it’s just a simple fact that no one wants to die",
          "timestamp": "2022-02-24 18:14:21",
          "score": -10,
          "num_children": 1,
          "author": 131219,
          "replies": [
            {
              "id": "hy9ux10",
              "text": "I'm sure the MEN don't want to die either. Can't expect equal rights just because it suits.",
              "timestamp": "2022-02-24 18:31:11",
              "score": 16,
              "num_children": 1,
              "replies": [
                {
                  "id": "hy9vfl0",
                  "text": "Yeah exactly men don’t want to die either. I’m pretty sure it’s a consensus that even amongst feminists that the draft shouldn’t exists. Women don’t want to die, men don’t want to die, people don’t want to die. It’s funny cause you see disabled people using this same angle on Twitter saying if ww3 breaks out they’re going to just stay home and be crippled despite them being advocates for equal rights for disabled people. Maybe instead of asserting that in order to make women equal to men, they have to be a part of the draft, we assert that the draft needs to be abolished 🤷🏾‍♀️",
                  "timestamp": "2022-02-24 18:34:25",
                  "score": -4,
                  "num_children": 1,
                  "author": 131219,
                  "replies": [
                    {
                      "id": "hya37d2",
                      "text": "I agree. But the thing is, the draft won't be abolished, or at least won't be any time soon. Is it not fair that woman should fight along side men? I appreciate no one wants to die and the draught sucks. But people still have to go eh!",
                      "timestamp": "2022-02-24 19:23:17",
                      "score": 10,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "hya5aam",
                          "text": "Like it’s literally like saying “man I wish that women were also fucked over in court like men so that way no one wins. No! We should be working to get rid of things that short change either party, not being anyone down to the others level.",
                          "timestamp": "2022-02-24 19:36:12",
                          "score": 0,
                          "num_children": 0,
                          "author": 131219,
                          "replies": []
                        },
                        {
                          "id": "hya4cus",
                          "text": "That doesn’t mean that feminists have to advocate to be a part of bullshit rules. Men don’t even want to be a part of bullshit rules. If feminists started advocating to become a part of the draft, that’s essentially signaling to the government that instead of thinking half the population is expendable, now the whole population is. Because of the G.I. Bill, we still have a substantial military. Besides, the draft had tons of ethical issues. Feminists should only advocate to be a part of the draft if male rights activists were also advocating for women to be a part of the draft and other than the “gotcha” mentality that men’s rights activists have when it comes to women in the draft, they don’t actually give a shit, most of them are just adamant about the idea that they don’t want to be a part of the draft. So can you give me a reason why women should advocate for something that no one actually wants to be a part of?",
                          "timestamp": "2022-02-24 19:30:24",
                          "score": -2,
                          "num_children": 1,
                          "author": 131219,
                          "replies": [
                            {
                              "id": "hya8jou",
                              "text": "Well I'm sure the men in Ukraine didn't advocate to be invaded by another country. And I'm sure many of them don't want to go to war. But they are being invaded. They want to protect their homes and family. What's the other alternative? Just let Russia bomb and shoot away? I'm sorry, it just doesn't work that way.",
                              "timestamp": "2022-02-24 19:56:52",
                              "score": 9,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hyaadye",
                                  "text": "First Women in Ukraine are also being drafted. Secondly, if you believe so strongly that women should advocate for wanting to be in the draft then you should probably tell men to shut up about how much they don’t want to be in the draft.",
                                  "timestamp": "2022-02-24 20:08:19",
                                  "score": 1,
                                  "num_children": 2,
                                  "author": 131219,
                                  "replies": [
                                    {
                                      "id": "hybacmp",
                                      "text": "\"First Women in Ukraine are also being drafted\" false information. 2014 Ukraine revived cumpolsory draft for men between ages 18-25 in case of war. There are reports of women & children being evacuated. The photos that you see are not of women being DRAFTED rather personnels who willingly joined the army. There's a difference. Please stop peddling bullshit.\nNews - https://www.google.com/amp/s/www.nbcnews.com/news/amp/ncna94906\n\nFurther , all males ages 18-60 are banned from leaving the country. So much for gender equality , LOL.",
                                      "timestamp": "2022-02-24 23:59:18",
                                      "score": 9,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hztkq23",
                                          "text": "Who is enforcing these drafts? MEN. LOL. Also, there are women WILLINGLY enlisting in the war, as you said - so that disqualifies this entire post. Women are fully willing to go to war.",
                                          "timestamp": "2022-03-08 10:15:20",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 247149,
                                          "replies": [
                                            {
                                              "id": "hztmwkg",
                                              "text": "*Furthermore*, who started this war? MEN",
                                              "timestamp": "2022-03-08 10:46:22",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 247149,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "hyae677",
                                      "text": "I'm not saying anyone wants to. I never said that. They have been invaded. What choice do they have?",
                                      "timestamp": "2022-02-24 20:31:39",
                                      "score": 8,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hyaed7i",
                                          "text": "So what’s the issue then with these women cracking jokes about not wanting to get drafted?",
                                          "timestamp": "2022-02-24 20:32:52",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 131219,
                                          "replies": [
                                            {
                                              "id": "hyakt18",
                                              "text": "Because they want equality. But only when it suits. Men don't want to go to war. Woman don't want to go. But men do go (you know when a whole country invades then) and the majority of woman don't. It's as simple as that.",
                                              "timestamp": "2022-02-24 21:12:24",
                                              "score": 4,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "hyalpzp",
                                                  "text": "You can still want equality but not want to participate in bullshit. Again, if women start advocating to sign up for the draft then men should stop complaining about it. To be equal in shitty things is the dumbest argument that could possibly be made. Also, I literally just said that women in Ukraine are a part of the draft. Women may as well also advocate for feeling obligated to hold in their emotions or getting fucked over in court too. Of course people only want equality when it suits them because people don’t want to do shitty things. Maybe your argument would be valid if men actually liked having to go to war, but they don’t. Bringing everybody down to a lower level isn’t the solution to equality and feminists shouldn’t have to feel like it is.",
                                                  "timestamp": "2022-02-24 21:18:02",
                                                  "score": 2,
                                                  "num_children": 2,
                                                  "author": 131219,
                                                  "replies": [
                                                    {
                                                      "id": "hyanzu7",
                                                      "text": "What don't you understand? It's war, a whole country is being invaded and your more bothered about feelings because something is shitty? Yeah it's shitty, but you know what's shitter,? Being invaded by a whole country. \n\nI'm not even going into the court argument, it's not in topic",
                                                      "timestamp": "2022-02-24 21:32:01",
                                                      "score": 6,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "hyaocb1",
                                                          "text": "Okay well then tell anti draft men to stop complaining about it then. Tell them to stop complaining about not wanting to be a part of the draft since you think because it’s one group’s obligation it should be everybody’s. It seems like there’s a significant amount of men that are also bothered by their feelings so tell them to suck it up 🤷🏾‍♀️",
                                                          "timestamp": "2022-02-24 21:34:10",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 131219,
                                                          "replies": [
                                                            {
                                                              "id": "hyaq7pc",
                                                              "text": "Men do suck it up, thats the point. They might not like it but they go to war to protect their family and country. But if course a feminist won't go. Because they think it's unfair.",
                                                              "timestamp": "2022-02-24 21:45:33",
                                                              "score": 4,
                                                              "num_children": 1,
                                                              "replies": [
                                                                {
                                                                  "id": "hyaqpgj",
                                                                  "text": "It’s actually illegal to reject the draft, so they suck it up against their will. Feminists would still have to go to war because it’s illegal to reject the draft and many men who were a part of the draft in ww 2 purposefully injured themselves, claimed they were gay (that’s what it took to be discharged), or went MIA to avoid prosecution for not participating in war, so no, they don’t suck it up, g.",
                                                                  "timestamp": "2022-02-24 21:48:32",
                                                                  "score": 0,
                                                                  "num_children": 1,
                                                                  "author": 131219,
                                                                  "replies": [
                                                                    {
                                                                      "id": "hyaqzcv",
                                                                      "text": "But they do. Look at Ukraine now. Hundreds of thousands of men are fighting to protect their home. Look at the original post. Do you see the irony here?",
                                                                      "timestamp": "2022-02-24 21:50:11",
                                                                      "score": 5,
                                                                      "num_children": 1,
                                                                      "replies": [
                                                                        {
                                                                          "id": "hyar95k",
                                                                          "text": "Number one, you didn’t address any of my points, number two, I’m convinced you can’t read cause this is the third time I’ve said that women were also drafted in the war in Ukraine",
                                                                          "timestamp": "2022-02-24 21:51:49",
                                                                          "score": -1,
                                                                          "num_children": 2,
                                                                          "author": 131219,
                                                                          "replies": [
                                                                            {
                                                                              "id": "hyarow4",
                                                                              "text": "O wait. I see you are one of the trolls on here! \nMod, can we ban this one...",
                                                                              "timestamp": "2022-02-24 21:54:32",
                                                                              "score": 6,
                                                                              "num_children": 1,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "hyaru7t",
                                                                                  "text": "[removed]",
                                                                                  "timestamp": "2022-02-24 21:55:28",
                                                                                  "score": 0,
                                                                                  "num_children": 1,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "hyasxr5",
                                                                                      "text": "[removed]",
                                                                                      "timestamp": "2022-02-24 22:02:11",
                                                                                      "score": 4,
                                                                                      "num_children": 1,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "hyd3e3h",
                                                                                          "text": "Yeah it's a troll, and yeah it should be banned from this sub.",
                                                                                          "timestamp": "2022-02-25 10:03:13",
                                                                                          "score": 2,
                                                                                          "num_children": 0,
                                                                                          "author": 105843,
                                                                                          "replies": []
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            },
                                                                            {
                                                                              "id": "hztlsol",
                                                                              "text": "You're perfectly coherent and make excellent points. This guy is just... special. If you know what I mean.",
                                                                              "timestamp": "2022-03-08 10:30:42",
                                                                              "score": 1,
                                                                              "num_children": 1,
                                                                              "author": 247149,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "hztmkfh",
                                                                                  "text": "Also I find it fucked up that these dudes cowering behind their computer screens are using the heroism of another person (people fighting a war in the Ukraine) to prop up their misogynistic bullshit. Like I highly doubt some dude in the Ukraine getting his face blasted off gives a shit about your shitty little bigoted ideas.",
                                                                                  "timestamp": "2022-03-08 10:41:40",
                                                                                  "score": 1,
                                                                                  "num_children": 1,
                                                                                  "author": 247149,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "hztn388",
                                                                                      "text": "Also who even started this war and enforced these drafts? Men. Talk about fucking hypocrisy.",
                                                                                      "timestamp": "2022-03-08 10:48:54",
                                                                                      "score": 1,
                                                                                      "num_children": 0,
                                                                                      "author": 247149,
                                                                                      "replies": []
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    },
                                                    {
                                                      "id": "hztld26",
                                                      "text": "Right? Maybe men should advocate for wanting to not be able to avoid predatory men who wanna drug, rape and then impregnate them and then on top of that have to face anti abortion laws created by more men in order to control their bodies. Oops..I forgot. They're men, they literally don't have that problem.",
                                                      "timestamp": "2022-03-08 10:24:26",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "author": 247149,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hy8xnv5",
      "text": "We always knew this",
      "timestamp": "2022-02-24 15:01:51",
      "score": 10,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hy9fz5h",
      "text": "That whole movemet is a joke at this point.",
      "timestamp": "2022-02-24 16:58:08",
      "score": 9,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hy98ojd",
      "text": "Absolutely not surprising",
      "timestamp": "2022-02-24 16:12:27",
      "score": 9,
      "num_children": 0,
      "author": 407104,
      "replies": []
    },
    {
      "id": "hy90ozu",
      "text": "Idk who said it, but I remember the words. Feminism can only exist in peaceful times, or in first world countries.",
      "timestamp": "2022-02-24 15:21:47",
      "score": 13,
      "num_children": 0,
      "author": 74439,
      "replies": []
    },
    {
      "id": "hyc4s9e",
      "text": "May as well start beating them again too 😂",
      "timestamp": "2022-02-25 03:46:12",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hy8v228",
      "text": "Amazing. Am I surprised? Nope",
      "timestamp": "2022-02-24 14:44:10",
      "score": 9,
      "num_children": 1,
      "author": 115217,
      "replies": [
        {
          "id": "hyen5z1",
          "text": "happy cake day",
          "timestamp": "2022-02-25 17:44:16",
          "score": 0,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hy90e84",
      "text": "Maybe this is a good thing.",
      "timestamp": "2022-02-24 15:19:51",
      "score": 6,
      "num_children": 0,
      "author": 22741,
      "replies": []
    },
    {
      "id": "hy9zk6x",
      "text": "So much for empowerment…",
      "timestamp": "2022-02-24 19:00:27",
      "score": 7,
      "num_children": 1,
      "author": 238827,
      "replies": [
        {
          "id": "hyd3oca",
          "text": "The fact of the matter Is if you put a 120lb backpack on a woman, she crumbles like a fucking crouton.",
          "timestamp": "2022-02-25 10:06:59",
          "score": 2,
          "num_children": 0,
          "author": 105843,
          "replies": []
        }
      ]
    },
    {
      "id": "hy9jeaz",
      "text": "Its a good job that the boys on the front lines need to be fed. Off you go then ladies...\n\n^(/s obviously)",
      "timestamp": "2022-02-24 17:19:33",
      "score": 4,
      "num_children": 0,
      "author": 125719,
      "replies": []
    },
    {
      "id": "hy9s2vw",
      "text": "Nope.  You go on the front lines.",
      "timestamp": "2022-02-24 18:13:28",
      "score": 4,
      "num_children": 0,
      "author": 214233,
      "replies": []
    },
    {
      "id": "hyb3w6g",
      "text": "My. Fucking. God 🤦‍♂️",
      "timestamp": "2022-02-24 23:13:58",
      "score": 2,
      "num_children": 0,
      "author": 186042,
      "replies": []
    },
    {
      "id": "hyb9wjs",
      "text": "This is hilarious",
      "timestamp": "2022-02-24 23:56:05",
      "score": 2,
      "num_children": 0,
      "author": 269934,
      "replies": []
    },
    {
      "id": "hybnlk3",
      "text": "I'm shocked, absolutely shocked I tell you.",
      "timestamp": "2022-02-25 01:35:36",
      "score": 2,
      "num_children": 0,
      "author": 398446,
      "replies": []
    },
    {
      "id": "hyd8j8l",
      "text": "Kitchen is a bunker for them.",
      "timestamp": "2022-02-25 11:11:06",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hy8ycac",
      "text": "If this is the case, should have gotten into WWIII sooner.",
      "timestamp": "2022-02-24 15:06:19",
      "score": 4,
      "num_children": 0,
      "author": 161280,
      "replies": []
    },
    {
      "id": "hyabdyd",
      "text": "I am so shocked...(sarcasm)\n\nLOL",
      "timestamp": "2022-02-24 20:14:31",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hyasm5b",
      "text": "# They think equality is a buffet.",
      "timestamp": "2022-02-24 22:00:11",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hyb010p",
      "text": "You know what, I'll say something for these women that they're too pussy to say; \n\nIf they start drafting, I'll join if my man gets drafted. I'll go out and fight alongside men.",
      "timestamp": "2022-02-24 22:48:11",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hy9a0lk",
      "text": "ignore them. Humans by nature are selfish.",
      "timestamp": "2022-02-24 16:20:42",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hy9h0lj",
      "text": "That’s epic.  I love it.  \n\nI’m all about traditional gender roles.  Thankfully, my old lady is as well.",
      "timestamp": "2022-02-24 17:04:37",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hyaosio",
      "text": "You aren’t a real feminist, if you can’t die for it",
      "timestamp": "2022-02-24 21:36:58",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hy9ruf8",
      "text": "Has anyone ever thought they say this because no one wants to die and the draft is stupid? 🧐",
      "timestamp": "2022-02-24 18:12:00",
      "score": 2,
      "num_children": 1,
      "author": 131219,
      "replies": [
        {
          "id": "hyb0a7q",
          "text": "Then they should fight to get rid of it, not make it a men only draft",
          "timestamp": "2022-02-24 22:49:53",
          "score": 8,
          "num_children": 1,
          "replies": [
            {
              "id": "hydxeyz",
              "text": "The thing though is people don't look beyond what causes them discomfort/injustice. They tent to be more proactive about issues they face than the issues others face but they don't put an effort to question and fight other injustices, in this case men being drafted. Coming from a slightly less developed country i can tell that a lot of issues women face here, men don't even acknowledge them. I guess having forums to highlight different causes such as this is so important.",
              "timestamp": "2022-02-25 14:57:29",
              "score": 1,
              "num_children": 0,
              "author": 242432,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hyb22li",
      "text": "[removed]",
      "timestamp": "2022-02-24 23:01:49",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "hyc3qdz",
          "text": "[removed]",
          "timestamp": "2022-02-25 03:37:56",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hya2zzj",
      "text": "I'm sorry but most of them are bait accs and LARPers😂",
      "timestamp": "2022-02-24 19:22:01",
      "score": -3,
      "num_children": 1,
      "author": 17448,
      "replies": [
        {
          "id": "hya7v9c",
          "text": "Lol, exactly what I thought..",
          "timestamp": "2022-02-24 19:52:39",
          "score": 1,
          "num_children": 0,
          "author": 261595,
          "replies": []
        }
      ]
    },
    {
      "id": "hy9304j",
      "text": "don't ya'll think they're joking? I saw a few reels on instagram about it xd",
      "timestamp": "2022-02-24 15:36:37",
      "score": -8,
      "num_children": 2,
      "author": 39559,
      "replies": [
        {
          "id": "hy9axme",
          "text": "They're not joking; women initially got the right to vote without having the requirement to be eligible for the draft.   \n\n\nIt was always hypocrisy and entitlement from the very beginning.",
          "timestamp": "2022-02-24 16:26:22",
          "score": 15,
          "num_children": 1,
          "author": 172070,
          "replies": [
            {
              "id": "hyhpo92",
              "text": "They were fighting for a right to vote because you should be entitled to that as an American. No one wants to die, of course they’re not going to advocate to be a part of the draft",
              "timestamp": "2022-02-26 07:59:07",
              "score": 1,
              "num_children": 1,
              "author": 131219,
              "replies": [
                {
                  "id": "hyj69c9",
                  "text": "Okay? I agree with that but the point stands that they advocated for getting the privilege without the responsibility. When women got the right to vote, there were still men who couldn't vote for other reasons; neither could women of a minority status.\n\nAs I stated, feminism has always been about special treatment, not equal treatment.",
                  "timestamp": "2022-02-26 16:53:03",
                  "score": 2,
                  "num_children": 0,
                  "author": 172070,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hy949ly",
          "text": "Even tho a joke, they shouldn't apply it irl \n\nthey want equal right but not equal responsibilities",
          "timestamp": "2022-02-24 15:44:40",
          "score": 12,
          "num_children": 1,
          "author": 101933,
          "replies": [
            {
              "id": "hyhpjrd",
              "text": "If people that have the responsibilities don’t even want them then why should women advocate for something that no one wants to be a part of",
              "timestamp": "2022-02-26 07:57:35",
              "score": 1,
              "num_children": 0,
              "author": 131219,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hyb3n85",
      "text": "No miss things. Yall need to go to war with us 💅👏🙄.",
      "timestamp": "2022-02-24 23:12:18",
      "score": 1,
      "num_children": 0,
      "author": 346334,
      "replies": []
    },
    {
      "id": "hycdq29",
      "text": "If this reasonably represents the mood of the feminist movement, then it's yet further evidence of its deep-set political conservatism.",
      "timestamp": "2022-02-25 05:01:57",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hymbi4z",
      "text": "If they aren't able bodied they should be cooking for the soldiers in war.",
      "timestamp": "2022-02-27 07:40:33",
      "score": 1,
      "num_children": 0,
      "author": 60163,
      "replies": []
    },
    {
      "id": "hynd3ky",
      "text": "Just curious we are aware these are jokes right ? Also not just women are making jokes about how to dodge the war.",
      "timestamp": "2022-02-27 14:47:58",
      "score": 1,
      "num_children": 0,
      "author": 374377,
      "replies": []
    },
    {
      "id": "hzq03y8",
      "text": "Idk if you are  this uncapable of understanding sarcasm , or just hate women so much you refuse to believe they can make jokes. Shut the fuck up already.",
      "timestamp": "2022-03-07 16:50:15",
      "score": 1,
      "num_children": 0,
      "author": 160668,
      "replies": []
    },
    {
      "id": "hzq93th",
      "text": "at the time this was more of a joke as of this moment Take a look at this https://www.instagram.com/p/CaWcdfKoMcv/?utm\\_source=ig\\_web\\_button\\_share\\_sheet",
      "timestamp": "2022-03-07 17:48:15",
      "score": 1,
      "num_children": 0,
      "author": 9453,
      "replies": []
    },
    {
      "id": "i0j15sc",
      "text": "I think what they’re doing are called jokes",
      "timestamp": "2022-03-13 19:42:26",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hyaaz81",
      "text": "Hell nah, bullets don’t give a shit if your feminist or masochist or any other ist. They fly from a rifle the same no matter who’s squeezing that trigger.",
      "timestamp": "2022-02-24 20:11:58",
      "score": -2,
      "num_children": 0,
      "author": 273787,
      "replies": []
    },
    {
      "id": "hy9h5l3",
      "text": "And y'all say feminists don't have humor BAHAHAHAHA.",
      "timestamp": "2022-02-24 17:05:29",
      "score": -8,
      "num_children": 0,
      "author": 244915,
      "replies": []
    },
    {
      "id": "hy9ehjg",
      "text": "Im pretty sure most of these r jokes…",
      "timestamp": "2022-02-24 16:48:45",
      "score": -9,
      "num_children": 0,
      "author": 11818,
      "replies": []
    },
    {
      "id": "hy9efdi",
      "text": "G u dont honestly think that these ppl represent all feminists right?",
      "timestamp": "2022-02-24 16:48:22",
      "score": -13,
      "num_children": 0,
      "author": 11818,
      "replies": []
    },
    {
      "id": "hztdktu",
      "text": "Hahahaha how many of you losers have actually been to war...and Call of Duty doesn't count. Sorry. You slack jawed fucks have muscular atrophy from raw dogging your right hand too much and a morbid case of obesity from using the other hand to shovel a never ending supply of Cheetos into your fat throats. Also you probably don't even buy your own groceries because your mom does all the shopping, cooking and cleaning for your lazy fucken basement dwelling asses. \n\nPs. I love downvotes. Give them to me you fucken scumbags.",
      "timestamp": "2022-03-08 08:33:42",
      "score": 0,
      "num_children": 0,
      "author": 247149,
      "replies": []
    }
  ]
}