{
  "id": "t132uh",
  "text": "Class is in session\n",
  "timestamp": "2022-02-25 12:40:07",
  "score": 9274,
  "subreddit": "t5_3fdcn",
  "num_children": 25,
  "author": 382713,
  "replies": [
    {
      "id": "hydgkdg",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-02-25 12:40:07",
      "score": 1,
      "num_children": 1,
      "author": 184140,
      "replies": [
        {
          "id": "hyf8y1g",
          "text": "The warship killed them for it, which was downright cruel and unprofessional. A warning shot might have established the power disparity.",
          "timestamp": "2022-02-25 20:02:45",
          "score": 1,
          "num_children": 0,
          "author": 264568,
          "replies": []
        }
      ]
    },
    {
      "id": "hydqdxv",
      "text": "The fucking cast iron balls on those guys. I'm in awe.",
      "timestamp": "2022-02-25 14:05:16",
      "score": 299,
      "num_children": 3,
      "author": 313742,
      "replies": [
        {
          "id": "hydthze",
          "text": "That's been the attitude of the whole Ukrainian population, from what I've seen.\n\nUkraine is looking harder to invade than Switzerland right now.\n\nСлава Україні!",
          "timestamp": "2022-02-25 14:28:59",
          "score": 171,
          "num_children": 1,
          "replies": [
            {
              "id": "hye0eak",
              "text": "[deleted]",
              "timestamp": "2022-02-25 15:18:13",
              "score": 117,
              "num_children": 1,
              "replies": [
                {
                  "id": "hyftmmo",
                  "text": "It comes from a long history of invasions from both directions, resisting occupations, and having to fight tooth and nail to maintain autonomy.\n\nIt's a hardened strength that is earned through constant hardship not common to many.",
                  "timestamp": "2022-02-25 22:19:00",
                  "score": 30,
                  "num_children": 0,
                  "author": 10670,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hye108f",
          "text": "Do we know who the names of these men and women?",
          "timestamp": "2022-02-25 15:22:18",
          "score": 27,
          "num_children": 1,
          "author": 245123,
          "replies": [
            {
              "id": "hyejs2i",
              "text": "We should.  We fucking should.\n\nThey're almost certainly dead now.\n\n---\n\nIf Putin ever gets put on trial for this he should be forced to hold himself at chin-up over red-hot (whatever temperature is enough to cause searing pain without killing the nerves) rusty spikes (far enough apart that you can't bed-of-nails them) while the names of every casualty of the war is read out at funeral pace until he can recite the entire list from memory flawlessly.  He likes to pretend to be a strong and smart man, lets see some proof!",
              "timestamp": "2022-02-25 17:23:00",
              "score": 43,
              "num_children": 2,
              "replies": [
                {
                  "id": "hyeta7x",
                  "text": "> They're almost certainly dead now.\n\nper all reports, the 18 Ukrainian soldiers guarding snake island have been killed in action.\n\nso, the right have tried to co-opt the phrase 'μολὼν λαβέ' or \"MOLON LABE\", which means 'come and take them'.  to the right, this is meant to indicate that they will fight if you try to take their guns.\n\nthe phrase is attributed to Spartan king Leonidas, at the battle of Thermopylae.  Persian emperor Xerxes had invaded Greece to repay an insult the Athenians dealt to his father Darius (they gave military assistance to a Persian occupied city and burned the seat of the local Satrap) which Darius seethed over for the rest of his life but never managed to get around to repaying.  \n\nXerxes gave the Spartans several opportunities not to get between his father's unfinished business and Athens, first sending an envoy to warn them that the Persian army was so great, its arrows would blot out the sun, to which Leonidas famously responded \"then we will fight in the shade.\"   \n(he did not pointlessly bellow THIS IS SPAR TAAAH and murder the messengers, because that's what an insane idiot villain would do.  he let the messengers take his response back to Xerxes.  the way sane people with impulse control do.  okay so look i really did not like that movie but i'll try not to keep harping on it.)\n\nthe greek defense force chose to make their stand at Thermopylae - literally 'hot gates', it was a tourist attraction, a natural hot springs up in the mountains that also happened to be a  a natural bottleneck - in order to delay the Persian army and the rest of Greece time to gather and organize.    \n(also they were in the middle of a religious festival during which they were forbidden to pick up arms, it was a whole thing.)     \n\nbtw contrary to that fucking movie there were actually close to 3,000 Greek soldiers at Thermopylae, plus their shieldbearers, plus their slaves, plus their supply train.   the legend of the 300 Spartans comes from the third day, when Leonidas sent the allies home because it had become became clear they were about to be overrun.   \n\nkk so the 3000 Greeks have held Thermopylae for two solid days, holding off an army of between 750,000 and 2,000,000 soldiers -nobody can agree how many, everybody agrees it was fucking huge, composed of the pledged armies of every nation under the Persian empire.  \n\nthe Greeks are holding due to a combination of a strong military formation called phalanx (a wall of big shields and long spears constantly pushing forward) and a near-perfect defensive position - the Persian army  is forced to funnel up a relative narrow corridor with a sheer mountain on one side and a sheer drop on the other, they can't ever make use of their absurdly overwhelming numbers.  \nthey are holding, but it's only a matter of time how long they can hold.  the Greeks will tire, their losses will mount and their line will eventually degrade, falter and collapse and then they will all die.  every Greek there is keely aware - *it's just a matter of time.*  \n   \ntwo full days, sunup to sundown, three thousand guys held that pass.  \n\non the third day, it comes to Leonidas' attention that Xerxes has learned about a passage in the mountains that will allow him to bypass Thermopylae and ultimately surround the Greeks.  this is it, it is over, they cannot hold any longer, they are about to be surrounded and overrun and any Greek still at Thermopylae *will* die.  \n \nso Leonidas sends everybody else home, the 300 Spartans (plus slaves, shieldbearers, etc) are going to stay behind, they will hold the pass as long as they can.\n\nXerxes sends one final envoy, offering one last chance to give up.  'lay down your arms,' Xerxes' message reads.  \n\n'come and take them,' Leonidas replies.\n\nthat's the context missing from those stickers you may have seen on the back of suvs and oversized pickup trucks. \n Leonidas was offered a choice between surrender or slaughter and he told them to go fuck themselves.\n\nthats what's happened here, on snake island.\n\nthat's what 'russian warship, go fuck yourself' is.\n\nLeonidas would have been proud.",
                  "timestamp": "2022-02-25 18:22:28",
                  "score": 41,
                  "num_children": 3,
                  "replies": [
                    {
                      "id": "hygbml6",
                      "text": "This was an excellent and moving write up. Thank you.",
                      "timestamp": "2022-02-26 00:27:51",
                      "score": 11,
                      "num_children": 0,
                      "author": 21061,
                      "replies": []
                    },
                    {
                      "id": "hyftrtl",
                      "text": "I didn't know that is where \"Then we will fight in the shade\" came from.\n\n>  okay look i really did not like that movie, i'll try not to keep harping on that, sorry.\n\nDon't worry about it.  I know all about hating ahistorical crap in movies.  My knowledge tends 800-1400 personally.  (The only movie I give an exception to is \"A Knights Tale\", because they knew exactly what they were doing)\n\n> it wasn't just defiance, it was defiance in the face of absolutely certain death.\n\nYeah...  Not really sure what I can say to that, other than something along the lines of \"May the price for your lives be higher than they ever dreamed possible.\"",
                      "timestamp": "2022-02-25 22:19:58",
                      "score": 3,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "ifoqssf",
                      "text": "Ok so two things about this: \n\nFirst is a historical accuracy thing. The religious festival you refer to actually was not taking place during Thermopylae. There was a time during the Greco-Persian Wars of Xerxes that the Spartans refused to assist the Athenians due to a religious festival. (That would be during the battle of Marathon.)\n\nSecondly. You present the Spartans (and Greeks in general) as the “good side” here. It is important to note that the Greeks were no better than the Persians. Sparta was an oppressive, proto-fascist diarchy, and Athens was a failed “democracy” that was basically ruled by a council of 12 nobles. Persia, on the other hand, though an absolute monarchy, was also by the standards of the time a peaceful, prosperous, and free nation. Conquered Persian people were allowed to practice their religion and keep their culture in peace. Cyrus the Great returned deported Jews to their homeland and gave them money to build the Second Temple. And the Persian satrapy system made a very efficient bureaucracy. All in all, the whole “evil, authoritarian, east” vs “good, Democratic, west,” is a very Eurocentric and frankly racist worldview.",
                      "timestamp": "2022-07-11 05:05:17",
                      "score": 1,
                      "num_children": 0,
                      "author": 12038,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "hyf4khj",
                  "text": "You are correct they are dead",
                  "timestamp": "2022-02-25 19:34:21",
                  "score": 6,
                  "num_children": 0,
                  "author": 227562,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hyf6h8d",
          "text": "What's the story?",
          "timestamp": "2022-02-25 19:46:48",
          "score": 5,
          "num_children": 1,
          "author": 306652,
          "replies": [
            {
              "id": "hyf7w60",
              "text": "13 border guards on a tiny island of no real significance. Armed only with small arms. A Russian navy warship tells them to surrender since they're outgunned. Dudes tell them 'fuck you'.",
              "timestamp": "2022-02-25 19:55:53",
              "score": 37,
              "num_children": 1,
              "author": 313742,
              "replies": [
                {
                  "id": "hygnbgy",
                  "text": "\"Should I tell them to fuck themselves?\"\n\n\"Russian warship, go fuck yourselves!\"",
                  "timestamp": "2022-02-26 01:58:59",
                  "score": 10,
                  "num_children": 0,
                  "author": 9224,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hydioya",
      "text": "Kinda puts all the 'muh freedumz' in perspective.",
      "timestamp": "2022-02-25 13:00:16",
      "score": 201,
      "num_children": 1,
      "author": 155971,
      "replies": [
        {
          "id": "hydoead",
          "text": "It doesn't, at least not for me. My perspective of them was always entitled pieces of shit who cry over the tiniest of inconveniences.\n\n\"Wah, wah, I don't wanna do the bare minimum to help protect other people! Telling me to wear a mask is LITERALLY THE HOLOCAUST!\"",
          "timestamp": "2022-02-25 13:49:25",
          "score": 183,
          "num_children": 1,
          "replies": [
            {
              "id": "hydpt3d",
              "text": "I agree. None of them will ever have the tact to stop pretending to be victims. Not ever. If I had things my way, I'd give them all a taste of victimhood by forcing them to work a week in the sweat shops their iphones are made in. You can only pretend to be a victim if you've never walked a mile in their shoes",
              "timestamp": "2022-02-25 14:00:43",
              "score": 63,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hyeg1cl",
      "text": "People actually fighting for their freedom.",
      "timestamp": "2022-02-25 16:59:19",
      "score": 37,
      "num_children": 0,
      "author": 334314,
      "replies": []
    },
    {
      "id": "hye2wa6",
      "text": "That's the difference between actually caring about your country and its people, and just being a whiny entitled brat",
      "timestamp": "2022-02-25 15:34:59",
      "score": 53,
      "num_children": 0,
      "author": 374487,
      "replies": []
    },
    {
      "id": "hye46e5",
      "text": "More metal than metal.",
      "timestamp": "2022-02-25 15:43:31",
      "score": 17,
      "num_children": 1,
      "author": 280677,
      "replies": [
        {
          "id": "hygl84k",
          "text": "Sabaton are probably already working on a song about this",
          "timestamp": "2022-02-26 01:42:26",
          "score": 3,
          "num_children": 0,
          "author": 93434,
          "replies": []
        }
      ]
    },
    {
      "id": "hyejciw",
      "text": "“Conservatives” are professional victims and little bitches to boot.",
      "timestamp": "2022-02-25 17:20:19",
      "score": 78,
      "num_children": 2,
      "author": 153638,
      "replies": [
        {
          "id": "hygisx5",
          "text": "For all the talk about \"the left\" being snowflakes, they sure seem to run heavily on outrage culture...",
          "timestamp": "2022-02-26 01:23:19",
          "score": 12,
          "num_children": 1,
          "author": 285680,
          "replies": [
            {
              "id": "hygj134",
              "text": "It’s all they’ve got. They have no policy to run on.",
              "timestamp": "2022-02-26 01:25:07",
              "score": 9,
              "num_children": 0,
              "author": 153638,
              "replies": []
            }
          ]
        },
        {
          "id": "hyett2c",
          "text": "Most Eastern Europeans are very conservative leaning",
          "timestamp": "2022-02-25 18:25:42",
          "score": -61,
          "num_children": 2,
          "author": 104449,
          "replies": [
            {
              "id": "hyetwne",
              "text": "I was referring to the neck beards here",
              "timestamp": "2022-02-25 18:26:19",
              "score": 33,
              "num_children": 0,
              "author": 153638,
              "replies": []
            },
            {
              "id": "hyfgx3l",
              "text": "Uhhhh compared to US conservatives they’re not.",
              "timestamp": "2022-02-25 20:55:01",
              "score": 24,
              "num_children": 0,
              "author": 390082,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hydjfjt",
      "text": "Beep boop -- this looks like a screenshot of a tweet! Let me grab a [link to the tweet](https://twitter.com/DeathMetalV/status/1497053407349194752) for ya :) \n\n ^(Twitter Screenshot Bot)",
      "timestamp": "2022-02-25 13:06:57",
      "score": 42,
      "num_children": 1,
      "author": 259200,
      "replies": [
        {
          "id": "hydjup0",
          "text": "good bot",
          "timestamp": "2022-02-25 13:10:43",
          "score": 13,
          "num_children": 0,
          "author": 229309,
          "replies": []
        }
      ]
    },
    {
      "id": "hye5e78",
      "text": "GO FUCK YOURSELF RUSSIA.",
      "timestamp": "2022-02-25 15:51:30",
      "score": 40,
      "num_children": 1,
      "author": 30298,
      "replies": [
        {
          "id": "hyggzhr",
          "text": "Putin can lick my fat nuts",
          "timestamp": "2022-02-26 01:09:11",
          "score": 3,
          "num_children": 0,
          "author": 226304,
          "replies": []
        }
      ]
    },
    {
      "id": "hyerjxg",
      "text": "Or inciting an insurrection on a lie.",
      "timestamp": "2022-02-25 18:11:49",
      "score": 11,
      "num_children": 0,
      "author": 252211,
      "replies": []
    },
    {
      "id": "hyf2ni7",
      "text": "Russians assaulting Ukraine right now are as cowardly as the piece of shit hiding in a bunker like the cowardly little shit he is. Bladdymeer Poopin, get fucked.",
      "timestamp": "2022-02-25 19:21:47",
      "score": 11,
      "num_children": 0,
      "author": 194475,
      "replies": []
    },
    {
      "id": "hyfw0k4",
      "text": "For those who don't know, Zelensky announced that all thirteen guards will be posthumously awarded the title of Hero of Ukraine (according to Wikipedia).",
      "timestamp": "2022-02-25 22:35:17",
      "score": 7,
      "num_children": 0,
      "author": 321403,
      "replies": []
    },
    {
      "id": "hyeso52",
      "text": "It shows the weakness of today society. They usually use the rhetoric that they are though, however they think that wearing a mask and taking some vaccines is comparable the the Holocaust. They are the weakest members of our society. Holding back progress, they are what they think they despise",
      "timestamp": "2022-02-25 18:18:45",
      "score": 23,
      "num_children": 1,
      "author": 172269,
      "replies": [
        {
          "id": "hyhdz0o",
          "text": "I miss the good old days when warning labels on shampoo and tide pods didn’t exist and Darwinism helped weed out the weakest intellectual links.\n\nWe shouldn’t have to explain the basics to literal adults.\nWe have opposed the natural order, this is our punishment.",
          "timestamp": "2022-02-26 05:46:48",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hyekn4v",
      "text": "Watching all the alt right subs is hilarious. \n\nPolitical compass memes is trying to pretend that haven't been fascist lovers and conspiracy is just fucking gone.",
      "timestamp": "2022-02-25 17:28:26",
      "score": 32,
      "num_children": 3,
      "replies": [
        {
          "id": "hyfbjje",
          "text": "One side fights for their freedom against tyranny by literally taking up arms and standing up against an invading army lead by a bonkers madman.\n\nThe other side fights for their fReEdOm against tYrAnNy by...refusing to be mildly inconvenienced wearing a paper mask and repeating talking points of a bonkers madman.",
          "timestamp": "2022-02-25 20:19:59",
          "score": 13,
          "num_children": 0,
          "author": 284383,
          "replies": []
        },
        {
          "id": "hygpfsx",
          "text": "all the anti mask/anti vaxx anti mandates trolls sure got quiet all of the sudden didnt it?",
          "timestamp": "2022-02-26 02:15:48",
          "score": 5,
          "num_children": 1,
          "author": 267805,
          "replies": [
            {
              "id": "hygqaik",
              "text": "It's actually interesting to watch how they move from topic to topic.\n\nIt started off as anti lockdown, then anti mask, etc., then the Big Lie, then the Canadian blockade, now Ukraine. \n\nAnd when they move, they drop things hard.\n\nLike progressives are pissed off at Russia but we are also stilled pissed at Jan. 6th and Biden not canceling student debt.\n\nIt seems like they just take up anything contradictory of Democrats.",
              "timestamp": "2022-02-26 02:22:25",
              "score": 3,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hyf5p62",
          "text": "Those subs are pretty much petri dishes for RWNJs and future domestic terrorists.",
          "timestamp": "2022-02-25 19:41:46",
          "score": 9,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hyf92g2",
      "text": "It's just the Russians sending tank convoys and 250,000 troops to protest mask mandates in Ukraine by blocking traffic and commerce to get their very valid points across, according to Tucker Swanson Carlson.\n\nThey're just peace and personal freedom loving individuals who want to submit a letter of protest to the Ukraine Parliament. Nothing to see here. \n\nIt's Russia's version of our all-American salt of the earth kristian krazy truckers protesting.",
      "timestamp": "2022-02-25 20:03:34",
      "score": 6,
      "num_children": 0,
      "author": 114177,
      "replies": []
    },
    {
      "id": "hygh6xh",
      "text": "Found another place on Reddit where I feel like I may belong!!!",
      "timestamp": "2022-02-26 01:10:46",
      "score": 5,
      "num_children": 1,
      "author": 240134,
      "replies": [
        {
          "id": "hyhxhbp",
          "text": "Welcome, friend!",
          "timestamp": "2022-02-26 09:41:21",
          "score": 3,
          "num_children": 0,
          "author": 308457,
          "replies": []
        }
      ]
    },
    {
      "id": "hyfgjau",
      "text": "I think we should refer to people at these trucker rally’s like they referred to bikers in South Park. This is what the word should be used for. A bunch of gun toting babies with beer bellies crying about nothing.",
      "timestamp": "2022-02-25 20:52:30",
      "score": 9,
      "num_children": 1,
      "author": 33070,
      "replies": [
        {
          "id": "hyfvdgt",
          "text": "Fucking Flu Fascists. I calls it like they describe themselves, draping themselves in the flag, claiming divine calling, and subsequent demands for replacing elected representatives with themselves, unelected, through the threat and carrying out of violent uncivil acts.",
          "timestamp": "2022-02-25 22:30:53",
          "score": 6,
          "num_children": 0,
          "author": 206419,
          "replies": []
        }
      ]
    },
    {
      "id": "hyg6ir1",
      "text": "I'd rather be rich than stupid. - Jack Handy.\n\nThis is the same kind of thinking.",
      "timestamp": "2022-02-25 23:49:50",
      "score": 2,
      "num_children": 0,
      "author": 272739,
      "replies": []
    },
    {
      "id": "hyhaeuw",
      "text": "Imagine being a big fat baby whining about \"muh freedums\" and sitting on your ass in a truck because you're unwilling to protect your fellow man, while countries are being invaded by monsters",
      "timestamp": "2022-02-26 05:12:12",
      "score": 2,
      "num_children": 0,
      "author": 110067,
      "replies": []
    },
    {
      "id": "hygcl0s",
      "text": "Wait, did i miss a warship battle? When did that happen?",
      "timestamp": "2022-02-26 00:35:09",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "hyhahfk",
          "text": "Yesterday. Not a warship battle though. 13 Ukrainian soldiers on an island called Snake Island told a Russian warship to Go Fuck Yoirself, after the warship radioed them and told them to surrender the island to them. The Russian warship then shelled the entire island, killing all 13 heros.",
          "timestamp": "2022-02-26 05:12:53",
          "score": 2,
          "num_children": 1,
          "author": 54010,
          "replies": [
            {
              "id": "hyhl33m",
              "text": "Holy fuck. That is super sad but also amazingly badass and (having no connection to Ukraine whatsoever) makes me proud as fuck of those 13 and the spirit of the Ukrainian people.",
              "timestamp": "2022-02-26 07:03:57",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hyggiyi",
      "text": "Damn straight.",
      "timestamp": "2022-02-26 01:05:37",
      "score": 1,
      "num_children": 0,
      "author": 208961,
      "replies": []
    },
    {
      "id": "hygku55",
      "text": "Ya, I do not think anyone ever compared a protestor to someone that died in a war.",
      "timestamp": "2022-02-26 01:39:22",
      "score": 1,
      "num_children": 0,
      "author": 207580,
      "replies": []
    },
    {
      "id": "hygme5z",
      "text": "Definitely. I can't wait to see what my mom says about this",
      "timestamp": "2022-02-26 01:51:38",
      "score": 1,
      "num_children": 0,
      "author": 7014,
      "replies": []
    },
    {
      "id": "hydyf16",
      "text": "How are these even comparable?",
      "timestamp": "2022-02-25 15:04:33",
      "score": -54,
      "num_children": 2,
      "author": 306905,
      "replies": [
        {
          "id": "hyeg7xx",
          "text": "They aren't. That's the point.\n\nOne is a group of entitled obstructionist morons with nary a thought between them, the other is a group of people facing actual violence and oppression standing up for their country and people. \n\nThe former believes they're the latter, the latter doesn't give a fuck and is simply doing what they know to be right.",
          "timestamp": "2022-02-25 17:00:27",
          "score": 43,
          "num_children": 1,
          "author": 376849,
          "replies": [
            {
              "id": "hygli8v",
              "text": "I have just never seen them make that argument.  That they are the same as soldiers getting killed in a war, but maybe they have.",
              "timestamp": "2022-02-26 01:44:39",
              "score": -1,
              "num_children": 0,
              "author": 207580,
              "replies": []
            }
          ]
        },
        {
          "id": "hydzdql",
          "text": "What people perceive as a fight for their freedom.",
          "timestamp": "2022-02-25 15:11:14",
          "score": 50,
          "num_children": 0,
          "author": 382713,
          "replies": []
        }
      ]
    },
    {
      "id": "hyfbqam",
      "text": "[removed]",
      "timestamp": "2022-02-25 20:21:14",
      "score": -6,
      "num_children": 2,
      "replies": [
        {
          "id": "hyfdpmr",
          "text": "You're a clown.\n\nHave the day you deserve, you shit goblin excuse for a human being.",
          "timestamp": "2022-02-25 20:34:11",
          "score": 17,
          "num_children": 1,
          "author": 133909,
          "replies": [
            {
              "id": "hyfhuv9",
              "text": ">Have the day you deserve\n\nA fan of that phrase.",
              "timestamp": "2022-02-25 21:01:11",
              "score": 8,
              "num_children": 0,
              "author": 249425,
              "replies": []
            }
          ]
        },
        {
          "id": "hyfe3p0",
          "text": "Ah, so you believe Putin's propaganda, then?",
          "timestamp": "2022-02-25 20:36:42",
          "score": 7,
          "num_children": 0,
          "author": 404389,
          "replies": []
        }
      ]
    }
  ]
}