{
  "id": "t49d0u",
  "text": "👏\n",
  "timestamp": "2022-03-01 14:39:02",
  "score": 655,
  "subreddit": "t5_2zaj2",
  "num_children": 17,
  "author": 278356,
  "replies": [
    {
      "id": "hyxcszy",
      "text": "If you want to cheat in any capacity then a relationship (especially marriage) isn’t for you…",
      "timestamp": "2022-03-01 16:14:05",
      "score": 90,
      "num_children": 2,
      "author": 66458,
      "replies": [
        {
          "id": "hyy6uwo",
          "text": "Women want their cake both ways.  It's an open secret, thanks to the Internet.",
          "timestamp": "2022-03-01 19:27:34",
          "score": 28,
          "num_children": 1,
          "replies": [
            {
              "id": "hyyyd9h",
              "text": "People, it’s not just women who do this shit.",
              "timestamp": "2022-03-01 22:23:52",
              "score": 4,
              "num_children": 2,
              "author": 273787,
              "replies": [
                {
                  "id": "hyzenkp",
                  "text": "Yeah, you're not wrong.",
                  "timestamp": "2022-03-02 00:17:50",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "hz03qgo",
                  "text": "It's true that feminists teach men bad ideas, but where do you think the bad ideas are coming from?",
                  "timestamp": "2022-03-02 03:21:49",
                  "score": 0,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hyznpvr",
          "text": "Unless it's an open relationship (me and my boyfriend, also trying to get another boy or girl to complete the trio.)",
          "timestamp": "2022-03-02 01:24:58",
          "score": -2,
          "num_children": 0,
          "author": 220159,
          "replies": []
        }
      ]
    },
    {
      "id": "hyy2tp9",
      "text": "Wait, you mean i cant cheat on the person I'm supposed to love? Dang that's crazy",
      "timestamp": "2022-03-01 19:01:36",
      "score": 31,
      "num_children": 1,
      "author": 130014,
      "replies": [
        {
          "id": "hyzese9",
          "text": "It must be mind blowing for her. 🤯",
          "timestamp": "2022-03-02 00:18:48",
          "score": 10,
          "num_children": 1,
          "replies": [
            {
              "id": "hz03nfd",
              "text": "more like cock blowing for the stripper",
              "timestamp": "2022-03-02 03:21:13",
              "score": 3,
              "num_children": 1,
              "author": 366507,
              "replies": [
                {
                  "id": "hz04koo",
                  "text": "Lmao 😂",
                  "timestamp": "2022-03-02 03:28:03",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hyx0epz",
      "text": "I feel The Double Standard is strong with this one.",
      "timestamp": "2022-03-01 14:47:45",
      "score": 86,
      "num_children": 2,
      "author": 67615,
      "replies": [
        {
          "id": "hyxbofu",
          "text": "I don't see double standards . I see dumb people who don't understand relationships.",
          "timestamp": "2022-03-01 16:06:30",
          "score": 46,
          "num_children": 1,
          "author": 17474,
          "replies": [
            {
              "id": "hyxecd8",
              "text": "You are correct.  There are plenty of women and men who think that this is completely normal.  I didn’t even want or have a bachelor party.",
              "timestamp": "2022-03-01 16:24:23",
              "score": 22,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "hyyabub",
          "text": "Not a double standard given that she includes bachelor parties as well.",
          "timestamp": "2022-03-01 19:49:51",
          "score": 7,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hyx0sr9",
      "text": "My ex left me then later wanted to get back together with me. Found out she was lying to me about talking to and seeing other guys. Her justification was 'we weren't commited again yet'\n\nWe had commited to not seeing or talking to other people, I just couldn't commit to therapy and getting back together yet because the rest of my life was falling appart, family members had died etc. \n\n&#x200B;\n\nYou say 'we' weren't commited. You weren't. Thats why we won't be getting back together. But she'll still say 'but we weren't committed' as if she just cannot figure out how that didn't lead to creating trust and a relationship.",
      "timestamp": "2022-03-01 14:50:37",
      "score": 43,
      "num_children": 1,
      "replies": [
        {
          "id": "hz0cv9r",
          "text": "dude fuck that bitch",
          "timestamp": "2022-03-02 04:33:24",
          "score": 4,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hyxsklf",
      "text": "To be honest I could see why she would think that because in alot of media that is what they are portrayed as does not make acceptable at all though",
      "timestamp": "2022-03-01 17:56:07",
      "score": 7,
      "num_children": 0,
      "author": 52809,
      "replies": []
    },
    {
      "id": "hyzefg6",
      "text": "BAHAHAHA \n\nIs this chick for real?!",
      "timestamp": "2022-03-02 00:16:11",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hyzncjy",
      "text": "You’re not supposed to cheat while dating either, stupid",
      "timestamp": "2022-03-02 01:22:10",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hyxy3md",
      "text": "This isn't a male issue only an assholish issue",
      "timestamp": "2022-03-01 18:31:32",
      "score": 7,
      "num_children": 0,
      "author": 399861,
      "replies": []
    },
    {
      "id": "hyx1l6e",
      "text": "Wow Misogynist girl you are back 😶😶😶",
      "timestamp": "2022-03-01 14:56:22",
      "score": 13,
      "num_children": 2,
      "replies": [
        {
          "id": "hyxvx1g",
          "text": "*misandrist*",
          "timestamp": "2022-03-01 18:17:42",
          "score": 10,
          "num_children": 1,
          "replies": [
            {
              "id": "hyxz8jo",
              "text": "Ironically, ofc lol (use /s)",
              "timestamp": "2022-03-01 18:38:45",
              "score": 2,
              "num_children": 1,
              "replies": [
                {
                  "id": "hyxzbfj",
                  "text": "Ah indeed",
                  "timestamp": "2022-03-01 18:39:16",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "hyy055u",
          "text": "I don't see any misogyny here...",
          "timestamp": "2022-03-01 18:44:29",
          "score": 2,
          "num_children": 1,
          "author": 38634,
          "replies": [
            {
              "id": "hyy08kh",
              "text": "Nope lol her name, see that lmao xD",
              "timestamp": "2022-03-01 18:45:05",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hyy0fl2",
                  "text": "Oh lmao",
                  "timestamp": "2022-03-01 18:46:19",
                  "score": 1,
                  "num_children": 0,
                  "author": 38634,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hyynyme",
      "text": "WTF for chocolate to just drip, doesn’t it have to be really hot ?! The guy must’ve burned his chococock fountain omg",
      "timestamp": "2022-03-01 21:16:52",
      "score": 5,
      "num_children": 2,
      "author": 250445,
      "replies": [
        {
          "id": "hyzew3u",
          "text": "This comment made my day 🤣🤣 I was thinking the same thing!",
          "timestamp": "2022-03-02 00:19:31",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hzhy3zp",
          "text": "No, actually, it can be cool and drip. It depends on what it's made of.",
          "timestamp": "2022-03-05 21:24:58",
          "score": 2,
          "num_children": 1,
          "author": 249335,
          "replies": [
            {
              "id": "hzi10t1",
              "text": "Damn didn’t knew that. Im only used with chocolate fondue, and it’s obviously hot. Never seen a chocolate fountain in real life, but figured it was always meant to be super hot.",
              "timestamp": "2022-03-05 21:46:51",
              "score": 2,
              "num_children": 0,
              "author": 250445,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hyy6z4x",
      "text": "Bachelor/ette parties are to tease you with what you are giving up. They are also, arguably, to tempt you so that if you are too weak to be faithfully married, we find out before the wedding.",
      "timestamp": "2022-03-01 19:28:20",
      "score": 3,
      "num_children": 0,
      "author": 34353,
      "replies": []
    },
    {
      "id": "hyz2n3q",
      "text": "Good. Cheating ho got what she deserved",
      "timestamp": "2022-03-01 22:52:15",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hyxusub",
      "text": "More evidence that institutionalized monogamy is irrational and militates against people's maximal sexual fulfillment. It ought to be abolished.",
      "timestamp": "2022-03-01 18:10:28",
      "score": -10,
      "num_children": 1,
      "replies": [
        {
          "id": "hyxwjo7",
          "text": "WTF?\n\nYeah we need to abolish monogamy because cheap whores exist.",
          "timestamp": "2022-03-01 18:21:40",
          "score": 11,
          "num_children": 2,
          "replies": [
            {
              "id": "hyy5yvm",
              "text": "You see dude's username right",
              "timestamp": "2022-03-01 19:21:49",
              "score": 2,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "hyy73pp",
              "text": "> WTF?\n\nThe only \"WTF\" here is that you are literally defending monogamy, as though anyone is sexually attracted to just a single, aging person for life. \n\nLike I said, the institution is irrational.",
              "timestamp": "2022-03-01 19:29:09",
              "score": -6,
              "num_children": 1,
              "replies": [
                {
                  "id": "hyybl2q",
                  "text": "Just because you're a slut doesn't mean we all are.\n\nThe concept of finding a person that fits you best and sticking with them and making something special together is far more appealing than just fuck and forget.",
                  "timestamp": "2022-03-01 19:57:53",
                  "score": 4,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hyz8lx9",
                      "text": "> Just because you're a slut doesn't mean we all are.\n\nName one person that is literally sexually attracted to just a single, aging person for life.\n\nIn actuality, no such person has existed. Ever.\n\n___\n\n> The concept of finding a person that fits you best and sticking with them and making something special together is far more appealing than just fuck and forget.\n\nYou speak as if polyamory precludes the formation of special relationships. This is completely made-up, indefensible claptrap.",
                      "timestamp": "2022-03-01 23:33:35",
                      "score": 0,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hz107rr",
                          "text": "What a load of bs.\n\nFk this woke shit.\n\n\"This is completely made-up, indefensible claptrap\"->projection",
                          "timestamp": "2022-03-02 08:44:27",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hz10io1",
                              "text": "> What a load of bs.\n\nThe fact that you can't defend your position, which is already *prima facie* nonsense, further confirms that it is what is BS here.",
                              "timestamp": "2022-03-02 08:48:21",
                              "score": 0,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "hz113tl",
                                  "text": "Like the claim that people can be attrected to multiple people is defensible.\n\nIt's such a shame that idiots like you have a voice.Back in the day you'd get rightfully laughed at if you suggested any of these woke stupidities.\n\nWhat do you think monogamy came to existence from?Evolution.\n\nIf polyamory was the way, we wouldn't be having this discussion, we would have evolved to be polyamorous, not so monogamous that we go out of our way to make it official.\n\nAnd really, wtf is your problem?No one stops you from being a whore.Just stop trying to force your lifestyle onto everyone else, that's unacceptable.",
                                  "timestamp": "2022-03-02 08:56:09",
                                  "score": 1,
                                  "num_children": 0,
                                  "replies": []
                                },
                                {
                                  "id": "hz246aj",
                                  "text": "Of course everyone has seen more than 1 person whose body they liked, but there are way more factors than just that and it's not like there's any big difference between 1 person's body and another, it's the same structure, just different qualities.We have evolved to find one person we are most compatible with and stay with them(and it has proven to be the best approach, with the best results, obviously because that's the way nature designed us)(not to mention that having multiple partners is scientifically proven to kill your ability to bond)\n\nLastly, it's not even possible to have proper intimate relationships with multiple people(because of obvious human limitations) and these polyamorous special relationships you talk about, if everybody fucks multiple people that special relationship amounts to nothing more than a close friendship.\n\nThe fact I even have to explain this speaks volumes about how stupid and blind people are.This should be common sense, not rocket science.\nAnd again, with abolishing one preference because it's not your preference, why the fk is it your problem what other people choose to do.Imagine wanting to stop the production of all supercars because you prefer tuners.People can prefer whatever they prefer and that's none of your bussines, don't tell people how to live their lives.\nIf you have a high sex drive and questionable morals and want to live life like a whore, limiting love to sex, that's your choice, please, don't try to force me into doing the same.",
                                  "timestamp": "2022-03-02 15:25:38",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hz95c6x",
                                      "text": "Psychology/sociology double-major here. Your position, which amounts to mere right-wing ideology, flies in the face of the available scientific evidence. I will address some of your statements below.\n\n___\n\n> Like the claim that people can be attrected to multiple people is defensible.\n>\n> Of course everyone has seen more than 1 person whose body they liked\n\nHopefully it is evident to you that these statements are contradictory. \n\nRegarding the second one, you are acknowledging that everyone sexually desires multiple people, yet, by supporting institutionalized monogamy, you seek to preclude people's maximal sexual fulfillment. Again, this is irrational. The purpose of institutions is to fulfill people's needs, not to militate against their fulfillment.\n\n___\n\n> What do you think monogamy came to existence from?**Evolution**.\n\nAbsolutely not. All [biological determinist](https://www.britannica.com/topic/biological-determinism) claims—which, again, merely serve a right-wing [function](https://en.wikipedia.org/wiki/Structural_functionalism)—are unsupported by reliable science. This applies as much to psychosexual traits as it does to things like intelligence and personality. As I explain [below](https://www.reddit.com/r/AskReddit/comments/q3s9ia/what_job_or_activity_do_you_normally_associate/hfv3j8w/):\n\n> To be sure, there is no reliable scientific evidence that psychological traits have particular genetic underpinnings that are consistent across individuals. On the contrary, the available evidence shows that these traits (e.g., [self-concept](https://en.m.wikipedia.org/wiki/Self-concept), [emotions](http://www.sonic.net/~cr2/emotion.htm), [color perception](http://www.sonic.net/~cr2/colors.htm), motivation, sexuality) derive their concrete features from sociocultural and political-economic (environmental) factors . . . . Biology merely serves as a general potentiating substratum for psychology and does not determine (or even \"influence\") specific outcomes; differential psychological outcomes in a population are attributable to variations in social experience rather than genetic variation.\n\nKeep in mind that evolutionary psychology, whose rhetoric you are parroting here, is a biological determinist theoretical orientation. As cultural psychologist Carl Ratner observes in [*Macro Cultural Psychology: A Political Philosophy of Mind*](https://www.amazon.com/Macro-Cultural-Psychology-Political-Philosophy/dp/0195373545), it is indefensible:\n\n> It takes **thousands of generations for genetic changes** to accumulate via a sufficient number of organisms’ out-reproducing other organisms **to produce a new morphology**. Yet humans have produced **only 100 generations since the founding of the Roman Empire**; this is not enough time for new morphology to genetically evolve. And human **behavioral change does not involve morphological changes in genes, neurotransmitters, or cortical structures**, which obviates genetic evolution’s pertinence to human behavior at all. **Naturalistic theories** of human psychology **such as evolutionary psychology are false**.\n>\n> (p. 89, bold added)\n\nConcerning monogamy specifically, as I discuss [here](https://www.reddit.com/r/SexPositive/comments/sy44c0/parallels_between_institutionalized_monogamy_and/):\n\n> Sexual customs and attitudes, of course, are no exception to the laws of history, as Engels explicates in [*The Origin of the Family, Private Property and the State*](https://www.marxists.org/archive/marx/works/1884/origin-family/index.htm), which details the historical development of said customs from the earliest human societies and their \"primitive state of promiscuous intercourse,\" in which there was an \"absence of any restriction imposed by custom on sexual intercourse\" and \"unrestricted sexual freedom prevailed [even between siblings, as well as parents and their offspring] . . . every woman belonging equally to every man and every man to every woman\"; through group marriages, \"the form of family in which whole groups of men and whole groups of women mutually possess one another,\" which prohibited sexual interactions between individuals of the same [gens](https://en.wikipedia.org/wiki/Gens_\\(anthropology\\)); and, finally, to monogamy, which coincided with the [accumulation of private wealth](https://en.wikipedia.org/wiki/Primitive_accumulation_of_capital#Primitive_accumulation_and_privatization), replaced the matrilineal gens system with a patrilineal system of inheritance, established the patriarchal nuclear family, and today remains as the dominant, formally instituted and informally sanctioned form of sexual relations.\n> \n> . . .\n>\n> . . . in light of the above, it is fairly clear that sex-negative norms are merely *ad hoc* rationalizations whose [function](https://en.wikipedia.org/wiki/Structural_functionalism) or *raison d'être* is actually to help preserve a society's economic well-being—in other words, their moralistic justifications, which all but never incorporate economic concerns, cannot be taken at face value. This is particularly evident when considering the class nature of the observance of monogamy norms, some examples of which are offered by Engels:\n> \n> ___\n> > . . . **hetaerism [i.e., the practice, coexistent with monogamous marriage, of sexual intercourse between men and unmarried women outside marriage]** is as much a social institution as any other; it continues the old sexual freedom . . . . Actually, not merely tolerated but **gaily practised by the ruling classes** particularly, **it is condemned in words**.\n> >\n> > (Ibid., bold added)\n> ___\n> > . . . though **marriage was held in great reverence** – ‘they content themselves with one wife, the women live hedged round with chastity’ – **polygamy was the rule for the distinguished members and the leaders of the tribe** . . .\n> >\n> > (Ibid., bold added)\n> ___\n> \n> What we see here is a situation in which the masses are conditioned or otherwise forced to obey the sex-negative monogamy custom, while individuals of high status enjoy the sexual privilege that was afforded to all during the abovementioned primitive state of promiscuous intercourse.\n\nNot only has polyamory been the norm for the vast majority of humanity's existence, but even in monogamous societies—which only formed some 10,000 years ago, after wealth began to accumulate in private hands—polyamory was recognized as a privilege enjoyed by only a select few, while the masses were forced to make do with just one sexual partner. Indeed, this is consistent with the fact that many primates formerly thought to be strictly monogamous actually frequently \"cheat\" on their cohabitating partners. Your claim contradicts all psychological, as well as both cultural and physical anthropological, evidence. This can only mean that, again, it is made-up, indefensible claptrap. \n\n___\n\n> it's not like there's any big difference between 1 person's body and another, it's the same structure, just different qualities.\n\nYou're kind of contradicting yourself again. The different qualities between people, however subtle, make all the difference. \n\nConsider that repeated masturbation to the same porn video or image becomes less pleasurable after each instance. This is due to satiation. The same applies to particular foods, beverages, recreational activities, etc. Humans are most fulfilled by and thrive best on variety. \n\n___\n\n> Lastly, it's not even possible to have proper intimate relationships with multiple people(because of obvious human limitations)\n\nI think these \"limitations\" you reference are more made-up stuff. \n\n___\n\n> if everybody fucks multiple people that special relationship amounts to nothing more than a close friendship.\n\nEven if true, so what? This doesn't preclude having multiple special, unique, fulfilling sexual relationships.\n\nPsychology, including desires, is fundamentally cultural. This means that particular desires are, in a sense, more or less arbitrary. You are arguing for a society in which people desire \"special\" relationships with only a single person—which, like all cultural desires, is unnecessary—but are unable to fulfill their sexual desires with others. People would be much more fulfilled in a polyamorous society lacking the desire you promote.\n\n___\n\n> This should be common sense\n\nThat's just it. Your views come from your own common—that is, [ethnocentric](https://en.wikipedia.org/wiki/Ethnocentrism) and unscientific—sense. They are purely impressionistic and not at all backed by objective data.\n\n___\n\n> why the fk is it your problem what other people choose to do.\n\nIn my initial comment, I specified that I am opposed to *institutionalized* monogamy. I have no problem with the rare individuals who independently decide to pursue monogamous relationships.\n\n___\n\n> No one stops you from being a whore.Just stop trying to force your lifestyle onto everyone else\n>\n> If you have a high sex drive and questionable morals and want to live life like a whore, limiting love to sex, that's your choice, please, don't try to force me into doing the same.\n\nI'm a guy lmaoo",
                                      "timestamp": "2022-03-04 00:21:29",
                                      "score": 0,
                                      "num_children": 2,
                                      "replies": [
                                        {
                                          "id": "hzaoec0",
                                          "text": "A load of misinformation.\n\nAnd both genders can be whores and sluts.",
                                          "timestamp": "2022-03-04 09:01:37",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        },
                                        {
                                          "id": "hzbdpgu",
                                          "text": "Being a major in such a field means just as much as a degree in gender studies.\n\nMaybe it was a long time ago, but we've evolved to be better than that, just like we've evolved to be smarter.\n\nThe getting satied thing, some bs.\n\nAnd those subtle differences, the whole point is to find the person whose subtle differences fit you best, not use them as an excuse to whore around.\nJust like a car, you find the car that you enjoy driving most.This also ties in to disprove the sation bs, people find a car they're comfortable with and stick with it until it breaks.\nEven in video games games, where you have everything to choose from, most people drive multiple cars until they find one they really like and then only drive that.Only exception being when they have no choice but to drive something else(a situation that obviously won't occur with people)\n\nLitterally everyone but the spoiled and imature(which is, altough an increasing thanks to living in easy times,a minority in adulthood) looks for relationships with a single partner.The few who don't will have reason to regret it when they're older.\nSaying that monogamous people are rare is a huge delusion.It's those like you who are a minority.\n\nAnd don't you realize that nobody is forcing you to get married?You're just forbidding monogamous people from doing their thing.\n\nYou are not enlighted, just brainwashed with some stuff that looks valid in theory, but is really just not in practice.And your cocky attitude is not helping you at all.",
                                          "timestamp": "2022-03-04 13:49:59",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hyy5ri4",
      "text": "As the world turns (read: gets even dumber)",
      "timestamp": "2022-03-01 19:20:33",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hz3ro8x",
      "text": "I didnt have any bachelorette party when I got married, but, it's traditional for the bridesmaids to all take a sauna together and to give advice on married life in my family (Finnish background) not whatever the hell this debauchery is wtf.",
      "timestamp": "2022-03-02 21:51:01",
      "score": 1,
      "num_children": 0,
      "author": 62695,
      "replies": []
    },
    {
      "id": "i2sbztw",
      "text": "What on earth does this have to do with feminism?",
      "timestamp": "2022-03-31 00:31:15",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hyycoue",
      "text": "What about the huge culture of going to strip clubs in bachelor parties then? The double standard lol",
      "timestamp": "2022-03-01 20:05:03",
      "score": -1,
      "num_children": 1,
      "author": 52118,
      "replies": [
        {
          "id": "hyynwx9",
          "text": "The purpose of these parties is to tease you with what you are giving up and test if you can be wilfully married.\n\nYou give in (like she did here), you fail.",
          "timestamp": "2022-03-01 21:16:34",
          "score": 5,
          "num_children": 1,
          "replies": [
            {
              "id": "hyz408l",
              "text": "Is getting lap dances considered failing too or does the \"failing\" only exist for women?",
              "timestamp": "2022-03-01 23:01:30",
              "score": -3,
              "num_children": 1,
              "author": 52118,
              "replies": [
                {
                  "id": "hyz4tas",
                  "text": "Yes, of course.\n\nAny interaction aside from \"No thanks\" is.\n\nI already said that not resisting the tease is failing.\n\nNothing I said implied that it only applies to one gender.Can you point me to where the language I used wasn't gender neutral?",
                  "timestamp": "2022-03-01 23:06:59",
                  "score": 6,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hyz58us",
                      "text": "I'm not necessarily talking about you, I'm just saying I think it's weird how some people think it's ok for men but not for women, that doesn't mean you necessarily said that, sorry if it came out that way.",
                      "timestamp": "2022-03-01 23:10:00",
                      "score": -1,
                      "num_children": 1,
                      "author": 52118,
                      "replies": [
                        {
                          "id": "hyz5k0h",
                          "text": "You have no idea how many things are viewed as ok when done by women but not by men.Way more.",
                          "timestamp": "2022-03-01 23:12:11",
                          "score": 3,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hyz6fa6",
                              "text": "No there's not lol\n\n\nBut I really don't want to enter this discussion, I know you won't change your mind and I won't change mine either. Goodnight.",
                              "timestamp": "2022-03-01 23:18:11",
                              "score": -1,
                              "num_children": 0,
                              "author": 52118,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}