{
  "id": "t8389l",
  "text": "Thoughts?\n",
  "timestamp": "2022-03-06 17:08:14",
  "score": 581,
  "subreddit": "t5_2zaj2",
  "num_children": 21,
  "author": 362327,
  "replies": [
    {
      "id": "hzlk4tc",
      "text": "We found chads gf",
      "timestamp": "2022-03-06 17:36:54",
      "score": 60,
      "num_children": 0,
      "author": 128237,
      "replies": []
    },
    {
      "id": "hzm3dts",
      "text": "Based meme!!!",
      "timestamp": "2022-03-06 19:48:23",
      "score": 24,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzm1sbj",
      "text": "Based",
      "timestamp": "2022-03-06 19:37:14",
      "score": 18,
      "num_children": 0,
      "author": 298425,
      "replies": []
    },
    {
      "id": "hzm4nqd",
      "text": "I respect it",
      "timestamp": "2022-03-06 19:57:20",
      "score": 11,
      "num_children": 0,
      "author": 228345,
      "replies": []
    },
    {
      "id": "hzlh8eb",
      "text": "I like the direction but is not enough in the sense that ''men and women should work together'' is not the direct opposite of ''i hate all man'', is getting there but what i would really love to read is ''i love men and how much they do for women and im very gratefull lets both women and men work together''.  \nI want to se appreciation for men and masculinity as well to counter balance the tsunami of hate.",
      "timestamp": "2022-03-06 17:17:24",
      "score": 37,
      "num_children": 3,
      "author": 304400,
      "replies": [
        {
          "id": "hzmlzgv",
          "text": "Yeah, I want to see that too! 💛",
          "timestamp": "2022-03-06 22:00:51",
          "score": 12,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "hzmmpkv",
          "text": "masculinity and Men rock. trust me You do. im sorry You don't get enough love, Sir and Men in general.\nhowever, women should absolutely not work. we should stay at home.",
          "timestamp": "2022-03-06 22:06:02",
          "score": 4,
          "num_children": 3,
          "author": 122603,
          "replies": [
            {
              "id": "hznvczl",
              "text": "She's a troll",
              "timestamp": "2022-03-07 03:55:06",
              "score": 6,
              "num_children": 1,
              "author": 47975,
              "replies": [
                {
                  "id": "i58bd6i",
                  "text": "who is, Sir?",
                  "timestamp": "2022-04-18 17:10:41",
                  "score": 1,
                  "num_children": 1,
                  "author": 122603,
                  "replies": [
                    {
                      "id": "i58koao",
                      "text": "You. Your comment stating that women shouldn't work and should stay home is likely just to make this sub look bad. I can assure you that nobody here thinks that",
                      "timestamp": "2022-04-18 18:12:30",
                      "score": 1,
                      "num_children": 1,
                      "author": 47975,
                      "replies": [
                        {
                          "id": "i5960vp",
                          "text": "i am egyptian. that's how a lot of us think, Sir. i am genuinely against women working and no, i dont want to make the sub look bad, Sir. far from it. i am an anti feminist myself too ❤️",
                          "timestamp": "2022-04-18 20:35:59",
                          "score": 1,
                          "num_children": 1,
                          "author": 122603,
                          "replies": [
                            {
                              "id": "i5djcmg",
                              "text": "I'm not exactly sure what to make of this but if your being serious then I geuss what I have to say is that I'm sorry for being rude, but I would also like to say that if you genuinely believe that women shouldn't work then I'm sorry that your country's society is making that seem like the case. Both men and women deserve to work and modern feminists should focus on trying to fix problems like what you just explained to me instead of complaining about stupid things.",
                              "timestamp": "2022-04-19 18:27:01",
                              "score": 1,
                              "num_children": 0,
                              "author": 47975,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hzmssh2",
              "text": "Im fine with women not working but i think thats only fair if i dont have to compete with quota diversity hire women in order to provide for my wife because it makes my part twice as hard.  \nUnless traditional women recognize the current enviroment and are willing to either do twice as much in the household as they used to do OR accept half as much as they used to accept to be provided for them if that makes sense.   \nBasicaly men cannot provide the lifestyle they use to be ble to provide due to women taken away those job position by goverment forced quotas, diversity programs that only benefit and support women, higher standars for men in the same positions and so on.",
              "timestamp": "2022-03-06 22:50:21",
              "score": 9,
              "num_children": 2,
              "author": 304400,
              "replies": [
                {
                  "id": "hzokliw",
                  "text": "Yeah, I agree. It really depends on the situation finaical wise. Embarrassingly I suffer some complications and the mandates in our country are making it harder for one to get a job, I'm the unfortunate ones that can't get a vaccine due to past bad adverse reactions to other vaccines. I even have to be careful with my diet. My partner is very happy for me to stay home and do all the chores around the house. \n\nLuckily, I'm very creative, so we're starting a small business on the side where I can sell art. I'm very good with money and financial decisions, even my partner thinks I'm too good. Most of his debts are paid off from a previous ex partner years ago with my help. He appreciates having me home and doing all the cooking. I think if you're financially stable and you have a good lady that looks after your home, doesn't spend your money, uses you, controls you and doesn't be unfaithful. Than a traditional relationship can work in someone's favor. Again, it really depends on the situation. \n\nCost of living is becoming harder, that's why we must make sacrifices, its difficult enough as it is. I'm a good person and I've always worked when in relationships and I've always provided as much as my SO, but I never got the same respect and appreciation in return unlike with my partner now. I get appreciation for making him lunch and dinner, its honestly rewarding. It's not for all women, as I understand alot of women want to work and feel equal to men or higher up than men. \n\nEveryone should have the right to do what they want to do, even every man has the right to what they want in a woman. It's only one woman out of billions that will accept him. Why should that matter to anyone else? It's a man and woman's right to choose their lifestyle. This comment is not just for one person, but for all to understand. Even my relationship is no one else's business. We're happy.",
                  "timestamp": "2022-03-07 08:32:56",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "i58bnx1",
                  "text": "im not sure i understand everything You said, Sir, but so basically women shouldn't have ever worked! that's what i always say. thank god im egyptian .",
                  "timestamp": "2022-04-18 17:12:42",
                  "score": 1,
                  "num_children": 1,
                  "author": 122603,
                  "replies": [
                    {
                      "id": "i58dxiu",
                      "text": "Interesting, you have traditional conservative society in egypt?",
                      "timestamp": "2022-04-18 17:27:45",
                      "score": 1,
                      "num_children": 1,
                      "author": 304400,
                      "replies": [
                        {
                          "id": "i58g744",
                          "text": "yup!",
                          "timestamp": "2022-04-18 17:42:54",
                          "score": 1,
                          "num_children": 1,
                          "author": 122603,
                          "replies": [
                            {
                              "id": "i58giml",
                              "text": "In your opinion does is it a fair deal for both genders or does it benefit more wither men or women? Or is that irrelevant and what matter is the family as a whole?",
                              "timestamp": "2022-04-18 17:45:03",
                              "score": 1,
                              "num_children": 1,
                              "author": 304400,
                              "replies": [
                                {
                                  "id": "i595kvm",
                                  "text": "first of all, Sir. thank You for acknowledging that there is only 2 genders, thank YOU! secondly, it benefits Men more - the way it should be ❤️",
                                  "timestamp": "2022-04-18 20:33:01",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 122603,
                                  "replies": [
                                    {
                                      "id": "i59bbt2",
                                      "text": "Thank you madame :)",
                                      "timestamp": "2022-04-18 21:11:58",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 304400,
                                      "replies": [
                                        {
                                          "id": "i59pblf",
                                          "text": "im just some cunt, Sir, really.",
                                          "timestamp": "2022-04-18 22:57:18",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 122603,
                                          "replies": [
                                            {
                                              "id": "i59skgd",
                                              "text": "Haha interesting, figured since i would think a real traditional conservative would have responded that it benefits both genders in a complementary manner because is the natural healthy way of being for society of humans (as god intended if religious), because it produces the strongest families and communities, instead of wasting human capital on personal selfish degenerate one-generation-short-sighted culture and freedoms.",
                                              "timestamp": "2022-04-18 23:21:29",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 304400,
                                              "replies": [
                                                {
                                                  "id": "i5cnsdh",
                                                  "text": "You are smarter than me, Sir",
                                                  "timestamp": "2022-04-19 15:07:52",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 122603,
                                                  "replies": [
                                                    {
                                                      "id": "i5cnvqv",
                                                      "text": "Thank you madame :)",
                                                      "timestamp": "2022-04-19 15:08:28",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "author": 304400,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "hznz1qb",
              "text": "Thanks, I appreciate that positivity.\n\nBut I just want to say I think women should have the right to choose where they go.  The fact is that the vast majority of women are going to want to choose traditional roles, and 'stay at home'.",
              "timestamp": "2022-03-07 04:26:44",
              "score": 2,
              "num_children": 0,
              "author": 227146,
              "replies": []
            }
          ]
        },
        {
          "id": "hzmvvjh",
          "text": "If a man posted ''i love women and how much they do for men and im very grateful'' yall would call him a simp in no time lol",
          "timestamp": "2022-03-06 23:13:03",
          "score": -1,
          "num_children": 1,
          "author": 52118,
          "replies": [
            {
              "id": "hzn3h6y",
              "text": "Yes because the current enviroment is hypersaturated with ''women good women good'' everywhere wich is the opposite for men is a wasteland of appreciation.",
              "timestamp": "2022-03-07 00:11:15",
              "score": 5,
              "num_children": 1,
              "author": 304400,
              "replies": [
                {
                  "id": "hzt9mil",
                  "text": "ah that‘s why we have femicides?",
                  "timestamp": "2022-03-08 07:40:24",
                  "score": 0,
                  "num_children": 1,
                  "author": 50919,
                  "replies": [
                    {
                      "id": "i07ziju",
                      "text": "You are exactly proving my point.\r  \nMen are the overwhelming majority of murder victims, yet you decide to only focus and only care about the minority miniscule subcategory of murders wich are exclusveily ''a man killing a woman because she is a woman''.\r  \nStraight up soctiopathy in the worst possible way towards male suffering.\r  \nAnd it doesnt even end there because of the purposely loose and ambiguos legal definition of genocide wich in rpactice means ''a woman killed by a man is automaticaly a femicide unless proven the contrary'' wich means a femicide doesnt even need to be proved to be actually a femicide.\r  \nThe feminidt goal of this is to put a higher price on the murder of women, you are basicly saying to murderers ''hey if you have to chose between killing a man or a woman, kill the man because it will lead to a lower sentence because male lives are literally legally worth less''.\r  \nThis is why we hate you feminist and feminism is losing support every year in droves because you are psychopathic sociopaths that only empathize feel or care exclusevily about female suffering and the female point of view.\r  \nProfessional gaslighting vicitms.  \nThis is YOU saying ''women wome n women women good only women women women the only thing tha tmatter sid women women women''.",
                      "timestamp": "2022-03-11 09:22:45",
                      "score": 1,
                      "num_children": 0,
                      "author": 304400,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hzlreu3",
      "text": "My lip reading isn't 100% but what I'm getting is \"Why aren't you assholes paying my rent? Where's my free shit?! you toxic douchbags better man up and start giving this goddess her cash and prizes! And don't expect any sex for your worship! F'ing Incels!\"...\n\nOh, and I think she's a mod on FDS.",
      "timestamp": "2022-03-06 18:26:09",
      "score": 21,
      "num_children": 1,
      "author": 72416,
      "replies": [
        {
          "id": "hzluufs",
          "text": "She was on a video of a guy who was trolling her because of her cosplay, she didnt say any of that. She was just screaming at the guy for “harassing children” and getting mad",
          "timestamp": "2022-03-06 18:49:20",
          "score": 7,
          "num_children": 1,
          "replies": [
            {
              "id": "hzlvm65",
              "text": "I was assuming something like that... taking a clip and throwin' some nasty shade-over is a thing... it's meant to \"take the piss\" (as my Brit friends say... at FDS types, not necessarily the person in the vid)",
              "timestamp": "2022-03-06 18:54:37",
              "score": 6,
              "num_children": 1,
              "author": 72416,
              "replies": [
                {
                  "id": "hzmhf1r",
                  "text": "[source](https://www.youtube.com/watch?v=u8gQeFYlTqI&ab_channel=swiqeu)",
                  "timestamp": "2022-03-06 21:28:03",
                  "score": 2,
                  "num_children": 0,
                  "author": 21027,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hzmugil",
      "text": "What would a female Chad be",
      "timestamp": "2022-03-06 23:02:42",
      "score": 3,
      "num_children": 2,
      "author": 222836,
      "replies": [
        {
          "id": "hzn0avq",
          "text": "Chaddette",
          "timestamp": "2022-03-06 23:46:49",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hznzgg2",
              "text": "Chade.  Chadette is a female Chadet.",
              "timestamp": "2022-03-07 04:30:27",
              "score": 1,
              "num_children": 0,
              "author": 227146,
              "replies": []
            }
          ]
        },
        {
          "id": "hzo79is",
          "text": "Stacy",
          "timestamp": "2022-03-07 05:47:39",
          "score": 1,
          "num_children": 0,
          "author": 192757,
          "replies": []
        }
      ]
    },
    {
      "id": "hzlzl19",
      "text": "The chaditte is almost agreeing to gender roles so yes, this is based.",
      "timestamp": "2022-03-06 19:22:05",
      "score": 5,
      "num_children": 0,
      "author": 67028,
      "replies": []
    },
    {
      "id": "hzmmqus",
      "text": "Based",
      "timestamp": "2022-03-06 22:06:16",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzornil",
      "text": "No matter the difference if one gender dies, humanity dies",
      "timestamp": "2022-03-07 10:11:59",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzm375b",
      "text": "This is dumb and should go on that anti feminist meme sub. Can’t remember the name.",
      "timestamp": "2022-03-06 19:47:06",
      "score": -1,
      "num_children": 0,
      "author": 325689,
      "replies": []
    },
    {
      "id": "hznbatq",
      "text": "gigastacy",
      "timestamp": "2022-03-07 01:13:12",
      "score": 1,
      "num_children": 1,
      "author": 336845,
      "replies": [
        {
          "id": "hznzi8m",
          "text": "Magnamarge.",
          "timestamp": "2022-03-07 04:30:56",
          "score": 2,
          "num_children": 0,
          "author": 227146,
          "replies": []
        }
      ]
    },
    {
      "id": "hznypr4",
      "text": "Everyone's angry today.  The difference between the two groups of people that there are is that some of us think that solidarity and cooperation are the key to progress, and some of us want to project the all the blame onto one group, be it a race, sex, ethnicity, or age demographic.  \n\nThat's not to say that problems can't exist in one of those groups; I'm quite critical of the baby boomer generation, but I'm talking about the generation, not the baby boomers of that generation.  Collective punishment is a crime against humanity.",
      "timestamp": "2022-03-07 04:23:45",
      "score": 1,
      "num_children": 0,
      "author": 227146,
      "replies": []
    },
    {
      "id": "hzo7av3",
      "text": "Theres no such thing as female chad. Bad take on a “meme“. Also when women say work together, they mean work FOR their benefit.",
      "timestamp": "2022-03-07 05:48:04",
      "score": 1,
      "num_children": 0,
      "author": 36563,
      "replies": []
    },
    {
      "id": "hzon1ld",
      "text": "Mega based",
      "timestamp": "2022-03-07 09:07:00",
      "score": 1,
      "num_children": 0,
      "author": 130219,
      "replies": []
    },
    {
      "id": "hzoynem",
      "text": "How about men work with men, and women work with women?",
      "timestamp": "2022-03-07 11:44:55",
      "score": 1,
      "num_children": 0,
      "author": 390723,
      "replies": []
    },
    {
      "id": "hzp7in7",
      "text": "Man haters are sub human. Just like misogynists",
      "timestamp": "2022-03-07 13:17:51",
      "score": 1,
      "num_children": 0,
      "author": 122842,
      "replies": []
    },
    {
      "id": "hzp84zr",
      "text": "working together with equal opportunities is awesome! for example, construction workers can be male but equipment operators (cranes, forklifts, etc) can be female as it doesn’t require strength but rather knowledge and quick thinking",
      "timestamp": "2022-03-07 13:23:27",
      "score": 1,
      "num_children": 0,
      "author": 81564,
      "replies": []
    },
    {
      "id": "hzpagm0",
      "text": "Jojo vibes",
      "timestamp": "2022-03-07 13:44:10",
      "score": 1,
      "num_children": 0,
      "author": 266017,
      "replies": []
    },
    {
      "id": "hzmelr0",
      "text": "I’m a trans guy, I think I’d have lot of internalized misandry to hate being a man. I mean I’ve know feminist trans women who hated been seen as men, but are very much on a equality side of feminism.\n\nEdit: hey maybe instead of being pussies and downvoting me for being trans, explain why you have a problem with it. \n\nLike seriously people trans people exist get over it.",
      "timestamp": "2022-03-06 21:08:14",
      "score": -5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzmyei4",
      "text": "Yes\n\nI love women\n\nI hate feminism and the war of sexes\n\nI hate identity politics and their constant political uses by elites so the people stay divided",
      "timestamp": "2022-03-06 23:32:15",
      "score": 0,
      "num_children": 0,
      "replies": []
    }
  ]
}