{
  "id": "t9toto",
  "text": "Is this power move or silly?\n",
  "timestamp": "2022-03-08 23:16:56",
  "score": 594,
  "subreddit": "t5_2zaj2",
  "num_children": 65,
  "author": 239519,
  "replies": [
    {
      "id": "hzwqlwi",
      "text": "i just move half the way and i expect you to at least cover that other half. unless im in a hurry than ill dip and dodge in and out of waves of people like a fuckin snake.",
      "timestamp": "2022-03-09 00:21:24",
      "score": 177,
      "num_children": 1,
      "author": 394560,
      "replies": [
        {
          "id": "hzxfvrc",
          "text": "Lol same. I hate it when people walk like they don’t have places to be but block like a 3m wide doorway.",
          "timestamp": "2022-03-09 03:33:22",
          "score": 43,
          "num_children": 0,
          "author": 66795,
          "replies": []
        }
      ]
    },
    {
      "id": "hzwvty6",
      "text": "My guess is they're taking up the majority of the walkway when they do this. I might be inclined to body check them too if I've already moved over but they're still in the way.",
      "timestamp": "2022-03-09 01:00:50",
      "score": 92,
      "num_children": 2,
      "author": 258630,
      "replies": [
        {
          "id": "hzyfqf2",
          "text": "I do something similar with inconsiderate mommies who insist on walking two abreast so they can have a conversation on a narrow street, taking up the entire pavement with their pushchairs and forcing anyone walking in the opposite direction into the road. Why should I have to walk in the road and risk getting hit by a car when you two can pause your conversation and move one in front if the other for a couple of seconds enabling someone else to pass safely? I'll stand to one side and stop but I won't go in the road.\n\nPosts like this woman's irritate me because men aren't the only ones who can be inconsiderate. Entitled arseholes come in all genders.",
          "timestamp": "2022-03-09 10:17:13",
          "score": 26,
          "num_children": 0,
          "author": 132802,
          "replies": []
        },
        {
          "id": "hzyzuhb",
          "text": "I live in a college city, lotta walking.  Women rarely move outta the way in general and tend to walk dead center of the sidewalk, even side by side.  I often have to move to the grass.  \n\nSounds liek this girls sister ran into 28 men done with women's entailment shit and happened to be doing the exact same as the posters sister... funny how that works when it takes two people, but it's always the fault of the men.  This post is just a long winded version of \"men need to do as we want or they are wrong, it's OUR way\"",
          "timestamp": "2022-03-09 13:54:43",
          "score": 11,
          "num_children": 1,
          "replies": [
            {
              "id": "i00rb9o",
              "text": ">I often have to move to the grass.\n\nEasier to just start waving your arms and screaming about the Martian weasels living inside your head. See how quickly they move then!",
              "timestamp": "2022-03-09 20:59:14",
              "score": 5,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "hzwwqfo",
      "text": "why do they always think everything is sexism!? bruh they probably just weren't looking these dumbasses need to get down their high horses",
      "timestamp": "2022-03-09 01:07:38",
      "score": 81,
      "num_children": 1,
      "author": 263808,
      "replies": [
        {
          "id": "hzy2848",
          "text": "They've been telling women to do this during gender studies lectures at my university. I think it's a meme from some feminist book. Plenty of young women running into people in Stockholm, too.\n\nA little bit of polite eye contact, or clear body language, is all it takes to avoid a collision. When people look away on purpose, or try to seem like they are checking their phone, they think it's a power move to ignore people.",
          "timestamp": "2022-03-09 07:12:36",
          "score": 25,
          "num_children": 0,
          "author": 308764,
          "replies": []
        }
      ]
    },
    {
      "id": "hzxdaup",
      "text": "So, her complaint is that she met 28 men who did exactly what she was doing?",
      "timestamp": "2022-03-09 03:12:40",
      "score": 65,
      "num_children": 2,
      "replies": [
        {
          "id": "hzy846g",
          "text": "No she walked directly into 28 men who were walking normally.",
          "timestamp": "2022-03-09 08:29:39",
          "score": 25,
          "num_children": 0,
          "author": 376740,
          "replies": []
        },
        {
          "id": "hzxzk3v",
          "text": "Good point. Most of feminists' social media issues is men doing exactly what they themselves do.",
          "timestamp": "2022-03-09 06:40:27",
          "score": 21,
          "num_children": 1,
          "author": 136516,
          "replies": [
            {
              "id": "hzz00d8",
              "text": "\"It's different\"",
              "timestamp": "2022-03-09 13:56:03",
              "score": 8,
              "num_children": 1,
              "replies": [
                {
                  "id": "i01maym",
                  "text": "The difference between if something is sexist or not is if one has a penis or a vagina.",
                  "timestamp": "2022-03-10 00:29:22",
                  "score": 3,
                  "num_children": 0,
                  "author": 109224,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hzxejj1",
      "text": "ACTUALLY, when I'm out walking down the street in town to get supplies, it's other women that don't MOVE out of the way, sometimes they are in bunches and I've found myself stepping off the pavement, otherwise I'll knock into them. Not the old ladies, they're always making room. But it's the women in their 30s, 20s (I'm in my mid 20s too) and younger that don't move or have any respect. I see more men that move out of the way for me than I do see with women.\n\nI'm not sure if it's just my country and where I live where women around here have no respect besides the elderly and me? But this woman here is dead wrong in her post from what I've experienced. \n\nSlhdochnsksnfdworjdnlsjf",
      "timestamp": "2022-03-09 03:22:35",
      "score": 27,
      "num_children": 1,
      "replies": [
        {
          "id": "hzz1vl9",
          "text": "Slhdochnsksnfdworjdnlsjf",
          "timestamp": "2022-03-09 14:10:54",
          "score": 6,
          "num_children": 0,
          "author": 267820,
          "replies": []
        }
      ]
    },
    {
      "id": "hzwr6yf",
      "text": "Oh man women feel entitled you move outa their way completely even if it means you risk running off the sidewalk/hallway.\n\nI’ve been in plenty of situations  where I move out the way while walking and a chick will still be in the middle of the hallway/shopping aisle moving fast so I would stop and turn sideways to let them pass. And all the chicks usually act the same not looking at me once with head straight with a mean face “Like yeah I’m entitled to this” and in my head I’m like “Damn if this bitch ran into me that hard I hope she knows she woulda got pushed off of me” \n\nEntitlement.",
      "timestamp": "2022-03-09 00:25:45",
      "score": 73,
      "num_children": 1,
      "author": 10798,
      "replies": [
        {
          "id": "hzykivb",
          "text": "“Entitlement” - fact (as least for some hair colours):\n\nhttps://www.dailymail.co.uk/femail/article-1243964/Blondes-aggressive-brunettes-attract-male-attention.html",
          "timestamp": "2022-03-09 11:22:15",
          "score": 2,
          "num_children": 0,
          "author": 166286,
          "replies": []
        }
      ]
    },
    {
      "id": "hzwj02f",
      "text": "Gonna suck when she gets on the highway...",
      "timestamp": "2022-03-08 23:24:52",
      "score": 90,
      "num_children": 1,
      "author": 34353,
      "replies": [
        {
          "id": "hzxepqb",
          "text": "Lmao. This made my day 😂",
          "timestamp": "2022-03-09 03:23:59",
          "score": 10,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hzwpsvp",
      "text": "I'm usually the one that moves, and it get uncomfortable when we both move in the same directions",
      "timestamp": "2022-03-09 00:15:22",
      "score": 15,
      "num_children": 1,
      "author": 329991,
      "replies": [
        {
          "id": "hzx2kh5",
          "text": "I always say, \"Thanks for the dance!\"",
          "timestamp": "2022-03-09 01:51:45",
          "score": 12,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hzx4am4",
      "text": "Is this the toxic masculinity they keep talking about?",
      "timestamp": "2022-03-09 02:04:36",
      "score": 11,
      "num_children": 0,
      "author": 180640,
      "replies": []
    },
    {
      "id": "hzxfiql",
      "text": "This is fake.\n\nIf you never move out of the way and just walk towards people you’ll run into them.\n\nLook at what they said “don’t move out of the way for men”, I’m assuming they’re behaving normally for women. That means the data is biased to begin with, besides the obvious prejudice.\n\n\nI’d argue that men actually move out of the way more often for women than they do for men. They also hold doors open much more for women than men. Idk about you but I was taught by my parents, media, and teachers to be a “gentleman”\n\nSo why the wacky perception that men just walk into women?\n\nThis seems completely off the mark\n\nTo flip the perspective, almost every time women slam the door in my face but men tend to hold it open for people.. where’s the data on that ?",
      "timestamp": "2022-03-09 03:30:26",
      "score": 13,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzx9mfk",
      "text": "When have women ever moved out of the way. You have to be kidding me.",
      "timestamp": "2022-03-09 02:44:22",
      "score": 22,
      "num_children": 0,
      "author": 371070,
      "replies": []
    },
    {
      "id": "hzwwya1",
      "text": "I'll take things that didn't happen for 500, Alex.",
      "timestamp": "2022-03-09 01:09:17",
      "score": 20,
      "num_children": 0,
      "author": 251793,
      "replies": []
    },
    {
      "id": "hzwtnkl",
      "text": "This is such a bullshit piece. There’s just a statement of 28 men. 28 out of how many? 28!out of 28-50 would be a lot, but for all we know, it’s 28 out of 10,000. I’m sure there would be 28 women out of 10,000 that would walk into her. \n\nSample size not given, control group not stated, end result has no comparison. 0/10 for validity.",
      "timestamp": "2022-03-09 00:44:16",
      "score": 43,
      "num_children": 1,
      "author": 78291,
      "replies": [
        {
          "id": "hzxh383",
          "text": "You're assuming this actually happened.",
          "timestamp": "2022-03-09 03:43:12",
          "score": 19,
          "num_children": 1,
          "author": 227146,
          "replies": [
            {
              "id": "hzxkpsy",
              "text": "Not sure if i’m your typical male or an atypical male, but i would move out of the way of anyone cause i don’t wanna touch them. Has nothing to do with pride, gender, whatever. \n\nI just don’t want to touch you and i don’t want you to touch me",
              "timestamp": "2022-03-09 04:13:20",
              "score": 6,
              "num_children": 1,
              "replies": [
                {
                  "id": "hzxmn3u",
                  "text": "Not me, I'm really gropey.",
                  "timestamp": "2022-03-09 04:30:09",
                  "score": 6,
                  "num_children": 1,
                  "author": 227146,
                  "replies": [
                    {
                      "id": "hzxn3ng",
                      "text": "Hi Really Gropey, I’m dad\n\n\n\nCome on dad bot you’re slipping",
                      "timestamp": "2022-03-09 04:34:20",
                      "score": 8,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "hzxwerp",
                          "text": "Dad bot?  I'm a top.",
                          "timestamp": "2022-03-09 06:05:10",
                          "score": 2,
                          "num_children": 0,
                          "author": 227146,
                          "replies": []
                        },
                        {
                          "id": "hzz245r",
                          "text": "Daddy bot 😩",
                          "timestamp": "2022-03-09 14:12:45",
                          "score": 2,
                          "num_children": 0,
                          "author": 267820,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hzwn4di",
      "text": "I've never expected women to move out of the way, tf?",
      "timestamp": "2022-03-08 23:55:14",
      "score": 27,
      "num_children": 2,
      "replies": [
        {
          "id": "hzx65cg",
          "text": "Everything on the internet is true.",
          "timestamp": "2022-03-09 02:18:23",
          "score": 5,
          "num_children": 0,
          "author": 233031,
          "replies": []
        },
        {
          "id": "hzx893l",
          "text": "No they just do it instinctively before you think about it",
          "timestamp": "2022-03-09 02:34:02",
          "score": -1,
          "num_children": 0,
          "author": 334494,
          "replies": []
        }
      ]
    },
    {
      "id": "hzwjbnw",
      "text": "[deleted]",
      "timestamp": "2022-03-08 23:27:13",
      "score": 33,
      "num_children": 1,
      "replies": [
        {
          "id": "hzwzce2",
          "text": "31, the 28 men and the 3 people",
          "timestamp": "2022-03-09 01:27:32",
          "score": 8,
          "num_children": 1,
          "author": 30710,
          "replies": [
            {
              "id": "hzxd2m1",
              "text": "32  you didn't count her sister",
              "timestamp": "2022-03-09 03:10:51",
              "score": 6,
              "num_children": 1,
              "author": 380659,
              "replies": [
                {
                  "id": "hzxd4mz",
                  "text": "Ah, how could I’ve forgotten",
                  "timestamp": "2022-03-09 03:11:17",
                  "score": 5,
                  "num_children": 0,
                  "author": 30710,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hzx4wn9",
      "text": "Just walk on the right side and this wouldn't be a problem, and this goes for everyone",
      "timestamp": "2022-03-09 02:09:08",
      "score": 6,
      "num_children": 0,
      "author": 372613,
      "replies": []
    },
    {
      "id": "hzxmssq",
      "text": "The whole time not realizing that if another man did that, he’s have been 29 confrontations.\nIt’s amazing how little they understand that we are animals.\nThe small animal shouldn’t intentionally collide with large animals on purpose",
      "timestamp": "2022-03-09 04:31:35",
      "score": 7,
      "num_children": 1,
      "author": 104276,
      "replies": [
        {
          "id": "hzxrhmr",
          "text": "Depends on the place and age of people. With teenagers, or in bad neighborhoods, it’s a challenge. When you get older, or in civilized places, you just say sorry and keep moving. \n\nHonestly, this reads more like some pathetic day dream than reality by someone who secretly wants a confrontation, but is actually too afraid to handle even a real social interaction.",
          "timestamp": "2022-03-09 05:15:03",
          "score": 3,
          "num_children": 1,
          "author": 287159,
          "replies": [
            {
              "id": "hzxrlm3",
              "text": "Are you saying if men were out purposely walking into other men, there wouldn’t be issue?",
              "timestamp": "2022-03-09 05:16:08",
              "score": 1,
              "num_children": 1,
              "author": 104276,
              "replies": [
                {
                  "id": "hzxs9rs",
                  "text": "I’m saying context and place matter regardless. \n\nI’ve been walked into on purpose by someone that didn’t like me, and it didn’t lead to a fight. OTOH, this large, shirtless guy randomly and for no reason shoulder checked my brother while we were walking near the stage at a Metallica concert. After contact, he looked back and said ‘what up bitch?’ and immediate got his face caved in by a yet larger guy we didn’t know who was behind me watching.  There was blood everywhere from that shirtless guy’s nose. The guy behind me looked like a fucking Viking. Long hair, tats, and built. \n\nSecurity then threw both of them out. \n\nNothing is absolute. Just because you are looking for a fight, doesn’t mean life is going to give it to you. Sometimes people looking for a fight will get one from a place they didn’t expect. Life is random like that.",
                  "timestamp": "2022-03-09 05:22:40",
                  "score": 2,
                  "num_children": 1,
                  "author": 287159,
                  "replies": [
                    {
                      "id": "hzxvgaa",
                      "text": "The exception doesn’t make the rule. \nSpeaking in generalizations is a useful strategy for describing trends.\nIt’s important to not analyze my statement as an absolute, because it doesn’t makes sense for me to have said this in that way.\nI’m not too invested in this debate as I understand what you are describing.\n\nIf you could try and reframe how you viewed my original statement as describing a trend and let me know if it makes a difference this time around, I’d be very interested if it does.\nPerhaps my issue here is that I’m erring in how I’m describing things, or perhaps I’m simply wrong.\nEither way, that’s the only way I’ll understand if you have the time",
                      "timestamp": "2022-03-09 05:54:54",
                      "score": 1,
                      "num_children": 2,
                      "author": 104276,
                      "replies": [
                        {
                          "id": "hzye6oo",
                          "text": "Someone else replied to you with a similar answer, but I’ll try. \n\nWe are in agreement that men are constantly at increased risk of violence vs women. I think, generally, women are more afraid of violence, while men are much more likely to experience it, save a few very specific types of violence.\n\nWhere we diverged was where probability collapses into reality. Walking into 28 other men won’t lead to 28 confrontations in most environments, but I believe will absolutely lead to more confrontations than women given equal circumstances.\n\nI think it’s much less about who is running into people and really about who is being run into. Some people will snap over nothing.",
                          "timestamp": "2022-03-09 09:55:12",
                          "score": 2,
                          "num_children": 1,
                          "author": 287159,
                          "replies": [
                            {
                              "id": "hzyl4ht",
                              "text": "Thank you for taking the time. I think I’m understanding a little bit better about where I went wrong in my original statement",
                              "timestamp": "2022-03-09 11:29:45",
                              "score": 2,
                              "num_children": 0,
                              "author": 104276,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "hzxy321",
                          "text": "I think just the part where you said if a man did that he'd have 29 confrontations.",
                          "timestamp": "2022-03-09 06:23:39",
                          "score": 1,
                          "num_children": 2,
                          "replies": [
                            {
                              "id": "hzxyg9e",
                              "text": "Yeah, I understand where I went wrong there.",
                              "timestamp": "2022-03-09 06:27:49",
                              "score": 1,
                              "num_children": 0,
                              "author": 104276,
                              "replies": []
                            },
                            {
                              "id": "hzy1sg1",
                              "text": "Thanks for the discord",
                              "timestamp": "2022-03-09 07:07:12",
                              "score": 1,
                              "num_children": 0,
                              "author": 104276,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hzxnau2",
      "text": "Can someone say why we should move? Aren't we equal apparently ?",
      "timestamp": "2022-03-09 04:36:07",
      "score": 6,
      "num_children": 0,
      "author": 141210,
      "replies": []
    },
    {
      "id": "hzwnppa",
      "text": "Her sister should try this out while driving",
      "timestamp": "2022-03-08 23:59:41",
      "score": 13,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzx7uio",
      "text": "Ya know what, lets forget about all of the problems in the world. This is a top priority. Oh my i cant believe we let such evil men on the loose, expecting women to move when walking in the same direction.",
      "timestamp": "2022-03-09 02:31:02",
      "score": 5,
      "num_children": 1,
      "replies": [
        {
          "id": "hzyx6kz",
          "text": "Let Russia have Ukraine: We need to fix our \"man problem\" first. /s",
          "timestamp": "2022-03-09 13:32:39",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "hzyxjt9",
              "text": "Yea, LET Russia take ukrain, THANK YOU!!! ukrain is rightful Russian land.",
              "timestamp": "2022-03-09 13:35:48",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "hzyxo6x",
                  "text": "Slava Ukraini! 🇺🇦",
                  "timestamp": "2022-03-09 13:36:52",
                  "score": 0,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "hzyyxfm",
                      "text": "REPUBLICA DOMINICANA STRONG WITH FRIENDSHIP WITH RUSSIA 🇩🇴🤝🇷🇺 CATHOLIC ORTHODOX ALLIANCE 🇻🇦🤝☦ ONE STRUGGLE TO BRING BACK THE USSR AND BRING CATHOLIC ORTHODOX UNITY!!!!! END INTERNATIONAL CAPITAL, BEGIN NATIONAL COMMUNISM!!!!!",
                      "timestamp": "2022-03-09 13:47:18",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "hzyztxg",
                          "text": "Just so you know, they do produce antipsychotic medicine for people like you.",
                          "timestamp": "2022-03-09 13:54:36",
                          "score": 0,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "hzz0c4e",
                              "text": "So because i want a better future for my nation and unity between Catholicism and orthodox im sychotic? \n\nDont tread on my nation globalist.",
                              "timestamp": "2022-03-09 13:58:37",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "hzz0h75",
                                  "text": "If you think a thicker boot on your neck is a better future, that's your prerogative as a useful idiot.",
                                  "timestamp": "2022-03-09 13:59:47",
                                  "score": 0,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "hzz0swc",
                                      "text": "You're calling me a useful idiot for wanting to end international oligarchal capitalism and instead serving the interests of my people, nation, and god?\n\nYea no, its the other way around, YOU are the useful idito for allowing your life to be controlled by plutocrats.",
                                      "timestamp": "2022-03-09 14:02:25",
                                      "score": 1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "hzz0ye1",
                                          "text": "Ok dude, good luck with your failed crusade and internalized propaganda.",
                                          "timestamp": "2022-03-09 14:03:38",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "hzxgbi6",
      "text": "idk if it's the same but once a woman and i were moving in opposite directions on the same path. i moved halfway out of the way. if she made a similar move, we would've passed by each other. instead, she steeled her shoulder and absolutely drove it into me. it didn't hurt, but i was so taken aback i just looked back at her, we made eye contact as she looked back at me, and i audibly laughed at her at how absurd what she did was.",
      "timestamp": "2022-03-09 03:36:54",
      "score": 3,
      "num_children": 0,
      "author": 109241,
      "replies": []
    },
    {
      "id": "hzxmno7",
      "text": "Lol me and the other guy start break dancing cuz if i move to my right they move to their left and we get stuck there for a short time until i just take a sharp left or right and start moving",
      "timestamp": "2022-03-09 04:30:18",
      "score": 3,
      "num_children": 0,
      "author": 101933,
      "replies": []
    },
    {
      "id": "hzxpnk4",
      "text": "Hah I remember reading this experiment like 10 years ago. Sorry little ladies the world doesn't revolve around you!",
      "timestamp": "2022-03-09 04:57:34",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzxqatj",
      "text": "Geez. All that time I've been moving out of the way. Time to stand my ground and see what happens...",
      "timestamp": "2022-03-09 05:03:37",
      "score": 3,
      "num_children": 0,
      "author": 204699,
      "replies": []
    },
    {
      "id": "hzxr1zl",
      "text": "Some of them will get together to walk next to each other slooowly and slower still if they see a man trying to walk past them.",
      "timestamp": "2022-03-09 05:10:49",
      "score": 3,
      "num_children": 0,
      "author": 32610,
      "replies": []
    },
    {
      "id": "hzy01ld",
      "text": "Ludacris did make a song called \"move bitch get out the way\" 😆 🤣",
      "timestamp": "2022-03-09 06:46:06",
      "score": 3,
      "num_children": 0,
      "author": 222494,
      "replies": []
    },
    {
      "id": "hzydsgk",
      "text": "Imagine minding your own business walking down the road when you see a woman walking towards you. You're on the edge of the pavement so she can get past easily but instead she walks straight in to you when you had no way to avoid her except stepping in to the road. Then she has the audacity to use you as an example of how men expect women to get out of their way.",
      "timestamp": "2022-03-09 09:49:39",
      "score": 3,
      "num_children": 0,
      "author": 23473,
      "replies": []
    },
    {
      "id": "hzz03iq",
      "text": "Look em straight in the eye and scream \"MAKE WAY FOR THE QUEENS GUARD\" \n\nIf they don't move it's not my fault what happens.",
      "timestamp": "2022-03-09 13:56:44",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzzezld",
      "text": "Some random chick did this while I was out shopping. What she didn't know was that my wife was nearby and saw her intentionally bump into me and try to start an argument. I also knew she did it on purpose, trying to get a rise out of me and trying to publicly shame me.\n\nWhat she did not predict was that my wife would get in her face and almost punch her out. I had to restrain her. My wife started screaming at her about being a sad, lonely bitch trying to start problems for men because she didn't have one of her own.\n\nStupid cooch got scared and ran away. For any women that try this shit...be prepared. You can do whatever you want, but the minute you put your hands on someone, in any capacity....it's FIGHT TIME!!! Be prepared for consequences.",
      "timestamp": "2022-03-09 15:44:55",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzzm5hk",
      "text": "Are these the same women who are straight and want the best male in the animal kingdom? I would understand if they are lesbians but wtf I will never understand the hatred straight women have for men... like, imagine if a straight man said he hated women literally no one would want to date him so how come some guys give these women a pass?",
      "timestamp": "2022-03-09 16:32:08",
      "score": 3,
      "num_children": 0,
      "author": 192190,
      "replies": []
    },
    {
      "id": "hzzn0ym",
      "text": "\"watch where you are going you dumb sket\"\n\nonly appropriate response",
      "timestamp": "2022-03-09 16:37:47",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i00qgep",
      "text": "And then she reports them for assault, no doubt.",
      "timestamp": "2022-03-09 20:53:51",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzwyubc",
      "text": "Most sidewalks have barely enough room for two people to stand side by side. Most people walk on the edge of the sidewalk so that people can pass them.\n\nThis person is probably walking down the middle of the sidewalk, where she will always bump people unless they step off the sidewalk to avoid her. The people she bumps into expect her to just walk on the other side of the sidewalk to avoid them (like a normal person).\n\nIt's like driving down the road median and getting mad when oncoming traffic doesn't veer off the side of the road to avoid hitting you.",
      "timestamp": "2022-03-09 01:23:34",
      "score": 7,
      "num_children": 0,
      "author": 15833,
      "replies": []
    },
    {
      "id": "hzxh0dz",
      "text": "\"I move for no man\"\n\n\\-The Black Knight",
      "timestamp": "2022-03-09 03:42:33",
      "score": 2,
      "num_children": 0,
      "author": 227146,
      "replies": []
    },
    {
      "id": "hzxqwn5",
      "text": "I'm a guy and I do this. Most people move. It just makes me a raging asshole lol",
      "timestamp": "2022-03-09 05:09:21",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzxyxgs",
      "text": "Might is Right",
      "timestamp": "2022-03-09 06:33:16",
      "score": 2,
      "num_children": 0,
      "author": 401007,
      "replies": []
    },
    {
      "id": "hzy2up7",
      "text": "If I have room to pass? I'll move over just enough, and no more. \n\nIf you've left me nowhere to go? I'll let your stupid ass walk right into me, and laugh at you for being mad about it. \n\nStupid passive-aggressive bullshit, low iq strat; walking into someone twice your mass is an objectively poor choice.",
      "timestamp": "2022-03-09 07:20:22",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzy36vz",
      "text": "Oh my god Man are so evil",
      "timestamp": "2022-03-09 07:24:37",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzy4qfy",
      "text": "She think this is bad wait till she sees the pack of moms with boogies",
      "timestamp": "2022-03-09 07:44:20",
      "score": 2,
      "num_children": 0,
      "author": 384678,
      "replies": []
    },
    {
      "id": "hzz12zq",
      "text": "It’s called being polite???",
      "timestamp": "2022-03-09 14:04:38",
      "score": 2,
      "num_children": 0,
      "author": 328102,
      "replies": []
    },
    {
      "id": "hzz26h6",
      "text": "Whilst ignoring all the men who did move out the way because those men go against her dumb belief on all men.",
      "timestamp": "2022-03-09 14:13:16",
      "score": 2,
      "num_children": 0,
      "author": 122842,
      "replies": []
    },
    {
      "id": "hzza4uw",
      "text": "Move slightly to the side.  If they don't  do their part, collide and keep moving.  Maybe even fall (like they do in basketball with fouls) and claim injury.",
      "timestamp": "2022-03-09 15:11:34",
      "score": 2,
      "num_children": 0,
      "author": 219816,
      "replies": []
    },
    {
      "id": "hzzgei2",
      "text": "It's silly and a power move. \n\nWhat are they trying to accomplish? \n\nThere's a couple ways to look at this but it seems to me that now they're expecting men to move out of their way. And apparently they're ostensible claim is that men never get out of their way and it's women that are expected to submit and move out of the way. Ok... \n\nAnd what about when men used to get out of the way and or open doors? The feminists seem to have a problem with that. So then we stop acquiescing to women and now they're pissed off about that. \n\nThey might be having fun with these little experiments and getting a win for their confirmation bias. But maybe they should be a little more direct with what they actually want? \n\nDo you want chivalry? Do you want men to acquiesce do you want men to move out of the way do you want men to open your doors? And if so what are you willing to do for men? \n\nIt seems to me men have just stopped fulfilling the expectations of women and they're pissed off about it. But they were pissed off when men were fulfilling the expectations of women. So whatever. every one of these situations is going to be nuanced also. Is it really just to pedestrians walking towards each other or is one carrying something or maybe one's pushing a baby carriage or maybe one has a limp or maybe one has a dog or maybe there's a pothole in the sidewalk or some mud that someone wants to avoid. \n\nBut if the idea is here that men are just bulldozers and we just plow through without concern for others... Okay so the women have decided they're going to do that too. And we have a bunch of accidents.\n\nI'm a truck driver, the smaller four wheelers usually get the hell out of my way. Sometimes you get an idiot that cuts you off but for the most part people want to stay away from me because size matters. If we run into each other you're going to be more hurt than I.",
      "timestamp": "2022-03-09 15:54:12",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzzmdac",
      "text": "There have been countless times I have basically had to dodge women like a fox running through a forest blocked by trees... They all give this dumb look that gives a feeling they wanted me to walk into them. Then there are so many times I've had teenage girls and grown women alike take up an entire sidewalk with a conversation. There are cars coming and parked cars next to them so I'd have to go into the street (these are the moments I cut between their conversations) and they get mad I did so. simply replying \"Well maybe you should show respect to other people and pay attention to your surroundings enough that you don't take up the entire sidewalk with your senseless gossip. I'm not risking death for yours conversation that can be taken somewhere else.\"",
      "timestamp": "2022-03-09 16:33:33",
      "score": 2,
      "num_children": 0,
      "author": 373757,
      "replies": []
    },
    {
      "id": "hzzq0gj",
      "text": "In college there was a group of people who, when I rode my bike on campus, always made it a point *not* to move out of the way. I'd always stay on the right side of the sidewalk. The amount of times I almost crashed into not only them, but different objects (like cars, trees, signs, etc.) Was too much to count.",
      "timestamp": "2022-03-09 16:56:47",
      "score": 2,
      "num_children": 0,
      "author": 164285,
      "replies": []
    },
    {
      "id": "i007w76",
      "text": "I'm going to stop stopping and waiting for women who are taking up the whole isle in the supermarket, I'll just crash right into them and then offer a weak apology. Let's see how fast I have to find a new supermarket I like. IT IS PASTA, pick one and move TF on!",
      "timestamp": "2022-03-09 18:53:34",
      "score": 2,
      "num_children": 0,
      "author": 64078,
      "replies": []
    },
    {
      "id": "i00kkqw",
      "text": "Yes, I've also done this and had many collisions as well as been punched multiple times.\n\nTo be fair, the times I got punched were when the men tried to go around me and I powered up my power move by blocking them.../s",
      "timestamp": "2022-03-09 20:16:05",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i00qv75",
      "text": "Gee, in my neck of the woods, i move a bit and she moves a bit. But maybe we are just more civilized in Australia.",
      "timestamp": "2022-03-09 20:56:28",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i01960s",
      "text": "I mean some dudes do that, i just bump into em. I dont think its sexist I think some dudes just act like asses.",
      "timestamp": "2022-03-09 22:54:30",
      "score": 2,
      "num_children": 0,
      "author": 245630,
      "replies": []
    },
    {
      "id": "hzwvalz",
      "text": "They can get they ass knocked down we don’t gaf🤷🏾‍♂️😂",
      "timestamp": "2022-03-09 00:56:46",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzwz3e2",
      "text": "This is wrong In every direction.",
      "timestamp": "2022-03-09 01:25:31",
      "score": 2,
      "num_children": 0,
      "author": 290868,
      "replies": []
    },
    {
      "id": "hzx20lm",
      "text": "Ive done this but not for this reason.\n\nI read somewhere that if you hold your head up high, so your forehead is a bit tilted upwards and don't make eye contact, most people will be naturally inclined to move our of your way. \n\nI can confirm that it worked and I'm a woman.",
      "timestamp": "2022-03-09 01:47:40",
      "score": 0,
      "num_children": 1,
      "author": 235239,
      "replies": [
        {
          "id": "hzxyahy",
          "text": "Yeah this is a good tip. It's also a good way to avoid people being confused whether to go left or right of you, and not collide with you.\n\nNot make eye contact, as well as make it obvious where you're going by looking towards that direction. They'll see that and move the other way.",
          "timestamp": "2022-03-09 06:26:02",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "hzxo0n9",
      "text": "Na she is just a bitch without the concept of what is call respect, and that say, not everyone collided with her so yeah, she is just a bitch",
      "timestamp": "2022-03-09 04:42:34",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "hzxqpwk",
      "text": "Im convinced this is why some of them get pregnant. You know how many dents i put in baby prams because some idiot had the expectation that i would move within the few split seconds they decide to come from one side of the pedestrian walk to shove one infront of me?",
      "timestamp": "2022-03-09 05:07:34",
      "score": 1,
      "num_children": 0,
      "author": 32610,
      "replies": []
    },
    {
      "id": "hzxtujo",
      "text": "Chad alpha female move.",
      "timestamp": "2022-03-09 05:38:20",
      "score": 1,
      "num_children": 0,
      "author": 395015,
      "replies": []
    },
    {
      "id": "hzy5hmx",
      "text": "Even black men too?",
      "timestamp": "2022-03-09 07:54:08",
      "score": 1,
      "num_children": 0,
      "author": 13540,
      "replies": []
    },
    {
      "id": "hzycqmv",
      "text": "Somebodys gotta move, the ones who would be most bothered by a collision has the biggest incentive to move. Doesn’t mean they should be the one. Just means it makes most sense in utility maximising perspective.",
      "timestamp": "2022-03-09 09:34:48",
      "score": 1,
      "num_children": 0,
      "author": 138770,
      "replies": []
    },
    {
      "id": "hzyih81",
      "text": "My assumption is that the guys don't mind. If men in general are deprived of physical contact, she running into them could be a positive outcome for the guys.\n\nSide note. If you want people to go around you, look over their shoulder as you walk towards them.",
      "timestamp": "2022-03-09 10:55:23",
      "score": 1,
      "num_children": 0,
      "author": 252606,
      "replies": []
    },
    {
      "id": "hzyzujc",
      "text": "Probably gonna get knocked down a lot because men are generally, bigger, stronger and heavier than women.",
      "timestamp": "2022-03-09 13:54:44",
      "score": 1,
      "num_children": 0,
      "author": 402485,
      "replies": []
    },
    {
      "id": "hzz1axc",
      "text": "Legit when I accidentally get in someone’s way I just freeze every time and let them go around me, and they do, every time.\n\nI don’t understand where this is going",
      "timestamp": "2022-03-09 14:06:22",
      "score": 1,
      "num_children": 0,
      "author": 267820,
      "replies": []
    },
    {
      "id": "hzzfgpa",
      "text": "Funny how there's a side of the road you should be working on to avoid ever needing to move out of the way of others. Also, so she never walked into other women or the women move for her",
      "timestamp": "2022-03-09 15:48:06",
      "score": 1,
      "num_children": 0,
      "author": 394266,
      "replies": []
    },
    {
      "id": "i00tql7",
      "text": "I'd like to see this recreated with a train. See if the conductor shifts tracks or not. Awaiting results",
      "timestamp": "2022-03-09 21:14:39",
      "score": 1,
      "num_children": 0,
      "author": 255981,
      "replies": []
    },
    {
      "id": "hzzacjn",
      "text": "this is just dumb 🗿",
      "timestamp": "2022-03-09 15:13:07",
      "score": 0,
      "num_children": 0,
      "author": 267810,
      "replies": []
    },
    {
      "id": "hzzge9y",
      "text": "Yeah. Sure.",
      "timestamp": "2022-03-09 15:54:10",
      "score": 0,
      "num_children": 0,
      "author": 378215,
      "replies": []
    },
    {
      "id": "i002ewc",
      "text": "Eh I say silly. I know some many guys who don’t notice things that are right there but can point something out so far away(pretty sure more men are near sighted than women) as someone with a fucked up depth perception I will run into anything or anyone.",
      "timestamp": "2022-03-09 18:15:03",
      "score": 0,
      "num_children": 0,
      "author": 146295,
      "replies": []
    }
  ]
}