{
  "id": "tdy6yh",
  "text": "Imagine if a Male judge ever does this to a woman contestant....\n",
  "timestamp": "2022-03-14 14:02:00",
  "score": 606,
  "subreddit": "t5_2zaj2",
  "num_children": 21,
  "replies": [
    {
      "id": "i0mnzoe",
      "text": "Oh he’d have his ass cancelled and sued faster than a feminist can tell us their movement is about equality.",
      "timestamp": "2022-03-14 15:50:51",
      "score": 152,
      "num_children": 1,
      "author": 8712,
      "replies": [
        {
          "id": "i0n0spr",
          "text": "Wait what I thought that was the fastest thing that was possible.....",
          "timestamp": "2022-03-14 17:13:56",
          "score": 26,
          "num_children": 0,
          "author": 380659,
          "replies": []
        }
      ]
    },
    {
      "id": "i0n1tn6",
      "text": "Tbh I don't rly mind the jokes she making. My problem is that if a guy did that, ppl would behave differently.",
      "timestamp": "2022-03-14 17:20:30",
      "score": 99,
      "num_children": 4,
      "replies": [
        {
          "id": "i0oi8so",
          "text": "Imagine if that was Lionel Ritchie saying that and non stop hitting on a young girl who loved music and her mum, because of also what she's going through. He'd be off the show and probably replaced by a woman to appease viewers.",
          "timestamp": "2022-03-14 23:15:05",
          "score": 28,
          "num_children": 0,
          "author": 287148,
          "replies": []
        },
        {
          "id": "i0p2tlz",
          "text": "ya it's all the hypocrisy that really annoys me too😒",
          "timestamp": "2022-03-15 01:49:58",
          "score": 16,
          "num_children": 0,
          "author": 249814,
          "replies": []
        },
        {
          "id": "i0ohzbu",
          "text": "If the situation was switched, I don't think there would be an issue if it's just a joke. If the feeling is mutual, I don't see there being anything wrong. \n\nBut clearly there's a power dynamic here since she's famous and he isn't. I think it's a tricky situation either way you slice it. But if Perry were a man instead, people would be up in arms if he said the same exact thing. And that's my main issue, too.",
          "timestamp": "2022-03-14 23:13:09",
          "score": 6,
          "num_children": 1,
          "author": 67101,
          "replies": [
            {
              "id": "i0ok4gt",
              "text": "She could have just stopped at “My eyes lit up, what’s your name dreamboat?” And play it off as her just going off of the last guys comment to save face.\n\nNo, instead she decided to continue being inappropriate and abuse her power as a judge and famous person. Even threatening him by admitting she now had a bias due to him not being single.\n\nIt’s inappropriate now and if the roles were reversed there would be no end to the drama and media coverage over it.",
              "timestamp": "2022-03-14 23:29:07",
              "score": 14,
              "num_children": 1,
              "author": 81710,
              "replies": [
                {
                  "id": "i0pnsfu",
                  "text": "Seemed all in good fun, seemed he wasn’t bothered by it. Would love to see an interview. \n\nI could see this happening with reversed roles and no media uproar. The jokes were harmless…",
                  "timestamp": "2022-03-15 04:42:42",
                  "score": -3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i0pps9o",
                      "text": "I appreicate that you have a different opinion but respectfully disagree. He did smile and laugh so it is possible he was taking it all in good stride and perhaps even appreciate it a bit. However, smiling and laughing can also be a sign of being uncomfortable, incredulity, annoyance, fear and a wide array of emotions that do not necessarily equal feeling okay with a certain situation.\n\nIt's possible that the whole thing was scripted and that the producers spoke to Treavor in advance and let him know that the judges were going to go on about his good looks.\n\n*Producer A: So Treavor, this is TV and we want this too be fun for the viewers at home, so Ms. Perry is going to be a little flirty with you all right? Don't read into it too much and you can flirt as much or as little back as you like. Is that okay? Great we'll see you out there!*\n\nThat's possible as well right?\n\n>The jokes were harmless...\n\nIn most cases I would like to agree, However *jokes* like this are the reason this sub exists in the first place. It's *death by a thousand cuts*. Just this incident, alone and isolated is fine, but it happens time and time again and it becomes a problem.",
                      "timestamp": "2022-03-15 05:02:59",
                      "score": 3,
                      "num_children": 1,
                      "author": 81710,
                      "replies": [
                        {
                          "id": "i0qp8t3",
                          "text": "Yeah man I agree with you ! The guy was literally uncomfortable, see how many times he is looking below and sticking his tongue out\n\nHe is being shy, but he's also very uncomfortable\n\nImagine if it was a woman in his place... Will anyone ever dare to say this ? Lol nope xD",
                          "timestamp": "2022-03-15 12:28:47",
                          "score": 2,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i0qs83s",
                              "text": "That’s my take on it.\n\nI would abhor anyone that treats another that way, regardless of sex. Just don’t do it.",
                              "timestamp": "2022-03-15 12:55:30",
                              "score": 3,
                              "num_children": 0,
                              "author": 81710,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i0p46hq",
          "text": "Didn’t Howard stern make a career of doing this times 100?",
          "timestamp": "2022-03-15 02:00:04",
          "score": -1,
          "num_children": 0,
          "author": 339944,
          "replies": []
        }
      ]
    },
    {
      "id": "i0mh8t1",
      "text": "wait is that miley cyrus or Katy perry?",
      "timestamp": "2022-03-14 15:04:09",
      "score": 38,
      "num_children": 4,
      "author": 366507,
      "replies": [
        {
          "id": "i0mj5mx",
          "text": "Katy Perry",
          "timestamp": "2022-03-14 15:17:37",
          "score": 27,
          "num_children": 3,
          "replies": [
            {
              "id": "i0mjbsl",
              "text": "ah ok yea agree the dude would get cancelled soo fast usain bolt wouldbe shocked",
              "timestamp": "2022-03-14 15:18:48",
              "score": 25,
              "num_children": 1,
              "author": 366507,
              "replies": [
                {
                  "id": "i0mygqc",
                  "text": "Someone would jump at him like they were catching a fly ball and tagging 3rd base at the same time.  They would leap out from behind the camera to stop someone daring to say these things.\n\nI wish the next contestant was a female, and that the two male judges repeated nearly every word Katy Perry said, just to point out the hypocrisy.  “You’re so hot!!”  “You can come back to my house if you want to…”  “You don’t have a boyfriend do you?”",
                  "timestamp": "2022-03-14 16:58:52",
                  "score": 8,
                  "num_children": 0,
                  "author": 80317,
                  "replies": []
                }
              ]
            },
            {
              "id": "i0mxvvh",
              "text": "Fun fact:  Her real name is Kate Hudson, and she’s distantly related to me.  There was already a famous Kate Hudson, actress, so she went by her mother’s last name, Perry.  Plenty of people know this…I understand, but not everyone.  So there it is.",
              "timestamp": "2022-03-14 16:55:12",
              "score": 8,
              "num_children": 0,
              "author": 80317,
              "replies": []
            },
            {
              "id": "i0oq3w3",
              "text": "Katy Perry -- the perfect fantasy woman for a no fap guy. LOL!",
              "timestamp": "2022-03-15 00:14:07",
              "score": 1,
              "num_children": 2,
              "replies": [
                {
                  "id": "i0q39sf",
                  "text": "I just saw this in my YouTube recommendations man wtf why are you attacking me ? Are you still angry just because I do No Fap ? C'mon mate -_- \n\nAnd I am Indian so I don't know shit about who Katy is and what she does, I just know she's a pretty famous Actress/Singer or something...\n\nI don't like her lol",
                  "timestamp": "2022-03-15 07:50:56",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i0q75vq",
                      "text": "Lighten up, it's a joke. If you DON'T want to jerk off then Katy Perry is the ideal woman to fantasize about because she's fugly.",
                      "timestamp": "2022-03-15 08:47:01",
                      "score": 2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i0q7mpr",
                          "text": "Lol yeah she is very ugly 🤢\n\nDid she come into the spotlight via nepotism of some sort ?",
                          "timestamp": "2022-03-15 08:53:40",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i0t663o",
                              "text": "Not that i know of. It's  a mystery. She doesn't have a great voice -- good, but not great --, she isn't gorgeous, she isn't a great songwriter, and she didn't have a rich daddy like Lana Del Rey or Taylor Swift. I can only assume that she fucked the right guys.",
                              "timestamp": "2022-03-15 22:29:34",
                              "score": 2,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i0q3fsa",
                  "text": "Well if she's my fantasy so why the hell will I expose her like this lol 😂😂😂 btw nice joke, in case you were joking :)",
                  "timestamp": "2022-03-15 07:53:14",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i0my67m",
          "text": "Yes.",
          "timestamp": "2022-03-14 16:57:02",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i0ovwwo",
          "text": "Yes",
          "timestamp": "2022-03-15 00:57:40",
          "score": 1,
          "num_children": 0,
          "author": 346074,
          "replies": []
        },
        {
          "id": "i0qh9ob",
          "text": "Katy Cyrus",
          "timestamp": "2022-03-15 11:04:32",
          "score": 1,
          "num_children": 0,
          "author": 287753,
          "replies": []
        }
      ]
    },
    {
      "id": "i0nlkrq",
      "text": "I used to have a lot of respect for perry…this clip killed that",
      "timestamp": "2022-03-14 19:27:30",
      "score": 13,
      "num_children": 2,
      "author": 134068,
      "replies": [
        {
          "id": "i0pzzfs",
          "text": "You seen that clip of her hitting on 18 year old bo burhanham? It’s pretty cringe",
          "timestamp": "2022-03-15 07:05:57",
          "score": 3,
          "num_children": 0,
          "author": 137465,
          "replies": []
        },
        {
          "id": "i13d74i",
          "text": "I remember when she pressured/manipulated a guy into kissing her who was saving his first kiss for someone special.   \n\nThe TV talent shows are full of this completely open female on male perversion. So many times I've seen a male contestant walk on stage for the female judges to ogle and objectify him. Yet apparently it's only the guys who are sick and dirty in our culture.\n\nClip for reference: https://youtu.be/g2lfaTgaQB0",
          "timestamp": "2022-03-18 00:38:15",
          "score": 3,
          "num_children": 0,
          "author": 364622,
          "replies": []
        }
      ]
    },
    {
      "id": "i0o9sl2",
      "text": "What a fuken freaky woman. \nWhat the hell?",
      "timestamp": "2022-03-14 22:13:53",
      "score": 8,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i0ozb5q",
      "text": "Jesus fucking Christ, she is absolutely vulgar. She could at least say it nicer or more elegantly.",
      "timestamp": "2022-03-15 01:23:26",
      "score": 7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i0mwqic",
      "text": "Yeah, guy comes into a job interview…The interviewer is a woman, so she thinks it’s perfectly acceptable to say literally every single thing men have been put in prison for saying to potential female new hires.  Everything from, “Do you have a romantic partner?” to “You can come home with me…”  She’s not even remotely concerned that all of the blatantly biased crap she’s spouting will be taken as sexist.  Why?  -Because women ARE in charge of our society.  Any other “reading” of this situation is total bullshit.  When a woman isn’t even questioned for heaping praise on a man for being “so hot,” and a man would be completely shamed for daring to say that, or even arrested and labeled a misogynist, then it’s obvious we live in a society that is 100% biased in favor of females.\n\nDo I think SOME males somewhere are still getting away with sexism and asking female employees to sleep with them for a promotion?  Yeah, I’m sure it happens everywhere…but it’s not legal, like it would be if a woman did it on national television, for all to see…and no one complains.  No one but US, I mean.\n\nShe should have just ended her “compliments” (which were obviously making him uncomfortable), with, “I’ll definitely vote for you if you sleep with me.”  She might as well have…What farther bias would she have to put out there for all to see?\n\nYou know what perpetuates sexism and gross favoritism being shown for sexual reasons?!  -It’s when women immediately take up the role of the oppressor, as soon as it’s supposedly vacated by their destroying the men who previously held that place.  You know when it’s clear someone has no moral compass?  -It’s when they jump into the role of dictator as soon as they have the chance.",
      "timestamp": "2022-03-14 16:47:50",
      "score": 39,
      "num_children": 1,
      "author": 80317,
      "replies": [
        {
          "id": "i0myxi7",
          "text": "Hotdamn, brother. Send this to the papers! 📰🗞",
          "timestamp": "2022-03-14 17:01:53",
          "score": 9,
          "num_children": 1,
          "replies": [
            {
              "id": "i0rokn4",
              "text": "¡¡Muchos gracias!!  I’ll be happy to write an article for anyone who has a publisher!!!  Hahaha!!!  Seriously!!  I’ve been thinking about this for a lifetime.",
              "timestamp": "2022-03-15 16:44:10",
              "score": 2,
              "num_children": 0,
              "author": 80317,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i0ncbw1",
      "text": "I would have vomited on her. Not necessarily for the sexual harassment, just for being Katy Perry.",
      "timestamp": "2022-03-14 18:27:49",
      "score": 19,
      "num_children": 1,
      "replies": [
        {
          "id": "i0oallh",
          "text": "Based.",
          "timestamp": "2022-03-14 22:19:39",
          "score": 8,
          "num_children": 0,
          "author": 12955,
          "replies": []
        }
      ]
    },
    {
      "id": "i0phu0k",
      "text": "Society sees men as disposables and not worthy of getting a fair chance. Women on the other hand are to be protected and all men are oppressors.",
      "timestamp": "2022-03-15 03:47:53",
      "score": 6,
      "num_children": 0,
      "author": 265145,
      "replies": []
    },
    {
      "id": "i0pqoff",
      "text": "What's disturbing is that she's fetishizing his struggles. Disgusting 🤮",
      "timestamp": "2022-03-15 05:12:32",
      "score": 5,
      "num_children": 1,
      "replies": [
        {
          "id": "i0q2yrz",
          "text": "Nishu Bhai apne India main bhi toh karte hain yeh, best example - Malaika Arora on India's Got Talent\n\nBruh yeh ek na ek \"whore\" type actress jo harass kare bandon ko jabardasti flirt karke yeh harr show main zaroori hota hai kya ? 🤔",
          "timestamp": "2022-03-15 07:46:42",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i0nctsv",
      "text": "Straight to prison",
      "timestamp": "2022-03-14 18:31:00",
      "score": 11,
      "num_children": 0,
      "author": 279420,
      "replies": []
    },
    {
      "id": "i0pezk3",
      "text": "This is fucking outrageous.",
      "timestamp": "2022-03-15 03:23:44",
      "score": 4,
      "num_children": 0,
      "author": 379156,
      "replies": []
    },
    {
      "id": "i0qhe26",
      "text": "That's the woman who asks *iS mAtH rELaTeD tO sCiENcE¿?*",
      "timestamp": "2022-03-15 11:05:59",
      "score": 4,
      "num_children": 0,
      "author": 287753,
      "replies": []
    },
    {
      "id": "i0ohavm",
      "text": "Well she IS sitting behind the desk...........make of that what you will..............",
      "timestamp": "2022-03-14 23:08:03",
      "score": 3,
      "num_children": 0,
      "author": 250768,
      "replies": []
    },
    {
      "id": "i0qcanh",
      "text": "“Only hot guys are typically named trevor”\n“Helloooo Missy” - Trevor Philips.",
      "timestamp": "2022-03-15 10:00:30",
      "score": 2,
      "num_children": 0,
      "author": 165847,
      "replies": []
    },
    {
      "id": "i3tzxf2",
      "text": "Dude wtffff type of molly was she on 🥴😂😂😂",
      "timestamp": "2022-04-08 00:03:17",
      "score": 2,
      "num_children": 0,
      "author": 303253,
      "replies": []
    },
    {
      "id": "i0n0kkh",
      "text": "There's nothing wrong with what she's saying. There'd be nothing wrong if a guy said similar things to a girl either, but you can guarantee that feminists would have a problem with it. But feminists are assholes.",
      "timestamp": "2022-03-14 17:12:28",
      "score": -2,
      "num_children": 5,
      "author": 67771,
      "replies": [
        {
          "id": "i0n33xs",
          "text": "I disagree. Someone is telling you their goals, what they do for work, etc, answering the question you asked, and you interrupt them by saying, \"you're so hot\". That's trashy and belittling, no matter the gender. He was talking about trying to make ends meet for his mom with lupus... And she even found a way to make that \"hawt\". Disgusting trashy behavior.",
          "timestamp": "2022-03-14 17:28:55",
          "score": 14,
          "num_children": 1,
          "author": 33159,
          "replies": [
            {
              "id": "i0nxyxd",
              "text": "I agree with you, that's what I thought too. No matter the gender, Katy Perry's behavior should infuriate everyone, I would be annoyed if an interviewer or judge interrupted me by saying something like that. Absolutely disgusting.",
              "timestamp": "2022-03-14 20:49:25",
              "score": 6,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i0n2cor",
          "text": "bruh wtf such a guy would have got cancelled ! are you forgetting that feminists have manipulated a lot of women into being feminists ? even if someone is not a feminist, they would have still bashed the man online or IRL...",
          "timestamp": "2022-03-14 17:23:57",
          "score": 11,
          "num_children": 1,
          "replies": [
            {
              "id": "i0n44gf",
              "text": "That's what I said. I'm agreeing with you.",
              "timestamp": "2022-03-14 17:35:28",
              "score": 2,
              "num_children": 1,
              "author": 67771,
              "replies": [
                {
                  "id": "i0nxjwu",
                  "text": "Nope I think what she did comes under sexual harassment and be it on either gender, it shouldn't be promoted\n\nShe's desperate, it's dripping from her face, but good thing that the guy was a chad who didn't give a fuck\n\nWhat she did is wrong, you said it is right, there's a difference in perspective I guess, either ways, if it's allowed or not, it should directly proportionally correspond in same ways for other gender too...",
                  "timestamp": "2022-03-14 20:46:43",
                  "score": 6,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i0nxxas",
                      "text": "You're allowed to say someone is hot without it being harassment. She's not desperate, she's Katy Perry.",
                      "timestamp": "2022-03-14 20:49:08",
                      "score": -1,
                      "num_children": 1,
                      "author": 67771,
                      "replies": [
                        {
                          "id": "i0or0pk",
                          "text": "She's kinda ugly and has floppy tits. If she weren't famous she would be just another trashy ho.",
                          "timestamp": "2022-03-15 00:21:00",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i0n2hym",
          "text": "I mean you shouldn’t be asking a man who you think is enganged to basically come home with you to fuck each other on national television.",
          "timestamp": "2022-03-14 17:24:54",
          "score": 4,
          "num_children": 0,
          "author": 343914,
          "replies": []
        },
        {
          "id": "i0obdwx",
          "text": "That's because you've been conditioned to think it's okay for women to abuse and sexually harass men. I'm sure his girlfriend was sitting at home screaming at the TV, \"IMA GONNA KEEL THAT FUCKIN' BITCH!\"",
          "timestamp": "2022-03-14 22:25:13",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "i0obnj4",
              "text": "That is not abuse or harassment.",
              "timestamp": "2022-03-14 22:27:07",
              "score": -3,
              "num_children": 1,
              "author": 67771,
              "replies": [
                {
                  "id": "i0ohsbh",
                  "text": "Like I said, you've been conditioned to think it's okay when women do it.",
                  "timestamp": "2022-03-14 23:11:42",
                  "score": 3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i0ohwpe",
                      "text": "I haven't. It's ok for men to do it too. Only up until the point that it becomes harassment, which this isn't.",
                      "timestamp": "2022-03-14 23:12:37",
                      "score": -1,
                      "num_children": 0,
                      "author": 67771,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i0oq9cj",
          "text": "Rubbish. She has power over him, on that alone it is wrong. She's trash, nothing more.",
          "timestamp": "2022-03-15 00:15:16",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i0pnmrc",
      "text": "Tbh I don’t mind the jokes she’s making. And I don’t think people would react differently if it was a man on a woman. \n\nThis guys 27, a little flirting is part of what makes the show human, … i wouldn’t be surprised if they planned the scenes and he consented. \n\nI think you’re just looking for something to be mad about bud. Have you read about the Duluth model for sexual harassment? There’s a serious reason to be anti-feminist.",
      "timestamp": "2022-03-15 04:41:08",
      "score": 0,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i0nzvue",
      "text": "I don't think this is antifeminism material.  She's coming on strong and it's fun because any celebrity coming on strong to a non-famous person is interesting to watch; nothing to see here.",
      "timestamp": "2022-03-14 21:01:45",
      "score": -2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i8tb20u",
      "text": "Haven't Katy Perry been always like this and she gets away with it everytime..... I think",
      "timestamp": "2022-05-16 12:50:55",
      "score": 1,
      "num_children": 0,
      "author": 238824,
      "replies": []
    },
    {
      "id": "im0icva",
      "text": "Ew. Just ew. How is that tolerated???",
      "timestamp": "2022-08-27 15:39:52",
      "score": 1,
      "num_children": 0,
      "author": 170072,
      "replies": []
    }
  ]
}