{
  "id": "u2q1nw",
  "text": "Germanon visits a f*male d*ctor for depression\n",
  "timestamp": "2022-04-13 13:13:50",
  "score": 11719,
  "subreddit": "t5_2qh4w",
  "num_children": 94,
  "author": 304810,
  "replies": [
    {
      "id": "i4ketjs",
      "text": "Omg anon why don’t you just go to a bar sit on a chair and wait till a cute girl approaches you? It happens to me with men all the time tsehehe",
      "timestamp": "2022-04-13 14:05:54",
      "score": 704,
      "num_children": 3,
      "author": 19802,
      "replies": [
        {
          "id": "i4lssa0",
          "text": "He needs a sign, like an attraction sign, telling women he's looking for an 18-21 year old boyfriend-free girl. Works everytime",
          "timestamp": "2022-04-13 19:28:49",
          "score": 138,
          "num_children": 5,
          "author": 1103,
          "replies": [
            {
              "id": "i4lus48",
              "text": "Based, you've clearly taken the sign-pill, I personally like to walk around with a bluetooth speaker at full volume telling the local females who I am and what I'm looking for. I do sometimes get some strange looks when the anti-semetic tirade part comes on but most times it works a charm",
              "timestamp": "2022-04-13 19:42:01",
              "score": 41,
              "num_children": 0,
              "author": 249745,
              "replies": []
            },
            {
              "id": "i4m53ak",
              "text": "Every time I try that those damn dirty jerkops throw me out of the mall and tell me I'm banned.",
              "timestamp": "2022-04-13 20:51:43",
              "score": 20,
              "num_children": 0,
              "author": 365631,
              "replies": []
            },
            {
              "id": "i4m72sn",
              "text": "And if it doesn't work out just know you can find love in your mother's arms 😍",
              "timestamp": "2022-04-13 21:04:22",
              "score": 15,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i4lu84t",
              "text": "> Overweight 29 year old pornlord seeks thin 20 year old virgin, line starts to the right",
              "timestamp": "2022-04-13 19:38:28",
              "score": 84,
              "num_children": 0,
              "author": 122737,
              "replies": []
            },
            {
              "id": "i4ofb4e",
              "text": "An amulet of Mara",
              "timestamp": "2022-04-14 08:57:13",
              "score": 1,
              "num_children": 0,
              "author": 305161,
              "replies": []
            }
          ]
        },
        {
          "id": "i4midfe",
          "text": "\"Just be yourself!\" is the most copout advice ever given by people who don't give af.",
          "timestamp": "2022-04-13 22:20:07",
          "score": 31,
          "num_children": 1,
          "author": 251717,
          "replies": [
            {
              "id": "i4nkbat",
              "text": "A close cousin of people who need to \"take time to find myself\"",
              "timestamp": "2022-04-14 03:00:56",
              "score": 4,
              "num_children": 0,
              "author": 247233,
              "replies": []
            }
          ]
        },
        {
          "id": "i4mgb0t",
          "text": "this is literally their logic",
          "timestamp": "2022-04-13 22:05:46",
          "score": 18,
          "num_children": 0,
          "author": 288649,
          "replies": []
        }
      ]
    },
    {
      "id": "i4kc4go",
      "text": "\"Just get a girlfriend bro, what do you mean you're too anxious and self critical to approach women, you just need to lower your standards bro\"\n\nWomen may be slightly uninformed and carry a few misconceptions about what it's like to try to meet members of the opposite sex when you're a man.",
      "timestamp": "2022-04-13 13:46:49",
      "score": 871,
      "num_children": 8,
      "replies": [
        {
          "id": "i4lhssl",
          "text": "I went to my general practitioner (doctor) and told her I was concerned about my balding. She told me \"it's not that bad being bald\". I felt just like OP and almost laughed",
          "timestamp": "2022-04-13 18:16:50",
          "score": 57,
          "num_children": 4,
          "author": 373091,
          "replies": [
            {
              "id": "i4lvuq0",
              "text": "*You* going bald isn't a big problem. But ME going bald...\n\nThis is the attitude every single person I've talked to had. Had friends roll their eyes over my sadness about my balding, only to cry to me and ask for advice couple of years later when their time came.",
              "timestamp": "2022-04-13 19:48:55",
              "score": 47,
              "num_children": 0,
              "author": 316253,
              "replies": []
            },
            {
              "id": "i4m5u3t",
              "text": "Pretty much. I'm not balding yet but I know it's inevitable and my plan is to bite the bullet and go full naked skull once it's my time. God invented baldness to make us humble, and he invented hats to give us mercy.",
              "timestamp": "2022-04-13 20:56:28",
              "score": 20,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i4nlpb9",
              "text": "I mean, she's not a psycologist, so I'd say that response makes sense, I probably would've also gone there if a friend told me this, but yeah, clearly it's not the best approach, as most times in life, I don't remember specifics, but most times, what seems to be the most logical response it's not the right one, you're more likely to solve it going in roundabout ways. \n\nfor example when trying to get a loved one away from a cult, if they seem super happy about it and have been attending it for a while, the last thing you should do is call them cultist fuckers for what they are, because that's exactly what they expect you to do, cultist always preach to their followers that \"the \"enemy\" will tell you that I'm bad, and will try to get you away from us and our teachings\" and when you do just that, you're proving them right and unintentionally getting your loved one to side with them, it's fucked up and awful, but that's how we humans work. (you'd think it's only the most guillible, but even the smartest and most clever people fall prey to things like this)",
              "timestamp": "2022-04-14 03:12:29",
              "score": 2,
              "num_children": 1,
              "author": 174912,
              "replies": [
                {
                  "id": "i4nmw98",
                  "text": "cool anecdote, but I just wanted a prescription of finasteride and she told me \"nah just be bald\"",
                  "timestamp": "2022-04-14 03:22:49",
                  "score": 8,
                  "num_children": 1,
                  "author": 373091,
                  "replies": [
                    {
                      "id": "i4nnagb",
                      "text": "lololol, yeah sorry I got caugh up in the writing, I gotchu.",
                      "timestamp": "2022-04-14 03:26:15",
                      "score": 3,
                      "num_children": 0,
                      "author": 174912,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4q6dfo",
              "text": "Take the Sundowner pill, shave it all off and lift heavy things.",
              "timestamp": "2022-04-14 17:39:17",
              "score": 1,
              "num_children": 1,
              "author": 18818,
              "replies": [
                {
                  "id": "i4q8xy6",
                  "text": "I already do the other two lmao",
                  "timestamp": "2022-04-14 17:55:55",
                  "score": 1,
                  "num_children": 0,
                  "author": 373091,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4koc7b",
          "text": "To most women, getting a partner is something that just happens on its own without any effort on their part, they get approached and they accept when they feel like it. That's why they're really confused (or mocking and bullying) about why a man can't get one. It's like someone told you they don't know how to blink. Of course you'd think they're impaired or just plain retarded, you never had to do anything about blinking, you just do. Unfortunately, even when they're psychologists they can't escape this line of thinking.\n\nThere's those posts of ftm transgenders who talk how it hit them like a ton of bricks when they found out how it works from the male side.",
          "timestamp": "2022-04-13 15:09:19",
          "score": 582,
          "num_children": 9,
          "author": 314572,
          "replies": [
            {
              "id": "i4luysc",
              "text": "Literary had a hookup tell me \"I keep ending up in relationships and I don't even know how\". She also told me she never messages first on tinder because she doesn't feel like it.\n\nHow oblivious can you be",
              "timestamp": "2022-04-13 19:43:12",
              "score": 51,
              "num_children": 0,
              "author": 316253,
              "replies": []
            },
            {
              "id": "i4l0avo",
              "text": "All my female friends love to argue how they have it much harder in the dating game and get angry when I point out they don’t really have to do much",
              "timestamp": "2022-04-13 16:26:16",
              "score": 261,
              "num_children": 1,
              "author": 4413,
              "replies": [
                {
                  "id": "i4l2lcj",
                  "text": "[deleted]",
                  "timestamp": "2022-04-13 16:40:40",
                  "score": 228,
                  "num_children": 5,
                  "replies": [
                    {
                      "id": "i4lbijv",
                      "text": "[deleted]",
                      "timestamp": "2022-04-13 17:37:05",
                      "score": 142,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "i4ljngh",
                          "text": "A woman said I had nice forearms like 12-ish years ago, and I'm still riding on that wave.",
                          "timestamp": "2022-04-13 18:28:35",
                          "score": 74,
                          "num_children": 1,
                          "author": 109780,
                          "replies": [
                            {
                              "id": "i4lx585",
                              "text": "I got complimented on my eyebrows like 3 months ago, and on a shirt I was wearing like 2 years ago. I cannot think of other random compliments I've received.",
                              "timestamp": "2022-04-13 19:58:03",
                              "score": 41,
                              "num_children": 3,
                              "author": 30333,
                              "replies": [
                                {
                                  "id": "i4lybce",
                                  "text": "I was getting into work at 6am while most people get in at 8am.  One of the 3 other people in the office complex there that early also got on the elevator with me.  She complimented that I smelled good.  While I shower daily, I was like \"that can't possibly be correct.\"  I then remembered that I just pulled this shirt out of the dryer before hopping in the car so I was like \"oh, just fresh laundry.\"\n\nYep, still think about that 10 years later.  I'm sure I've had others, but that's the only \"unsolicited compliment\" that I can even remember getting that wasn't from an SO.",
                                  "timestamp": "2022-04-13 20:06:45",
                                  "score": 24,
                                  "num_children": 1,
                                  "author": 117031,
                                  "replies": [
                                    {
                                      "id": "i4mhuqc",
                                      "text": "Random Dude Complimented my Afro, Like a few months ago",
                                      "timestamp": "2022-04-13 22:16:31",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 105458,
                                      "replies": [
                                        {
                                          "id": "i4n6cnu",
                                          "text": "I think I'm about equal on male and female unsolicited compliments, maybe like 2-3 each in my entire life.",
                                          "timestamp": "2022-04-14 01:14:59",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "i4m664z",
                                  "text": "Last compliment I remeber was at a party and a girl told me she wished she had a \"prominent nose\" like me. That was almost a year and a half ago and I'm still not sure if it was really a compliment",
                                  "timestamp": "2022-04-13 20:58:39",
                                  "score": 4,
                                  "num_children": 1,
                                  "author": 95049,
                                  "replies": [
                                    {
                                      "id": "i4nyzqz",
                                      "text": "oy vey",
                                      "timestamp": "2022-04-14 05:20:57",
                                      "score": 7,
                                      "num_children": 1,
                                      "author": 163754,
                                      "replies": [
                                        {
                                          "id": "i4o35df",
                                          "text": "Now that you mention it, she was wearing a red arm band",
                                          "timestamp": "2022-04-14 06:10:36",
                                          "score": 4,
                                          "num_children": 0,
                                          "author": 95049,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "i4nklwz",
                                  "text": "A buddy said I looked like I lost weight, a mutual friend agreed. I wear that shirt as often as possible without it being weird now.",
                                  "timestamp": "2022-04-14 03:03:23",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 247233,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i4mnvl1",
                          "text": "Mfs don’t seem to realize guys don’t get shit lmao, just put down and belittled when we don’t shape up. Same as you the few times in my life when I’ve been given an unsolicited compliment I will never forget, vast majority of guys would kill for the kind of attention women get",
                          "timestamp": "2022-04-13 22:59:22",
                          "score": 4,
                          "num_children": 0,
                          "author": 162313,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i4l3oom",
                      "text": "If you like unwanted attention from men you are not attracted to so much just go gay, all your problems solved.",
                      "timestamp": "2022-04-13 16:47:25",
                      "score": 0,
                      "num_children": 3,
                      "author": 87353,
                      "replies": [
                        {
                          "id": "i4l7svm",
                          "text": "The most attention and compliments I ever got was on grindr. Felt like a goddamn rockstar. Just need to find a sugar daddy now.",
                          "timestamp": "2022-04-13 17:13:31",
                          "score": 25,
                          "num_children": 2,
                          "author": 280229,
                          "replies": [
                            {
                              "id": "i4l944c",
                              "text": "Based",
                              "timestamp": "2022-04-13 17:21:55",
                              "score": 10,
                              "num_children": 0,
                              "author": 85517,
                              "replies": []
                            },
                            {
                              "id": "i4lcbt7",
                              "text": "hmm. so, looks like you found solution for us...",
                              "timestamp": "2022-04-13 17:42:15",
                              "score": 2,
                              "num_children": 1,
                              "author": 36527,
                              "replies": [
                                {
                                  "id": "i4lhw9b",
                                  "text": "Not as easy though, the bussy is still elusive, I found this twink on grindr, same age, into anime and vidya, cute, but left me on read",
                                  "timestamp": "2022-04-13 18:17:27",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 374900,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i4l5qxq",
                          "text": "We can get attention from men (as long as you have friends of course). So that’s clearly not the issue.",
                          "timestamp": "2022-04-13 17:00:19",
                          "score": 8,
                          "num_children": 0,
                          "author": 396399,
                          "replies": []
                        },
                        {
                          "id": "i4llsl9",
                          "text": "You don't have to go gay, just go to a gay bar and they'll hit on you. \n\nSeriously it's better than getting too attention at all, but if you need around and let them believe you're interested by not saying anything, they'll think you're leading them on, playing hard to get, and might get extra aggressive in their pursuit, or they might think they can \"turn\" you. Keep in mind people are all different even if they're attracted to the same sex.",
                          "timestamp": "2022-04-13 18:42:06",
                          "score": 6,
                          "num_children": 0,
                          "author": 189288,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i4ljvcv",
                      "text": "I don't think being sexually harassed is better than being ignored lmao",
                      "timestamp": "2022-04-13 18:29:58",
                      "score": -10,
                      "num_children": 4,
                      "author": 119382,
                      "replies": [
                        {
                          "id": "i4lt68v",
                          "text": "Woman moment",
                          "timestamp": "2022-04-13 19:31:26",
                          "score": 16,
                          "num_children": 0,
                          "replies": []
                        },
                        {
                          "id": "i4mkyyb",
                          "text": "lmao. Most men want to be sexually harassed by women.",
                          "timestamp": "2022-04-13 22:38:32",
                          "score": 5,
                          "num_children": 0,
                          "author": 231916,
                          "replies": []
                        },
                        {
                          "id": "i4m47f4",
                          "text": "I definitely think that it is",
                          "timestamp": "2022-04-13 20:45:59",
                          "score": 6,
                          "num_children": 0,
                          "author": 330241,
                          "replies": []
                        },
                        {
                          "id": "i4n2nh7",
                          "text": "You are right to a point. I have lived in an area where as a man I would get cat called multiple times a day. Let me tell you, it was an amazing confidence booster for the first few weeks maybe month. Then it was just insulting and I hated it. I anticipate that most men would like the first phase due to receiving some attention. Then they would learn how much it sucks.",
                          "timestamp": "2022-04-14 00:47:52",
                          "score": 2,
                          "num_children": 0,
                          "author": 325724,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i52c3hj",
                      "text": "I'm gonna send you a dick pic",
                      "timestamp": "2022-04-17 09:48:40",
                      "score": 1,
                      "num_children": 0,
                      "author": 64901,
                      "replies": []
                    },
                    {
                      "id": "i4m51tf",
                      "text": "The problem is you’re trying to get attention. Just be who you want to be and someone will come along lol",
                      "timestamp": "2022-04-13 20:51:27",
                      "score": -3,
                      "num_children": 0,
                      "author": 48893,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4m8s66",
              "text": "That's the reason why some psychology professors make it mandatory homework for their students to create fake tinder accounts of the opposite sex. How are they going to help them, if they can't understand them? \n\nHalf of the girls are deeply shocked and change their perspective. It's a pity only a handful does this, but i really appreciate those professors.",
              "timestamp": "2022-04-13 21:15:20",
              "score": 21,
              "num_children": 1,
              "author": 22559,
              "replies": [
                {
                  "id": "i4nl78v",
                  "text": "That's terrible lmao they're literally flooding tinder with hundreds if not thousands of fake accounts per school, using real people trying to find someone as little lab rats so they can give some perspective on the world to some psychology students? \n\nNot only that, actually matching with people who rarely get matches and talking to them only to leave them wondering why they got ghosted. Kinda fucked up imo.",
                  "timestamp": "2022-04-14 03:08:17",
                  "score": 2,
                  "num_children": 2,
                  "author": 247233,
                  "replies": [
                    {
                      "id": "i4q6ali",
                      "text": "The professor is just helping men slay pussy is all, he's flooding the market with false products and making women waste their time so his bros and him can have sex easier.",
                      "timestamp": "2022-04-14 17:38:47",
                      "score": 4,
                      "num_children": 0,
                      "author": 18818,
                      "replies": []
                    },
                    {
                      "id": "i4qhbr6",
                      "text": "It’s punishment for being cringe enough to use Tinder and admit it to begin with",
                      "timestamp": "2022-04-14 18:51:33",
                      "score": 5,
                      "num_children": 0,
                      "author": 4413,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4luwbt",
              "text": "Try being bi on tinder. I caved once for like 2 or 3 days. \n\nGuys are so lonely. I could swipe right on anyone no matter how good they looked and I got a match. Was a decent confidence booster. \n\nI think I matched with like two or three women in that time, and the three put about as much effort as maybe one of the guys I chatted with.",
              "timestamp": "2022-04-13 19:42:45",
              "score": 19,
              "num_children": 0,
              "author": 252161,
              "replies": []
            },
            {
              "id": "i4lltm6",
              "text": "Implying psychologists aren’t just business majors",
              "timestamp": "2022-04-13 18:42:17",
              "score": 16,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i4lawqy",
              "text": "[deleted]",
              "timestamp": "2022-04-13 17:33:16",
              "score": 50,
              "num_children": 1,
              "replies": [
                {
                  "id": "i4mnz85",
                  "text": "Mhm",
                  "timestamp": "2022-04-13 23:00:04",
                  "score": 3,
                  "num_children": 0,
                  "author": 162313,
                  "replies": []
                }
              ]
            },
            {
              "id": "i4lfecc",
              "text": "In her incel video, contrapoints said she'd rather date as a woman than a man. Something along the lines of \"firing squad of dicks\"",
              "timestamp": "2022-04-13 18:01:27",
              "score": 26,
              "num_children": 2,
              "author": 31556,
              "replies": [
                {
                  "id": "i4mdpi3",
                  "text": "Who wouldn't want to just pick the option you like and be done with it?",
                  "timestamp": "2022-04-13 21:48:13",
                  "score": 16,
                  "num_children": 0,
                  "author": 36409,
                  "replies": []
                },
                {
                  "id": "i4o5vv8",
                  "text": "She?",
                  "timestamp": "2022-04-14 06:45:55",
                  "score": 9,
                  "num_children": 0,
                  "author": 338808,
                  "replies": []
                }
              ]
            },
            {
              "id": "i4n5337",
              "text": "Being the one who approaches is actually the most favorable for choosing their preferred partner than the one who accepts and rejects. This is the process that happens in the Gale–Shapley matching algorithm where men approach their most desired women and if rejected/dumped move on the next best choice. A woman can accept a man if she prefers him to their current partner who they dump. Believe it or not, men always get the women they prefer the most and women always get the men they prefer the least.\n\nPersonally, my female family members did complain that men can truly choose their best options, but women can't.",
              "timestamp": "2022-04-14 01:05:37",
              "score": 4,
              "num_children": 1,
              "author": 218371,
              "replies": [
                {
                  "id": "i4ogjdv",
                  "text": "This is such ideal world thinking. If it ever applies it would only be in a small community where any pairing could be checked reasonably, everyone knows each other, and assumes everyone pairs up 1-1. It's clearly not applicable in modern real life. Even without the internet it seems like it would fall apart in a moderately big city.\n\nWhen the amount of men completely missing out is rapidly increasing, surely that means in reality the approacher is at a steep disadvantage?",
                  "timestamp": "2022-04-14 09:14:41",
                  "score": 7,
                  "num_children": 0,
                  "author": 62629,
                  "replies": []
                }
              ]
            },
            {
              "id": "i4mjsim",
              "text": "Mother of based",
              "timestamp": "2022-04-13 22:30:02",
              "score": 2,
              "num_children": 0,
              "author": 247933,
              "replies": []
            }
          ]
        },
        {
          "id": "i4p571e",
          "text": "Every so often you have a story about a woman making a male account on a dating app and getting completely shitcanned. Part of that is expected, these women are used to being women on a dating app and getting like 10x the interaction rate as dudes, but another part of it is that they have absolutely negative game and have no idea how to pick up women",
          "timestamp": "2022-04-14 13:30:38",
          "score": 3,
          "num_children": 0,
          "author": 296567,
          "replies": []
        },
        {
          "id": "i4kob5z",
          "text": "Just get over it. Thats all the advice someone can give you. Its within you to do it, and no one can help.",
          "timestamp": "2022-04-13 15:09:07",
          "score": 30,
          "num_children": 3,
          "author": 245320,
          "replies": [
            {
              "id": "i4kyt4f",
              "text": "[deleted]",
              "timestamp": "2022-04-13 16:16:52",
              "score": 40,
              "num_children": 1,
              "replies": [
                {
                  "id": "i4l0nqi",
                  "text": "I am pants",
                  "timestamp": "2022-04-13 16:28:30",
                  "score": 26,
                  "num_children": 1,
                  "author": 245320,
                  "replies": [
                    {
                      "id": "i4l8db6",
                      "text": "kek",
                      "timestamp": "2022-04-13 17:17:09",
                      "score": 3,
                      "num_children": 0,
                      "author": 47928,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4lyf6x",
              "text": "Giving up is easier and alcohol cures all ailments. I mean, other than the ones it causes, can't have everything in the world.",
              "timestamp": "2022-04-13 20:07:30",
              "score": 1,
              "num_children": 1,
              "author": 276609,
              "replies": [
                {
                  "id": "i4mrhd6",
                  "text": "Alcohol is a solution",
                  "timestamp": "2022-04-13 23:26:05",
                  "score": 1,
                  "num_children": 1,
                  "author": 245320,
                  "replies": [
                    {
                      "id": "i4qwima",
                      "text": "Suicide solution, they call it.",
                      "timestamp": "2022-04-14 20:31:48",
                      "score": 1,
                      "num_children": 0,
                      "author": 276609,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4ra5g1",
              "text": "Alcohol can help",
              "timestamp": "2022-04-14 22:06:20",
              "score": 1,
              "num_children": 0,
              "author": 306061,
              "replies": []
            }
          ]
        },
        {
          "id": "i4l8o1q",
          "text": "[deleted]",
          "timestamp": "2022-04-13 17:19:05",
          "score": 10,
          "num_children": 2,
          "replies": [
            {
              "id": "i4lmv6j",
              "text": "[deleted]",
              "timestamp": "2022-04-13 18:49:00",
              "score": 27,
              "num_children": 1,
              "replies": [
                {
                  "id": "i4o2gm7",
                  "text": "Yes, live life passively and never put effort into finding your own happiness",
                  "timestamp": "2022-04-14 06:02:02",
                  "score": 2,
                  "num_children": 0,
                  "author": 190049,
                  "replies": []
                }
              ]
            },
            {
              "id": "i4lh2x9",
              "text": "Thank you for that uniquely female perspective xXx666AnusKing666xXx! I'm sure your choice to identify as a Lord of anus' has nothing to do with your lack of success with men and it's definitely because you're \"ugly fold\" (idek what that means)",
              "timestamp": "2022-04-13 18:12:16",
              "score": 22,
              "num_children": 1,
              "author": 261669,
              "replies": [
                {
                  "id": "i4miulc",
                  "text": "ugly foid, femoid. though something tells me this 'femoid' was born with a dick.",
                  "timestamp": "2022-04-13 22:23:25",
                  "score": 6,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4mgmw2",
          "text": "I've had more partners than triple the average in most places, and some of them were long term relationships. I've had my dream job and my dream apartment. I chose to walk away from all that.\n\nLife is inherently empty, whether you're depressed or not, if you were born with an IQ slightly higher than average you will never be satisfied by following society's path.\n\nYou can at best keep busy constantly to keep it away, but it'll be right there waiting for you the moment you're alone with your thoughts.\n\nThat's why you should simply turn inwards instead, and face it willingly.",
          "timestamp": "2022-04-13 22:08:03",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "i4mrqtw",
              "text": "What's the average in most places?",
              "timestamp": "2022-04-13 23:28:00",
              "score": 1,
              "num_children": 1,
              "author": 382746,
              "replies": [
                {
                  "id": "i4opic5",
                  "text": "I think it's like 7 partners for men",
                  "timestamp": "2022-04-14 11:09:42",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4kho2a",
          "text": "Sounds like ugly cope",
          "timestamp": "2022-04-13 14:25:22",
          "score": -16,
          "num_children": 1,
          "author": 234123,
          "replies": [
            {
              "id": "i4kv0zg",
              "text": "you’re on r/4chan bro, there’s no way you can keep a girlfriend either",
              "timestamp": "2022-04-13 15:52:34",
              "score": 11,
              "num_children": 1,
              "replies": [
                {
                  "id": "i4kwjsf",
                  "text": "You’re right, I have no girlfriend",
                  "timestamp": "2022-04-13 16:02:19",
                  "score": 1,
                  "num_children": 0,
                  "author": 234123,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4kgpl5",
          "text": "[removed]",
          "timestamp": "2022-04-13 14:18:55",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "i4kgpml",
              "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```trannie```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
              "timestamp": "2022-04-13 14:18:55",
              "score": 4,
              "num_children": 0,
              "author": 184140,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i4ku663",
      "text": "I didn't know Jordan Peterson was a German woman",
      "timestamp": "2022-04-13 15:47:09",
      "score": 29,
      "num_children": 0,
      "author": 5562,
      "replies": []
    },
    {
      "id": "i4kp1ka",
      "text": "I’ve tried women and cleaning.  Neither solve the problem.  \n\nMy doc says my brain doesn’t release the chemical that lets people feel joy.  \n\nPills help a little.  Still not happy, but at least I’m not tired of being alive anymore.\n\nEdit:  thanks for all the suggestions you all.  It’s very sweet of yous guys.  I’m taking everything y’all say to heart.",
      "timestamp": "2022-04-13 15:13:59",
      "score": 70,
      "num_children": 6,
      "author": 262397,
      "replies": [
        {
          "id": "i4kx5zj",
          "text": "Clinical depression vs a shit life",
          "timestamp": "2022-04-13 16:06:17",
          "score": 46,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i4kxlys",
          "text": "It's the little things.",
          "timestamp": "2022-04-13 16:09:10",
          "score": 9,
          "num_children": 0,
          "author": 230400,
          "replies": []
        },
        {
          "id": "i4lmp2y",
          "text": "Take a heroic dose of mushrooms",
          "timestamp": "2022-04-13 18:47:55",
          "score": 15,
          "num_children": 2,
          "author": 196652,
          "replies": [
            {
              "id": "i4vo9o0",
              "text": "I did that stuff when I was a child.  Not really my thing.  I had nothing but bad trips also.",
              "timestamp": "2022-04-15 21:04:49",
              "score": 2,
              "num_children": 0,
              "author": 262397,
              "replies": []
            },
            {
              "id": "i4lzil7",
              "text": "Wouldn't microdosing be better?",
              "timestamp": "2022-04-13 20:14:57",
              "score": -1,
              "num_children": 2,
              "author": 276609,
              "replies": [
                {
                  "id": "i4odcff",
                  "text": "You need to experience ego death, take some acid",
                  "timestamp": "2022-04-14 08:28:55",
                  "score": 2,
                  "num_children": 2,
                  "author": 339961,
                  "replies": [
                    {
                      "id": "i4qwam7",
                      "text": "I actually have 6 grams of shrooms in my drawer waiting to be consumed, I'm thinking about doing 4 and hooking up a friend with the rest. Anyway, I meant if the dude has some issues beyond his mentality it might be good to use shrooms as medication rather than a turning point.",
                      "timestamp": "2022-04-14 20:30:19",
                      "score": 1,
                      "num_children": 0,
                      "author": 276609,
                      "replies": []
                    },
                    {
                      "id": "i4vog8n",
                      "text": "I’ve taken acid, and this is terrible advice.  \n\nKids, if you’re reading this, drugs are for losers.",
                      "timestamp": "2022-04-15 21:06:10",
                      "score": 1,
                      "num_children": 1,
                      "author": 262397,
                      "replies": [
                        {
                          "id": "i4w0b7w",
                          "text": "Sounds like you had a bad time.",
                          "timestamp": "2022-04-15 22:36:48",
                          "score": 1,
                          "num_children": 1,
                          "author": 339961,
                          "replies": [
                            {
                              "id": "i4yhay2",
                              "text": "Meh, it’s just never been worth it.",
                              "timestamp": "2022-04-16 13:54:50",
                              "score": 1,
                              "num_children": 1,
                              "author": 262397,
                              "replies": [
                                {
                                  "id": "i50wwxx",
                                  "text": "Helps if you do it with close friends, I wouldn’t solo trip unless I was confident and had a nice environment",
                                  "timestamp": "2022-04-17 00:44:13",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 339961,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i4mj0wx",
                  "text": "[removed]",
                  "timestamp": "2022-04-13 22:24:39",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i4mj0yn",
                      "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```bitch```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
                      "timestamp": "2022-04-13 22:24:40",
                      "score": -1,
                      "num_children": 0,
                      "author": 184140,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i4lp2g3",
          "text": "Cleaning your room is about taking your life back. It's about keeping your room clean. Developing a life style that makes sure your room is littered as little as possible.\n\nBeating depression is hard. Usually it's because of the huge gap between what work you put in and what reward or even no reward you're getting. \n\nI would say, do a hobby you like and do it regularly. It would give you back the confidence.\n\nHowever, the biggest factor in your progress is going to be what kind of people you're surrounded by. If it's negative people who constantly belittle you and are passive aggresive shits, ditch them. If you can't you'd need to grow a thick skin",
          "timestamp": "2022-04-13 19:03:13",
          "score": 1,
          "num_children": 0,
          "author": 361097,
          "replies": []
        },
        {
          "id": "i4mv7iw",
          "text": "Microdosing was what helped fix me up. That and a probiotic which lowered my insatiable sugar cravings.",
          "timestamp": "2022-04-13 23:53:35",
          "score": 1,
          "num_children": 0,
          "author": 80547,
          "replies": []
        },
        {
          "id": "i4m04e9",
          "text": "[deleted]",
          "timestamp": "2022-04-13 20:19:00",
          "score": 0,
          "num_children": 1,
          "replies": [
            {
              "id": "i4vnv8l",
              "text": "No sir.  I’ve got too much respect for some of the people around me.   \n\nAnd even if I can’t feel joy without Prozac, I can still feel love.",
              "timestamp": "2022-04-15 21:01:52",
              "score": 1,
              "num_children": 0,
              "author": 262397,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i4kd98n",
      "text": "women will never understand the struggles of a man",
      "timestamp": "2022-04-13 13:54:50",
      "score": 425,
      "num_children": 2,
      "author": 29480,
      "replies": [
        {
          "id": "i4kxgde",
          "text": "His mistake was telling any woman about his troubles, no matter how professional she is. Her vagina will start screaming WHAT AN UNFUCKABLE LOSER HE DOESN'T DESERVE ANYTHING, and that's how you end up without the medical care you need. Tell a boring old male doctor.",
          "timestamp": "2022-04-13 16:08:08",
          "score": 261,
          "num_children": 5,
          "author": 380669,
          "replies": [
            {
              "id": "i4l07ij",
              "text": "based",
              "timestamp": "2022-04-13 16:25:41",
              "score": 59,
              "num_children": 1,
              "author": 29480,
              "replies": [
                {
                  "id": "i4nkn8b",
                  "text": "her vagina isn't saying that. her brain is.\n\nincels LOL",
                  "timestamp": "2022-04-14 03:03:41",
                  "score": -5,
                  "num_children": 1,
                  "author": 181059,
                  "replies": [
                    {
                      "id": "i5v3orx",
                      "text": "Women have brains? News to me. Probably vestigial .",
                      "timestamp": "2022-04-23 10:48:03",
                      "score": 3,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4l8b47",
              "text": "Holy shit this is actual factual - PLEASE get male doctors whenever possible.",
              "timestamp": "2022-04-13 17:16:46",
              "score": 93,
              "num_children": 0,
              "author": 14103,
              "replies": []
            },
            {
              "id": "i4lzn5n",
              "text": "The actual truth",
              "timestamp": "2022-04-13 20:15:48",
              "score": 25,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i4ny22j",
              "text": "based and truthpilled",
              "timestamp": "2022-04-14 05:10:26",
              "score": 8,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i6drp43",
              "text": "Truth be told, my female therapist gave me great advice a few years ago. Then I ignored her advice, noticed that the village I lived in was a shithole, and moved to Hamburg with a 80% raise.",
              "timestamp": "2022-04-27 10:05:26",
              "score": 1,
              "num_children": 0,
              "author": 151514,
              "replies": []
            }
          ]
        },
        {
          "id": "i4kmdqk",
          "text": "And men will never understand the struggles of a woman, all both can do is try",
          "timestamp": "2022-04-13 14:56:23",
          "score": -37,
          "num_children": 7,
          "author": 180377,
          "replies": [
            {
              "id": "i4kq525",
              "text": "Both are bad at understanding eachother, but women are *way* worse at expressing basic empathy towards men than men are towards women.",
              "timestamp": "2022-04-13 15:21:06",
              "score": 108,
              "num_children": 1,
              "replies": [
                {
                  "id": "i4kwsuj",
                  "text": "Men are taught to show kindness to women",
                  "timestamp": "2022-04-13 16:03:56",
                  "score": 50,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i4kz7e8",
                      "text": "Women are taught to show kindness to men for thousands years",
                      "timestamp": "2022-04-13 16:19:23",
                      "score": -41,
                      "num_children": 3,
                      "author": 170594,
                      "replies": [
                        {
                          "id": "i4l3rdz",
                          "text": "No one is taught to show kindness to men. Not men, and certainly not women.",
                          "timestamp": "2022-04-13 16:47:53",
                          "score": 41,
                          "num_children": 2,
                          "replies": [
                            {
                              "id": "i4ldai8",
                              "text": "im pretty sure everyone who goes to preschool is taught to show kindness to everyone else.",
                              "timestamp": "2022-04-13 17:48:19",
                              "score": -5,
                              "num_children": 0,
                              "author": 390603,
                              "replies": []
                            },
                            {
                              "id": "i4l63wf",
                              "text": "You can't be that ignorant...That was the men, the authority, education, the church to teach women to show kindness to men. Once upon a time people only teach women to be a good housewife and should only stay at home and obey the husband, most of the jobs were not allow for women to take. You could lobotomize your wife legally if she got \"Female hysteria\" and turn her into a tamed animal. But here is /r/4chan, it's always about Masculism.",
                              "timestamp": "2022-04-13 17:02:36",
                              "score": -18,
                              "num_children": 3,
                              "author": 170594,
                              "replies": [
                                {
                                  "id": "i4l7rzg",
                                  "text": "Right, and men have always been expected to lay down their lives in war and to be the last to be rescued in disasters. Men have always been given the death penalty much more often than women, even when being tried for the same crime. Men have always made up the majority of beggars, murder victims, workplace casualties, and suicide victims. \n\nMen might have been given more freedom than women, but that came at the cost of your life being practically worthless unless you were able to provide for other people (usually women and children) or you were part of the top 1%.",
                                  "timestamp": "2022-04-13 17:13:21",
                                  "score": 18,
                                  "num_children": 3,
                                  "replies": [
                                    {
                                      "id": "i4lywy2",
                                      "text": "Exactly, women were so horribly forced to enjoy the fruits of male labor, how bad it must have been.",
                                      "timestamp": "2022-04-13 20:10:53",
                                      "score": 11,
                                      "num_children": 0,
                                      "author": 276609,
                                      "replies": []
                                    },
                                    {
                                      "id": "i4lbg41",
                                      "text": "Because throughout history, women were men's subject. Men only wanted to tame women like they were pet dog for years and men were the only real human. Your pet don't need to suffer workplace depression and injures and if they bite somebody you take the responsibility. You are like saying a pet lived a better life than their human master and received more kindness than their master. I do agree with you, sometime i am jealous of my dog for doing nothing at home waiting for food.",
                                      "timestamp": "2022-04-13 17:36:40",
                                      "score": -5,
                                      "num_children": 0,
                                      "author": 170594,
                                      "replies": []
                                    },
                                    {
                                      "id": "i4l9um3",
                                      "text": "You are saying men weren't taught to show kindness to other men so men suffered worse or equally bad to women. Most disastrous events were caused by men like 99.9% in human history.",
                                      "timestamp": "2022-04-13 17:26:35",
                                      "score": -7,
                                      "num_children": 1,
                                      "author": 170594,
                                      "replies": [
                                        {
                                          "id": "i4lakj5",
                                          "text": "So you're saying men deserve being treated like shit because they're the cause of all the evils of the world? Well, I guess that means you're admitting men have it bad, at least. That's progress.",
                                          "timestamp": "2022-04-13 17:31:08",
                                          "score": 12,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "i4lbo5h",
                                              "text": "Did I say anything about men's treatment in my comments? You said that, you described that to me.\n\n\nI am still saying women has been taught to show kindness to men for thousands years.",
                                              "timestamp": "2022-04-13 17:38:05",
                                              "score": 0,
                                              "num_children": 0,
                                              "author": 170594,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "i4l94qh",
                                  "text": "you’re r word",
                                  "timestamp": "2022-04-13 17:22:02",
                                  "score": 5,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "i4la403",
                                      "text": "\"you’re r word\"\n\n\n[Lad, it's 4chan what should I expect.](https://thumbs.gfycat.com/SophisticatedPleasedArchaeocete-size_restricted.gif)",
                                      "timestamp": "2022-04-13 17:28:15",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 170594,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "i4l7rso",
                                  "text": "Don't cherry pick. Men were also legally responsible for every single thing their wife did if we're going back that far, including basic things like surviving. Your wife dies of sickness? Your fault. She sleeps with the married mayor? Your fault, and you're both likely killed. She decides to steal a little extra bread from the baker? Still your fault. \n\nYea, if I kept getting brought in to the Sheriff because my wife couldn't keep her shit together, I'd consider drastic options too. Id have a family to feed and provide for, after all, and that requires being at work rather than dealing with a grown ass woman acting out.",
                                  "timestamp": "2022-04-13 17:13:19",
                                  "score": 13,
                                  "num_children": 0,
                                  "author": 110685,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i4lkjif",
                          "text": "Cool but the thousands of years isn’t today lol. Some women are oppressed by their husbands, but many others are not, yet often men are still expected to do more for them",
                          "timestamp": "2022-04-13 18:34:10",
                          "score": 6,
                          "num_children": 0,
                          "replies": []
                        },
                        {
                          "id": "i4l2t51",
                          "text": "To Bad woman cant lern shit. Even 1000 years later",
                          "timestamp": "2022-04-13 16:42:00",
                          "score": 15,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4knt6n",
              "text": "Haha liberal arts",
              "timestamp": "2022-04-13 15:05:46",
              "score": 55,
              "num_children": 1,
              "author": 383594,
              "replies": [
                {
                  "id": "i4kpc1o",
                  "text": "And other mickymouse degrees",
                  "timestamp": "2022-04-13 15:15:52",
                  "score": 28,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "i4l4zek",
              "text": "What struggles?",
              "timestamp": "2022-04-13 16:55:32",
              "score": 11,
              "num_children": 2,
              "replies": [
                {
                  "id": "i4l7unf",
                  "text": "The struggle against the unwanted snuggle, thats about it",
                  "timestamp": "2022-04-13 17:13:50",
                  "score": 10,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i4lls1x",
                      "text": "They can't rape you if you consent first! It's *that easy* kids.",
                      "timestamp": "2022-04-13 18:42:00",
                      "score": 6,
                      "num_children": 0,
                      "author": 53825,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i4lenmu",
                  "text": "Much like everyone else:\n\nExperiencing inconvenience\n\nAddressing and facing personal deficiency\n\nThe difference here is you tell a man to suck it up and stop being a McBitch.",
                  "timestamp": "2022-04-13 17:56:50",
                  "score": 5,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "i4lcrf9",
              "text": ">struggles\n\nGee, which cock should I hop on this weekend",
              "timestamp": "2022-04-13 17:45:00",
              "score": 11,
              "num_children": 0,
              "author": 311166,
              "replies": []
            },
            {
              "id": "i4kxufx",
              "text": "yeah all those zero struggles of a woman",
              "timestamp": "2022-04-13 16:10:42",
              "score": 17,
              "num_children": 0,
              "author": 93755,
              "replies": []
            },
            {
              "id": "i4lfckp",
              "text": "Yeah the real problem is society expects men to understand and adapt to women's struggles, while society also doesn't expect women to care at all about men's problems.",
              "timestamp": "2022-04-13 18:01:08",
              "score": 8,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i4lmly5",
              "text": "Lmao. Men have literally created so many things to aid women. All the time. House applicances that cut work time, medical inventions and procedures, even for early feminism it was men who got women voting rights even when suffrages were against it.\n\nI think the only thing men struggle with understanding is woman-woman relationship.",
              "timestamp": "2022-04-13 18:47:22",
              "score": 3,
              "num_children": 2,
              "author": 361097,
              "replies": [
                {
                  "id": "i4m707i",
                  "text": "Has it never occurred to you why all of those inventions were created by men and not women? Do you not think it has anything to do with traditional gender roles and women being in the house taking care of the kids and the house instead of getting an education, being engineers, chemists, biologists... and creating those things?\n\n> House applicances that cut work time\n\nHousework time, the things the females are supposed to do 🙄",
                  "timestamp": "2022-04-13 21:03:55",
                  "score": -2,
                  "num_children": 1,
                  "author": 299289,
                  "replies": [
                    {
                      "id": "i4nwtq0",
                      "text": "> Housework time, the things the females are supposed to do 🙄\n\n\nThings that women used to do predominantly in the history. \n\nWhy are feminists r_slurred smooth brains ?",
                      "timestamp": "2022-04-14 04:57:07",
                      "score": 4,
                      "num_children": 0,
                      "author": 361097,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i4lz662",
                  "text": "[removed]",
                  "timestamp": "2022-04-13 20:12:38",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i4lz678",
                      "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```cunts```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
                      "timestamp": "2022-04-13 20:12:38",
                      "score": 1,
                      "num_children": 0,
                      "author": 184140,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i4kmvy9",
      "text": "Funny, I thought a gf would fix my depression and anxiety. All it did was make it fucking worse. Admittedly though, she was the worst possible girl I could have picked.",
      "timestamp": "2022-04-13 14:59:44",
      "score": 102,
      "num_children": 3,
      "author": 226284,
      "replies": [
        {
          "id": "i4l0teu",
          "text": "Get a dog. Men can only ever experience unconditional love from either their mothers or dogs.\n\nExample: lock both your girlfriend and your dog in the trunk of your car for an hour, then open it up. Which one is happy to see you?",
          "timestamp": "2022-04-13 16:29:31",
          "score": 109,
          "num_children": 4,
          "author": 279491,
          "replies": [
            {
              "id": "i4m4np6",
              "text": "Idk man, I have a dog, and he's great and all, but he doesn't really talk to me",
              "timestamp": "2022-04-13 20:48:58",
              "score": 27,
              "num_children": 2,
              "author": 330241,
              "replies": [
                {
                  "id": "i4m8zq9",
                  "text": "Your doesn't? He must be a mutte",
                  "timestamp": "2022-04-13 21:16:42",
                  "score": 28,
                  "num_children": 0,
                  "author": 22559,
                  "replies": []
                },
                {
                  "id": "i4m9m11",
                  "text": "Which one shakes their butt when you come home?",
                  "timestamp": "2022-04-13 21:20:47",
                  "score": 3,
                  "num_children": 1,
                  "author": 279491,
                  "replies": [
                    {
                      "id": "i4mplrn",
                      "text": "I'll have to get back to you on that once i try leaving home",
                      "timestamp": "2022-04-13 23:12:25",
                      "score": 5,
                      "num_children": 0,
                      "author": 330241,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4nhu6u",
              "text": "I love my dog, my mom, not so much.",
              "timestamp": "2022-04-14 02:41:05",
              "score": 6,
              "num_children": 0,
              "author": 89902,
              "replies": []
            },
            {
              "id": "i4mu0r5",
              "text": "inb4 mother is the reason life is fucked",
              "timestamp": "2022-04-13 23:44:42",
              "score": 6,
              "num_children": 0,
              "author": 26565,
              "replies": []
            },
            {
              "id": "i4lnk9s",
              "text": "Holy shit this is dumbass logic. I hope you’re not serious about that example, though it would explain a lot.",
              "timestamp": "2022-04-13 18:53:26",
              "score": -6,
              "num_children": 2,
              "author": 293106,
              "replies": [
                {
                  "id": "i4lpr8r",
                  "text": "I think his logic is quite sound. The dog loves you unconditionally, and then with your girlfriend there's conditions?",
                  "timestamp": "2022-04-13 19:07:47",
                  "score": 16,
                  "num_children": 1,
                  "author": 257151,
                  "replies": [
                    {
                      "id": "i4lr0xe",
                      "text": "I meant the trunk example. No shit another human is gonna be pissed if you lock them in a trunk.",
                      "timestamp": "2022-04-13 19:16:01",
                      "score": -6,
                      "num_children": 1,
                      "author": 293106,
                      "replies": [
                        {
                          "id": "i4lszx4",
                          "text": "It’s a joke. It’s an obvious joke.",
                          "timestamp": "2022-04-13 19:30:15",
                          "score": 17,
                          "num_children": 1,
                          "author": 279491,
                          "replies": [
                            {
                              "id": "i4lt3zq",
                              "text": "Ah, I see. Another successful day of embarrassing myself on the internet then.",
                              "timestamp": "2022-04-13 19:31:01",
                              "score": 7,
                              "num_children": 1,
                              "author": 293106,
                              "replies": [
                                {
                                  "id": "i4qibk0",
                                  "text": "No worries, we all have bad days.",
                                  "timestamp": "2022-04-14 18:58:08",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 279491,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i4lppom",
                  "text": "You forgot the rules brother.",
                  "timestamp": "2022-04-13 19:07:29",
                  "score": 3,
                  "num_children": 0,
                  "author": 134989,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4lc0a0",
          "text": "[deleted]",
          "timestamp": "2022-04-13 17:40:15",
          "score": 13,
          "num_children": 1,
          "replies": [
            {
              "id": "i4lr7h7",
              "text": "It wasn't the person I was expecting to fix me, more what that person would bring. I expected that having a girlfriend would solve the loneliness since I thought that was the source of all my issues, but on reflection that was not the case.",
              "timestamp": "2022-04-13 19:17:23",
              "score": 5,
              "num_children": 2,
              "author": 226284,
              "replies": [
                {
                  "id": "i4ltdyo",
                  "text": ">girlfriend would solve the loneliness\n\nI'm glad you realized that wasn't the case",
                  "timestamp": "2022-04-13 19:32:53",
                  "score": 5,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "i4m97up",
                  "text": "Other people cannot make you happy. They can help set you up for happyness but they cannot make you feel that emotion. You have to be in the right frame of mind and actually allow yourself to be happy. Same applies for other emotions. No one is responsible for your emotions but you.",
                  "timestamp": "2022-04-13 21:18:11",
                  "score": 2,
                  "num_children": 0,
                  "author": 326605,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4lzdzk",
          "text": "A woman made me happy, then she made me mad and fucked my faith in humanity, so at least I want to be self sufficient now.",
          "timestamp": "2022-04-13 20:14:06",
          "score": 1,
          "num_children": 0,
          "author": 276609,
          "replies": []
        }
      ]
    },
    {
      "id": "i4kq3f2",
      "text": "if that's the best a shrink can offer i might as well get therapy from an imam",
      "timestamp": "2022-04-13 15:20:48",
      "score": 18,
      "num_children": 1,
      "author": 106171,
      "replies": [
        {
          "id": "i4qhh33",
          "text": "What is the cure for such disorders? Beatings!",
          "timestamp": "2022-04-14 18:52:31",
          "score": 2,
          "num_children": 0,
          "author": 18818,
          "replies": []
        }
      ]
    },
    {
      "id": "i4kou73",
      "text": "TBF my depression has gotten much more less pronounced ever since I found my gf, now wife. Our room is more messy than ever tho, but it's just much less painful to be depressed together rather than alone.",
      "timestamp": "2022-04-13 15:12:39",
      "score": 14,
      "num_children": 0,
      "author": 307801,
      "replies": []
    },
    {
      "id": "i4kq00a",
      "text": "She didn't say \"Wash your penis\" as well? Terrible doctor.",
      "timestamp": "2022-04-13 15:20:12",
      "score": 13,
      "num_children": 0,
      "author": 27193,
      "replies": []
    },
    {
      "id": "i4kfww7",
      "text": "Wanna bet if anon was a woman that doctor would have given much better advice?",
      "timestamp": "2022-04-13 14:13:30",
      "score": 140,
      "num_children": 3,
      "replies": [
        {
          "id": "i4kj2ch",
          "text": "\"Clean your room and get a boyfriend that pays everything for you\"",
          "timestamp": "2022-04-13 14:34:38",
          "score": 174,
          "num_children": 2,
          "author": 229198,
          "replies": [
            {
              "id": "i4kmcu5",
              "text": "Simple as",
              "timestamp": "2022-04-13 14:56:13",
              "score": 42,
              "num_children": 0,
              "author": 178397,
              "replies": []
            },
            {
              "id": "i4m6ye7",
              "text": "Holy fuck I saw a clip of a dude with his breadwinner girlfriend that paid for everything for them and the comments were *full* of women saying how that shit gets tiring real quick and she should leave if he doesn’t start “pulling his weight.” \n\nYeah we know it’s tiring. I was, somehow, incredibly shocked at how fucking r-worded and genuinely ungrateful some women can be. The “empowerment and independence” really flies out the window at opportune moments. Fastest thing to ever kill my former feminist thoughts was hearing women speak their real opinions about men and how quickly they’re willing to play the “Woman” card when it’s advantageous to them.",
              "timestamp": "2022-04-13 21:03:36",
              "score": 44,
              "num_children": 1,
              "author": 220989,
              "replies": [
                {
                  "id": "i4mn2bi",
                  "text": "> r-worded\n\nSir, this is the 4chan subreddit",
                  "timestamp": "2022-04-13 22:53:34",
                  "score": 14,
                  "num_children": 1,
                  "author": 51719,
                  "replies": [
                    {
                      "id": "i4mp5yj",
                      "text": "Pretty sure the actual word is banned here and will get your comment removed by a mod. I assume to protect the sub from admins but I don’t know.",
                      "timestamp": "2022-04-13 23:09:04",
                      "score": 12,
                      "num_children": 0,
                      "author": 220989,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i4knk8f",
          "text": "That's exactly what she did, advised anon as if he was a woman, failing to take the male perspective into account.",
          "timestamp": "2022-04-13 15:04:10",
          "score": 46,
          "num_children": 1,
          "author": 353038,
          "replies": [
            {
              "id": "i4ndl31",
              "text": "Still shit advice",
              "timestamp": "2022-04-14 02:07:51",
              "score": 5,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i4n8sce",
          "text": "Wanna bet that this is fake as fuck and no real doctor in the modern world would actually give advice like this?",
          "timestamp": "2022-04-14 01:32:41",
          "score": -2,
          "num_children": 0,
          "author": 211210,
          "replies": []
        }
      ]
    },
    {
      "id": "i4kc66f",
      "text": "\\> Guys with gf no feel sad so you need gf\n\nWoman logic\n\nClean your room was good advice tho. \"Get a gf\" should have been \"sleep well, eat well, and lift weights\". Unironically this is all 90% of people with depression need. (It's probably too late, but I should have also said prayer (seethe) and finding a priority outside of yourself, those are even more important than sleeping eating and lifting)\n\nAlso how do I make the carrot show as a carrot and not the shitty reddit quoting thing I tried a space before the carrot but no work",
      "timestamp": "2022-04-13 13:47:09",
      "score": 1552,
      "num_children": 41,
      "author": 274522,
      "replies": [
        {
          "id": "i4kd7mz",
          "text": "You mean like this? Put a backslash before the greater-than sign.\n\n\n\\> text",
          "timestamp": "2022-04-13 13:54:31",
          "score": 186,
          "num_children": 7,
          "author": 165122,
          "replies": [
            {
              "id": "i4kf01d",
              "text": "\\>lying like that\n\nISHYGDDT",
              "timestamp": "2022-04-13 14:07:11",
              "score": 7,
              "num_children": 0,
              "author": 198714,
              "replies": []
            },
            {
              "id": "i4kdhpr",
              "text": "Wow I'm an idiot, thanks",
              "timestamp": "2022-04-13 13:56:31",
              "score": 50,
              "num_children": 2,
              "author": 274522,
              "replies": [
                {
                  "id": "i4kept9",
                  "text": "Well you clearly either knew or were able to look up what a backslash is, so you should be alright.",
                  "timestamp": "2022-04-13 14:05:10",
                  "score": 25,
                  "num_children": 1,
                  "author": 165122,
                  "replies": [
                    {
                      "id": "i4klq11",
                      "text": "whats a blackslash?",
                      "timestamp": "2022-04-13 14:52:01",
                      "score": 5,
                      "num_children": 4,
                      "replies": [
                        {
                          "id": "i4kp6kj",
                          "text": "When you stand by a urinal with your butt facing it, then you push your pp under facing the urinal, then pee",
                          "timestamp": "2022-04-13 15:14:53",
                          "score": 63,
                          "num_children": 2,
                          "author": 216622,
                          "replies": [
                            {
                              "id": "i4krvpt",
                              "text": "No you're thinking of a splash smash. OP is referring to the part of the kitchen counter that continues up the wall",
                              "timestamp": "2022-04-13 15:32:19",
                              "score": 19,
                              "num_children": 0,
                              "author": 16152,
                              "replies": []
                            },
                            {
                              "id": "i4mc4ks",
                              "text": "Nah thats back splash because the splashback ends up splashing your back",
                              "timestamp": "2022-04-13 21:37:37",
                              "score": 1,
                              "num_children": 0,
                              "author": 344601,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "i4lm4pb",
                          "text": "You read left to right, so if you take the bottom of the line as the base, you can differentiate between forward and back slash depending on which way it's \"leaning\".",
                          "timestamp": "2022-04-13 18:44:17",
                          "score": 2,
                          "num_children": 0,
                          "author": 272166,
                          "replies": []
                        },
                        {
                          "id": "i4lfwru",
                          "text": "\\",
                          "timestamp": "2022-04-13 18:04:42",
                          "score": 1,
                          "num_children": 0,
                          "author": 237615,
                          "replies": []
                        },
                        {
                          "id": "i4l2dnc",
                          "text": "it's the one above your enter button",
                          "timestamp": "2022-04-13 16:39:19",
                          "score": 0,
                          "num_children": 0,
                          "author": 120565,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i4lw5y3",
                  "text": "Backslashes \\*\\*can\\*\\* \\^cancel \\[all\\]() formatting \\~\\~afaik\\~\\~",
                  "timestamp": "2022-04-13 19:50:55",
                  "score": 1,
                  "num_children": 0,
                  "author": 272689,
                  "replies": []
                }
              ]
            },
            {
              "id": "i4kz9wl",
              "text": "Oh thank god I’ve been wondering this for awhile",
              "timestamp": "2022-04-13 16:19:49",
              "score": 2,
              "num_children": 0,
              "author": 154455,
              "replies": []
            },
            {
              "id": "i4ki0nx",
              "text": "\\> Kek",
              "timestamp": "2022-04-13 14:27:41",
              "score": 1,
              "num_children": 0,
              "author": 118047,
              "replies": []
            },
            {
              "id": "i4kk8uv",
              "text": "\\>noice",
              "timestamp": "2022-04-13 14:42:24",
              "score": 1,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i4kwm59",
              "text": "\\>hi",
              "timestamp": "2022-04-13 16:02:44",
              "score": 1,
              "num_children": 1,
              "author": 34444,
              "replies": [
                {
                  "id": "i4lifkt",
                  "text": "\\>hmmmm",
                  "timestamp": "2022-04-13 18:20:50",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i4n1tlh",
                      "text": "\\>like this",
                      "timestamp": "2022-04-14 00:41:59",
                      "score": 1,
                      "num_children": 0,
                      "author": 34444,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4phwjo",
              "text": "\\> doesn't know how to use carrots",
              "timestamp": "2022-04-14 14:59:56",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i4kj8iv",
          "text": "I don’t know if I’d say it’s “**all**” they need, but it is absolutely the best first steps, speaking from experience. I used to spend 20 hours a day in my room with a blanket hung over the window so it’d be constantly dark. Now, I’m not necessarily back to normal, but I am functional and generally content with life again.",
          "timestamp": "2022-04-13 14:35:47",
          "score": 119,
          "num_children": 2,
          "author": 222088,
          "replies": [
            {
              "id": "i4kxgy4",
              "text": "How do you do this as an adult? It's just never even come across to me as an option to not drag myself out of bed when there's shit to do. I understand the desire to, but i also know I wouldn't have a room to whole up in a month later.",
              "timestamp": "2022-04-13 16:08:14",
              "score": 20,
              "num_children": 5,
              "replies": [
                {
                  "id": "i4kyl4n",
                  "text": "Three things:\n\n•I was in college. Fortunately, I always preferred self-teaching, so I was able to learn from my cave and only leave for tests.\n\n•People *do* lose their jobs and, sometimes, their homes because of depression. That’s not to say that it isn’t their fault or responsibility, but it’s still an unfortunate circumstance to find oneself in.\n\n•But that last point should actually highlight why depression is so scary. Imagine being convinced by your own brain that you’d rather risk losing your job than simply going outside.",
                  "timestamp": "2022-04-13 16:15:27",
                  "score": 67,
                  "num_children": 1,
                  "author": 222088,
                  "replies": [
                    {
                      "id": "i4kz6it",
                      "text": "That is honestly terrifying, I guess it's always helped that I separate work from life and see work as an escape. My darkest days I actually looked forward to going to work so i could try to ignore all the fucked up shit going on.",
                      "timestamp": "2022-04-13 16:19:14",
                      "score": 28,
                      "num_children": 3,
                      "replies": [
                        {
                          "id": "i4l7nl1",
                          "text": "R slash antiwork on suicide watch",
                          "timestamp": "2022-04-13 17:12:33",
                          "score": 29,
                          "num_children": 1,
                          "author": 14103,
                          "replies": [
                            {
                              "id": "i4ltja7",
                              "text": "Those pussies were born on suicide watch.",
                              "timestamp": "2022-04-13 19:33:52",
                              "score": 28,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "i4lchxd",
                          "text": "I think that's pretty common. Lots of older people I've worked with seemed addicted to work\n\nNot all mind you, plenty of 50yo slackers",
                          "timestamp": "2022-04-13 17:43:19",
                          "score": 9,
                          "num_children": 0,
                          "author": 31556,
                          "replies": []
                        },
                        {
                          "id": "i4lmdrv",
                          "text": "The only time I was excited to go to work, my homelife was hell. But hey, I fucking crushed it for a couple of quarters.",
                          "timestamp": "2022-04-13 18:45:53",
                          "score": 2,
                          "num_children": 0,
                          "author": 272166,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i4l671x",
                  "text": "It's a mental struggle with your own brain. In my worst times it would take me months to pick up candy wrapper from the floor. I could stare at it every day for half an hour but not stand up and pick it up. I knew that I would eventually need to pick it up and it's a candy wrapper that shouldn't be on the floor. Now that I'm more or less okay I can't explain the thought processes that I had logically, it's almost funny to me. It's just a very dark, sticky and inert state of mind. Like you literally don't move a finger because you're not sure that it's gonna pay off.",
                  "timestamp": "2022-04-13 17:03:10",
                  "score": 16,
                  "num_children": 1,
                  "author": 140202,
                  "replies": [
                    {
                      "id": "i4x6x6x",
                      "text": "No pay off, good way to put it. When I was deepest in it about ten years ago I was smoking pot any and all times of the day and I just felt like I was in a fog mentally at all times, could hardly form a coherent sentence. But being sober was worse so I was constantly chasing the next hit of dopamine. But when I was already high and *then* started to feel that anxiety, I would absolutely panic. Glad I never considered harder drugs cause just being an anxious occasionally drunk pothead was hell enough. Some people live in their heads their entire lives and I really wouldn't wish that on anybody.",
                      "timestamp": "2022-04-16 04:35:07",
                      "score": 1,
                      "num_children": 0,
                      "author": 247859,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i4kzh53",
                  "text": "Depression is a mental disease. Asking \"how do you do this as an adult\" is like asking a person with OCD why they don't just stop washing their hands before they bleed (or whatever harmful behaviour they are performing as part of their obsessive behaviour).\n\nI sort of get why you think like this though. It is incredibly hard to understand what it is like to have one of these conditions. Arguably impossible. And the people suffering from it can't explain it well because they don't understand either.",
                  "timestamp": "2022-04-13 16:21:04",
                  "score": 23,
                  "num_children": 2,
                  "author": 115517,
                  "replies": [
                    {
                      "id": "i4md14i",
                      "text": "The point is most adults cant do what hes asking about because if they do they'll end up homeless.  When you dont have a safety net to take care of you (and im talking about more than just government programs) there comes a point where you have to make a conscious decision between \"okay, im going to be miserable but i need to eat/have a roof over my head\" and \"im so far gone i dont give a shit if i end up homeless\"\n\nFor the vast majority of people with mental illnesses theyre not at that second point, so they keep trudging through the misery.",
                      "timestamp": "2022-04-13 21:43:38",
                      "score": 4,
                      "num_children": 0,
                      "author": 220234,
                      "replies": []
                    },
                    {
                      "id": "i4l8rx0",
                      "text": "[deleted]",
                      "timestamp": "2022-04-13 17:19:46",
                      "score": -1,
                      "num_children": 4,
                      "replies": [
                        {
                          "id": "i4l9t1q",
                          "text": "That's why you get diagnosed by a doctor",
                          "timestamp": "2022-04-13 17:26:18",
                          "score": 6,
                          "num_children": 0,
                          "author": 115517,
                          "replies": []
                        },
                        {
                          "id": "i4lcpyw",
                          "text": "Why does that matter though? If that mindset leads to them getting help and improving their lives why does it matter?",
                          "timestamp": "2022-04-13 17:44:45",
                          "score": 4,
                          "num_children": 0,
                          "author": 31556,
                          "replies": []
                        },
                        {
                          "id": "i4lafug",
                          "text": "get lost",
                          "timestamp": "2022-04-13 17:30:19",
                          "score": 4,
                          "num_children": 0,
                          "author": 36527,
                          "replies": []
                        },
                        {
                          "id": "i4npoos",
                          "text": "If you get a regular disease do you not go to a doctor or take medicine? What part of \"it is a disease\" and \"lol I don't have to do anything\" are related?",
                          "timestamp": "2022-04-14 03:47:24",
                          "score": 0,
                          "num_children": 0,
                          "author": 327858,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i4m9ncx",
                  "text": "UK University where money is siphoned into your account, and if I were to have no assignments I can go a week without doing shit",
                  "timestamp": "2022-04-13 21:21:01",
                  "score": 2,
                  "num_children": 1,
                  "author": 53335,
                  "replies": [
                    {
                      "id": "i4za39g",
                      "text": "I've gone 5 years without turning up and just NEETing in my room eating takeaways. Uselessness + maximum loan not a good mix",
                      "timestamp": "2022-04-16 17:21:47",
                      "score": 1,
                      "num_children": 0,
                      "author": 343341,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i4mgdp9",
                  "text": "Your ability to \"just do it anyway\" simply disappears.",
                  "timestamp": "2022-04-13 22:06:16",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "i4o18vl",
              "text": "How'd you get out? I'm stuck, and I've been stuck since I was a teenager. Sometimes it was tolerable, sometimes it was bad, and these days I'm completely unmedicated and feel numb and empty.\n\nThe big problem, or one of them, is that I just can't envision a future worth working towards. I know what I want, but I don't see how I can reach it.",
              "timestamp": "2022-04-14 05:47:05",
              "score": 1,
              "num_children": 0,
              "author": 78057,
              "replies": []
            }
          ]
        },
        {
          "id": "i4ktsja",
          "text": "Yeah, looking at all the people who obsessively eat well, sleep well, and lift weights trading depression for exercise dysfunction is incredibly OP. As long as you don't start blasting to improve your max stats, it's such a mood boost",
          "timestamp": "2022-04-13 15:44:43",
          "score": 8,
          "num_children": 0,
          "author": 236023,
          "replies": []
        },
        {
          "id": "i4kwphw",
          "text": ">sleep well, eat well, and lift weights \n\nI do all of this and am still depressed",
          "timestamp": "2022-04-13 16:03:20",
          "score": 9,
          "num_children": 0,
          "author": 50686,
          "replies": []
        },
        {
          "id": "i4ks8hl",
          "text": ">no motivation whatsoever, can barely get out of bed\n\n>just sleep well eat well and lift weights\n\ndepressed people know already know they *should* do these things.",
          "timestamp": "2022-04-13 15:34:37",
          "score": 112,
          "num_children": 3,
          "author": 156862,
          "replies": [
            {
              "id": "i4l5fj2",
              "text": "And fat people know they should eat less. And alchoholics know they should stop drinking. You can apply this to anything.",
              "timestamp": "2022-04-13 16:58:21",
              "score": 23,
              "num_children": 3,
              "author": 353283,
              "replies": [
                {
                  "id": "i4lbbyv",
                  "text": "Thanks, I'm cured.",
                  "timestamp": "2022-04-13 17:35:56",
                  "score": 11,
                  "num_children": 0,
                  "author": 15289,
                  "replies": []
                },
                {
                  "id": "i4lcxrt",
                  "text": ">just stop being an alcoholic",
                  "timestamp": "2022-04-13 17:46:06",
                  "score": 17,
                  "num_children": 1,
                  "author": 156862,
                  "replies": [
                    {
                      "id": "i4ln7tu",
                      "text": ">just stop having chronic pain",
                      "timestamp": "2022-04-13 18:51:14",
                      "score": 4,
                      "num_children": 0,
                      "author": 272166,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i4lsjft",
                  "text": "Yes, and for those people the same thing applies: Simply telling them information they already know is not helpful. In fact it's condescending and shitty.",
                  "timestamp": "2022-04-13 19:27:08",
                  "score": 6,
                  "num_children": 1,
                  "author": 337230,
                  "replies": [
                    {
                      "id": "i4lsxf5",
                      "text": "It's also condescending and shitty when these people spew their woe is me everywhere and then comment \"thanks im cured\" on every piece of advice.",
                      "timestamp": "2022-04-13 19:29:48",
                      "score": 7,
                      "num_children": 2,
                      "author": 353283,
                      "replies": [
                        {
                          "id": "i4m8fwj",
                          "text": "yeah totally, I’m sure they just want to feel shitty all the time",
                          "timestamp": "2022-04-13 21:13:05",
                          "score": 2,
                          "num_children": 1,
                          "author": 156862,
                          "replies": [
                            {
                              "id": "i4nz0ha",
                              "text": "There's some you'd almost swear they do",
                              "timestamp": "2022-04-14 05:21:10",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "i4skm2v",
                          "text": "By \"spew everywhere\" do you mean put on their own social media which you are free to ignore?",
                          "timestamp": "2022-04-15 04:14:35",
                          "score": 1,
                          "num_children": 0,
                          "author": 337230,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4kspd9",
              "text": "Yeah some do. A lot do not. A lot that do, convinced themselves that it would be harder to get out of bed than it really is. And some people, yeah, they are more fucked than that. Stand by it being <10% of people who call themselves depressed. Sorry if that's you, I hope it gets better.",
              "timestamp": "2022-04-13 15:37:42",
              "score": 25,
              "num_children": 5,
              "author": 274522,
              "replies": [
                {
                  "id": "i4kvx3j",
                  "text": "I’m not even depressed and even I don’t have the motivation to exercise and eat well.\n\nI sleep well at least.",
                  "timestamp": "2022-04-13 15:58:18",
                  "score": 25,
                  "num_children": 2,
                  "author": 156862,
                  "replies": [
                    {
                      "id": "i4l4c41",
                      "text": "You don't need motivation to lift you need discipline. Motivation is temporary discipline keeps you going when you don't want to.",
                      "timestamp": "2022-04-13 16:51:26",
                      "score": 18,
                      "num_children": 1,
                      "author": 201125,
                      "replies": [
                        {
                          "id": "i4l962m",
                          "text": "I’ll add that it’s a great first step. I was depressed for years and everything seemed like such a challenge. Started playing a game where every-time me or my friend died playing Borderlands we had to do five push-ups. This led to me wanting to go to the gym so it would be easier, which led to me gaining weight for the first time in years and more social interaction, etc. \n\nIt might not be the solution to the issue but it’s a damn good starting point. Of course, if you had tried to tell me this when I was depressed I would’ve told you to go fuck yourself.",
                          "timestamp": "2022-04-13 17:22:16",
                          "score": 10,
                          "num_children": 1,
                          "author": 22660,
                          "replies": [
                            {
                              "id": "i4lg1df",
                              "text": "I’m now imaging you were so bad at borderlands you ended up getting yoked. Good on you mate",
                              "timestamp": "2022-04-13 18:05:31",
                              "score": 10,
                              "num_children": 1,
                              "author": 394385,
                              "replies": [
                                {
                                  "id": "i4lkvz5",
                                  "text": "We were *terrible* - and thank you man.",
                                  "timestamp": "2022-04-13 18:36:20",
                                  "score": 7,
                                  "num_children": 0,
                                  "author": 22660,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i4l9uj4",
                      "text": "The result of so many people never being taught the importance of discipline and just doing something when you don’t really want to. Lifting weights takes like 45 minutes with 3/4ths of it being rest time. Eating well is literally just picking up healthier alternatives to junk food. It’s grabbing different things off the shelf or ordering something different at a restaurant, what motivation does that require? \n\nNot trying to specifically attack you, just the sentiment in general. It’s not necessarily an objectively awful thing to pursue a life of easy hedonism, I just can’t imagine it’s very fulfilling.",
                      "timestamp": "2022-04-13 17:26:35",
                      "score": -1,
                      "num_children": 2,
                      "author": 270225,
                      "replies": [
                        {
                          "id": "i4legom",
                          "text": "While I don't think you're wrong, discipline was drilled into me from an early age. It burned me out hard\n\n\nI think we need to really emphasize that discipline can make you feel good, improve your life. Instead of \"if you're undisciplined you will end up homeless and go to hell, you useless shit. I'll have wasted my life raising you\"\n\n\nI see stuff like fatpeoplehate in a similar vein. People think they're helping by insulting them, but the amount of people they help is miniscule compared to the number of people set back by the cruelty",
                          "timestamp": "2022-04-13 17:55:38",
                          "score": 1,
                          "num_children": 2,
                          "author": 31556,
                          "replies": [
                            {
                              "id": "i4lmt9t",
                              "text": "I thought the point of FPH was the cruelty, not helping by being a dick?",
                              "timestamp": "2022-04-13 18:48:39",
                              "score": 3,
                              "num_children": 1,
                              "author": 272166,
                              "replies": [
                                {
                                  "id": "i4m3ww5",
                                  "text": "That was the excuse a lot of people made",
                                  "timestamp": "2022-04-13 20:44:03",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 31556,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "i4o1tq2",
                              "text": "Atomic Habits is actually a really excellent book in this vein, and one of a handful of books that I've found genuinely helpful. In so many words, it argues that discipline is a meme, and that wanting things hard enough is insufficient. It argues that you need to approach change at the deeper level of personal identity, set goals based on that identity, and then optimize the process for reaching those goals. \"Being a marathon runner is part of who I am. How would a marathon runner start their morning?\" You set up cues and rewards and willingly pavlov yourself. It's all about harnessing desire to be productive towards an end, rather than discipline, which is easily exhausted. The author argues - I think rightfully - that this is the approach of most naturally \"disciplined\" people. It's not rejection of temptation that enables them to do tough stuff, it's the gratification of the reward. \"Discipline\" doesn't really factor into it.\n\nIt didn't cure my depression, but I was able to at least make some positive changes because of it.",
                              "timestamp": "2022-04-14 05:54:08",
                              "score": 2,
                              "num_children": 0,
                              "author": 78057,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "i4lct2n",
                          "text": "I used to lift but saying it takes 45 minutes ignores the time I need to spend getting ready, plus driving to the gym and back\n\nI just eat shit that tastes good.",
                          "timestamp": "2022-04-13 17:45:17",
                          "score": 2,
                          "num_children": 0,
                          "author": 156862,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i4l3qu5",
                  "text": "> Stand by it being <10% of people who call themselves depressed.\n\nMaybe for your age group, you're forgetting that the majority of people diagnosed with depression are older than 40. \n\nOne of the largest precursor of depression is a chronic illness, which disproportionately effects the elderly.",
                  "timestamp": "2022-04-13 16:47:47",
                  "score": 8,
                  "num_children": 0,
                  "author": 99342,
                  "replies": []
                },
                {
                  "id": "i4kzrj5",
                  "text": "> Yeah some do. A lot do not. A lot that do, convinced themselves that it would be harder to get out of bed than it really is.\n\nIt is almost like it is a condition affecting the brain, which is in charge of everything. When I'm unable to get out bed and do whatever it is I need to do today, it's not because I want to be there.",
                  "timestamp": "2022-04-13 16:22:51",
                  "score": 13,
                  "num_children": 1,
                  "author": 115517,
                  "replies": [
                    {
                      "id": "i4l7qji",
                      "text": "Why do the people getting butthurt over what I'm saying always have some cringe reddit avatar",
                      "timestamp": "2022-04-13 17:13:05",
                      "score": 1,
                      "num_children": 3,
                      "author": 274522,
                      "replies": [
                        {
                          "id": "i4muiik",
                          "text": "Because making le funny reddit avatar and posting on reddit 12 hours a day about how shitty life has been to you is waaaaay easier than fixing the problems in your life that you have control over and becoming a better person. Cherrypicking shitty advice and saying how it clearly doesn't work (thanks i'm cured) and ignoring your dad calling you to apply at 7-11 down the street and do something, *anything* at all even slightly productive with your life besides making more headmates to add to your system and self diagnosing yourself with autism and DPD.",
                          "timestamp": "2022-04-13 23:48:23",
                          "score": 4,
                          "num_children": 0,
                          "author": 292188,
                          "replies": []
                        },
                        {
                          "id": "i4ln4qn",
                          "text": "\"You're butthurt and cringe.\"\n\nGood defense bro, clearly you know what you're talking about since you can revert to personal attacks instead of expounding on your point and trying to convince people.",
                          "timestamp": "2022-04-13 18:50:41",
                          "score": 0,
                          "num_children": 1,
                          "author": 272166,
                          "replies": [
                            {
                              "id": "i4lnhij",
                              "text": "This is a 4chan subreddit, I'm not here to have debates",
                              "timestamp": "2022-04-13 18:52:57",
                              "score": 5,
                              "num_children": 1,
                              "author": 274522,
                              "replies": [
                                {
                                  "id": "i4lnndv",
                                  "text": "Yeah, fair.",
                                  "timestamp": "2022-04-13 18:54:00",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 272166,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i4l8jxt",
                          "text": "Solid ad hominem argument there, my guy",
                          "timestamp": "2022-04-13 17:18:22",
                          "score": -5,
                          "num_children": 1,
                          "author": 115517,
                          "replies": [
                            {
                              "id": "i4lk1e2",
                              "text": "He's not wrong.",
                              "timestamp": "2022-04-13 18:31:00",
                              "score": 4,
                              "num_children": 0,
                              "author": 381706,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i4la59p",
                  "text": ">Stand by it being <10% of people who call themselves depressed\n\nThe internet makes it seem like depression and anxiety is 70% of the population",
                  "timestamp": "2022-04-13 17:28:28",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "i4lbo4t",
                  "text": "depression is baiscally the state of convincing yourself that everything is harder than it really is.",
                  "timestamp": "2022-04-13 17:38:05",
                  "score": 2,
                  "num_children": 0,
                  "author": 390603,
                  "replies": []
                }
              ]
            },
            {
              "id": "i4l9lle",
              "text": "There are varying degrees of this that absolutely matter. I should work out, but don't. I would work out, but I don't have anyone to endow me with motivation. I should work out, but I'll do it \"when the time is right.\" (As they kick the can forever.) I should work out, but what's the point, I'm still a victim of these five other things! I should work out, but eating Cheetos and playing video games makes me feel good right now, and my entire short versus long term reward system is busted. I should work out, but, eh, it's cold out.  \n\nThe human capacity to rationalize away from personal responsibility is limitless.",
              "timestamp": "2022-04-13 17:25:01",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i4knep4",
          "text": "Getting on a routine unironically helps a lot with depression.\n\nSeeing a therapist helps a lot too, if you can't get on a routine with depression see a therapist first but your therapist us eventually gonna tell you to exercise not eat like shit and get organized too",
          "timestamp": "2022-04-13 15:03:10",
          "score": 22,
          "num_children": 0,
          "author": 82709,
          "replies": []
        },
        {
          "id": "i4kz0fa",
          "text": "I've had a girlfriend for almost 2yrs now, and that sure as hell didn't make me stop feeling sad. It'll help in some ways like when it flares up, I'm not alone. But it takes the fun out of everything, and it's completely random. Could be going out to eat, then boom; I wanna die. Oh, are you literally in the middle of sex? You should put a bullet in your head...\n\n\nMaybe I don't have enough girlfriends🤔🤔",
          "timestamp": "2022-04-13 16:18:09",
          "score": 9,
          "num_children": 1,
          "author": 249117,
          "replies": [
            {
              "id": "i4l7h0w",
              "text": "I'm not saying your gf should fix your depression, but if these thoughts are correlated with sex and time alone with her at all, idk, there might be something wrong with this relationship, maybe not, just saying, something to think about",
              "timestamp": "2022-04-13 17:11:22",
              "score": 0,
              "num_children": 2,
              "author": 274522,
              "replies": [
                {
                  "id": "i4l9wa6",
                  "text": "Nah, I love her greatly and she's wonderful. My point was despite her being amazing, these thoughts still invade. The fact that something as simple as having  a girlfriend doesn't fix whatever issue there is with my brain. This issue invades my gaming, job, music, AND my time with gf. That was my point",
                  "timestamp": "2022-04-13 17:26:53",
                  "score": 2,
                  "num_children": 0,
                  "author": 249117,
                  "replies": []
                },
                {
                  "id": "i4lbv5w",
                  "text": "you little vile piece of shit",
                  "timestamp": "2022-04-13 17:39:20",
                  "score": -2,
                  "num_children": 1,
                  "author": 36527,
                  "replies": [
                    {
                      "id": "i4lc3e1",
                      "text": "Lol this was the most reasonable thing I've said in this thread",
                      "timestamp": "2022-04-13 17:40:48",
                      "score": 3,
                      "num_children": 0,
                      "author": 274522,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i4ku8i4",
          "text": "\"Sleep well, eat well, and lift weights... and [take this placebo](https://i.imgur.com/HaGPsfC.png).\"",
          "timestamp": "2022-04-13 15:47:33",
          "score": 8,
          "num_children": 1,
          "author": 370263,
          "replies": [
            {
              "id": "i4l7nte",
              "text": "Brain chemistry imbalances leading to feeling bad and lazy all the time improved when brain releases feel good chemicals thanks to placebo\n\nMore at 11",
              "timestamp": "2022-04-13 17:12:36",
              "score": 0,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i4kxpq1",
          "text": "Regular exercise genuinely does a massive amount of work in dealing with anxiety or depression issues. It doesn't always fully fix the problem but it does a lot of work towards it",
          "timestamp": "2022-04-13 16:09:51",
          "score": 7,
          "num_children": 0,
          "author": 4001,
          "replies": []
        },
        {
          "id": "i4kg65k",
          "text": "being sad is retardedslur as fuck",
          "timestamp": "2022-04-13 14:15:14",
          "score": 26,
          "num_children": 1,
          "author": 374902,
          "replies": [
            {
              "id": "i4kop3h",
              "text": "You after everyone you know and love gets horribly slaughtered:\n\n😏\n>😱\n>>😦\n>>>😧\n>>>>🙁\n>>>>>😟\n>>>>>>😞\n>>>>>>>😣\n>>>>>>>>😫\n>>>>>>>>>😭😭😭😭",
              "timestamp": "2022-04-13 15:11:44",
              "score": 24,
              "num_children": 2,
              "replies": [
                {
                  "id": "i4l7umi",
                  "text": "Pop MDMA to cope\n\n\"No sad vibes ever, bois\"",
                  "timestamp": "2022-04-13 17:13:50",
                  "score": 6,
                  "num_children": 0,
                  "author": 14103,
                  "replies": []
                },
                {
                  "id": "i4lkwxy",
                  "text": "Im just gonna fuck your mum to get better 😍😂😃😝😔😛😑😏😑😏☺️😌☺️",
                  "timestamp": "2022-04-13 18:36:30",
                  "score": 2,
                  "num_children": 0,
                  "author": 374902,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4kjeif",
          "text": "\n>\"sleep well, eat well, and lift weights\". Unironically this is all 90% of people with depression need.\n\nGod damn it",
          "timestamp": "2022-04-13 14:36:52",
          "score": 20,
          "num_children": 0,
          "author": 229198,
          "replies": []
        },
        {
          "id": "i4kltab",
          "text": "A day away from my PC did me well after a bit of a panic attack.",
          "timestamp": "2022-04-13 14:52:37",
          "score": 3,
          "num_children": 0,
          "author": 277734,
          "replies": []
        },
        {
          "id": "i4l0zui",
          "text": "what are you referring to with the word _depression_?",
          "timestamp": "2022-04-13 16:30:36",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i4l3nx7",
          "text": "Sleeping, eating and exercise works initially to lift mood. Almost like a drug....but then tolerance starts. I'm in great shape and cut out all bad habits, but mentally I'm worse than ever.\n\nIt's not a cure-all by any means. Far less than 90% for sure.",
          "timestamp": "2022-04-13 16:47:16",
          "score": 3,
          "num_children": 0,
          "author": 235912,
          "replies": []
        },
        {
          "id": "i4n8o3u",
          "text": ">”sleep well, eat well, and lift weights\". Unironically this is all 90% of people with depression need.\n\nIf this suddenly gets rid of your depression then you didn’t have depression, you should those things anyways but fucking lol if you think this will cure depression",
          "timestamp": "2022-04-14 01:31:49",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "i4nab7b",
              "text": "Doctors don't wait until you try those things to see if it goes away or not to tell you have depression",
              "timestamp": "2022-04-14 01:43:37",
              "score": 1,
              "num_children": 2,
              "author": 274522,
              "replies": [
                {
                  "id": "i4nagiw",
                  "text": "Yes exactly, but if you are actually depressed you join consider therapy",
                  "timestamp": "2022-04-14 01:44:40",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i4namfi",
                      "text": "I stopped going to therapy and started doing the things in my post and I'm much better off",
                      "timestamp": "2022-04-14 01:45:50",
                      "score": 2,
                      "num_children": 1,
                      "author": 274522,
                      "replies": [
                        {
                          "id": "i4naucs",
                          "text": "good for you bro, didn’t solve my problems but it definitely helped",
                          "timestamp": "2022-04-14 01:47:26",
                          "score": 2,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i4oc6xp",
                  "text": "So, you're not talking about depression then.",
                  "timestamp": "2022-04-14 08:12:46",
                  "score": 0,
                  "num_children": 0,
                  "author": 33823,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4ks9tr",
          "text": "ITT: somehow both neurotypical and retarded",
          "timestamp": "2022-04-13 15:34:52",
          "score": 12,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i4l8a6c",
          "text": ">Unironically this is all 90% of people with depression need\n\nMeanwhile most people on reddit will refuse to try anything and think depression and anxiety make you as helpless as a paraplegic and wonder why things never work out for them.",
          "timestamp": "2022-04-13 17:16:36",
          "score": 5,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i4l9h1w",
          "text": "FYI - clinical depression doesn’t work like that . It’s your body making you feel depressed not your life choices or lifestyle and it comes with the added bonus of clinical fatigue. \n\nWhat does work is knowing this and saying to yourself , “ okay everything is in order and I’m fine “ . The fatigue you just have to fight through by having the heart to grind it out. \n\nClinical depression is caused by different physical problems not always  related to mental health. But again the right diagnosis is the only way to find out.",
          "timestamp": "2022-04-13 17:24:14",
          "score": 5,
          "num_children": 1,
          "author": 78829,
          "replies": [
            {
              "id": "i4lhqkn",
              "text": "[deleted]",
              "timestamp": "2022-04-13 18:16:26",
              "score": 3,
              "num_children": 1,
              "replies": [
                {
                  "id": "i4oc2nd",
                  "text": "Yeah same brother...it makes my blood boil when I read such bullshit all day every day",
                  "timestamp": "2022-04-14 08:11:03",
                  "score": 2,
                  "num_children": 0,
                  "author": 33823,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4kqno1",
          "text": "yeah let me just will myself into 8 hours of sleep. let me just will myself into having time to eat healthy when working, let me just will myself into actually having time to go to the gym.  \n\nOh, there's your problem. Even if you covered 3 out of the 4 things there, problem isn't solved. It's a problem of will. Depression isn't that simple.",
          "timestamp": "2022-04-13 15:24:26",
          "score": 16,
          "num_children": 4,
          "replies": [
            {
              "id": "i4kr5p6",
              "text": "Sounds like maybe you're in the 10%, sorry frend",
              "timestamp": "2022-04-13 15:27:40",
              "score": 10,
              "num_children": 2,
              "author": 274522,
              "replies": [
                {
                  "id": "i4krdl6",
                  "text": "You know what's the best thing? I used to work out. Like, a lot. I was still fucked up. Now, I'm just more aware of it, being older and shit",
                  "timestamp": "2022-04-13 15:29:06",
                  "score": 6,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i4krjzd",
                      "text": "I hope you figure it out",
                      "timestamp": "2022-04-13 15:30:14",
                      "score": 6,
                      "num_children": 1,
                      "author": 274522,
                      "replies": [
                        {
                          "id": "i4krqdo",
                          "text": "Me too, man",
                          "timestamp": "2022-04-13 15:31:22",
                          "score": 6,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i4krz6d",
                  "text": "You’re not a therapist. You don’t know what the fuck you’re talking about.",
                  "timestamp": "2022-04-13 15:32:57",
                  "score": -6,
                  "num_children": 1,
                  "author": 251856,
                  "replies": [
                    {
                      "id": "i4ks2sm",
                      "text": "Like therapists know what they are talking about lol",
                      "timestamp": "2022-04-13 15:33:35",
                      "score": 7,
                      "num_children": 2,
                      "author": 274522,
                      "replies": [
                        {
                          "id": "i4lp7f7",
                          "text": "I’m going to tell my psychiatrist that she’s an idiot and should have just prescribed me diet and exercise next time I go in to get my antidepressants refilled.",
                          "timestamp": "2022-04-13 19:04:08",
                          "score": 1,
                          "num_children": 1,
                          "author": 86818,
                          "replies": [
                            {
                              "id": "i4lpgq4",
                              "text": "Based",
                              "timestamp": "2022-04-13 19:05:50",
                              "score": 1,
                              "num_children": 0,
                              "author": 274522,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "i4ksz7a",
                          "text": "You are the walking embodiment of dunning-kreuger",
                          "timestamp": "2022-04-13 15:39:28",
                          "score": -1,
                          "num_children": 1,
                          "author": 251856,
                          "replies": [
                            {
                              "id": "i4kt4hv",
                              "text": "Whatever fslur",
                              "timestamp": "2022-04-13 15:40:24",
                              "score": 9,
                              "num_children": 0,
                              "author": 274522,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4lpuow",
              "text": "> yeah let me just will myself into 8 hours of sleep. let me just will myself into having time to eat healthy when working, let me just will myself into actually having time to go to the gym.\n\nLet me just will myself to sleep 30 mins earlier.\n\nLet me will myself to try to eat macros better for one meal.\n\nLet me try to go to a walk for 30 mins.\n\nSoon, as your body will like these changes you'll do more until a point you'll realise you'd need will to sleep and eat shit \n\nThis is how you start.\n\nYGMI.",
              "timestamp": "2022-04-13 19:08:24",
              "score": 2,
              "num_children": 1,
              "author": 361097,
              "replies": [
                {
                  "id": "i4lq47f",
                  "text": "Hahahahah you think that's how it works? Dude I sleep 4 hours on the weekends. I have about 20 mins of break to eat because otherwise we get shit on.\n\nYou think it requires just positive attitude or some bullshit like that, and it doesn't. Accept that some things are straight up fucked.",
                  "timestamp": "2022-04-13 19:10:07",
                  "score": 0,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i4lse7g",
                      "text": "> Dude I sleep 4 hours on the weekends. I have about 20 mins of break to eat because otherwise we get shit on.\n\nWhat are you slave or something.",
                      "timestamp": "2022-04-13 19:26:09",
                      "score": 6,
                      "num_children": 0,
                      "author": 361097,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4lwg4f",
              "text": "You have time for reddit, but don't have time to turn on the stove and leave some rice cooking, you're just a b*tch.\n\nGet your priorities straight.",
              "timestamp": "2022-04-13 19:52:46",
              "score": 2,
              "num_children": 1,
              "author": 276609,
              "replies": [
                {
                  "id": "i4m0mqd",
                  "text": "Yeah, spending time after work, browsing reddit while on the shitter is definitely time I could be cooking lunch I needed about 10 hours ago.  \n\nThink before you speak",
                  "timestamp": "2022-04-13 20:22:25",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i4m3mzs",
                      "text": "1-Yeah, food isn't going to rot if you don't eat it immediately.\n\n2-Don't you eat at home? No wonder you're so grumpy.",
                      "timestamp": "2022-04-13 20:42:14",
                      "score": 1,
                      "num_children": 1,
                      "author": 276609,
                      "replies": [
                        {
                          "id": "i4m6qnt",
                          "text": "It's not going to rot indeed. However, I still don't have time. At most, I order locally some fried chicken on rice and that's it, which is why I ain't a fatass. But I can't eat slowly, for obvious reasons. I eat when I get the time, if I get the time. \n\nThat's just how life is in my industry.",
                          "timestamp": "2022-04-13 21:02:17",
                          "score": 2,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4l5hzz",
              "text": "Ok I'm letting you.",
              "timestamp": "2022-04-13 16:58:46",
              "score": 1,
              "num_children": 0,
              "author": 353283,
              "replies": []
            }
          ]
        },
        {
          "id": "i4mfa2r",
          "text": "I would add having regular day schedule. My depression kicked into high gear when covid started and we started having online classes in uni. And then after finishing uni, with no classes to have my days were passing by like crazy, and yet every one of them was long and dull. As I said, having a regular day schedule helps. And it doesn't have to be classes or work, but if you are anything like me, self imposed schedules don't seem to hold for too long, so an outside one has more power",
          "timestamp": "2022-04-13 21:58:46",
          "score": 2,
          "num_children": 1,
          "author": 150467,
          "replies": [
            {
              "id": "i4mo1yx",
              "text": "Yeah this is good advice, also irl interaction with actual people, I can't imagine the scope of mental damage done by rslurred covid policies",
              "timestamp": "2022-04-13 23:00:37",
              "score": 2,
              "num_children": 0,
              "author": 274522,
              "replies": []
            }
          ]
        },
        {
          "id": "i4mfgov",
          "text": "You pulled that percentage out your ass. \n\nIn reality everyone with sever clinical depression needs medication.",
          "timestamp": "2022-04-13 21:59:59",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "i4mh9z4",
              "text": "Loll even the most brain dead therapist wouldn't say that",
              "timestamp": "2022-04-13 22:12:29",
              "score": 0,
              "num_children": 1,
              "author": 274522,
              "replies": [
                {
                  "id": "i4mhq6u",
                  "text": "No they would. If you reach a certain point with mental illness your brain wouldn’t go back to normal without direct intervention.",
                  "timestamp": "2022-04-13 22:15:37",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4l4dy8",
          "text": "> Unironically this is all 90% of people with depression need.\n\nidiot",
          "timestamp": "2022-04-13 16:51:47",
          "score": 6,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i4kxcfk",
          "text": "&nbsp;&nbsp;&nbsp;🥕   \n🥕🥕",
          "timestamp": "2022-04-13 16:07:26",
          "score": 3,
          "num_children": 0,
          "author": 255403,
          "replies": []
        },
        {
          "id": "i4mt1by",
          "text": "> Unironically this is all 90% of people with depression need. \n\nHoly shit, no.\n\nThis is the kind of shit people say who think depression is being 'sad' or 'feeling down'.  I mean, at least read the wiki on it.",
          "timestamp": "2022-04-13 23:37:26",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "i4mtc8s",
              "text": "How do you guys find this comment, it doesn't seem like you are generally active on this sub at all",
              "timestamp": "2022-04-13 23:39:42",
              "score": 3,
              "num_children": 1,
              "author": 274522,
              "replies": [
                {
                  "id": "i4muih0",
                  "text": "I have a natural radar that detects stupidity and then I take a big shit on it.\n\nOn the real, basically if anything ever hits front page and you click it, because subs like this do post some pretty funny things at times, you will now forever see stuff from the sub and even subs related to I believe. \n\nNow.  Go read wikipedia and then branch out to studies.",
                  "timestamp": "2022-04-13 23:48:23",
                  "score": 0,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i4n1yms",
                      "text": "Oh yeah the official app does that, that thing is trash",
                      "timestamp": "2022-04-14 00:42:59",
                      "score": 2,
                      "num_children": 0,
                      "author": 274522,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i4o7ahj",
          "text": "If your depression gets fixed by sleeping, eating, lifting and cleaning your room, you don't have an actual depression, you're just a vagabond wastrel.",
          "timestamp": "2022-04-14 07:04:28",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i4l374i",
          "text": "I started exercising after couple years of depression. I was going to the gym later and later, found 24h one and exercised at night, because I felt like shit and I had to try really hard not to cry there. Dumb people think that everyone gets some endorphins or shit, when exercising and they just should be happy. The same with eating disorders, when you can't eat and people tell you \"did you try to force yourself to eat?\" Listen you dumb shits, that's the only thing I am fucking doing for years.",
          "timestamp": "2022-04-13 16:44:26",
          "score": 1,
          "num_children": 0,
          "author": 393545,
          "replies": []
        },
        {
          "id": "i4l9epy",
          "text": "What about all the tidy depressed husbands do they need another gf and another room to clean?",
          "timestamp": "2022-04-13 17:23:49",
          "score": 1,
          "num_children": 0,
          "author": 26230,
          "replies": []
        },
        {
          "id": "i4lh5fu",
          "text": "If you just sleep, eat, & exercise consistently you too can be both depressed and hot",
          "timestamp": "2022-04-13 18:12:43",
          "score": 1,
          "num_children": 0,
          "author": 253018,
          "replies": []
        },
        {
          "id": "i4ljfvg",
          "text": "I mean we don't know what OP said to the doctor, perhaps \"I'm very alone, i want to meet someone to spend my life with and also my room is dirty\".\n\nJoking aside, \"get a gf\" more or less mean to start taking care of yourself and begin meeting new people.",
          "timestamp": "2022-04-13 18:27:16",
          "score": 1,
          "num_children": 0,
          "author": 188992,
          "replies": []
        },
        {
          "id": "i4ls50l",
          "text": "The issue is depression decreases your perceived energy level and basically leaves you feeling exhausted every waking moment. So it is very hard to do those things. And doing them and having a positive result would, you'd expect, eventually make it easier to push past that. But depression isn't rational, that's the whole problem. No matter how long I've managed to keep going and functioning on a basic level, it never got easier. Instead it became much harder to avoid the thought of taking a break. Then you see, hey, your life didn't end because you didn't take out the trash. It didn't end because you didn't go to work one day. And so giving in the next time is easier. And soon you are back at square one, and still utterly exhausted.",
          "timestamp": "2022-04-13 19:24:24",
          "score": 1,
          "num_children": 0,
          "author": 337230,
          "replies": []
        },
        {
          "id": "i4luhu1",
          "text": "Does cleaning your room really effect you that much?",
          "timestamp": "2022-04-13 19:40:11",
          "score": 1,
          "num_children": 1,
          "author": 70564,
          "replies": [
            {
              "id": "i4lunqb",
              "text": "Yeah",
              "timestamp": "2022-04-13 19:41:14",
              "score": 1,
              "num_children": 0,
              "author": 274522,
              "replies": []
            }
          ]
        },
        {
          "id": "i4lw3rx",
          "text": "I kind of hate this bullshit though. It's like assuming every diabetic person is type 2 and just fat.\n\nI sleep 8-9 hours a day, I work an upper middle class office job, I have a loving spouse and a dog, I stay pretty active and regularly hike and do physical things, I eat \"normal\" I guess not vegan but I don't over eat, I read a lot and try to consume positive media, I am generally confident and not too insecure about anything.\n\nI still go home and struggle to do anything but just sit and do nothing, I feel no passion for anything and feel like I go through life limited to 25% effort. I pick up hobbies constantly because I'm desperately searching for something that makes me feel better, but none of them ever click and give me any happiness. \n\nDepression isn't the same as just being a loser.",
          "timestamp": "2022-04-13 19:50:32",
          "score": 1,
          "num_children": 0,
          "author": 118371,
          "replies": []
        },
        {
          "id": "i4lx0u8",
          "text": "as someone who eats well, sleeps well and lifts weights. it aint fix shit. It gives a fighting chance. but it comes back once you plateau. Money might do it tho, im broke as fuck",
          "timestamp": "2022-04-13 19:56:59",
          "score": 1,
          "num_children": 0,
          "author": 411610,
          "replies": []
        },
        {
          "id": "i4m0rbi",
          "text": "Gotta love being that 2% that do all the \"sleep well, eat well, and lift weights\", and all you get is that things are somewhat tolerable.",
          "timestamp": "2022-04-13 20:23:15",
          "score": 1,
          "num_children": 0,
          "author": 401576,
          "replies": []
        },
        {
          "id": "i4mg8it",
          "text": "There's no cure for depression unless you've got the desire to become a Buddhist. The best thing an ordinary person can do is just to keep busy until they die, full of regret for not having become a Buddhist.",
          "timestamp": "2022-04-13 22:05:18",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i4mhq70",
          "text": "What I love... The 90% you speak of are the terminally online, in denial, depressed people, and they are all replying to you saying \"nuh-uh!\". They might start off a little depressed, but the more they stay terminally online, the worse the depression gets. Then they spend half a day away from the internet to \"get better\", but their addiction is too strong so \"nope, I'm just far too depressed.\"",
          "timestamp": "2022-04-13 22:15:37",
          "score": 1,
          "num_children": 1,
          "author": 48135,
          "replies": [
            {
              "id": "i4miw6i",
              "text": "Yup. Hate to see it.",
              "timestamp": "2022-04-13 22:23:44",
              "score": 1,
              "num_children": 0,
              "author": 274522,
              "replies": []
            }
          ]
        },
        {
          "id": "i4odf99",
          "text": ">It's probably too late, but I should have also said prayer (seethe) \n\nYou are right my brother. Have you remembered your 5 prayers to Allah today?",
          "timestamp": "2022-04-14 08:30:05",
          "score": 1,
          "num_children": 0,
          "author": 329413,
          "replies": []
        },
        {
          "id": "i4ofzgd",
          "text": "Instructions unclear, praying to Zephyrus",
          "timestamp": "2022-04-14 09:06:45",
          "score": 1,
          "num_children": 0,
          "author": 7389,
          "replies": []
        },
        {
          "id": "i4olhwm",
          "text": "I sleep well, eat well and train well and have no problem getting girls\n\nStill depressed as fuck. Checkmate",
          "timestamp": "2022-04-14 10:21:43",
          "score": 1,
          "num_children": 0,
          "author": 312636,
          "replies": []
        },
        {
          "id": "i4oyl9x",
          "text": ">prayer \n\nREEEEEEEEEE",
          "timestamp": "2022-04-14 12:37:58",
          "score": 1,
          "num_children": 0,
          "author": 223434,
          "replies": []
        },
        {
          "id": "i4nicgw",
          "text": ">Unironically this is all 90% of people with depression need.\n\nyeah but that's the point, every depressed person already knows this, but don't feel the will to do anything, and many times you don't even know why you feel that way, which in turn makes you feel even worse about feeling bad, because you have no reason to feel bad. depression is a chemical imbalance in the brain, a physical problem.",
          "timestamp": "2022-04-14 02:45:07",
          "score": 0,
          "num_children": 0,
          "author": 174912,
          "replies": []
        }
      ]
    },
    {
      "id": "i4kwie8",
      "text": "girlfriend will cause another type of depression",
      "timestamp": "2022-04-13 16:02:03",
      "score": 10,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i4kaihb",
      "text": "Inb4 doctor he switches to follows Jordan Peterson and tells him the same thing.\n\nEdit: I don't mean to sound ungrateful for the award, but people fighting for freedom can use the money more than this site, which if anything does the opposite to boot. Give your money to them instead of reddit.",
      "timestamp": "2022-04-13 13:34:54",
      "score": 2192,
      "num_children": 22,
      "author": 165122,
      "replies": [
        {
          "id": "i4ki70n",
          "text": "inb4 he switches to a lobster",
          "timestamp": "2022-04-13 14:28:52",
          "score": 75,
          "num_children": 1,
          "author": 135618,
          "replies": [
            {
              "id": "i4krloo",
              "text": "Clean your lobster",
              "timestamp": "2022-04-13 15:30:32",
              "score": 44,
              "num_children": 1,
              "author": 16152,
              "replies": [
                {
                  "id": "i4ku68n",
                  "text": "Nice claw",
                  "timestamp": "2022-04-13 15:47:10",
                  "score": 13,
                  "num_children": 1,
                  "author": 20004,
                  "replies": [
                    {
                      "id": "i4l1o9d",
                      "text": "Ain't no law when you got a claw",
                      "timestamp": "2022-04-13 16:34:51",
                      "score": 9,
                      "num_children": 0,
                      "author": 15826,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i4m172a",
          "text": ">that edit \n\n\nkek hilarious redditards",
          "timestamp": "2022-04-13 20:26:06",
          "score": 24,
          "num_children": 0,
          "author": 291552,
          "replies": []
        },
        {
          "id": "i4kbgbz",
          "text": "Kek",
          "timestamp": "2022-04-13 13:41:54",
          "score": 236,
          "num_children": 2,
          "replies": [
            {
              "id": "i4l5exr",
              "text": "kekvv",
              "timestamp": "2022-04-13 16:58:15",
              "score": 25,
              "num_children": 0,
              "author": 179013,
              "replies": []
            },
            {
              "id": "i4m49td",
              "text": "Kid",
              "timestamp": "2022-04-13 20:46:25",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i4nelen",
          "text": "Im fighting for freedom, give it to me",
          "timestamp": "2022-04-14 02:15:38",
          "score": 6,
          "num_children": 0,
          "author": 228387,
          "replies": []
        },
        {
          "id": "i4klzz8",
          "text": "Pretty sure he means he's switching to this female doctor because that advice is based as fuck",
          "timestamp": "2022-04-13 14:53:50",
          "score": 165,
          "num_children": 3,
          "author": 332712,
          "replies": [
            {
              "id": "i4kp57b",
              "text": "Depends on whether the laughter was the \"holy shit it was this easy the whole time I must be retarded\" kind or the \"holy shit this bish is dumb as shit I'm outta here\" kind. The advice is based though, I'll grant that.",
              "timestamp": "2022-04-13 15:14:38",
              "score": 95,
              "num_children": 4,
              "author": 165122,
              "replies": [
                {
                  "id": "i4ld9wm",
                  "text": "I think he thinks it’s a dumb bich, cause it’s a really simple advice coming from a doctor and there’s a lot of steps between cleaning your room and getting a girlfriend.",
                  "timestamp": "2022-04-13 17:48:13",
                  "score": 22,
                  "num_children": 0,
                  "author": 314553,
                  "replies": []
                },
                {
                  "id": "i4kxc7i",
                  "text": "I don't get how you guys are lapping this shit up. I'm married to the girl of my dreams and have a clean room. Now what? r/ thanksimcured",
                  "timestamp": "2022-04-13 16:07:24",
                  "score": 52,
                  "num_children": 7,
                  "author": 212549,
                  "replies": [
                    {
                      "id": "i4mk90j",
                      "text": "You have a wife, you need to get a girlfriend you didn’t follow the instructions.",
                      "timestamp": "2022-04-13 22:33:19",
                      "score": 37,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "i4mrrcw",
                      "text": "Its because 90% of the people online crying about depression haven't even taken the basic steps. Once you are eating healthy, sleeping and have a social life. Then you can really start to work on the root of your depression.",
                      "timestamp": "2022-04-13 23:28:06",
                      "score": 27,
                      "num_children": 2,
                      "author": 408522,
                      "replies": [
                        {
                          "id": "i4oru25",
                          "text": "Lack of drive to do basic things is one of the main symptoms. You wouldn't tell someone with a cold to \"just stop coofing bro\".",
                          "timestamp": "2022-04-14 11:34:33",
                          "score": 9,
                          "num_children": 0,
                          "author": 244440,
                          "replies": []
                        },
                        {
                          "id": "i4n1eei",
                          "text": "Don't forget exercise, sunlight, no caffeine, no cigarettes, no alcohol, no drugs (weeds cool), spend more time in nature, and limiting pharmaceuticals to only nessicary usage. \n\nChapter 2 is getting out from under debt and/or getting legal troubles squared away. \n \nThat's what brought me from the brink to being ecstatic to be alive.",
                          "timestamp": "2022-04-14 00:38:56",
                          "score": 19,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i4n78xk",
                              "text": "True. I would add that most drugs are OK as long as you understand that they can be chemically addictive and should be done in moderation. For example I do lsd maybe once or twice a year and Molly if I'm going to a music festival which is also only a once a year thing. \n\nIts also especially important for men to have a goal to work towards. Something challenging that will improve yourself and teach you skills along the way.",
                              "timestamp": "2022-04-14 01:21:26",
                              "score": 7,
                              "num_children": 1,
                              "author": 408522,
                              "replies": [
                                {
                                  "id": "i4oykbf",
                                  "text": "Yeah I'm not referring to once in a blue moon acid trip or rolling, more so every day use like xanax, opiates, stimulants, etc.",
                                  "timestamp": "2022-04-14 12:37:45",
                                  "score": 5,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i4mne93",
                      "text": "Now your problems really begin.",
                      "timestamp": "2022-04-13 22:55:57",
                      "score": 5,
                      "num_children": 0,
                      "author": 165967,
                      "replies": []
                    },
                    {
                      "id": "i4luacv",
                      "text": "Beggars think that rich don’t have any worries. Same goes here.",
                      "timestamp": "2022-04-13 19:38:52",
                      "score": 12,
                      "num_children": 0,
                      "author": 347146,
                      "replies": []
                    },
                    {
                      "id": "i4np48k",
                      "text": "I mean you got through the first step, that is almost the same as the finishing line",
                      "timestamp": "2022-04-14 03:42:19",
                      "score": 2,
                      "num_children": 0,
                      "author": 327858,
                      "replies": []
                    },
                    {
                      "id": "i4m6wm1",
                      "text": "Guarantee you are still more satisfied and less depressed than anon",
                      "timestamp": "2022-04-13 21:03:18",
                      "score": 0,
                      "num_children": 1,
                      "author": 303233,
                      "replies": [
                        {
                          "id": "i4nedv3",
                          "text": "If you think having a girlfriend is gonna make a difference, I'm sorry your favorite sub for incels got banned.",
                          "timestamp": "2022-04-14 02:14:02",
                          "score": 3,
                          "num_children": 1,
                          "author": 212549,
                          "replies": [
                            {
                              "id": "i4r9j1d",
                              "text": "No but a healthy marriage and kids can definitely change your life. Not saying you can’t be happy if you’re single but some people just have a hard time living life alone.",
                              "timestamp": "2022-04-14 22:01:50",
                              "score": 0,
                              "num_children": 1,
                              "author": 303233,
                              "replies": [
                                {
                                  "id": "i4t5ex0",
                                  "text": "That's the same as having kids to \"fix\" your marriage. Sure, maybe 1 out of 1000 strap down and start doing what they're supposed to out of sheer necessity, but the other 999 are going to have a bad time.",
                                  "timestamp": "2022-04-15 08:32:32",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 212549,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i4moevr",
                      "text": "That's a nice first step. I had diagnosed depression for several years - nothing helped until I fixed some basic shit in my life and took it easy. Once you have that you can go through therapy and treatment, etc.\n\nTrying to cure depression while your life is a mess is like trying to study thermodynamics before studying math\n\nThis advice actually helped me and now my depression is gone",
                      "timestamp": "2022-04-13 23:03:10",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i4kptda",
                  "text": "Well, it wouldn't really depend on that. Why would he \"switch doctors\" FROM a doctor that isn't his doctor. That doesn't make sense. Male is sick, female fills in and tells him to clean his shit up, he decides to switch. He likes the female more than the male.",
                  "timestamp": "2022-04-13 15:19:02",
                  "score": 22,
                  "num_children": 1,
                  "author": 332712,
                  "replies": [
                    {
                      "id": "i4l5ryg",
                      "text": "Or maybe the female is too based for him so he doesn't wanna deal with her again, assuming the next time the guy got sick she'd fill in again? Your version does make sense and mine is getting to be a stretch, so you're probably right.",
                      "timestamp": "2022-04-13 17:00:30",
                      "score": 2,
                      "num_children": 0,
                      "author": 165122,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i4lo32a",
                  "text": "The second kind.\n\nWomen literally have zero concept of how different things are for them vs men in the relationship world. “Just get a girlfriend lol” is meme advice to struggling men for a reason.",
                  "timestamp": "2022-04-13 18:56:50",
                  "score": 20,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "i4lnbmt",
              "text": "The clean your room bit can be good depending on if she meant to get his daily life much more structured. The get a girlfriend bit was downright ray, tear dead. Getting a woman to date requires quite an effort from men. I don't think a depressed man has that much mental capacity for dating.",
              "timestamp": "2022-04-13 18:51:54",
              "score": 11,
              "num_children": 1,
              "author": 361097,
              "replies": [
                {
                  "id": "i4np8ir",
                  "text": "If you can't love yourself, how can you get others to love you?",
                  "timestamp": "2022-04-14 03:43:23",
                  "score": 3,
                  "num_children": 0,
                  "author": 327858,
                  "replies": []
                }
              ]
            },
            {
              "id": "i4m4fnw",
              "text": "Based is a void you stare into until you find your own egotistical schizophrenic pseudo-conservative meaning…child\n\nBased my dick and balls",
              "timestamp": "2022-04-13 20:47:30",
              "score": 4,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i4kh6lr",
          "text": "[deleted]",
          "timestamp": "2022-04-13 14:22:07",
          "score": 155,
          "num_children": 1,
          "replies": [
            {
              "id": "i4kpakz",
              "text": "I mean, that's not mutually exclusive with what I said.",
              "timestamp": "2022-04-13 15:15:36",
              "score": 30,
              "num_children": 0,
              "author": 165122,
              "replies": []
            }
          ]
        },
        {
          "id": "i4ldfnc",
          "text": "Your edit makes a good point. Here have some gold",
          "timestamp": "2022-04-13 17:49:15",
          "score": 13,
          "num_children": 0,
          "author": 234204,
          "replies": []
        },
        {
          "id": "i4m5ju2",
          "text": "People get free awards, every day or 2. Ain't no one spending money for awards from this sub",
          "timestamp": "2022-04-13 20:54:38",
          "score": 5,
          "num_children": 1,
          "author": 132794,
          "replies": [
            {
              "id": "i4m73dg",
              "text": "Oh, is that so? I had no idea, cheers.",
              "timestamp": "2022-04-13 21:04:28",
              "score": 2,
              "num_children": 1,
              "author": 165122,
              "replies": [
                {
                  "id": "i4msse3",
                  "text": "Yeah but the gold one is paid by some redditfag",
                  "timestamp": "2022-04-13 23:35:36",
                  "score": 4,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i4o3z01",
                      "text": "You can earn gold one by giving free ones a lot/getting any a lot, I think",
                      "timestamp": "2022-04-14 06:21:08",
                      "score": 2,
                      "num_children": 0,
                      "author": 221219,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i4njhdu",
          "text": "Holy fuck you're a cute twink. (I'd call you an f-slur but the j-slurs will ban me if I do)",
          "timestamp": "2022-04-14 02:54:06",
          "score": 6,
          "num_children": 1,
          "replies": [
            {
              "id": "i4ocss3",
              "text": "wow a genuine r-slur.",
              "timestamp": "2022-04-14 08:21:12",
              "score": 2,
              "num_children": 0,
              "author": 249565,
              "replies": []
            }
          ]
        },
        {
          "id": "i4o3vjj",
          "text": ">edit\n\n-> r politics",
          "timestamp": "2022-04-14 06:19:56",
          "score": 5,
          "num_children": 0,
          "author": 221219,
          "replies": []
        },
        {
          "id": "i4l98i8",
          "text": "Yeah guys. Let's donate to Russia instead.",
          "timestamp": "2022-04-13 17:22:42",
          "score": 58,
          "num_children": 1,
          "author": 216008,
          "replies": [
            {
              "id": "i4yuxgf",
              "text": "Or your much needed penis enlargement surgery. \n\nAt this stage it’s basically a disability.",
              "timestamp": "2022-04-16 15:35:59",
              "score": 0,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i4llu02",
          "text": "Shut the fuck up",
          "timestamp": "2022-04-13 18:42:21",
          "score": 26,
          "num_children": 1,
          "author": 130106,
          "replies": [
            {
              "id": "i4m0wgb",
              "text": "Make me.",
              "timestamp": "2022-04-13 20:24:11",
              "score": -3,
              "num_children": 1,
              "author": 165122,
              "replies": [
                {
                  "id": "i4mjau5",
                  "text": "based and jc denton-pilled",
                  "timestamp": "2022-04-13 22:26:35",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4lnvnw",
          "text": "Literally first chapter of his book, clean your room :))",
          "timestamp": "2022-04-13 18:55:30",
          "score": 5,
          "num_children": 0,
          "author": 409412,
          "replies": []
        },
        {
          "id": "i4l7cxu",
          "text": "Damn should've looked at the first comment before posting mine. And damn right none of these fuck ass companies need our money. \n\nAll they needed was our info. And they printed money with that.",
          "timestamp": "2022-04-13 17:10:38",
          "score": 8,
          "num_children": 0,
          "author": 27248,
          "replies": []
        },
        {
          "id": "i4mfl16",
          "text": "This isn’t ironic?!?! LOL\n\nYOURE ON THE WRONG SUB",
          "timestamp": "2022-04-13 22:00:48",
          "score": 7,
          "num_children": 0,
          "author": 401004,
          "replies": []
        },
        {
          "id": "i4q9o1t",
          "text": "Here I’m giving you an award for biggest gaylord",
          "timestamp": "2022-04-14 18:00:46",
          "score": 3,
          "num_children": 0,
          "author": 105151,
          "replies": []
        },
        {
          "id": "i4ko87t",
          "text": "or next he's on a flight to Russia with a fistfull of benzos.",
          "timestamp": "2022-04-13 15:08:33",
          "score": 26,
          "num_children": 3,
          "replies": [
            {
              "id": "i4l223s",
              "text": "And coming back sharper than ever",
              "timestamp": "2022-04-13 16:37:18",
              "score": 10,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i4krl7e",
              "text": "Ah the brain damage express",
              "timestamp": "2022-04-13 15:30:26",
              "score": 9,
              "num_children": 0,
              "author": 321257,
              "replies": []
            },
            {
              "id": "i4lds80",
              "text": ">get severe brain damage\n\n>still smarter than 90% of people",
              "timestamp": "2022-04-13 17:51:26",
              "score": 2,
              "num_children": 1,
              "author": 126654,
              "replies": [
                {
                  "id": "i4mnqsk",
                  "text": "You might get smarter if you got his cock out of your mouth",
                  "timestamp": "2022-04-13 22:58:26",
                  "score": 1,
                  "num_children": 1,
                  "author": 107346,
                  "replies": [
                    {
                      "id": "i4ni80i",
                      "text": "Filthy language is cool right guys?",
                      "timestamp": "2022-04-14 02:44:08",
                      "score": 3,
                      "num_children": 1,
                      "author": 126654,
                      "replies": [
                        {
                          "id": "i4nsq6e",
                          "text": "Rude words are quirky! Quirky people are so fkn cool you wouldn't believe.  Almost as cool as Marxists and Antifa.",
                          "timestamp": "2022-04-14 04:15:32",
                          "score": 2,
                          "num_children": 1,
                          "author": 188256,
                          "replies": [
                            {
                              "id": "i4nu9g6",
                              "text": "It just comes with being smarter than your parents. Their parents feared the power of the curse word and it held them back. We seek the foul-mouthed utopia!",
                              "timestamp": "2022-04-14 04:30:37",
                              "score": 2,
                              "num_children": 0,
                              "author": 126654,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i4laxsm",
          "text": "My doctor recommended I check out Jordan Peterson four times.  Said he's \"helped a lot of young men like you\".  Kept asking every visit \"so did you check out that Jordan Peterson guy yet?\"\n\nI didn't have the guts to tell the guy in charge of my pills that I think his philisophy hero is a hot air balloon.",
          "timestamp": "2022-04-13 17:33:27",
          "score": 36,
          "num_children": 2,
          "author": 310893,
          "replies": [
            {
              "id": "i4lbjo2",
              "text": "He is the almost thinking man's thinking man.",
              "timestamp": "2022-04-13 17:37:17",
              "score": 22,
              "num_children": 1,
              "author": 358194,
              "replies": [
                {
                  "id": "i4lbr51",
                  "text": "He's the right wing's Karl Marx, in that he says a lot of long-winded statements that use academic jargon to obscure poor reasoning and inflate weak ideas, with great success amongst millions of followers.",
                  "timestamp": "2022-04-13 17:38:37",
                  "score": -19,
                  "num_children": 3,
                  "author": 310893,
                  "replies": [
                    {
                      "id": "i4lllpy",
                      "text": "Do you have any examples? I hear people complaining about this shit all the time and I've never seen Jordan peterson actually act like that",
                      "timestamp": "2022-04-13 18:40:54",
                      "score": 25,
                      "num_children": 1,
                      "author": 85799,
                      "replies": [
                        {
                          "id": "i4lmavg",
                          "text": "There was www.wisdomofpeterson.com that stitched together combinations of his statements to make new equally sensical ones, you'll have to use archive.org to get it now.",
                          "timestamp": "2022-04-13 18:45:22",
                          "score": -4,
                          "num_children": 1,
                          "author": 310893,
                          "replies": [
                            {
                              "id": "i4ln4mr",
                              "text": "Oh, you mean that he uses big words that don't actually mean anything? That's what I get from the website. A friend of mine had the same complaint about him, but I can watch an hour long talk from Jordan and always see what he means when he uses those words. It's not nonsense, he just uses a shit ton of metaphors and doesn't explain some stuff in detail which can get kinda confusing",
                              "timestamp": "2022-04-13 18:50:40",
                              "score": 24,
                              "num_children": 2,
                              "author": 85799,
                              "replies": [
                                {
                                  "id": "i4nywao",
                                  "text": "He used big words that a lot of people don’t understand so they get defensive about it. 12 Rules to Life is a fantastic book. Everyone should read it. Especially those who criticize him. They typically need it the most, ironically",
                                  "timestamp": "2022-04-14 05:19:54",
                                  "score": 7,
                                  "num_children": 0,
                                  "author": 223684,
                                  "replies": []
                                },
                                {
                                  "id": "i4lrbl5",
                                  "text": "Alright what do you think he means when he refers to gay marriage proponents as \"cultural Marxists\"?\n\nIts not entirely his fault, all of academia is like this.  He just went a little nuts when Canada said you can't fire someone for being trans, and then even more nuts when people threw confetti on him.",
                                  "timestamp": "2022-04-13 19:18:16",
                                  "score": -1,
                                  "num_children": 2,
                                  "author": 310893,
                                  "replies": [
                                    {
                                      "id": "i4lten7",
                                      "text": "[deleted]",
                                      "timestamp": "2022-04-13 19:33:01",
                                      "score": 17,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "i4luoye",
                                          "text": ">  it's not complicated\n\n>The terminology originates from the fact that woke ideology is \"waking a critical consciousness\", which is in reference to critical theory, which is a philosophical framework originated by Foucault and other postmodernist...\n\nlol\n\nAnd him thinking people like me are \"marxists\" just for rejecting the religious notion that same sex marriage is bad, that doesn't raise a major red flag for you?",
                                          "timestamp": "2022-04-13 19:41:27",
                                          "score": 1,
                                          "num_children": 2,
                                          "author": 310893,
                                          "replies": [
                                            {
                                              "id": "i4lveu2",
                                              "text": "I haven't ever heard him say same sex marriage is bad, what he did say tho is that kids usually need a father and mother figure because they serve specific functions, and that we don't know if gay parents (two women or two men) could result in less \"prepared\" children than with heterosexual parents. I remember him saying that he's actually pro gay marriage tho",
                                              "timestamp": "2022-04-13 19:46:06",
                                              "score": 12,
                                              "num_children": 0,
                                              "author": 85799,
                                              "replies": []
                                            },
                                            {
                                              "id": "i4lv4d2",
                                              "text": "[deleted]",
                                              "timestamp": "2022-04-13 19:44:13",
                                              "score": -2,
                                              "num_children": 2,
                                              "replies": [
                                                {
                                                  "id": "i4ntb73",
                                                  "text": "Was nothing to do with the diet (which was meat not raw meat) and everything to do with benzo addiction.",
                                                  "timestamp": "2022-04-14 04:21:11",
                                                  "score": 5,
                                                  "num_children": 0,
                                                  "author": 161535,
                                                  "replies": []
                                                },
                                                {
                                                  "id": "i4nas7o",
                                                  "text": "His daughter has a medical condition and her health vastly improved with the diet of just meat. He tried to see if it would help him, and it obviously did not. No real flag there.",
                                                  "timestamp": "2022-04-14 01:47:00",
                                                  "score": 5,
                                                  "num_children": 0,
                                                  "author": 96077,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "i4nzhyx",
                                      "text": "Look, I'm not in the cult of Peterson, but that does have a real meaning.\n\nCultural marxism is the application of Marxist egalitarian ideas to the social sphere - the redistribution of *social capital* and a movement towards a society without hierarchy or stratification, similar to how Marx wanted an economically classless society.\n\nGiven that context, could one argue that gay marriage is a culturally Marxist initiative? You theoretically could, because it's an egalitarian measure for the purpose of leveling the social playing field, and providing rights that were formerly exclusive to child bearing couples. I don't know if that would be a *good* argument, but it could be made.\n\nWhether \"cultural Marxism\" exists is a separate discussion.",
                                      "timestamp": "2022-04-14 05:26:42",
                                      "score": 4,
                                      "num_children": 0,
                                      "author": 78057,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i4mlha6",
                      "text": "Peterson got on the scene in the early-mid 2010s when the Liberals weren't used to people trying to even question their bullshit. So when he gets asked incredibly easy questions like \"Why does your right to free speech supercede my right to not get offended,\" he literally only needs two brain cells to slaughter her and claim all the clout in the world.\n\nDebates aren't nearly that easy anymore, especially when the liberals have learned how to frame arguments so as to be completely unfair and disingenuous.",
                      "timestamp": "2022-04-13 22:42:12",
                      "score": 13,
                      "num_children": 1,
                      "author": 70545,
                      "replies": [
                        {
                          "id": "i4oxeie",
                          "text": "Because conservatives are just so consistent and always have solid evidence for their claims, right?",
                          "timestamp": "2022-04-14 12:27:39",
                          "score": 0,
                          "num_children": 1,
                          "author": 244440,
                          "replies": [
                            {
                              "id": "i4reur7",
                              "text": "Show me one conservative that dodges questions to the degree Justin Trudeau does. Him and his ilk know exactly how to frame the discussion so as to make themselves the pillars of justice which immediately torpedoes any potential debate.\n\nIm not claiming that conservatives are smarter. And conservatives are actually unfair as well when they evoke God to win arguments. But the liberals are on a completely different level.",
                              "timestamp": "2022-04-14 22:40:29",
                              "score": 2,
                              "num_children": 0,
                              "author": 70545,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i4lnrzp",
                      "text": "Lmao. Read his book sometime. He talks a lot of good points. Or watch his old lectures. He does talk good shit.\n\nI would agree though, most of his clips are either out of context or sometimes he is digressing like a-slur.",
                      "timestamp": "2022-04-13 18:54:50",
                      "score": 16,
                      "num_children": 2,
                      "author": 361097,
                      "replies": [
                        {
                          "id": "i4lr3js",
                          "text": "The guy refers to people who want gay marriage to be legal as \"cultural marxists\".  He's a nutter.",
                          "timestamp": "2022-04-13 19:16:34",
                          "score": -6,
                          "num_children": 2,
                          "author": 310893,
                          "replies": [
                            {
                              "id": "i4lth2h",
                              "text": "[deleted]",
                              "timestamp": "2022-04-13 19:33:28",
                              "score": 15,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "i4luht4",
                                  "text": "Person with a nutter opinion is a nutter.  \"Unpopular\" could mean anything from \"Captain Janeway is the best Star Trek captain\" to \"I think gay people are sinners and shouldn't be allowed human rights\".",
                                  "timestamp": "2022-04-13 19:40:11",
                                  "score": -3,
                                  "num_children": 1,
                                  "author": 310893,
                                  "replies": [
                                    {
                                      "id": "i4lwd8k",
                                      "text": "[deleted]",
                                      "timestamp": "2022-04-13 19:52:15",
                                      "score": 15,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "i4m6is1",
                                          "text": ">Similar to what you said, there's a world of difference between \"I think people are pushing too aggressively for gay rights\" and \"I think gay people should be denied human rights.\"\n\nAt best, there's a very small difference between those two. If you claim to like a thing but think people are trying too hard to make it happen, you certainly don't like it very much, or think that it's particularly important.",
                                          "timestamp": "2022-04-13 21:00:51",
                                          "score": -4,
                                          "num_children": 2,
                                          "author": 404297,
                                          "replies": [
                                            {
                                              "id": "i4mbyb0",
                                              "text": "[deleted]",
                                              "timestamp": "2022-04-13 21:36:27",
                                              "score": 3,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "i4mwcno",
                                                  "text": "There is not, however, a big difference between harming and *saying that others should help less.*",
                                                  "timestamp": "2022-04-14 00:01:59",
                                                  "score": 2,
                                                  "num_children": 0,
                                                  "author": 404297,
                                                  "replies": []
                                                }
                                              ]
                                            },
                                            {
                                              "id": "i4nbi36",
                                              "text": ">At best, there's a very small difference between those two.\n\nLol you are a dipshit.",
                                              "timestamp": "2022-04-14 01:52:20",
                                              "score": 1,
                                              "num_children": 0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "i4ls4gl",
                              "text": "Schizo moment.",
                              "timestamp": "2022-04-13 19:24:17",
                              "score": 14,
                              "num_children": 1,
                              "author": 361097,
                              "replies": [
                                {
                                  "id": "i4lv1ta",
                                  "text": "Yeah benzo addiction will literally do that to you.",
                                  "timestamp": "2022-04-13 19:43:45",
                                  "score": -2,
                                  "num_children": 1,
                                  "author": 310893,
                                  "replies": [
                                    {
                                      "id": "i4lxmmi",
                                      "text": "Well, you'd know.",
                                      "timestamp": "2022-04-13 20:01:51",
                                      "score": 11,
                                      "num_children": 1,
                                      "author": 361097,
                                      "replies": [
                                        {
                                          "id": "i4lymh8",
                                          "text": "No Joshua, and I'm only saying that because you sound like a Joshua, I am referring to the esteemed Doctor Pill Poppin Peterson over here.",
                                          "timestamp": "2022-04-13 20:08:54",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 310893,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i4mnsh8",
                          "text": "Nah, he's a moron which explains why the right loves him",
                          "timestamp": "2022-04-13 22:58:46",
                          "score": -5,
                          "num_children": 0,
                          "author": 107346,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4lwjkq",
              "text": "Seems like your doctor knows more than you about this.",
              "timestamp": "2022-04-13 19:53:23",
              "score": 3,
              "num_children": 1,
              "author": 111133,
              "replies": [
                {
                  "id": "i4lwq7e",
                  "text": "I know this is /r/4chan but you guys have to realize that Peterson is retarded at best and evil at worst, right?",
                  "timestamp": "2022-04-13 19:54:40",
                  "score": -1,
                  "num_children": 2,
                  "author": 310893,
                  "replies": [
                    {
                      "id": "i4m9agq",
                      "text": "Evil?",
                      "timestamp": "2022-04-13 21:18:39",
                      "score": 9,
                      "num_children": 0,
                      "author": 181473,
                      "replies": []
                    },
                    {
                      "id": "i4mbh5t",
                      "text": "Do you mean Objectively Right about everything?",
                      "timestamp": "2022-04-13 21:33:17",
                      "score": 8,
                      "num_children": 1,
                      "author": 111133,
                      "replies": [
                        {
                          "id": "i4mlo2t",
                          "text": "Yes that's how they talk about Marx, like a cult leader",
                          "timestamp": "2022-04-13 22:43:34",
                          "score": 2,
                          "num_children": 0,
                          "author": 310893,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i4oar1j",
          "text": "That edit should get you banned",
          "timestamp": "2022-04-14 07:52:36",
          "score": 2,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i4ptvw4",
          "text": "> but people fighting for freedom\n\nYou mean Russia?",
          "timestamp": "2022-04-14 16:17:39",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "i4pu980",
              "text": "Depends on your definition of freedom.",
              "timestamp": "2022-04-14 16:20:07",
              "score": 1,
              "num_children": 0,
              "author": 165122,
              "replies": []
            }
          ]
        },
        {
          "id": "i4nwfjq",
          "text": "kek'd",
          "timestamp": "2022-04-14 04:52:57",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i7h616a",
          "text": "Fuck freedom fighters.",
          "timestamp": "2022-05-05 21:19:48",
          "score": 0,
          "num_children": 0,
          "author": 77557,
          "replies": []
        }
      ]
    },
    {
      "id": "i4kej27",
      "text": "Big brain time doctor.\n\nGotta say, she trolled him hard.",
      "timestamp": "2022-04-13 14:03:49",
      "score": 33,
      "num_children": 0,
      "author": 246325,
      "replies": []
    },
    {
      "id": "i4kwnnc",
      "text": "*Plays \"all you need is love\"*",
      "timestamp": "2022-04-13 16:03:00",
      "score": 7,
      "num_children": 0,
      "author": 51105,
      "replies": []
    },
    {
      "id": "i4l1c24",
      "text": "Anon has a clean room and every girl he goes out with doesn’t know weather they like him or not so he ends up being lonely after months of investing onto several different women",
      "timestamp": "2022-04-13 16:32:43",
      "score": 6,
      "num_children": 0,
      "author": 291002,
      "replies": []
    },
    {
      "id": "i4kw8fy",
      "text": "She cannot comprehend that for men it doesnt take 20s to find a partner",
      "timestamp": "2022-04-13 16:00:18",
      "score": 17,
      "num_children": 0,
      "author": 348306,
      "replies": []
    },
    {
      "id": "i4l131b",
      "text": "> get a girlfriend\n\nYeah, this is bad advice, anon needs a BEAR stat!",
      "timestamp": "2022-04-13 16:31:09",
      "score": 5,
      "num_children": 0,
      "author": 154225,
      "replies": []
    },
    {
      "id": "i4nuhpw",
      "text": "Not surprised. Some doctors seem like they didn’t even go to school. You can totally get someone who has no clue what they’re doing. Or actually get someone who cares it’s luck of the draw.",
      "timestamp": "2022-04-14 04:32:57",
      "score": 4,
      "num_children": 0,
      "author": 407603,
      "replies": []
    },
    {
      "id": "i4kgsf2",
      "text": "I’m no expert at all but cleaning your room and keeping it this way can actually help some people to get at least a bit better right?",
      "timestamp": "2022-04-13 14:19:27",
      "score": 43,
      "num_children": 3,
      "replies": [
        {
          "id": "i4ky2qp",
          "text": "If a patient is experiencing very mild, short-term depressive symptoms, that part's not bad advice (get a girlfriend kinda is).\n\nIf someone's been struggling with severe, diagnosed depression for 7 years, it's godawful advice that they've likely been told by random laypeople constantly for years.",
          "timestamp": "2022-04-13 16:12:11",
          "score": 32,
          "num_children": 1,
          "author": 260722,
          "replies": [
            {
              "id": "i4l2aze",
              "text": "Maybe they should try listening to it then.",
              "timestamp": "2022-04-13 16:38:51",
              "score": -3,
              "num_children": 4,
              "replies": [
                {
                  "id": "i4m7mrq",
                  "text": "You do realize that depression is a clinical diagnosis and research has found it implies structural and chemical imbalances in the brain right?\n\nDepression for 7 years isn't just being \"sad\"...",
                  "timestamp": "2022-04-13 21:07:54",
                  "score": 4,
                  "num_children": 0,
                  "author": 299289,
                  "replies": []
                },
                {
                  "id": "i4l84ro",
                  "text": "Even if it would work, which I doubt, his mental illness may prevent him from achieving it in the first place. In that case, the advice is about as helpful as \"snap out of it\" or \"just get better\". Yeah, if he could do that, it would work.",
                  "timestamp": "2022-04-13 17:15:38",
                  "score": 5,
                  "num_children": 0,
                  "author": 405836,
                  "replies": []
                },
                {
                  "id": "i4m4rhf",
                  "text": "\"The only reason my garbage advice is not working for you is because you're not listening!!!!!\"",
                  "timestamp": "2022-04-13 20:49:38",
                  "score": 3,
                  "num_children": 0,
                  "author": 330241,
                  "replies": []
                },
                {
                  "id": "i4mj8gf",
                  "text": "That's like telling a fucking idiot like you to just get smarter",
                  "timestamp": "2022-04-13 22:26:08",
                  "score": 1,
                  "num_children": 0,
                  "author": 335298,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4kosrr",
          "text": "It's like putting on a bandaid over a bullet wound instead of going to the hospital.",
          "timestamp": "2022-04-13 15:12:24",
          "score": 31,
          "num_children": 1,
          "author": 266663,
          "replies": [
            {
              "id": "i4ks7m6",
              "text": "If even going to the hospital doesn't help, then band aid is the only way, if you exclude rope",
              "timestamp": "2022-04-13 15:34:28",
              "score": 9,
              "num_children": 0,
              "author": 356639,
              "replies": []
            }
          ]
        },
        {
          "id": "i4lqgb1",
          "text": "Yeah. That's what the phrase means.\n\nUsually it's good enough to get started and build some momentum up.",
          "timestamp": "2022-04-13 19:12:16",
          "score": 1,
          "num_children": 0,
          "author": 361097,
          "replies": []
        }
      ]
    },
    {
      "id": "i4khemn",
      "text": ">regularly seeing male doctor for 7 years\n\n>depression for all 7 years\n\n>get new doctor, gives different advice\n\n>\"LMAO that would never work. The old guy knew better\"\n\nFake and tarded.",
      "timestamp": "2022-04-13 14:23:36",
      "score": 213,
      "num_children": 5,
      "author": 277804,
      "replies": [
        {
          "id": "i4la6hw",
          "text": ">Depression **which he had gotten over** for 7 years is acting up.\n\nNeed a literacy test on this fucking site jesus.",
          "timestamp": "2022-04-13 17:28:41",
          "score": 81,
          "num_children": 2,
          "author": 173169,
          "replies": [
            {
              "id": "i4lrkz2",
              "text": "Might wanna reread that…\n\n>\tDepression which I got for over 7 years acting up big time\n\nAka, has had it for the past 7 years and is worse at that moment",
              "timestamp": "2022-04-13 19:20:24",
              "score": 36,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i4lajhd",
              "text": ">i got over it\n\n>I'm still affected by it\n\nLiteracy test indeed, but not for me",
              "timestamp": "2022-04-13 17:30:57",
              "score": -1,
              "num_children": 1,
              "author": 277804,
              "replies": [
                {
                  "id": "i4ldact",
                  "text": "Oh, you're just regular stupid.\n\nDepression is like type 1 diabetes or herpes in that you can treat/manage it but it doesn't have a permanent cure. Hence, symptoms can crop back up later.\n\nThis would mean that he was not seeing symptoms of his depression for seven years, but when those symptoms did come back, he went to doctor and got substitute woman doctor.\n\nReading is hard.",
                  "timestamp": "2022-04-13 17:48:18",
                  "score": 9,
                  "num_children": 1,
                  "author": 173169,
                  "replies": [
                    {
                      "id": "i4ljapx",
                      "text": "Lol \n\nImagine typing all that out thinking I would take psychology advice/education from a random guy on 4chan...\n\nDepression is permanent. TIL.",
                      "timestamp": "2022-04-13 18:26:22",
                      "score": -1,
                      "num_children": 2,
                      "author": 277804,
                      "replies": [
                        {
                          "id": "i4ln8qp",
                          "text": "You could google permanent cure for depression if you don't believe me. No skin off my back.",
                          "timestamp": "2022-04-13 18:51:23",
                          "score": 2,
                          "num_children": 0,
                          "author": 173169,
                          "replies": []
                        },
                        {
                          "id": "i4mb485",
                          "text": "Here’s one then :)\nDoing a masters in pharmacy\nIt’s manageable but there is no cure",
                          "timestamp": "2022-04-13 21:30:49",
                          "score": 2,
                          "num_children": 1,
                          "author": 53335,
                          "replies": [
                            {
                              "id": "i4mn465",
                              "text": "Not even cleaning your room and getting a girlfriend?",
                              "timestamp": "2022-04-13 22:53:56",
                              "score": 0,
                              "num_children": 1,
                              "author": 277804,
                              "replies": [
                                {
                                  "id": "i4mnmqc",
                                  "text": "A girlfriend is just going to be extra stress to some people and is not the miracle cure you think it is",
                                  "timestamp": "2022-04-13 22:57:38",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 53335,
                                  "replies": [
                                    {
                                      "id": "i4mt2pq",
                                      "text": "First psychology advice, and now girlfriend advice from 4chan?\n\nI'm pretty much set for life!",
                                      "timestamp": "2022-04-13 23:37:43",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 277804,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i4l7b4s",
          "text": "For many people, managing the depression is the best they can hope for.",
          "timestamp": "2022-04-13 17:10:18",
          "score": 11,
          "num_children": 0,
          "author": 405836,
          "replies": []
        },
        {
          "id": "i4ld9gs",
          "text": "Depression doesn't just go away for some people. They've probably been managing it for the last 7 years.",
          "timestamp": "2022-04-13 17:48:09",
          "score": 10,
          "num_children": 0,
          "author": 311166,
          "replies": []
        },
        {
          "id": "i4o7ei7",
          "text": "\\^ said someone who knows nothing about the human predicament.",
          "timestamp": "2022-04-14 07:06:00",
          "score": 5,
          "num_children": 1,
          "replies": [
            {
              "id": "i4p8vvm",
              "text": "Sir, this is 4chan...",
              "timestamp": "2022-04-14 13:57:48",
              "score": -1,
              "num_children": 1,
              "author": 277804,
              "replies": [
                {
                  "id": "i4p91ey",
                  "text": "And reddit on top of that",
                  "timestamp": "2022-04-14 13:58:54",
                  "score": 5,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4kinzo",
          "text": "Yeah he's actually getting the right advice here.",
          "timestamp": "2022-04-13 14:32:00",
          "score": 17,
          "num_children": 4,
          "author": 369901,
          "replies": [
            {
              "id": "i4kv819",
              "text": "illustration of her advice:\n\nhttps://m.imgur.com/gallery/RadSf",
              "timestamp": "2022-04-13 15:53:51",
              "score": 89,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i4m4iiz",
              "text": "Homeless? Just get a house!",
              "timestamp": "2022-04-13 20:48:02",
              "score": 11,
              "num_children": 0,
              "author": 330241,
              "replies": []
            },
            {
              "id": "i4l63d6",
              "text": "“Get a gf”\nLol. “right advice” If having a clean room is all you think one needs for a girlfriend then you’re dumb as hell",
              "timestamp": "2022-04-13 17:02:31",
              "score": 46,
              "num_children": 1,
              "author": 396399,
              "replies": [
                {
                  "id": "i4l6qvx",
                  "text": "[deleted]",
                  "timestamp": "2022-04-13 17:06:43",
                  "score": -3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i4ldrld",
                      "text": "Bro she has no fucking clue if his room is even clean",
                      "timestamp": "2022-04-13 17:51:20",
                      "score": 12,
                      "num_children": 1,
                      "author": 396399,
                      "replies": [
                        {
                          "id": "i4lh0ic",
                          "text": "tbf he might have said something like “my life is pretty messy right now, haven’t cleaned recently.” the first part of her advice was fine, it’s the tonedeafness of telling him to just get a girlfriend that’s unbelievable",
                          "timestamp": "2022-04-13 18:11:50",
                          "score": 7,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i4lkycl",
                              "text": "Yeah he might’ve but we have no way to assume based off just this post, maybe people with depression don’t clean their room but it’s probably not all of them",
                              "timestamp": "2022-04-13 18:36:45",
                              "score": 4,
                              "num_children": 0,
                              "author": 396399,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i4l9k05",
              "text": "[just get a girlfriend you incel ](https://i.imgur.com/gM5HTvl.jpg)",
              "timestamp": "2022-04-13 17:24:45",
              "score": 13,
              "num_children": 0,
              "author": 393545,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i4l2og7",
      "text": "never EVER go to a female mental doctor. They just don't understand the male struggles. She says \"just get a gf\" because to females, it's literally their choice if they are single or not. They can get a bf anytime they want. And they think that it works the other way around too.",
      "timestamp": "2022-04-13 16:41:12",
      "score": 12,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i4lgego",
      "text": "Girlfriend magically heals neurotransmitter disorder with very presence. Clothes on bedroom floor actually inhibiting chemical receptor sites in neurons. Damn modern medical science is fuckin nuts, new doctor is killin it",
      "timestamp": "2022-04-13 18:07:50",
      "score": 3,
      "num_children": 1,
      "author": 253018,
      "replies": [
        {
          "id": "i4lqukn",
          "text": "CBT? fuck that, all you need is a desperate overweight single mother of 2, covered in tats. That'll fix you right up, if by fix I mean you finally put the shotgun in your mouth",
          "timestamp": "2022-04-13 19:14:50",
          "score": 5,
          "num_children": 0,
          "author": 310412,
          "replies": []
        }
      ]
    },
    {
      "id": "i4lu69l",
      "text": "Got mad depressed in high school. Started working out, went to college and did well for some time, had a good friend group, read a new book every month, picked up a new instrument. Was in the best place of my life but never felt like I deserved any of it. The advice isn't useless but it won't help everyone",
      "timestamp": "2022-04-13 19:38:07",
      "score": 4,
      "num_children": 1,
      "replies": [
        {
          "id": "i4nyic7",
          "text": "same here. do you remember feeling like you were the extra one everywhere?",
          "timestamp": "2022-04-14 05:15:34",
          "score": 1,
          "num_children": 1,
          "author": 69466,
          "replies": [
            {
              "id": "i4o0g2s",
              "text": "Yeah I always felt like a stranger in a close friend group I was in for several years",
              "timestamp": "2022-04-14 05:37:44",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i4klcla",
      "text": "I had an anxiety attack, to the point I hyperventilated and was literally seizing up, I also had psoriasis on my leg, ie a big rash.. I had never been diagnosed with anxiety or psoriasis, the ER doctor told me to Chill out and change my socks daily and handed me a bill for $1000… Fucking THANNNNKKKSSSS",
      "timestamp": "2022-04-13 14:49:35",
      "score": 18,
      "num_children": 0,
      "author": 333141,
      "replies": []
    },
    {
      "id": "i4kafgy",
      "text": "mach dein raum sauber und finde dir eine freunding\n\nso einfach is es",
      "timestamp": "2022-04-13 13:34:16",
      "score": 24,
      "num_children": 2,
      "replies": [
        {
          "id": "i4ko7ty",
          "text": "Aber es ist nicht so einfach.",
          "timestamp": "2022-04-13 15:08:29",
          "score": 10,
          "num_children": 1,
          "author": 297716,
          "replies": [
            {
              "id": "i4kudnd",
              "text": "Fict mein ash digga",
              "timestamp": "2022-04-13 15:48:28",
              "score": 7,
              "num_children": 0,
              "author": 70248,
              "replies": []
            }
          ]
        },
        {
          "id": "i4obqag",
          "text": "Was ist ein freunding?",
          "timestamp": "2022-04-14 08:06:11",
          "score": 1,
          "num_children": 1,
          "author": 382900,
          "replies": [
            {
              "id": "i4oer23",
              "text": "Should of been freundin, am retarded 🤷",
              "timestamp": "2022-04-14 08:49:09",
              "score": 4,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i4kvee2",
      "text": "\"Oh you are poor? Just get rich!\"",
      "timestamp": "2022-04-13 15:54:58",
      "score": 7,
      "num_children": 0,
      "author": 318165,
      "replies": []
    },
    {
      "id": "i4lidqk",
      "text": "Am i the only one thinking getting a gf ,,just“ because your depressed or as means to help with your depression is kind of….mean?\nLike imagine your gf asking why you approached her and you‘re just like: \n,, i had/have depression and you looked like you‘d take me, so I used you to cure my illness“",
      "timestamp": "2022-04-13 18:20:32",
      "score": 6,
      "num_children": 0,
      "author": 407691,
      "replies": []
    },
    {
      "id": "i4kpmfu",
      "text": "He had a simple case of semen overload.  The doctor could have taken care of that with any of four in-patient procedures, or five, if you include in-between the tits.  The room cleaning part is mostly for if she makes house calls.  Be sure to ask her if she uses subcontracting proxies, that can save a lot of money, but at the cost of a substantial decline in quality.",
      "timestamp": "2022-04-13 15:17:45",
      "score": 3,
      "num_children": 0,
      "author": 96197,
      "replies": []
    },
    {
      "id": "i4l4itp",
      "text": "Oh sure let me just go to the gf store and get one. Why didnt I think of that. So thankful for the docs guidance",
      "timestamp": "2022-04-13 16:52:37",
      "score": 3,
      "num_children": 0,
      "author": 114852,
      "replies": []
    },
    {
      "id": "i4lnjnr",
      "text": "I love all the ppl here diagnosing themselves with depression giving advice.",
      "timestamp": "2022-04-13 18:53:19",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i4mlpgb",
      "text": "\\>Uses 4chan  \n\\>Needs to get GF\n\njesus christ you could have just told him it was incurable you didn't need to taunt him like that.",
      "timestamp": "2022-04-13 22:43:51",
      "score": 3,
      "num_children": 0,
      "author": 306670,
      "replies": []
    },
    {
      "id": "i4kjcyi",
      "text": "> almost laughed\n\nSounds like she helped tbh.",
      "timestamp": "2022-04-13 14:36:35",
      "score": 7,
      "num_children": 1,
      "author": 164805,
      "replies": [
        {
          "id": "i4lxxlw",
          "text": "Almost laughed, but depression. Cried intead.",
          "timestamp": "2022-04-13 20:04:03",
          "score": 3,
          "num_children": 0,
          "author": 48328,
          "replies": []
        }
      ]
    },
    {
      "id": "i4kbmb3",
      "text": "sie hat recht",
      "timestamp": "2022-04-13 13:43:07",
      "score": 21,
      "num_children": 2,
      "author": 226406,
      "replies": [
        {
          "id": "i4kd7xg",
          "text": "Frauen haben nie recht",
          "timestamp": "2022-04-13 13:54:34",
          "score": 39,
          "num_children": 1,
          "replies": [
            {
              "id": "i4kf59u",
              "text": "Basiert und rotgepillt",
              "timestamp": "2022-04-13 14:08:13",
              "score": 41,
              "num_children": 2,
              "author": 304810,
              "replies": [
                {
                  "id": "i4kprt7",
                  "text": "Hallo. Ich lerne Deutsch. Es ist sehr hässlich und einfach. Auf wiedersehen.",
                  "timestamp": "2022-04-13 15:18:45",
                  "score": 5,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "i4ko312",
                  "text": "Es ist Zeit für Reich!",
                  "timestamp": "2022-04-13 15:07:36",
                  "score": 0,
                  "num_children": 0,
                  "author": 353038,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4koewo",
          "text": "Ich bin ein leidehosen",
          "timestamp": "2022-04-13 15:09:50",
          "score": 1,
          "num_children": 0,
          "author": 245320,
          "replies": []
        }
      ]
    },
    {
      "id": "i4ko69m",
      "text": "Well, did OP clean his room?",
      "timestamp": "2022-04-13 15:08:11",
      "score": 2,
      "num_children": 0,
      "author": 233611,
      "replies": []
    },
    {
      "id": "i4ku41l",
      "text": ">almost laugh\n\nAnon it might have worked",
      "timestamp": "2022-04-13 15:46:46",
      "score": 2,
      "num_children": 0,
      "author": 70248,
      "replies": []
    },
    {
      "id": "i4mzbbb",
      "text": "This is fake, doctors don't get sick",
      "timestamp": "2022-04-14 00:23:42",
      "score": 2,
      "num_children": 0,
      "author": 12334,
      "replies": []
    },
    {
      "id": "i4nnrzt",
      "text": "Glad this guy was stable enough to realize that was terrible advice and not to take it seriously. That would’ve sent me on a big downward spiral.",
      "timestamp": "2022-04-14 03:30:33",
      "score": 2,
      "num_children": 0,
      "author": 135864,
      "replies": []
    },
    {
      "id": "i4obmjn",
      "text": "As if any girl would want a depressed boyfriend...",
      "timestamp": "2022-04-14 08:04:45",
      "score": 2,
      "num_children": 0,
      "author": 382900,
      "replies": []
    },
    {
      "id": "i4oi271",
      "text": "I've had a girlfriend and a boyfriend, I've changed my room up to make it look better, it doesn't get better anons. The only thing you can really do is keep going with the hope in your mind that one day it will.",
      "timestamp": "2022-04-14 09:36:04",
      "score": 2,
      "num_children": 0,
      "author": 240701,
      "replies": []
    },
    {
      "id": "i4klvah",
      "text": "tfw no gf should be classified as a mental disease. \n\nJust so we could lock those losers up away from society. \n\nIt would literally improve society.",
      "timestamp": "2022-04-13 14:52:59",
      "score": 11,
      "num_children": 1,
      "replies": [
        {
          "id": "i4laacb",
          "text": "Are you rhubarbed",
          "timestamp": "2022-04-13 17:29:21",
          "score": 9,
          "num_children": 1,
          "author": 85517,
          "replies": [
            {
              "id": "i4lahbz",
              "text": "You are such a turnip",
              "timestamp": "2022-04-13 17:30:34",
              "score": -1,
              "num_children": 1,
              "replies": [
                {
                  "id": "i4lavh9",
                  "text": "Im more of a potato",
                  "timestamp": "2022-04-13 17:33:02",
                  "score": 2,
                  "num_children": 0,
                  "author": 85517,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i4kf4q3",
      "text": "Most men’s depression is from lack of sex/female companionship. That said “get a girlfriend” is easier said than done for most.",
      "timestamp": "2022-04-13 14:08:07",
      "score": 18,
      "num_children": 9,
      "author": 205643,
      "replies": [
        {
          "id": "i4kj9cq",
          "text": "\n>Most men’s depression is from lack of sex/female companionship\n\nLmao",
          "timestamp": "2022-04-13 14:35:55",
          "score": 53,
          "num_children": 1,
          "author": 229198,
          "replies": [
            {
              "id": "i4mb9fd",
              "text": "Most men's depression is from being overburdened by the weight of responsibility coupled with terrible coping mechanisms and a lack of community empathy, shitty learned behaviors when it comes to emotional expression, and an environment that encourages people to become insular when dealing with life's problems.\n\nThe sex and relationship part is a symptom not the underlying problem.",
              "timestamp": "2022-04-13 21:31:48",
              "score": 32,
              "num_children": 1,
              "author": 326605,
              "replies": [
                {
                  "id": "i4ntl03",
                  "text": "I think the chart where women say that over 85 percent of men are less than average in attractiveness says a lot about how it feels to be a guy in the dating world.",
                  "timestamp": "2022-04-14 04:23:52",
                  "score": 13,
                  "num_children": 1,
                  "author": 265774,
                  "replies": [
                    {
                      "id": "i4o7rqj",
                      "text": "It's a cursed and endless cycle, which stemmed from men's fault.",
                      "timestamp": "2022-04-14 07:11:00",
                      "score": -4,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i4lgcnx",
          "text": "Wtf is this nonsense. Most men's depression is from everyone not giving a shit about them, just like that doctor",
          "timestamp": "2022-04-13 18:07:31",
          "score": 8,
          "num_children": 0,
          "author": 130518,
          "replies": []
        },
        {
          "id": "i4lrg66",
          "text": "> Most men’s depression is from lack of sex/female companionship\n\nI don't think so. There are many married men who are depressed as shit.\n\nI think the core of depression is being surrounded by people who are toxic to you. People are the mirrors we look into. If most people in your life beat you down even if you're doing good, then yeah, nothing can make you happy. \n\nI think for men, going to gym or sports is generally a very good way to build relationships that are good and uplifting. There are a-slurs in these spaces, but they announce themselves the first day you'll meet them, so yeah avoid them.",
          "timestamp": "2022-04-13 19:19:19",
          "score": 7,
          "num_children": 2,
          "author": 361097,
          "replies": [
            {
              "id": "i4lzq1r",
              "text": "If it weren't for sports I'd probably have killed myself by now.",
              "timestamp": "2022-04-13 20:16:21",
              "score": 4,
              "num_children": 0,
              "author": 276609,
              "replies": []
            },
            {
              "id": "i4m5fle",
              "text": "Because a lot of men have shit wives that don’t sleep with them and don’t cook.",
              "timestamp": "2022-04-13 20:53:53",
              "score": 6,
              "num_children": 0,
              "author": 205643,
              "replies": []
            }
          ]
        },
        {
          "id": "i4kgrnt",
          "text": "It becomes a mixed problem at some point. Your life isn't in order, you get depressed (wich is a normal reaction from your brain when shit goes down), you don't fix your life, you are depressed for so long your neutrotransmitters start acting up and your depression becomes partially induced by your own brain. \n\nTaking meds can alleviate the organic part of your depression and at least partially take you out of your hole so you can gather enough courage to deal with the behavior-induced part",
          "timestamp": "2022-04-13 14:19:19",
          "score": 28,
          "num_children": 1,
          "replies": [
            {
              "id": "i4ki6rj",
              "text": "Meds are for the people that have their lives in order but the chemicals aren’t working properly. If you’re alone all the time and don’t have sex that often of course you’ll be depressed",
              "timestamp": "2022-04-13 14:28:49",
              "score": 12,
              "num_children": 2,
              "author": 205643,
              "replies": [
                {
                  "id": "i4kq9pb",
                  "text": "I'm guessing you are well researched in depression studies and not pulling this out of your ass",
                  "timestamp": "2022-04-13 15:21:56",
                  "score": 11,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "i4kzs5d",
                      "text": "I just completely believe every comment I read on the internet, it makes things more fun.",
                      "timestamp": "2022-04-13 16:22:58",
                      "score": 13,
                      "num_children": 0,
                      "author": 410027,
                      "replies": []
                    },
                    {
                      "id": "i4m3p95",
                      "text": "feeling like you are never good enough, and \"failing\" compared to everyone around you is something that often can lead to depression. Who'd have thought?",
                      "timestamp": "2022-04-13 20:42:39",
                      "score": 1,
                      "num_children": 0,
                      "author": 401576,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i4liphv",
                  "text": "Reread my comment. A depressive state induced by not having your life in order will, if endured long enough, fuck up your neural metabolism.",
                  "timestamp": "2022-04-13 18:22:36",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i4kiczi",
          "text": "Those things can be important but I guarantee you if you are miserable and then get a girlfriend, you'll just be miserable with a girlfriend (and maybe even more miserable since this mindset lends itself to extreme codependency)",
          "timestamp": "2022-04-13 14:29:59",
          "score": 29,
          "num_children": 3,
          "author": 58081,
          "replies": [
            {
              "id": "i4mbgbu",
              "text": "Seriously. No relationship is going to suddenly make you not depressed. Its just going to add more stress.",
              "timestamp": "2022-04-13 21:33:07",
              "score": 2,
              "num_children": 0,
              "author": 326605,
              "replies": []
            },
            {
              "id": "i4kogoj",
              "text": "Depends on the reasons tbh",
              "timestamp": "2022-04-13 15:10:10",
              "score": 3,
              "num_children": 0,
              "author": 205643,
              "replies": []
            },
            {
              "id": "i4kouye",
              "text": "That's so not true.",
              "timestamp": "2022-04-13 15:12:47",
              "score": -3,
              "num_children": 0,
              "author": 13162,
              "replies": []
            }
          ]
        },
        {
          "id": "i4kus78",
          "text": "I think it’s just a lack of intimate and meaningful relationships. Man or woman",
          "timestamp": "2022-04-13 15:51:01",
          "score": 12,
          "num_children": 1,
          "author": 368985,
          "replies": [
            {
              "id": "i4le4ss",
              "text": "I agree with you tbh. Having good relationships with friends seemed to fix all my emotional issues pretty quickly.",
              "timestamp": "2022-04-13 17:53:35",
              "score": 7,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i4kok7x",
          "text": "Being physically strong fixes about 50% of it and allows you to fix the other 50%.\n\nBeing a physical disaster will guarantee you never improve.",
          "timestamp": "2022-04-13 15:10:49",
          "score": 3,
          "num_children": 1,
          "author": 245320,
          "replies": [
            {
              "id": "i4kqcu6",
              "text": "You can be strong but if you don’t have what people want you won’t get those results. Lots of sad people in bodybuilding",
              "timestamp": "2022-04-13 15:22:30",
              "score": 12,
              "num_children": 1,
              "author": 205643,
              "replies": [
                {
                  "id": "i4kxl4u",
                  "text": "Yup, it's on you to do the other 50%.\n\nBut if you are a fat greasy slob, you probably won't ever feel good enough to do that last 50%.",
                  "timestamp": "2022-04-13 16:09:01",
                  "score": 3,
                  "num_children": 1,
                  "author": 245320,
                  "replies": [
                    {
                      "id": "i4lzqo7",
                      "text": "I know fat fucks that just pay for it or are popular because they are rich. I get your overall point though",
                      "timestamp": "2022-04-13 20:16:28",
                      "score": 2,
                      "num_children": 0,
                      "author": 205643,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i4liyil",
          "text": "worst take I've ever seen",
          "timestamp": "2022-04-13 18:24:12",
          "score": 1,
          "num_children": 0,
          "author": 168274,
          "replies": []
        },
        {
          "id": "i4m64hu",
          "text": "Lol. How low is your standards for women, because thanks to online dating, all the fugly females are now not short of attention.",
          "timestamp": "2022-04-13 20:58:21",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i4kyrir",
      "text": ">Anon is depressed\n\n>Doktor tells him hilarious joke to cheer him up\n\n>Anon doesn't want to go to this doktor anymore",
      "timestamp": "2022-04-13 16:16:35",
      "score": 3,
      "num_children": 0,
      "author": 410027,
      "replies": []
    },
    {
      "id": "i4krkqe",
      "text": "At least do the clean your room part. It really isn’t that hard.",
      "timestamp": "2022-04-13 15:30:22",
      "score": 2,
      "num_children": 0,
      "author": 235301,
      "replies": []
    },
    {
      "id": "i4ke20v",
      "text": "She’s probably not wrong, too.",
      "timestamp": "2022-04-13 14:00:31",
      "score": 6,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i4khbjn",
      "text": "German Doctor Lady is based",
      "timestamp": "2022-04-13 14:23:02",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i4l8tos",
      "text": "men have 4 ways to get out of a depression. Find a girlfriend (impossible for you 4chan incels). Go to the gym (again, not for the 4chan weaklings). Get rich (yeah, no chance r3tards). Find God ( a good idea but 4chan mfs are unredeemable and will burn in hell)",
      "timestamp": "2022-04-13 17:20:04",
      "score": 3,
      "num_children": 1,
      "author": 279800,
      "replies": [
        {
          "id": "i4ly2gu",
          "text": "https://external-preview.redd.it/N_qXKzSkcyVjEojKcWPIBWHXCjERnv3A7Py6VHPpWBs.jpg?width=683&auto=webp&s=488e2afc136661e6c7cc85dd269d5a9ccdc7ff36",
          "timestamp": "2022-04-13 20:04:59",
          "score": 5,
          "num_children": 0,
          "author": 48328,
          "replies": []
        }
      ]
    },
    {
      "id": "i4kgogj",
      "text": "Based doctor",
      "timestamp": "2022-04-13 14:18:42",
      "score": -2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i4kwvcj",
      "text": "Maybe she was asking you out OP.",
      "timestamp": "2022-04-13 16:04:23",
      "score": 1,
      "num_children": 0,
      "author": 230400,
      "replies": []
    },
    {
      "id": "i4lhpw7",
      "text": "Literally had a therapist ask me if I ever heard of JBP. I laughed and walked out",
      "timestamp": "2022-04-13 18:16:19",
      "score": 1,
      "num_children": 0,
      "author": 111773,
      "replies": []
    },
    {
      "id": "i4nr1o8",
      "text": "He got the advice he needed, not the advice he wanted",
      "timestamp": "2022-04-14 03:59:38",
      "score": 1,
      "num_children": 0,
      "author": 338298,
      "replies": []
    },
    {
      "id": "i4kjowc",
      "text": "I mean u almost laughed isn't that the cure",
      "timestamp": "2022-04-13 14:38:47",
      "score": 0,
      "num_children": 0,
      "author": 190590,
      "replies": []
    },
    {
      "id": "i4l0g2n",
      "text": "She's right though. The thing you need the most with depression is a structured day and some feeling of accomplishment, which cleaning your room will bring.\n\nSecond best thing would be working out or doing some other kind of sports.",
      "timestamp": "2022-04-13 16:27:10",
      "score": -1,
      "num_children": 1,
      "replies": [
        {
          "id": "i4muy2i",
          "text": "Reading the top comments would make you think that that is basically a non option lmao. As someone with clinical depression. This is literally how most doctors start treatment. Convincing you that you can actually get better even if it isn't true. Creating a structure and framework for the future instead of believeing there is no way out. Pills only help as well if you are actively doing stuff to make them help. Fuck sake, antidepressants are basically a supplement. If you are in the head space of never getting better and never changing, antidepressants don't do shit",
          "timestamp": "2022-04-13 23:51:37",
          "score": 2,
          "num_children": 0,
          "author": 26565,
          "replies": []
        }
      ]
    },
    {
      "id": "i4kkexj",
      "text": "Thought it was Dictor at first",
      "timestamp": "2022-04-13 14:43:31",
      "score": 1,
      "num_children": 0,
      "author": 230467,
      "replies": []
    },
    {
      "id": "i4kl5nb",
      "text": "W\\*m\\*n Toxic\n\npick one",
      "timestamp": "2022-04-13 14:48:21",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i4kpt4g",
      "text": "Anon does not appreciate solutions",
      "timestamp": "2022-04-13 15:18:59",
      "score": 1,
      "num_children": 0,
      "author": 185850,
      "replies": []
    },
    {
      "id": "i4ks79y",
      "text": "based doctor",
      "timestamp": "2022-04-13 15:34:24",
      "score": 1,
      "num_children": 0,
      "author": 62514,
      "replies": []
    },
    {
      "id": "i4kt9vb",
      "text": "\\>clean your room \n\\>overbook dates with over three women, immerse yourself in a harem sim existence\nBuddy you can’t be serious you didn’t know this was the answer all along?",
      "timestamp": "2022-04-13 15:41:21",
      "score": 1,
      "num_children": 1,
      "author": 191633,
      "replies": [
        {
          "id": "i4l02vc",
          "text": ">4chan spacing",
          "timestamp": "2022-04-13 16:24:52",
          "score": 1,
          "num_children": 0,
          "author": 410027,
          "replies": []
        }
      ]
    },
    {
      "id": "i4kyyg2",
      "text": "Good advice.",
      "timestamp": "2022-04-13 16:17:49",
      "score": 1,
      "num_children": 0,
      "author": 37410,
      "replies": []
    },
    {
      "id": "i4l4bpb",
      "text": "God forbid you laugh…. That would have really shown her, wow\n\nWhat a beta",
      "timestamp": "2022-04-13 16:51:22",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i4l75zt",
      "text": "I love that I had to google exactly one German word to understand everything about this.",
      "timestamp": "2022-04-13 17:09:23",
      "score": 1,
      "num_children": 0,
      "author": 22979,
      "replies": []
    },
    {
      "id": "i4leupa",
      "text": "Dang Germany is based",
      "timestamp": "2022-04-13 17:58:03",
      "score": 1,
      "num_children": 0,
      "author": 48142,
      "replies": []
    },
    {
      "id": "i4lf2x2",
      "text": "Is that an offer doc?",
      "timestamp": "2022-04-13 17:59:28",
      "score": 1,
      "num_children": 0,
      "author": 653,
      "replies": []
    },
    {
      "id": "i4lfy6f",
      "text": "basiert",
      "timestamp": "2022-04-13 18:04:57",
      "score": 1,
      "num_children": 0,
      "author": 72840,
      "replies": []
    },
    {
      "id": "i4lmpt7",
      "text": "in before this actually can help a huge amount. most of you need to clean your room a month ago",
      "timestamp": "2022-04-13 18:48:03",
      "score": 1,
      "num_children": 0,
      "author": 131701,
      "replies": []
    },
    {
      "id": "i4lo33l",
      "text": "Is this woman Jordan Peterson?",
      "timestamp": "2022-04-13 18:56:50",
      "score": 1,
      "num_children": 0,
      "author": 353205,
      "replies": []
    },
    {
      "id": "i4lp1a9",
      "text": "love how he wrote \"vertretungs doctor\" cause he doesnt know the english word",
      "timestamp": "2022-04-13 19:03:00",
      "score": 1,
      "num_children": 0,
      "author": 405577,
      "replies": []
    },
    {
      "id": "i4lulgc",
      "text": "[removed]",
      "timestamp": "2022-04-13 19:40:50",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "i4luliw",
          "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```bitch```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
          "timestamp": "2022-04-13 19:40:51",
          "score": 0,
          "num_children": 1,
          "author": 184140,
          "replies": [
            {
              "id": "i4mo823",
              "text": "Wtf is this stupid shit",
              "timestamp": "2022-04-13 23:01:49",
              "score": 1,
              "num_children": 0,
              "author": 78382,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i4m50rg",
      "text": "Jesus Christ all your retarded incels make me wanna cut my wrist-thick dick off. Because nobody who publicly identifies as a MAN and not a boy uses the word “based” under any circumstances.\n\nGet a fucking job.",
      "timestamp": "2022-04-13 20:51:16",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i4m9ijp",
      "text": ">almost laughed\n\nShe almost cured his depression! So close",
      "timestamp": "2022-04-13 21:20:08",
      "score": 1,
      "num_children": 0,
      "author": 91008,
      "replies": []
    },
    {
      "id": "i4man1d",
      "text": "Switch to her maybe",
      "timestamp": "2022-04-13 21:27:37",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i4mb364",
      "text": "[removed]",
      "timestamp": "2022-04-13 21:30:37",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "i4mb37p",
          "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```bitch```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
          "timestamp": "2022-04-13 21:30:38",
          "score": 1,
          "num_children": 0,
          "author": 184140,
          "replies": []
        }
      ]
    },
    {
      "id": "i4mfgry",
      "text": "Literally 19-Jordan Peterson",
      "timestamp": "2022-04-13 22:00:00",
      "score": 1,
      "num_children": 0,
      "author": 350660,
      "replies": []
    },
    {
      "id": "i4mhoct",
      "text": "I want a gf, all the girls on my looks level ghost me on insta. what to do?",
      "timestamp": "2022-04-13 22:15:16",
      "score": 1,
      "num_children": 0,
      "author": 288649,
      "replies": []
    },
    {
      "id": "i4mm0hg",
      "text": "To me this is like a subconscious effort of the doctor to redirect responsibility. The doctor is like \"i don't have the answers and i'm not gonna fix you, go get a girlfriend so she can do that.\"",
      "timestamp": "2022-04-13 22:46:07",
      "score": 1,
      "num_children": 0,
      "author": 46847,
      "replies": []
    },
    {
      "id": "i4mme1e",
      "text": "That isn't *terrible* advice. Maybe not the best but not terrible. What a lot of people with depression need is some activity in their life. A gf could also help.",
      "timestamp": "2022-04-13 22:48:47",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "i4nymda",
          "text": "yes, but you realize getting a gf is a monumental task for some people.",
          "timestamp": "2022-04-14 05:16:50",
          "score": 1,
          "num_children": 1,
          "author": 69466,
          "replies": [
            {
              "id": "i4o0ww0",
              "text": "Work on your confidence and you'll get girls. (Unless your toxic with your confidence.)",
              "timestamp": "2022-04-14 05:43:09",
              "score": 0,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i4moebx",
      "text": "Get a dog and pour the effort you’d put into a gf into that. Only Dogs ands Mothers will love a man unconditionally",
      "timestamp": "2022-04-13 23:03:04",
      "score": 1,
      "num_children": 0,
      "author": 162313,
      "replies": []
    },
    {
      "id": "i4mpdgc",
      "text": "If anon's room is bad enough that she knows about it, then the room may be an issue.",
      "timestamp": "2022-04-13 23:10:39",
      "score": 1,
      "num_children": 0,
      "author": 112806,
      "replies": []
    },
    {
      "id": "i4muotf",
      "text": "Based doctor",
      "timestamp": "2022-04-13 23:49:42",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i4mxze2",
      "text": "Live laugh love",
      "timestamp": "2022-04-14 00:13:58",
      "score": 1,
      "num_children": 0,
      "author": 160087,
      "replies": []
    },
    {
      "id": "i4n3b3q",
      "text": "Good advice.",
      "timestamp": "2022-04-14 00:52:32",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i4ne1ud",
      "text": "ah the JBP advice....",
      "timestamp": "2022-04-14 02:11:25",
      "score": 1,
      "num_children": 0,
      "author": 307573,
      "replies": []
    },
    {
      "id": "i4nqyer",
      "text": "The poor doctor losing a patient cause of this.",
      "timestamp": "2022-04-14 03:58:48",
      "score": 1,
      "num_children": 0,
      "author": 186074,
      "replies": []
    },
    {
      "id": "i4nyhbs",
      "text": "Oh, you're depressed? Try cleaning under your foreskin.",
      "timestamp": "2022-04-14 05:15:15",
      "score": 1,
      "num_children": 0,
      "author": 130890,
      "replies": []
    },
    {
      "id": "i4o1r4z",
      "text": "Missed opportunity. He could have gotten paid to go on TV and get that advice from Dr. Phil or Dr. Oz.",
      "timestamp": "2022-04-14 05:53:15",
      "score": 1,
      "num_children": 0,
      "author": 397126,
      "replies": []
    },
    {
      "id": "i4o8r6g",
      "text": "Fuck her and fuck Jordan Peterson",
      "timestamp": "2022-04-14 07:24:26",
      "score": 1,
      "num_children": 0,
      "author": 311062,
      "replies": []
    },
    {
      "id": "i4ogplh",
      "text": "I see lots of psychiatrists in this thread huh",
      "timestamp": "2022-04-14 09:17:07",
      "score": 1,
      "num_children": 0,
      "author": 246961,
      "replies": []
    },
    {
      "id": "i4ole40",
      "text": "But she's right tho?",
      "timestamp": "2022-04-14 10:20:25",
      "score": 1,
      "num_children": 0,
      "author": 20245,
      "replies": []
    },
    {
      "id": "i4u966y",
      "text": "\\>german house doctors\n\n\\>actually helping you with stuff\n\npick one",
      "timestamp": "2022-04-15 15:10:19",
      "score": 1,
      "num_children": 0,
      "author": 264703,
      "replies": []
    },
    {
      "id": "i4l2jwl",
      "text": "waaaaaa i’m depressed 😭😭😭\n\nDo you fairies ever stop and think about how repulsive you would be to your ancestors?",
      "timestamp": "2022-04-13 16:40:25",
      "score": -5,
      "num_children": 1,
      "replies": [
        {
          "id": "i4nypdn",
          "text": "mr. macho neanderthal over here",
          "timestamp": "2022-04-14 05:17:47",
          "score": 2,
          "num_children": 0,
          "author": 69466,
          "replies": []
        }
      ]
    },
    {
      "id": "i4kwv95",
      "text": "Based doctor.",
      "timestamp": "2022-04-13 16:04:22",
      "score": -2,
      "num_children": 0,
      "author": 329825,
      "replies": []
    },
    {
      "id": "i4l77o4",
      "text": "Betcha if Jordan Peterson said it, he'd listen and clap. Tell all his friends it's the most true \"hard\" philosophy for men out there.",
      "timestamp": "2022-04-13 17:09:41",
      "score": -1,
      "num_children": 0,
      "author": 27248,
      "replies": []
    },
    {
      "id": "i4mto2u",
      "text": "I like how basically none of the comments here realize that anon means he is switching to the female doctor who actually seems to care lmao. (I also laughed my ass off when I finally found a good doctor, there are a lot of hacks that fuck you up pretty bad and never want to see you get even slightly better. The average 4chaner tbh) Instead of the shrink he has been paying to tell him pretty words that haven't helped him in 7 fucking years\n\nI get most people on reddit and 4chan are incels but holy fuck how fast you guys defaulted to malice on both sides is something else",
      "timestamp": "2022-04-13 23:42:08",
      "score": 0,
      "num_children": 0,
      "author": 26565,
      "replies": []
    },
    {
      "id": "i4olua6",
      "text": "Getting a girlfriend isn’t that hard,guys. All you have to do is be regular",
      "timestamp": "2022-04-14 10:26:04",
      "score": 0,
      "num_children": 0,
      "author": 402468,
      "replies": []
    }
  ]
}