{
  "id": "u5mcns",
  "text": "The Satanic Temple is taking on fake abortion clinics | The clinics often provide misinformation and promote a religious agenda to dissuade people from seeking abortion services. This hinders TST members' religious reproductive rights protected under the First Amendment and RFRA.\n",
  "timestamp": "2022-04-17 12:47:25",
  "score": 16370,
  "subreddit": "t5_2qh2p",
  "num_children": 85,
  "author": 221311,
  "replies": [
    {
      "id": "i53sa87",
      "text": "Hello r/all, Welcome to r/atheism!\n\nPlease read our [Commandments](http://www.reddit.com/r/atheism/wiki/guidelines) and [FAQ](http://www.reddit.com/r/atheism/wiki/FAQ) before commenting. If you follow the rules and act civilly we can avoid a lot of bans. While everyone is welcome here, this sub is intended for atheists to discuss things of interest to us. This means that a wide variety of subjects are on-topic here. This is not a sub about just atheism.\n\nRemember: The mods do not choose which posts get voted up the frontpage. They remove the posts that violate the [Commandments](/r/atheism/w/guidelines); they don't police quality.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*",
      "timestamp": "2022-04-17 17:29:59",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "i52u4no",
      "text": "The goal of the pro-lifers is to stall the woman until she’s no longer allowed to have an abortion by the states law she lives in. \n\nThey lie, fake appointments and use religious propaganda to guilt women into not having an abortion. \nWhere are they when the child’s born… Gone!!",
      "timestamp": "2022-04-17 13:19:17",
      "score": 1386,
      "num_children": 12,
      "author": 413154,
      "replies": [
        {
          "id": "i53u3zv",
          "text": "Happened to me when I was trying to seek an abortion for my now, 10 year old. I was 21, homeless and already trying to take care of one kid. I went to one of their clinics, and they literally kept pushing back my abortion date until I couldn't have one any more. When they finally scheduled me for one, I was 18 weeks pregnant. I went in when i found out i was pregnant at 6 weeks. And that's how I ended up homeless with a toddler and a newborn.",
          "timestamp": "2022-04-17 17:42:20",
          "score": 536,
          "num_children": 5,
          "author": 137455,
          "replies": [
            {
              "id": "i53z5l5",
              "text": "Holy shit, this is even more evil than I expected from religious people. How fucked in the head can someone be.\n\nI hope you are alright by now!",
              "timestamp": "2022-04-17 18:16:48",
              "score": 273,
              "num_children": 5,
              "author": 322032,
              "replies": [
                {
                  "id": "i5461gd",
                  "text": "No cultist think they themselves are evil. They just weigh their social standing in the cult higher than anything else. If the cult says \"This cult is now all about anti-abortion\" you'd lose all your family and friends by going against the new direction. A few pregnant strangers on the street is a price they're willing to pay to keep the good times rolling. \n\nMost people could easily have ended up in cults, don't think that you yourself couldn't have joined one yourself. We're all basically high-functioning monkeys.",
                  "timestamp": "2022-04-17 19:05:55",
                  "score": 132,
                  "num_children": 5,
                  "author": 229521,
                  "replies": [
                    {
                      "id": "i55hf2v",
                      "text": "All religion  is a cult...",
                      "timestamp": "2022-04-18 00:55:10",
                      "score": 36,
                      "num_children": 0,
                      "author": 347429,
                      "replies": []
                    },
                    {
                      "id": "i54jwe4",
                      "text": "The only self aware and self consciously insane mammals on the planet.",
                      "timestamp": "2022-04-17 20:45:23",
                      "score": 14,
                      "num_children": 0,
                      "author": 106015,
                      "replies": []
                    },
                    {
                      "id": "i56jxze",
                      "text": "I’ve been a very anti tribalism person since I was a child.",
                      "timestamp": "2022-04-18 07:12:21",
                      "score": 6,
                      "num_children": 0,
                      "author": 75518,
                      "replies": []
                    },
                    {
                      "id": "i56obd3",
                      "text": ">We're all basically high-functioning monkeys.\n\nNow that just offensive and I find no need that talk. It is pretty well-known fact that we're high-functioning apes.",
                      "timestamp": "2022-04-18 08:14:07",
                      "score": 6,
                      "num_children": 0,
                      "author": 90227,
                      "replies": []
                    },
                    {
                      "id": "i549ypj",
                      "text": "[removed]",
                      "timestamp": "2022-04-17 19:34:09",
                      "score": 7,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i546bv3",
                  "text": "When are religious fanatics not evil?",
                  "timestamp": "2022-04-17 19:08:00",
                  "score": 29,
                  "num_children": 1,
                  "author": 315732,
                  "replies": [
                    {
                      "id": "i55gb3k",
                      "text": "I think it happens on rare occasions. AFAICT John Brown was a good person and a religious fanatic.",
                      "timestamp": "2022-04-18 00:46:40",
                      "score": 3,
                      "num_children": 2,
                      "author": 348450,
                      "replies": [
                        {
                          "id": "i55zjp3",
                          "text": "John Brown straight up murdered multiple people.  I mean props on the abolitionism, but you can't justify torturing people to death in front of their families because they were pro-slavery.",
                          "timestamp": "2022-04-18 03:21:45",
                          "score": 2,
                          "num_children": 2,
                          "author": 299317,
                          "replies": [
                            {
                              "id": "i56npbn",
                              "text": "Eh... debatable. There are definitely people today who deserve the same treatment (thinking of billionaires funding climate misinformation, for one). A public tarring/feathering/burning would only be the start of what they deserve for all the lives they've taken and continue to take.\n\nSlavery was pure evil with no moral justification (and still is, where it's practiced). Killing slave owners, especially to kickstart a movement and fight the evil that is slavery, is definitely justified IMO. It doesn't begin to undue the damage those people caused, but it's a step in the right direction.",
                              "timestamp": "2022-04-18 08:05:11",
                              "score": 5,
                              "num_children": 0,
                              "author": 58930,
                              "replies": []
                            },
                            {
                              "id": "i57c7eo",
                              "text": "I'd argue using violence against slavery is a moral imperative, rather than evil.\n\nTorture, though, not so much.",
                              "timestamp": "2022-04-18 13:02:13",
                              "score": 2,
                              "num_children": 1,
                              "author": 348450,
                              "replies": [
                                {
                                  "id": "i57ea6a",
                                  "text": "Violence against slavery is certainly one way to frame hacking up a bunch of your non-slaveholding neighbors with swords because they disagree with you politically.",
                                  "timestamp": "2022-04-18 13:19:44",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 299317,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i56fn0v",
                          "text": "Mahatma Gandhi, the greatest teacher of non violence, was deeply religious. He actually repeated the name of his God while being shot.",
                          "timestamp": "2022-04-18 06:15:24",
                          "score": 1,
                          "num_children": 1,
                          "author": 306525,
                          "replies": [
                            {
                              "id": "i56w3kd",
                              "text": "Wasn’t he also totally racist?",
                              "timestamp": "2022-04-18 10:05:10",
                              "score": 2,
                              "num_children": 1,
                              "author": 155041,
                              "replies": [
                                {
                                  "id": "i56wk5l",
                                  "text": "Noooo. There are such allegations by certain political groups, but he was the person who coined the term \"Harijan\". Referring to the downtrodden classes as God's people. Since he was religious, I am assuming he was not insulting them.",
                                  "timestamp": "2022-04-18 10:11:33",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 306525,
                                  "replies": [
                                    {
                                      "id": "i57c0xq",
                                      "text": "I mean he was a great man, but he also:\n\n1) got his start fighting specifically for the rights of Indians in South Africa, and didn't care about the treatment of black people. Example quote:\n\n> “I venture to point out that both the English and the Indians spring from a common stock, called the Indo-Aryan. … A general belief seems to prevail in the Colony that the Indians are little better, if at all, than savages or the Natives of Africa. Even the children are taught to believe in that manner, with the result that the Indian is being dragged down to the position of a raw Ka**ir.”\n\n2) raped his wife, was very misogynistic, and may have raped several young girls.",
                                      "timestamp": "2022-04-18 13:00:37",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 348450,
                                      "replies": [
                                        {
                                          "id": "i57sd8w",
                                          "text": "1. He may have been talking about \"African Natives\" who are even now committing war crimes regularly on the continent.\n2. This is definitely rumor spread by people with specific political agendas.",
                                          "timestamp": "2022-04-18 15:03:11",
                                          "score": 0,
                                          "num_children": 0,
                                          "author": 306525,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i554ppn",
                  "text": "Most religious people are only halfassed religious, a handful of them are decent people just using religion as a focus, the rest of them are just awful people posturing based on being morally superior.",
                  "timestamp": "2022-04-17 23:17:36",
                  "score": 9,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "i5768i1",
                  "text": "Evil is the only way to describe this. The cruelty is the point.",
                  "timestamp": "2022-04-18 12:06:32",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "i5l04th",
                  "text": "I'm in a better place now, but the struggle is real. Took me a long time to get where I am today and I'm still not where my peers are financially at my age because of the struggle of my late teens/ early 20s. I'm not upset now, but I was when I was going through it. But, my boys are my world now and while there are some days when I wish I wasn't a parent, most days I love it. Honestly, my kids are what I needed at the time. I do suffer from depression and a lot of the time they're what gets me out of bed in the morning. Knowing that someone needs me to provide for them, pushes me to be better.",
                  "timestamp": "2022-04-21 05:38:43",
                  "score": 1,
                  "num_children": 0,
                  "author": 137455,
                  "replies": []
                }
              ]
            },
            {
              "id": "i56827l",
              "text": "Can you sue them for malpractice, fraud or trauma?  They should be made to pay child support, in my opinion.",
              "timestamp": "2022-04-18 04:43:58",
              "score": 16,
              "num_children": 1,
              "author": 8386,
              "replies": [
                {
                  "id": "i5kza21",
                  "text": "Nope. They didn't do anything illegal. They just kept me on the hook waiting for an appointment that never existed.",
                  "timestamp": "2022-04-21 05:29:01",
                  "score": 1,
                  "num_children": 0,
                  "author": 137455,
                  "replies": []
                }
              ]
            },
            {
              "id": "i54vj6n",
              "text": "That’s so fucked",
              "timestamp": "2022-04-17 22:08:59",
              "score": 7,
              "num_children": 0,
              "author": 296713,
              "replies": []
            },
            {
              "id": "i78vufj",
              "text": "How are you now?  Are you through that experience and did you grow from it?  I was homeless with a toddler I don’t know if I could make it with two but you did! 🙌 I was able to get my life on track and I use that experience as motivation to never go back.",
              "timestamp": "2022-05-04 03:06:15",
              "score": 1,
              "num_children": 1,
              "author": 140449,
              "replies": [
                {
                  "id": "i78y888",
                  "text": "It was tough. Like, really tough. I was homeless off and on for years with my kids. Low paying jobs, lack of child care, horrible living conditions. But, we're good now! I'm married, have one more kid, 2 dogs and 2 cats, with a decent job. Life is pretty good.",
                  "timestamp": "2022-05-04 03:25:37",
                  "score": 1,
                  "num_children": 0,
                  "author": 137455,
                  "replies": []
                }
              ]
            },
            {
              "id": "i56d2om",
              "text": "[removed]",
              "timestamp": "2022-04-18 05:42:12",
              "score": -14,
              "num_children": 1,
              "replies": [
                {
                  "id": "i56ov8p",
                  "text": "you are the one who is sick. get help",
                  "timestamp": "2022-04-18 08:21:58",
                  "score": 6,
                  "num_children": 0,
                  "author": 238955,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i54a1e2",
          "text": "The older I get the more I hate religion and the people involved in it.",
          "timestamp": "2022-04-17 19:34:41",
          "score": 45,
          "num_children": 1,
          "author": 238193,
          "replies": [
            {
              "id": "i553sd6",
              "text": "This is a normal reaction of an evolved being.",
              "timestamp": "2022-04-17 23:10:32",
              "score": 31,
              "num_children": 0,
              "author": 149732,
              "replies": []
            }
          ]
        },
        {
          "id": "i53zzqd",
          "text": "Their main goal is a desperate attempt to make sure that \"women are kept in line\" as in, they genuinely believe they're just baby-making slaves.",
          "timestamp": "2022-04-17 18:22:39",
          "score": 56,
          "num_children": 1,
          "author": 17087,
          "replies": [
            {
              "id": "i546nqj",
              "text": "Hey, they think we are more than that. Don’t be rude. \n\n\n\nThey also think we are kitchen slaves.",
              "timestamp": "2022-04-17 19:10:23",
              "score": 33,
              "num_children": 2,
              "author": 175134,
              "replies": [
                {
                  "id": "i555kit",
                  "text": "\"Wife, make me a sandwich and a baby...\"",
                  "timestamp": "2022-04-17 23:24:00",
                  "score": 11,
                  "num_children": 1,
                  "author": 327811,
                  "replies": [
                    {
                      "id": "i575yz4",
                      "text": "My pregnant partner cooks great but no way in hell can make a sandwich as good as me. Ill never understand it",
                      "timestamp": "2022-04-18 12:03:50",
                      "score": 1,
                      "num_children": 0,
                      "author": 155479,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i56o5ck",
                  "text": "Don’t forget bangmaids.",
                  "timestamp": "2022-04-18 08:11:39",
                  "score": 5,
                  "num_children": 0,
                  "author": 373060,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i52v9p3",
          "text": "When the child is born? They're gone as soon as you can't get rid of the parasite anymore.",
          "timestamp": "2022-04-17 13:29:16",
          "score": 195,
          "num_children": 1,
          "replies": [
            {
              "id": "i53ou9u",
              "text": "[deleted]",
              "timestamp": "2022-04-17 17:06:43",
              "score": -17,
              "num_children": 2,
              "replies": [
                {
                  "id": "i53ufxa",
                  "text": "......is a good thing!",
                  "timestamp": "2022-04-17 17:44:32",
                  "score": 19,
                  "num_children": 0,
                  "author": 47208,
                  "replies": []
                },
                {
                  "id": "i53q10h",
                  "text": "What about it?",
                  "timestamp": "2022-04-17 17:14:52",
                  "score": 15,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i550xcb",
          "text": "They come back 18 year later to convince them to vote Republican.",
          "timestamp": "2022-04-17 22:48:49",
          "score": 14,
          "num_children": 0,
          "author": 226736,
          "replies": []
        },
        {
          "id": "i55uzvt",
          "text": "How can we help waste their time so they have less time to harass women? \n\nI volunteers at the Louisville clinic and there was a fake clinic behind it. Now it’s right next door and we have no safe escort laws. The cops just do nothing and let them be batshit crazy and nearly run women and their escorts over, chase women etc \n\nI donate to all the funds but am really wanting to be more active",
          "timestamp": "2022-04-18 02:43:02",
          "score": 11,
          "num_children": 1,
          "author": 411633,
          "replies": [
            {
              "id": "i5735q1",
              "text": "I volunteer in Jacksonville FL, their fake clinic is a short walk away. They are all over the street around our clinic and the cops do nothing here, either.",
              "timestamp": "2022-04-18 11:33:50",
              "score": 2,
              "num_children": 1,
              "author": 120095,
              "replies": [
                {
                  "id": "i5o6lcz",
                  "text": "It’s so frustrating. Of course our KY governor just vetoed the latest horrible law and was overrode (grammar?) by the GOP led state government \n\nThis state takes 5 steps forward and 15 back every year I swear",
                  "timestamp": "2022-04-21 21:43:49",
                  "score": 2,
                  "num_children": 0,
                  "author": 411633,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i54xhni",
          "text": "What a fucking disgusting thing to do. How is this even allowed?",
          "timestamp": "2022-04-17 22:23:04",
          "score": 8,
          "num_children": 0,
          "author": 326058,
          "replies": []
        },
        {
          "id": "i55tbkw",
          "text": "I don’t see how what these people to do keep women away from healthcare is in any way Christian or moral. These people are fucking evil.",
          "timestamp": "2022-04-18 02:29:21",
          "score": 8,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i55evqa",
          "text": "Because it's not about reducing suffering or the larger ethical problem of unwanted children in the world or the complex problem of  social progress, the correlated poverty and crime, it's about thinking fetuses are babies and abortion is murder to them. For a lot of folks it's that simple.\n\nReligion caters to people who want simple answers to hard questions and don't have the time or interest to really find out the deeper truths. \n\nTbf most people have enough to worry about, and that makes them targets for bad faith people to use religion to manipulate them for political gain.",
          "timestamp": "2022-04-18 00:35:50",
          "score": 13,
          "num_children": 1,
          "author": 340507,
          "replies": [
            {
              "id": "i573xxj",
              "text": "Absolutely! The bad faith people are the money behind all of this. They do not care about women or the fetuses. It’s a political agenda.",
              "timestamp": "2022-04-18 11:42:28",
              "score": 1,
              "num_children": 1,
              "author": 120095,
              "replies": [
                {
                  "id": "i57tph2",
                  "text": "My point is they do care about the fetus but only that it is murder to them and murder is wrong. \n\nfrom then on their view afaik, is that the woman or whoever is responsible for the welfare of the child.\n\nI.e. people chose to have sex and take the risk of creating a human life, killing it is wrong, but it's those people, not societys  responsibility to care for it. \n\nThe logic, while simplistic, and allowing for larger more complex problems, can be consistent.\n\nIt's like if you follow pure capitalism you'd think that health care and public service like police and fire would only benefit from being privatized, and clearly that is not the case. \n\nI think it's important to talk to non politicians that are prolife honestly and in good faith about these things because I think the majority can understand if given good information \n\nThe political agendas of those wanting to weaponize single issue voters have no interest in losing their lever of influence.\n\nObviously the Abrahamic religions are very controlling of sex and women as basically property, which makes sense(does not make it right or good) as a primitive form of selfish  reproductive strategy, but again as we progress it's extremely problematic to say the least, but it takes effort and education and discussion to progress to imo, a more responsive ethical perspective.",
                  "timestamp": "2022-04-18 15:12:16",
                  "score": 1,
                  "num_children": 0,
                  "author": 340507,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i545x5j",
          "text": "They just want to punish women, nothing more. Pro-life is more pro-rapist and pro-pedophile than it ever will be about protecting children. You can be pro-choice and be against abortion while EVERY pedophile is pro-life.",
          "timestamp": "2022-04-17 19:05:03",
          "score": 15,
          "num_children": 0,
          "author": 159749,
          "replies": []
        },
        {
          "id": "i57b3eo",
          "text": "You are not supposed to lie, isn’t that what the religion teaches you? And you shall not deceive, or something like that?",
          "timestamp": "2022-04-18 12:52:28",
          "score": 1,
          "num_children": 0,
          "author": 20422,
          "replies": []
        },
        {
          "id": "i5844qt",
          "text": "Can we stop calling them by their preferred name of \"pro life\"?  They are most definitely not pro life.",
          "timestamp": "2022-04-18 16:22:14",
          "score": 1,
          "num_children": 0,
          "author": 238447,
          "replies": []
        }
      ]
    },
    {
      "id": "i52tlkn",
      "text": "How the fuck are fake medical facilities legal?",
      "timestamp": "2022-04-17 13:14:34",
      "score": 498,
      "num_children": 6,
      "replies": [
        {
          "id": "i52wy87",
          "text": "[deleted]",
          "timestamp": "2022-04-17 13:43:24",
          "score": 205,
          "num_children": 3,
          "replies": [
            {
              "id": "i53egrs",
              "text": "I just started working in prenatal care a few months ago and found out about these pieces of shit. \n\nI’ve found that they often lie about ultrasound results by saying the fetus is way older than it really is (so the patient thinks it can no longer be aborted).   I’d be shocked if they even perform actual ultrasounds",
              "timestamp": "2022-04-17 15:54:20",
              "score": 119,
              "num_children": 1,
              "author": 150728,
              "replies": [
                {
                  "id": "i53lihe",
                  "text": "I just posted a comment about this. The one we went to lied and said she was 6-8 weeks further along than she was. We couldn't afford decent prenatal care, so no one stopped to think \"the fetus is a little small for the presumed due date.\" They induced, can't remember why, and my daughter was born 2 months early. She weighed 5 pounds. Beating a dead horse here, but religious people are the fucking worst.",
                  "timestamp": "2022-04-17 16:43:45",
                  "score": 119,
                  "num_children": 1,
                  "author": 34506,
                  "replies": [
                    {
                      "id": "i53o8nd",
                      "text": "Wooow that clinic should be sued for malpractice at least in the amount to cover your extra expenses from having a premature baby. Have you talked to the ACLU or lawyers about the situation?",
                      "timestamp": "2022-04-17 17:02:33",
                      "score": 85,
                      "num_children": 1,
                      "author": 64108,
                      "replies": [
                        {
                          "id": "i53q2e9",
                          "text": "Yeah I thought of that, the place up and disappeared, right around the thought of lawsuits crossed my mind. Short of hiring a PI to track the scum down, not much I could do.",
                          "timestamp": "2022-04-17 17:15:07",
                          "score": 46,
                          "num_children": 1,
                          "author": 34506,
                          "replies": [
                            {
                              "id": "i54jtnk",
                              "text": " A good  lawyer will find them.\n\nEdit: I’m a lawyer.",
                              "timestamp": "2022-04-17 20:44:51",
                              "score": 28,
                              "num_children": 0,
                              "author": 118361,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i5541le",
              "text": "Don't forget any business that makes money without paying taxes (like a church) is taking from taxpayers, as they take advantage of services we pay for.",
              "timestamp": "2022-04-17 23:12:31",
              "score": 22,
              "num_children": 0,
              "author": 201119,
              "replies": []
            },
            {
              "id": "i56jf4x",
              "text": "Here in VA they have been offering free ultrasounds to potential mothers, ostensibly to help \"medical trainees\" with their ultrasound training (of note, sonographers do not need a license or certificate to practice). Then the ultrasound is read to show fingers, heartbeat, face, etc and the woman is given pro-life info/materials. And the clinic hides their religious and pro-life orientation.\n\nI called out a woman who used our neighborhood Facebook page to promote one such clinic. Of course she didn't respond. I'm sure I made an enemy that day.",
              "timestamp": "2022-04-18 07:05:14",
              "score": 7,
              "num_children": 0,
              "author": 66972,
              "replies": []
            }
          ]
        },
        {
          "id": "i52vkwh",
          "text": "Everything is legal until it isn't anymore.  Laws always turn up after the invention of a new crime.",
          "timestamp": "2022-04-17 13:31:58",
          "score": 216,
          "num_children": 2,
          "author": 265630,
          "replies": [
            {
              "id": "i53mo1v",
              "text": "Laws are reactive, not proactive",
              "timestamp": "2022-04-17 16:51:43",
              "score": 68,
              "num_children": 2,
              "author": 11792,
              "replies": [
                {
                  "id": "i53oenw",
                  "text": "That makes [this](https://www.thelawplace.com/blog/weird-florida-laws/) even more hilarious",
                  "timestamp": "2022-04-17 17:03:42",
                  "score": 23,
                  "num_children": 3,
                  "author": 23017,
                  "replies": [
                    {
                      "id": "i53tixr",
                      "text": "I used to live in Pensacola... I had no idea Donkey Kong would likely be a criminal there.",
                      "timestamp": "2022-04-17 17:38:22",
                      "score": 6,
                      "num_children": 0,
                      "author": 407907,
                      "replies": []
                    },
                    {
                      "id": "i53t3sr",
                      "text": "Someone was taking advantage of elephant parking.",
                      "timestamp": "2022-04-17 17:35:32",
                      "score": 4,
                      "num_children": 0,
                      "author": 254009,
                      "replies": []
                    },
                    {
                      "id": "i555od6",
                      "text": "That link says that death by hanging is cruel and/or unusual punishment. Since when has that been legal precedent? Does unusual in this case just mean uncommon in the modern world?",
                      "timestamp": "2022-04-17 23:24:50",
                      "score": 1,
                      "num_children": 0,
                      "author": 148946,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i53vezi",
                  "text": "Real bad for the digital age",
                  "timestamp": "2022-04-17 17:51:01",
                  "score": 3,
                  "num_children": 1,
                  "author": 283421,
                  "replies": [
                    {
                      "id": "i53wajg",
                      "text": "Yeah while I believe it's a good policy in general, there are times when a little bit of foresight or reading the zeitgeist would do wonders",
                      "timestamp": "2022-04-17 17:56:57",
                      "score": 2,
                      "num_children": 1,
                      "author": 11792,
                      "replies": [
                        {
                          "id": "i53xgd8",
                          "text": "I do some advocating about consumer rights and protections surrounding concerns over the kinds of data that's gathered en mass by private companies; things like facial recognition databases being established from DMV records and social media photos (public information technically) and metadata for targeted advertising and content.\n\nConstantly get called a loony or get the old \"bIg GuMmIt BaD\" looks when I bring it up.\n\nIt's always worth it though, and several times now LWT has released episodes just days after I get done explaining my stances on these kinds of issue to someone where the main story is exactly what I'm trying to convey, only usually articulated in better ways. \n\nSometimes it really feels like it's not making any difference.",
                          "timestamp": "2022-04-17 18:04:47",
                          "score": 9,
                          "num_children": 1,
                          "author": 283421,
                          "replies": [
                            {
                              "id": "i541y4m",
                              "text": ">Sometimes it really feels like it's not making any difference.\n\nisn't the genie already out of the bottle and we missed the boat on this by a decade. can't get our data back now\n\nsee: clearview",
                              "timestamp": "2022-04-17 18:36:31",
                              "score": 1,
                              "num_children": 1,
                              "author": 230388,
                              "replies": [
                                {
                                  "id": "i54gvxn",
                                  "text": "Clearview is actually the exact kind of result that I'm referring to as being problematic.\n\nBut counterpoint: the video privacy protection act of 1988",
                                  "timestamp": "2022-04-17 20:24:04",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 283421,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i57dipi",
              "text": "Definitely a practice worth revisiting at some point. In France, they can determine if a proposed law is legal or illegal before signing it into law.",
              "timestamp": "2022-04-18 13:13:25",
              "score": 1,
              "num_children": 0,
              "author": 238008,
              "replies": []
            }
          ]
        },
        {
          "id": "i53bnqf",
          "text": "Because anti-choice people wrote the laws to make them legal. They can take money from the state then lie to the women with impunity.",
          "timestamp": "2022-04-17 15:34:11",
          "score": 38,
          "num_children": 0,
          "author": 111057,
          "replies": []
        },
        {
          "id": "i53airm",
          "text": "Because religious groups paid a lot of money to do so, and the regressives in our various levels of government are more than willing to oblige. The fucked up thing is, they often set up shop next to *legitimate* reproductive care facilities to confuse and siphon off people headed towards them so they can guilt them away from abortions (most of the ever-present protesters in front of my local Planned Parenthood come from the \"crisis pregnancy center\" across the street; I live in Texas, so PP doesn't even *provide* abortions here anymore - these assholes are protesting either PP itself or *contraception in general*).",
          "timestamp": "2022-04-17 15:26:01",
          "score": 24,
          "num_children": 1,
          "author": 333162,
          "replies": [
            {
              "id": "i53lsko",
              "text": "Both.",
              "timestamp": "2022-04-17 16:45:41",
              "score": 7,
              "num_children": 0,
              "author": 18816,
              "replies": []
            }
          ]
        },
        {
          "id": "i52wkgd",
          "text": "The same way rapists get put in charge of a troubled teen girls ranch...lack of transparency and oversight.",
          "timestamp": "2022-04-17 13:40:15",
          "score": 68,
          "num_children": 1,
          "author": 404732,
          "replies": [
            {
              "id": "i54fdlc",
              "text": "Mc'scuse me? What?!",
              "timestamp": "2022-04-17 20:13:19",
              "score": 4,
              "num_children": 1,
              "author": 20030,
              "replies": [
                {
                  "id": "i54gokw",
                  "text": "Happened here in missouri....little to no scrutiny or regulation due to the religious affiliation of the ranch in question!",
                  "timestamp": "2022-04-17 20:22:36",
                  "score": 7,
                  "num_children": 0,
                  "author": 404732,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i53e0fy",
          "text": "Because you live in a poorly run business masquerading as a country.",
          "timestamp": "2022-04-17 15:51:07",
          "score": 13,
          "num_children": 1,
          "author": 250708,
          "replies": [
            {
              "id": "i53v7ne",
              "text": "I don't live in US.",
              "timestamp": "2022-04-17 17:49:40",
              "score": 5,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i531s7r",
      "text": "Thanks Satan",
      "timestamp": "2022-04-17 14:22:09",
      "score": 154,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i53lri0",
      "text": "How tf can I help? Walked into one of these on accident cause it was RIGHT NEXT to the clinic and I was too young and ignorant to see the forest for the trees. They made me late to my actual appt cause I got sat down and interviewed and made to watch that god awful misinformation movie about how I was totally gonna get cancer and die from an abortion. It wasnt until they asked for my parent’s religion I realized I was in the wrong place. So fucking creepy the way she damn near tried to use her body as a barrier at first and that God would never forgive me. \n\n  I ended up at the clinic brimming with tears bc I didn’t know this was a thing or why they would mislead me with that cavalcade of awful. I wish I could go back with the fortitude I have now and give em a good what for.",
      "timestamp": "2022-04-17 16:45:29",
      "score": 103,
      "num_children": 3,
      "author": 195607,
      "replies": [
        {
          "id": "i554gth",
          "text": "You can always donate to the satanic temple [here](https://thesatanictemple.com/pages/donate), it always goes directly to their cause, so it's a good way to support them",
          "timestamp": "2022-04-17 23:15:41",
          "score": 37,
          "num_children": 0,
          "author": 300673,
          "replies": []
        },
        {
          "id": "i55zgd6",
          "text": "You could volunteer outside the very same clinic!  Go to TST's website and download some flyers.  They also have general guidelines etc but it's all being done by volunteers.  Give that clinic a good what for indeed.",
          "timestamp": "2022-04-18 03:20:56",
          "score": 14,
          "num_children": 0,
          "author": 206052,
          "replies": []
        },
        {
          "id": "i53v86l",
          "text": "Did you see the flyers to be printed?",
          "timestamp": "2022-04-17 17:49:46",
          "score": 4,
          "num_children": 0,
          "author": 254009,
          "replies": []
        }
      ]
    },
    {
      "id": "i52yvxz",
      "text": "This makes me so happy!! And I see my parents clinic listed so I'm even happier haha.",
      "timestamp": "2022-04-17 13:59:13",
      "score": 78,
      "num_children": 2,
      "author": 71212,
      "replies": [
        {
          "id": "i53aiee",
          "text": "You could do a lot of damage from the inside",
          "timestamp": "2022-04-17 15:25:57",
          "score": 46,
          "num_children": 0,
          "author": 402093,
          "replies": []
        },
        {
          "id": "i56bxxt",
          "text": "Seriously, volunteer there and warn patients in secret, and then refer them to a real place. Particularly if you're an adult.",
          "timestamp": "2022-04-18 05:28:19",
          "score": 13,
          "num_children": 1,
          "author": 402093,
          "replies": [
            {
              "id": "i56tkbe",
              "text": "That would be a good idea if we we're estranged and they didn't already know I'm atheist 🤣",
              "timestamp": "2022-04-18 09:29:35",
              "score": 3,
              "num_children": 1,
              "author": 71212,
              "replies": [
                {
                  "id": "i57b7iy",
                  "text": "Dang, well I'm sure you're better off.",
                  "timestamp": "2022-04-18 12:53:29",
                  "score": 3,
                  "num_children": 1,
                  "author": 402093,
                  "replies": [
                    {
                      "id": "i57e99k",
                      "text": "Absolutely!! And happier 😌.",
                      "timestamp": "2022-04-18 13:19:32",
                      "score": 2,
                      "num_children": 0,
                      "author": 71212,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i531s3z",
      "text": "Being fake and lying seems to be sin, only if one feels it is.",
      "timestamp": "2022-04-17 14:22:07",
      "score": 75,
      "num_children": 3,
      "author": 317995,
      "replies": [
        {
          "id": "i53gfx6",
          "text": "\"No no things are only sins when other people do it.  When I do it it's fine\"",
          "timestamp": "2022-04-17 16:08:13",
          "score": 26,
          "num_children": 1,
          "author": 239613,
          "replies": [
            {
              "id": "i55548l",
              "text": "Blow cocaine off a hookers ass on Friday and ask forgiveness on Sunday, check out my #blessed sign in the dining room wall and hallway.",
              "timestamp": "2022-04-17 23:20:36",
              "score": 8,
              "num_children": 1,
              "author": 132693,
              "replies": [
                {
                  "id": "i562pka",
                  "text": "Live. Laugh. Lie.",
                  "timestamp": "2022-04-18 03:50:32",
                  "score": 7,
                  "num_children": 0,
                  "author": 244541,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i53jkin",
          "text": "As I said in another comment elsewhere on reddit this past week: lying is a sin, unless it’s for Jesus, then the ends justify the means and lying is super ok.",
          "timestamp": "2022-04-17 16:30:05",
          "score": 11,
          "num_children": 0,
          "author": 311461,
          "replies": []
        },
        {
          "id": "i53t2ac",
          "text": "Sin for thee but not for me",
          "timestamp": "2022-04-17 17:35:15",
          "score": 9,
          "num_children": 0,
          "author": 8334,
          "replies": []
        }
      ]
    },
    {
      "id": "i537eai",
      "text": "What is wrong with some people. *Fake* abortion clinics!? As if it’s not hard enough for those poor women. This is beyond ridiculous…glad they’re standing up and doing something about it.",
      "timestamp": "2022-04-17 15:03:39",
      "score": 65,
      "num_children": 2,
      "author": 272646,
      "replies": [
        {
          "id": "i555k9c",
          "text": "They are EVERYWHERE in the south. They infuriate me (I’m a middle age man) but I know there are real women and girls in real dilemmas and needing help being manipulated and scammed by these people who will villainize them as freeloaders and sluts once the baby is born.\n\nThey want their cake and they’ll eat it too on the foundation of struggling and poor Americans.",
          "timestamp": "2022-04-17 23:23:57",
          "score": 24,
          "num_children": 0,
          "author": 132693,
          "replies": []
        },
        {
          "id": "i567jwt",
          "text": "> What is wrong with some people\n\nLow/nonexistent education, lifelong indoctrination into a belief system that tells them they're the chosen people of an invisible deity, complete lack of any identity outside of that belief system, unrelenting narcissism..  I could go on\n\n..what, was that a rhetorical question?",
          "timestamp": "2022-04-18 04:38:39",
          "score": 11,
          "num_children": 1,
          "author": 85594,
          "replies": [
            {
              "id": "i567mz0",
              "text": "I mean, kind of, but kind of not =<",
              "timestamp": "2022-04-18 04:39:32",
              "score": 1,
              "num_children": 0,
              "author": 272646,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i53krzw",
      "text": "We went to one of those places just for the free proof of pregnancy. The ended up either lying, or misidentifying how far along the pregnancy was. Pretty sure they were lying. Long story short, my first daughter was born 2 months premature, largely because the \"pregnancy crisis center\" insisted she was 12 weeks pregnant when it was closer to 5 or 6 weeks. So, when there was a slight complication, they decided to induce because it was supposed to be about time anyway. Poor kid was only 5 pounds.",
      "timestamp": "2022-04-17 16:38:36",
      "score": 46,
      "num_children": 4,
      "author": 34506,
      "replies": [
        {
          "id": "i53t555",
          "text": "You should contact the TST and tell them your story. It would probably help build their case. Causing a premature birth because these facilities lied to you is absolutely disgusting. Even if you didn’t pursue anything further, it would give them ammo and some knowledge about actual damage these places caused.",
          "timestamp": "2022-04-17 17:35:47",
          "score": 51,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i54e0kb",
          "text": "Who induced labor?",
          "timestamp": "2022-04-17 20:03:24",
          "score": 4,
          "num_children": 1,
          "author": 92801,
          "replies": [
            {
              "id": "i5619cf",
              "text": "Midwife at the hospital. Or it may have been the ob, because midwifes don't do that. Can't remember. They were both there for most of it.",
              "timestamp": "2022-04-18 03:37:15",
              "score": 1,
              "num_children": 0,
              "author": 34506,
              "replies": []
            }
          ]
        },
        {
          "id": "i53tm3v",
          "text": "I'm not trying to be insensitive, but why would you take medical advice from these snake oil salesmen?!?",
          "timestamp": "2022-04-17 17:38:59",
          "score": -11,
          "num_children": 2,
          "author": 115650,
          "replies": [
            {
              "id": "i53umnv",
              "text": "I'm not trying to be a jerk, but are you not familiar with these places? They pretend to be legitimate prenatal clinics for low income families. They don't advertise the fact that they are super secret agents for the chirstains.",
              "timestamp": "2022-04-17 17:45:48",
              "score": 33,
              "num_children": 2,
              "author": 34506,
              "replies": [
                {
                  "id": "i54hqnv",
                  "text": "Did the hospital not do a single test to determine the age of the fetus?",
                  "timestamp": "2022-04-17 20:30:12",
                  "score": 7,
                  "num_children": 0,
                  "author": 92801,
                  "replies": []
                },
                {
                  "id": "i54avkx",
                  "text": "I don't mean to be a jerk but it's pretty clear what these places are up to once you go to them. The posters on the walls, the literature on the table, the rooms full of baby supplies, the way they speak to you, and no info on abortions but instead adoption. I know because I've been to them myself for a free pregnancy test when I was a teen.",
                  "timestamp": "2022-04-17 19:40:47",
                  "score": -2,
                  "num_children": 1,
                  "author": 351901,
                  "replies": [
                    {
                      "id": "i54e7cu",
                      "text": "Their not hospitals either, seems odd they would induce a delivery.",
                      "timestamp": "2022-04-17 20:04:46",
                      "score": 1,
                      "num_children": 1,
                      "author": 92801,
                      "replies": [
                        {
                          "id": "i54g5ei",
                          "text": "They didn’t. Did you not comprehend what the original comment said? They only went to get proof of pregnancy. Some insurances require it and it’s generally free and easy to get at a crisis pregnancy center. But they pushed the age of the pregnancy up so that when the commenter was at an actual hospital, and they used the age of fetus based on the CPC’s bullshit, they thought it would be mature enough but it wasn’t. The CPC lied thinking the commenter would seek an abortion so they say the pregnancy is older than it is to block that.",
                          "timestamp": "2022-04-17 20:18:50",
                          "score": 5,
                          "num_children": 1,
                          "author": 341444,
                          "replies": [
                            {
                              "id": "i54hjoe",
                              "text": "So you are actually going to argue that a hospital could not tell that a pregnancy was actually 6-7 weeks behind what the CPC center said?\n\nAnd what, did this CPC give the person a certificate or something?  How would they even know what the CDC said?",
                              "timestamp": "2022-04-17 20:28:46",
                              "score": 1,
                              "num_children": 2,
                              "author": 92801,
                              "replies": [
                                {
                                  "id": "i54hzzh",
                                  "text": "If there had been no other complications and no other ultrasounds, yes it could be. I don't know the original commenter's situation but it could happen. And not a certificate, but there would be documentation.",
                                  "timestamp": "2022-04-17 20:32:05",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 341444,
                                  "replies": [
                                    {
                                      "id": "i54p0t7",
                                      "text": "If you think a hospital is going to induce without doing any tests to confirm the age of the fetus, I got a bridge to sell you.",
                                      "timestamp": "2022-04-17 21:22:16",
                                      "score": 1,
                                      "num_children": 2,
                                      "author": 92801,
                                      "replies": [
                                        {
                                          "id": "i558tu4",
                                          "text": "If you think a doctor is automatically going to spend time double checking anything for a female patient, I've got some Siberian Beach property you might be interested in.",
                                          "timestamp": "2022-04-17 23:49:09",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 303811,
                                          "replies": []
                                        },
                                        {
                                          "id": "i54pdzn",
                                          "text": "You thought the CPC was inducing a pregnancy so I see why you bought it first",
                                          "timestamp": "2022-04-17 21:24:51",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 341444,
                                          "replies": [
                                            {
                                              "id": "i54q6oi",
                                              "text": "That's the best you got?  lol, ok.",
                                              "timestamp": "2022-04-17 21:30:33",
                                              "score": -1,
                                              "num_children": 1,
                                              "author": 92801,
                                              "replies": [
                                                {
                                                  "id": "i54qxql",
                                                  "text": "You're gonna criticize me after you pull out the ol' bridge to sell bit? Okay buddy, have fun.",
                                                  "timestamp": "2022-04-17 21:36:00",
                                                  "score": 2,
                                                  "num_children": 0,
                                                  "author": 341444,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "i564w6o",
                                  "text": "This was 16 years ago now, I can't remember a lot of the little shit. It took several months to get insurance started, and the pregnancy seemed to be going pretty normally, so we didn't have much prenatal care until I want to say 6 months. I do remember the OB mentioning that she looked a little small. She didn't seem concerned though. I don't remember being worried about it at that point.\n\nThe CPC did an ultrasound. I don't know why everyone thinks all these places are obvious. This one looked like a legit doctor's office. A person in a lab coat did the ultrasound in a clean, modern looking medical room. No one mentioned Jesus.\n\nThey gave us ultrasound pictures, and two documents, one for the state insurance provider, and one that was I think a referral to a county clinic. They told us verbally that she was 12 weeks, and both documents also had that information.\n\nI think I remember they induced because she was leaking amniotic fluid at an alarming rate. They figured it was close enough to time that they induced. Had we been able to access prenatal care earlier in the pregnancy, that date would have probably been revised, and they probably would do whatever they do to remedy a leaky amniotic sac.\n\nI imagine that normally for insured people and non-Americans, after a positive home test, a woman simply makes an appointment with an OB within her healthcare network. The first appointment would be confirming the pregnancy and estimating a due date, and care would begin there.\n\nNo one with insurance goes to these places. Theoretically in most states that have public healthcare, You take the official proof of pregnancy these places provide and apply for insurance. Then you jump through absurd hoops, get denied and have to appeal and reapply several times, and eventually have limited insurance coverage. It doesn't cover much, but it covers pregnancy, and there are no copays. This process can take months. I remember the midwife saying that some of her patients that went that route didn't have coverage approved until just before delivery. We were pretty close, but shouldn't have been.",
                                  "timestamp": "2022-04-18 04:11:36",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 34506,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i54vs9d",
              "text": "They front like real doctors and real facilities",
              "timestamp": "2022-04-17 22:10:44",
              "score": 3,
              "num_children": 0,
              "author": 296713,
              "replies": []
            }
          ]
        },
        {
          "id": "i55t1gu",
          "text": "I thought 5 pounds was normal",
          "timestamp": "2022-04-18 02:27:03",
          "score": 1,
          "num_children": 0,
          "author": 318286,
          "replies": []
        }
      ]
    },
    {
      "id": "i531mtr",
      "text": "I donate $20 monthly to TST and I’m happy to see my money going to the right cause. I was raised Catholic by hardcore Christians, and I’m thus even happier that I can stick it to the man!",
      "timestamp": "2022-04-17 14:21:00",
      "score": 208,
      "num_children": 2,
      "author": 301128,
      "replies": [
        {
          "id": "i53miw7",
          "text": "Also, don’t forget if you shop Amazon using smile.amazon.com, you can choose The Satanic Temple to receive donations for every purchase you make at no cost to you.\n\nI can’t say I like Amazon, but if you’re going to use it, you might as well support a good cause at the same time.",
          "timestamp": "2022-04-17 16:50:43",
          "score": 48,
          "num_children": 2,
          "author": 323595,
          "replies": [
            {
              "id": "i56n5jr",
              "text": "I try to use it as little as possible, but that is so cool. I usually use an animal donation link but maybe I should change it up if I order again.",
              "timestamp": "2022-04-18 07:57:31",
              "score": 4,
              "num_children": 0,
              "author": 234852,
              "replies": []
            },
            {
              "id": "i576mws",
              "text": "Thanks! Wasn't aware of that. Just so everyone knows, it's the one in Massachusetts, not the one in Colorado that is listed first when you search.",
              "timestamp": "2022-04-18 12:10:37",
              "score": 4,
              "num_children": 0,
              "author": 310409,
              "replies": []
            }
          ]
        },
        {
          "id": "i538u94",
          "text": "I found out about TST about a year ago, ever since then I’ve donated a bunch of money and even changed my daughter’s elementary school to TST for the Amazon donations. Hail Satan!! 🤘🏼",
          "timestamp": "2022-04-17 15:14:01",
          "score": 76,
          "num_children": 0,
          "author": 256913,
          "replies": []
        }
      ]
    },
    {
      "id": "i52r8em",
      "text": "Ah, you just have to love the satanic temple",
      "timestamp": "2022-04-17 12:52:45",
      "score": 264,
      "num_children": 4,
      "replies": [
        {
          "id": "i52s6bk",
          "text": "If you're going to be litigious, be litigious for something good 😊",
          "timestamp": "2022-04-17 13:01:35",
          "score": 125,
          "num_children": 0,
          "author": 128164,
          "replies": []
        },
        {
          "id": "i53o7p4",
          "text": "They're truly doing the Lord's work",
          "timestamp": "2022-04-17 17:02:23",
          "score": 40,
          "num_children": 3,
          "author": 40993,
          "replies": [
            {
              "id": "i53ogsx",
              "text": "As ironic as it is…",
              "timestamp": "2022-04-17 17:04:07",
              "score": 22,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i53w30t",
              "text": "The Dark Lord! :D",
              "timestamp": "2022-04-17 17:55:32",
              "score": 9,
              "num_children": 0,
              "author": 77267,
              "replies": []
            },
            {
              "id": "i56bev2",
              "text": "I'm still hoping the ten commandments monument in Arkansas will be removed. It's atrocious.",
              "timestamp": "2022-04-18 05:21:49",
              "score": 5,
              "num_children": 1,
              "author": 407907,
              "replies": [
                {
                  "id": "i56dk28",
                  "text": "Well, I hope they are prepared to give equal space to all religions, including Lord Baphomet!",
                  "timestamp": "2022-04-18 05:48:11",
                  "score": 5,
                  "num_children": 1,
                  "author": 40993,
                  "replies": [
                    {
                      "id": "i56gx84",
                      "text": "Right on! We're supposed to be a melting pot, not a homogeneous slab! Else to show otherwise, is to show we're a nation that has lost its way.",
                      "timestamp": "2022-04-18 06:32:17",
                      "score": 5,
                      "num_children": 0,
                      "author": 407907,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i531lw8",
          "text": "I do love them! The best trolls on the whole damn planet!",
          "timestamp": "2022-04-17 14:20:49",
          "score": 51,
          "num_children": 3,
          "author": 409892,
          "replies": [
            {
              "id": "i53i8di",
              "text": "Is standing up for what you believe in trolling now?",
              "timestamp": "2022-04-17 16:20:43",
              "score": 36,
              "num_children": 0,
              "author": 345655,
              "replies": []
            },
            {
              "id": "i539e0h",
              "text": "Is trolling with a purpose still trolling?",
              "timestamp": "2022-04-17 15:17:57",
              "score": 24,
              "num_children": 1,
              "author": 65603,
              "replies": [
                {
                  "id": "i540e22",
                  "text": "All trolling is trolling with a purpose, it’s just that usually the purpose is being an asshole or because you were raised with a lot of negative reinforcement when you wanted attention as a kid.",
                  "timestamp": "2022-04-17 18:25:27",
                  "score": 13,
                  "num_children": 0,
                  "author": 300554,
                  "replies": []
                }
              ]
            },
            {
              "id": "i53sw5u",
              "text": "Didn't realize fighting injustice was trolling",
              "timestamp": "2022-04-17 17:34:06",
              "score": 11,
              "num_children": 1,
              "author": 8334,
              "replies": [
                {
                  "id": "i77v1nf",
                  "text": "The way they do it is. Also like the Foo Fighters playing on a trailer bed around the Westboro Baptist Church when they come to Kansas.",
                  "timestamp": "2022-05-03 22:26:58",
                  "score": 1,
                  "num_children": 0,
                  "author": 409892,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i54265p",
          "text": "If you really love them, you can always [donate to them](https://thesatanictemple.com/collections/contribute-to-the-satanic-temple-campaigns)! We all know their christo-fascist counterparts are getting huge amounts of funding from their base these days",
          "timestamp": "2022-04-17 18:38:04",
          "score": 15,
          "num_children": 1,
          "author": 372766,
          "replies": [
            {
              "id": "i54g7iw",
              "text": "I have way too little to donate anything to anyone",
              "timestamp": "2022-04-17 20:19:15",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i53r2h5",
      "text": "Good for them. At age 14, thru the people I went to church with I worked in one of those type of clinics and even now at 41 I'm upset my parents allowed that shit. The stuff they do to poor scared pregnant women and teens is appalling and I was definitely traumatized by it. They lie and spread misinformation and emotionally abuse emotionally fragile people, they intentionally inflict worse trauma on the ones they suspect might be \"at risk\" for getting an abortion. These need to be banned.",
      "timestamp": "2022-04-17 17:21:50",
      "score": 31,
      "num_children": 0,
      "author": 269407,
      "replies": []
    },
    {
      "id": "i537yrp",
      "text": "Proud to be a card carrying member of the satanic temple",
      "timestamp": "2022-04-17 15:07:46",
      "score": 79,
      "num_children": 5,
      "author": 22588,
      "replies": [
        {
          "id": "i53gg9x",
          "text": "Me too.",
          "timestamp": "2022-04-17 16:08:17",
          "score": 20,
          "num_children": 1,
          "author": 405213,
          "replies": [
            {
              "id": "i541o4l",
              "text": "and my axe!",
              "timestamp": "2022-04-17 18:34:30",
              "score": 5,
              "num_children": 1,
              "author": 369894,
              "replies": [
                {
                  "id": "i541pu2",
                  "text": "And my bow!",
                  "timestamp": "2022-04-17 18:34:50",
                  "score": 5,
                  "num_children": 0,
                  "author": 405213,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i53omal",
          "text": "Me too! I recently bought some shirts from their shop, they're nice quality and comfy.",
          "timestamp": "2022-04-17 17:05:11",
          "score": 14,
          "num_children": 0,
          "author": 40993,
          "replies": []
        },
        {
          "id": "i54efs5",
          "text": "Hail Satan! And hail yourself!",
          "timestamp": "2022-04-17 20:06:28",
          "score": 6,
          "num_children": 0,
          "author": 170524,
          "replies": []
        },
        {
          "id": "i54aol2",
          "text": "Yes",
          "timestamp": "2022-04-17 19:39:23",
          "score": 6,
          "num_children": 0,
          "author": 238193,
          "replies": []
        },
        {
          "id": "i552j8m",
          "text": "Me too, hail satan!",
          "timestamp": "2022-04-17 23:00:59",
          "score": 3,
          "num_children": 0,
          "author": 364519,
          "replies": []
        }
      ]
    },
    {
      "id": "i53sypq",
      "text": "Great time to mention that you can make the satanic temple your Amazon smile charity.",
      "timestamp": "2022-04-17 17:34:35",
      "score": 26,
      "num_children": 2,
      "author": 105267,
      "replies": [
        {
          "id": "i53vnsd",
          "text": "I would if JDRF didn't exist! LOL i gotta cure the 'betes first. \n\nBut still, this is a fantastic idea they had. I will print flyers and share with my atheist group.",
          "timestamp": "2022-04-17 17:52:39",
          "score": 7,
          "num_children": 0,
          "author": 29015,
          "replies": []
        },
        {
          "id": "i577gn1",
          "text": "Just so everyone knows, it's the one in Massachusetts, not the one in Colorado that is listed first when you search.",
          "timestamp": "2022-04-18 12:18:49",
          "score": 1,
          "num_children": 0,
          "author": 310409,
          "replies": []
        }
      ]
    },
    {
      "id": "i53pdvk",
      "text": "These are often called \"Crisis Pregnancy Medical Centers\". The idea is they imply that they're abortion clinics but when you show up they do an ultrasound and then try to convince you that you can't (not shouldn't) get an abortion. \n\nThey offer limited medical services and as a result they pull funding from the same sources as Planned Parenthood. I once worked as a waiter at a fundraiser for one of these (I did not realize until I was there who they were). There was a senator as well as state politicians in attendance. \n\nThey went out and bought Tupperware to take home the leftovers the catering company had after we served dinner. It was a bizarre and tacky experience.",
      "timestamp": "2022-04-17 17:10:29",
      "score": 19,
      "num_children": 0,
      "author": 140514,
      "replies": []
    },
    {
      "id": "i535vlc",
      "text": "Sadly the next step nationwide is a total ban on abortion. GOP running congress and SCOTUS will lead to this. They will push it through and then use the argument “vote for us or abortion is back”.\n\nThey are coming for all the human rights they hate:( They will deny us health care across the board. Join their cult or suffer the consequences:(",
      "timestamp": "2022-04-17 14:52:40",
      "score": 51,
      "num_children": 4,
      "author": 242458,
      "replies": [
        {
          "id": "i53rob0",
          "text": "From what I understand, the goal is to “leave it up to the states” instead of a ban. Which means all the dumbfuck GOP politicians get their future low-income capitalist slaves while the middle class and wealthy go fly to Colorado and get an abortion. And of course, Republicans themselves get abortions. Ask anyone who works at a clinic and they’ll tell you about Republicans screaming they’re all going to hell while getting an abortion herself.\n\nIt’s always been about punishing poor people with the GOP. It’s under the disguise of a holy crusade that gets white people in poverty really passionate about voting for people who hate them.",
          "timestamp": "2022-04-17 17:25:53",
          "score": 19,
          "num_children": 3,
          "replies": [
            {
              "id": "i53wvp2",
              "text": "Obligatory [“The Only Moral Abortion is My Abortion” ](https://joycearthur.com/abortion/the-only-moral-abortion-is-my-abortion/)",
              "timestamp": "2022-04-17 18:00:56",
              "score": 17,
              "num_children": 0,
              "author": 344536,
              "replies": []
            },
            {
              "id": "i53wwf7",
              "text": "I remember reading 100s of testimonies of the clinicians serving the pro-lifers. There were many that says, \"she and her mom were out front protesting us every day. Then, after the abortion they were right back out there, protesting us.\"\n\nIn my experience, most anti-abortionists are just delusional ass holes.",
              "timestamp": "2022-04-17 18:01:04",
              "score": 16,
              "num_children": 1,
              "author": 35328,
              "replies": [
                {
                  "id": "i578z49",
                  "text": "They probably didn't want that whole premarital sex thing (or whatever the circumstance) embarrassing the pastor. They couldn't possibly allow that. They must uphold that all-important image though, so for everyone else, it's still a sin.",
                  "timestamp": "2022-04-18 12:33:13",
                  "score": 2,
                  "num_children": 0,
                  "author": 310409,
                  "replies": []
                }
              ]
            },
            {
              "id": "i53vmb1",
              "text": "> the goal is to “leave it up to the states” instead of a ban.\n\nExcept for the places extending their bans to what people do in other states (e.g. Texas).\n\n\"Leave it up to the states\" has never been genuine. Pre Civil War the Southern states wanted the northern ones to bend to their will too, with the slave refugee acts.",
              "timestamp": "2022-04-17 17:52:22",
              "score": 11,
              "num_children": 2,
              "author": 55065,
              "replies": [
                {
                  "id": "i54l7hr",
                  "text": "Yeah, Missouri is looking to make it a crime to leave the state to obtain one. They're just driving rich people away, making the state further reliant on federal funding. Meanwhile the poor will be kept poor.",
                  "timestamp": "2022-04-17 20:54:44",
                  "score": 7,
                  "num_children": 0,
                  "author": 190280,
                  "replies": []
                },
                {
                  "id": "i53zs3y",
                  "text": "Is that even enforcable? It would be like going to Colorado to smoke some weed and then returning to Texas. Although I guess the GOP is less butthurt about weed being legal in some states and even benefitted massively from it, see: Alaska, Montana, Arizona and Michigan (although those two are purple).",
                  "timestamp": "2022-04-17 18:21:09",
                  "score": 5,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i53vhdd",
          "text": "Reminder that we have a Conservative Supreme Court as a direct result of not getting off our asses and voting in 2016.",
          "timestamp": "2022-04-17 17:51:27",
          "score": 11,
          "num_children": 1,
          "author": 10242,
          "replies": [
            {
              "id": "i57aya4",
              "text": "I mean there's more to it than that, but yeah it didn't help.",
              "timestamp": "2022-04-18 12:51:12",
              "score": 2,
              "num_children": 0,
              "author": 223197,
              "replies": []
            }
          ]
        },
        {
          "id": "i53887k",
          "text": ">Join their cult or suffer the consequences:\n\nThat's the worst part. Even if you do join them, you suffer. They've just convinced all their followers that riding on their coattails will benefit everyone, and we'll all get rich and powerful together.",
          "timestamp": "2022-04-17 15:09:38",
          "score": 26,
          "num_children": 1,
          "author": 253406,
          "replies": [
            {
              "id": "i53ex4a",
              "text": "No no, you don't understand 100 years of suffering here is nothing compared to the eternity of happiness you'll get in heaven! \n/s",
              "timestamp": "2022-04-17 15:57:33",
              "score": 6,
              "num_children": 0,
              "author": 288171,
              "replies": []
            }
          ]
        },
        {
          "id": "i567y31",
          "text": "Look at the bright side, it'll become trendy for us to assassinate politicians.  Personally I can't wait.  Ruling class hasn't been properly afraid of the proletariat in far too long.",
          "timestamp": "2022-04-18 04:42:44",
          "score": 1,
          "num_children": 0,
          "author": 85594,
          "replies": []
        }
      ]
    },
    {
      "id": "i53yusx",
      "text": "Ironic to me that the greatest religious force for good in the US is the satanic church. \n\nKnowing their views makes it understandable, I just find it ironic due to the vastly differing portrayals of both churches in media.",
      "timestamp": "2022-04-17 18:14:40",
      "score": 13,
      "num_children": 0,
      "author": 126785,
      "replies": []
    },
    {
      "id": "i53rd63",
      "text": "Wow. These Satanic Temple people are so close to converting me.",
      "timestamp": "2022-04-17 17:23:51",
      "score": 12,
      "num_children": 0,
      "author": 257393,
      "replies": []
    },
    {
      "id": "i53cana",
      "text": "I might have to join TST they seem to be doing good work.",
      "timestamp": "2022-04-17 15:38:48",
      "score": 37,
      "num_children": 2,
      "author": 144197,
      "replies": [
        {
          "id": "i55ditc",
          "text": "Joining is free - just signing up for emails, and they aren't spammy at all. Of course, there's also donations and fancy swag.\n\n^(yes, I paid $25 for a certificate and a card, just so I could say I'm a card carrying satanist lol)",
          "timestamp": "2022-04-18 00:25:16",
          "score": 8,
          "num_children": 0,
          "author": 75447,
          "replies": []
        },
        {
          "id": "i53th8h",
          "text": "I'm drinking from one of their mugs this morning. Everything I've bought from their shop has been pretty high quality--there are lots of ways to support their mission.",
          "timestamp": "2022-04-17 17:38:02",
          "score": 15,
          "num_children": 0,
          "author": 115650,
          "replies": []
        }
      ]
    },
    {
      "id": "i53w4jg",
      "text": "One of these “clinics” is right down the street from my home and it infuriates me every time I see it.  I went to one of these places after I was assaulted at 16. Instead of actually helping me look at my options rationally, they gave me baby cloths and told me to imagine my future child them. I made the mistake of giving them my contact info as I had been mislead to think it was an actual medical establishment of some kind. They hounded me with phone calls and hand written letters from old ladies begging me in the most manipulative language to keep my baby to term.",
      "timestamp": "2022-04-17 17:55:49",
      "score": 11,
      "num_children": 1,
      "author": 315907,
      "replies": [
        {
          "id": "i54eudh",
          "text": "I hope you were able to make the right choice for you despite those charlatans butting in!",
          "timestamp": "2022-04-17 20:09:27",
          "score": 7,
          "num_children": 0,
          "author": 242850,
          "replies": []
        }
      ]
    },
    {
      "id": "i54drow",
      "text": "Fake abortion clinics are a fucking atrocity on humanity. \"Oh you're young and pregnant? Well then here's some false medical info, a big heaping of nonsense guilt, aaand *vanish*\"\n\nFucking cowards",
      "timestamp": "2022-04-17 20:01:36",
      "score": 10,
      "num_children": 0,
      "author": 396601,
      "replies": []
    },
    {
      "id": "i534s20",
      "text": "God bless them.",
      "timestamp": "2022-04-17 14:44:34",
      "score": 10,
      "num_children": 2,
      "author": 138260,
      "replies": [
        {
          "id": "i5396j5",
          "text": "Which one?",
          "timestamp": "2022-04-17 15:16:27",
          "score": 3,
          "num_children": 1,
          "author": 400462,
          "replies": [
            {
              "id": "i53c3cy",
              "text": "The satanic temple. I wish I had their follow through. I'm really glad people like them and the pastafarians exist.",
              "timestamp": "2022-04-17 15:37:20",
              "score": 12,
              "num_children": 0,
              "author": 138260,
              "replies": []
            }
          ]
        },
        {
          "id": "i53ibqb",
          "text": "tbf Jesus would def support these Satanists more than the so called Christians in this case",
          "timestamp": "2022-04-17 16:21:21",
          "score": 8,
          "num_children": 0,
          "author": 398992,
          "replies": []
        }
      ]
    },
    {
      "id": "i53xy1u",
      "text": "All hail our fictional lord and savior, Satan.",
      "timestamp": "2022-04-17 18:08:15",
      "score": 9,
      "num_children": 0,
      "author": 231036,
      "replies": []
    },
    {
      "id": "i54ahud",
      "text": "It's strange that places like this exist.   \n\nYou note you don't hear about places where they pressure you into terminating the pregnancy.   With legitimate places that also really do provide you with access to abortion services, they simply lay out the options and don't pressure you into a choice.\n\nWith these \"crisis pregnancy centers,\" outside of linking someone to ancillary services like welfare, they also pressure women into keeping an unwanted pregnancy.  There are also stories of some shady stuff like providing fake ultrasound images to make it look like the fetus is further along.  \n\n\nThat pretty much tells me who the good guys are.   If you have to hard sell your service and use trickery or intentionally misleading information in the process, something is very wrong with what you are trying to do.\n\nThe only \"agenda\" that should be involved is providing a woman with her choices and supporting HER choice.",
      "timestamp": "2022-04-17 19:38:02",
      "score": 10,
      "num_children": 0,
      "author": 59966,
      "replies": []
    },
    {
      "id": "i53q14g",
      "text": "I hope they win all the lawsuits and sue those places back to the stone age where they belong.",
      "timestamp": "2022-04-17 17:14:53",
      "score": 7,
      "num_children": 0,
      "author": 33301,
      "replies": []
    },
    {
      "id": "i546fzk",
      "text": "I live in a *just barely * blue area of CA. Just barely blue because they are mostly still against abortion and they are just starting to warm to lgbtq+ rights and openness. Every. Fucking. Morning. I take my kids to school I hear the same bullshit ads on the radio for a “shelter and assistance” place in the county that “helps women with surprise pregnancies.” And “gives them all the options”. Except they NEVER mention abortion. Just adoption and that they will help you with diapers and clothing. Cause you know, that’s all a baby needs to survive. They advertise in the mornings because teenage girls are listening. It’s so fucking gross and I talk shit over it the entire time.",
      "timestamp": "2022-04-17 19:08:49",
      "score": 10,
      "num_children": 0,
      "author": 175134,
      "replies": []
    },
    {
      "id": "i5491m5",
      "text": "Why don't these people spend all this money on adoption and child care for unwanted babies instead of opening up these fake clinics?\n\nI get the impression they don't actually give a shit.",
      "timestamp": "2022-04-17 19:27:34",
      "score": 8,
      "num_children": 0,
      "author": 345709,
      "replies": []
    },
    {
      "id": "i53u241",
      "text": "If you do Amazon Smile, you can pick \"The Satanic Temple, Salem MA\" as a charity.  Just sayin'",
      "timestamp": "2022-04-17 17:42:00",
      "score": 21,
      "num_children": 1,
      "author": 298168,
      "replies": [
        {
          "id": "i541arn",
          "text": "Also you can download plugins to automatically redirect your browser to smile.amazon.com whenever you are on an amazon.com page. I kept forgetting to change my URL before purchasing things... not anymore!",
          "timestamp": "2022-04-17 18:31:52",
          "score": 6,
          "num_children": 0,
          "author": 180259,
          "replies": []
        }
      ]
    },
    {
      "id": "i55p6nx",
      "text": "It’s strange that Christians call abortion murder all the while believing that all children go to heaven. If that’s the case, abortion is filling heaven with citizens, who had they the chance to live a longer life the majority would end up in hell, according to Christian theology. Why does God force us to live a life of uncertainty and suffering then punish us for our mistakes?!",
      "timestamp": "2022-04-18 01:55:55",
      "score": 6,
      "num_children": 0,
      "author": 312816,
      "replies": []
    },
    {
      "id": "i53izsc",
      "text": "When the only sane institution left is the Satanic Temple.",
      "timestamp": "2022-04-17 16:26:01",
      "score": 15,
      "num_children": 0,
      "author": 122471,
      "replies": []
    },
    {
      "id": "i53ut9h",
      "text": "This is the reason I joined TST. This shit right here.",
      "timestamp": "2022-04-17 17:47:02",
      "score": 11,
      "num_children": 0,
      "author": 137842,
      "replies": []
    },
    {
      "id": "i53sq5b",
      "text": "Lol I wonder how they would feel if women just started leaving their children on their doorstep",
      "timestamp": "2022-04-17 17:33:00",
      "score": 3,
      "num_children": 0,
      "author": 318454,
      "replies": []
    },
    {
      "id": "i5526t9",
      "text": "The following is a report of crisis pregnany centers in 9 states. It details the misleading marketing scams, false information, lack of medical staff, scare tactics by using non-medical and non-science based terms that aren't real such as, \"post-abortion syndrome\", and the public dollars that are funneled into these places.\n\nCrisis Pregnancy Centers outnumber abortion clinics 3 to 1 nationally, and in some states 11 to 1. Most are affiliated with evangelical networks and anti-abortion organizations.\n\nhttps://alliancestateadvocates.org/crisis-pregnancy-centers/\n\nThank you Satanic Temple. Once again, doing great work!",
      "timestamp": "2022-04-17 22:58:23",
      "score": 2,
      "num_children": 0,
      "author": 97497,
      "replies": []
    },
    {
      "id": "i556aho",
      "text": "John Oliver did a really good segment on how disruptive, disruptive and destructive these are for proper health coverage and womens safety. \n\nhttps://youtu.be/4NNpkv3Us1I",
      "timestamp": "2022-04-17 23:29:39",
      "score": 3,
      "num_children": 0,
      "author": 132693,
      "replies": []
    },
    {
      "id": "i560l2n",
      "text": "Decades ago some loonball hatemongers started one of these about two blocks away from where I now live.  This is a college town, with one of the largest student populations in the country - which means tons of young people out on their own for the first time, vulnerable kids (they look like kids to me) who need protection.\n\nThese assholes have signs all over the building with seemingly-supportive messages - \"Pregnant?  Scared?  Come and let's talk.\" or \"Make the best decision, know the facts\".  It's disgusting, it's predatory, and I am beyond furious these people are treated like good shepherds by members of the City Council.",
      "timestamp": "2022-04-18 03:31:11",
      "score": 3,
      "num_children": 0,
      "author": 314170,
      "replies": []
    },
    {
      "id": "i53p1fj",
      "text": "Omg there’s a fake one near me, I think it’s Jehovah’s running it. At least it gives the Jehovah girls something to do besides being raped at home.",
      "timestamp": "2022-04-17 17:08:06",
      "score": 11,
      "num_children": 1,
      "author": 345937,
      "replies": [
        {
          "id": "i551ezw",
          "text": "All of a sudden Jehovah doesn’t have a witness.",
          "timestamp": "2022-04-17 22:52:32",
          "score": 4,
          "num_children": 0,
          "author": 292257,
          "replies": []
        }
      ]
    },
    {
      "id": "i53ootk",
      "text": "Who is funding these clinics?  It seems like there’s a lot of them and it seems unlikely a church is paying hundreds of thousands a year to keep them running.",
      "timestamp": "2022-04-17 17:05:40",
      "score": 3,
      "num_children": 2,
      "author": 168330,
      "replies": [
        {
          "id": "i53t5a1",
          "text": "Its the church\n\nYou really don't get a good sense of scale of how much money is in religion til you see it for yourself",
          "timestamp": "2022-04-17 17:35:49",
          "score": 7,
          "num_children": 0,
          "author": 209976,
          "replies": []
        },
        {
          "id": "i53vek7",
          "text": "I looked at the map. The one in my town is right next door to a church.",
          "timestamp": "2022-04-17 17:50:56",
          "score": 4,
          "num_children": 0,
          "author": 254009,
          "replies": []
        }
      ]
    },
    {
      "id": "i5415l2",
      "text": "The nurse will be with you shortly. I’m just going to set this bible down right her along with a picture of white Jesus massaging Donald Trump pecs and also play this Betamax tape of fetuses being blended for liberal stem cell research while their crying mothers scream for their dead babies.\nBack in a jiiff! The door will lock behind me…",
      "timestamp": "2022-04-17 18:30:50",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i54hea9",
      "text": "There are several of these in the area I live. I went on my own crusade to write Google reviews for all of them in the hopes that one vulnerable girl doesn't fall in their trap. If TST review bombed all these places, it might help reach the younger audience before they set foot in the door.",
      "timestamp": "2022-04-17 20:27:42",
      "score": 3,
      "num_children": 0,
      "author": 19873,
      "replies": []
    },
    {
      "id": "i553mzp",
      "text": "Ok...Imma start giving you money now.",
      "timestamp": "2022-04-17 23:09:25",
      "score": 3,
      "num_children": 0,
      "author": 149732,
      "replies": []
    },
    {
      "id": "i55tobf",
      "text": "I love these guys! It’s pretty crazy how savvy and effective they are, and they a great sense of humor. Two of my favorite things they have done here in AZ is to threaten to do prayers during government sessions if Christians were allowed to do them and they had adopted a highway here and were cleaning them with pitchforks. Hysterical. AND THEY PAY TAXES.",
      "timestamp": "2022-04-18 02:32:15",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i55uufz",
      "text": "That has to be illegal in some way, like imagine if I set up a 'clinic' to offer medical advice for cancer by selling them snake oil, I would get stopped eventually by the authorities, but this is just fine?",
      "timestamp": "2022-04-18 02:41:48",
      "score": 3,
      "num_children": 1,
      "author": 234230,
      "replies": [
        {
          "id": "i56ao1j",
          "text": "Well you pretty much just described homeopathy, and they also describe themselves as doctors.",
          "timestamp": "2022-04-18 05:13:07",
          "score": 3,
          "num_children": 0,
          "author": 300554,
          "replies": []
        }
      ]
    },
    {
      "id": "i5419w6",
      "text": "Feel like my mom worked or volunteered at one of these things for a few years.  \n\nTalked to her about it before and she just kept going on about how she only wanted to let women know all their options.",
      "timestamp": "2022-04-17 18:31:42",
      "score": 2,
      "num_children": 1,
      "author": 377072,
      "replies": [
        {
          "id": "i55dzep",
          "text": "> she only wanted to let women know all their options.\n\n\"Know all their options\" by specifically not mentioning one...",
          "timestamp": "2022-04-18 00:28:49",
          "score": 1,
          "num_children": 1,
          "author": 75447,
          "replies": [
            {
              "id": "i5616qg",
              "text": "Was careful not to be attacking because I have a decent enough relationship with her that even risky topics we can talk about unlike my dad who when even mentioning anything relating to religion starts screaming spittle with veins popping out of his head for anything remotely resembling a disagreement. \n\nShe still got pretty defensive.\n\nWhen she worked there I was still pretty young and actively partaking and even enjoying some of the community aspects that came with the religious brainwashing so I didn't question or even think about it back then.",
              "timestamp": "2022-04-18 03:36:36",
              "score": 2,
              "num_children": 0,
              "author": 377072,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i546y41",
      "text": "So, my problem with these clinics, is that I think some fall under non profit and benefit from the tax incentives depending on the state. Went to a Christian school as a kid, we were forced to give money to one of these as part of our schooling, more like coerced... But still. Good on the temple for doing this, the misinfo is crazy, and they usually drop support the moment the kids born, least in the cases I've seen. It's really a wolf in sheep's clothing for people in a very stressful moment.",
      "timestamp": "2022-04-17 19:12:31",
      "score": 2,
      "num_children": 0,
      "author": 65233,
      "replies": []
    },
    {
      "id": "i54moym",
      "text": "They should start “birthing clinics” and scam women into unwanted abortions if they want an equivalence. But satanists aren’t that evil.",
      "timestamp": "2022-04-17 21:05:25",
      "score": 2,
      "num_children": 0,
      "author": 332735,
      "replies": []
    },
    {
      "id": "i54zgct",
      "text": "As a Catholic, I love TST. They’re better Christians than most Christians. (A very low bar)",
      "timestamp": "2022-04-17 22:37:47",
      "score": 2,
      "num_children": 0,
      "author": 92092,
      "replies": []
    },
    {
      "id": "i55dk23",
      "text": "They will trick you into eating so you can't get an abortion. Horrible humans.",
      "timestamp": "2022-04-18 00:25:31",
      "score": 2,
      "num_children": 0,
      "author": 220460,
      "replies": []
    },
    {
      "id": "i55gcng",
      "text": "Fun fact: you can buy a notecard for $6.66 and choose how much you want to donate to the abortion rights fund\n\nThe notecard is sent to the person of your choosing and it says something along the lines of ‘x amount has been donated in your name to the Satanic Temples abortion ritual fund’ \n\nI know what I’m doing when I get paid \n\nThe options for donation are 10, 25, 50, 100, 666, 6.66 dollars 🔥",
      "timestamp": "2022-04-18 00:47:00",
      "score": 2,
      "num_children": 0,
      "author": 374187,
      "replies": []
    },
    {
      "id": "i55i7qf",
      "text": "In my area there are these billboards that have a picture of a young woman's face with the words \"My body, my choice\" and a phone number.  It's a Christian anti-abortion counseling service.  Classic bait-and-switch.  If it wasn't a non-profit it'd be a crime.",
      "timestamp": "2022-04-18 01:01:15",
      "score": 2,
      "num_children": 0,
      "author": 228721,
      "replies": []
    },
    {
      "id": "i55xxy0",
      "text": "If I ever win the Mega Millions lottery, I’m going to donate an obscene amount of money to these guys.",
      "timestamp": "2022-04-18 03:07:47",
      "score": 2,
      "num_children": 0,
      "author": 2692,
      "replies": []
    },
    {
      "id": "i56g5eb",
      "text": "Lying isn't a sin when *they* do it.",
      "timestamp": "2022-04-18 06:22:02",
      "score": 2,
      "num_children": 0,
      "author": 206875,
      "replies": []
    },
    {
      "id": "i56om3e",
      "text": "Good.  I'm glad my money is being used for good purpose, this is exactly why I donate.",
      "timestamp": "2022-04-18 08:18:25",
      "score": 2,
      "num_children": 0,
      "author": 315471,
      "replies": []
    },
    {
      "id": "i58d8lb",
      "text": "Ah, thank God for satanists. ;)",
      "timestamp": "2022-04-18 17:23:08",
      "score": 2,
      "num_children": 0,
      "author": 253769,
      "replies": []
    },
    {
      "id": "i53r4im",
      "text": "Wow even satan know Christians are the worst!",
      "timestamp": "2022-04-17 17:22:13",
      "score": 4,
      "num_children": 0,
      "author": 78395,
      "replies": []
    },
    {
      "id": "i53i54o",
      "text": "The Satanists just just start providing the exact same services that these mad evil anti-abortion Christians do. I wonder how the Christians will feel about being on the same side as the Satanists.",
      "timestamp": "2022-04-17 16:20:07",
      "score": 1,
      "num_children": 0,
      "author": 398992,
      "replies": []
    },
    {
      "id": "i537smd",
      "text": "If you support the Satanic Temple I recommend sending them money and buying your satanic memorabilia elsewhere. Unless your fine with things coming weeks/months later.\n\nEdit: I’m an impatient consumer.",
      "timestamp": "2022-04-17 15:06:30",
      "score": -4,
      "num_children": 3,
      "author": 47755,
      "replies": [
        {
          "id": "i53ezuq",
          "text": "If I need a hoodie tomorrow, Amazon prime. If I want to support TST, and get a hoodie, and occasionally advertise for TST, the 2 week lead time isn't a bother.\n\nYou do what's best for you. I sometimes get the urge to go to a coffee shop with a TST hoodie on, just for the reactions. 😀 That sort of behavior is almost never on a schedule, for me.",
          "timestamp": "2022-04-17 15:58:04",
          "score": 21,
          "num_children": 1,
          "author": 186185,
          "replies": [
            {
              "id": "i53ieyy",
              "text": "On top of this I think they have a good team fulfilling their orders. I’m definitely impatient.",
              "timestamp": "2022-04-17 16:21:59",
              "score": 5,
              "num_children": 0,
              "author": 47755,
              "replies": []
            }
          ]
        },
        {
          "id": "i53nkux",
          "text": "What’s your hurry?",
          "timestamp": "2022-04-17 16:58:00",
          "score": 3,
          "num_children": 1,
          "author": 323595,
          "replies": [
            {
              "id": "i53q5kx",
              "text": "The satanic rituals/orgies I go to are usually on short notice",
              "timestamp": "2022-04-17 17:15:43",
              "score": 6,
              "num_children": 1,
              "author": 47755,
              "replies": [
                {
                  "id": "i54czib",
                  "text": "Silly. That’s what the covid microchip was for.",
                  "timestamp": "2022-04-17 19:56:03",
                  "score": 1,
                  "num_children": 1,
                  "author": 323595,
                  "replies": [
                    {
                      "id": "i57abzt",
                      "text": "Was *that* it? God dammit I wanted better 5g!",
                      "timestamp": "2022-04-18 12:45:39",
                      "score": 1,
                      "num_children": 0,
                      "author": 223197,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i53tsgc",
          "text": "I've always gotten my orders within about 10 days. Seems like a small price to pay to support an independent shop with (I'm guessing) a quite small staff.",
          "timestamp": "2022-04-17 17:40:11",
          "score": 1,
          "num_children": 0,
          "author": 115650,
          "replies": []
        }
      ]
    },
    {
      "id": "i53nbcr",
      "text": "Doing god’s word",
      "timestamp": "2022-04-17 16:56:11",
      "score": 0,
      "num_children": 0,
      "author": 198478,
      "replies": []
    },
    {
      "id": "i53wkw4",
      "text": "Good people at the ST, I need to help fund them",
      "timestamp": "2022-04-17 17:58:54",
      "score": 1,
      "num_children": 0,
      "author": 63916,
      "replies": []
    },
    {
      "id": "i548bla",
      "text": "I don't see why people dont like the church of Satan. It's always either Twitter humor or actually good arguments like this.",
      "timestamp": "2022-04-17 19:22:23",
      "score": 1,
      "num_children": 1,
      "author": 92082,
      "replies": [
        {
          "id": "i55echy",
          "text": "Church of Satan ≠ the satanic temple.\n\nTst doesn't believe in actually Satan and are generally atheist flavored trolls (hi), the other is woo-y. Like tarot card woo",
          "timestamp": "2022-04-18 00:31:40",
          "score": 2,
          "num_children": 1,
          "author": 75447,
          "replies": [
            {
              "id": "i55sff7",
              "text": "I'm talking about the trolls. After looking at it again, I said the wrong one. I meant TST.",
              "timestamp": "2022-04-18 02:22:05",
              "score": 1,
              "num_children": 0,
              "author": 92082,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i54nzg5",
      "text": "All in the name of god. Because god is happy this people dedicated so much money and energy for thoes places instead of creating homes, fosterhomes, refugee or whatever the hell you could do if theu wereeven half of the \"good people\" they try to present themselves as",
      "timestamp": "2022-04-17 21:14:45",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i54yi98",
      "text": "I'd say they're doing God's work, but you know...",
      "timestamp": "2022-04-17 22:30:40",
      "score": 1,
      "num_children": 0,
      "author": 264451,
      "replies": []
    },
    {
      "id": "i5512y8",
      "text": "Do places like that don't have Google reviews that warn other women about what they actually do?",
      "timestamp": "2022-04-17 22:49:59",
      "score": 1,
      "num_children": 0,
      "author": 209308,
      "replies": []
    },
    {
      "id": "i55btre",
      "text": "The results of making it illegal are far worse than allowing it to be legal. I think having it legal allows people to abuse it but if we make it illegal I'm sure the infant and adult deaths would skyrocket to highs not seen before.\n\nDesperate people make Desperate choices that might put the infant in a situation to suffer a worse fate. Do I want to see a child die? The answer is obviously no but kids die everyday and suffer more than they should.\n\nTo be on either for it or against it is a hard stance to take, I'm not a female so I don't or won't ever truly understand the choice. Making a stance on the matter either way, well I see where both side are coming from.\n\nWhile some people on either side have I'll intentions the same can't be said for them all. Some people are against it because they love all life and don't want to see it end, while those for it understand a mother's situation or a father's situation and can understand the options they have and the choice they must make. \n \nIts truly sad to see the human condition and the way somethings have to play out and while I wish the answer was simple, it really isn't that simple. Not all situations end in warm fuzziness and unfortunately certain decisions must be made in the best interest of the parent and child. It's hard to know what that is sometimes and it's a crippling choice more often than not.",
      "timestamp": "2022-04-18 00:12:13",
      "score": 1,
      "num_children": 0,
      "author": 125100,
      "replies": []
    },
    {
      "id": "i55l3sp",
      "text": "Almost the same problem in Romania. Clinics and hospitals that need to help people with unwanted pregnancies are dilluding them in misinformation or fake guilt just to spread their religious agenda, which is mostly christian orthodoxy, but there are also baptists, catholics, pentacostals and methodists here. The problem is that satanism and other religious minorities, like zalmoxianism, or even secular groups, were very much opressed by the media, funded by politicians with the same agenda, cause we here have no left-leaning parties, only fake leftists and full on rightists or right-leaning centrists.",
      "timestamp": "2022-04-18 01:23:37",
      "score": 1,
      "num_children": 0,
      "author": 391775,
      "replies": []
    },
    {
      "id": "i55mivm",
      "text": "Welp. Hail Saran",
      "timestamp": "2022-04-18 01:34:52",
      "score": 1,
      "num_children": 0,
      "author": 348651,
      "replies": []
    },
    {
      "id": "i5763z9",
      "text": "I guess videos aren‘t allowed here. I am a clinic volunteer for about a year now, I always wear a body cam. I go over the video, edit it and send it to the clinic so they can see who the protestors are and what they are doing. In poring over hours and hours of footage I can clearly see the manipulative actions of the protestors on each other. I can see the pecking order, the leaders and their sycophants, the “holier than thou” attitudes. The saddest thing is when they bring children to the liturgy march that they do everyday. I want to rescue THEIR children. The kids always stare at us, we wear rainbow vests, carry rainbow umbrellas and have pride flags on our parking signs, so it’s pretty colorful and they’re curious. I can only imagine what the adults tell them about us, they’ve called us “the devil’s helpers” to our faces. They think we are Satanists and that abortions are child sacrifice rituals. It’s very sad.",
      "timestamp": "2022-04-18 12:05:14",
      "score": 1,
      "num_children": 0,
      "author": 120095,
      "replies": []
    },
    {
      "id": "i579h7g",
      "text": "I **hate** \"crisis pregnancy centres\" with a burning passion. Watch *12th and Delaware* if you want to see how the fucking snakes that run these centres spend their time lying - by giving the public the impression it's an abortion clinic in the first place, by giving women incorrect due dates, and with emotional manipulation like ultrasounds  with \"I LOVE YOU MOMMY\" typed at the bottom of a screen by whichever non-tech is scheduled to work that shift (these centres are often run by people who don't have any medical training - I know, it's a shock).\n\nWhile the Satantic Temple takes these cunts on in court, I'd love for any woman living near one of these place who has some cash and time to spare to do the following: buy urine from a pregnant woman online - it's possible they will test you - and then just spend a day wasting the fundies' time. \n\nMy hope is fucking with the people who work in these centres is already a fun and popular  pastime in the United States, and if it isn't, that it becomes so. What I want is for these people to live in constant fear that any woman who walks through their door is just there to ruin their day.",
      "timestamp": "2022-04-18 12:37:53",
      "score": 1,
      "num_children": 0,
      "author": 232062,
      "replies": []
    },
    {
      "id": "i58f3yi",
      "text": "I agree with the idea but pamphlets would be better if they were simply informative.  Having a big Satanic Temple logo on their flyers could scare off women of faith that need help obtaining an abortion simply by association with the devil.  \n\nThat being said I don't have time to stand around these place so I have been leaving informative reviews on local Crisis Pregnancy Center's google reviews so people know they do not offer or support abortion as a choice.  It's quick and easy and something everyone here that is pro-choice should be doing.",
      "timestamp": "2022-04-18 17:35:40",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i59rns4",
      "text": "VIP CRYPTO SIGNALS TELEGRAM. $25/Month. Dm if you want to know more or simply just sign up with the link. \n\nhttps://t.me/Botcryptosignalsbot",
      "timestamp": "2022-04-18 23:14:47",
      "score": 1,
      "num_children": 0,
      "author": 23902,
      "replies": []
    },
    {
      "id": "i5v9kky",
      "text": "Amen",
      "timestamp": "2022-04-23 11:58:31",
      "score": 1,
      "num_children": 0,
      "author": 165763,
      "replies": []
    },
    {
      "id": "i6u4ysq",
      "text": "Which clinics are being ran by this religion? Reminds me of those fake free tax apps, like TurboTax.",
      "timestamp": "2022-04-30 21:50:20",
      "score": 1,
      "num_children": 0,
      "author": 64292,
      "replies": []
    },
    {
      "id": "i7x68ny",
      "text": "Take my money!",
      "timestamp": "2022-05-09 14:09:38",
      "score": 1,
      "num_children": 0,
      "author": 330625,
      "replies": []
    },
    {
      "id": "iapqjp3",
      "text": "Watch This https://youtu.be/0dWJXTox77M",
      "timestamp": "2022-05-31 22:08:18",
      "score": 1,
      "num_children": 0,
      "author": 67971,
      "replies": []
    },
    {
      "id": "i56m3gr",
      "text": "As a religious person I really want to see what went wrong with those people... Surely people can use their brain once in a while,RIGHT? And don't get me wrong I'm pro life but not the \"abortion bad ban it\" type. But hey at least those people won't have to get an abortion to find out what's it like having to through with it(At least from the two experiences of close people having to get an abortion, it really didn't seem like an easy decision and I don't blame them)",
      "timestamp": "2022-04-18 07:42:26",
      "score": -4,
      "num_children": 1,
      "author": 157591,
      "replies": [
        {
          "id": "i57mqv4",
          "text": ">  I'm pro life but not the \"abortion bad ban it\" type\n\nThat's pro-choice.",
          "timestamp": "2022-04-18 14:23:49",
          "score": 2,
          "num_children": 1,
          "author": 93600,
          "replies": [
            {
              "id": "i585mlk",
              "text": "I do oppose abortion tho which by definition makes me pro life. The thing is I am against abortion but there are instances which it either can't be avoid like when there are risks of the mother dying or a rape victim. In general I believe the practice of safe sex should be encouraged and be mandatory to talk about it because a lot of abortion come from unwanted pregnancies.",
              "timestamp": "2022-04-18 16:32:14",
              "score": 1,
              "num_children": 1,
              "author": 157591,
              "replies": [
                {
                  "id": "i587gvm",
                  "text": "> \"abortion bad ban it\"\n\nSo, you *are* in favor of banning abortion except for certain instances? Or you are not in favor of banning abortion?",
                  "timestamp": "2022-04-18 16:44:27",
                  "score": 2,
                  "num_children": 1,
                  "author": 93600,
                  "replies": [
                    {
                      "id": "i589jpd",
                      "text": "They way you say it sounds like you either want to ban it or not. When as I said there are instances when I do people a woman should have the option to get an abortion but in general I'm against it",
                      "timestamp": "2022-04-18 16:58:03",
                      "score": 1,
                      "num_children": 1,
                      "author": 157591,
                      "replies": [
                        {
                          "id": "i58kyd3",
                          "text": ">  but in general I'm against it\n\nSo, there are cases where you believe it should be illegal for a woman to get an abortion?",
                          "timestamp": "2022-04-18 18:14:22",
                          "score": 2,
                          "num_children": 0,
                          "author": 93600,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i54raju",
      "text": "No",
      "timestamp": "2022-04-17 21:38:37",
      "score": -9,
      "num_children": 0,
      "author": 193915,
      "replies": []
    },
    {
      "id": "i54g62i",
      "text": "[removed]",
      "timestamp": "2022-04-17 20:18:57",
      "score": -14,
      "num_children": 2,
      "replies": [
        {
          "id": "i54kze0",
          "text": "Why not use your own brain and realize a bundle of fertilized cells isn't a person?",
          "timestamp": "2022-04-17 20:53:07",
          "score": 14,
          "num_children": 0,
          "author": 241133,
          "replies": []
        },
        {
          "id": "i55gtlv",
          "text": "No babies are murdered",
          "timestamp": "2022-04-18 00:50:32",
          "score": 8,
          "num_children": 0,
          "author": 197299,
          "replies": []
        }
      ]
    },
    {
      "id": "i52sbor",
      "text": "[removed]",
      "timestamp": "2022-04-17 13:02:59",
      "score": -200,
      "num_children": 12,
      "replies": [
        {
          "id": "i52uidw",
          "text": "At least the Satanic Temple doesn’t molest children and protect pedophiles like it’s their job.",
          "timestamp": "2022-04-17 13:22:35",
          "score": 102,
          "num_children": 0,
          "author": 48955,
          "replies": []
        },
        {
          "id": "i52try3",
          "text": "So what does that make the religious…? \nControlling kids looking to rule and control us with a made-up “god”",
          "timestamp": "2022-04-17 13:16:09",
          "score": 39,
          "num_children": 1,
          "author": 413154,
          "replies": [
            {
              "id": "i52vkqc",
              "text": "So ... the bully?",
              "timestamp": "2022-04-17 13:31:55",
              "score": 16,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i531uhh",
          "text": "No. The Satanic Temple is a politically motivated group of people formed to show religious nuts that EVERYONE’S religion has to be respected, no matter what.",
          "timestamp": "2022-04-17 14:22:37",
          "score": 37,
          "num_children": 0,
          "author": 409892,
          "replies": []
        },
        {
          "id": "i52uflm",
          "text": "Account less than a day old. All posts in r/atheism insulting atheists. Troll if I ever saw one.",
          "timestamp": "2022-04-17 13:21:54",
          "score": 77,
          "num_children": 0,
          "author": 388808,
          "replies": []
        },
        {
          "id": "i537xos",
          "text": "New account = troll",
          "timestamp": "2022-04-17 15:07:33",
          "score": 19,
          "num_children": 0,
          "author": 351005,
          "replies": []
        },
        {
          "id": "i52totz",
          "text": "The Satanic Temple is doing a lot of good work protecting religious freedom and the separation of church and state while helping protect some other fundamental rights along the way. That being said, I am sure plenty of their card carrying members are indeed edgy kids looking for attention.",
          "timestamp": "2022-04-17 13:15:22",
          "score": 40,
          "num_children": 1,
          "author": 11008,
          "replies": [
            {
              "id": "i52tu5k",
              "text": "He is a christian troll.",
              "timestamp": "2022-04-17 13:16:42",
              "score": 50,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i52xc9i",
          "text": "The Satanic Temple is doing the lord’s work.",
          "timestamp": "2022-04-17 13:46:35",
          "score": 32,
          "num_children": 0,
          "author": 404681,
          "replies": []
        },
        {
          "id": "i53noha",
          "text": "An account that’s less than a day old and all the comments are hateful. \nWho’s looking for attention ???",
          "timestamp": "2022-04-17 16:58:42",
          "score": 6,
          "num_children": 0,
          "author": 294761,
          "replies": []
        },
        {
          "id": "i5377bs",
          "text": "You are brainwashed",
          "timestamp": "2022-04-17 15:02:15",
          "score": 14,
          "num_children": 0,
          "author": 186076,
          "replies": []
        },
        {
          "id": "i53ie0t",
          "text": "Reddit moment.",
          "timestamp": "2022-04-17 16:21:48",
          "score": 4,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i53igxs",
          "text": "[removed]",
          "timestamp": "2022-04-17 16:22:22",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "i53kgib",
              "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
              "timestamp": "2022-04-17 16:36:22",
              "score": 2,
              "num_children": 0,
              "author": 122319,
              "replies": []
            }
          ]
        },
        {
          "id": "i52uyqf",
          "text": "[removed]",
          "timestamp": "2022-04-17 13:26:36",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "i52v0n3",
              "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for using abusive language, personal attacks, being a dick, or fighting with other users. These activities are against the [rules](https://www.reddit.com/r/atheism/wiki/guidelines).   \r\nConnected comments may also be removed for the same reason, though editing out the direct attack may merit your comment being restored.  Users who don't cease this behavior may get banned temporarily or permanently.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
              "timestamp": "2022-04-17 13:27:04",
              "score": 5,
              "num_children": 0,
              "author": 122319,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i53tq0n",
      "text": "[deleted]",
      "timestamp": "2022-04-17 17:39:45",
      "score": -18,
      "num_children": 6,
      "replies": [
        {
          "id": "i5400qo",
          "text": "I didn't know we had a king. I thought we were an autonomous collective.",
          "timestamp": "2022-04-17 18:22:51",
          "score": 12,
          "num_children": 0,
          "author": 59966,
          "replies": []
        },
        {
          "id": "i544gsj",
          "text": "Then where is he?",
          "timestamp": "2022-04-17 18:54:31",
          "score": 5,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i5468hw",
          "text": "Tom Brady has 7 more super bowl rings than Jesus",
          "timestamp": "2022-04-17 19:07:20",
          "score": 6,
          "num_children": 0,
          "author": 287947,
          "replies": []
        },
        {
          "id": "i54bkhj",
          "text": "Oh yeah? If your Jesus showed up today you'd be one of the first ones to murder him...again. The Satanic Temple actually follows the teachings of your boy more than you.",
          "timestamp": "2022-04-17 19:45:47",
          "score": 3,
          "num_children": 0,
          "author": 238193,
          "replies": []
        },
        {
          "id": "i54ivnn",
          "text": "WTF planet are you from. Elvis is the King.",
          "timestamp": "2022-04-17 20:38:15",
          "score": 3,
          "num_children": 0,
          "author": 329908,
          "replies": []
        },
        {
          "id": "i54ngx2",
          "text": "We kinda abolished monarchy.\n\nHe can be king or whatever he wants somewhere else.",
          "timestamp": "2022-04-17 21:11:03",
          "score": 1,
          "num_children": 0,
          "author": 296627,
          "replies": []
        }
      ]
    },
    {
      "id": "i54qp7d",
      "text": "If the temple is about empowering people to do what they want to do why are they trying to interfere with what these people want to do?",
      "timestamp": "2022-04-17 21:34:18",
      "score": -14,
      "num_children": 1,
      "replies": [
        {
          "id": "i5519y3",
          "text": "Because its the right of a person to have an abortion, and majority religious regions are using sly tactics to push back abortion dates and manipulate people out of abortion so they can stop them for their own christian agenda, in a way infringing on their rights by refusing the service. The satanic temple is just going to point out the obvious and try to stop them, same way normal people would react to their rights being taken away.",
          "timestamp": "2022-04-17 22:51:29",
          "score": 13,
          "num_children": 0,
          "author": 292257,
          "replies": []
        }
      ]
    },
    {
      "id": "i55hftj",
      "text": "Need to start delivering the death penalty to anybody who is involved in full term abortion",
      "timestamp": "2022-04-18 00:55:20",
      "score": -14,
      "num_children": 2,
      "replies": [
        {
          "id": "i56rc9v",
          "text": "So you want to kill people for helping with an abortion? That's not very pro life of you",
          "timestamp": "2022-04-18 08:57:41",
          "score": 4,
          "num_children": 1,
          "replies": [
            {
              "id": "i56zmga",
              "text": "I’m not pro life",
              "timestamp": "2022-04-18 10:51:55",
              "score": -2,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i56e9sa",
          "text": "starting with you",
          "timestamp": "2022-04-18 05:57:29",
          "score": 2,
          "num_children": 1,
          "author": 52479,
          "replies": [
            {
              "id": "i56znr3",
              "text": "I’m not involved in full term abortions",
              "timestamp": "2022-04-18 10:52:23",
              "score": -1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i55ku27",
      "text": "[removed]",
      "timestamp": "2022-04-18 01:21:31",
      "score": -11,
      "num_children": 2,
      "replies": [
        {
          "id": "i56eaav",
          "text": "[removed]",
          "timestamp": "2022-04-18 05:57:41",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i57ake8",
          "text": "[removed]",
          "timestamp": "2022-04-18 12:47:46",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "i57bo8x",
              "text": "[removed]",
              "timestamp": "2022-04-18 12:57:34",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "i57dukf",
                  "text": "[removed]",
                  "timestamp": "2022-04-18 13:16:11",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i54fxbd",
      "text": "[removed]",
      "timestamp": "2022-04-17 20:17:16",
      "score": -5,
      "num_children": 1,
      "replies": [
        {
          "id": "i54m6v6",
          "text": "Not always a 100% effective.",
          "timestamp": "2022-04-17 21:01:51",
          "score": 5,
          "num_children": 0,
          "author": 87493,
          "replies": []
        }
      ]
    },
    {
      "id": "i55xs65",
      "text": "Yeah right they're just selling T-shirts and bullshiting you",
      "timestamp": "2022-04-18 03:06:25",
      "score": -4,
      "num_children": 0,
      "author": 405582,
      "replies": []
    },
    {
      "id": "i56qgvf",
      "text": "Why can't people just have the kid and drown it like an adult?  They circumsize, they swear everything is ADHD, then you got 2+2=4. Don't monkeys drown their young?",
      "timestamp": "2022-04-18 08:45:05",
      "score": -2,
      "num_children": 0,
      "author": 287643,
      "replies": []
    },
    {
      "id": "i54yv6k",
      "text": "I don’t know if the guys in this board will agree with me but they’d be cooler if they actually did worship satan",
      "timestamp": "2022-04-17 22:33:23",
      "score": 0,
      "num_children": 0,
      "author": 197444,
      "replies": []
    }
  ]
}