{
  "id": "u7mgw5",
  "text": "The patriarchy is a feminist conspiracy theory\n",
  "timestamp": "2022-04-20 02:50:19",
  "score": 565,
  "subreddit": "t5_2zaj2",
  "num_children": 15,
  "replies": [
    {
      "id": "i5fu2z5",
      "text": "Take hitlers jew conspiracy theory, replace jews with men,  and you have patriarchy theory",
      "timestamp": "2022-04-20 03:58:42",
      "score": 61,
      "num_children": 4,
      "author": 72781,
      "replies": [
        {
          "id": "i5fzgaz",
          "text": "DER MENSCHEN.",
          "timestamp": "2022-04-20 04:49:01",
          "score": 13,
          "num_children": 0,
          "author": 227146,
          "replies": []
        },
        {
          "id": "i5g0b6f",
          "text": "And take reasons why racist people say they’re afraid of black people and replace black people with men and you have feminists being afraid of men",
          "timestamp": "2022-04-20 04:57:49",
          "score": 26,
          "num_children": 1,
          "replies": [
            {
              "id": "i5gqcle",
              "text": "Oof I though I would be hard to come up with a dumber take than the last guy. God damn. You did it.",
              "timestamp": "2022-04-20 10:37:45",
              "score": -14,
              "num_children": 3,
              "author": 206027,
              "replies": [
                {
                  "id": "i5h2u15",
                  "text": "Oof I thought it would be hard for a feminist to come up with a really dumb take against these factually and statistically supported comparisons. God damn. You did it.",
                  "timestamp": "2022-04-20 12:43:00",
                  "score": 7,
                  "num_children": 2,
                  "author": 267820,
                  "replies": [
                    {
                      "id": "i5hc3al",
                      "text": "Let's try out your men are like Jews in nazi Germany Idea. Just replace the word jew with man right?\n\nThe claim that there was a manish war against women Germany is an antiman conspiracy theory promoted in woman propaganda which asserts that men, acting as a single historical actor, started World War II and sought the destruction of woman Germany. Alleging that war was declared in 1939 by Chaim Weizmann, president of the World Man Organization, women used this false notion to justify the persecution of men under woman German control on the grounds that the manocaust was justified self-defense. Since the end of World War II, the conspiracy theory has been popular among neo-women and manocaust deniers.",
                      "timestamp": "2022-04-20 13:53:59",
                      "score": 1,
                      "num_children": 1,
                      "author": 206027,
                      "replies": [
                        {
                          "id": "i5hshkr",
                          "text": "Sometimes people on the internet indulge in a thing called \"humor\". You seem to be good at google, try googling that.",
                          "timestamp": "2022-04-20 15:43:55",
                          "score": 1,
                          "num_children": 1,
                          "author": 177432,
                          "replies": [
                            {
                              "id": "i5hye2f",
                              "text": "I tried searching for that and all that came up were pictures of you getting fucked by your dad.\nIs that humour or am I missing something?\n\nI’ve never heard of this humour thing.\nI certainly wasn’t using it when I replaced the references to Jews and nazis with men and women.",
                              "timestamp": "2022-04-20 16:21:59",
                              "score": 2,
                              "num_children": 1,
                              "author": 206027,
                              "replies": [
                                {
                                  "id": "i5i5uii",
                                  "text": "Damn, you need to chill",
                                  "timestamp": "2022-04-20 17:09:33",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 177432,
                                  "replies": [
                                    {
                                      "id": "i5idy3k",
                                      "text": "I thought it was funny.\nWell. maybe humour is subjective.",
                                      "timestamp": "2022-04-20 18:01:04",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 206027,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i5ha4qs",
                      "text": "Facts and statistics?\nCare to share any?\nOr just quote cringey versions of my mine comments back at me?",
                      "timestamp": "2022-04-20 13:39:51",
                      "score": 0,
                      "num_children": 0,
                      "author": 206027,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i5gxvjh",
                  "text": "How is that so dumb?",
                  "timestamp": "2022-04-20 11:59:09",
                  "score": 7,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i5h7rtk",
                      "text": "No you are right. It is a perfect one to one comparison. Lol\nLet's try it.\n\n\n\"The psychiatrist was the first to introduce the concept of menphobia, pointing to the hatred of man people and man culture by man people themselves. Indeed, he asserts that menphobia is a form of \"trauma for women people of the man\". \nEquivalent to internalised racism caused by the trauma of living in a culture defining man people as inherently evil, Fanon emphasises the slight existing cultural intricacies caused by the vast diversity of man people and cultures, as well as the nature of their colonisation by women Europeans. The symptoms of such black manphobia include a rejection of their native or ethnic language in favour of female European languages, a marked preference for female European cultures over man cultures, and a tendency to surround themselves with softer skinned people rather than hard skinned ones.\n\nSimilarly, the pattern further includes attributing negative characteristics to man people, culture, and things. Toni Morrison's novel The Bluest Eye (1970) stands as an illustrative work on the destroying effects of Negrophobia among the man community on themselves. Indeed, the main character, Pecola Breedlove, through his non-reconciliation with his man identity, her man societal indifference and her craving for symbolic blue eyes, presents all the signs of an internalised Manhobia.  She develops an anti-man neurosis due to her feeling of non-existence both within the female and his own community.",
                      "timestamp": "2022-04-20 13:22:11",
                      "score": -5,
                      "num_children": 2,
                      "author": 206027,
                      "replies": [
                        {
                          "id": "i5hyn90",
                          "text": "🤸‍♂️🥇",
                          "timestamp": "2022-04-20 16:23:36",
                          "score": 3,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i5idig4",
                              "text": "The mental gymnastics is me doing an example of the guy on your sides statement?\nI was just demonstrating his point.\nSo I will graciously decline the medal so he can claim the validation for his dumb idea.",
                              "timestamp": "2022-04-20 17:58:20",
                              "score": 2,
                              "num_children": 0,
                              "author": 206027,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "i5hpct2",
                          "text": "If a woman is afraid of men because of trauma, she’s just gonna have to deal with it because it’s not those other men’s faults. Imagine if someone said they’re afraid of black people because a black person robbed them once.",
                          "timestamp": "2022-04-20 15:23:43",
                          "score": 11,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i5hzxok",
                              "text": "Wow, imagine. \nThe point is I took a paragraph on negrophobia and replaced the words white and black and replaced them with man and woman. \nThe fact that you didn’t seem to notice is concerning.\n\nHint. There are no female languages and men haven’t been colonised but European women.\nGood gravy.\n\nAgain, it is a terrible comparison because women women aren’t the group dominate power group in society. And men are historically marginalised like the black community in Eurocentric societies.",
                              "timestamp": "2022-04-20 16:31:56",
                              "score": -4,
                              "num_children": 1,
                              "author": 206027,
                              "replies": [
                                {
                                  "id": "i5ikj4h",
                                  "text": "Judging by your avatar you’re a man, no? Why are you defending women who are afraid of men?",
                                  "timestamp": "2022-04-20 18:44:08",
                                  "score": 7,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i5i78zh",
                  "text": "Take a Elephant replace that with a tiger and then take a whale and then throw the tiger into the ocean.  Then ride the elephant to a gay bar and protest like never before.  Gay men support the patriarchy as you know.  It would also be helpful to train a parrot to say things like “Take men out of Women” n “free the nipple”.",
                  "timestamp": "2022-04-20 17:18:33",
                  "score": 2,
                  "num_children": 1,
                  "author": 288463,
                  "replies": [
                    {
                      "id": "i5ie563",
                      "text": "You think gay men support the patriarchy?",
                      "timestamp": "2022-04-20 18:02:21",
                      "score": 2,
                      "num_children": 1,
                      "author": 206027,
                      "replies": [
                        {
                          "id": "i5mbtom",
                          "text": "Yep a male only club.",
                          "timestamp": "2022-04-21 14:22:04",
                          "score": 1,
                          "num_children": 0,
                          "author": 288463,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i5h0zu7",
          "text": "A group of scholars made fake research papers and posted them to intersectional grievance study fields and many of them passed. A few included direct quotations from Hitler. The point of them was to prove these fields gave no academic rigor.",
          "timestamp": "2022-04-20 12:27:18",
          "score": 10,
          "num_children": 2,
          "author": 190961,
          "replies": [
            {
              "id": "i5hkjat",
              "text": "\"Our struggle is my struggle\" doubly funny since half the title is the English translation of \"mein kampf\". They said 'feminist ideology is hitlers book' right in the title of their paper",
              "timestamp": "2022-04-20 14:51:46",
              "score": 7,
              "num_children": 0,
              "author": 72781,
              "replies": []
            },
            {
              "id": "i5i7034",
              "text": ">and most of them passed.\n\nNot true. Only a handful passed and we're either published or slated for publication. Most of them were politely refused, generally with notes on where or how they needed work and a suggestion they might consider resubmitting it in the future. None got a response along the lines of utterly refusing to publish anything along that topic ever though. \n\nTo be fair, I think a big part of their problem was not trying to understand the field first.  I'm not saying they wouldn't publish all sorts of bullshit, but it has to be properly refined bullshit.\n\nI think I still have a link to the Google drive with the papers they submitted if anyone is interested.",
              "timestamp": "2022-04-20 17:16:58",
              "score": 1,
              "num_children": 1,
              "author": 229549,
              "replies": [
                {
                  "id": "i5i7dal",
                  "text": "I'll edit that",
                  "timestamp": "2022-04-20 17:19:18",
                  "score": 2,
                  "num_children": 0,
                  "author": 190961,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i5gq8ak",
          "text": "Take being smart and replace the smart part with being and idiot and you have your comment. Lol",
          "timestamp": "2022-04-20 10:36:16",
          "score": -8,
          "num_children": 2,
          "author": 206027,
          "replies": [
            {
              "id": "i5h3g0h",
              "text": "Typical feminist behaviour right there\n\n“You’re like a really smart person except replace smart with dumb and that’s what you are.”\n\nBluntly forced twists with phrases of your own, in a childlike manner that you think makes you sound clever or humorous\n\nAnd I bet all of your toxic girl friends would tell you some shit like “YAAAAAAS SLAY QUEEN YOU’RE SO CLEVER 💅” simply because they agree with the narrative you’re trying to push",
              "timestamp": "2022-04-20 12:48:01",
              "score": 10,
              "num_children": 2,
              "author": 267820,
              "replies": [
                {
                  "id": "i5hjjad",
                  "text": "Feminists don't joke for laughter,  their objective is clapter. Thing is,  I don't even think their low tribal standards would get like on that comment.",
                  "timestamp": "2022-04-20 14:45:07",
                  "score": 4,
                  "num_children": 0,
                  "author": 72781,
                  "replies": []
                },
                {
                  "id": "i5h9ttu",
                  "text": "Do you think impersonating something you think is cringe makes you sound cringe?\n\nIm in your echo chamber.\nDo you agree with his point? \nCan you can you defend his point?\nOr are you just jumping in to defend him simply because you agree with the narrative he is trying to push?\nYou know like a hypocrite.",
                  "timestamp": "2022-04-20 13:37:37",
                  "score": 0,
                  "num_children": 1,
                  "author": 206027,
                  "replies": [
                    {
                      "id": "i5iazyg",
                      "text": "While I do understand that not everyone who identifies as feminist will be extremist and unjustly hateful towards men, it is still quite prevalent among worldwide media and they currently possess a heavy influence on our younger generation.\n\nI am not jumping in to defend OC, because you didn’t quite provide an argument against what they said, you just proceeded to insult them.\n\nSimply insulting them was nothing to me, but the way that you delivered your insult was so obnoxious in such a way that I had to jump in to indirectly and verbosely tell you to ***shut the hell up***",
                      "timestamp": "2022-04-20 17:42:25",
                      "score": 3,
                      "num_children": 1,
                      "author": 267820,
                      "replies": [
                        {
                          "id": "i5ifwgy",
                          "text": "I have written the same point half a dozen times around this dumb thread.\n\nMen are like Jews in ww2 because men aren’t the minority group.\nImplying that being a man like being a holocaust jew is ludicrous.\n\nIt is good that you acknowledge not all feminists are extreme.\nIt is likely a lot less that you think given that basic ideas are very mainstream. And you follow communities like this that show you the worst most extreme ones all the time.\nThe ones who ideas barely have to be fought because they are so fringe and dumb that no one weird outsiders wants to adopt them.",
                          "timestamp": "2022-04-20 18:13:53",
                          "score": 1,
                          "num_children": 0,
                          "author": 206027,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i5gx9wp",
              "text": "Nobody feed the trolls.",
              "timestamp": "2022-04-20 11:53:22",
              "score": 3,
              "num_children": 1,
              "author": 249335,
              "replies": [
                {
                  "id": "i5h8lrk",
                  "text": "Nobody defend your dumb opinions.\nClose your eyes. Block your ears guys. Nobody learn anything.\n\nWere Jews the dominant power group in pre ww2 Germany?\nAre black people the dominant power group in America and other western countries?",
                  "timestamp": "2022-04-20 13:28:29",
                  "score": 0,
                  "num_children": 0,
                  "author": 206027,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i5ftukw",
      "text": "To be fair, some conservatives believe in really weird shit. Nothing will top \"The patriarchy\" though",
      "timestamp": "2022-04-20 03:56:39",
      "score": 29,
      "num_children": 2,
      "replies": [
        {
          "id": "i5h8lv9",
          "text": "I agree but there were many things disregarded as \"far right conspiracy theories\" that turned out 100% true a few months later.",
          "timestamp": "2022-04-20 13:28:30",
          "score": 8,
          "num_children": 0,
          "author": 13736,
          "replies": []
        },
        {
          "id": "i5fzewc",
          "text": "Feminism isn't a left wing ideology, it's centrist. \n\nThat's why Marxist feminism isn't redundant. It's exponentially stupider than either alone.",
          "timestamp": "2022-04-20 04:48:37",
          "score": 9,
          "num_children": 4,
          "author": 227146,
          "replies": [
            {
              "id": "i5g4p0p",
              "text": "I would say, more precisely, that it is **authoritarian** centrist.\n\nI say this as a libertarian centrist who is thoroughly disgusted by authoritarianism in all of its forms.",
              "timestamp": "2022-04-20 05:45:47",
              "score": 13,
              "num_children": 3,
              "author": 51429,
              "replies": [
                {
                  "id": "i5g5928",
                  "text": "...It can be...\n\nYou're not wrong, but feminism stated as a libertarian ideology... ironically. It started as what we now call today classical liberalism. \n\nBut today the ideology is dominated by authoritarians. Which is why theres an enormous divide between the two current generations of feminism.  Old feminists were like 'we want to be able to work and own property', and the current ones are like 'heil neue world order'",
                  "timestamp": "2022-04-20 05:52:05",
                  "score": 6,
                  "num_children": 2,
                  "author": 227146,
                  "replies": [
                    {
                      "id": "i5gfq7f",
                      "text": "I'm of the opinion that Feminism began as an authoritarian ideology.\n\nThe Suffragette movement, proto-Feminism, was also authoritarian, I think.\n\nIt was created and run by rich, upper-class, well-to-do women who wanted the right to vote without the responsibilities. That is, without having to be conscripted into the army, as men were, in order to be able to vote.\n\nThe very roots of Feminism lie in the desire for rights without responsibilities, for special privileges, exclusive to women.\n\nThe founders of Feminism were even extremely anti-male.\n\nNothing \"libertarian\" about that.",
                      "timestamp": "2022-04-20 08:09:59",
                      "score": 6,
                      "num_children": 1,
                      "author": 51429,
                      "replies": [
                        {
                          "id": "i5l5rin",
                          "text": ">I'm of the opinion that Feminism began as an authoritarian ideology.  \n>  \n>Nothing \"libertarian\" about that.\n\nYou're confusing modern liberals with the liberals of that century...\n\nAlso probably confusing the modern libertarian movement with the word 'libertarian' which is not a term limited to modern libertarianism, it's only the name of a party/ideology.\n\n~~They were autocratic. Not authoritarian. Which are similar, but different.~~\n\nEdit: nevermind, this is wrong, you're right.\n\n>It was created and run by rich, upper-class, well-to-do women who wanted the right to vote without the responsibilities. That is, without having to be conscripted into the army, as men were, in order to be able to vote\n\nExactly. Upper class is the class of authoritarian oligarchy.  They want authoritarian control of the market, but liberal social rules.",
                          "timestamp": "2022-04-21 06:48:21",
                          "score": 1,
                          "num_children": 0,
                          "author": 227146,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i5gg59v",
                      "text": ">classical liberalism.\n\nCareful.  Many people (not you) confuse the domestic political term with the IR term.  \n\nAs for feminists being centrists, I was a *militant* centrist social libertarian.  In America, I have been either a \"Blue Dog Democrat or a \"Conservative with a Consicence\", depending on who's playing on the field.  If you're familiar with Canadian politics, I'm PPC.  Think: economic conservative, and a cheap, isolationist-outside-of-NATO hawk that doesn't give a shit what adults do in their bedrooms as long as it doesn't infringe on my liberties.   Like many I got pushed to the right because of today's authoritarian and batshit left.  I know centrists.\n\nYou cannot look ANYONE in the eye here and say that feminism was EVER centrist.  If you can, please tell us about the relationship between the Suffragettes and the White Feather movement.  The White Feathers were the OPPOSITE of centrists.  Oh, and most centrists believe in a balance of rights and responsibilities.  The original feminists wanted the right to vote, but zero parts of mustard gas. How convenient.\n\nAnd the 2nd wavers?  There's NO way they were centrists.  To be fair to them, the weakness of centrism is that we don't have enough violent force to affect social changes.  Centrism is great for a \"homeostasis\" of sorts.  But when you need society moved, the radicals are the only way forward. MLK needed X for this very reason.",
                      "timestamp": "2022-04-20 08:16:12",
                      "score": 2,
                      "num_children": 0,
                      "author": 389946,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i5g7toz",
                  "text": "It's sad how both Republicans and Democrats want an extremely authoritarian regime. I really hope the libertarian party becomes mainstream.",
                  "timestamp": "2022-04-20 06:22:39",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "i5ge1vs",
                  "text": "I thought myself to be a conservative libertarian but when I took my political compass test it said that I'm a left libertarian. Strange. I do really love liberty.",
                  "timestamp": "2022-04-20 07:45:57",
                  "score": 2,
                  "num_children": 2,
                  "author": 359927,
                  "replies": [
                    {
                      "id": "i5l6o1l",
                      "text": "It's biased towards the left. I'm moderate right but I get moderate left. \n\nIf you look at the concentrations of results even adjusted for age it's wayyyyy too left wing libertarian.",
                      "timestamp": "2022-04-21 07:00:18",
                      "score": 1,
                      "num_children": 0,
                      "author": 227146,
                      "replies": []
                    },
                    {
                      "id": "i5laggb",
                      "text": "Liberty comes from the word liber which means free.\nLiberals are also free, liberal arts study is free thinking.\nDepends what you are trying to be free from.\nFreedom is American is a different thing. They are obviously many interpretations of words and different ideologies and cultures build different things into the meaning of words.\nFreedom is American is more about individualism. No or little government intervention in personal or business matters. It is about being a cowboy, taking care of yourself and your family and living out of the ranch. Fuck the town. Fuck society. Fuck infrastructure \nmaybe a free enterprise can build the stuff we need. Hopefully it is profitable for them to run phone lines and roads out to my property because otherwise no one will.",
                      "timestamp": "2022-04-21 07:53:05",
                      "score": 1,
                      "num_children": 0,
                      "author": 206027,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i5gco14",
              "text": "Feminism is based on socialism making it left-wing (descending from the left-wing of the French revolution). You are just labeling anything you don't like as not left-wing, or just accepting the re-normalisation which destroys any meaning. \n\nFundamentally all left-wing ideologies have to accept Russeau's position on human nature and society to make any sense. That is demonstrably false, hence why (not the only reason) all left-wing ideologies fail. Another aspect of it is using fiction as if it is fact to gain power being a good thing, \"patriarchy theory\" is an example of that.",
              "timestamp": "2022-04-20 07:26:16",
              "score": 3,
              "num_children": 2,
              "author": 73047,
              "replies": [
                {
                  "id": "i5l5v1h",
                  "text": ">You are just labeling anything you don't like as not left wing\n\nCommunism is left wing.\nSyndicalism is left wing. \nSocialism is left wing. \n\n> left-wing ideologies fail.\n\nAll ideologies fail.",
                  "timestamp": "2022-04-21 06:49:36",
                  "score": 2,
                  "num_children": 1,
                  "author": 227146,
                  "replies": [
                    {
                      "id": "i5lbx8p",
                      "text": "And it is my hope that we can make something in the centre that doesn't go insane and has enough flexibility to adapt and adjust itself to change.",
                      "timestamp": "2022-04-21 08:14:20",
                      "score": 2,
                      "num_children": 1,
                      "author": 73047,
                      "replies": [
                        {
                          "id": "i5oe1vz",
                          "text": "Aye.  We did it before, in the latter half of the last century ideological positions had broadly been dismissed by everyone.  Unfortunately after the millennium changed there's been a rise of sycophantic ideologues, first on the far right, and now morons on the left think that just because the problem with right wing ideologies isn't that they're ideological, but that they were right wing.\n\nBut my point is that we did it before, and we can do it again.",
                          "timestamp": "2022-04-21 22:41:56",
                          "score": 2,
                          "num_children": 1,
                          "author": 227146,
                          "replies": [
                            {
                              "id": "i5pv0ot",
                              "text": "I would say that we have been on this trajectory for 200+ years. Possibly since the renesance. Midwitery of what later became the right made it possible for other midwits to feighn intelligence which created the left. What we see now socially is the compounding of the errors done by both.\n\nThe possible gamechanger is the Internet and modern computers. The Internet has the capability to quickly share information and quickly expose midwits and malicious actors. Computer technology can be used to run simulations and if done properly to a degree mitigate complexity and scalability issues.\n\nThe rest is up to education. I am practicing it here by explaining why a left-wing ideology can't produce positive outcomes. + working on going up the ivory tower and as a hobby creating a systematic way that anyone could learn any topic well past the point where a midwit would have credibility.",
                              "timestamp": "2022-04-22 06:15:43",
                              "score": 1,
                              "num_children": 0,
                              "author": 73047,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i5gqwua",
                  "text": "Nice word salad.\nI am familiar with the terms but I can't really find a coherent position in them.\nYou wrote a paragraph on how left wing ideologies \"fail\" because of the required acceptance of a \"position on human nature and society.\" But you never define what you think position this is.\n\nWhich is a bad argument.",
                  "timestamp": "2022-04-20 10:44:36",
                  "score": 0,
                  "num_children": 1,
                  "author": 206027,
                  "replies": [
                    {
                      "id": "i5hfmpg",
                      "text": "Your shortcomings in knowledge and reading comprehension are a reflection on you, not my argument. Don't go in to insults it's annoying. \n\nThere are two positions:\n\n1. Any movement or philosophy that at any point descended from the ideology of the left-wing of the French revolution is by definition left-wing. Calling feminism not left-wing is factually incorrect. \n\n2. If you base your logic on something factually incorrect you will always be incorrect. Ignoring this is a core principle of any left-wing ideology, therefore is applicable to feminism and the \"patriarchy theory\". This is the same as left-wing accepting Russeau's philosophy, as both are ingrained to such a degree that most followers do not ever realise that it's a thing they support. It's not that the target is bad, but that it is bad on principle. \n\n>required acceptance of a \"position on human nature and society.\" But you never define what you think position this is.\n\nI referenced that it's Russeau's, therefore do not need to define it. \n\nIn short Russeau's position is humans are by nature good (myth of the noble savage) and all of the evil (abuse, slavery, etc.) comes from society. We can see such or similar behaviours in animals, and as such it is a part of human nature.",
                      "timestamp": "2022-04-20 14:18:36",
                      "score": 1,
                      "num_children": 1,
                      "author": 73047,
                      "replies": [
                        {
                          "id": "i5ic3k5",
                          "text": "1. Is feminism based on socialism? If so how?\n\n2.  Feminism is “left wing”.  Feminism is pretty fucking mainstream dude.\nPart of normal everyday centre right politics. Left wing sounds like some fringe ideas that most people wouldn’t agree with. But this entire sub seems dedicated to how too many people are embracing feminist ideas. \n\nSo that would seem to imply that whether an idea or movement is left wing or right wing would have more to do with what the current mainstream social and political norms are. Not whether something has some ideological traces you might be able to trace back to the French Revolution.\n\nLeft-wing politics is commonly defined by a support social equality and egalitarianism, often in opposition of social hierarchy. Even if there are some traceable roots to the French ideology that isn’t how it is defined.\n\n\n3. You think the left wing is defined be a movements relation to the French Revolution?\nAnything that descends from the ideology of French Revolution is by definition left wing?\n\n“In the mid-19th century, nationalism, socialism, democracy and anti-clericalism became key features of the French Left” \n\n“Otto Dann and John Dinwiddy report, \"It has long been almost a truism of European history that the French Revolution gave a great stimulus to the growth of modern nationalism”\n\ndamn so nationalism and democracy are all left wing? In comparison to what? Monarchy?\n\n\n4. If you base your logic on something incorrect you will always be wrong?\n\nChristian’s don’t kill because of the Ten Commandments. God isn’t provably real.\nKilling is still wrong for different reasons.\nOther societies came to similar conclusions for different reasons. So which of them is always wrong about murder being bad.\n\n“One of the world’s first anti-depressants was first synthesized in 1951, and used initially to treat tuberculosis. When clinicians found that some patients exhibited euphoria and hyperactive behaviour under the drug’s influence, they revealed that it is a “monoamine oxidase inhibitor”.\n\n“sildenafil citrate, a drug developed at a treatment for jet jag, had impacts below the belt. Why? The drug dilates by relaxing muscles, allowing blood to flow into the penis.”\n\n6. Liberalism is birthed from the French Revolution.\nLiberalism isn’t far left.\n\n“the American Revolution of 1776 and the French Revolution of 1789 used liberal philosophy to justify the armed overthrow of royal sovereignty. Liberalism started to spread rapidly especially after the French Revolution. The 19th century saw liberal governments established in nations across Europe and South America, whereas it was well-established alongside republicanism in the United Words such as liberal, liberty, libertarian and libertine all trace their history to the Latin liber, which means \"free\".[22] One of the first recorded instances of the word liberal occurs in 1375, when it was used to describe the liberal arts in the context of an education desirable for a free-born man”\n\n\n7. You think all left wing movements and ideologies are dependent of the acceptance of russeaus philosophy. I don’t have time to go through every left movement but I doubt that is true.\nIdeas can evolve over time. It is stupid to think they can’t shift in more or least intense positions.\nMovements and ideas change. People change them. Least extreme ideas are easier to spread.\n\n“All evil comes from society” I don’t think all leftist ideologies believe that.\nYou would have to assume rape and murder existed before advanced societies.\nThat is just a whole other debate.\nMember in the sense that evil can’t exist with out a group consensus of what is unforgivably bad.\nLike a cat or orca torturing it’s prey isn’t really evil.",
                          "timestamp": "2022-04-20 17:49:19",
                          "score": 3,
                          "num_children": 1,
                          "author": 206027,
                          "replies": [
                            {
                              "id": "i5lbql9",
                              "text": "Slightly out of order:\n\n> Ideas can evolve over time. It is stupid to think they can’t shift in more or least intense positions. Movements and ideas change.\n\nBase assumptions are the things that make things make sense, if you get rid of them or change them your ideology will stop making sense. So no amount of evolution will be able to overcome having incorrect base assumptions. This is why you struggle to follow my logic - we do not use the same base assumptions. Having a rigid logical structure simply allows using it as a skeleton for more complex arguments and thought. The only reason to have a relative position is to semantically overload a conversation, and have the opportunity to use underhanded tactics (not accusing you of deliberately doing it).\n\n> Is feminism based on socialism? If so how?\n\nSimone de Beauvoir, Sartre, Foucault ... All feminists and socialists. All three of them also signed a letter in support of abolishing the age of consent in France in 1977.\n\nThe problem with defining left-wing in relative terms is that it is not possible to accurately define, therefore it is a \"no true Scottsman\" fallacy and pointless. The only other way to define left-wing is through it's logical framework of \"narrative is more important than fact\" and taking up values by inverting traditionalism (which includes the idea of Magna Carter and from you own reference liberalism). In both of those feminism ends up being left-wing. \n\nA great example of the modern left staying true to its roots in the French revolution is the legislation proposed (I don’t remember if it was passed or not) in California of unrestricted abortion up to birth in response to the Alabama’s abortion ban.\n\nThe origin of left/right terminology is the separation by which side of the chamber you sit in is based on the French revolution, with the revolutionaries being on the left and them pushing everyone else to the right. This was later used to procecute people during \"the reign of terror\" - where we get the word terrorism from. During that period of time the revolutionaries delineated everything good as left-wing and everything bad as right-wing, simply to silence criticism as they did the things they claimed to be against. Ironically, it was a return to monarchy (Napoleon) that fulfilled the promises that the left-wing made.\n\nAnother feature of this same logic is the necessity of constant escalation, which is why you can see leftist periodically turning on eachother.\n\nDemocracy comes from ancient Greece and was thoroughly examined and considered a terrible way of governance (most notably by Plato) as it invariably devolves into mob rule and oligarchy. Your own reference states that the term liberal pre-dates the notion of separation into left and right. Therefore neither are a left-wing position. \n\nThe problem is the phrase \"modern nationalism\" which is to be contrasted with other forms of nationalism. Nationalism in terms of psychology is a form of ingroup preference and is a product of human instincts. This would indicate an attempt to semantically overload the term nationalism. If one puts this into full context \"modern nationalism\" is what we now call tribalism - meaning our side can do no wrong, as opposed to nationalism which considers justified criticism of itself a benefit.\n\nIf you want to really go into US history: Lincoln created the Republican Party a right-wing movement and lead the side that abolished slavery. Part of the main features of that party is conservatism, which goes against the narrative of \"the parties switched\". Also do not forget that Jim Crow laws were a democrat position.\n\nRousseau's position is simply succinct and easy to point to. It can be disassembled into \"noble savage\" and \"tabula rasa\", which can be seen in pretty much all romanticism philosophers, and used as a base assumption for the French revolution, which itself was used as a base assumption for other left-wing movements such as feminism. Very few examine their thoughts that deeply to understand this connection.\n\n>Christian’s don’t kill because of the Ten Commandments. God isn’t provably real.\n\nThat's a problem of a simplistic view of religion. One of the things they share is the ability to maintain a society, and you need to have some things to make them function, and there are a limited number of ways that will produce an outcome that doesn't collapse a society. Religion does this through belief and trial and error, over 1000s of years, and rarely fully explains the how’s and why’s, which is their downfall.\n\nOn the drugs - it is knowledge of cause and effect, rather than a fault in logic. When those drugs were initially used not all of those effects were known, hence the changes in use. The scientific method didn’t change.\n\nExamples of flaws in logic rather than a lack of knowledge are: the use of tobacco smoke enemas (until late 1800s) as a way of resuscitation after drowning and considering newborns not to feel pain.\n\n>You would have to assume rape and murder existed before advanced societies.\n\nYes, which is why that base assumption (Rousseau's position) is false, so are the ideologies based on it. Pointing out the flaws in base assumptions is often dismissed as a “conspiracy theory” despite it being factually accurate.",
                              "timestamp": "2022-04-21 08:11:39",
                              "score": 1,
                              "num_children": 1,
                              "author": 73047,
                              "replies": [
                                {
                                  "id": "i5lqu37",
                                  "text": "I spent an hour writing a long reply and got halfway through addressing your points.\nUp to the nationalism bit. But all disappeared when I opened google to define tribalism.\n\nI might come back and address your points properly later. But I can’t be fucked after losing it all once.\n\nI will say seem well read, but some of your based assumptions lead to very different conclusions.\nAs some of your definitions of terms.\nBut you obviously think the same thing about me so that wouldn’t be much of surprise.",
                                  "timestamp": "2022-04-21 11:30:54",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 206027,
                                  "replies": [
                                    {
                                      "id": "i5ly6ma",
                                      "text": "No worries, that stuff happens. I'll be happy to re-visit this if and when you want to. \n\nWhen I originally looked into the connections between the French revolution, left-wing politics and romanticism it took me a couple of months to come to terms with it. \n\nIf you want an interesting view on religion I would recommend looking into Louis Pasteur and Werner Heisenberg, both great scientists with very interesting thoughts on God (both devout Christians).",
                                      "timestamp": "2022-04-21 12:39:40",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 73047,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i5h3l07",
              "text": "Cake day 🗿",
              "timestamp": "2022-04-20 12:49:08",
              "score": 2,
              "num_children": 0,
              "author": 267820,
              "replies": []
            },
            {
              "id": "i5h3z9l",
              "text": "> Feminism isn't a left wing ideology, it's centrist. \n\nFrom what I recall, \"left\" and \"right\" come from the French Revolution, with \"right\" being the side that supported the monarchy (and lost), and \"left\" being the revolutionaries.\n\nFeminism is interesting in that it could be either. On the one hand they're trying to topple what they think exits (so, revolutionaries or \"left\"). But on the other hand they want different legal rights for different groups, which smells a bit too much like how systems that have nobility work (ie \"right\", even if that's not what the modern right goes for).",
              "timestamp": "2022-04-20 12:52:23",
              "score": 1,
              "num_children": 1,
              "author": 233031,
              "replies": [
                {
                  "id": "i5l1lue",
                  "text": ">Feminism is interesting in that it could be either. \n\nExactly. But it's rather confined to the middle. The far left obliterates personal choice to the point where individual liberty is limited, and the far right restricts the sexes to traditional roles. \n\n>Feminism is interesting in that it could be either. On the one hand they're trying to topple what they think exits\n\nThat's the radical branch of feminism... which is the only current branch of feminism in practice because the normal feminists got the rights they wanted and stopped matching and whinning. \n\n>But on the other hand they want different legal rights for different groups, which smells a bit too much like how systems that have nobility work\n\nYou don't even need to go so far as intersectionality in this analysis (Although you are correct) Traditional gender roles that they ironically want to maintain on men are an excellent example of right wing politics. \n\nI'm sure youre well familiar with the delusions of the 'patriarchy' theory... they didn't make up that crap out of those fears they have are what they want to do us.",
                  "timestamp": "2022-04-21 05:55:56",
                  "score": 1,
                  "num_children": 0,
                  "author": 227146,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i5hlv5r",
      "text": "I tell all my liberal friends, there is very little difference between feminism and extreme conservatism.  Both act the same, they just have different end games, but their methods, ideas and such are not much different.  Really, all extreme groups behave the same type of way, and I look at feminism as the extreme left in the same way I look at hyper, over conservatives as the extreme right.  Same methods of shaming, name calling, silencing, conspiracy stuff and so on.",
      "timestamp": "2022-04-20 15:00:35",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i5g1qbu",
      "text": "They’re the same people who think qanon is legit. Lmao.",
      "timestamp": "2022-04-20 05:12:51",
      "score": 3,
      "num_children": 2,
      "replies": [
        {
          "id": "i5ikxka",
          "text": "Yeah that’s real. The White House invasion definitely happened and it wasn’t done by Antifa.",
          "timestamp": "2022-04-20 18:46:41",
          "score": 2,
          "num_children": 0,
          "author": 241212,
          "replies": []
        },
        {
          "id": "i5gbr4c",
          "text": "Ahh no they aren’t.",
          "timestamp": "2022-04-20 07:13:40",
          "score": 1,
          "num_children": 0,
          "author": 206027,
          "replies": []
        }
      ]
    },
    {
      "id": "i5gcynr",
      "text": "Saying that someone believes in a conspiracy theory is just a way to dismiss them.\n\nPointing out commonalities and something factually correct that most people don't dig into is often dismissed as a conspiracy theory.",
      "timestamp": "2022-04-20 07:30:28",
      "score": 5,
      "num_children": 1,
      "author": 73047,
      "replies": [
        {
          "id": "i5gnw6q",
          "text": "> Saying that someone believes in a conspiracy theory is just a way to dismiss them.\n\nWhy dont you tell us all what's wrong with dismissing someone who believes in conspiracy theories like the feminist conspiracy theory about the existence of a patriarchy...\n\nI'll await your reply with interest. 😉\n\n-------------------------------------------\n\n*No theory is more fundamental to academic feminism than the theory of the patriarchy.  Quite simply - and perhaps too simply - patriarchy is the feminist theory that there is a regime of institutionalised male control over women.*",
          "timestamp": "2022-04-20 10:06:27",
          "score": 2,
          "num_children": 1,
          "author": 187461,
          "replies": [
            {
              "id": "i5hc8uj",
              "text": "Just pointing out that some factually correct things are dismissed as a conspiracy theory. The \"Hunter Biden laptop\" thing was labelled a conspiracy theory because it was inconvenient despite being true. \n\nFeminism is a supremacy movement and \"patriarchy theory\" is an excuse to justify abuse. Therefore less conspiracy theory more the same as eugenics. Both follow the same framework. Calling them conspiracy theories makes them seem less malicious than they really are.",
              "timestamp": "2022-04-20 13:55:05",
              "score": 7,
              "num_children": 1,
              "author": 73047,
              "replies": [
                {
                  "id": "i5hz9xz",
                  "text": "What must be picked apart is Patriarchy as an unintentional, emergent, and collective paternalism vs \"Patriarchy\" as some kind of grand conspiracy where every man is defending a power structure to marginalize others.  AKA the real vs the construct.\n\nFeminists need to reconcile the gap between the real man and the straw man.  But they refuse to because it doesn't benefit them to do it; It would crush the ideology they lean on for vindication.",
                  "timestamp": "2022-04-20 16:27:39",
                  "score": 3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i5i2khr",
                      "text": "The problem is that the premise of feminism is falce, rather than just the \"patriarchy\". This makes it a problem of not contracting reality, and cannot be done within the framework that created it in the first place. The problem of that broader group of ideologies is that it completely disregards everything outside of itself as evil, never judging on merit as then it would loose.",
                      "timestamp": "2022-04-20 16:48:43",
                      "score": 3,
                      "num_children": 0,
                      "author": 73047,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i5g8pog",
      "text": "Women have all the rights and privileges of adults and all of the responsibilities and accountability of children.",
      "timestamp": "2022-04-20 06:33:53",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i5gbb1m",
      "text": "How many of the previous American presidents were men though?",
      "timestamp": "2022-04-20 07:07:36",
      "score": -1,
      "num_children": 1,
      "author": 206027,
      "replies": [
        {
          "id": "i5gndkd",
          "text": "Relevance?\n\nLast time I checked (all of one minute ago) I'm not, and never have been in the good ol USA. \n\nWhere I live we've had three female Prime ministers the last 25 years, and guess what I voted for the political parties of two of them. (IOW doing my bit to get two of these women elected as the leaders of the country I live in) \n\n----------------------------------------------\n\n*Feminism:Equality, when convenient.*",
          "timestamp": "2022-04-20 09:59:35",
          "score": 8,
          "num_children": 1,
          "author": 187461,
          "replies": [
            {
              "id": "i5gorpb",
              "text": "Oh you can't see how things like that could be relevant?\nUsa is an example. I am from Australia. \n2 of our last 25 prime ministers. So 8%.\nIt obviously isn't just a head of the country thing.\n\nBut Is it unusual that America has had 46 presidents and none of them are women? \nMaybe male traits are just better  suited for leadership?",
              "timestamp": "2022-04-20 10:18:01",
              "score": -3,
              "num_children": 1,
              "author": 206027,
              "replies": [
                {
                  "id": "i5gqy6i",
                  "text": ">But Is it unusual that America has had 46 presidents and none of them are women? \n\nNot really no. Given that slightly more than half of eligible voters are women, but nothing like half of those women have voted in the popular vote for a female presidential candidate when they had the opportunity. I seem to remember reading that something like 54% of women voters in the USA supported Donald Trump in 2016...\n\n\n>Maybe male traits are just better suited for leadership?\n\nFemale voters in the USA seem to think so...\n\nAs for Australia, how many prime ministers has it had in the last 30 years, how many of them have even survived their full term, and I believe Australia has only had one female prime minister...\n\nAnd no, you cant have ours, she doesn't want to move to Australia. 😉\n\n----------------------------------------------------\n\n*Feminism:Equality, when convenient*",
                  "timestamp": "2022-04-20 10:45:03",
                  "score": 5,
                  "num_children": 1,
                  "author": 187461,
                  "replies": [
                    {
                      "id": "i5gu38y",
                      "text": "Why limit it to the last 30 years? \nAny reason why 1992 would be the time when politics really got started?\nLike why would you point to only recent decades when feminism started making real progress?\nUnless you what to cherry pick that period of time to use as the results of fighting the patriarchy as evidence the patriarchy doesn't exist?\n\"We don't need a fire department. The fire department put out my house fire and now my house isn't as on fire as it was before.\n\nRegarding female America voters. A lot of People vote with the status quo. If you have had 400 years of male presidents. That is quiet a tradition. A lot of people may believe the previous types of people who had the role likely embody some intrinsic traits that are required to be successful in the role.\nOther people may want a women but not agree with the politics of the party of the particular women.\nI'm not sure how often a women has even been a presidential candidate. But it doesn't seem like a common occurrence.\n\nYeah. Australia has only ever had 1 full term women in the role. That is ever less.\nYeah we don't want your random women leader from a country you won't mention\n\n\"Patriarchy is a system of relationships, beliefs, and values embedded in political, social, and economic systems that structure gender inequality between men and women. Attributes seen as “feminine” or pertaining to women are undervalued, while attributes regarded as “masculine” or pertaining to men are privileged\"\n\nPerhaps there is a \"system of believes and values\" that would value the traits of men over those of women?\nAnd the women who do better in those roles are the ones that take on traits associated with men.\nAnd maybe men who have feminine traits are generally kind of treated like shit? Because those treats are \"weak, submissive and inferior\".",
                      "timestamp": "2022-04-20 11:20:46",
                      "score": 0,
                      "num_children": 1,
                      "author": 206027,
                      "replies": [
                        {
                          "id": "i5jjilg",
                          "text": "> Why limit it to the last 30 years?\n\nWhy indeed...\n\nBut then there's always the 'argument' that feminist use when facts that show up their sexism, misandry, and hate towards men cant be any older than yesterday, but their arguments and herstory can be and are relevant no matter far back in herstory they go, a recent example of feminists claiming they have proof that stone age human females were just as good hunters as stone age human males and claiming that the patriarchy denies that 'feminist' fact. 😉 \n\n>Yeah. Australia has only ever had 1 full term women in the role. That is ever less. Yeah we don't want your random women leader from a country you won't mention\n\nYou just have to look over the black stump and across the ditch, and you still cant have her as your PM. 😉 \n\n>\"Patriarchy is a system of relationships, beliefs, and values embedded in political, social, and economic systems that structure gender inequality between men and women. Attributes seen as “feminine” or pertaining to women are undervalued, while attributes regarded as “masculine” or pertaining to men are privileged\"\n\nThat reads like feminism 101... 🤣🤣🤣\n\n“One of the reasons for the failure of feminism to dislodge deeply held perceptions of male and female behaviour was its insistence that women were victims, and men powerful patriarchs, which made a travesty of ordinary people's experience of the mutual interdependence of men and women.” \n\n*Rosalind Coward*\n\n--------------------------------------------\n\n*Feminism:Equality, when convenient.*",
                          "timestamp": "2022-04-20 22:35:49",
                          "score": 2,
                          "num_children": 1,
                          "author": 187461,
                          "replies": [
                            {
                              "id": "i5l0jee",
                              "text": "Yes, why?\nWhy limit it to just the last 30 years?\nGreat pivot. But I’m not interested in debate you idea of what some random feminists said some time.\nI am debating the points you made.\nIt said of defending limiting the time period to the part that is desirable to you point you just said “well what about them?? They do the opposite!!”\n\nIt stands to reason that if some gender roles are biological and some are societal, it would be worth exploring how they differ in different societies( and the similarities) and how different pre civilisation groups may have handled it. This isn’t that unusual given that controlling women through marriage and reproductive is very tied to how property and rights were inherited. So if part of the core is women can be treated like property because biologically they are gatekeepers of how money and wealth and transfer.\nSo if that is so influential in thousands of years of culture you have to go back pretty far to find cultures unaffected by that.\n\n2. Ok you are a kiwi. Good for you.\nOther countries don’t want your prime minister.\nThey what someone that knows their own countries politics.\n\n\n\n3. A definition of a term reads to you like an introductory class on the subject?\nGood stuff. Yes I imagine a class word cover what subject you are studying means.\nYou know, so you would know what the subject means before moving on to more advance ideas.\nIf you are going to debate on a topic you might want to gain at least a rudimentary understanding of the terms and ideas.\n\n4. Rosalind is entitled to her opinions. I’m not familiar with her work.\nBut assuming her observation was true. Maybe part of the reason if it is difficult to dislodge deeply held perceptions is because they are deeply held. For thousands of years of culture and tradition. That will be tend to have an effect. It would be very hard to move people on from capitalism if we created a better system because over 200 years we have gotten pretty use to it. There was a time where monarchy and empire where since as the right and only way. Gods chosen bloodline of kings. Now we know that idea was just enforced by the beliefs of the time.\n\nHer quote seems a bit suss on the powerful Patriarch bit.\nReframing things or focusing and encouraging the common misconceptions.\nThe existence of patriarchy doesn’t mean every man is powerful and every women a victim.\nJust a the existence of white privileged doesn’t mean every white person is rich or has an easy life.\nIt just means they are part of a group that tends to be favoured in a certain society and it is easier to fall into those patterns or benefits in some ways from that.\nOf course you guys aren’t powerful patriarchs or you wouldn’t be reactionaries. You are likely disempowered and any corrections to greater societal norms feel like they are improving other peoples lives to the detriment of your own. If they is a chick I want to date it feels more difficult if she has as much money as me or more. You guys are not without your points. But for the most point your concerns, like boys getting left behind in school, are part of feminism. You just tend to point to the more extreme crazy or dumb and fringe examples to make it easier to hate them. I also dislike cringe people fringe weirdos with extreme and niche political ideas that would never work on broad scale.\n\n\nIt is tough to listen to other peoples bullshit when you are overworked and under appreciated.\nBut it seems like these likely aren’t the issues that are making your life hard. If it is hard.\nIt is an easy scapegoat.\nYou guys seem to agree with feminism anyway. You just don’t like the more extreme kinds.\nAnd the extreme kind seems to be the only kind you refer to as feminism.",
                              "timestamp": "2022-04-21 05:43:26",
                              "score": 1,
                              "num_children": 1,
                              "author": 206027,
                              "replies": [
                                {
                                  "id": "i5l1v26",
                                  "text": "> It is tough to listen to other peoples bullshit when you are overworked and under appreciated. But it seems like these likely aren’t the issues that are making your life hard. If it is hard. It is an easy scapegoat. You guys seem to agree with feminism anyway.\n\n\n>You just don’t like the more extreme kinds. \n\nWrong. \n\nWomanism is feminism's vulgate. It asserts that women are the oppressed or the victims and never the collaborators in the 'bad' things that men do. \n\nIt entails a double standard around sexuality where women's sexual self-expression is seen as necessary and even desirable, but men's is seen as dangerous or even disgusting. \n\n**Womanism is by no means confined to a tiny, politically motivated bunch of man-hating feminists, but is a regular feature of mainstream culture.** \n\n>And the extreme kind seems to be the only kind you refer to as feminism.\n\nThere are hundreds of different kinds of feminism. But ALL feminists talk about feminism, and believe in feminism.  That makes them all feminists.\n\n---------------------------------------------------\n\nSo what you're saying is that you, a commenter using a username on an internet forum are the true feminist, and the feminists actually responsible for changing the laws, writing the academic theory, teaching the courses, influencing the public policies, and the massive, well-funded feminist organizations with thousands and thousands of members all of whom call themselves feminists... they are not \"real feminists\".\n\nThat's not just \"no true Scotsman\". That's delusional self deception.\n\nListen, if you want to call yourself a feminist, I don't care. I've been investigating feminism for more than 9 years now, and people like you used to piss me off, because to my mind all you were doing was providing cover and ballast for the powerful political and academic feminists you claim are just jerks. And believe me, they ARE jerks. If you knew half of what I know about the things they've done under the banner of feminism, maybe you'd stop calling yourself one.\n\nBut I want you to know. You don't matter. You're not the director of the Feminist Majority Foundation and editor of Ms. Magazine, Katherine Spillar, who said of domestic violence: \"Well, that's just a clean-up word for wife-beating,\" and went on to add that regarding male victims of dating violence, \"we know it's not girls beating up boys, it's boys beating up girls.\"\n\nYou're not Jan Reimer, former mayor of Edmonton and long-time head of Alberta's Network of Women's Shelters, who just a few years ago refused to appear on a TV program discussing male victims of domestic violence, because for her to even show up and discuss it would lend legitimacy to the idea that they exist.\n\nYou're not Mary P Koss, who describes male victims of female rapists in her academic papers as being not rape victims because they were \"ambivalent about their sexual desires\" (if you don't know what that means, it's that they actually wanted it), and then went on to define them out of the definition of rape in the CDC's research because it's inappropriate to consider what happened to them rape.\n\nYou're not the National Organization for Women, and its associated legal foundations, who lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male.\n\nYou're not the Florida chapter of the NOW, who successfully lobbied to have Governor Rick Scott veto not one, but two alimony reform bills in the last ten years, bills that had passed both houses with overwhelming bipartisan support, and were supported by more than 70% of the electorate.\n\nYou're not the feminist group in Maryland who convinced every female member of the House on both sides of the aisle to walk off the floor when a shared parenting bill came up for a vote, meaning the quorum could not be met and the bill died then and there.\n\nYou're not the feminists in Canada agitating to remove sexual assault from the normal criminal courts, into quasi-criminal courts of equity where the burden of proof would be lowered, the defendant could be compelled to testify, discovery would go both ways, and defendants would not be entitled to a public defender.\n\nYou're not Professor Elizabeth Sheehy, who wrote a book advocating that women not only have the right to murder their husbands without fear of prosecution if they make a claim of abuse, but that they have the moral responsibility to murder their husbands.\n\nYou're not the feminist legal scholars and advocates who successfully changed rape laws such that a woman's history of making multiple false allegations of rape can be excluded from evidence at trial because it's \"part of her sexual history.\"\n\nYou're not the feminists who splattered the media with the false claim that putting your penis in a passed-out woman's mouth is \"not a crime\" in Oklahoma, because the prosecutor was incompetent and charged the defendant under an inappropriate statute (forcible sodomy) and the higher court refused to expand the definition of that statute beyond its intended scope when there was already a perfectly good one (sexual battery) already there. You're not the idiot feminists lying to the public and potentially putting women in Oklahoma at risk by telling potential offenders there's a \"legal\" way to rape them.\n\nAnd you're none of the hundreds or thousands of feminist scholars, writers, thinkers, researchers, teachers and philosophers who constructed and propagate the body of bunkum theories upon which all of these atrocities are based.\n\nYou're the true feminist. Some random person on the internet.\n\nKaren Straughan\n\n-------------------------------------------------------\n--------------------------------------------------\n\n*I can honestly sorry to say I've never met any feminist I could 'respect’. They have all been rude, loud, illogical, bombastic, irritable, sexist, totalitarian, insulting, wrong, obnoxious, slanderous, ignorant, victimhood riddled & flagitious.*",
                                  "timestamp": "2022-04-21 05:59:02",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 187461,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i5hrv8k",
      "text": "Lol says the patriarchy isn't a thing...yet the doctor asks my husband if HE'S ok with me getting MY tubes tied.",
      "timestamp": "2022-04-20 15:39:58",
      "score": -1,
      "num_children": 0,
      "author": 52271,
      "replies": []
    },
    {
      "id": "i5is8h9",
      "text": "Patriarchy does exist...before the 1950s\n\nand in **some** (not all, also culture based) traditionalist coutnries.\n\nAre there injustices faced by women? Yes. Is \"patriarchy\" one of them in the west? No.\n\nEver heard of Title IX? Yeah, that's right. \"patriarchy.\"  What is this? 1724?",
      "timestamp": "2022-04-20 19:33:54",
      "score": 1,
      "num_children": 0,
      "author": 97788,
      "replies": []
    },
    {
      "id": "i5k1mv4",
      "text": "I see no difference between the patriarchy and the illuminati.",
      "timestamp": "2022-04-21 00:48:28",
      "score": 1,
      "num_children": 0,
      "author": 378215,
      "replies": []
    },
    {
      "id": "i5zyhpv",
      "text": "Aren't the largest world religions run entirely by men, tho? By decree?",
      "timestamp": "2022-04-24 13:33:30",
      "score": 1,
      "num_children": 0,
      "author": 95571,
      "replies": []
    },
    {
      "id": "i607j7l",
      "text": "They keep bring up mental health issues. It's an obvious cry for help and they want to spread their misery to others.",
      "timestamp": "2022-04-24 14:43:16",
      "score": 1,
      "num_children": 0,
      "author": 113719,
      "replies": []
    },
    {
      "id": "i80m41b",
      "text": "Why you bringing Yerba Mate into this tho?",
      "timestamp": "2022-05-10 05:22:13",
      "score": 1,
      "num_children": 0,
      "author": 288290,
      "replies": []
    },
    {
      "id": "i5fmjgn",
      "text": "[deleted]",
      "timestamp": "2022-04-20 02:55:43",
      "score": -40,
      "num_children": 15,
      "replies": [
        {
          "id": "i5fnad1",
          "text": "The joke is that they believe that men still have more rights than women in countries like usa, canada, uk, germany, france (every europe country) and believes that these country’s treat them worse because they’re women (which is false) the patriarchy still exists in Middle Eastern countries, south america and in african countries and in places like Russia, China and north korea",
          "timestamp": "2022-04-20 03:01:34",
          "score": 20,
          "num_children": 1,
          "replies": [
            {
              "id": "i5fnflo",
              "text": "In a patriarchy, women wouldn’t even be voting. Actually, no one would because the power would be passed from father to son.",
              "timestamp": "2022-04-20 03:02:44",
              "score": 11,
              "num_children": 3,
              "replies": [
                {
                  "id": "i5fnmto",
                  "text": "Ik, that’s why i’m confused on why the person that I replied to is saying that it exists, if they live in america or any other civilised country then they aren’t in a patriarchy",
                  "timestamp": "2022-04-20 03:04:19",
                  "score": 10,
                  "num_children": 3,
                  "replies": [
                    {
                      "id": "i5foy31",
                      "text": "I'm confused as well as to why she commented that? I actually thought for a second \"am I missing something here?\" After I read hers. But after reading your guys comments... that reassured me and nope, I'm not missing anything. Thanks guys!",
                      "timestamp": "2022-04-20 03:14:52",
                      "score": 8,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i5fpb71",
                          "text": "I reckon the joke just either went completely over her head or she chose to ignore it and comment something false, but whatever the option is, it’s stupid. Lmao",
                          "timestamp": "2022-04-20 03:17:51",
                          "score": 8,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i5fqdb4",
                              "text": "Yeah, lol.",
                              "timestamp": "2022-04-20 03:26:30",
                              "score": 6,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i5fntcg",
                      "text": "Yeah exactly",
                      "timestamp": "2022-04-20 03:05:45",
                      "score": 5,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i5fnybr",
                          "text": "Guessing they’re a feminist that doesn’t understand the world she lives in",
                          "timestamp": "2022-04-20 03:06:52",
                          "score": 8,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i5g0nxy",
                              "text": "90% of feminists don't understand patriarchy theory. They think it privileges men; it doesn't.",
                              "timestamp": "2022-04-20 05:01:30",
                              "score": 10,
                              "num_children": 1,
                              "author": 227146,
                              "replies": [
                                {
                                  "id": "i5hzlu1",
                                  "text": "They think that patriarchy oppresses men, and that men are too ignorant on the whole to realize how they're upholding this imaginary social construct.\n\nIt's the \"[soft bigotry of low expectations](https://www.racialequityinstitute.com/blog/2019/8/7/the-soft-bigotry-of-low-expectations-through-mathematics-education)\".\n\nChauvinism always begins with assuming the other side is too stupid to understand your point, when they understand it perfectly and simply disagree.",
                                  "timestamp": "2022-04-20 16:29:48",
                                  "score": 3,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i5g0jtw",
                      "text": "Yeah. Saudi Arabia is a fucking patriarchy. Not the west.",
                      "timestamp": "2022-04-20 05:00:18",
                      "score": 5,
                      "num_children": 1,
                      "author": 227146,
                      "replies": [
                        {
                          "id": "i5gs6oi",
                          "text": "Yeah they have worst womens rights.\nBut that is like saying war is what Russia does. Not America.\nThere is a spectrum.\nAnd countries devoted to human rights, equality and democracy hold themselves to a higher standard.\n\nIf your girlfriend gets mad because you cheated on her you can't just go \"what about that guy? He is way worse. He cheated on his girlfriend 100 times\".\nIt is about the relationship between a country and its people. Not what other countries are doing.",
                          "timestamp": "2022-04-20 10:59:37",
                          "score": 0,
                          "num_children": 2,
                          "author": 206027,
                          "replies": [
                            {
                              "id": "i5gzfzd",
                              "text": "In a patriarchy, women wouldn’t vote. In fact, no one would because the power would be passed from father to son.",
                              "timestamp": "2022-04-20 12:13:35",
                              "score": 3,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "i5h0bm0",
                                  "text": "Do you understand that words mean different things in different contexts?\n\nThat isn't what patriarchy means in a feminist context.",
                                  "timestamp": "2022-04-20 12:21:26",
                                  "score": 1,
                                  "num_children": 2,
                                  "author": 206027,
                                  "replies": [
                                    {
                                      "id": "i5h4e5x",
                                      "text": "Well then, feminists are using the word in the wrong way",
                                      "timestamp": "2022-04-20 12:55:46",
                                      "score": 3,
                                      "num_children": 1,
                                      "author": 267820,
                                      "replies": [
                                        {
                                          "id": "i5h5pwi",
                                          "text": "That's not how words work buddy.\nYou just need to learn more things.\n\nSimilar to how when discussing white privilege. \nPeople get hung up on the word privilege and it's association with wealth or \"a life without problems\".\nBut in that context white privilege refers to the benefits on being white in a white dominant society.\n\nIn a feminism context it is more like \n\"Patriarchy is a system of relationships, beliefs, and values embedded in political, social, and economic systems that structure gender inequality between men and women. Attributes seen as “feminine” or pertaining to women are undervalued, while attributes regarded as “masculine” or pertaining to men are privileged.\"",
                                          "timestamp": "2022-04-20 13:06:22",
                                          "score": -1,
                                          "num_children": 1,
                                          "author": 206027,
                                          "replies": [
                                            {
                                              "id": "i5l4kb5",
                                              "text": ">People get hung up on the word privilege and it's association with wealth or \"a life without problems\". But in that context white privilege refers to the benefits on being white in a white dominant society.\n\nThat's not how words work, buddy. \n\nEveryone who uses that term is wrong.\n\n>But in that context white privilege refers to the benefits on being...\n\nThere are no benefits. A benefit is something of value. Being treated like a human being isn't a benefit, it's basic. \n\nWhy are you trying so hard to NOT convince people of your beliefs? Why is it so hard to point out that coloured people face disadvantages? If you punch everyone who's shorter than you not being punched isnt 'short privilege'.\n\nJesus Christ, help yourself.",
                                              "timestamp": "2022-04-21 06:32:37",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 227146,
                                              "replies": [
                                                {
                                                  "id": "i5l85fp",
                                                  "text": "I have tried several times to understand the point are making. \nBut it makes no sense to me, likely because you point would be based of a misunderstanding of my position.\n\nYou deny the concept that words mean different things in different contexts?\nOr just those particular definitions?\nFor example the word theory is casual conversation means hypothesis. But in the context of science.\nA theory is a hypothesis that has been tested to the point that is quite a reliable rule.\nYou understand?\n\nAll the People who use the term white privilege aren’t “wrong” because you don’t agree with it.\nThere are dozens and dozens of examples of how it can be more beneficial to be white in our world.\nGiven that European empires conquered half the globe and are very rich. The stereotypes of whiteness or even just be light skinned tend to be very positive. You passport will be more powerful and gain you access to more places. You could be from a poor background and wear a suit and as long as your teeth are ok your accent isn’t too much you could basically bend in with more affluent circles Etc etc etc.\n\nYou believe there are no benefits to being white?\nIn you country or the world?\nSame with feminism each decade that passes there are less disadvantages to not being white or a man in western countries. But saying there are no benefits is pretty naive.\nPerhaps you don’t feel any benefits because of other material conditions but that doesn’t mean there aren’t any or never were.\n\nThis last couple sentences makes no sense at all.\nI am one pointing out that white privileged exists.\nYou say it doesn’t. Then you excuse me of saying black people don’t have disadvantages.\nThose are two contradicting statements.\nShort privilege? So if every short person was being punch in a society dominated by tall people.\nThere would be tall privilege not short privilege. There may be short priv in a society where that was beneficial. Like one where everyone lived in tunnels and being tall was a liability and held you back.\n\nI’m trying to understand your point. Are men the short people in this metaphor?\nDo you feel that in recent decades that society has tried to fix certain imbalances and gone too far so now you feel you are part of an oppressed or marginalised class? Men?\nOr do you have think there are certain benefits to being a man that you have never had so be taking them away they are hurting you more?\nWhat are some actual examples of feminism having a negative effect on your life?",
                                                  "timestamp": "2022-04-21 07:20:29",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 206027,
                                                  "replies": [
                                                    {
                                                      "id": "i5oljwx",
                                                      "text": "> You deny the concept that words mean different things in different contexts?\n\nI don't.\n\n> All the People who use the term white privilege aren’t “wrong” because you don’t agree with it.\n\n1. They're not 'wrong' when I disagree with them in the same way that I'm 'right' you disagree with me.\n2. I quite clearly qualified why this is the case, so that's not really relevant...\n\n>Given that European empires conquered half the globe and are very rich.\n\nThose aren't people, those are empires.  And 99.9999999999% of people on Earth aren't emperors.  And an emperor vastly exceeds the status of 'privilege'.\n\n>The stereotypes of whiteness or even just be light skinned tend to be very positive.\n\nThat's probably your best point... but it's such a superficial, intangible, unquantifiable, unlikely benefit that mouthing such a thing undermines your point.  'Ignorant people like me more' is a booby prize, not a privilege.  You're undermining the struggle the coloured people of the world have.\n\nAnd I don't know if you've looked out a window in the past 40 years, but this claim is dubious at best.  There are plenty of people who have a very poor view of the stereotypical white people, you rightly used the word 'tend', because it's not a universal, or even LIKELY outcome.\n\n>You passport will be more powerful and gain you access to more places.\n\n1. A broad majority of people don't travel.\n2. Those who do enjoy this benefit are the people who are already in the upper class, those of LITERAL privilege.\n3. It's a very, very, very silly point.\n4. People of colour live in European countries.  \n\n>You could be from a poor background and wear a suit and as long as your teeth are ok your accent isn’t too much you could basically bend in with more affluent circles\n\nI'm not sure how to address such a blatant, obvious falsehood.  In fact much of the Western world, specifically the Anglosphere is of the most class impermeable cultures.  England is all but a caste system in everything but name.\n\n>your accent isn’t too much\n\nIn other words: no one who isn't already privileged benefits from this statement.\n\n>Same with feminism each decade that passes there are less disadvantages to not being white or a man in western countries.\n\nNo, there are tangible benefits to being a man.  Almost every man is stronger than almost every woman.  That is a benefit. \n\nIf your best point had this level of extremity, that stereotypes of white people tend to be better viewed than coloured people, 95% of white people would enjoy a higher social status than 95 of coloured people.  This type of inequality doesn't exist under SLAVERY.\n\nComparing the advantages men enjoy to the advantages white people enjoy is an insult of unfathomable breadth to women.\n\n>Perhaps you don’t feel any benefits because of other material conditions but that doesn’t mean there aren’t any or never were.\n\nIf they're too small to be noticed they're too small to mention.  You're asking me to take this claim based on faith?  Son, this ain't no church.\n\n>This last couple sentences makes no sense at all. I am one pointing out that white privileged exists. You say it doesn’t. Then you excuse me of saying black people don’t have disadvantages.\n\nYou seriously can't understand the difference?  That's not a rhetorical question.\n\n>Those are two contradicting statements.\n\nThey're not.\n\n>Those are two contradicting statements. Short privilege? So if every short person was being punch in a society dominated by tall people.\n\nI'm sorry, but you're not a society.   In fact I doubt you're more than seven people.  Ten tops.\n\n>I’m trying to understand your point.\n\nTypo.  I meant punch taller people.\n\n>Are men the short people in this metaphor?\n\nNo.\n\n>Do you feel that in recent decades that society has tried to fix certain imbalances and gone too far so now you feel you are part of an oppressed or marginalised class?\n\nDon't add a new subject, this already way into the weeds... and I think you might be confusing this conversation with another one.",
                                                      "timestamp": "2022-04-21 23:38:56",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 227146,
                                                      "replies": [
                                                        {
                                                          "id": "i5pqgug",
                                                          "text": "This is now become too... something... to waste my time with.\nI would need to spend hours addressing every ... thing you said and it still wouldn't matter.\n\nBut one of your interpretations stuck out to me.\nYou deny that countries that had empires for centuries in recent history are objectively richer? Empires they enriched themselves at the expense of of others?  Yes of course you aren't an emperor you fucken brainlet.\nBut you live in a country that is much richer and more powerful. You dollars what little you have buy more.\nYour country has hundreds of years of inferstructure to make it easier to make more money. You can travel to another country or buy products from another country and get more for less and gain a trade advance that compounds over time. Being on the bottom of that system is still of that system is still better than being in like a 100 countries. Countries were the people strangely aren't white and didn't have vast trade empires.\n\nAfrica for example has fuck all inferstructure.\nEuropeans came in and build train lines which are usually   very useful and benefit common folk. But these trainlines were just between mines and ports to extract wealth out of these nations.\nYes people aren't nations. But you would understand that a rich person has an advantage over a poor person right?\nWell a rich nation has advantages over poor ones.\nEven if some of the people in the rich nation are poor.\n\nI assume you are in America. America is overdue for change. The gap between rich and poor is spreading and most people arent getting what they need and everyone is getting more and more aggitated. The factions think different causes and people are to blame.\nBut if you are on the bottom and have no money for travel etc. A labour, union movement system would be beneficial assuming you can work. Healthcare, debt relief. Systems to limit the predatory businesses and corporations that exploit the poor and profit off keeping workers in worse conditions.\n\nMen have valid issues and concerns but fighting for unity and better class conditions would likely be more beneficial than a war of the sexes. Right Wing politics is easier to stomach because they give you easy targets to hate and blame for complex issues. The left has some better solutions imo. But in the social online aspects that are too holier than though alienate too many people and shame them.\n\nSorry you wrote so much and I addressed so little of it.\nI am stuck at home in covid iso this week and one day I may be very into online debating and the next I have to get on and use that time more wisely.",
                                                          "timestamp": "2022-04-22 05:21:22",
                                                          "score": 1,
                                                          "num_children": 0,
                                                          "author": 206027,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "i5l41e5",
                                      "text": "Did you think he was taking about the pope? Because in English we don't call that the patriarchy, it's called the papacy. When someone says patriarchy in English they mean it in the sense of the feminist patriarchy theory.",
                                      "timestamp": "2022-04-21 06:25:50",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 227146,
                                      "replies": [
                                        {
                                          "id": "i5l9azn",
                                          "text": "No, one of the definitions of patriarchy is the passing of power and processions from father to son.\n\nAnti feminists focus on that version of the word and ignore the feminist version because it makes it easier to strawman feminist arguments. You can just argue over definitions. \nOr compare the current situation to a less favourable one to imply that nothing needs to change because things are already better. Like humans and chimps are both apes but they would argue that humans can’t by classified as apes because they define an ape by the fact that apes swing in trees rather than by genome or whatever.\n\nSo from there the conversation is derailed because they refused to acknowledge the persons definitions exists or is legitimate. It is a common reactionary thing.",
                                          "timestamp": "2022-04-21 07:36:41",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 206027,
                                          "replies": [
                                            {
                                              "id": "i5of20k",
                                              "text": "\\>No, one of the definitions of patriarchy is the passing of power and processions from father to son.\n\nYou're confusing two different things.\n\nFirst: he's wrong, or more accurately: not entirely right.  He's confusing power structure with patriarchy.  He's describing a patriarchal monarchy, not understanding that patriarchal oligarchies, and republics have existed and do exist.\n\ne.g: the papacy and Switzerland respectfully.  Women got the right to vote in Switzerland well after world war two, despite it being one of the oldest republics in Europe.\n\nSecond: you're describing patriliny; it's only patriarchy when the control of a society is transferred that way... although having written that just now I think it's a little knit-picky, and since you've been so reasonable elsewhere I ought to cut you some slack, so nevermind.",
                                              "timestamp": "2022-04-21 22:49:32",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 227146,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "i5l3uwn",
                              "text": ">But that is like saying war is what Russia does. \n\nYou're misunderstanding. I'm saying Saudi Arabia not because it's the minimum qualifications or even an average example. I'm saying Saudi Arabia as an example because it's an example that no one in good faith can possibly disagree that SA is a patriarchy. \n\n>There is a spectrum\n\nYes. And on that spectrum Saudi Arabia is so far towards 'patriarchal' that it's a good way to find common ground amongst anyone to the West of China.  \n\n>If your girlfriend gets mad because you cheated on her you can't just go \"what about that guy?\n\nThat's a terrible analogy, even by your own logic. You're assuming I was pleading for special treatment, but this analogy is about whataboutism. Niether point is relevant.",
                              "timestamp": "2022-04-21 06:23:30",
                              "score": 1,
                              "num_children": 1,
                              "author": 227146,
                              "replies": [
                                {
                                  "id": "i5l9qn8",
                                  "text": "Yeah Saudi Arabia is a more extreme version of patriarchy.\nI thought you were using that like most people in the thread to say because a more extreme version exists. It invalidates all least extreme examples.\n\nEh I think it’s funny. Like if you are doing something bad. Pointing to someone doing something worse doesn’t mean your thing is ok.\nBut yeah seems like a misunderstanding I am debating 10 people in the thread while watching tv. My comments aren’t all winners. But also depending who you are talking to too much terminology etc can be alienating and off putting.\nI",
                                  "timestamp": "2022-04-21 07:42:51",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 206027,
                                  "replies": [
                                    {
                                      "id": "i5oehts",
                                      "text": "\\>I thought you were using that like most people in the thread to say because a more extreme version exists. It invalidates all least extreme examples.\n\nIf I were to be reasonable I'd point out that 90% of people on the internet assume that falsely, in my experience.\n\n\\>But yeah seems like a misunderstanding I am debating 10 people in the thread while watching tv.\n\nI like to be forgiving, but dude, do yourself a favour: quality over quantity.",
                                      "timestamp": "2022-04-21 22:45:17",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 227146,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i5fqhre",
                  "text": "Back before women got the right to vote, the majority of the people who opposed voting rights for women... were women... Men wanted women to be able to vote.",
                  "timestamp": "2022-04-20 03:27:32",
                  "score": 14,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "i5ioc0c",
                      "text": "They opposed it mostly because of the draft.",
                      "timestamp": "2022-04-20 19:08:47",
                      "score": 1,
                      "num_children": 0,
                      "author": 241212,
                      "replies": []
                    },
                    {
                      "id": "i67kvr2",
                      "text": "Is there a source for this? I couldn't find one.",
                      "timestamp": "2022-04-26 01:35:24",
                      "score": 1,
                      "num_children": 1,
                      "author": 364622,
                      "replies": [
                        {
                          "id": "i67ljxx",
                          "text": "[https://www.theatlantic.com/magazine/archive/1903/09/why-women-do-not-wish-the-suffrage/306616/](https://www.theatlantic.com/magazine/archive/1903/09/why-women-do-not-wish-the-suffrage/306616/)",
                          "timestamp": "2022-04-26 01:40:08",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i5fp7ft",
                  "text": "Majority of women didn't want to vote because they didn't want the responsibility that comes along with it like joining the fire brigade. Men were the ones that pushed women to vote lol. But we won't tell the feminist that....",
                  "timestamp": "2022-04-20 03:17:01",
                  "score": 6,
                  "num_children": 3,
                  "author": 288573,
                  "replies": [
                    {
                      "id": "i5fpbdt",
                      "text": "What?! Really? I need to look into this. Lol",
                      "timestamp": "2022-04-20 03:17:54",
                      "score": 6,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i5fpyuk",
                          "text": "Yes back in the day when you registered to vote you also registered to be basically today's equivalent of a volunteer firefighter.",
                          "timestamp": "2022-04-20 03:23:10",
                          "score": 4,
                          "num_children": 2,
                          "author": 288573,
                          "replies": [
                            {
                              "id": "i5fqoku",
                              "text": "Oh and we STILL don't have to do anything like that. We have the privilege of voting without the burden of signing up for the draft",
                              "timestamp": "2022-04-20 03:29:07",
                              "score": 8,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "i5fqyvw",
                                  "text": "Actually as of October 2021 there's a big push for women registering to vote to also be entered into the draft. I am all for it. Equal rights across the board.",
                                  "timestamp": "2022-04-20 03:31:34",
                                  "score": 6,
                                  "num_children": 2,
                                  "author": 288573,
                                  "replies": [
                                    {
                                      "id": "i5g0z29",
                                      "text": "If prefer no one were subject to the draft, but it's only fair if men have to that women must too.",
                                      "timestamp": "2022-04-20 05:04:43",
                                      "score": 6,
                                      "num_children": 1,
                                      "author": 227146,
                                      "replies": [
                                        {
                                          "id": "i5g1it4",
                                          "text": "Happy 🍰 day",
                                          "timestamp": "2022-04-20 05:10:34",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 288573,
                                          "replies": [
                                            {
                                              "id": "i5g1xlw",
                                              "text": "Gramercy!",
                                              "timestamp": "2022-04-20 05:15:05",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 227146,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "i5fsxy6",
                                      "text": "They declined making women sign up for the draft. I wish they actually went through with it though",
                                      "timestamp": "2022-04-20 03:48:36",
                                      "score": 1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "i5ftcv6",
                                          "text": "Let's hope they try to pass it again then",
                                          "timestamp": "2022-04-20 03:52:15",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 288573,
                                          "replies": [
                                            {
                                              "id": "i5fvaqo",
                                              "text": "Instead of pushing the draft to include women, let's just get rid of the draft altogether. The military thrives better on willing volunteers and people who want to be there. Women and men forced into a situation they don't want to be brings down our strength as a whole.",
                                              "timestamp": "2022-04-20 04:09:36",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 23550,
                                              "replies": [
                                                {
                                                  "id": "i5fwo1c",
                                                  "text": "I mean I can also agree with that considering that with lower amounts of jobs available, people rush to sign up for the military because they know that it's guaranteed pay. In the current year there is no reason to actually have a draft. I know that when I enlisted in 2002 when I turned 18 and I was still in high school, it was right after 9/11, and every single day there was a long list of MOS's that were not even available or on a delayed entry.",
                                                  "timestamp": "2022-04-20 04:22:12",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 288573,
                                                  "replies": [
                                                    {
                                                      "id": "i5gx4sj",
                                                      "text": "I tried to enlist right after high school but they had to many applicants and basically told me it wasn't likely I'd get in. Fast forward 10 years later and I'm getting my degree in nursing and going in the officer route. \n\nThe government is still one of the best employers in the US with a great pension and benefits plan. \n\nI think you're heart is in the right place though, I hear people cry about the patriarchy but you no what they say. There are no feminist in times of war, sinking ships, or burning buildings. Men are expected to die first.",
                                                      "timestamp": "2022-04-20 11:52:00",
                                                      "score": 3,
                                                      "num_children": 1,
                                                      "author": 23550,
                                                      "replies": [
                                                        {
                                                          "id": "i5gxg7t",
                                                          "text": "Officer is definitely the way to go. I was a pissed off hot head that saw people attacking the people I loved and that's what got me motivated lol, but my family was all either Army (mostly) and Navy with a little bit of Marine sprinkled in. And yes to the last two sentences.",
                                                          "timestamp": "2022-04-20 11:55:04",
                                                          "score": 1,
                                                          "num_children": 0,
                                                          "author": 288573,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "i5g0v1o",
                              "text": "It's actually way stupider than the fire fighters but yeah...\n\nIt used to be a lot more suicidal.",
                              "timestamp": "2022-04-20 05:03:32",
                              "score": 1,
                              "num_children": 1,
                              "author": 227146,
                              "replies": [
                                {
                                  "id": "i5g1h3i",
                                  "text": "More stupid* and absolutely. We've all seen the \"rigs\" they had. Holy hell. With as many deaths as there were I'm surprised that there actually wasn't even more.",
                                  "timestamp": "2022-04-20 05:10:02",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 288573,
                                  "replies": [
                                    {
                                      "id": "i5g20st",
                                      "text": "Yeah I think you get used to everything being a death trap or something.",
                                      "timestamp": "2022-04-20 05:16:03",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 227146,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i5fpje7",
                      "text": "I don’t know about that. I’m a woman and I like voting.",
                      "timestamp": "2022-04-20 03:19:41",
                      "score": 4,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "i5g112f",
                          "text": "Nobody likes voting. You're a monster.",
                          "timestamp": "2022-04-20 05:05:18",
                          "score": 2,
                          "num_children": 0,
                          "author": 227146,
                          "replies": []
                        },
                        {
                          "id": "i5fpuaa",
                          "text": "Me too but I'm saying originally...",
                          "timestamp": "2022-04-20 03:22:09",
                          "score": 2,
                          "num_children": 0,
                          "author": 288573,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i5frjjs",
                      "text": "[deleted]",
                      "timestamp": "2022-04-20 03:36:28",
                      "score": 3,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i5frye0",
                          "text": "Equal opportunity should come with equal responsibility. It really isn't a very difficult concept to grasp. I don't know why men should be the ones that have to put their lives in danger for the same privileges that women don't have to. It never made sense to me.",
                          "timestamp": "2022-04-20 03:40:04",
                          "score": 4,
                          "num_children": 2,
                          "author": 288573,
                          "replies": [
                            {
                              "id": "i5fu347",
                              "text": "How exactly is it equal opportunity if I have to take on extra responsibility?",
                              "timestamp": "2022-04-20 03:58:44",
                              "score": 2,
                              "num_children": 2,
                              "author": 266807,
                              "replies": [
                                {
                                  "id": "i5fuh5l",
                                  "text": "I don't believe you read that correctly",
                                  "timestamp": "2022-04-20 04:02:11",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 288573,
                                  "replies": [
                                    {
                                      "id": "i5fuxar",
                                      "text": "Oh no I did, just pointing out that if I have to take extra responsibility then it isn’t even equal opportunity in the first place.",
                                      "timestamp": "2022-04-20 04:06:13",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 266807,
                                      "replies": [
                                        {
                                          "id": "i5fwbbs",
                                          "text": "Right women should have always been included in the draft just as men have from the beginning then this wouldn't even be a discussion.",
                                          "timestamp": "2022-04-20 04:18:59",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 288573,
                                          "replies": [
                                            {
                                              "id": "i5fwzh5",
                                              "text": "I have heard a surprising number of stupid arguments about it.\n\n “WeLl MeN pUt It In PlAcE” men that women voted for.\n\n“WeLl WhY dOnT wE jUsT aBoLiSh It” because it is an emergency reserve?\n\n“WeLl SoMeOnE nEeDs To StAy BeHiNd To TaKe CaRe Of ChIlDrEn” ok then why not require each family to send one person to fight unless otherwise impossible, it isn’t like gay men don’t exist or women are incapable of fighting.\n\n“ItS a MaNs DuTy To SaCrIfIcE” ok then shut the fuck up because it’s a woman’s duty to listen to and obey men based on those norms.",
                                              "timestamp": "2022-04-20 04:25:12",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 266807,
                                              "replies": [
                                                {
                                                  "id": "i5fxei3",
                                                  "text": "It is absolutely an emergency reserve and has only been used how many times? Someone needs to stay behind and take care of the children.... The military does not allow both parents to be deployed at the same time for exactly that reason if both parents are military. It is in no way a man's duty to sacrifice more than a woman. I did my time and my husband did his time and we are both on a level playing Field in this house. There are many things that we do not agree on, we are from opposite sides of the political spectrum, but we do have a mutual respect for each other's opinions and can disagree in a non hostile manner. This is something that we both agree on.",
                                                  "timestamp": "2022-04-20 04:29:12",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "author": 288573,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "i5fui05",
                                  "text": "I don't believe you read that correctly",
                                  "timestamp": "2022-04-20 04:02:23",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 288573,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "i5ft67z",
                              "text": "[deleted]",
                              "timestamp": "2022-04-20 03:50:37",
                              "score": 3,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "i5ftm6h",
                                  "text": "A man can sign over his rights and forfeit any involvement. When my husband went to go get his vasectomy I had to sign off on it since he was married.",
                                  "timestamp": "2022-04-20 03:54:35",
                                  "score": 0,
                                  "num_children": 2,
                                  "author": 288573,
                                  "replies": [
                                    {
                                      "id": "i5fu2f3",
                                      "text": "[deleted]",
                                      "timestamp": "2022-04-20 03:58:34",
                                      "score": 1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "i5fuf3k",
                                          "text": "I do believe it also goes state by state as well",
                                          "timestamp": "2022-04-20 04:01:40",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 288573,
                                          "replies": [
                                            {
                                              "id": "i5fum40",
                                              "text": "[deleted]",
                                              "timestamp": "2022-04-20 04:03:24",
                                              "score": 4,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "i5fury9",
                                                  "text": "It's a damn shame. Wonder where the feminists are hiding when it comes to those kinds of equal rights....",
                                                  "timestamp": "2022-04-20 04:04:50",
                                                  "score": 2,
                                                  "num_children": 1,
                                                  "author": 288573,
                                                  "replies": [
                                                    {
                                                      "id": "i5fv3m3",
                                                      "text": "[deleted]",
                                                      "timestamp": "2022-04-20 04:07:47",
                                                      "score": 3,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "i5fwhae",
                                                          "text": "It's the same thing when it comes to rape. They boycott, protest, believe all women... But I never see them doing those things outside of prisons where many many rapes are happening every year",
                                                          "timestamp": "2022-04-20 04:20:30",
                                                          "score": 2,
                                                          "num_children": 0,
                                                          "author": 288573,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "i5fui2e",
                                      "text": "Yes,  he can sign over his rights,  but he can only sign over his responsibilities if the woman both let's him AND has sufficient means without state assistance.",
                                      "timestamp": "2022-04-20 04:02:24",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 72781,
                                      "replies": [
                                        {
                                          "id": "i5funyp",
                                          "text": "It really is a sad time that we live in. If it wasn't for double standards, some people wouldn't have standards at all. One day a man will have equal rights when it comes to matters of family.",
                                          "timestamp": "2022-04-20 04:03:52",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 288573,
                                          "replies": [
                                            {
                                              "id": "i5fvhng",
                                              "text": "I'm just glad my ex didn't know how much of a chance she stood... sure my getting sole custody was obvious to any intelligent person, but had she fought I'm not confident a Washington state judge would've agreed with me...I mean we have judges assigning child support to convicted rapists from their victims.",
                                              "timestamp": "2022-04-20 04:11:21",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 72781,
                                              "replies": [
                                                {
                                                  "id": "i5fwrtr",
                                                  "text": "It saddens me to see that last sentence because I see it way too many times. People just need to get their shit together and do some research on both parents before making a decision.",
                                                  "timestamp": "2022-04-20 04:23:10",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "author": 288573,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i5fpdbo",
          "text": "- The Patriarchy:\n\nToday women can vote, can own land, can do everything any man can do legally, socially, and culturally, but according to feminists and feminist dogma we still have the 'patriarchy' which is an oppressive male dominated society. Why is that?\n\n- The Patriarchy:\n\nThe bogeyman that feminists blame for women's problems or under-achievements because their big-girl pants apparently don't fit.\n\n- The Patriarchy:\n\nA term used by feminists, to blame men for all their problems.\n\nJane: \"Why have we run out of bread?\" \n\nGill: \"Because of the patriarchy.\"\n\n- The Patriarchy:\n\nNo theory is more fundamental to academic feminism than the theory of the patriarchy.  Quite simply - and perhaps too simply - patriarchy is the feminist theory that there is a regime of institutionalised male control over women.\n\n\n- The Patriarchy:\n\nIn all, the thick academic prose of feminist scholars confers gravitas to what otherwise could resemble political propaganda. “The patriarchy is the root cause of everything! Fight it now!”… if only the word patriarchy was replaced with capitalism, it’d be similar to communist propaganda.\n\n- The Patriarchy and genders are to feminism what capital and social classes are to marxism.\n\n- The Patriarchy: \n\nHate speech, against men.\n\n\n- There is no organized patriarchy of men oppressing women. \n\n- There is no patriarchy wanting to keep you down because of your gender. \n\n- Men at the top don't form some sort of secret cabal meant to keep you from succeeding. Society does not operate like that.\n\nIf you say there is a patriarchy, then women are just as much to blame for it's existence, as they make up slightly more than 50% of the societies they live in. \n\n------------------------------------------------\n\n*Feminism is an ideology that claims to empower women by continually telling them how weak and vulnerable they are.*",
          "timestamp": "2022-04-20 03:18:20",
          "score": 27,
          "num_children": 1,
          "author": 187461,
          "replies": [
            {
              "id": "i5fq1i2",
              "text": "In a patriarchy, women wouldn’t be voting, in fact, no one would because power would be passed from father to son.",
              "timestamp": "2022-04-20 03:23:45",
              "score": 15,
              "num_children": 3,
              "replies": [
                {
                  "id": "i5fs9mg",
                  "text": "And the vast majority of men wouldn't be able to vote either...\n\nFeminists are so hot on women getting the vote and like to claim they did it all on their own in their feminist version of history...\n\nThe real history shows that it was men who gave women the vote (a large percentage of women were against it) and just as relevant, the majority of men only got the right to vote a few years before women did in most countries.\n\n-------------------------------------\n\n*Feminism:Equality, when convenient.*",
                  "timestamp": "2022-04-20 03:42:45",
                  "score": 12,
                  "num_children": 2,
                  "author": 187461,
                  "replies": [
                    {
                      "id": "i5ftt4f",
                      "text": "Always remember: as many others were given the right to vote at the time, women’s suffrage was not a feminist fight, it was an egalitarian one.",
                      "timestamp": "2022-04-20 03:56:17",
                      "score": 9,
                      "num_children": 1,
                      "author": 266807,
                      "replies": [
                        {
                          "id": "i5fvulr",
                          "text": "Then why do so many/all feminists insist it was, and for some reason known only to themselves, still is a feminist fight?\n\n-----------------------------------------------\n\n*Feminism:Equality, when convenient.*",
                          "timestamp": "2022-04-20 04:14:42",
                          "score": 4,
                          "num_children": 1,
                          "author": 187461,
                          "replies": [
                            {
                              "id": "i5fw4ru",
                              "text": "I don’t know, why do several states claim to have made the whoopie pie only for the one bakery thought to have the original recipe burn down leaving a mystery of where it came from? \n\nBecause it makes them feel good to claim they did a good thing.",
                              "timestamp": "2022-04-20 04:17:19",
                              "score": 1,
                              "num_children": 0,
                              "author": 266807,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i5g0c5u",
                      "text": ">And the vast majority of men wouldn't be able to vote either...\n\nDepends on government structure. In Greek democracies women couldn't vote or be citizens. I think that would qualify as a patriarchy.",
                      "timestamp": "2022-04-20 04:58:06",
                      "score": 2,
                      "num_children": 1,
                      "author": 227146,
                      "replies": [
                        {
                          "id": "i5g1217",
                          "text": "in that one it is, but that is like 2000 years ago",
                          "timestamp": "2022-04-20 05:05:35",
                          "score": 2,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i5g2614",
                              "text": "Those ones*. For whatever reason the Mediterranean north has always produced tonnes of Republics, throughout the millennia.",
                              "timestamp": "2022-04-20 05:17:36",
                              "score": 1,
                              "num_children": 1,
                              "author": 227146,
                              "replies": [
                                {
                                  "id": "i5g2ct5",
                                  "text": "one thing for sure is that no one in those societies is still alive",
                                  "timestamp": "2022-04-20 05:19:37",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "i5g2hlq",
                                      "text": "They are. The turks aren't the galactic empire, they didn't death star Greece. Or Dalmatia.",
                                      "timestamp": "2022-04-20 05:21:05",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 227146,
                                      "replies": [
                                        {
                                          "id": "i5g2l8j",
                                          "text": "well even if the society 2000 years ago is still intact, the people is no longer living in patriarchy",
                                          "timestamp": "2022-04-20 05:22:12",
                                          "score": 0,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i5g06ky",
                  "text": "They could conceivably vote, imho.i until the 90s one could argue we lived in a de facto patriarchy. \n\nBut not any fucking more. There are more than 5% women in office. There is no patriarchy. 10% is barely patriarchal, and anything above 25 is unreasonably described as resembling a patriarchy....\n\nTL;DR: A patriarchy cannot survive women voting for more than a generation.",
                  "timestamp": "2022-04-20 04:56:28",
                  "score": 2,
                  "num_children": 1,
                  "author": 227146,
                  "replies": [
                    {
                      "id": "i5g9awp",
                      "text": "If there were a patriarchy women would be working the dirty dangerous jobs. They aren’t.",
                      "timestamp": "2022-04-20 06:41:23",
                      "score": 2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i5l64mj",
                          "text": "Yeah.",
                          "timestamp": "2022-04-21 06:53:05",
                          "score": 1,
                          "num_children": 0,
                          "author": 227146,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i5g803u",
                  "text": "The whole \"voting\" thing is bullshit anyway. Men didn't get the right to vote, throughout the United States of America until 1859, and it came with a cost, that women don't have to pay.",
                  "timestamp": "2022-04-20 06:24:54",
                  "score": 3,
                  "num_children": 1,
                  "author": 33159,
                  "replies": [
                    {
                      "id": "i5gxku6",
                      "text": "Non property owning men. And of course everyone should have the right to vote.",
                      "timestamp": "2022-04-20 11:56:19",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i5fthdl",
          "text": "I am not as well versed as others but…\n\nPatriarchy is a theory taken from Marxism, it is about an oppressor class (men) and an oppressed class (women). The oppressor class supposedly takes advantage of the oppressed class for their own benefit.\n\nYet in no oppressed oppressed class system ever have we seen the oppressed class cast more votes, that is what we see with the “patriarchy”. Nor do we see the oppressed class being given better education, we see that with the “patriarchy”. The oppressed class has never been given more legal rights, women are.\n\nThis only leads to one conclusion, the oppressor class of the patriarchy can not exist.",
          "timestamp": "2022-04-20 03:53:23",
          "score": 4,
          "num_children": 1,
          "author": 266807,
          "replies": [
            {
              "id": "i5g1stu",
              "text": ">Patriarchy is a theory taken from Marxism, it is about an oppressor class (men) and an oppressed class (women). \n\nThat's not Marxism. It's the opposite of Marxism.  What makes Marxism marxism is that they believe that economic class is the only factor in society. That's all there is to it, if you replace class conflict with sex conflict it's something else...\n\nAlso as an extended metaphor that makes no sense bc the source of the class conflict is a need to suppress the lower class because the lower class does all the work in society... which like lol women don't do half of the work, let alone all of it. Women do negative work if you're talking monetarily. So sex marxists would want to enslave women. \n\n#siezethememesofreproduction",
              "timestamp": "2022-04-20 05:13:38",
              "score": 1,
              "num_children": 0,
              "author": 227146,
              "replies": []
            }
          ]
        },
        {
          "id": "i5fn3gn",
          "text": "If it was a patriarchy why do women vote?",
          "timestamp": "2022-04-20 03:00:05",
          "score": 8,
          "num_children": 1,
          "replies": [
            {
              "id": "i5g18or",
              "text": "I think it's better to ask: if women vote how could there be a patriarchy? \n\nAlso in actual periods of patriarchy men live longer than women. Because privileges.",
              "timestamp": "2022-04-20 05:07:32",
              "score": 2,
              "num_children": 1,
              "author": 227146,
              "replies": [
                {
                  "id": "i5gxnjl",
                  "text": "In fact if it was a patriarchy no one would vote because power would be passed from father to son",
                  "timestamp": "2022-04-20 11:57:03",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i5l28xz",
                      "text": "That's a monarchic patriarchy. \n\nAn oligarchic patriarchy would be ruled by the COUNCIL OF MANARCHS.\n\nAnd a patriarchal republic would be exclusively men voting on who may rule. \n\nAlthough ironically if you're familiar with Latin languages you may know that 'patriarchy' is actually unisex. It means 'rule by parents', moreso than rule by fathers. When you say 'mi Padres'in Spanish no one thinks 'whoah that guy has two dads', they know you're talking about your mother and father... if you actually read patriarchy theory you'll see that it doesn't actually say that it's a system perpetuated by and for men... spoiler alert: feminists don't read patriarchy theory, they just want validation for their chauvinist attitudes.",
                      "timestamp": "2022-04-21 06:03:37",
                      "score": 1,
                      "num_children": 0,
                      "author": 227146,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i5fq59r",
          "text": "Define patriarcy",
          "timestamp": "2022-04-20 03:24:39",
          "score": 3,
          "num_children": 0,
          "author": 96794,
          "replies": []
        },
        {
          "id": "i5g5rf8",
          "text": "In theory yes.. but is in practice currently? Last I checked the vast majority of countries, and especially western ones do not fit the definition of patriarchy. The patriarchy term is a useless and incorrect descriptor for sex discrimination in  modern societies.",
          "timestamp": "2022-04-20 05:58:04",
          "score": 3,
          "num_children": 0,
          "author": 296100,
          "replies": []
        },
        {
          "id": "i5fzpns",
          "text": "Anyone who claims there is a patriarchy is a joke at any point.",
          "timestamp": "2022-04-20 04:51:35",
          "score": 7,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i5io56e",
          "text": "These guys don’t get that you don’t have to live in a patriarchy in order to have society still be affected by patriarchal ideas. For example, these guys like to complain a lot about the how courts give disproportionate custody to women and they think it’s because society just hates men. It’s really just rooted in the fact that people (mostly conservatives) Bellevue that women are inherently better care givers because something something biology. I don’t believe that we live in a patriarchy necessarily, but I do think that some ideas of it are still lurking around. \n\nAlso, I really don’t get why there’s some many conservatives that are in support of anti feminists and the men’s rights movement. Aren’t ideas like financial abortion and men staying home and taking care of kids going directly against what conservatives believe in?",
          "timestamp": "2022-04-20 19:07:30",
          "score": 2,
          "num_children": 0,
          "author": 241212,
          "replies": []
        },
        {
          "id": "i5gch45",
          "text": "It’s literally not, but thanks for playing.",
          "timestamp": "2022-04-20 07:23:33",
          "score": 2,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i5g3ara",
          "text": "You're a joke",
          "timestamp": "2022-04-20 05:30:05",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i5fzsh3",
          "text": "Oh yeah that secret qabal of paedophile mannarchs who control the world from their hidden lair thousands of feet below the oceans surface. That's a thing I believe. \n\nTell me: doors this mannarchy code its leaders? Are they popularly elected, or is their a risk family of man that transmits rulership down its line as ordained by man-god?",
          "timestamp": "2022-04-20 04:52:24",
          "score": 1,
          "num_children": 0,
          "author": 227146,
          "replies": []
        },
        {
          "id": "i5h8rg7",
          "text": "It *was* a thing. It *is* still a thing in most middle eastern countries, but feminists ignore those",
          "timestamp": "2022-04-20 13:29:40",
          "score": 1,
          "num_children": 0,
          "author": 13736,
          "replies": []
        },
        {
          "id": "i5gg1lv",
          "text": "They don't. It's a straight echo chamber in here.",
          "timestamp": "2022-04-20 08:14:43",
          "score": -3,
          "num_children": 1,
          "author": 266761,
          "replies": [
            {
              "id": "i5gzohz",
              "text": "If there’s a patriarchy why do women vote?",
              "timestamp": "2022-04-20 12:15:44",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i5g96js",
          "text": "Lol exactly",
          "timestamp": "2022-04-20 06:39:51",
          "score": -3,
          "num_children": 1,
          "replies": [
            {
              "id": "i5gzl0l",
              "text": "If there is a patriarchy why do women vote?",
              "timestamp": "2022-04-20 12:14:52",
              "score": 5,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i5gdmke",
          "text": "It's incompatible with human biology and is actively contradicted by historical evidence. You just know only what the propagandists have told you.\n\nThe only thing it ever was was Simone de Beauvoir's way of making money, trying to normalize being in an abusive relationship (projection) and trying to cope with choosing fame over being married and having kids (she really wanted those).",
          "timestamp": "2022-04-20 07:40:00",
          "score": 0,
          "num_children": 0,
          "author": 73047,
          "replies": []
        }
      ]
    },
    {
      "id": "i5iftvs",
      "text": "Patriarchy kinda rocks...",
      "timestamp": "2022-04-20 18:13:23",
      "score": 0,
      "num_children": 0,
      "author": 122603,
      "replies": []
    }
  ]
}