{
  "id": "uaddk5",
  "text": "Yep…\n",
  "timestamp": "2022-04-23 19:53:08",
  "score": 752,
  "subreddit": "t5_2zaj2",
  "num_children": 15,
  "replies": [
    {
      "id": "i5x3eu9",
      "text": "To twitch’s credit, this has now been [fixed.](https://www.dexerto.com/entertainment/twitch-accused-of-double-standards-for-allowing-sexist-stream-titles-against-men-1809332/) They blamed a machine learning error (lmao ok bud)",
      "timestamp": "2022-04-23 20:32:21",
      "score": 139,
      "num_children": 4,
      "replies": [
        {
          "id": "i5yo06r",
          "text": "I do not believe it for a moment. Once it was pointed out some legal eagle told the board that an enterprising man could use this proof to rape their sexist asses in court. They did it to protect the company. Not because of any moral or truthful edict.",
          "timestamp": "2022-04-24 04:17:25",
          "score": 35,
          "num_children": 1,
          "author": 396832,
          "replies": [
            {
              "id": "i613z2i",
              "text": "I mean, they blocked the misogyny for the exact same reasons. No need to make it a big deal as long as it's fixed.",
              "timestamp": "2022-04-24 18:25:59",
              "score": -1,
              "num_children": 0,
              "author": 362637,
              "replies": []
            }
          ]
        },
        {
          "id": "i5x3lv3",
          "text": "Maybe it is indeed just a coincidence.",
          "timestamp": "2022-04-23 20:33:47",
          "score": 19,
          "num_children": 1,
          "author": 218562,
          "replies": [
            {
              "id": "i5x4r94",
              "text": "It could be. Most likely the machine learning algorithm was trained to identify racism and misogyny, and misandry just wasn’t taken seriously by developers until they got backlash.",
              "timestamp": "2022-04-23 20:42:22",
              "score": 50,
              "num_children": 2,
              "replies": [
                {
                  "id": "i5ygzfz",
                  "text": "The problem is, a machine learning algorithm is gonna learn... well, learn to be like the human interactions that train it. So like, if twitch is full of misandry, training a model off of these decisions is just gonna make a misandrist model",
                  "timestamp": "2022-04-24 03:12:00",
                  "score": 13,
                  "num_children": 0,
                  "author": 31701,
                  "replies": []
                },
                {
                  "id": "i5yk0q6",
                  "text": "You wanna know what’s crazy;\n\nYou’re way more likely to see ‘I hate men’ than ‘I hate women’. Men don’t really just say that outright like that. Even if they actually did hate women. And I don’t think very many men legitimately hate women, but definitely a good chunk may have certain disdain mostly because they would like to be more desired and basically blame women (aka they’re sexually frustrated aka they’re incels)\n\n(quick edit - also a good chunk don’t care too much for narcissists, egomaniacs, victimhood addicts, naggers, hypergamy, divorce laws, materialism and superficiality, etc, which is not associated with every single woman, at all, but is far too common)\n\nBut yeah, it’s also almost socially acceptable to say ‘I hate men’, versus the other one being instant reprimanding and banishment lol",
                  "timestamp": "2022-04-24 03:39:44",
                  "score": 6,
                  "num_children": 0,
                  "author": 130979,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i5zfipe",
          "text": "They trained the machine learning model. Did it ecounter a program exception or an \"error\" where they didn't get what they wanted?\n\nThey trained the model with data they know.\nThe data could have been \"modified\" because feminists, but they didn't do it for men",
          "timestamp": "2022-04-24 10:00:10",
          "score": 2,
          "num_children": 0,
          "author": 356196,
          "replies": []
        },
        {
          "id": "i5zzhln",
          "text": "I'm impressed they even \"acknowledged\" this is a problem. My expectation would be that they would just dismiss it, saying \"men can't be discriminated against\" like reddit does.",
          "timestamp": "2022-04-24 13:41:52",
          "score": 2,
          "num_children": 0,
          "author": 312201,
          "replies": []
        }
      ]
    },
    {
      "id": "i5xeg7j",
      "text": "Not surprising. Twitch is literally THE simp platform. Women can and do whatever they want there. Even more than in the real world.",
      "timestamp": "2022-04-23 21:57:20",
      "score": 38,
      "num_children": 1,
      "author": 131368,
      "replies": [
        {
          "id": "i5xvses",
          "text": "My 12 year old watches some twitch streamers, and in the process of learning about that I've seen some of the shit the boys at her school do and say on there. Some of it is beyond cringe.",
          "timestamp": "2022-04-24 00:14:42",
          "score": 9,
          "num_children": 1,
          "author": 202637,
          "replies": [
            {
              "id": "i5zu9tl",
              "text": "I heard about a twitch streamer giving vodka live to her cat.",
              "timestamp": "2022-04-24 12:55:50",
              "score": 3,
              "num_children": 1,
              "author": 131368,
              "replies": [
                {
                  "id": "i60h9je",
                  "text": "U mean Alinity?\n\nShe abused her cat",
                  "timestamp": "2022-04-24 15:51:54",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i60hvlr",
                      "text": "Yup, her exactly. There has also been a huge drama when one of Amouranth's mods discovered she's married.",
                      "timestamp": "2022-04-24 15:56:10",
                      "score": 1,
                      "num_children": 0,
                      "author": 131368,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i5x72wa",
      "text": "So men have been defending and providing for their women since the beginning of evolution and this is what they get?",
      "timestamp": "2022-04-23 21:00:10",
      "score": 50,
      "num_children": 3,
      "replies": [
        {
          "id": "i5xemqp",
          "text": ">beginning of evolution\n\nSmall correction, it's more like \"Beginning of speciation\" but yeah you got the point.",
          "timestamp": "2022-04-23 21:58:48",
          "score": 34,
          "num_children": 0,
          "author": 67028,
          "replies": []
        },
        {
          "id": "i5xvikl",
          "text": "😂 Right. No good deed goes unpunished.",
          "timestamp": "2022-04-24 00:12:24",
          "score": 14,
          "num_children": 1,
          "author": 202637,
          "replies": [
            {
              "id": "i5y73jh",
              "text": "That sucks, \n\nGood is supposed to be karmically rewarded.\n\nEvil is supposed to be punished. \n\nThis is the planet of the unsung heroes and misandrist radfems.",
              "timestamp": "2022-04-24 01:47:59",
              "score": 5,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i5yf7xe",
          "text": ">So men have been defending and providing for their women since the beginning of evolution and this is what they get?\n\noh, sweetie, what the anti-feminists said to you, how brainwashed are you to think like that",
          "timestamp": "2022-04-24 02:56:22",
          "score": -8,
          "num_children": 1,
          "replies": [
            {
              "id": "i5zf50j",
              "text": "That's not brainwashing, miss feminist. That's the truth. And antifeminists didn't tell me anything. I chose to join and support them, starting with my spouse. #RejectFeminismEmbraceRomance \n#RejectFeminismEmbraceTruth",
              "timestamp": "2022-04-24 09:54:40",
              "score": 5,
              "num_children": 1,
              "replies": [
                {
                  "id": "i5zlstm",
                  "text": "what do you think men have provided women EXCLUSIVELY so far???",
                  "timestamp": "2022-04-24 11:25:00",
                  "score": -2,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "i61uqf1",
                      "text": "Listen, I don't participate here in this respectful antifeminist sub to answer the inquisition questions of some infected feminist. I have chosen to reject this poison and be a submissive to my spouse, antifeminist woman. Please go to Female dating strategy and wave your flag there. I don't know what you do here. You are addicted to getting triggered or what.",
                      "timestamp": "2022-04-24 21:34:28",
                      "score": 3,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i628prf",
                          "text": "> I have chosen to reject this poison and be a submissive to my spouse, antifeminist woman.\n\ndamn it, that sounds like a red flag in a relationship dynamic to me",
                          "timestamp": "2022-04-24 23:18:44",
                          "score": 0,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i63dncv",
                      "text": "Since like the beginning of time, it was always men who went to war and women who stayed taking care of children and their home... Both genders have their roles, men did theirs and women did theirs. (And don't try to bring up someone like Joan of arc, there are outliers to everything.) Feminism tries to destroy this system and make it so both men also stay at home to take care of the children and home, however at the same time don't even advocate for women to go to war/get drafted so it's pretty hypocritical lmao.",
                      "timestamp": "2022-04-25 04:55:48",
                      "score": 2,
                      "num_children": 1,
                      "author": 31583,
                      "replies": [
                        {
                          "id": "i63g010",
                          "text": ">Since like the beginning of time, it was always men who went to war and women who stayed taking care of children and their home...\n\nso we gonna ignore all the statistic about how women are raped and killed in war now?? And also, the only people who are actually protected in war are upperclass straight white men. And if all men were on the battlefield,who gonna run the factories that produce weapons in wars ,[women do that shit](https://en.wikipedia.org/wiki/Women_in_war) .\n\n> Feminism tries to destroy this system and make it so both men also stay at home to take care of the children and home.\n\nwe advocate for 🔥🔥 TWO INCOME HOUSEHOLD🔥🔥.\n\n>however at the same time don't even advocate for women to go to war/get drafted so it's pretty hypocritical lmao.\n\n\"Nations that in present-day actively draft women into military service are Bolivia,\\[73\\] Chad,\\[74\\] Eritrea,\\[75\\]\\[76\\]\\[77\\] Israel,\\[75\\]\\[76\\]\\[78\\] Mozambique,\\[79\\] Norway,\\[80\\] North Korea\\[81\\] and Sweden.\\[82\\]  \nFinland introduced voluntary female conscription in 1995, giving women between the ages of 18-29 an option to complete their military service alongside men\"\n\n\\--Wikipedia--",
                          "timestamp": "2022-04-25 05:21:06",
                          "score": 0,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i63gtx6",
                              "text": "> so we gonna ignore all the statistic about how women are raped and killed in war now??\n\nObviously there are victims from both genders, however it's pretty clear men were the ones who always went to war.\n\n> And if all men were on the battlefield,who gonna run the factories that produce weapons in wars ,women do that shit \n\nBoth genders do that, my point is literally just that both genders have had their own roles for generations and it's worked fine.\n\n> Nations that in present-day actively draft women into military service are Bolivia,[73] Chad,[74] Eritrea,[75][76][77] Israel,[75][76][78] Mozambique,[79] Norway,[80] North Korea[81] and Sweden.[82]\nFinland introduced voluntary female conscription in 1995, giving women between the ages of 18-29 an option to complete their military service alongside men\n\nI'm saying there's an obvious difference between how both genders are treated with regards to being drafted. For example, when Ukraine began barring men from leaving the country and rather making them stay to fight, no feminist called them out and said they should also make women fight.",
                              "timestamp": "2022-04-25 05:30:21",
                              "score": 1,
                              "num_children": 1,
                              "author": 31583,
                              "replies": [
                                {
                                  "id": "i63lobw",
                                  "text": ">Both genders do that, my point is literally just that both genders have had their own roles for generations and it's worked fine.\n\nyes, there are things a specific sex just better at, the thing is, they used it as an excuse to not let women vote,have a job,drive a car etc because they just have to vent out nonsense in order to justify their sexism towards women. Physicall strength is a key essence in military/dirty jobs, that's why there are more men in war/construction work than women. But in bussiness, science, art etc, women and men are equal.",
                                  "timestamp": "2022-04-25 06:27:16",
                                  "score": 1,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i5wzcko",
      "text": "wth",
      "timestamp": "2022-04-23 20:01:50",
      "score": 12,
      "num_children": 0,
      "author": 178064,
      "replies": []
    },
    {
      "id": "i6061xh",
      "text": "It's crazy, twitch is filled pink haired woke weirdos.",
      "timestamp": "2022-04-24 14:32:37",
      "score": 3,
      "num_children": 0,
      "author": 113719,
      "replies": []
    },
    {
      "id": "i5x7y5u",
      "text": "They think it’s funny but it’s really just a sing that you can say whatever you want about men but you have to watch what you say about women they are so dumb they don’t even get it.",
      "timestamp": "2022-04-23 21:06:51",
      "score": 13,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i5zhidg",
      "text": "Instagram has (had?) the same thing, where if you commented \"i hate men\" it would go, but if you commented \"i hate women\" you would get that its agains the site guidelines.",
      "timestamp": "2022-04-24 10:27:52",
      "score": 3,
      "num_children": 0,
      "author": 73013,
      "replies": []
    },
    {
      "id": "i5xj5il",
      "text": "Did you assume my gender?",
      "timestamp": "2022-04-23 22:33:53",
      "score": 10,
      "num_children": 0,
      "author": 227925,
      "replies": []
    },
    {
      "id": "i5ygshi",
      "text": "Women dressing like sluts say that air conditioners are sexist, but this is the real sexism.",
      "timestamp": "2022-04-24 03:10:17",
      "score": 5,
      "num_children": 0,
      "author": 73826,
      "replies": []
    },
    {
      "id": "i5xeuec",
      "text": "And that is why I don't use Twtch anymore.",
      "timestamp": "2022-04-23 22:00:27",
      "score": 4,
      "num_children": 0,
      "author": 54690,
      "replies": []
    },
    {
      "id": "i5yntur",
      "text": "This is discrimination. It should be illegal. What i wouldn't give to start a class action lawsuit. Think about it guys. We could get Google/Alphabet, Facebook and co., and more if we did the leg work. It is illegal in the United States to change the price and/or quality of public facing sales or service based on ANY protected status, including gender. We really have the makings of the biggest trap ever set in the history of humanity. But we'll just keep our various circle jerks going. We'll just keep talking to each other about it. Le sigh.",
      "timestamp": "2022-04-24 04:15:42",
      "score": 3,
      "num_children": 0,
      "author": 396832,
      "replies": []
    },
    {
      "id": "i5zbh76",
      "text": "This make me really mad for some reason. Not so much so the image but the person saying”iM wHeEzinG eVeN tWitCh HaTeS yOU GuYs” they think they’re so cool and act like misandry is great😐",
      "timestamp": "2022-04-24 09:02:36",
      "score": 1,
      "num_children": 0,
      "author": 295702,
      "replies": []
    },
    {
      "id": "i5yxh9q",
      "text": "I stream weekly twitch bans a lot of words. It is indeed machine learning. I couldn't even put \"let's get crazy\". Because crazy was flagged for a while too .",
      "timestamp": "2022-04-24 05:58:20",
      "score": 1,
      "num_children": 0,
      "author": 340182,
      "replies": []
    },
    {
      "id": "i610r5c",
      "text": "*Even* twitch.\n\nI wonder what the other platforms are",
      "timestamp": "2022-04-24 18:03:55",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i6142hh",
      "text": "Cheers mate",
      "timestamp": "2022-04-24 18:26:40",
      "score": 1,
      "num_children": 0,
      "author": 396832,
      "replies": []
    }
  ]
}