{
  "id": "ukv580",
  "text": "So explain these 10 billionaires.\n",
  "timestamp": "2022-05-08 05:43:23",
  "score": 27185,
  "subreddit": "t5_2cn1kk",
  "num_children": 70,
  "author": 342545,
  "replies": [
    {
      "id": "i7rmb7q",
      "text": "Hey /u/Ehansaja, thanks for submitting to /r/confidentlyincorrect! Take a moment to read our [rules](https://reddit.com/r/confidentlyincorrect/about/rules).\n\n##Join our [Discord Server](https://discord.gg/n2cR6p25V8)!\n\nPlease report this post if it is bad, or not relevant. Remember to keep comment sections civil. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/confidentlyincorrect) if you have any questions or concerns.*",
      "timestamp": "2022-05-08 05:43:23",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "i7s876z",
      "text": "During Native American Heritage Month in the US, my company put up a big poster in the cafeteria about it.  It explained two holidays.  Those holidays were Thanksgiving and Diwali.\n\nThis wasn’t some little company in the middle of nowhere.  This is a major automaker in the world and a household name.  You know this company.\n\nI’ve never seen such an idiotic shit from an HR group in my whole life.  That’s just one example.",
      "timestamp": "2022-05-08 10:50:38",
      "score": 727,
      "num_children": 9,
      "author": 7765,
      "replies": [
        {
          "id": "i7snrx1",
          "text": "ford?",
          "timestamp": "2022-05-08 13:39:10",
          "score": 105,
          "num_children": 1,
          "author": 407827,
          "replies": [
            {
              "id": "i7teb0s",
              "text": "Japanese.\n\nThat being said, there were almost no Japanese people in HR.  All Americans.  I think Japanese employees would have probably gotten it right.  They definitely would have gotten the comp study right.",
              "timestamp": "2022-05-08 17:00:29",
              "score": 194,
              "num_children": 3,
              "author": 7765,
              "replies": [
                {
                  "id": "i7teqn8",
                  "text": ">Japanese\n\nDo you have any idea how little that narrows it down?",
                  "timestamp": "2022-05-08 17:03:35",
                  "score": 102,
                  "num_children": 6,
                  "author": 407827,
                  "replies": [
                    {
                      "id": "i7tkwl5",
                      "text": "Nintendo or smth idk",
                      "timestamp": "2022-05-08 17:47:43",
                      "score": 109,
                      "num_children": 1,
                      "author": 51434,
                      "replies": [
                        {
                          "id": "i7u1l6s",
                          "text": "I got an uncle that works there.",
                          "timestamp": "2022-05-08 19:50:17",
                          "score": 42,
                          "num_children": 1,
                          "author": 241418,
                          "replies": [
                            {
                              "id": "i7u5csp",
                              "text": "My uncle works at Xbox and he said  your uncle died.",
                              "timestamp": "2022-05-08 20:18:14",
                              "score": 37,
                              "num_children": 1,
                              "author": 288796,
                              "replies": [
                                {
                                  "id": "i7vgkbq",
                                  "text": "I read that \"lied\" as \"died\" and just accepted this comment as one of my top 3 favorite shitposts",
                                  "timestamp": "2022-05-09 02:32:39",
                                  "score": 5,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "i7vxdcd",
                                      "text": "Noted.",
                                      "timestamp": "2022-05-09 05:20:12",
                                      "score": 3,
                                      "num_children": 0,
                                      "author": 288796,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i7tl876",
                      "text": "They probably do know but it's clear through their wording they don't want to say specifics.",
                      "timestamp": "2022-05-08 17:50:01",
                      "score": 36,
                      "num_children": 0,
                      "author": 307112,
                      "replies": []
                    },
                    {
                      "id": "i7tlghp",
                      "text": "To 5 companies.",
                      "timestamp": "2022-05-08 17:51:42",
                      "score": 12,
                      "num_children": 0,
                      "author": 7765,
                      "replies": []
                    },
                    {
                      "id": "i7ubeq0",
                      "text": "Thats the point I think.",
                      "timestamp": "2022-05-08 21:02:54",
                      "score": 5,
                      "num_children": 0,
                      "author": 72321,
                      "replies": []
                    },
                    {
                      "id": "i7tnb4s",
                      "text": "It's Toyota. That's the only household name of Japanese auto manufacturers. They also build most of their cars for sale in the US in the US, in two huge plants in the Midwest (iirc). \n\nI had to think for way longer than I'd like to admit to remember Honda, and there's also Nissan. But Toyota is the second largest auto maker by sales in the US (or was) - ford with their F-150 is the first.",
                      "timestamp": "2022-05-08 18:05:23",
                      "score": 20,
                      "num_children": 6,
                      "author": 337140,
                      "replies": [
                        {
                          "id": "i7u1vjz",
                          "text": "Subaru is also quite popular in the US just not as much",
                          "timestamp": "2022-05-08 19:52:26",
                          "score": 17,
                          "num_children": 0,
                          "author": 211870,
                          "replies": []
                        },
                        {
                          "id": "i7uhake",
                          "text": "Honda? Nissan? Subaru? Plenty of household names from Japan",
                          "timestamp": "2022-05-08 21:45:16",
                          "score": 19,
                          "num_children": 0,
                          "author": 292026,
                          "replies": []
                        },
                        {
                          "id": "i7ub0rf",
                          "text": "Huge is an understatement lol, I used to work at one of the plants (they have like 3 or 4 all in the same general area) in Princeton and their plants+parking lots are bigger than a few of the surrounding towns.",
                          "timestamp": "2022-05-08 21:00:02",
                          "score": 12,
                          "num_children": 0,
                          "author": 62653,
                          "replies": []
                        },
                        {
                          "id": "i7uh06q",
                          "text": "There are Nissan plants all around me. I would have assumed that before Toyota tbh. I know the numbers tell a different story. It's just the one I, and a lot of us down south, would have thought of first.",
                          "timestamp": "2022-05-08 21:43:11",
                          "score": 6,
                          "num_children": 0,
                          "author": 143582,
                          "replies": []
                        },
                        {
                          "id": "i7u8swk",
                          "text": "Which one is for lesbians?",
                          "timestamp": "2022-05-08 20:43:25",
                          "score": 3,
                          "num_children": 0,
                          "author": 66722,
                          "replies": []
                        },
                        {
                          "id": "i7u1apm",
                          "text": "Also Hyundai and Subaru",
                          "timestamp": "2022-05-08 19:48:07",
                          "score": -4,
                          "num_children": 2,
                          "author": 34459,
                          "replies": [
                            {
                              "id": "i7u1q6c",
                              "text": "Hyundai is South Korean",
                              "timestamp": "2022-05-08 19:51:19",
                              "score": 12,
                              "num_children": 0,
                              "author": 190621,
                              "replies": []
                            },
                            {
                              "id": "i7u65qj",
                              "text": "Subaru is only a household name in certain parts of the US. I can't even think of a joke like \"fix or repair daily\" for Subaru.\n\nToyota's is \"take off your oversize tires, asshole\"",
                              "timestamp": "2022-05-08 20:24:05",
                              "score": 3,
                              "num_children": 2,
                              "author": 337140,
                              "replies": [
                                {
                                  "id": "i7uc6hg",
                                  "text": "Alaska and most of the PNW is Subaru haven.  I drive an STI up here but they just canceled the manufacture of any more.  I have a 350z as well but I’ve never owned a Toyota though I did like the older Supras.  I wish Mitsubishi wasn’t practically dead cause I liked the Evos and 3000GT.",
                                  "timestamp": "2022-05-08 21:08:39",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 2082,
                                  "replies": []
                                },
                                {
                                  "id": "i7u78aq",
                                  "text": "I mean ford is a household name and those break down constantly, i don’t think “household name” is synonymous with “never has issues”",
                                  "timestamp": "2022-05-08 20:32:00",
                                  "score": 0,
                                  "num_children": 0,
                                  "author": 34459,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i80duc3",
                      "text": "\"auto\" plus \"household name\" -- i'd prob go Toyota, then Honda as a 2nd choice",
                      "timestamp": "2022-05-10 04:01:06",
                      "score": 1,
                      "num_children": 0,
                      "author": 9869,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i7u2qen",
                  "text": "Honda. It could’ve been Toyota or one of the others but this seems like something American Honda branches would do.",
                  "timestamp": "2022-05-08 19:58:46",
                  "score": 9,
                  "num_children": 0,
                  "author": 118385,
                  "replies": []
                },
                {
                  "id": "i7wpmrf",
                  "text": "Toyota?",
                  "timestamp": "2022-05-09 11:46:56",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i7sa1jc",
          "text": "[deleted]",
          "timestamp": "2022-05-08 11:15:37",
          "score": 38,
          "num_children": 2,
          "replies": [
            {
              "id": "i7sbb89",
              "text": "The sign said, “Native American Heritage Appreciation Month” across the top of it.  They did nothing else to “appreciate Native Americans” besides this sign in the cafeteria.\n\nIt’s not like the sign included Makahiki or Soyal.  There’s a countless number of harvest holidays that could have been covered.  Why wouldn’t one assume that they confused Indians with American Indians?\n\nThis is the same group that put up Christmas toy drive signs everywhere that asked people to bring toys in by December 27th but somehow meant November 17th.  Someone literally had to look at the signs about 100 times as they put them up.  I still wonder how many kids didn’t get gifts until January because of this.\n\nThey also told everyone that they did a compensation study of <Company> employees against other OEMs in the same city and found that <Company> employees make exactly the 50th percentile.  They didn’t put it together that the only OEM in this city is <Company>.  If you’re not into stats, that means they compared a group’s pay against itself and found that it was eerily very similar.  When alerted, they tried to recall emails of the report.",
              "timestamp": "2022-05-08 11:31:48",
              "score": 120,
              "num_children": 2,
              "author": 7765,
              "replies": [
                {
                  "id": "i7sbjtz",
                  "text": "[deleted]",
                  "timestamp": "2022-05-08 11:34:42",
                  "score": 37,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i7st66d",
                      "text": "Sounds like an HR department kept employed by nepotism rather than competence.",
                      "timestamp": "2022-05-08 14:23:58",
                      "score": 20,
                      "num_children": 0,
                      "author": 125908,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i7tfhdf",
                  "text": "> asked people to bring toys in by December 27th\n\nJust thinking out loud: it's actually not too bad of an idea, considering that most people are about to return gifts or tidy out after their kids got way too much? And maybe people would be more generous after holidays?",
                  "timestamp": "2022-05-08 17:08:52",
                  "score": 5,
                  "num_children": 1,
                  "author": 97755,
                  "replies": [
                    {
                      "id": "i7tl53u",
                      "text": "You’re not wrong.  However, they did replace all the signs after it was brought up to them.",
                      "timestamp": "2022-05-08 17:49:24",
                      "score": 5,
                      "num_children": 0,
                      "author": 7765,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i7sgqw7",
              "text": "Thanksgiving isn't a Native American holiday either though......",
              "timestamp": "2022-05-08 12:33:31",
              "score": 26,
              "num_children": 1,
              "author": 310330,
              "replies": [
                {
                  "id": "i7sk5wl",
                  "text": "It would be like Brits celebrating the 4th of July. Sure we were involved. But it didn't go well.",
                  "timestamp": "2022-05-08 13:07:16",
                  "score": 35,
                  "num_children": 2,
                  "author": 223634,
                  "replies": [
                    {
                      "id": "i7u4dkw",
                      "text": "Pre reddit, I did encounter someone who flat out asked what we were doing for the 4th and we were like \"er what ever we do on any other day in July\"\n\nThey honestly thought like St Patrick's day, everyone and their dog celebrated it, well it was that or Thanksgiving, it was over fifteen years ago.\n\n&#x200B;\n\nLike we now have Black Friday sales (yeah I don't get it either) and our door busters on the first year looked just like any other 24 hour tesco, one customer and half a dozen members of staff.\n\nThe guy was probably going into that Tesco anyway cos people do like to shop at night when they work shifts.",
                      "timestamp": "2022-05-08 20:10:53",
                      "score": 4,
                      "num_children": 0,
                      "author": 72734,
                      "replies": []
                    },
                    {
                      "id": "i7ssnui",
                      "text": "Not sure what you think the Thanksgiving story is. A better comparison would be both Brits and Germans celebrating the WWI Christmas truce. Sure, things didn't go well before or after, but it's not unreasonable for either side to find that event worth celebrating.\n\nEdit: I've been getting barraged with downvotes but no one has commented on anything substantively inaccurate about my comment. To be clear, I'm not saying Thanksgiving is a Native American cultural holiday, all I'm saying is that comparing it to the Brits celebrating 4th of July doesn't make any sense, since it's not like Thanksgiving is a celebration of defeating Native Americans.",
                      "timestamp": "2022-05-08 14:19:55",
                      "score": -17,
                      "num_children": 1,
                      "author": 127271,
                      "replies": [
                        {
                          "id": "i7tz1et",
                          "text": "A xxxx holiday is a holiday traditionally celebrated by xxxx culture.\n\nThanksgiving is not a traditional American Indian holiday. Even in the common origin story (which has disputes that I don't really feel like doing a deep dive in the various different versions to find what's accurate) it was a celebration of the first harvest in Plymouth by *colonizers* that happened to be attended by some of the local population. Its origin is unequivocally in the people that would later become American, making it not an American Indian traditional holiday",
                          "timestamp": "2022-05-08 19:31:22",
                          "score": 6,
                          "num_children": 1,
                          "author": 213832,
                          "replies": [
                            {
                              "id": "i7v8g5m",
                              "text": "Wait is that why I'm getting downvoted? Obviously I don't think Thanksgiving is a Native American holiday. I was just responding to someone making a nonsense analogy and providing a more apt analogy.",
                              "timestamp": "2022-05-09 01:25:14",
                              "score": 1,
                              "num_children": 0,
                              "author": 127271,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i7se2jk",
          "text": "It's not as big a mistake as still calling native Americans as  Indians because Columbus thought he landed in India.",
          "timestamp": "2022-05-08 12:04:30",
          "score": 29,
          "num_children": 4,
          "author": 296178,
          "replies": [
            {
              "id": "i7skdv7",
              "text": "I’m not sure why you’re getting downvoted. That really was the original cause of all this confusion.",
              "timestamp": "2022-05-08 13:09:18",
              "score": 16,
              "num_children": 0,
              "author": 181847,
              "replies": []
            },
            {
              "id": "i7tpyi6",
              "text": "The origin of using \"Indians\" as a descriptor for the first peoples of America was borne out of ignorance and misunderstanding, sure.\n\nBut to call it a \"mistake\" to still use American Indians as a term is rather ignorant of you. I recommend getting a bit more informed on the subject before forming such sentiments to strongly, [here's a good primer to introduce what I mean](https://www.youtube.com/watch?v=kh88fVP2FWQ).",
              "timestamp": "2022-05-08 18:24:45",
              "score": 9,
              "num_children": 1,
              "author": 378896,
              "replies": [
                {
                  "id": "i7twtkr",
                  "text": "A mistake can be corrected. What's the necessity to continue calling native Americans as Indians?",
                  "timestamp": "2022-05-08 19:15:15",
                  "score": 2,
                  "num_children": 2,
                  "author": 296178,
                  "replies": [
                    {
                      "id": "i7tzbve",
                      "text": "...did you watch the video I linked? It's not very long, and part of it addresses the potential issues with the terminology of Native Americans in this context.",
                      "timestamp": "2022-05-08 19:33:31",
                      "score": 3,
                      "num_children": 0,
                      "author": 378896,
                      "replies": []
                    },
                    {
                      "id": "i7tz6lk",
                      "text": "The fact that they generally call themselves Indians and it's not our place to correct it?\n\nI'm going to use American in this analogy because that's the general label for me, but you can replace it with whatever applies to you.\n\nSay you identify as American. That's what you consider yourself, and when you think of the word, you think of yourself and other people with a similar history and culture. Then some day, non-Americans decide that, actually, that word is ignorant, and you should be called something else. You should replace a word that has identified your culture as yours for centuries because other people insist that it's offensive to you. Wouldn't that make you upset?\n\nA group should be allowed to name themselves. Even though the origin of the word is confused, and instead of naming themselves they had it thrust on them, they've since chosen it. No one else has the right to take that away from them, as so much has already been taken.",
                      "timestamp": "2022-05-08 19:32:26",
                      "score": 5,
                      "num_children": 1,
                      "author": 213832,
                      "replies": [
                        {
                          "id": "i7y0q0g",
                          "text": "On a trip to Canada once (I'm from the U.S.) I was talking with the border agent and I started to say I was an American but then thought that really wasn't very specific.  It occurred to me that people from the U.S. tend to equate \"American\" with being from the U.S. which seems a little presumptuous.  Canadians and Mexicans are also \"Americans\" and, for that matter, so are Columbians, Bolivians, Chileans, etc.  I guess United Stations just doesn't roll off the tongue like the others.",
                          "timestamp": "2022-05-09 17:35:16",
                          "score": 0,
                          "num_children": 1,
                          "author": 187544,
                          "replies": [
                            {
                              "id": "i7yo7nz",
                              "text": "I guess technically. I'd argue that \"American\" has come to mean very specifically as from the United States. I'd say that saying you're \"from America\" would lack the level of specificity, but American is the word that has unambiguously meant being from the United States for long enough that no one really questions it, and that's really how language works.",
                              "timestamp": "2022-05-09 20:14:54",
                              "score": 1,
                              "num_children": 1,
                              "author": 213832,
                              "replies": [
                                {
                                  "id": "i81rs00",
                                  "text": "Perhaps.  It still upsets upsets me when people use \"literally\" incorrectly but I understand that's o.k. now too.",
                                  "timestamp": "2022-05-10 13:34:26",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 187544,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i7tdtcz",
              "text": "That’s one of the worst arguments I’ve heard for several months.",
              "timestamp": "2022-05-08 16:57:02",
              "score": 0,
              "num_children": 0,
              "author": 7765,
              "replies": []
            },
            {
              "id": "i7u5kv6",
              "text": "Apparently most natives actually prefer Indian according to this video https://youtu.be/kh88fVP2FWQ",
              "timestamp": "2022-05-08 20:19:54",
              "score": 1,
              "num_children": 0,
              "author": 211870,
              "replies": []
            }
          ]
        },
        {
          "id": "i7sjq69",
          "text": ">Diwali\n\nCelebrate Sankranthi, which is more nature friendly.",
          "timestamp": "2022-05-08 13:03:17",
          "score": 2,
          "num_children": 0,
          "author": 263221,
          "replies": []
        },
        {
          "id": "i7sm46o",
          "text": "Why won't you say the company name?",
          "timestamp": "2022-05-08 13:24:56",
          "score": -4,
          "num_children": 1,
          "author": 101818,
          "replies": [
            {
              "id": "i7te32t",
              "text": "I gain nothing but the potential to no longer be on good terms with a past employer.",
              "timestamp": "2022-05-08 16:58:56",
              "score": 7,
              "num_children": 1,
              "author": 7765,
              "replies": [
                {
                  "id": "i7u5pxd",
                  "text": "If you're identifiable from your reddit posts then that's already true isn't it?",
                  "timestamp": "2022-05-08 20:20:53",
                  "score": 0,
                  "num_children": 2,
                  "author": 311569,
                  "replies": [
                    {
                      "id": "i7udyi3",
                      "text": "No. The employer probably couldn't care less if an employee doesn't like them. It's only harmful if they're telling others what they do wrong.",
                      "timestamp": "2022-05-08 21:21:12",
                      "score": 3,
                      "num_children": 0,
                      "author": 209579,
                      "replies": []
                    },
                    {
                      "id": "i7u9ip8",
                      "text": "“If” being the important word there.",
                      "timestamp": "2022-05-08 20:48:40",
                      "score": 1,
                      "num_children": 1,
                      "author": 7765,
                      "replies": [
                        {
                          "id": "i7uea0w",
                          "text": "Huh? What I'm saying is that mentioning the company name doesn't change anything.",
                          "timestamp": "2022-05-08 21:23:23",
                          "score": 0,
                          "num_children": 1,
                          "author": 311569,
                          "replies": [
                            {
                              "id": "i7ugvpn",
                              "text": "I don’t really have any desire to take that chance.",
                              "timestamp": "2022-05-08 21:42:14",
                              "score": 3,
                              "num_children": 1,
                              "author": 7765,
                              "replies": [
                                {
                                  "id": "i7ul42c",
                                  "text": "Yeah, probably smart.",
                                  "timestamp": "2022-05-08 22:13:43",
                                  "score": 0,
                                  "num_children": 0,
                                  "author": 311569,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i7wr434",
          "text": "Omfg this is some Michael Scott shit",
          "timestamp": "2022-05-09 12:02:07",
          "score": 1,
          "num_children": 0,
          "author": 84752,
          "replies": []
        },
        {
          "id": "i7s8uu1",
          "text": "[deleted]",
          "timestamp": "2022-05-08 10:59:48",
          "score": -48,
          "num_children": 3,
          "replies": [
            {
              "id": "i7s8zrm",
              "text": "They celebrated a holiday that American Indians hate and a holiday that is Indian and not American Indian.  They’re too dumb to know that it would be offensive and idiotic.\n\nTake another stab at it, I guess?",
              "timestamp": "2022-05-08 11:01:38",
              "score": 38,
              "num_children": 0,
              "author": 7765,
              "replies": []
            },
            {
              "id": "i7sfvac",
              "text": "You don’t have to defend your relatives on the internet where no one knows you’re related, lol.\n\n(Watch this one sail over their head too!!)",
              "timestamp": "2022-05-08 12:24:10",
              "score": 7,
              "num_children": 0,
              "author": 42317,
              "replies": []
            },
            {
              "id": "i7ssrq9",
              "text": "bruh, imagine going to a japanese american and telling them to celebrate ww2 when their parents and grandparents were shoved into internment camps.\nThanksgiving day is for the violent colonizers not the victims",
              "timestamp": "2022-05-08 14:20:45",
              "score": 4,
              "num_children": 0,
              "author": 367284,
              "replies": []
            }
          ]
        },
        {
          "id": "i7udmhv",
          "text": "I will give Amazon props on this.  I've not seen this kind of idiot mixup yet.\n\nThe blowup xmas Millenium Falcon was a bit stupid though.",
          "timestamp": "2022-05-08 21:18:53",
          "score": -1,
          "num_children": 0,
          "author": 278044,
          "replies": []
        },
        {
          "id": "i7uog85",
          "text": "Diwali is in late October, it's not that much of a stretch. They just wanted to be dIVeRsE.\nBesides, they don't want it to look like they're endorsing a religion (Thanksgiving is a Christian holiday). That would be the worst thing imaginable for stupid HR groups.\n\nAlthough Native American Heritage month is pretty much a liturgical calendar month anyway.",
          "timestamp": "2022-05-08 22:40:00",
          "score": -1,
          "num_children": 0,
          "author": 221291,
          "replies": []
        }
      ]
    },
    {
      "id": "i7rw5o7",
      "text": "Even if they were Native American it’s still not much of a rebuttal towards reservations with barely any opportunities and often limited basic infrastructure.\n\nThe whole system is brutally unfair with some being moved to land in locations perfect for building the kind of casinos we see as a stereotype in media but most through no fault of their own are trying to maintain a lifestyle and culture on land with very limited opportunities to build an economy.",
      "timestamp": "2022-05-08 07:53:42",
      "score": 1253,
      "num_children": 10,
      "author": 70032,
      "replies": [
        {
          "id": "i7s4psw",
          "text": "Yeah, it’s like discussing the poverty of black people in America and someone pointing out NBA and NFL players, Kanye West and JayZ.\n\nLike, I don’t think the article stating every single Native American was poor. I would assume the ones running casinos would be pretty well off.",
          "timestamp": "2022-05-08 10:00:19",
          "score": 430,
          "num_children": 9,
          "author": 266547,
          "replies": [
            {
              "id": "i7sbw0k",
              "text": "I assume the person who sent the article link would argue that if *these* people can be billionaires, it proves that any of the Native American people in poverty *could* have been billionaires if they'd just worked harder...",
              "timestamp": "2022-05-08 11:38:56",
              "score": 195,
              "num_children": 3,
              "author": 287598,
              "replies": [
                {
                  "id": "i7sgjba",
                  "text": "Bootstraps; is there anything they *can't* do?",
                  "timestamp": "2022-05-08 12:31:18",
                  "score": 134,
                  "num_children": 1,
                  "author": 262824,
                  "replies": [
                    {
                      "id": "i7szx9g",
                      "text": "Get conservatives to shut the fuck up",
                      "timestamp": "2022-05-08 15:15:36",
                      "score": 59,
                      "num_children": 1,
                      "author": 168338,
                      "replies": [
                        {
                          "id": "i7t68l0",
                          "text": "An object in motion will remain in motion; conservatives' mouths prove that.\n\nAn object at rest will remain at rest; conservatives' brains prove that.",
                          "timestamp": "2022-05-08 16:02:00",
                          "score": 27,
                          "num_children": 0,
                          "author": 184594,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i7sgn2b",
                  "text": "Yeah why don't they ALL build casinos? /s",
                  "timestamp": "2022-05-08 12:32:24",
                  "score": 47,
                  "num_children": 0,
                  "author": 4180,
                  "replies": []
                },
                {
                  "id": "i7tzvld",
                  "text": "Honestly they probably just googled \"*Indian Billionaire*\" or \"*Rich Indians*\"\n\nThen just ctrl+c ctrl+v without ever actually reading the article/list.",
                  "timestamp": "2022-05-08 19:37:36",
                  "score": 6,
                  "num_children": 0,
                  "author": 363699,
                  "replies": []
                }
              ]
            },
            {
              "id": "i7sz5fa",
              "text": "Whoa whoa. Don’t you know. If a handful of people are rich from a specific demographic or background, then everyone can be super wealthy from that demographic and background. Their problem is they are poor and lazy. \n\nThat’s why so many republicans keep voting to help those billionaires, because one day they will become one themselves!",
              "timestamp": "2022-05-08 15:09:48",
              "score": 20,
              "num_children": 0,
              "author": 389215,
              "replies": []
            },
            {
              "id": "i7t5i41",
              "text": "A lot of the casinos don't actually make much money for the reservations. Many of them were built using funds from predatory lenders that managed to screw them pretty hard.",
              "timestamp": "2022-05-08 15:56:36",
              "score": 11,
              "num_children": 0,
              "author": 409989,
              "replies": []
            },
            {
              "id": "i7sbans",
              "text": "> Like, I don’t think the article stating every single Native American was poor. I would assume the ones running casinos would be pretty well off.\n\nThat's the same as in white culture, black culture, asian culture, hispanic culture, etc. Yeah there's always guys the top getting rich on the backs of the people at the bottom.",
              "timestamp": "2022-05-08 11:31:36",
              "score": 55,
              "num_children": 0,
              "author": 213462,
              "replies": []
            },
            {
              "id": "i7t23p9",
              "text": "So, you’ve met my brother?",
              "timestamp": "2022-05-08 15:31:42",
              "score": 5,
              "num_children": 0,
              "author": 288038,
              "replies": []
            },
            {
              "id": "i7u1hyb",
              "text": "The heads of casinos are paid well, but the profits are all going back into the tribe to pay for community services. It's not like an individual business, pretty much all operations go through the tribe.\n\nThere are a few tribes that do in fact have billions and the members of the community receive a monthly check and all is well.\n\nThat accounts for a dozen (maybe) communities out of 574 (American tribes) which leaves MOST in poverty.\n\n\nSource: I literally work with tribes to help reduce poverty.",
              "timestamp": "2022-05-08 19:49:36",
              "score": 3,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i7tc82w",
              "text": "I live by some native owned casinos in CA, the tribes that own the them make ungodly amounts of money. I remember this native kid, couldn't have been over 23, came into the place I was a manager at. I befriended him slightly over the course of a year, he came in every day for smokes and drinks. Anyways he always paid his bill with cash and always had a fucking huge wad of $100s. In talking like over 5 grand in his front pocket at any time. I asked him one day why so much cash and not a card, he says he doesn't bother with banks, his tribe owned one of the casinos, he was set for life. He told me flat out he had no ambition and planned to just aimlessly wander through life finding things that interest him until he dies.\n\nAlso side story, one of the casinos had a dispute of tribal ownership and a contesting tribe stormed the casino and took it over by force. So the government got involved and somehow was able to shut down the casino until the tribes resolved the dispute. \n\n\nhttps://www.kmjnow.com/2019/03/11/another-takeover-attempt-as-rival-groups-dispute-chukchansi-tribal-leadership/",
              "timestamp": "2022-05-08 16:45:30",
              "score": 7,
              "num_children": 0,
              "author": 144542,
              "replies": []
            },
            {
              "id": "i7ugnx6",
              "text": "You joke but every time I try to address the racial economic disparities in the US my family says some shit like \"BuT oPrAh!\" or \"BuT fOoTbAlL!\"",
              "timestamp": "2022-05-08 21:40:41",
              "score": 1,
              "num_children": 0,
              "author": 89673,
              "replies": []
            },
            {
              "id": "i7swb10",
              "text": "You guys commit way too much brainpower to people who are clearly trolling",
              "timestamp": "2022-05-08 14:48:17",
              "score": -14,
              "num_children": 1,
              "author": 231330,
              "replies": [
                {
                  "id": "i7t070s",
                  "text": "Wasn't aware that an entire half of the American political system was just trolling! \n\nMust be playing the long con.",
                  "timestamp": "2022-05-08 15:17:36",
                  "score": 14,
                  "num_children": 2,
                  "author": 293037,
                  "replies": [
                    {
                      "id": "i7t15kz",
                      "text": "They aren't half - only like 30-40% but we give the same number of senators to failed red states with few people as we do the bigger blue states that support them.",
                      "timestamp": "2022-05-08 15:24:40",
                      "score": 0,
                      "num_children": 1,
                      "author": 21978,
                      "replies": [
                        {
                          "id": "i7top8z",
                          "text": "State welfare: absolutely, those liberal states owe us somehow\n\nPersonal welfare: absolutely fucking not I’m not paying for some welfare queen and her 12 kids…yes I am on food stamps what’s your point, I ain’t on welfare!",
                          "timestamp": "2022-05-08 18:15:40",
                          "score": 2,
                          "num_children": 0,
                          "author": 102802,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i7uctfs",
                      "text": "What does this have to do with American politics? This particular situation is clearly some guy trolling. God reddit has gotten so gullible lately.  Ridiculous.",
                      "timestamp": "2022-05-08 21:13:16",
                      "score": 0,
                      "num_children": 0,
                      "author": 231330,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i7sa4do",
          "text": "It's also the definition of cherry picking.",
          "timestamp": "2022-05-08 11:16:39",
          "score": 21,
          "num_children": 0,
          "author": 14838,
          "replies": []
        },
        {
          "id": "i7sunwr",
          "text": "We studied this in a class at university a short while back. Reservations are the most impoverished places in the US. Many don't even have basic things like running water. Some on borders are also used and abused by drug traffickers. It's such a depressing mess.",
          "timestamp": "2022-05-08 14:35:35",
          "score": 16,
          "num_children": 0,
          "author": 300873,
          "replies": []
        },
        {
          "id": "i7t19k0",
          "text": "If you're so poor, why is Elon musk rich? Checkmate",
          "timestamp": "2022-05-08 15:25:31",
          "score": 8,
          "num_children": 0,
          "author": 368373,
          "replies": []
        },
        {
          "id": "i7tagvx",
          "text": "in this case, if there were actually 10 native american billionaires, that would be a pretty interesting profile to look into. if they are from the US or canada, that would probably make them the most billionaires per capita of any ethnic group.",
          "timestamp": "2022-05-08 16:32:50",
          "score": 5,
          "num_children": 0,
          "author": 211613,
          "replies": []
        },
        {
          "id": "i7uakb8",
          "text": "\"There is no housing crisis. Look at all the mansions on Beverly Hills.\"",
          "timestamp": "2022-05-08 20:56:35",
          "score": 6,
          "num_children": 0,
          "author": 68017,
          "replies": []
        },
        {
          "id": "i7u15x1",
          "text": "Well, it's a fallacy of composition.  \"Because there are 10 ___ billionaires, ___ poverty doesn't exist\" is basically the argument.",
          "timestamp": "2022-05-08 19:47:07",
          "score": 3,
          "num_children": 0,
          "author": 35328,
          "replies": []
        },
        {
          "id": "i7talmt",
          "text": "Now I'm not denying what you said, but I do want to add that there are some benefits that Indian Reservations have. Most notably would be their ability to create places to gamble and mostly get past certain laws. Obviously this requires a lot of money to start up, but this is a huge plus for them.\n\n[Here's the article I found on it, please do correct me or the article if it's wrong.](https://www.mentalfloss.com/article/25137/10-things-you-need-know-about-indian-reservation-gambling)\n\nI argued something like this in the past, but was a lot more harsh saying, \"They lost a war and were forced to move, that was the times.\" However, giving it more consideration, there isn't an excuse for things to be like that now considering the American ideals. \n\nOut of my pure curiosity, what would some people recommend be done to help Indian Reservations or the people within them? I'm a huge gas guy, don't like high prices and closing out gas lines did cause an increase, so I didn't like the idea of it not being allowed to go through a reservation. But now I feel like I was being too harsh and not thinking for them but rather for myself.",
          "timestamp": "2022-05-08 16:33:45",
          "score": -7,
          "num_children": 1,
          "author": 72822,
          "replies": [
            {
              "id": "i7ttw2x",
              "text": "They didn't lose a war. There was never a war. Western civilization has always had \"rules\" about war and what they did to the Native Americans does not qualify under their own rules. Their goal was never to subjugate the Natives, too make them a vasal state or something, it was to eliminate them. It was pest control. Their land was stolen and they were slaughtered, those that lived where forced to renounce their religion, language, and names. It was genocide. Calling it a war is a revisionist take that makes people feel batter because they can imagine their ancestors were justified in their actions and that the Natives somehow posed any real threat too the colonists. Natives were never able too fight back in any meaningful way because westerners had weapons that far out stripped theirs. It was a long, protracted, one-sided slaughter. Try reading some history written by Native Americans/First Nations people. It is very eye opening. If you would you would see that any benefits that the US government choose too grant too Natives is a pittance in comparison too what was taken away from them. And my suggestion for improvement would be too ask THEM what they would have done. Or to do any of the things they have already ask for.",
              "timestamp": "2022-05-08 18:53:52",
              "score": 9,
              "num_children": 0,
              "author": 381111,
              "replies": []
            }
          ]
        },
        {
          "id": "i7s1idy",
          "text": "[deleted]",
          "timestamp": "2022-05-08 09:11:53",
          "score": -91,
          "num_children": 3,
          "replies": [
            {
              "id": "i7s42f9",
              "text": "Read the above comment again",
              "timestamp": "2022-05-08 09:50:38",
              "score": 42,
              "num_children": 0,
              "author": 294899,
              "replies": []
            },
            {
              "id": "i7shc6h",
              "text": "We know",
              "timestamp": "2022-05-08 12:39:43",
              "score": 7,
              "num_children": 0,
              "author": 298448,
              "replies": []
            },
            {
              "id": "i7sgs0x",
              "text": "You know which sub you're on, right?",
              "timestamp": "2022-05-08 12:33:51",
              "score": 3,
              "num_children": 1,
              "author": 204235,
              "replies": [
                {
                  "id": "i7sukhs",
                  "text": "Well.. I misread what he said",
                  "timestamp": "2022-05-08 14:34:51",
                  "score": 0,
                  "num_children": 0,
                  "author": 64111,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i7t4aca",
          "text": "Would you support creating a special tax for Democrats to reimburse them or the seizing of land owned by democrats to give to them?\n\nI mean for reparations of course, in an attempt to shift some of what was lost back.",
          "timestamp": "2022-05-08 15:47:44",
          "score": -10,
          "num_children": 1,
          "author": 138129,
          "replies": [
            {
              "id": "i7u58yt",
              "text": "Why do you specify democrats?",
              "timestamp": "2022-05-08 20:17:27",
              "score": 2,
              "num_children": 1,
              "author": 337254,
              "replies": [
                {
                  "id": "i7uo0iy",
                  "text": "When something happens you specify the group responsible for it when suggesting possible punishments for the actions.",
                  "timestamp": "2022-05-08 22:36:30",
                  "score": 1,
                  "num_children": 1,
                  "author": 138129,
                  "replies": [
                    {
                      "id": "i7uo7c0",
                      "text": "Yeah that would be the united states. Pretty sure native Americans were not harmed exclusively by democrats.",
                      "timestamp": "2022-05-08 22:38:01",
                      "score": 2,
                      "num_children": 1,
                      "author": 337254,
                      "replies": [
                        {
                          "id": "i7up9xy",
                          "text": "No, it would be exclusively the political party who did it and used the law to enforce it.\n\nAnd yes, the Native Americans were also victims exclusively of the Democrats, so were my people the Japanese.\n\nBasically every single incident has been one political group and it's all orders since the founding of the Union.",
                          "timestamp": "2022-05-08 22:46:32",
                          "score": 1,
                          "num_children": 1,
                          "author": 138129,
                          "replies": [
                            {
                              "id": "i7uqh2w",
                              "text": "Every single bad thing ever was the democrats?\n\nEdit: Also were the democrats at fault for wounded knee? There was a republican president then.\n\nNot to mention the party switch.",
                              "timestamp": "2022-05-08 22:56:22",
                              "score": 2,
                              "num_children": 1,
                              "author": 337254,
                              "replies": [
                                {
                                  "id": "i7ur1l2",
                                  "text": "Only the racial atrocities pertaining to the United States.\n\nI assume you're not American, if you look up there history on Wiki you will see what I'm talking about.",
                                  "timestamp": "2022-05-08 23:01:04",
                                  "score": 1,
                                  "num_children": 2,
                                  "author": 138129,
                                  "replies": [
                                    {
                                      "id": "i7uyl72",
                                      "text": "I am American lol\n\nDo you think wounded knee was not a racial atrocity?\n\nEdit: do you mean Wikipedia articles like this one: https://en.m.wikipedia.org/wiki/Southern_strategy  \nWhich is about the party switch and how Republicans thought they could get more votes by appealing to racists?",
                                      "timestamp": "2022-05-09 00:03:25",
                                      "score": 3,
                                      "num_children": 1,
                                      "author": 337254,
                                      "replies": [
                                        {
                                          "id": "i7v12xe",
                                          "text": "There was no party switch, it is funny that you're gullible enough to believe it though.",
                                          "timestamp": "2022-05-09 00:24:03",
                                          "score": 1,
                                          "num_children": 2,
                                          "author": 138129,
                                          "replies": [
                                            {
                                              "id": "i7v2bag",
                                              "text": "Why does the kkk support the republicans now then?\n\nWhy did you tell me to check Wikipedia and then tell me that it was false?",
                                              "timestamp": "2022-05-09 00:34:17",
                                              "score": 3,
                                              "num_children": 1,
                                              "author": 337254,
                                              "replies": [
                                                {
                                                  "id": "i7v3wtx",
                                                  "text": ">Why did you tell me to check Wikipedia and then tell me that it was false?\n\nI was talking about the history of the events, I figured because of your lack of understanding on the subject you did not know anything about them.\n\nI had forgot that trolls had posted that party flip conspiracy crap on there.",
                                                  "timestamp": "2022-05-09 00:47:32",
                                                  "score": 1,
                                                  "num_children": 2,
                                                  "author": 138129,
                                                  "replies": [
                                                    {
                                                      "id": "i7vaokb",
                                                      "text": "If the party flip didn't happen why does the kkk support republicans now?",
                                                      "timestamp": "2022-05-09 01:43:37",
                                                      "score": 2,
                                                      "num_children": 2,
                                                      "author": 337254,
                                                      "replies": [
                                                        {
                                                          "id": "i7vapgh",
                                                          "text": "„¿ʍou suɐɔılqndǝɹ ʇɹoddns ʞʞʞ ǝɥʇ sǝop ʎɥʍ uǝddɐɥ ʇ,upıp dılɟ ʎʇɹɐd ǝɥʇ ɟI„",
                                                          "timestamp": "2022-05-09 01:43:50",
                                                          "score": 1,
                                                          "num_children": 0,
                                                          "author": 22140,
                                                          "replies": []
                                                        },
                                                        {
                                                          "id": "i7vbvfd",
                                                          "text": "They do not, a small number of people have publicly attempted to discredit the Republicans through their \"endorsements\".\n\nThe KKK is a Democrat activist group with a interest in discrediting the people who stand against their political party, they're using probably the most simplistic version of a false flag mankind has ever seen.",
                                                          "timestamp": "2022-05-09 01:53:19",
                                                          "score": 1,
                                                          "num_children": 3,
                                                          "author": 138129,
                                                          "replies": [
                                                            {
                                                              "id": "i7vcxpw",
                                                              "text": "Why is it republicans that always have confederate flags on everything?",
                                                              "timestamp": "2022-05-09 02:02:03",
                                                              "score": 2,
                                                              "num_children": 1,
                                                              "author": 337254,
                                                              "replies": [
                                                                {
                                                                  "id": "i7vm8u5",
                                                                  "text": "I've never seen a republican have a Confederate flag, are you sure you're not confusing it with the Virginia Battle Flag?\n\n\n- Confederate flag\n\nhttps://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Flag_of_the_Confederate_States_of_America_%281865%29.svg/1280px-Flag_of_the_Confederate_States_of_America_%281865%29.svg.png\n\n\n- Virginia Battle Flag\n\nhttps://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/North_Virginia_Third_Bunting.svg/1280px-North_Virginia_Third_Bunting.svg.png\n\n\nBasically the only people to ever fly the Confederate flag were the Democrats during the Civil War.\n\n\nNow there was the original Confederate flag, but it was often confused with the Union flag in battle and changed.\n\n- Original Confederate flag\n\nhttps://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Flag_of_the_Confederate_States_of_America_%281861–1863%29.svg/1280px-Flag_of_the_Confederate_States_of_America_%281861–1863%29.svg.png\n\n\nAnd then there was the very first flag that was used for a very short time as the Rebellion begin.\n\nhttps://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Bonnie_Blue_flag.svg/1280px-Bonnie_Blue_flag.svg.png",
                                                                  "timestamp": "2022-05-09 03:23:23",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "author": 138129,
                                                                  "replies": [
                                                                    {
                                                                      "id": "i8gn0a5",
                                                                      "text": "Semantic bullshit\n\n\nThe flag that  means white supremacy is the one that is flown  by Republicans. You know this.\n\nDonald Trump is a white supremacist. Trumpism the dominant movement in the present day Republican party is a white supremacist movement.  You also know this even if  you claim otherwise.\n\nIf your claims were true. Republicans would be First in line tearing down confederate statues.\n\nAfter all it is certainly true that thie confederates voted for the nineteenth century version of the democratic party. \n\nSo obviously Republicans want to tear down the statues honoring white supremacist traitors who were all democrats right? \n\nRight?\n\n\nRiiiight?",
                                                                      "timestamp": "2022-05-13 15:24:19",
                                                                      "score": 2,
                                                                      "num_children": 1,
                                                                      "author": 159457,
                                                                      "replies": [
                                                                        {
                                                                          "id": "i8gs0u7",
                                                                          "text": ">The flag that means white supremacy is the one that is flown by Republicans. You know this.\n\n\nThe flag that means white supremacy is the Nazi flag, even if you tried to have an American flare on it and go for slightly less white supremacy with the Confederate States that is still not the flag that the rednecks fly.\n\nThe flag that the Rednecks fly is the Virginia Battle Flag and it is a symbol of rebellion against overreach by a federal government, you should really learn about things before you start talking about them.\n\n\n>Donald Trump is a white supremacist. Trumpism the dominant movement in the present day Republican party is a white supremacist movement. You also know this even if you claim otherwise.\n\nWhile Trump was a Democrat up until the year he ran as a Republican it does not make him a white supremacist, truthfully most Democrats are not white supremacist and this has been the case since the founding of their party, simply a good portion of them are.\n\nTrumpism as the progressives have coined it is nationalism and it is no more racist then the other nationalist movements around the world, nationalism is just a form of extreme tribalism where people focus on the benefit of their community before the benefit of others.\n\nOnce again you should actually learn about things before you start critiquing them.\n\n\n>If your claims were true. Republicans would be First in line tearing down confederate statues.\n\nYou do not change history by attempting to conceal or erase it, despite the best attempts by the Democrats to hide the crimes they've committed.\n\nYou should also keep in mind that alongside those Democrats statues they were tearing down they also tore down a few Republicans statues, in particular the statue of Frederick Douglass which the Democrats decapitated before they threw it in the river.\n\nYou've been lied to and you should spend a lot of time studying and less time listening to propaganda.\n\n\n>After all it is certainly true that thie confederates voted for the nineteenth century version of the democratic party. \n\nMore of the Democrats learned the art of propaganda and begin spreading it through the civil rights movement in an attempt to displace their own history with simplistic lies that they continuously repeat.\n\nIn particular is the lie that one day they just all woke up and traded places with the Republicans, even though you could clearly watch their continued actions after that and see that there was no change and even to this day they continue to obsess over race.\n\nThey've got some people so propagandize that they don't even see that their campaign to give everybody their own racially safe space is a reamp of their Jim Crow laws and their segregation ideology.\n\n\n>So obviously Republicans want to tear down the statues honoring white supremacist traitors who were all democrats right? \n\nAs I said, trying to erase history by destroying the statues of the Democratic party is not a priority to the Republicans, why do you think liberals support the Republican Party over the Democrats, they are sane enough to know that the Democrats will take down their own statues when they grow up and stop being so racist.",
                                                                          "timestamp": "2022-05-13 15:57:37",
                                                                          "score": 1,
                                                                          "num_children": 0,
                                                                          "author": 138129,
                                                                          "replies": []
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            },
                                                            {
                                                              "id": "i8gm6ut",
                                                              "text": "Why do Republican politicians oppose tearing down the statues of confederate Democrat white supremacist traitors?",
                                                              "timestamp": "2022-05-13 15:18:50",
                                                              "score": 2,
                                                              "num_children": 1,
                                                              "author": 159457,
                                                              "replies": [
                                                                {
                                                                  "id": "i8gsc40",
                                                                  "text": "Do you think tearing down the statues of a bunch of racist Democrats is going to cause  the Democrats to stop being racist?\n\nHate only begets hate, even if the target is someone deserving like a Democrat.",
                                                                  "timestamp": "2022-05-13 15:59:42",
                                                                  "score": 1,
                                                                  "num_children": 0,
                                                                  "author": 138129,
                                                                  "replies": []
                                                                }
                                                              ]
                                                            },
                                                            {
                                                              "id": "i8omgz6",
                                                              "text": "That's the most tin foil hatted shit i ever read",
                                                              "timestamp": "2022-05-15 11:16:02",
                                                              "score": 2,
                                                              "num_children": 1,
                                                              "author": 313810,
                                                              "replies": [
                                                                {
                                                                  "id": "i8qub9b",
                                                                  "text": "Provide a source to discredit it then, show me some indication that the KKK was not founded by democrats, aren't white supremacist and are 100% honest all the time.\n\n\nRemember that your argument is that a terrorist group founded by one political party in the name of white supremacy suddenly decided to endorse their political opponents the abolitionists party, that's some Elite mental gymnastics there.",
                                                                  "timestamp": "2022-05-15 21:47:32",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "author": 138129,
                                                                  "replies": [
                                                                    {
                                                                      "id": "i8r2sy1",
                                                                      "text": "The burden of proof is on you to prove that the KKK founded by the progressive party\n\nYou're trying to tell me what my argument is without understanding it at all",
                                                                      "timestamp": "2022-05-15 22:52:29",
                                                                      "score": 2,
                                                                      "num_children": 0,
                                                                      "author": 313810,
                                                                      "replies": []
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    },
                                                    {
                                                      "id": "i8glz9e",
                                                      "text": "Conspiracy theories ate not by definition accepted as true by literally every historian. As  you know the southern  strategy is hardly a Conspiracy.\n\nClaiming the southern strategy 8s a conspiracy is like claiming evolution is a conspiracy.  It's abject denial  of the truth.",
                                                      "timestamp": "2022-05-13 15:17:26",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 159457,
                                                      "replies": [
                                                        {
                                                          "id": "i8gstyd",
                                                          "text": "No, claiming the party switch propaganda is a conspiracy now is the same as climbing the Flat Earth theory is bullshit.\n\nYou've been politically propagandize to the point that you can't even conceive that two political organizations would not trade places overnight and then continue acting the same way in the morning.\n\nYou may have had a argument if the Democrats had stopped being racist and stop trying to make segregation laws afterwards, but even now in 2022 they're trying to create segregation laws, they haven't changed one bit other than the words they use in their propaganda.",
                                                          "timestamp": "2022-05-13 16:02:57",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 138129,
                                                          "replies": [
                                                            {
                                                              "id": "i8h2kwh",
                                                              "text": "You are quite literally the type of moron the the loves.  You lap up their propaganda and shit it out of your mouth verbatim.\n\nYou should probably just stop.  Everything you say just shows your ignorance.",
                                                              "timestamp": "2022-05-13 17:06:56",
                                                              "score": 1,
                                                              "num_children": 0,
                                                              "author": 278044,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "i8glt5g",
                                              "text": "OK well I guess that settles it then. All the historians of American politics  are wrong and you and dines d Souza  are the only ones that know the truth.",
                                              "timestamp": "2022-05-13 15:16:16",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 159457,
                                              "replies": [
                                                {
                                                  "id": "i8gszui",
                                                  "text": "Only the Democrats history says this, there is no American history that claims of a party switch.\n\nAt this point you're just following me around trying to spread Democrat propaganda, you should seek some help.",
                                                  "timestamp": "2022-05-13 16:04:02",
                                                  "score": 0,
                                                  "num_children": 0,
                                                  "author": 138129,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "i8glmcf",
                                      "text": "So you just completely overlook the fact that democrats  used to be the conservative party and are now the liberal party? \n\n\nBecause American conservatives have historically been the racist ones and they now all vote republican.\n\n\nAll those confederate traitors voted democrat in the nineteenth century. Weird how it is now democrats tearing down their statues and Republicans  fighting to keep them up.\n\nBut you knew all this already. You're just being a dishonest goon copy pasting the argument that dinesh  d Souza  a convicted felon thinks is the ultimate gotcha.",
                                      "timestamp": "2022-05-13 15:15:00",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 159457,
                                      "replies": [
                                        {
                                          "id": "i8gt9nt",
                                          "text": "You have a very poor understanding of History, you should attempt to start learning actual history instead of just partaking in the propaganda from a political party of white supremacist.",
                                          "timestamp": "2022-05-13 16:05:48",
                                          "score": 0,
                                          "num_children": 0,
                                          "author": 138129,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i7s3ii8",
      "text": "I know this might blow some people’s minds, but despite the wrongness of this, Indian billionaires existing also doesn’t mean there’s not a problem with severe poverty in India as well.\n\nAlmost as if income inequality and the vast gap between rich and poor actually contributes to poverty in some way...",
      "timestamp": "2022-05-08 09:42:19",
      "score": 403,
      "num_children": 7,
      "author": 193399,
      "replies": [
        {
          "id": "i7s68gj",
          "text": "\"A lot of people were poor in ancient Egypt\"\n\"EXPLAIN THESE 10 RICH RULERS, THEN!\"",
          "timestamp": "2022-05-08 10:22:27",
          "score": 156,
          "num_children": 1,
          "author": 83315,
          "replies": [
            {
              "id": "i7ssw6y",
              "text": "Poors in america?? i think the fuk not, explain Bill gates and Elon musk /s",
              "timestamp": "2022-05-08 14:21:45",
              "score": 36,
              "num_children": 1,
              "author": 367284,
              "replies": [
                {
                  "id": "i7t3h85",
                  "text": "You should invest all your money in scratcher, since some dude won 10 million dollars once.",
                  "timestamp": "2022-05-08 15:41:48",
                  "score": 10,
                  "num_children": 0,
                  "author": 83315,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i7s63br",
          "text": "[deleted]",
          "timestamp": "2022-05-08 10:20:26",
          "score": 29,
          "num_children": 4,
          "replies": [
            {
              "id": "i7sdtz5",
              "text": "it's complicated, since their is some sort of economy improvement, but the past few years have been generally bad for India. The country is run by morons, that's doing an excellent job of brainwashing the poor people into becoming fascist racists, and has basically made sure it can't even be overthrown, partly because of how incompetent the other parties are, and how much brainwashing is going on.",
              "timestamp": "2022-05-08 12:01:50",
              "score": 23,
              "num_children": 1,
              "author": 206320,
              "replies": [
                {
                  "id": "i7tgjos",
                  "text": "Stuff like this happens all over the planet right now. I sometimes wish there was an evil cabal making all kinds of sinister decisions, but the sad truth is most people in power are just fucking idiots who barely can tell left from right. They have been elevated into positions they should not be holding and make decisions about things they neither fully understand, nor really care about.\n\nPolitics these days is an absolute clusterfuck, with the wrong people making all the important decisions - and we got there because generation after generation, people didn't give a fuck about politics. \n\nWith representative democracies (and similar systems), societies basically handed over all their power to a select few, blindly trusting them to be upstanding and honest, when in fact they are the most corrupt deceivers on the planet.\n\nAnd what do we do? Continuos support without even questioning any of it.",
                  "timestamp": "2022-05-08 17:16:32",
                  "score": 3,
                  "num_children": 1,
                  "author": 97755,
                  "replies": [
                    {
                      "id": "i7wcews",
                      "text": "they'll get what's coming to them tho. No hope no dope",
                      "timestamp": "2022-05-09 08:50:13",
                      "score": 1,
                      "num_children": 0,
                      "author": 206320,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i7sh0w9",
              "text": "Here's some hard data which suggests otherwise:\nhttps://www.thehindu.com/news/national/global-hunger-index-ranks-india-at-101-out-of-116-countries/article36998777.ece",
              "timestamp": "2022-05-08 12:36:27",
              "score": 7,
              "num_children": 0,
              "author": 204235,
              "replies": []
            },
            {
              "id": "i7sjzdd",
              "text": "10 awesome startups, also there are lakhs of people in poverty, one thing is right doesnt mean that other thing is wrong.",
              "timestamp": "2022-05-08 13:05:40",
              "score": 5,
              "num_children": 0,
              "author": 263221,
              "replies": []
            },
            {
              "id": "i7tyo93",
              "text": "Since economic liberalization in the 1990s, life has steadily improved for each and every Indian across the board (though not as fast as we would have liked).",
              "timestamp": "2022-05-08 19:28:40",
              "score": 3,
              "num_children": 1,
              "replies": [
                {
                  "id": "i7ucwsq",
                  "text": "And not as much for some as for others.",
                  "timestamp": "2022-05-08 21:13:57",
                  "score": 2,
                  "num_children": 0,
                  "author": 130920,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i7t4mhs",
          "text": "You know, I should start flipping this. Whenever white people claim that white privilege doesn’t exist because they personally had a hard time, I’m gonna send them a list of white billionaires to prove to them that no white people are poor and see how they bend over backward to explain that away lmao",
          "timestamp": "2022-05-08 15:50:12",
          "score": 4,
          "num_children": 1,
          "author": 397854,
          "replies": [
            {
              "id": "i7tt97v",
              "text": "Those poor people all have the opportunity to be rich, if only they work hard enough. As if a society should be competitive rather than cooperative, because the latter is communism and that’s bad.\n\nAnd of course, it’s all absolutes. Communism is bad, therefore capitalism is good and there’s absolutely no reasonable middle ground.",
              "timestamp": "2022-05-08 18:49:08",
              "score": 2,
              "num_children": 0,
              "author": 193399,
              "replies": []
            }
          ]
        },
        {
          "id": "i7sa21d",
          "text": "And also contributes to to the existence of billionaires",
          "timestamp": "2022-05-08 11:15:48",
          "score": 6,
          "num_children": 0,
          "author": 388443,
          "replies": []
        },
        {
          "id": "i7uofyc",
          "text": "> Indian billionaires existing also doesn’t mean there’s not a problem with severe poverty in India as well.\n\nI don't think billionaires can exist at all without extreme poverty. That's pretty much what billionaires are. They extract wealth from the community and concentrate it in themselves.",
          "timestamp": "2022-05-08 22:39:57",
          "score": 2,
          "num_children": 0,
          "author": 8167,
          "replies": []
        },
        {
          "id": "i7tb9tz",
          "text": "To think otherwise is to claim that the existence of Bill Gates disproves the existence of poverty in America.",
          "timestamp": "2022-05-08 16:38:38",
          "score": 1,
          "num_children": 1,
          "author": 133667,
          "replies": [
            {
              "id": "i7tszyg",
              "text": "America has always been sold the lie that everyone can be rich if they just work hard enough. So instead of people being outraged that there are billionaires, they are taught to find it aspirational and to imagine themselves in that position.\n\nNot just that anybody could be a billionaire, but that EVERYONE could be. As if that makes any sense. Instead of everyone being comfortable, YOU could be obscenely wealthy and isn’t that the better alternative? And if you don’t make it, it’s because you didn’t want it bad enough.\n\nIt’s turning life into a fucking casino slot machine. That’s why American politics is so keen to make socialism a dirty word and to make it synonymous with communism.",
              "timestamp": "2022-05-08 18:47:16",
              "score": 1,
              "num_children": 0,
              "author": 193399,
              "replies": []
            }
          ]
        },
        {
          "id": "i7sgcsn",
          "text": "I mean it's an obviously invalid response, combined with the fact that it described the wrong Indians leads me to believe the response was intentional satire.",
          "timestamp": "2022-05-08 12:29:23",
          "score": -12,
          "num_children": 1,
          "author": 355344,
          "replies": [
            {
              "id": "i7sgmlb",
              "text": "Oh, you sweet summer child.",
              "timestamp": "2022-05-08 12:32:16",
              "score": 14,
              "num_children": 1,
              "author": 262824,
              "replies": [
                {
                  "id": "i7shagw",
                  "text": "Right back at you if you think every inflammatorily stupid thing said online is done in earnest.",
                  "timestamp": "2022-05-08 12:39:13",
                  "score": -11,
                  "num_children": 1,
                  "author": 355344,
                  "replies": [
                    {
                      "id": "i7shkh2",
                      "text": "Plenty of people actually believe that North American \"Indians\" come from India because of the inaccurate label of \"Indians\" from the past. I think you really underestimate how stupid some people are. Just look at those people who waited on a bridge for days for JFK to come back to life.",
                      "timestamp": "2022-05-08 12:41:59",
                      "score": 11,
                      "num_children": 0,
                      "author": 262824,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i7sa7or",
      "text": "The one I will always remember was a review for an oven thermometer, the kind you put in the oven. The review was two or three stars and said it \"worked well but it does get a bit hot\".",
      "timestamp": "2022-05-08 11:17:50",
      "score": 80,
      "num_children": 3,
      "author": 14838,
      "replies": [
        {
          "id": "i7slp7g",
          "text": "I once got told \"reading is for nerds\" when pointing out that he'd completely missed the point of what he had (supposedly read and) answered to.\n\nOn a creative writing subreddit. He hadn't read the prompt...\n\nThis exchange still keeps me up at night.",
          "timestamp": "2022-05-08 13:21:12",
          "score": 46,
          "num_children": 1,
          "author": 261319,
          "replies": [
            {
              "id": "i7t4plr",
              "text": "Reading is for nerds, not like writing. Writing is for alphas.",
              "timestamp": "2022-05-08 15:50:50",
              "score": 9,
              "num_children": 1,
              "author": 218574,
              "replies": [
                {
                  "id": "i7t5829",
                  "text": "He did indeed show about as much intelligence as a silverback gorilla.",
                  "timestamp": "2022-05-08 15:54:33",
                  "score": 4,
                  "num_children": 0,
                  "author": 261319,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i7t668a",
          "text": "A girl i was sleeping with for a while once asked \"Do they have the same sun in China as we do here in Sweden?\"\n\nShe had follow up questions as if she had thought about this a lot.",
          "timestamp": "2022-05-08 16:01:30",
          "score": 14,
          "num_children": 0,
          "author": 299980,
          "replies": []
        },
        {
          "id": "i7slz84",
          "text": "I don't get it",
          "timestamp": "2022-05-08 13:23:42",
          "score": 2,
          "num_children": 1,
          "author": 101818,
          "replies": [
            {
              "id": "i7swdf6",
              "text": "The point is they seemed to expect the thermometer to stay cool while being in an oven. They marked it down for getting hot.",
              "timestamp": "2022-05-08 14:48:48",
              "score": 13,
              "num_children": 0,
              "author": 14838,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i7saj2v",
      "text": "I had a great one. Was talking about how I was born in Ireland to some people in my school in America. Some people were intrigued and wanted to ask questions. One of them asked if we had electricity in Ireland.",
      "timestamp": "2022-05-08 11:21:55",
      "score": 68,
      "num_children": 2,
      "author": 127319,
      "replies": [
        {
          "id": "i7sk0k7",
          "text": "Do you?",
          "timestamp": "2022-05-08 13:05:58",
          "score": 26,
          "num_children": 1,
          "author": 263221,
          "replies": [
            {
              "id": "i7sw1z7",
              "text": "Honestly I don't know. What even is E L E C T R I C I T Y. I'm scared by the concept. Lightning in my walls? Why would I want that. Sounds like something the devil would give you.",
              "timestamp": "2022-05-08 14:46:20",
              "score": 32,
              "num_children": 2,
              "author": 127319,
              "replies": [
                {
                  "id": "i7t03c2",
                  "text": "Put your finger in one of the twin wholes on your walls. regardsless of the outcome i can know your electricity status.\n\n>!please dont do that its a joke!<",
                  "timestamp": "2022-05-08 15:16:50",
                  "score": 0,
                  "num_children": 0,
                  "author": 263221,
                  "replies": []
                },
                {
                  "id": "i7t4uqv",
                  "text": "Electricity is like potatoes, but loud.",
                  "timestamp": "2022-05-08 15:51:53",
                  "score": 0,
                  "num_children": 1,
                  "author": 218574,
                  "replies": [
                    {
                      "id": "i7tcbru",
                      "text": "Mashed or Baked ?",
                      "timestamp": "2022-05-08 16:46:16",
                      "score": 1,
                      "num_children": 0,
                      "author": 263221,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i7sjlxc",
          "text": "i made a comment about the ethics of a headline or r/politics because the article quoted one anonymous source instead of three (the standard for most journalists and for the SPJ). a redditor told me I was wrong and then when I insisted they actually read the article, they told me *the writer of the article was wrong* because they meant to say “multiple sources” instead of “a source”. then they called me a trump supporter (I’m a Canadian who votes for a party further left than our Liberal party). \n\n\nyou’d think one or two other people would’ve jumped in, but doing that might’ve meant that maybe trump didn’t say something stupid *this one time* so I was buried and the other person was upvoted.",
          "timestamp": "2022-05-08 13:02:11",
          "score": 15,
          "num_children": 0,
          "author": 44413,
          "replies": []
        }
      ]
    },
    {
      "id": "i7sl8d0",
      "text": "My barber said to me, unironically, \"You can't learn history from books\".\n\nWHERE TF AM I SUPPOSED TO LEARN HISTORY FROM THEN, THE MAN FROM EARTH?",
      "timestamp": "2022-05-08 13:16:59",
      "score": 55,
      "num_children": 3,
      "author": 393681,
      "replies": [
        {
          "id": "i7twwsd",
          "text": "The barber is right. You’re supposed to time travel and find out yourself what happened",
          "timestamp": "2022-05-08 19:15:53",
          "score": 4,
          "num_children": 0,
          "author": 338025,
          "replies": []
        },
        {
          "id": "i7swttd",
          "text": "I think the phrase was supposed to be “you can’t learn history from just textbooks” and the dumbass extrapolated that to any history from any books.",
          "timestamp": "2022-05-08 14:52:16",
          "score": 8,
          "num_children": 1,
          "author": 268523,
          "replies": [
            {
              "id": "i7tfpk8",
              "text": "I don't think he knows what a textbook is",
              "timestamp": "2022-05-08 17:10:32",
              "score": 1,
              "num_children": 0,
              "author": 393681,
              "replies": []
            }
          ]
        },
        {
          "id": "i7tk3or",
          "text": "Let me tell you this: what is written is not what truly happened.\n\nTo learn what has occured in the past, you must travel into the deep. There you will find the ancient ruins of what is the last remains of the archives. You have to ring the bell three times; when the glowing sphere rises, when it is burning the strongest, and when it falls into the pit of darkness at then end of the cycle.\n\nA bird will let you know each time, screeching through the empty, long forgotten chambers; for it is tied to the sphere through a spell immemorial. Its eyes will glow, one being a wheel of fire, the other an empty void that will haunt you forever, and the third an icy crystal filled with lightning. Do not look at the eyes. Do not count the eyes. Simply *listen*.\n\nAs you ring the bell for the third time, the gates will open and you shall enter into the halls of knowledge, where all history, the true history of everything has been depicted. You shall drink from the cup that has been prepared by the archivist, as it gives you the ability to see what lies beyond the walls. \n\nThere are no books, because you can't learn history from books. But there will be moving images, shadows scurrying across the painted walls, telling the story of what once was. You shall not take notes, because it is forbidden. You have to watch and remember. All of it. \n\nAs you walk through the endless corridors, you will learn more about the true fate of our ancestors and their ancestors and the ancestors who came before them. It will occupy your mind, but you shall not retreat now because you are after the sacred truth that reveals what was, long before anything was what it was. \n\nYou will encounter truths that will break your mind. You will falter, but you will prevail. And you will *remember*. Because what is history of everything has not been recorded, *can not* be recorded; it would burn the pages it is written on in an instant and dissolve the mind of the reader. It is not how we teach, hence you have to see what was in order to understand, in order to comprehend.\n\nRemember, as you try to keep your sanity and delve deeper into the archives of what once was: the truth will consume you, but it will also free you. From what is known to be what is.\n\nThe barber knew too well, hence became a barber after the reemergence.\n\nIt is up to you now; but you can't learn history from books.",
          "timestamp": "2022-05-08 17:41:56",
          "score": 1,
          "num_children": 0,
          "author": 97755,
          "replies": []
        }
      ]
    },
    {
      "id": "i7sryt2",
      "text": "My wife was telling me (over the phone) about a flock of turkeys that had invaded the yard.  One especially tall bird was staring at her through the living room window.  When I hung up the phone, an eves dropping red neck in the next cube leaned over the partition and asked me if my wife had called the police.  “On a flock of turkeys?” I asked incredulously.  “Oh, my bad,” he said.  “I thought you said Darkies!”  Needless to say, I was struck speechless!",
      "timestamp": "2022-05-08 14:14:14",
      "score": 48,
      "num_children": 0,
      "author": 268442,
      "replies": []
    },
    {
      "id": "i7satsg",
      "text": "Even if there were 100 native American billionaires, it world be stupid.",
      "timestamp": "2022-05-08 11:25:43",
      "score": 40,
      "num_children": 0,
      "author": 370044,
      "replies": []
    },
    {
      "id": "i7sk80n",
      "text": "If humans are so poor, how did Elon Musk launch a car into space?",
      "timestamp": "2022-05-08 13:07:49",
      "score": 36,
      "num_children": 0,
      "author": 206956,
      "replies": []
    },
    {
      "id": "i7sv0bt",
      "text": "Also “there are rich people so poverty doesn’t exist” is an incredibly dumb take.",
      "timestamp": "2022-05-08 14:38:17",
      "score": 26,
      "num_children": 0,
      "author": 38444,
      "replies": []
    },
    {
      "id": "i7sasse",
      "text": "was in hawaii and playing on the beach and another group of people next to us were playin in the ocean along side us, so one of their group i assumed the father, asked if this was the pacific or atlantic ocean",
      "timestamp": "2022-05-08 11:25:22",
      "score": 24,
      "num_children": 4,
      "author": 403271,
      "replies": [
        {
          "id": "i7sglz9",
          "text": "Well, don't leave us in suspense, which one was it?",
          "timestamp": "2022-05-08 12:32:05",
          "score": 10,
          "num_children": 1,
          "author": 399160,
          "replies": [
            {
              "id": "i7sk31v",
              "text": "It is Bay of Bengal",
              "timestamp": "2022-05-08 13:06:35",
              "score": 11,
              "num_children": 1,
              "author": 263221,
              "replies": [
                {
                  "id": "i7tv6ys",
                  "text": "and this, this right here is why i love reddit",
                  "timestamp": "2022-05-08 19:03:28",
                  "score": 4,
                  "num_children": 0,
                  "author": 403271,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i7sxr20",
          "text": "Look, all I'm saying is that he did ask a question though... so they were confidently unsure perhaps?",
          "timestamp": "2022-05-08 14:59:17",
          "score": 6,
          "num_children": 0,
          "author": 41409,
          "replies": []
        },
        {
          "id": "i7xc8fo",
          "text": "Technically they do touch each other, so it's possible that Atlantic water has made it into the Pacific.",
          "timestamp": "2022-05-09 14:51:50",
          "score": 2,
          "num_children": 1,
          "author": 311287,
          "replies": [
            {
              "id": "i7yjoo6",
              "text": "well now i feel dumb, touche",
              "timestamp": "2022-05-09 19:44:05",
              "score": 1,
              "num_children": 0,
              "author": 403271,
              "replies": []
            }
          ]
        },
        {
          "id": "i7sbie0",
          "text": "Wow",
          "timestamp": "2022-05-08 11:34:13",
          "score": 1,
          "num_children": 0,
          "author": 16639,
          "replies": []
        }
      ]
    },
    {
      "id": "i7s3o1q",
      "text": "The just new world fallacy",
      "timestamp": "2022-05-08 09:44:41",
      "score": 15,
      "num_children": 0,
      "author": 305285,
      "replies": []
    },
    {
      "id": "i7tk229",
      "text": "“An entire reservation of people are in poverty”\n\n“*Bullshit, what about these 10 guys*”",
      "timestamp": "2022-05-08 17:41:36",
      "score": 11,
      "num_children": 0,
      "author": 345665,
      "replies": []
    },
    {
      "id": "i7soprk",
      "text": "Confidence in foolish people is a dangerous thing.",
      "timestamp": "2022-05-08 13:47:12",
      "score": 9,
      "num_children": 1,
      "author": 282557,
      "replies": [
        {
          "id": "i7szc4u",
          "text": "That’s the whole thesis statement of this sub, I believe",
          "timestamp": "2022-05-08 15:11:13",
          "score": 2,
          "num_children": 0,
          "author": 53700,
          "replies": []
        }
      ]
    },
    {
      "id": "i7smi7v",
      "text": "https://yourbias.is/the-availability-heuristic\nWelcome to the availability heuristic - similar to the sharpshooter’s fallacy - the person has focused on where his bullseye landed rather than focusing on what he missed",
      "timestamp": "2022-05-08 13:28:17",
      "score": 8,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i7t6u8n",
      "text": "I got into an argument on which Wahlberg brother was marky mark...LIKE THERE'S ANY OTHER ANSWER THAN MARK. WHY DID THEY THINK IT WAS DONNIE?! It still baffles me years later.",
      "timestamp": "2022-05-08 16:06:23",
      "score": 7,
      "num_children": 0,
      "author": 24057,
      "replies": []
    },
    {
      "id": "i7tk1v0",
      "text": "7th grade at the lunch table, \"The earth has 2 moons\" dead serious, thought the blood moon and \"the normal moon\" were different",
      "timestamp": "2022-05-08 17:41:34",
      "score": 7,
      "num_children": 1,
      "author": 10978,
      "replies": [
        {
          "id": "i7tp1lx",
          "text": "The number of moons earth has changes depending on who you ask. The one that matters is Luna. We do have several things that orbit us, though.",
          "timestamp": "2022-05-08 18:18:10",
          "score": -1,
          "num_children": 1,
          "author": 337140,
          "replies": [
            {
              "id": "i7xch83",
              "text": "Technically correct on the last sentence, but only one defined moon.",
              "timestamp": "2022-05-09 14:53:30",
              "score": 1,
              "num_children": 0,
              "author": 311287,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i7sjdp5",
      "text": "My rez sucks rather stay in the city",
      "timestamp": "2022-05-08 13:00:04",
      "score": 5,
      "num_children": 0,
      "author": 108220,
      "replies": []
    },
    {
      "id": "i7sjp1r",
      "text": "Even if they were Native American I guess Jeff Bezos, Trump, the Waltons, etc all negate the poverty of white Americans in Appalachia 🙃",
      "timestamp": "2022-05-08 13:03:00",
      "score": 6,
      "num_children": 0,
      "author": 397000,
      "replies": []
    },
    {
      "id": "i7tzbkt",
      "text": "I like how even if the indian billionaires were actually native american, it’s still a terrible rebuttal.",
      "timestamp": "2022-05-08 19:33:27",
      "score": 3,
      "num_children": 0,
      "author": 224495,
      "replies": []
    },
    {
      "id": "i7sqika",
      "text": "My friend’s brother doesn’t believe Covid exists. They dropped out of school in year 9. I am study at university and I honestly need to sit with him for a day just to explain what a percent is, let alone an R-number and biology.",
      "timestamp": "2022-05-08 14:02:12",
      "score": 11,
      "num_children": 0,
      "author": 2468,
      "replies": []
    },
    {
      "id": "i7sgbxm",
      "text": "Looks like a repost. I've seen this image 3 times.\n\nFirst Seen [Here](https://redd.it/ubfn9t) on 2022-04-25 100.0% match. Last Seen [Here](https://redd.it/ubnj5t) on 2022-04-25 100.0% match\n\nFeedback? Hate? Visit r/repostsleuthbot - *I'm not perfect, but you can help. Report [ [False Positive](https://www.reddit.com/message/compose/?to=RepostSleuthBot&subject=False%20Positive&message={\"post_id\": \"ukv580\", \"meme_template\": 288274}) ]*\n\n[View Search On repostsleuth.com](https://www.repostsleuth.com?postId=ukv580&sameSub=false&filterOnlyOlder=true&memeFilter=true&filterDeadMatches=false&targetImageMatch=100&targetImageMemeMatch=96)\n\n---\n\n**Scope:** Reddit | **Meme Filter:** True | **Target:** 96% | **Check Title:** False | **Max Age:** Unlimited | **Searched Images:** 327,713,059 | **Search Time:** 16.77548s",
      "timestamp": "2022-05-08 12:29:09",
      "score": 12,
      "num_children": 1,
      "author": 182762,
      "replies": [
        {
          "id": "i7ta6k9",
          "text": "Good bot",
          "timestamp": "2022-05-08 16:30:47",
          "score": 2,
          "num_children": 1,
          "author": 370720,
          "replies": [
            {
              "id": "i7ta7ww",
              "text": "Thank you, Euristic_Elevator, for voting on RepostSleuthBot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
              "timestamp": "2022-05-08 16:31:03",
              "score": 1,
              "num_children": 0,
              "author": 95504,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i7t6z5l",
      "text": "My wife’s best friend in high school one time tried to talk current politics with her. She said something along the lines of “you know, because Saddam Hussein is Osama Bin Laden’s Dad” and after laughing for several minutes my wife said “don’t EVER talk politics with me ever again”",
      "timestamp": "2022-05-08 16:07:24",
      "score": 3,
      "num_children": 0,
      "author": 412644,
      "replies": []
    },
    {
      "id": "i7t93ue",
      "text": "[deleted]",
      "timestamp": "2022-05-08 16:22:52",
      "score": 3,
      "num_children": 1,
      "replies": [
        {
          "id": "i7tow13",
          "text": "You should be careful getting offended on other people's behalf, because sometimes (like right now) you end up being rather less than helpful or supportive. Either intentionally, or far more likely just because you're uninformed. So I just encourage you to be informed about the things you speak about before you get angry about them, [here's a great primer for you!](https://www.youtube.com/watch?v=kh88fVP2FWQ)",
          "timestamp": "2022-05-08 18:17:03",
          "score": 3,
          "num_children": 1,
          "author": 378896,
          "replies": [
            {
              "id": "i7tudsg",
              "text": "Whoops",
              "timestamp": "2022-05-08 18:57:31",
              "score": 1,
              "num_children": 0,
              "author": 102312,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i7ugoci",
      "text": "Some people are so stupid that even stupid people look at them in amazement.",
      "timestamp": "2022-05-08 21:40:46",
      "score": 3,
      "num_children": 0,
      "author": 304888,
      "replies": []
    },
    {
      "id": "i7sohd7",
      "text": "Billionaire exist because of greed.",
      "timestamp": "2022-05-08 13:45:12",
      "score": 5,
      "num_children": 2,
      "author": 5116,
      "replies": [
        {
          "id": "i7tef83",
          "text": "No one needs a billion dollars. Absolutely no one.",
          "timestamp": "2022-05-08 17:01:18",
          "score": 4,
          "num_children": 1,
          "author": 356969,
          "replies": [
            {
              "id": "i7tfkf0",
              "text": "There are plenty of things you don't \"need\" but you are still allowed to have them. Need isn't and shouldn't be a requirement for being allowed to own something.",
              "timestamp": "2022-05-08 17:09:30",
              "score": -2,
              "num_children": 1,
              "author": 258177,
              "replies": [
                {
                  "id": "i7tga6e",
                  "text": "I agree on plenty of things you’ve said. But that’s not my point.\n\nBillionaires are a special kind of disgusting. Name a modern American billionaire who hasn’t made their billions on the backs of people in poverty, driving them farther into poverty, making the country overall worse off.\n\nNo one needs to be a billionaire. No one could ever spend that money. Yet they always want more.",
                  "timestamp": "2022-05-08 17:14:38",
                  "score": 2,
                  "num_children": 1,
                  "author": 356969,
                  "replies": [
                    {
                      "id": "i7th6xy",
                      "text": "So you don't have a problem with billionaires per se, you have a problem with people who make their money dishonestly.\n\nDon't get me wrong, I don't like most of these hyper-rich people, but I don't hate them because they are rich. It's their actions that warrant these feelings. For example, when they start acting as if they are above \"the poors\" and start constantly voicing their pointless opinions on things they have no clue about.",
                      "timestamp": "2022-05-08 17:21:07",
                      "score": 1,
                      "num_children": 1,
                      "author": 258177,
                      "replies": [
                        {
                          "id": "i7tiby4",
                          "text": "No, I do have a problem with billionaires. You don’t become a billionaire by accident. So if you are one, you’re a problem. Plenty of people have more than enough to do anything they want, and they also pay employees well, and give back, and don’t hide from paying taxes, and help others also be successful. By being a billionaire, you aren’t a good member of society. \n\nIf you’re a billionaire, you’re making decisions that make you a shit person. Good people never get to that point. Only greedy people do. And those people will always think they need more. \n\nI just genuinely believe no one needs to be a billionaire. And anyone who is, is a bad person.",
                          "timestamp": "2022-05-08 17:29:09",
                          "score": 1,
                          "num_children": 2,
                          "author": 356969,
                          "replies": [
                            {
                              "id": "i7too80",
                              "text": "From what I'm gathering in your comment, you seem to believe that paying your employees well being honest and paying your taxes is mutually exclusive from being a billionaire. Is my assessment of this correct?\n\nOn that note, say somebody is a billionaire, but they do all of these things you describes above, would you still categorise them as a bad person? And inversely, if somebody owns a business and isn't financially successful despite doing all of the bad things you describe billionaires doing, are they still morally superior to a billionaire who has not done those things?\nIn essence what I am asking, is do you have the problem with the concept of someone owning a billion dollars, regardless of the series of actions they have undertaken to get there?",
                              "timestamp": "2022-05-08 18:15:27",
                              "score": 1,
                              "num_children": 1,
                              "author": 258177,
                              "replies": [
                                {
                                  "id": "i7tr2e1",
                                  "text": "> In essence what I am asking, is do you have the problem with the concept of someone owning a billion dollars, regardless of the series of actions they have undertaken to get there?\n\nYes.",
                                  "timestamp": "2022-05-08 18:33:01",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 356969,
                                  "replies": [
                                    {
                                      "id": "i7tsxim",
                                      "text": "So you hate people for being successful.",
                                      "timestamp": "2022-05-08 18:46:47",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 258177,
                                      "replies": [
                                        {
                                          "id": "i7tt7pm",
                                          "text": "I didn’t say that. I don’t care if someone MAKES a billion dollars. I said no one NEEDS a billion dollars. Don’t twist my words.",
                                          "timestamp": "2022-05-08 18:48:50",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 356969,
                                          "replies": [
                                            {
                                              "id": "i7tticv",
                                              "text": "Wait wait wait. But if someone makes a billion dollars, don't they nessessarily *have* it in one form or another? I don't get your logic here.\n\nEdit: to add, you DID say it, as it was pretty clear in the specific section of my comment you replied to\n>owning a billion dollars",
                                              "timestamp": "2022-05-08 18:51:01",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 258177,
                                              "replies": [
                                                {
                                                  "id": "i7tu1d2",
                                                  "text": "But those were your words. I was being succinct because you seem to be trying to twist my words. \n\n*No one needs a billion dollars.* That’s my opinion.",
                                                  "timestamp": "2022-05-08 18:54:57",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 356969,
                                                  "replies": [
                                                    {
                                                      "id": "i7tunfp",
                                                      "text": "But you said that you think anybody that has a billion dollars is a fundamentally shitty person, regardless of how they have that billion dollars. Sure, maybe I did exaggerate when I said \"hate\", but you do fundamentally  dislike them for being financially successful. You said so yourself.",
                                                      "timestamp": "2022-05-08 18:59:30",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 258177,
                                                      "replies": [
                                                        {
                                                          "id": "i7tvvdm",
                                                          "text": "I said no one needs a billion dollars.",
                                                          "timestamp": "2022-05-08 19:08:22",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 356969,
                                                          "replies": [
                                                            {
                                                              "id": "i7tw4t8",
                                                              "text": ">No, I do have a problem with billionaires. You don’t become a billionaire by accident. So if you are one, you’re a problem. Plenty of people have more than enough to do anything they want, and they also pay employees well, and give back, and don’t hide from paying taxes, and help others also be successful. By being a billionaire, you aren’t a good member of society. \n\n>If you’re a billionaire, you’re making decisions that make you a shit person. Good people never get to that point. Only greedy people do. And those people will always think they need more. \n\n>I just genuinely believe no one needs to be a billionaire. And anyone who is, is a bad person.",
                                                              "timestamp": "2022-05-08 19:10:15",
                                                              "score": 1,
                                                              "num_children": 1,
                                                              "author": 258177,
                                                              "replies": [
                                                                {
                                                                  "id": "i7txbij",
                                                                  "text": "> I just genuinely believe no one needs to be a billionaire.",
                                                                  "timestamp": "2022-05-08 19:18:52",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "author": 356969,
                                                                  "replies": [
                                                                    {
                                                                      "id": "i7txhsm",
                                                                      "text": "OK, am I just supposed to ignore the rest 90% of your comment?",
                                                                      "timestamp": "2022-05-08 19:20:08",
                                                                      "score": 1,
                                                                      "num_children": 1,
                                                                      "author": 258177,
                                                                      "replies": [
                                                                        {
                                                                          "id": "i7ty4yb",
                                                                          "text": "I can ignore you if that helps.",
                                                                          "timestamp": "2022-05-08 19:24:47",
                                                                          "score": 1,
                                                                          "num_children": 0,
                                                                          "author": 356969,
                                                                          "replies": []
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "i7top5h",
                              "text": "What about the guy who made Minecraft? Aside from the fact it was the most successful clone of infiniminer, what did he do to warrant being lumped in with people like buffet, bezos, and trump?",
                              "timestamp": "2022-05-08 18:15:39",
                              "score": 1,
                              "num_children": 1,
                              "author": 337140,
                              "replies": [
                                {
                                  "id": "i7tqix3",
                                  "text": "I don’t know enough about that story. Did he do it alone? If he had employees, how were they treated and paid? What has he done with the money since? And I don’t mean, has he given it away, though I do think with that kind of money, you should donate to charity, create a charity, etc. But has he used that money to make more money? If so, how? Has he used it in other ways? Did he just simply disappear?\n\nThe thing is, most people who are successful, make their first millions by luck. Like it or not, it is luck. And the people who admit that are very rare, but tend to give back more. They help others, they are charitable, they are giving.  Maybe the Minecraft creator is one and has gone on to do good for the world. If so, quite the anomaly, but great.\n\nI’d still say there is absolutely no reason in the world to stay a billionaire. Give back, help the world. There is so much suffering. I don’t care where you make a difference. If it were creating a school to create technology like Minecraft, great! If it’s scholarships for people a foundation selects to give tech education to people, great. It doesn’t have to be about poverty or food or clothes. Give back any way. There is no way to spend a billion dollars, nor any reason to hang onto a billion dollars. Use the money for good, and try. If I had a billion dollars, I’d spend all day finding ways to spend it.\n\nWasn’t it Bezos’s ex who got a divorce and gave away a huge portion of her fortune? I’m not a Gates fan, but invest in a cause, create a foundation. There are as many things in this world to make better as  there are dollars in their accounts. Dolly Parton and other celebs gave millions to covid vaccine research. \n\nMost average people give far, far, far more, as a percent of income and total wealth, each year, than most billionaires. Fuck, poor people give more. \n\nIf I had a billion dollars, I’d make it my goal to NOT have a billion dollars. I wouldn’t go broke, but, again, no one needs that kind of money. And the more they hold onto, the more others are hurting and being ignored.",
                                  "timestamp": "2022-05-08 18:28:57",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 356969,
                                  "replies": [
                                    {
                                      "id": "i7ts07r",
                                      "text": "I have no idea what he did afterward, I just know that he created the most popular version of a voxel game. We could debate the ethics of plastic toys in shapes of the game assets, and stuff like that, but I am saying I don't believe he \"made\" that billion unethically.\n\nI'm in a similar thought as you. I'd like to have a billion dollars so I could effect change on earth, but I'm unwilling to compromise my personal ethics to get there.",
                                      "timestamp": "2022-05-08 18:40:01",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 337140,
                                      "replies": [
                                        {
                                          "id": "i7ttuma",
                                          "text": "I guess I don’t even know what Minecraft is! I don’t have kids. I always thought it was a video game. I suppose you could get into the ethics of plastics, I wasn’t even going that deep. Most who are billionaires got there being greedy and selfish. On the off chance they didn’t, they’re keeping it by being greedy and selfish. And I’d argue every billionaire got there by luck. I’m sure Minecraft is great, but I bet there are thousands of other similar products, some you might argue are better. \n\nThat’s my (apparently) controversial opinion. But I feel that way.",
                                          "timestamp": "2022-05-08 18:53:33",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 356969,
                                          "replies": [
                                            {
                                              "id": "i7tx1xe",
                                              "text": "It is a video game that sold like crazy from 2010 and beyond, and then toys and shirts and cups and stuff was made with the Minecraft game assets and branding. Microsoft purchased Mojang, the company that the person who \"made Minecraft\" started. So the billions were mostly made upon sale, but Mojang wasn't hurting by any stretch of the imagination.\n\nMicrosoft's purchase may have led to more plastic toys, I'm not sure about that timeline.\n\nIf we work within the framework that people should be paid for their work, then there's no ethical conflict here, unless the person who owned the rights to the game was unfairly compensating the developers that worked on the game from 2012 until the sale.\n\nNone of this matters because that is a huge fluke, and the chances of that happening in the same way are low enough that we could probably count on one or two hands how many times it'll occur in our lifetimes.",
                                              "timestamp": "2022-05-08 19:16:55",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 337140,
                                              "replies": [
                                                {
                                                  "id": "i7ty1cc",
                                                  "text": "We seem to be on the same page. I wish people well and am happy for their success. I hope success also for myself. And I HOPE if I ever stumble into a billion dollars or multiple millions, I’m not greedy with that, and use it for good. You never know until it’s you, truly. I can say confidently I don’t even need a hundred million dollars. Anything out of a handful of millions I’d never spend. \n\nBut I’m ready to be tested!",
                                                  "timestamp": "2022-05-08 19:24:03",
                                                  "score": 2,
                                                  "num_children": 0,
                                                  "author": 356969,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i7vvrl3",
          "text": "No, they exist because of exploitation",
          "timestamp": "2022-05-09 05:01:39",
          "score": 1,
          "num_children": 0,
          "author": 339364,
          "replies": []
        }
      ]
    },
    {
      "id": "i7syzt4",
      "text": "I believe the point he was trying to make is that even if you’re not raised on an Indian reservation the US public school system can still fail you miserably.\n\n/s",
      "timestamp": "2022-05-08 15:08:37",
      "score": 2,
      "num_children": 0,
      "author": 44308,
      "replies": []
    },
    {
      "id": "i7u08kw",
      "text": "Even if the people in the article were Native American, ‘a handful of people from this place are rich, therefor no one from this place is poor’ is still an astronomically stupid argument",
      "timestamp": "2022-05-08 19:40:18",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i7u4n5h",
      "text": "I bet when told why they were wrong they wouldn’t admit they are wrong",
      "timestamp": "2022-05-08 20:12:54",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i7stfsh",
      "text": "I once told my cousin in a heated debate that “keeping an open mind is how you grow” and he very seriously said “keeping an open mind is how you get brainwashed” I shit you not, this man was 100% serious and didn’t even realize how that statement is the mark of a brainwashed person. I’m already sure you guys can guess which party and religion he affiliates with. Fucking unbelievable, it’s easy to see how our country is so divided when you got nut cases like my extended family. If they would stop and actually think for themselves even for one minute they might realize how stupid they actually are.\n\n “A fool knows it all and wise man knows how little he actually knows.” - someone, somewhere",
      "timestamp": "2022-05-08 14:26:06",
      "score": 5,
      "num_children": 0,
      "author": 58209,
      "replies": []
    },
    {
      "id": "i7sy3cy",
      "text": "My favorite was a girl on reddit confidently asking me \"WHAT DOES NASA HAVE TO DO WITH THE MOON???\"",
      "timestamp": "2022-05-08 15:01:49",
      "score": 4,
      "num_children": 1,
      "author": 12727,
      "replies": [
        {
          "id": "i7toee3",
          "text": "Overheard in college: \"is the earth a star?\"",
          "timestamp": "2022-05-08 18:13:27",
          "score": 3,
          "num_children": 0,
          "author": 337140,
          "replies": []
        }
      ]
    },
    {
      "id": "i7u0mkv",
      "text": "I think the only native Americans icans making any money is the casino owners",
      "timestamp": "2022-05-08 19:43:08",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i7sy44i",
      "text": "Also how do you explain Bezos and Appalachia? Checkmate!",
      "timestamp": "2022-05-08 15:01:59",
      "score": 1,
      "num_children": 0,
      "author": 273115,
      "replies": []
    },
    {
      "id": "i7s4yeu",
      "text": "FFS!",
      "timestamp": "2022-05-08 10:03:43",
      "score": 1,
      "num_children": 0,
      "author": 152143,
      "replies": []
    },
    {
      "id": "i7s5lpb",
      "text": "Rofl",
      "timestamp": "2022-05-08 10:13:24",
      "score": 1,
      "num_children": 0,
      "author": 34789,
      "replies": []
    },
    {
      "id": "i7sh3q7",
      "text": "And that someone was Christopher Columbus.",
      "timestamp": "2022-05-08 12:37:14",
      "score": 1,
      "num_children": 0,
      "author": 226776,
      "replies": []
    },
    {
      "id": "i7shxi2",
      "text": "God I wish we where that rich.",
      "timestamp": "2022-05-08 12:45:41",
      "score": 1,
      "num_children": 0,
      "author": 27472,
      "replies": []
    },
    {
      "id": "i7ss023",
      "text": "The enemy of knowledge is not the absence, but the illusion of knowledge.",
      "timestamp": "2022-05-08 14:14:32",
      "score": 1,
      "num_children": 0,
      "author": 58403,
      "replies": []
    },
    {
      "id": "i7sul44",
      "text": "Lol this is wildly funny to me",
      "timestamp": "2022-05-08 14:34:59",
      "score": 1,
      "num_children": 0,
      "author": 72182,
      "replies": []
    },
    {
      "id": "i7sy2ha",
      "text": "Columbus made the same mistake.",
      "timestamp": "2022-05-08 15:01:38",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i7t1l9e",
      "text": "I'm choosing to believe they were messing with the author",
      "timestamp": "2022-05-08 15:27:56",
      "score": 1,
      "num_children": 0,
      "author": 267497,
      "replies": []
    },
    {
      "id": "i7t6x7z",
      "text": "The amazing moment when /r/confidentlyincorrect and /r/technicallycorrect overlap.",
      "timestamp": "2022-05-08 16:07:01",
      "score": 1,
      "num_children": 0,
      "author": 197912,
      "replies": []
    },
    {
      "id": "i7t83zb",
      "text": "That’s pretty bad lol",
      "timestamp": "2022-05-08 16:15:42",
      "score": 1,
      "num_children": 0,
      "author": 358287,
      "replies": []
    },
    {
      "id": "i7tg75f",
      "text": "What if that someone was Christopher Columbus? 🤔",
      "timestamp": "2022-05-08 17:14:02",
      "score": 1,
      "num_children": 0,
      "author": 211757,
      "replies": []
    },
    {
      "id": "i7thu1c",
      "text": "Sounds trumpish, I believe it.",
      "timestamp": "2022-05-08 17:25:37",
      "score": 1,
      "num_children": 0,
      "author": 115411,
      "replies": []
    },
    {
      "id": "i7tlttl",
      "text": "[My first thought](https://youtu.be/-xyV6Nl4m2c).",
      "timestamp": "2022-05-08 17:54:27",
      "score": 1,
      "num_children": 0,
      "author": 346705,
      "replies": []
    },
    {
      "id": "i7tvtqt",
      "text": "The vast majority of people on this planet have shit for brains.",
      "timestamp": "2022-05-08 19:08:02",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i7txwn0",
      "text": "Columbus wouldnt understand",
      "timestamp": "2022-05-08 19:23:05",
      "score": 1,
      "num_children": 0,
      "author": 42775,
      "replies": []
    },
    {
      "id": "i7uj3ul",
      "text": "[\"Yeah! Send that Indian back to Africa!\"](https://youtu.be/4pu-PIehTcw?t=36)",
      "timestamp": "2022-05-08 21:58:40",
      "score": 1,
      "num_children": 0,
      "author": 137294,
      "replies": []
    },
    {
      "id": "i7ujpw7",
      "text": "I blame Christopher Columbus for this kind of shit",
      "timestamp": "2022-05-08 22:03:10",
      "score": 1,
      "num_children": 0,
      "author": 357889,
      "replies": []
    },
    {
      "id": "i7ulw5y",
      "text": "Though it’s likely not, this has Ken M written all over it.",
      "timestamp": "2022-05-08 22:19:50",
      "score": 1,
      "num_children": 0,
      "author": 357709,
      "replies": []
    },
    {
      "id": "i7uwak1",
      "text": "I once was the only person who had ever seen let alone talk to a native person in one of my classes in a large Canadian university. I’m not that outgoing of a person, but the amount of people who don’t know *anything* about cultures other than their own is insane. It frightens me.",
      "timestamp": "2022-05-08 23:43:59",
      "score": 1,
      "num_children": 0,
      "author": 304983,
      "replies": []
    },
    {
      "id": "i7v1ozc",
      "text": "\"When we came to America, it was so nice. It was just Indians. And they weren’t even Indians. We *called* them that by accident. *...And we still call them that*. We knew in a month that it wasn’t Indians but we just don’t give a shit. We never corrected. We came here. They’re like, 'Hi.' And we’re like,\n\n'Hey, you’re Indians, right?' And they’re like,\n\n'No.'\n\n'No, this is India, right?'\n\n'No, it’s not. It’s a totally other place.'\n\n'You’re not Indians?'\n\n'*No.*'\n\n'...Ahh, *you’re Indians.*'\"",
      "timestamp": "2022-05-09 00:29:07",
      "score": 1,
      "num_children": 0,
      "author": 122823,
      "replies": []
    },
    {
      "id": "i7vjdwu",
      "text": "Best part is that even if he had the right \"indians\", the existence of 10 obscenely rich people does not mean poverty is not a thing.",
      "timestamp": "2022-05-09 02:56:53",
      "score": 1,
      "num_children": 0,
      "author": 40039,
      "replies": []
    },
    {
      "id": "i7vln1f",
      "text": "Well, technically correct……🤪",
      "timestamp": "2022-05-09 03:17:42",
      "score": 1,
      "num_children": 0,
      "author": 182520,
      "replies": []
    },
    {
      "id": "i7xbpna",
      "text": "Still cracks me up when someone says \"dot or feather?\"  When I tell them I'm Indian.",
      "timestamp": "2022-05-09 14:48:12",
      "score": 1,
      "num_children": 0,
      "author": 311287,
      "replies": []
    },
    {
      "id": "i7zp1y8",
      "text": "Is it possible that the other person was just trying to be funny?",
      "timestamp": "2022-05-10 00:45:34",
      "score": 1,
      "num_children": 0,
      "author": 384025,
      "replies": []
    },
    {
      "id": "iavohpl",
      "text": "I went to high school with a girl that was with me on a trip to France with the French club one summer. We landed at night and as we were leaving the airport she looked up in the sky and said, “oh look, they have a moon here, too!“\n\nEdit: this was the summer after we had graduated high school. Yep.",
      "timestamp": "2022-06-02 05:26:05",
      "score": 1,
      "num_children": 0,
      "author": 402807,
      "replies": []
    },
    {
      "id": "i7rux87",
      "text": "Stupid, yes. But not confidently incorrect, as no  claim was made, incorrect or otherwise.",
      "timestamp": "2022-05-08 07:36:31",
      "score": -132,
      "num_children": 5,
      "author": 18518,
      "replies": [
        {
          "id": "i7rzk2q",
          "text": "The claim was implicit, but still clear, wasn't it.",
          "timestamp": "2022-05-08 08:43:11",
          "score": 60,
          "num_children": 1,
          "author": 365122,
          "replies": [
            {
              "id": "i7s0k1i",
              "text": "Implicit doesn't do it. It's not a claim unless it's explicit.",
              "timestamp": "2022-05-08 08:57:41",
              "score": -75,
              "num_children": 2,
              "author": 18518,
              "replies": [
                {
                  "id": "i7s171g",
                  "text": "I'd say it fits,\n\n> For those times when people are way too smug about their wrong answer\n\nProbably breaks rule 6 about the fifteenth time though.",
                  "timestamp": "2022-05-08 09:07:04",
                  "score": 28,
                  "num_children": 1,
                  "author": 194780,
                  "replies": [
                    {
                      "id": "i7s2049",
                      "text": "They don't **claim** anything. Implicit stuff is irrelevant. The actual words, spoken or written, is the only thing that really matters. \n\nFor example, if someone posts a \"This you?\" comment, then link it to something completely unrelated, that someone may be stupid and their comment may be irrelevant. But it didn't contain a claim, hence it can't be incorrect.",
                      "timestamp": "2022-05-08 09:19:18",
                      "score": -43,
                      "num_children": 1,
                      "author": 18518,
                      "replies": [
                        {
                          "id": "i7tp8ul",
                          "text": "Can you explain this without analogy?",
                          "timestamp": "2022-05-08 18:19:37",
                          "score": 1,
                          "num_children": 1,
                          "author": 337140,
                          "replies": [
                            {
                              "id": "i7tsxyh",
                              "text": "Claim: state or assert that something is the case.\n\nNo one here has been able to tell me exactly what this claim was, and show where it was stated/asserted.",
                              "timestamp": "2022-05-08 18:46:52",
                              "score": 1,
                              "num_children": 1,
                              "author": 18518,
                              "replies": [
                                {
                                  "id": "i7tvugc",
                                  "text": "This is a screenshot of text. The confidently incorrect person was the one being paraphrased in quotation. \n\nAre you saying we can't make a determination because we don't have the original email to the tweet author or the author's article?\n\nI guess you can say we don't have enough information. However let's go with what we do know:\n\nUpon being asked about dumb things they've heard, author of tweet was reminded of a time that someone linked them an article about 10 billionaires that were in/from India, as a reply to author's article about the rank poverty of Native Americans.\n\nThe author, for the sake of this little discussion, should be assumed to be truthful, however this works even if it contains a straw man. The author of the tweet says that their article was about poverty among \"Native Americans.\" This means that \"Native American\" is both explicit and implicit. The person who contacted the author searched \"rich Indians\" on Google and came up with an article, and linked that to the author.\n\nThere's no claim, it's an anecdote related to the prompt of the original tweet.\n\nAssuming that the author is not a liar and this actually happened, the \"confidently incorrect\" part is thinking one is \"disproving\" the author's article in **two** ways. First, that 10 billionaires means there is not poverty. Secondly, the factual error of pointing at 10 billionaires on another continent as proof there is no poverty among \"Indians\" in the US.\n\nThere's not a whole lot of extrapolation going on here, the only assumptions we have to make as outside observers is that the author is relating a true story, however it doesn't even matter.",
                                  "timestamp": "2022-05-08 19:08:11",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 337140,
                                  "replies": [
                                    {
                                      "id": "i7txe0v",
                                      "text": ">The person who contacted the author searched \"rich Indians\" on Google\n\nYou don't know that. This is a claim from you that you can't prove, can you? \n\n>the \"confidently incorrect\" part is thinking one is \"disproving\" the author's article in two ways.\n\nYou don't know what they were thinking. This is another claim from you that I don't think you can prove.\n\n>First, that 10 billionaires means there is not poverty. \n\nIs that an exact quote? Where did you get that from? \n\n>Secondly, the factual error of pointing at 10 billionaires on another continent as proof there is no poverty among \"Indians\" in the US.\n\nThey never said this.",
                                      "timestamp": "2022-05-08 19:19:22",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 18518,
                                      "replies": [
                                        {
                                          "id": "i7tyqrj",
                                          "text": "By what reasoning would someone reply to an author's article with those statements? Common language \"oh yeah, well what about ...\" has a meaning.\n\nYou're arguing from some weird unrealistic courtroom fiction, I'm explaining the logic.\n\nClaim: native Americans are impoverished.  \n1: there are rich Indians, from India.\n\nSo sure, let's agree that this is a **nonsequitor**, which is fallacious, and therefore the argument is incorrect. Doesn't even matter what the thinking and claims and whatever else were. It's a nonsequitor.\n\nDoes this work better for you?",
                                          "timestamp": "2022-05-08 19:29:11",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 337140,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i7s4aea",
                  "text": "It does it for me real good",
                  "timestamp": "2022-05-08 09:53:58",
                  "score": 19,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i7s4wqh",
                      "text": "You have very loose standards then. Claiming that someone can be incorrect about something they never even said. Sure opens up a world of bad faith opportunities for you. \n\nWhy is it so difficult for people to focus on the stuff that **actually** is being said?",
                      "timestamp": "2022-05-08 10:03:02",
                      "score": -11,
                      "num_children": 1,
                      "author": 18518,
                      "replies": [
                        {
                          "id": "i7s529x",
                          "text": "you have very tight standards then and not even the decency to be without sin to start throwing stones, the nerve you have.",
                          "timestamp": "2022-05-08 10:05:19",
                          "score": 16,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i7s5h2v",
                              "text": ">you have very tight standards then\n\nI try to follow the basic principles of the legal system in when I hear accusations like the one from OP. If a reasonable judge would throw it out (which he definitely would, in the hypothetical case where someone was accused of being incorrect when there was no claim in the statement mentioned), then why should my standards be lower? \n\n>nerd\n\nAre you still living in the past, when \"nerd\" was an insult? \n\nAlso interesting that you say that I am throwing stones, when I'm the one **defending** the one having stones thrown at them. This makes no sense what so ever.",
                              "timestamp": "2022-05-08 10:11:28",
                              "score": -4,
                              "num_children": 2,
                              "author": 18518,
                              "replies": [
                                {
                                  "id": "i7s65a7",
                                  "text": "no, they’re right, you are definitely being an enormous and joyless nerd",
                                  "timestamp": "2022-05-08 10:21:11",
                                  "score": 13,
                                  "num_children": 1,
                                  "author": 199358,
                                  "replies": [
                                    {
                                      "id": "i7tlznw",
                                      "text": "So by defending someone, I am somehow throwing stones? How, exactly? You and your friend seems to lack logic in your thinking.",
                                      "timestamp": "2022-05-08 17:55:37",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 18518,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "i7s62t0",
                                  "text": "six minutes for that mess of a response? jeez, why is it only now do I understand how all my exes felt? So much time, so many faces filled with disappointment to be avoided. If only I wasn't such a nerd about it all.\n\nI can have an epiphany, you can too! Now go out ya big Nerd and take a breather before replying to random assholes on the internet. I'm sure a Megamind such as yourself is already familiarized with the concept of rolling with pigs only cause you to lose from their big fucking tusks gorging your lungs out of the potato sack you call a body.",
                                  "timestamp": "2022-05-08 10:20:15",
                                  "score": 12,
                                  "num_children": 2,
                                  "replies": [
                                    {
                                      "id": "i7syza7",
                                      "text": "> I understand how all my exes felt \n\nUsername checks out",
                                      "timestamp": "2022-05-08 15:08:30",
                                      "score": 3,
                                      "num_children": 0,
                                      "author": 53700,
                                      "replies": []
                                    },
                                    {
                                      "id": "i7tma7l",
                                      "text": "You didn't have anything **constructive** to add to the discussion? You know, something that isn't a complete word salad.",
                                      "timestamp": "2022-05-08 17:57:48",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 18518,
                                      "replies": [
                                        {
                                          "id": "i7tmko2",
                                          "text": "Hm? There was a conversation?",
                                          "timestamp": "2022-05-08 17:59:58",
                                          "score": 1,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "i7tpisw",
                                              "text": "Yes. People tried to claim that someone can be proven to be incorrect about something that they didn't even say. This of course makes no logical sense, but when I tried to argue against this nonsense people kept introducing more irrelevant nonsense, including your own word salad. \n\nIf you can't argue reasonably and logically,  then what's the point of you writing anything?",
                                              "timestamp": "2022-05-08 18:21:35",
                                              "score": 0,
                                              "num_children": 1,
                                              "author": 18518,
                                              "replies": [
                                                {
                                                  "id": "i7tteuz",
                                                  "text": "O I only wanted to make a sexual innuendo and then make fun of you for being too serious for a bit when you got hostile haha.\n\nTbh the whole conversation seems petty, the end question being being should the post come down or not, or something? Yawn.",
                                                  "timestamp": "2022-05-08 18:50:17",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i7s2pgu",
          "text": "You're being confidently incorrect.",
          "timestamp": "2022-05-08 09:29:58",
          "score": 28,
          "num_children": 1,
          "author": 59259,
          "replies": [
            {
              "id": "i7s431i",
              "text": "Which claim was made then? Can you quote that claim?",
              "timestamp": "2022-05-08 09:50:52",
              "score": -10,
              "num_children": 1,
              "author": 18518,
              "replies": [
                {
                  "id": "i7s48xr",
                  "text": "This rule that to be confidently incorrect, there must be an explicit claim is not part of the subreddit rules - it exists solely in your head.",
                  "timestamp": "2022-05-08 09:53:20",
                  "score": 25,
                  "num_children": 1,
                  "author": 59259,
                  "replies": [
                    {
                      "id": "i7s4oum",
                      "text": "Reddit rules are irrelevant here. It's a simple semantical discussion. \n\nIf someone is incorrect, there must exist something that the person was incorrect about. That something needs to be concrete in order for you to prove that the person actually believed it.\n\nSo, if you claim that this person was incorrect, then please tell me what, exactly, they were incorrect about, and where exactly.",
                      "timestamp": "2022-05-08 09:59:58",
                      "score": -8,
                      "num_children": 1,
                      "author": 18518,
                      "replies": [
                        {
                          "id": "i7s59bg",
                          "text": "They thought that Indian billionaires disprove Native American poverty.  They were incorrect.  \n\nThey don’t need to have constructed it in an explicit sentence.  The fact they said “Then explain this”  to accompany the article makes it unquestionably clear what they thought.\n\nAgain you’re making up rules that don’t exist.",
                          "timestamp": "2022-05-08 10:08:15",
                          "score": 23,
                          "num_children": 2,
                          "author": 59259,
                          "replies": [
                            {
                              "id": "i7s7oqi",
                              "text": "If the article used the word “Indian” then the Indians were justified in treating as if they were referring to actual Indians.",
                              "timestamp": "2022-05-08 10:43:23",
                              "score": -19,
                              "num_children": 0,
                              "replies": []
                            },
                            {
                              "id": "i7s5o3m",
                              "text": "What they might or might not have thought is irrelevant, unless you can **prove** that that actually thought that. Good luck proving that. \n\nThe only thing concrete that you can base your claims on is what they **actually** wrote. If that is not enough, then your case simply isn't strong enough.",
                              "timestamp": "2022-05-08 10:14:22",
                              "score": -5,
                              "num_children": 1,
                              "author": 18518,
                              "replies": [
                                {
                                  "id": "i7s60pb",
                                  "text": "> What they might or might not have thought is irrelevant, unless you can prove that that actually thought that. Good luck proving that.\n\nIt is proven from what he wrote.   There is absolutely no doubt.  If you don’t understand that, then you can’t process basic language.  That’s your flaw - nobody else’s.",
                                  "timestamp": "2022-05-08 10:19:24",
                                  "score": 21,
                                  "num_children": 1,
                                  "author": 59259,
                                  "replies": [
                                    {
                                      "id": "i7tnjck",
                                      "text": ">It is proven from what he wrote.\n\nThat's not how languages work, or how proofs work. No reasonable judge would ever except your \"proof\" in court. \n\nIt's impossible to prove what someone thinks based on what they have written. \n\nWhat is possible though, is to prove what someone has **claimed**. Because then you only need to look at the words written or said. If someone writes \"The moon is blue\" then it is perfectly reasonable to say that they claim that the moon is blue. What they actually believe is irrelevant in that case. But this only works for things actually said or written, **verbatim**. The moment you start to speculate on what someone meant, you do exactly that, you **speculate**. Your theory might be **likely**, but that's still not **proof**.",
                                      "timestamp": "2022-05-08 18:07:04",
                                      "score": 0,
                                      "num_children": 1,
                                      "author": 18518,
                                      "replies": [
                                        {
                                          "id": "i7tp2s8",
                                          "text": "> That's not how languages work, or how proofs work. No reasonable judge would ever except your \"proof\" in court.\n\nOf course they would!  Let’s say the case is discrimination under EEOC and an employer or prospective employer asks if an employee/candidate is gay and when they say “yes” they are recorded as replying: “Then you’re fired/Then you haven’t got the job!”\n\nThat’s a slam dunk case of discrimination.  No-one’s going to seriously claim that “Then” doesn’t necessarily mean it’s because they’re gay, because it literally does mean that. They’re not going to say: “There needs to be a discriminatory sentence uttered expressly saying the reason the person was fired/not employed.”  If they tried to present that as a defence, it would be laughed out of court because it’s laughably wrong.",
                                          "timestamp": "2022-05-08 18:18:24",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 59259,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i7sjox7",
          "text": "One could argue that the person stated, more or less explicitly, \"The fact that there are 10 Indian billionaires invalidates your article about Native American poverty\".",
          "timestamp": "2022-05-08 13:02:58",
          "score": 10,
          "num_children": 1,
          "author": 26768,
          "replies": [
            {
              "id": "i7to2o9",
              "text": "Yes, one could definitely argue that. But you can't **proove** that they meant that. The only thing you really can prove is what they actually wrote, verbatim, and nothing else. Actually,  even that is pushing it, since as far as I can see the person discussed here isn't even included in the screenshot. We are just being told what they wrote.",
              "timestamp": "2022-05-08 18:11:03",
              "score": 1,
              "num_children": 1,
              "author": 18518,
              "replies": [
                {
                  "id": "i7u65v4",
                  "text": "I don't know why you suddenly need absolute proof for everything. This is not mathematics, it's a humorous subreddit. You're coming across as very pretentious right now. I guess this comment essentially boils down to: cope\n\nAlso you spelt '**prove'** wrong, but that's neither here nor there.",
                  "timestamp": "2022-05-08 20:24:07",
                  "score": 2,
                  "num_children": 0,
                  "author": 26768,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i7ssgok",
          "text": "r/confidentlytechnicallyandpedanticlycorrect",
          "timestamp": "2022-05-08 14:18:20",
          "score": 3,
          "num_children": 1,
          "author": 356184,
          "replies": [
            {
              "id": "i7tl9j3",
              "text": "The best kind of correct.",
              "timestamp": "2022-05-08 17:50:17",
              "score": 1,
              "num_children": 0,
              "author": 18518,
              "replies": []
            }
          ]
        },
        {
          "id": "i7t38sx",
          "text": "You were the one inquiring about the 10 billionaires, correct?",
          "timestamp": "2022-05-08 15:40:11",
          "score": 1,
          "num_children": 1,
          "author": 14855,
          "replies": [
            {
              "id": "i7tl617",
              "text": "Not that I can remember. When was this?",
              "timestamp": "2022-05-08 17:49:35",
              "score": 1,
              "num_children": 1,
              "author": 18518,
              "replies": [
                {
                  "id": "i7tmdti",
                  "text": "Troll or a severe cognitive handicap",
                  "timestamp": "2022-05-08 17:58:33",
                  "score": 0,
                  "num_children": 1,
                  "author": 14855,
                  "replies": [
                    {
                      "id": "i7tp0x8",
                      "text": "That might summarize the majority of the people not understanding simple logic and semantics here,  yes.",
                      "timestamp": "2022-05-08 18:18:02",
                      "score": 1,
                      "num_children": 1,
                      "author": 18518,
                      "replies": [
                        {
                          "id": "i7txxdc",
                          "text": "Woah... like everyone’s wrong an you’re right?",
                          "timestamp": "2022-05-08 19:23:14",
                          "score": 0,
                          "num_children": 1,
                          "author": 14855,
                          "replies": [
                            {
                              "id": "i7tyetg",
                              "text": "At least the people not understanding that a person can't reasonably be accused of being incorrect about something they never said.",
                              "timestamp": "2022-05-08 19:26:44",
                              "score": 1,
                              "num_children": 1,
                              "author": 18518,
                              "replies": [
                                {
                                  "id": "i7u0l10",
                                  "text": "Dude... that’s wild.",
                                  "timestamp": "2022-05-08 19:42:50",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 14855,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i7sj6hx",
      "text": "The worlds richest man is an African American.",
      "timestamp": "2022-05-08 12:58:06",
      "score": -22,
      "num_children": 1,
      "replies": [
        {
          "id": "i7thx49",
          "text": "Hurr durr",
          "timestamp": "2022-05-08 17:26:13",
          "score": 4,
          "num_children": 0,
          "author": 341830,
          "replies": []
        }
      ]
    },
    {
      "id": "i7sjnay",
      "text": "Iam pretty sure you did not put \"Native American\" in your article. i see that \"Indians\" is also used for People from india and Native Americans.\n\ni get confused lot of times when the post says indians where i see native americans, its a very genuine mistake from your side. Either Dont call People from India, Indians or Have a different name for Native Americans to avoid the confusion, if you dont do either of that YOU are the stupid one too. Because the world is not America, not everyone knows about your shit. same way not everyone knows about india, if you dont know them and thinks it is stupid the other guy can think you are stupid too.\n\n&#x200B;\n\nNow with that said the other guy is surely stupid because 10 billionaires doesnt mean poverty doest exist. So yeah he is confidently incorrect and both of you are stupid.",
      "timestamp": "2022-05-08 13:02:34",
      "score": -19,
      "num_children": 3,
      "author": 263221,
      "replies": [
        {
          "id": "i7ssvoo",
          "text": "Since neither of us have read OP's article to know for sure, it is only a guess whether he said \"Indian\" or \"Native American\" or more likely both, I would think that on reading the article, any such confusion would be put to rest. Clearly the other guy didn't read it either and also didn't read the article he sent OP to refute his point about poverty among \"Indians\". But yes, the point about 10 billionaires in a group of millions means poverty doesn't exist is a valid one.",
          "timestamp": "2022-05-08 14:21:38",
          "score": 5,
          "num_children": 1,
          "author": 360549,
          "replies": [
            {
              "id": "i7sztfg",
              "text": "can you please with you wealth of wisdom let me know how would any one confuse \"Native American\" with \"Indian?\". do you think and type or just type?",
              "timestamp": "2022-05-08 15:14:47",
              "score": -5,
              "num_children": 2,
              "author": 263221,
              "replies": [
                {
                  "id": "i7t57v9",
                  "text": "People who live in the past and still think of the two as synonymous?",
                  "timestamp": "2022-05-08 15:54:31",
                  "score": 4,
                  "num_children": 1,
                  "author": 66660,
                  "replies": [
                    {
                      "id": "i7tc7zo",
                      "text": "What you said is obsolutely true if the world only is US. but its not is it? for example a person from sri lanka will not know your dual name shenanigans. please just think outside of US. \n\nNote: i dont have any more patience to explain a simple thing here. if you think US=World and everyone should know what they fucking call what in US. then good luck with that. rest of the world doesnt have to know everything happens in US. you here is not u/Jitterbitten but anyone who dont understand what iam saying and moronically argues.",
                      "timestamp": "2022-05-08 16:45:29",
                      "score": -4,
                      "num_children": 0,
                      "author": 263221,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i7t5dim",
                  "text": "Native Americans were originally called \"Indians\" because Columbus or whoever was looking for a trade route to India when he discovered America.  He thought it was India at first I guess.\n\nThat usage is out of style in the US these days, but if someone is talking about Native Americans and at some point uses the word \"Indians\" it is not stupid or far fetched to assume they have not just suddenly switched the discussion to Asia.",
                  "timestamp": "2022-05-08 15:55:39",
                  "score": 3,
                  "num_children": 1,
                  "author": 340894,
                  "replies": [
                    {
                      "id": "i7tbjfo",
                      "text": "I know Dear god.\n\nwhat iam calling stupid is assuming \"Indians\" is only Patented for \"Native Americans\" and if any one that doesnt know the relation calling them stupid is STUPID is what iam saying. i dont know why you are giving speech about it. i know you know. that doesnt mean everyone should know about everything. if you dont get it. we dont have anything to discuss here.",
                      "timestamp": "2022-05-08 16:40:32",
                      "score": -1,
                      "num_children": 1,
                      "author": 263221,
                      "replies": [
                        {
                          "id": "i7tc8eu",
                          "text": "I don't get it.",
                          "timestamp": "2022-05-08 16:45:34",
                          "score": 1,
                          "num_children": 1,
                          "author": 340894,
                          "replies": [
                            {
                              "id": "i7tehqo",
                              "text": "Brother i will keep it very simple. i cant go beyond it. plz understand.\n\nX is a sri lankan, if he reads the authors book. if it is says \"Native Americans\" he will not get confused. for him \"Native Americans\" are \"Native Americans\"\n\nhowever if X reading book. if he sees \"Indians\"(out of context) his immediate understanding will always be \"People from India\". \n\nwith that in mind. if the author says \"North Americans\" clearly in his book. neither US citizens nor anyone in the world will not get confused.\n\nhowever if the author says \"Indians\" anyone who doesn't know the history and culture of America (but knows India from globe or other ways) may only think the word is referring to \"People of India\" which causing confusion.\n\ni hope you get it.\n\n&#x200B;\n\nlike in some other comment i dont know who but said, we dont know what author have written in book. based on what i have explained if the auther is written \"native americans\" there is no confusion. the confusion is there because of the word used is referring to two different things based on where you live. its basic logic.\n\n&#x200B;\n\nif you dont understand this also i dont know what to say. bye have  a nice day.",
                              "timestamp": "2022-05-08 17:01:47",
                              "score": -1,
                              "num_children": 0,
                              "author": 263221,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i7sq70s",
          "text": "Wut",
          "timestamp": "2022-05-08 13:59:37",
          "score": 4,
          "num_children": 0,
          "author": 341830,
          "replies": []
        },
        {
          "id": "i7txjuj",
          "text": "Do they have reservations in India that I don’t know about?",
          "timestamp": "2022-05-08 19:20:31",
          "score": 1,
          "num_children": 0,
          "author": 393802,
          "replies": []
        }
      ]
    },
    {
      "id": "i7sb5ca",
      "text": "Because you are probably insinuating/stating something about those poor native americans... so you don't seem to connect the dots? Pretty fucking easy to understand lol...",
      "timestamp": "2022-05-08 11:29:47",
      "score": -13,
      "num_children": 1,
      "replies": [
        {
          "id": "i7sk750",
          "text": "Well, my reading comprehension level is only average, but it sounds like the person was talking about how rough life is on a reservation here in America and the person that replied started talking about people on whole nother continent. \n\nI guess to me it’s pretty easy to understand that the person sending the link to billionaires in India was…well, so far off they landed on the wrong continent. It sounds like you’re on another continent too.",
          "timestamp": "2022-05-08 13:07:35",
          "score": 15,
          "num_children": 0,
          "author": 181847,
          "replies": []
        }
      ]
    },
    {
      "id": "i7shtz8",
      "text": "One little\nTwo little\nThree Indian billionaires...",
      "timestamp": "2022-05-08 12:44:42",
      "score": -6,
      "num_children": 0,
      "author": 389372,
      "replies": []
    },
    {
      "id": "i7sebod",
      "text": "actually hilarious troll...i hope",
      "timestamp": "2022-05-08 12:07:23",
      "score": -4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i7ssema",
      "text": "“your mom is a bad driver because she doesn’t drive the exact speedlimit exactly when the signs say said speedlimit” (as an excuse to explain why their driving is so shit",
      "timestamp": "2022-05-08 14:17:52",
      "score": -4,
      "num_children": 0,
      "author": 367284,
      "replies": []
    },
    {
      "id": "i7sv319",
      "text": "The person who sent him that article could also not be the best in English, for example in German native Americans used to be called \"Indianer\" and said person might have mixed it up or smthm there are also a lot of other languages with this or a similar name for native Americans.\n\nI don't think it was right to post it here",
      "timestamp": "2022-05-08 14:38:54",
      "score": -4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i7ti02y",
      "text": "So many people saying this race and this race...its the same for all races",
      "timestamp": "2022-05-08 17:26:48",
      "score": -4,
      "num_children": 0,
      "author": 197675,
      "replies": []
    },
    {
      "id": "i7tjqgs",
      "text": "WTF is this constantly getting reposted?",
      "timestamp": "2022-05-08 17:39:17",
      "score": -2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i7v14bd",
      "text": "🤦‍♀️",
      "timestamp": "2022-05-09 00:24:22",
      "score": 0,
      "num_children": 0,
      "author": 324146,
      "replies": []
    }
  ]
}