{
  "id": "umh98v",
  "text": "It would have been a nice heads up\n",
  "timestamp": "2022-05-10 12:11:43",
  "score": 127109,
  "subreddit": "t5_2r5rp",
  "num_children": 168,
  "author": 257134,
  "replies": [
    {
      "id": "i81x611",
      "text": "This literally happened to me with a coworker. \n\nHe was an older guy, retired USAF, and always made jokes. He never said a word about family, and then one day he croaked. \n\nMy manager and I show up to his funeral, walk in to pay our respects, turn around, and there he is, walking in the door.\n\nHis brother was just as funny as he was, and the funeral service was basically funny stories from their childhood and a farewell salute.",
      "timestamp": "2022-05-10 14:14:21",
      "score": 2939,
      "num_children": 5,
      "author": 123356,
      "replies": [
        {
          "id": "i82hkki",
          "text": "Almost the same thing as OP for me. I saw my grandad drive past me 2 weeks after his funeral. Thought I was tripping balls till I got home and my mum explained, they'd fallen out years before and they all pretended like he never existed.",
          "timestamp": "2022-05-10 16:29:56",
          "score": 803,
          "num_children": 1,
          "author": 307372,
          "replies": [
            {
              "id": "i82jdr7",
              "text": "I have to wonder if something like this happened with my dad. Met guy that had my dad’s middle name as his first name and my dad’s first name as his middle name. Spitting freaky image of my dad. Made the same noises. Same voice. That meeting was absolutely surreal and I had to stop myself from saying anything because he was all about the business and getting me out the door ASAP.\n\nE: there is some speculation with a fair amount of plausibility that my dad was adopted.",
              "timestamp": "2022-05-10 16:41:38",
              "score": 324,
              "num_children": 3,
              "author": 99272,
              "replies": [
                {
                  "id": "i83gahu",
                  "text": "So if he's your dad's twin, he's biologically a father and practically speaking an uncle? Wild",
                  "timestamp": "2022-05-10 20:21:51",
                  "score": 105,
                  "num_children": 1,
                  "author": 201257,
                  "replies": [
                    {
                      "id": "i846g7k",
                      "text": "Takes *father uncle* to a whole other level.",
                      "timestamp": "2022-05-10 23:26:45",
                      "score": 40,
                      "num_children": 1,
                      "author": 198452,
                      "replies": [
                        {
                          "id": "i869t1r",
                          "text": "Oscar bluth",
                          "timestamp": "2022-05-11 12:05:38",
                          "score": 2,
                          "num_children": 0,
                          "author": 406469,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i83p2p3",
                  "text": "Why don't you follow up? There's a bonkers documentary on Netflix about twins that were deliberately separated at birth for psychological experiments and there are still twins out there who are unaware. I'm not saying that's what happened in this instance but even generally twins were often separated to make it easier to find adoptive families.",
                  "timestamp": "2022-05-10 21:20:50",
                  "score": 60,
                  "num_children": 3,
                  "replies": [
                    {
                      "id": "i83vrhl",
                      "text": "I remember the triplets who went through that. It was so sad.",
                      "timestamp": "2022-05-10 22:07:53",
                      "score": 30,
                      "num_children": 0,
                      "author": 90980,
                      "replies": []
                    },
                    {
                      "id": "i83rhum",
                      "text": "This was about 6 years ago. My dad had already passed away well before my meeting him. I’m not in touch with any of my family that would know about it, if they are still alive. Plus the guy had already had a stroke so I doubt he is still around by now. Also, I dunno, it just doesn’t seem important enough to me put all that time and effort into. Family isn’t blood.",
                      "timestamp": "2022-05-10 21:37:33",
                      "score": 22,
                      "num_children": 1,
                      "author": 99272,
                      "replies": [
                        {
                          "id": "i84cxkl",
                          "text": "*blood isn't family",
                          "timestamp": "2022-05-11 00:15:30",
                          "score": 8,
                          "num_children": 0,
                          "author": 77123,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i872ezk",
                      "text": "Yeah, I think you're referring to *Three Identical Strangers,* about a set of identical triplets and several other sets of twins who were all deliberately separated from their siblings when they were six months old; they were then adopted into very different households as part of an experiment focusing on whether their different environments would be the major influence on their psycho-social development, or if their identical genetic profiles would ultimately be the major influence. Basically the \"nature vs. nurture\" issue. \n\n\nIt's such an interesting case, though. Like the triplets in that documentary just met one another completely by accident when they were in college, and then they eventually uncovered that they had been part of this wild study. Prior to that, they didn't even know that they were triplets or that they had any biological siblings at all. \n\nThe ethical ramifications of psycho-social experiments of that era were often extremely dubious, though, and that kind of experiment would *never* be permitted today, due to all of the ethical issues that were involved. Like the lack of informed consent; the fact that the true nature of the experiment was kept completely secret from *everyone;* the fact that none of the families were ever told that their kids were part of twin/triplet sets; the fact that the siblings were separated only *after* they had already bonded for several months; the fact that the adoption agency secretly conspired to orchestrate this study without ever even *attempting* (and certainly never intending) to place the twins/triplets together in a single adoptive household, which, if possible, would have obviously been in their best interest; the fact that when the agency was questioned later on, they continued to hide the existence of the experiment and lied about their own actions; the fact that *many* of these children had been born to parents who suffered from serious mental health issues, which is something that the researchers and adoption agency both deliberately hid from the adoptive families (possibly because they wanted to determine whether mental illness was learned or inherited); and then mental illnesses actually began to manifest in *most* of the children as they reached adolescence, with absolutely no warning, treatment, or guidance being offered on the part of the researchers (who were trained psychologists) or the adoption agency. \n\nThe biggest issue is just that the integrity of the experiment itself was basically prioritized over the welfare of those children, even as it became increasingly apparent that they were struggling. Even before the experiment was uncovered, when the kids were still teens/young adults, many of them had been admitted into psychiatric facilities for treatment (sometimes repeatedly), and *several* of them even ended up committing suicide. At some point when the kids were still very young, the researchers had actually noted (within their own research notes) that the early signs of mental illness were beginning to manifest among some of the children and that the parents did not seem to recognize those red flags -- and yet the researchers still deliberately chose *not* to alert the adoptive parents about those early warning signs of mental illness *and* they continued to hide the fact that the kids had a family history of mental illness (which the adoption agency also hid). If they *had* disclosed any of that information/context, and then attempted to provide some kind of treatment or guidance early on, then...who knows? It could have provided a better outcome for some of those kids.\n\nI think the documentary is on Hulu now btw, if anyone is interested. Sorry for the very long rant, I just think it's a really fascinating case for anyone interested in the ethics/history of psycho-social experiments and the roles of mental illness and family dynamics in the whole \"nature vs. nurture\" debate. I've discussed it in some of the anthropology/sociology courses that I've taught, and it was one of those \"what **NOT** to do\" cases that we presented as we were exploring the ethical considerations of human experiments. It's still a shame that the results of that study were never published or shared, though, and that the lead researcher had ordered that the files remain sealed for another 60 years after his death (so *no one* can gain access to them until like 2065). So the people who were unwittingly roped into this experiment and even suffered because of it can't even get any solid answers as to *why* the study was conducted in this way, what the ultimate goal and results really were, what it accomplished, or even *how many* twin/triplet sets were actually studied. It's just a wild story.",
                      "timestamp": "2022-05-11 15:33:58",
                      "score": 5,
                      "num_children": 0,
                      "author": 339811,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i863fjq",
                  "text": "Why wouldn't you say anything. The probability of meeting him again is almost nil and with coincidences like that I would've atleast tried to say something",
                  "timestamp": "2022-05-11 11:01:05",
                  "score": 1,
                  "num_children": 0,
                  "author": 201208,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i83inw6",
          "text": ">His brother was just as funny as he was\n\nSo then why did he not pretend to be him, smh.",
          "timestamp": "2022-05-10 20:37:36",
          "score": 33,
          "num_children": 1,
          "author": 230615,
          "replies": [
            {
              "id": "i83rnmv",
              "text": "ikr..? what i would do- get a second coffin, hide my deceased brother's coffin, lay in the 2nd coffin, and freak people the fuck out as they're paying respects.",
              "timestamp": "2022-05-10 21:38:43",
              "score": 25,
              "num_children": 1,
              "author": 143242,
              "replies": [
                {
                  "id": "i84rpf8",
                  "text": "\"Hey, you're late...\"",
                  "timestamp": "2022-05-11 02:07:29",
                  "score": 10,
                  "num_children": 0,
                  "author": 37962,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i84mno1",
          "text": "If I had a twine who died I would definitely show up late to their funeral, come through the door and shout \"Guys when I said \"if anyone needs me I'm gonna be dead on the couch\" I wasn't being literal!\" Or maybe something funnier. IDK I'm not a twine, let alone the funny one.",
          "timestamp": "2022-05-11 01:29:11",
          "score": 19,
          "num_children": 1,
          "author": 91719,
          "replies": [
            {
              "id": "i84qr78",
              "text": "You could just show up halfway through the funeral and shout “Am I late?“",
              "timestamp": "2022-05-11 02:00:14",
              "score": 19,
              "num_children": 1,
              "author": 123356,
              "replies": [
                {
                  "id": "i84qyke",
                  "text": "Ha!",
                  "timestamp": "2022-05-11 02:01:46",
                  "score": 4,
                  "num_children": 0,
                  "author": 91719,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i849p0b",
          "text": "A friend of mine’s father passed away and I went to support her. I walk in and saw his older and younger brothers and it was legit looking at the same face. It tripped me out so much.",
          "timestamp": "2022-05-10 23:51:10",
          "score": 6,
          "num_children": 0,
          "author": 38297,
          "replies": []
        },
        {
          "id": "i84jvo5",
          "text": "His names not landfill, it's Gil!",
          "timestamp": "2022-05-11 01:08:10",
          "score": 5,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i81mdlu",
      "text": "practice funeral",
      "timestamp": "2022-05-10 12:51:05",
      "score": 1227,
      "num_children": 4,
      "author": 172840,
      "replies": [
        {
          "id": "i81wpns",
          "text": "I had this Australian cattle dog for years, my kid grew up with her, she was very, very old and had basically gone crazy and would get lost all the time if you didn't keep tabs on her. So she had been having a bad go at things, and we were just trying to keep her comfortable in her old age. One day she got out, and, being she was sick and old and a farm dog, figured she just went off to die alone.\n\nThis is of course sad as I would have preferred to be with her in her final moments like most people would, and now I had to explain to my four year old what death was, all the stuff that goes along with it, etc.. He took it pretty well but was of course crying a lot of pretty sad for a few days.  Then as it does, it got better, we talked a lot about her and I had a ton of puppy photos of her on my computer and we'd sit and I'd show him photos and explain what was going on in them, then he'd draw pictures of her doing things in 'dog heaven' which is a concept he just sort of came up with, I never actually said she went to dog heaven but whatever, it's fine.\n\nWeek later I walk outside and she's just fucking standing on the back porch like nothing happened. SO after all this death talk, grieving, coping, moving on the only lesson he got out of this is \"hey sometimes they come back.\" Then she lived for another year and half barking at stationary objects not knowing what the fuck was going on but in generally good health. No idea where she was during that time, I looked everywhere for her too for like three days.",
          "timestamp": "2022-05-10 14:11:03",
          "score": 668,
          "num_children": 6,
          "author": 349257,
          "replies": [
            {
              "id": "i82z4jp",
              "text": "We have a community cat, a real con man, in my neighborhood named Manny. The people who live up behind us own Manny. One day Manny got hit and killed on the road, he was pretty mangled, and they had a big sad funeral with the kids crying and sad words said and they put him in the ground. While they were putting dirt in the hole Manny walked up. They still have no idea whose cat they buried.",
              "timestamp": "2022-05-10 18:28:02",
              "score": 139,
              "num_children": 4,
              "author": 98988,
              "replies": [
                {
                  "id": "i836gwa",
                  "text": "He still had 8 lives",
                  "timestamp": "2022-05-10 19:17:29",
                  "score": 64,
                  "num_children": 0,
                  "author": 38357,
                  "replies": []
                },
                {
                  "id": "i833cnt",
                  "text": "But... who the fuck is Mandy?",
                  "timestamp": "2022-05-10 18:56:34",
                  "score": 24,
                  "num_children": 0,
                  "author": 295662,
                  "replies": []
                },
                {
                  "id": "i84lnb0",
                  "text": "Same thing happened with an orange cat. I fed him because the neighbors who owned him didn’t take care of him. So I’m going out my door to find a dead cat that looked just like Tom laying on my porch. I had to call my boyfriend at the time to help bury him. Jump cut to the next day when I’m going on a date with said boyfriend and he’s like Tom? There the fat ass sat meowing for food.",
                  "timestamp": "2022-05-11 01:21:32",
                  "score": 5,
                  "num_children": 0,
                  "author": 349556,
                  "replies": []
                },
                {
                  "id": "i840b73",
                  "text": "Manny:  https://www.google.com/search?q=joseph+joestar+showing+up+at+his+own+funeral&oq=Joseph+Jostar+showinh+up+at+his+own+&aqs=chrome.1.69i57j33i10i160l5.22506j0j7&client=ms-android-cricket-us-revc&sourceid=chrome-mobile&ie=UTF-8#",
                  "timestamp": "2022-05-10 22:41:05",
                  "score": 1,
                  "num_children": 0,
                  "author": 384152,
                  "replies": []
                }
              ]
            },
            {
              "id": "i820hix",
              "text": "Pet Semetary without the Ancient Indian Burial Ground?",
              "timestamp": "2022-05-10 14:37:33",
              "score": 174,
              "num_children": 3,
              "replies": [
                {
                  "id": "i823zbu",
                  "text": "The person you put up there ain't the person that comes back. It may look like that person, but it ain't that person.",
                  "timestamp": "2022-05-10 15:01:00",
                  "score": 79,
                  "num_children": 1,
                  "author": 398118,
                  "replies": [
                    {
                      "id": "i827rrp",
                      "text": "Sometimes, dead is better.",
                      "timestamp": "2022-05-10 15:25:48",
                      "score": 53,
                      "num_children": 1,
                      "author": 352916,
                      "replies": [
                        {
                          "id": "i844mke",
                          "text": "🎶I don’t wanna be buried in Pet Cemetary, I don’t want to live my life again… oh no🎶",
                          "timestamp": "2022-05-10 23:13:03",
                          "score": 7,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i822c02",
                  "text": "I was thinking more elephant graveyard... \"goddammit Simba I said stay AWAY!\"",
                  "timestamp": "2022-05-10 14:49:59",
                  "score": 27,
                  "num_children": 0,
                  "author": 39148,
                  "replies": []
                },
                {
                  "id": "i87lns0",
                  "text": "\"Darling...\" she said in a gravelly voice.",
                  "timestamp": "2022-05-11 17:38:01",
                  "score": 2,
                  "num_children": 0,
                  "author": 10022,
                  "replies": []
                }
              ]
            },
            {
              "id": "i82xafm",
              "text": "Bruh that just fucking happened to me ten minutes ago. Mf was sitting on the porch with a goofy ass grin like we all didn’t grieve for almost forever",
              "timestamp": "2022-05-10 18:15:21",
              "score": 40,
              "num_children": 1,
              "author": 74995,
              "replies": [
                {
                  "id": "i850fxm",
                  "text": "Goofy ahh",
                  "timestamp": "2022-05-11 03:16:04",
                  "score": 0,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i86ih78",
                      "text": "Least unfunny preteen",
                      "timestamp": "2022-05-11 13:16:55",
                      "score": 1,
                      "num_children": 1,
                      "author": 74995,
                      "replies": [
                        {
                          "id": "i86info",
                          "text": "Hey why don’t you join the quadale dingle club 💀",
                          "timestamp": "2022-05-11 13:18:12",
                          "score": 0,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i899tyh",
                              "text": "I’d rather shoot myself",
                              "timestamp": "2022-05-12 00:36:04",
                              "score": 1,
                              "num_children": 1,
                              "author": 74995,
                              "replies": [
                                {
                                  "id": "i89ap8n",
                                  "text": "![gif](giphy|ujygH8l79xR9m|downsized)\n\nOk",
                                  "timestamp": "2022-05-12 00:42:32",
                                  "score": 0,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i833hwr",
              "text": "All I can think about when reading this is the Bring Out your Dead scene from The Holy [Grail](https://youtu.be/QcbR1J_4ICg). Kudos for not going this route 😊.",
              "timestamp": "2022-05-10 18:57:33",
              "score": 17,
              "num_children": 0,
              "author": 188277,
              "replies": []
            },
            {
              "id": "i82gevy",
              "text": "Easily solved problem had you been equipped with a pistol.",
              "timestamp": "2022-05-10 16:22:26",
              "score": 22,
              "num_children": 1,
              "author": 413081,
              "replies": [
                {
                  "id": "i82gv61",
                  "text": "Harsh, but morbidly funny.",
                  "timestamp": "2022-05-10 16:25:22",
                  "score": 14,
                  "num_children": 0,
                  "author": 285574,
                  "replies": []
                }
              ]
            },
            {
              "id": "i82uu1r",
              "text": "I honestly don't know how to feel for your dog's story.",
              "timestamp": "2022-05-10 17:58:58",
              "score": 9,
              "num_children": 0,
              "author": 131397,
              "replies": []
            }
          ]
        },
        {
          "id": "i83igof",
          "text": "Someone in my town hosted their funeral after they were diagnosed with a terminal illness.  Don't know how many showed up, as I didn't know them personally and didn't keep track of it.\n\nAnyways, sure enough, he passed away later that year.  I remember a couple people asking when the funeral will be held and them having to be reminded that he hosted it already earlier that year.",
          "timestamp": "2022-05-10 20:36:15",
          "score": 23,
          "num_children": 1,
          "author": 228309,
          "replies": [
            {
              "id": "i84venv",
              "text": "Lol if they're having a party in my name, might as well attend. Fantastic.",
              "timestamp": "2022-05-11 02:35:43",
              "score": 3,
              "num_children": 0,
              "author": 260265,
              "replies": []
            }
          ]
        },
        {
          "id": "i83cbyh",
          "text": "A *rehearsal*, if you will.",
          "timestamp": "2022-05-10 19:55:57",
          "score": 10,
          "num_children": 0,
          "author": 383034,
          "replies": []
        },
        {
          "id": "i82rshr",
          "text": "Damn, now I wish I had a twin",
          "timestamp": "2022-05-10 17:38:28",
          "score": 5,
          "num_children": 0,
          "author": 29796,
          "replies": []
        }
      ]
    },
    {
      "id": "i81mtg1",
      "text": "There's an old story about this happening. \n\nA 5 year old went to a funeral of a relative he hadn't met. When he was sat at the back of the room, an old geezer came over to him and said a few words (\"thank you for coming. It means a lot\" etc.) before leaving. When they later approached the open casket to pay respects, the deceased was the same bloke that had sat with him earlier! The kid was so spooked he didn't tell anyone what happened and he spent the next 30-odd years of his life believing he'd seen a ghost. \n\nAs an adult he finally sat down with his dad and told him what had happened. Turns out the deceased had an identical twin brother who had been at the funeral that day.",
      "timestamp": "2022-05-10 12:54:50",
      "score": 3673,
      "num_children": 9,
      "author": 71869,
      "replies": [
        {
          "id": "i8257pr",
          "text": "My father in law passed away not long ago. It was really sad, he was pretty young. It felt so strange to see his twin at the funeral even though we have met before because it was like seeing him again, and honestly they look so much alike that I still find it uncomfortable to meet him.",
          "timestamp": "2022-05-10 15:09:14",
          "score": 441,
          "num_children": 2,
          "author": 6922,
          "replies": [
            {
              "id": "i82ip9u",
              "text": "[deleted]",
              "timestamp": "2022-05-10 16:37:14",
              "score": 137,
              "num_children": 3,
              "replies": [
                {
                  "id": "i82q6fi",
                  "text": "Oof that must super suck.  Especially cause the one twin died of a genetic related disease and they share the same genes.",
                  "timestamp": "2022-05-10 17:27:25",
                  "score": 29,
                  "num_children": 1,
                  "author": 50696,
                  "replies": [
                    {
                      "id": "i84tyck",
                      "text": "r/cursedcomments?",
                      "timestamp": "2022-05-11 02:24:35",
                      "score": 2,
                      "num_children": 0,
                      "author": 223267,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i830o3e",
                  "text": "I always wonder how they live the rest of their lives",
                  "timestamp": "2022-05-10 18:38:31",
                  "score": 4,
                  "num_children": 0,
                  "author": 308561,
                  "replies": []
                },
                {
                  "id": "i82lg6m",
                  "text": "as a twin, you just go ahead and shut the fuck up.  i don’t even wanna think about it.\n\nso sorry for your loss.",
                  "timestamp": "2022-05-10 16:55:06",
                  "score": 60,
                  "num_children": 2,
                  "author": 289465,
                  "replies": [
                    {
                      "id": "i82w4oy",
                      "text": "as a non-twin, im more interested in why the profile pic is ray liotta.",
                      "timestamp": "2022-05-10 18:07:36",
                      "score": 13,
                      "num_children": 0,
                      "author": 82608,
                      "replies": []
                    },
                    {
                      "id": "i82wfte",
                      "text": "I always thought having a twin would be the coolest thing. That has to be very special bond that I can't imagine.",
                      "timestamp": "2022-05-10 18:09:37",
                      "score": 9,
                      "num_children": 0,
                      "author": 149141,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i82puaw",
              "text": "I feel like most twins go through a special sort of hell when their twin passes. You can’t look at them and not think about the other one. I can’t imagine how they feel at funerals, both as the surviving twin and as a grieving sibling.",
              "timestamp": "2022-05-10 17:25:07",
              "score": 36,
              "num_children": 2,
              "author": 154071,
              "replies": [
                {
                  "id": "i82w1em",
                  "text": "I’m not a twin but my sister’s death is one thing I truly fear. There’s a scene in one of my fave books (called Night Circus) where a sibling says something like ‘I’d rather lose a limb than my sister, so she could be here to tell me she’s finally the pretty one” and that sums it up so well for me. I am prepared to lose anything in my life before her. The world simply wouldn’t be the same without her. We live states apart and only see each other a few times a year, she’s terrible at returning phone calls and can anger me quicker than most anyone else - but she’s my other half.",
                  "timestamp": "2022-05-10 18:07:01",
                  "score": 21,
                  "num_children": 1,
                  "author": 169926,
                  "replies": [
                    {
                      "id": "i83c3wu",
                      "text": "I feel the same way about my sister. And I’m happy yours has you to love and care about her. I wish you both well and a long and happy life!",
                      "timestamp": "2022-05-10 19:54:29",
                      "score": 11,
                      "num_children": 0,
                      "author": 154071,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i857nb1",
                  "text": "This is a twin’s worst nightmare - that one will die and leave the other alone without them. Being an identical twin can be very stressful bc we do worry about our other half. \n\nYou come into being together, so being separated like that feels unnatural. I’m an identical twin.",
                  "timestamp": "2022-05-11 04:19:03",
                  "score": 5,
                  "num_children": 0,
                  "author": 228625,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i81usgw",
          "text": "I've read this so many times that I can cite it word to word in sleep",
          "timestamp": "2022-05-10 13:57:02",
          "score": 478,
          "num_children": 2,
          "author": 71175,
          "replies": [
            {
              "id": "i81zph8",
              "text": "… to what end? Is this now a traditional tale of your people?",
              "timestamp": "2022-05-10 14:32:13",
              "score": 196,
              "num_children": 3,
              "author": 37015,
              "replies": [
                {
                  "id": "i822m5f",
                  "text": "It's reddit copypasta",
                  "timestamp": "2022-05-10 14:51:52",
                  "score": 96,
                  "num_children": 4,
                  "author": 59601,
                  "replies": [
                    {
                      "id": "i8238cf",
                      "text": "Yes, it is the traditional tale of my people",
                      "timestamp": "2022-05-10 14:56:01",
                      "score": 88,
                      "num_children": 1,
                      "author": 283978,
                      "replies": [
                        {
                          "id": "i8249us",
                          "text": "My granmammy used to tell it to me.",
                          "timestamp": "2022-05-10 15:03:00",
                          "score": 25,
                          "num_children": 0,
                          "author": 141350,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i83pjec",
                      "text": "I saw the guy at a grocery store in Los Angeles yesterday. I told him how cool it was to meet him in person, but I didn’t want to be a douche and bother him and ask him for photos or anything.\n\nHe said, “Oh, like you’re doing now?”\n\nI was taken aback, and all I could say was “Huh?” but he kept cutting me off and going “huh? huh? huh?” and closing his hand shut in front of my face. I walked away and continued with my shopping, and I heard him chuckle as I walked off. When I came to pay for my stuff up front I saw him trying to walk out the doors with like fifteen Milky Ways in his hands without paying.\n\nThe girl at the counter was very nice about it and professional, and was like “Sir, you need to pay for those first.” At first he kept pretending to be tired and not hear her, but eventually turned back around and brought them to the counter.\n\nWhen she took one of the bars and started scanning it multiple times, he stopped her and told her to scan them each individually “to prevent any electrical infetterence,” and then turned around and winked at me. I don’t even think that’s a word. After she scanned each bar and put them in a bag and started to say the price, he kept interrupting her by yawning really loudly.",
                      "timestamp": "2022-05-10 21:23:57",
                      "score": 7,
                      "num_children": 0,
                      "author": 326665,
                      "replies": []
                    },
                    {
                      "id": "i82d0rq",
                      "text": "instant 1k upvotes you just have to be first",
                      "timestamp": "2022-05-10 16:00:16",
                      "score": 3,
                      "num_children": 1,
                      "author": 337861,
                      "replies": [
                        {
                          "id": "i82f7dj",
                          "text": "That's always the case tbf. If two people have the same idea for a comment, the first one to type it out gets the upvotes.",
                          "timestamp": "2022-05-10 16:14:38",
                          "score": 4,
                          "num_children": 1,
                          "author": 71869,
                          "replies": [
                            {
                              "id": "i82ttnt",
                              "text": "If reddit is going to be about regurgitating posts then just have bots do it",
                              "timestamp": "2022-05-10 17:52:10",
                              "score": 2,
                              "num_children": 1,
                              "author": 337861,
                              "replies": [
                                {
                                  "id": "i82u5eh",
                                  "text": "Agreed. I didn't realise there was a copypasta that says the same story as my comment. I was just telling a story that I'd heard.",
                                  "timestamp": "2022-05-10 17:54:21",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 71869,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i823mpt",
                      "text": "lakxxya's comment or mine?",
                      "timestamp": "2022-05-10 14:58:42",
                      "score": 2,
                      "num_children": 0,
                      "author": 71869,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i82fr2u",
                  "text": ">your people\n\nIt's traditional tale of reddit. So our people. You included. If you don't tell it to your kids at least once in their lives, I'm coming to haunt you.",
                  "timestamp": "2022-05-10 16:18:12",
                  "score": 7,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "i8240c7",
                  "text": "Where's an award when ya need it?",
                  "timestamp": "2022-05-10 15:01:12",
                  "score": 1,
                  "num_children": 0,
                  "author": 23376,
                  "replies": []
                }
              ]
            },
            {
              "id": "i82bh7s",
              "text": "Glad you enjoyed it.",
              "timestamp": "2022-05-10 15:50:13",
              "score": 1,
              "num_children": 0,
              "author": 71869,
              "replies": []
            }
          ]
        },
        {
          "id": "i826rk6",
          "text": "and that little boy? Adolf Hitler.",
          "timestamp": "2022-05-10 15:19:10",
          "score": 38,
          "num_children": 1,
          "author": 377062,
          "replies": [
            {
              "id": "i82p1gk",
              "text": "The guy who killed Hitler?",
              "timestamp": "2022-05-10 17:19:40",
              "score": 5,
              "num_children": 1,
              "author": 2082,
              "replies": [
                {
                  "id": "i82tmrt",
                  "text": "Naw…he’s the guy who killed the guy who killed hitler",
                  "timestamp": "2022-05-10 17:50:54",
                  "score": 4,
                  "num_children": 2,
                  "author": 14004,
                  "replies": [
                    {
                      "id": "i82uqlb",
                      "text": "What a scummy thing to do. I hope some hero stepped up and put an end to him.",
                      "timestamp": "2022-05-10 17:58:20",
                      "score": 3,
                      "num_children": 1,
                      "author": 71869,
                      "replies": [
                        {
                          "id": "i82zsos",
                          "text": "Wait, I thought he's the guy who killed the guy who killed the guy who killed Hitler?",
                          "timestamp": "2022-05-10 18:32:34",
                          "score": 1,
                          "num_children": 0,
                          "author": 343641,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i83b680",
                      "text": ">heads up\n\nI always thought hitler was the guy who killed hitler...",
                      "timestamp": "2022-05-10 19:48:26",
                      "score": 2,
                      "num_children": 0,
                      "author": 259643,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i835v79",
          "text": "That’s an unintentional long con.",
          "timestamp": "2022-05-10 19:13:24",
          "score": 4,
          "num_children": 0,
          "author": 94399,
          "replies": []
        },
        {
          "id": "i83g3ms",
          "text": "Showing dead people to 5-year olds are sick. To be honest open casket is sick in general.",
          "timestamp": "2022-05-10 20:20:40",
          "score": 3,
          "num_children": 1,
          "author": 11659,
          "replies": [
            {
              "id": "i84y5oy",
              "text": "My grandma passed a few years back and I didn't take my five year old up to the casket, but the grandkids were pallbearers (including me). My kid goes, \"what's in that big box?\" And me, not knowing what to say, I said \"my grandma\".\n\nShit got real for her real quick. I saw the realization cross her face in real time. I didn't handle it the best, but I didn't know what else to say, and I feel like truth is always the best option. Death is a part of life.",
              "timestamp": "2022-05-11 02:57:11",
              "score": 2,
              "num_children": 0,
              "author": 260265,
              "replies": []
            }
          ]
        },
        {
          "id": "i824p77",
          "text": "Who thanks a 5 year old for coming? It's not like it was the 5 year old's decision.",
          "timestamp": "2022-05-10 15:05:48",
          "score": 23,
          "num_children": 10,
          "author": 166972,
          "replies": [
            {
              "id": "i82h1me",
              "text": "Wasn't 5 when this happened (17 or so) but I have an amusing anecdote.\n\nWhen my birth father died (tl;dr, grew up knowing him as my uncle, didn't find out until years after), his ex-wife asked my parents (His brother) if they could host the wake at their house since it was so close to the cemetary.\n\nDuring the wake I came downstairs from my room to get a drink from the fridge, his ex-wife came up to me and grasped my hands and profusely thanked me (LIke she had for every one else) for coming to the wake. I was taken aback and just blurted out \"I um, live here. I didn't technically have a choice\"\n\nShe laughed and thanked me anyway. Seemed to be the only laugh she had that day.",
              "timestamp": "2022-05-10 16:26:32",
              "score": 27,
              "num_children": 0,
              "author": 136206,
              "replies": []
            },
            {
              "id": "i825xrh",
              "text": "[deleted]",
              "timestamp": "2022-05-10 15:14:00",
              "score": 63,
              "num_children": 1,
              "replies": [
                {
                  "id": "i82ge5z",
                  "text": "In my book, everyone gets a pass for the awkward things they say at funerals.",
                  "timestamp": "2022-05-10 16:22:19",
                  "score": 22,
                  "num_children": 0,
                  "author": 127354,
                  "replies": []
                }
              ]
            },
            {
              "id": "i82iznv",
              "text": "“Wait, so they forced you to go?” \n\nYeah, I was five, I was forced to go everywhere. No kid is just going to church!",
              "timestamp": "2022-05-10 16:39:08",
              "score": 13,
              "num_children": 0,
              "author": 141161,
              "replies": []
            },
            {
              "id": "i826dqs",
              "text": "Fair point. I couldn't remember how the story went at that point, just remembered that he'd said something to the kid. Now I think about it when I first heard the story he'd said something like \"cherish your youth while you still have it. Life is short\" or something like that. Something that could equally be said by an old guy or a spooky ghost anyway.",
              "timestamp": "2022-05-10 15:16:35",
              "score": 10,
              "num_children": 0,
              "author": 71869,
              "replies": []
            },
            {
              "id": "i825sqi",
              "text": "It's just polite and nice for the kid, like thanking a bus driver. Don't overthink it",
              "timestamp": "2022-05-10 15:13:07",
              "score": 30,
              "num_children": 0,
              "author": 176079,
              "replies": []
            },
            {
              "id": "i82drem",
              "text": "Why the fuck redditors always bitch about the most mundane things???",
              "timestamp": "2022-05-10 16:05:05",
              "score": 19,
              "num_children": 0,
              "author": 335195,
              "replies": []
            },
            {
              "id": "i82gt9r",
              "text": "Inclusion. Don’t treat kids as stupid remote controlled offsprings of someone you don’t care about",
              "timestamp": "2022-05-10 16:25:02",
              "score": 3,
              "num_children": 0,
              "author": 8835,
              "replies": []
            },
            {
              "id": "i829ny5",
              "text": "Hmmm but what got me thinking is, was it his Twin who thanked him????",
              "timestamp": "2022-05-10 15:38:20",
              "score": 5,
              "num_children": 0,
              "author": 1499,
              "replies": []
            },
            {
              "id": "i82a3rm",
              "text": "The guy is obviously trying to have fun and freak someone out. Adults probably know who he is. Teens might know who he is and probably will figure out that he’s joking. Kids however, don’t really think things out or ask pointed questions they are a perfect target for those wanting to mess with somebody.",
              "timestamp": "2022-05-10 15:41:12",
              "score": -1,
              "num_children": 0,
              "author": 219400,
              "replies": []
            },
            {
              "id": "i82bg6g",
              "text": "maybe not the 5yo but the parents who more than likely accompany him?",
              "timestamp": "2022-05-10 15:50:02",
              "score": -1,
              "num_children": 0,
              "author": 62315,
              "replies": []
            }
          ]
        },
        {
          "id": "i82jjrc",
          "text": "You just explained the post but in a fictionalized way.",
          "timestamp": "2022-05-10 16:42:43",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "i82kqrb",
              "text": "More or less yeah. The post reminded me of a story I'd been told so I added in the extra details.",
              "timestamp": "2022-05-10 16:50:29",
              "score": 1,
              "num_children": 0,
              "author": 71869,
              "replies": []
            }
          ]
        },
        {
          "id": "i85h8v3",
          "text": "[deleted]",
          "timestamp": "2022-05-11 06:01:28",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "i85u2ew",
              "text": "It's similar but I thought it was different enough to be worth commenting.",
              "timestamp": "2022-05-11 08:56:04",
              "score": 1,
              "num_children": 0,
              "author": 71869,
              "replies": []
            }
          ]
        },
        {
          "id": "i82doji",
          "text": "[removed]",
          "timestamp": "2022-05-10 16:04:33",
          "score": -1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i81ielm",
      "text": "![gif](giphy|y1ewxG8aFWk0M)",
      "timestamp": "2022-05-10 12:15:41",
      "score": 1335,
      "num_children": 9,
      "author": 148565,
      "replies": [
        {
          "id": "i81t912",
          "text": "This is the only answer",
          "timestamp": "2022-05-10 13:45:35",
          "score": 126,
          "num_children": 0,
          "author": 321865,
          "replies": []
        },
        {
          "id": "i81zpi7",
          "text": "An old man with severe injuries",
          "timestamp": "2022-05-10 14:32:14",
          "score": 38,
          "num_children": 0,
          "author": 18377,
          "replies": []
        },
        {
          "id": "i826nr9",
          "text": "Classic, thriller bark",
          "timestamp": "2022-05-10 15:18:29",
          "score": 24,
          "num_children": 0,
          "author": 368044,
          "replies": []
        },
        {
          "id": "i81ldes",
          "text": "LMAOOO",
          "timestamp": "2022-05-10 12:42:30",
          "score": 182,
          "num_children": 1,
          "author": 192731,
          "replies": [
            {
              "id": "i81p0qh",
              "text": "[removed]",
              "timestamp": "2022-05-10 13:12:48",
              "score": 54,
              "num_children": 2,
              "replies": [
                {
                  "id": "i823mjy",
                  "text": "stay down this time",
                  "timestamp": "2022-05-10 14:58:40",
                  "score": 11,
                  "num_children": 0,
                  "author": 398118,
                  "replies": []
                },
                {
                  "id": "i82u393",
                  "text": "You're a bot copying other comments, aren't you?",
                  "timestamp": "2022-05-10 17:53:56",
                  "score": 6,
                  "num_children": 1,
                  "author": 273922,
                  "replies": [
                    {
                      "id": "i83e2uf",
                      "text": "Of course it is. If the user name alone didn't give it away...",
                      "timestamp": "2022-05-10 20:07:20",
                      "score": 1,
                      "num_children": 0,
                      "author": 324739,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i8240e5",
          "text": "This and the Zombie dog “*yosh, yosh*” lol I love luffy",
          "timestamp": "2022-05-10 15:01:13",
          "score": 15,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i822nqi",
          "text": "Don't underestimate ~~zombies~~ grandpas.",
          "timestamp": "2022-05-10 14:52:10",
          "score": 10,
          "num_children": 0,
          "author": 171129,
          "replies": []
        },
        {
          "id": "i82ctu9",
          "text": "One of the best scenes in OP hands down",
          "timestamp": "2022-05-10 15:59:01",
          "score": 8,
          "num_children": 0,
          "author": 132686,
          "replies": []
        },
        {
          "id": "i83vadf",
          "text": "Classic Luffy moment. It's also not something I've seen done before as a first attempt at preventing a zombie outbreak lol",
          "timestamp": "2022-05-10 22:04:25",
          "score": 3,
          "num_children": 0,
          "author": 178952,
          "replies": []
        },
        {
          "id": "i82t9p3",
          "text": "What is the context of this gif?",
          "timestamp": "2022-05-10 17:48:30",
          "score": 2,
          "num_children": 1,
          "author": 154843,
          "replies": [
            {
              "id": "i82tth4",
              "text": "It’s from the anime “One Piece”. The main character and his crew landed on a new island filled with zombies. When the crew captain Luffy saw the zombie leaving the grave, he casually walked to it and put it back in. I think this was his first encounter with a zombies on that island too, which made it even funnier IMO.",
              "timestamp": "2022-05-10 17:52:08",
              "score": 10,
              "num_children": 0,
              "author": 317088,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i81mqcb",
      "text": "I saw a video of this kid about two yo who is suddenly faced with his dad and dads identical twin for the first time.  All he keeps saying is what the hell but it gets louder and louder. One of my fave videos.  This must have been weird for grandpa too.",
      "timestamp": "2022-05-10 12:54:06",
      "score": 567,
      "num_children": 5,
      "author": 54793,
      "replies": [
        {
          "id": "i81o107",
          "text": "There's one where a baby is being held by one twin, then whenever they're handed off they reach for the other one, over and over.",
          "timestamp": "2022-05-10 13:04:48",
          "score": 265,
          "num_children": 3,
          "author": 250734,
          "replies": [
            {
              "id": "i82jcpm",
              "text": "[This little guy?](https://youtu.be/y2004Xaz2HU)\n\n[I also like this one](https://youtu.be/-EzuH2Z4YeM)",
              "timestamp": "2022-05-10 16:41:27",
              "score": 42,
              "num_children": 1,
              "author": 160687,
              "replies": [
                {
                  "id": "i84z0wi",
                  "text": "I hadn't seen that second one. The kid is more aware, and you can tell her mind is blown.\n\nMy husband has identical twin sisters, I should ask if their kids reacted like this. I know my own kids were super confused that there were two aunts that were the same.",
                  "timestamp": "2022-05-11 03:04:08",
                  "score": 7,
                  "num_children": 0,
                  "author": 260265,
                  "replies": []
                }
              ]
            },
            {
              "id": "i81y4sq",
              "text": "tl;dw\n\n\"Mommy's got me I'm cool... wait, that's mommy over there? Then who the fuck is holding me?!\" *reaches, cries and screams*\n\nRepeat ad infinitum, that shit's hilarious.",
              "timestamp": "2022-05-10 14:21:11",
              "score": 114,
              "num_children": 1,
              "author": 331188,
              "replies": [
                {
                  "id": "i8290z3",
                  "text": "And then for the rest of their life: \"do I live with my true mom now or the impostor?\".",
                  "timestamp": "2022-05-10 15:34:06",
                  "score": 22,
                  "num_children": 1,
                  "author": 398179,
                  "replies": [
                    {
                      "id": "i82ozap",
                      "text": "Can't even do a maternity test to find out the truth!",
                      "timestamp": "2022-05-10 17:19:15",
                      "score": 6,
                      "num_children": 0,
                      "author": 96733,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i81wbgs",
              "text": "Yes!  I saw this! It kind of made me uncomfortable after a few times I just was like is this right?",
              "timestamp": "2022-05-10 14:08:14",
              "score": 18,
              "num_children": 0,
              "author": 54793,
              "replies": []
            }
          ]
        },
        {
          "id": "i8213xt",
          "text": "The audio is a actually a tiktok sound from another little girl saying what the hell. The video is still very cute",
          "timestamp": "2022-05-10 14:41:46",
          "score": 31,
          "num_children": 2,
          "author": 151850,
          "replies": [
            {
              "id": "i827pyd",
              "text": "Aw man thats a bummer but it doesn’t surprise me because I thought the kid weirdly had a real future in ventriloquism.  I thought well, I guess somebody has to!",
              "timestamp": "2022-05-10 15:25:28",
              "score": 3,
              "num_children": 0,
              "author": 54793,
              "replies": []
            },
            {
              "id": "i824taq",
              "text": "ive never understood tiktok/musically's while thing with just slapping another videos sound on your own. like why",
              "timestamp": "2022-05-10 15:06:35",
              "score": 4,
              "num_children": 1,
              "author": 400401,
              "replies": [
                {
                  "id": "i827wsn",
                  "text": "It's literally the same idea as image macros but with sounds. The sound conveys a feeling  (the image) and the video gives context (the impact font text).",
                  "timestamp": "2022-05-10 15:26:44",
                  "score": 8,
                  "num_children": 0,
                  "author": 365430,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i81omtx",
          "text": "A 2 y/o repeatedly saying what the hell would have me rolling",
          "timestamp": "2022-05-10 13:09:42",
          "score": 27,
          "num_children": 2,
          "author": 298440,
          "replies": [
            {
              "id": "i81yaba",
              "text": "[This](https://www.youtube.com/watch?v=aqgsH3af8wI) is a composite of three. The middle one has the \"What the hell\" kid.",
              "timestamp": "2022-05-10 14:22:16",
              "score": 34,
              "num_children": 2,
              "author": 62181,
              "replies": [
                {
                  "id": "i82o6yq",
                  "text": "I can’t help but feel like they put audio of some other kid saying “what the hell” over that clip. Idk, the audio just doesn’t match the video. Like the kid isn’t moving their mouth at all, and you can clearly see other kids fidgeting on the table and other people doing stuff in the room but there’s no ambient noise",
                  "timestamp": "2022-05-10 17:13:45",
                  "score": 9,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "i82xk9z",
                      "text": "[original video ](https://youtu.be/mjcTKZf8l1M)",
                      "timestamp": "2022-05-10 18:17:11",
                      "score": 8,
                      "num_children": 0,
                      "author": 134480,
                      "replies": []
                    },
                    {
                      "id": "i82tawg",
                      "text": "I agree it doesn’t look like that kid is talking at all. I’m not sure why mom would say stop like that if they weren’t though?",
                      "timestamp": "2022-05-10 17:48:43",
                      "score": 2,
                      "num_children": 1,
                      "author": 307989,
                      "replies": [
                        {
                          "id": "i82zx6m",
                          "text": "Someone else linked the original audio in another reply\n\nIt was a kid saying what the hell to a dog lol the other video just copied it to make theirs funnier",
                          "timestamp": "2022-05-10 18:33:23",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i82i4kh",
                  "text": "That was hilarious, thank you!",
                  "timestamp": "2022-05-10 16:33:31",
                  "score": 2,
                  "num_children": 0,
                  "author": 186987,
                  "replies": []
                }
              ]
            },
            {
              "id": "i81wgpa",
              "text": "I bet it’s on YouTube if you just search for kid what the hell twin or something like that twin dads.",
              "timestamp": "2022-05-10 14:09:16",
              "score": 4,
              "num_children": 0,
              "author": 54793,
              "replies": []
            }
          ]
        },
        {
          "id": "i81y1t2",
          "text": "*uncle grandpa",
          "timestamp": "2022-05-10 14:20:37",
          "score": 5,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i830zo6",
          "text": "my dad-in-law is a identical twin. we told our kid that grandpa is a clone.",
          "timestamp": "2022-05-10 18:40:40",
          "score": 1,
          "num_children": 1,
          "author": 382409,
          "replies": [
            {
              "id": "i8336y8",
              "text": "Did they know what a clone was?  Do you remember meeting or seeing them together for the first time?",
              "timestamp": "2022-05-10 18:55:31",
              "score": 2,
              "num_children": 1,
              "author": 54793,
              "replies": [
                {
                  "id": "i83gkcp",
                  "text": "my kid has seen star wars enough to know what a clone was when they were younger. the r/PrequelMemes are stronk in meine Haus.",
                  "timestamp": "2022-05-10 20:23:38",
                  "score": 2,
                  "num_children": 1,
                  "author": 382409,
                  "replies": [
                    {
                      "id": "i83jvxy",
                      "text": "Oh yeah.  Forgot about clones in star wars.  Was thinking clones in Orphan Black.",
                      "timestamp": "2022-05-10 20:45:41",
                      "score": 2,
                      "num_children": 0,
                      "author": 54793,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i81oomg",
      "text": "I feel you\\^\\^ Same thing happened with my grand-dad. I knew he had a brother, but no one told me he was an identical twin... \n\nHad a pretty weird moment when I was at my grand-pa's funeral and my grand-pa walks by...",
      "timestamp": "2022-05-10 13:10:06",
      "score": 94,
      "num_children": 1,
      "author": 365209,
      "replies": [
        {
          "id": "i82nxad",
          "text": "Why do people act like it's so rare to have an identical twin? ^^' I don't get it",
          "timestamp": "2022-05-10 17:11:54",
          "score": -12,
          "num_children": 4,
          "author": 12249,
          "replies": [
            {
              "id": "i82p96a",
              "text": "because it's rare",
              "timestamp": "2022-05-10 17:21:05",
              "score": 21,
              "num_children": 0,
              "author": 380633,
              "replies": []
            },
            {
              "id": "i82p6fm",
              "text": "Because they literally are",
              "timestamp": "2022-05-10 17:20:34",
              "score": 13,
              "num_children": 1,
              "author": 87303,
              "replies": [
                {
                  "id": "i82rpdw",
                  "text": "No? I'm a twin and I know 5 more twins",
                  "timestamp": "2022-05-10 17:37:54",
                  "score": -7,
                  "num_children": 2,
                  "author": 12249,
                  "replies": [
                    {
                      "id": "i82yi2m",
                      "text": "I’m a non-twin and have never met a twin in my life",
                      "timestamp": "2022-05-10 18:23:39",
                      "score": 12,
                      "num_children": 2,
                      "author": 74995,
                      "replies": [
                        {
                          "id": "i83ca3b",
                          "text": "Now that seems even  more rare lol",
                          "timestamp": "2022-05-10 19:55:36",
                          "score": 4,
                          "num_children": 0,
                          "author": 12249,
                          "replies": []
                        },
                        {
                          "id": "i838yop",
                          "text": "Really? That's very surprising.",
                          "timestamp": "2022-05-10 19:33:54",
                          "score": 2,
                          "num_children": 0,
                          "author": 257047,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i832mxz",
                      "text": "“It is estimated that 1 in 250 natural pregnancies will naturally result in twins.”\nI don’t doubt your story but your situation is just a statistical anomaly",
                      "timestamp": "2022-05-10 18:51:47",
                      "score": 5,
                      "num_children": 1,
                      "author": 87303,
                      "replies": [
                        {
                          "id": "i83bvpr",
                          "text": "Yeah but in this context the chances to see a ghost are more rare :)",
                          "timestamp": "2022-05-10 19:52:58",
                          "score": -2,
                          "num_children": 0,
                          "author": 12249,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i82pjju",
              "text": "Because it is rare",
              "timestamp": "2022-05-10 17:23:04",
              "score": 2,
              "num_children": 1,
              "author": 78736,
              "replies": [
                {
                  "id": "i82rlnh",
                  "text": "Yeah but not as rare as to be surprised everytime you see one...",
                  "timestamp": "2022-05-10 17:37:11",
                  "score": 0,
                  "num_children": 1,
                  "author": 12249,
                  "replies": [
                    {
                      "id": "i82uvxw",
                      "text": "In this context it’s about seeing an identical twin you didn’t know about. Which is unusual",
                      "timestamp": "2022-05-10 17:59:19",
                      "score": 10,
                      "num_children": 1,
                      "author": 78736,
                      "replies": [
                        {
                          "id": "i847zde",
                          "text": "I don't know what's so hard for people to grasp about this concept.\n\nSeeing an identical twin you didn't know about surprises everyone.\n\nSeeing a random pair of identical twins in the street? No one cares.",
                          "timestamp": "2022-05-10 23:38:20",
                          "score": 4,
                          "num_children": 0,
                          "author": 364044,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i831wql",
              "text": "sure its not unheard of, but it would have been nice to know about it beforehand so I don't suspect there's a ghost walking there... I was 12 and no one had bothered to warn me that the Great-Uncle (whom I had NEVER met before due to him living far away) I have looks EXACTLY like my dead grandfather whom I had seen in the casket not 10 minutes prior\\^\\^",
              "timestamp": "2022-05-10 18:46:51",
              "score": 1,
              "num_children": 1,
              "author": 365209,
              "replies": [
                {
                  "id": "i83c86k",
                  "text": "Hmm maybe i just can't follow your situation... Since I'm a twin I probably would have thought of that option first since I'm always in touch with that kind of thing ^^'",
                  "timestamp": "2022-05-10 19:55:16",
                  "score": 1,
                  "num_children": 1,
                  "author": 12249,
                  "replies": [
                    {
                      "id": "i83s5cx",
                      "text": "Probably\\^\\^ For you its normal to think of a twin first, but if you never had a twin yourself and were never told that there was one, it is kinda weird to see a (to you) \"Dead\" person walking by\\^\\^",
                      "timestamp": "2022-05-10 21:42:08",
                      "score": 1,
                      "num_children": 0,
                      "author": 365209,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i81ygiq",
      "text": "My aunt is a twin and I found out by having her twin sister come to the door looking for her.  I knew my aunt was inside the house, but there she was standing on the doorstep asking if she was inside.  I don’t think confusion adequately describes how I felt.",
      "timestamp": "2022-05-10 14:23:29",
      "score": 56,
      "num_children": 1,
      "author": 210363,
      "replies": [
        {
          "id": "i836fna",
          "text": "Reminds me of those Short horror stories, I was you in your place i would have started freaking out",
          "timestamp": "2022-05-10 19:17:15",
          "score": 2,
          "num_children": 0,
          "author": 65011,
          "replies": []
        }
      ]
    },
    {
      "id": "i81mj8g",
      "text": "It would've made for an even nicer experience if no one had told him afterwards about the twin thing....",
      "timestamp": "2022-05-10 12:52:25",
      "score": 169,
      "num_children": 1,
      "author": 286174,
      "replies": [
        {
          "id": "i81np2q",
          "text": "Son, Grampa is the Messiah.",
          "timestamp": "2022-05-10 13:02:09",
          "score": 45,
          "num_children": 0,
          "author": 133125,
          "replies": []
        }
      ]
    },
    {
      "id": "i81y1rf",
      "text": "LoL!\n\nI have the same name as my grandfather. My grandma, had submitted his name to a specail mass at church where they preyed for those that past. His name was read out loud as someone who had died. \n\nQue to me standing in line at dunkin donuts. I hear \"Charlie!!! OH MY GOD YOUR ALIVE!\" \"They announced your death in church!\" Its an old friends mother, she was beside herself in shock. pretty funny shit.",
      "timestamp": "2022-05-10 14:20:36",
      "score": 45,
      "num_children": 1,
      "author": 55018,
      "replies": [
        {
          "id": "i822m29",
          "text": "My father was Robert jr. his dad obviously was sr. Sr had a cousin named Robert. All same last name. All 3 died within a year. Was never so glad that I wasn’t Robert III.",
          "timestamp": "2022-05-10 14:51:51",
          "score": 19,
          "num_children": 0,
          "author": 171540,
          "replies": []
        }
      ]
    },
    {
      "id": "i81umrz",
      "text": "Shortly right after my dad passed, my mom took over his phone and called me from it. Too soon…",
      "timestamp": "2022-05-10 13:55:52",
      "score": 29,
      "num_children": 1,
      "author": 147714,
      "replies": [
        {
          "id": "i824bhb",
          "text": "mom knew what she was doing",
          "timestamp": "2022-05-10 15:03:17",
          "score": 8,
          "num_children": 0,
          "author": 398118,
          "replies": []
        }
      ]
    },
    {
      "id": "i81xrpw",
      "text": "My great grandmother had several sisters. They all looked almost identical. The day of her funeral one opened the door to her house. I nearly joined her that day. Still sends shivers thinking about it.",
      "timestamp": "2022-05-10 14:18:40",
      "score": 28,
      "num_children": 1,
      "author": 72637,
      "replies": [
        {
          "id": "i83cyn0",
          "text": "I  have a reverse version of this story. My grandmother passed and all her siblings came into town. After the service, one of her brothers was just staring at me. I asked him about it and apparently I look so much like my grandmother that it unnerved him a bit.",
          "timestamp": "2022-05-10 20:00:03",
          "score": 10,
          "num_children": 0,
          "author": 75397,
          "replies": []
        }
      ]
    },
    {
      "id": "i826xbb",
      "text": "So not a twin, just a sibling, but my maternal grandfather died in 2011. A few years after that, I was running errands with my mother, and I about had a heart attack in the post office because standing in line in front of us was a man who looked exactly like my grandfather. I pointed this oddity out to my mother who proceeded to initiate a friendly, light-hearted conversation with this doppelganger who is my grandfather's brother. Despite living in the same town and getting along, my grandparents and parents never introduced him to myself or my siblings nor did they ever mention that my grandfather and his brother look eerily similar. I took a picture to show my siblings and cousins and they were all likewise flabbergasted. To this day whenever someone brings it up, my mother says, \"I don't know what the big deal is, you knew your grandfather was dead.\" Like, yes. Exactly. That's why it's such a big deal. I don't often see ghosts at the post office.",
      "timestamp": "2022-05-10 15:20:13",
      "score": 20,
      "num_children": 0,
      "author": 307361,
      "replies": []
    },
    {
      "id": "i81otlo",
      "text": "My grandfather had an identical twin. They both married and the wives hated each other. I never met this man nor knew of his existence. \n\nIn my 20s I worked at a high school for 5 years to help pay rent while I went to college. One of the teachers made a comment about my last name but never elaborated. \n\nA few years later my sister gets a message on facebook from someone about being related. They wound up talking about family and came to talking about me. The relative is like “oh yeah, I have a niece who works at that school.”  \n\nI go to work that day none the wiser and the teacher says to me “hey cuz.”  She proceeded to explain how we were related. All I could say was “thank god we didn’t sleep with each other.”  \n\nGenetically she is my first cousin with the grandfather being an identical twin.",
      "timestamp": "2022-05-10 13:11:13",
      "score": 118,
      "num_children": 3,
      "author": 326567,
      "replies": [
        {
          "id": "i81vste",
          "text": ">In my 20s I worked at a high school for 5 years to help pay rent while I went to college.\n\nThis sentence somehow broke my brain.",
          "timestamp": "2022-05-10 14:04:29",
          "score": 69,
          "num_children": 3,
          "author": 135278,
          "replies": [
            {
              "id": "i81wd18",
              "text": "Yes. I think I tried to avoid having too many sentences. Clearly that is a lot to digest lol.",
              "timestamp": "2022-05-10 14:08:32",
              "score": 21,
              "num_children": 2,
              "author": 326567,
              "replies": [
                {
                  "id": "i82694d",
                  "text": "[deleted]",
                  "timestamp": "2022-05-10 15:15:42",
                  "score": 12,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "i82egbo",
                  "text": "so you didnt bang that chick?",
                  "timestamp": "2022-05-10 16:09:40",
                  "score": 3,
                  "num_children": 1,
                  "author": 22742,
                  "replies": [
                    {
                      "id": "i82etok",
                      "text": "Nah. I had a girlfriend at the time that I wound up marrying. She was/is married too. We couldn’t make it work out.",
                      "timestamp": "2022-05-10 16:12:06",
                      "score": 3,
                      "num_children": 0,
                      "author": 326567,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i820k8t",
              "text": "When I was walking my dog I had money in the pocket of the pants my cousin who was living in Oregon at the time where they were staying with an old friend got me for work so they wouldn’t feel bad anymore they forgot my birthday last year and a penny fell out because the pocket had a hole in the shape of Rhode Island and my dog caught it in his mouth.",
              "timestamp": "2022-05-10 14:38:05",
              "score": 9,
              "num_children": 1,
              "author": 37015,
              "replies": [
                {
                  "id": "i82gr9k",
                  "text": "What the fuck did I just read",
                  "timestamp": "2022-05-10 16:24:40",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "i826o2h",
              "text": "[deleted]",
              "timestamp": "2022-05-10 15:18:32",
              "score": 2,
              "num_children": 1,
              "replies": [
                {
                  "id": "i827346",
                  "text": "Yeah, and so many of the details are completely irrelevant to the story. “I once worked with somebody“ would’ve covered it.",
                  "timestamp": "2022-05-10 15:21:15",
                  "score": 3,
                  "num_children": 0,
                  "author": 135278,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i823qk4",
          "text": "> All I could say was “thank god we didn’t sleep with each other.”\n\nSo what'd she do when you said that though?",
          "timestamp": "2022-05-10 14:59:25",
          "score": 11,
          "num_children": 1,
          "replies": [
            {
              "id": "i823tbe",
              "text": "She laughed. I’m always saying stupid shit.",
              "timestamp": "2022-05-10 14:59:57",
              "score": 8,
              "num_children": 1,
              "author": 326567,
              "replies": [
                {
                  "id": "i8243z1",
                  "text": "But then what'd she do?",
                  "timestamp": "2022-05-10 15:01:53",
                  "score": 3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i824ndc",
                      "text": "Slept with him",
                      "timestamp": "2022-05-10 15:05:28",
                      "score": 9,
                      "num_children": 1,
                      "author": 44512,
                      "replies": [
                        {
                          "id": "i825kfj",
                          "text": "Right onnnn!!! I *knew* it!",
                          "timestamp": "2022-05-10 15:11:34",
                          "score": 4,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i82plb7",
          "text": "You're actually half first cousins, which is confusing. But essentially you share 1/2 the DNA of first cousins but 2x the DNA of second cousins. Because your parents are genetically half siblings, not full siblings.",
          "timestamp": "2022-05-10 17:23:24",
          "score": 3,
          "num_children": 0,
          "author": 284293,
          "replies": []
        }
      ]
    },
    {
      "id": "i82dh09",
      "text": "Had a friend OD a few years back, while I knew he had a twin, nothing can prepare you for a wake like that, and seeing someone's face that you are grieving.",
      "timestamp": "2022-05-10 16:03:12",
      "score": 15,
      "num_children": 0,
      "author": 139781,
      "replies": []
    },
    {
      "id": "i81yzdl",
      "text": "A similar situation happened to me, one of my father's aunts that I didn't know very well (had only met her once or twice as a kid) passed away and he went to her funeral. Fast forward a few months and I come downstairs to see another aunt and the aunt that I *thought* had died making tamales in our kitchen. To be honest, I'm still not really sure who actually died but the tamales were fire",
      "timestamp": "2022-05-10 14:27:08",
      "score": 13,
      "num_children": 1,
      "author": 186268,
      "replies": [
        {
          "id": "i82jgst",
          "text": "You got blessed by the holy tamale",
          "timestamp": "2022-05-10 16:42:11",
          "score": 2,
          "num_children": 0,
          "author": 234452,
          "replies": []
        }
      ]
    },
    {
      "id": "i81zve8",
      "text": "Not quite the same but at my grandfather's funeral, we did find out he had a brother that he'd never mentioned once. And we found that out by him introducing himself to us.",
      "timestamp": "2022-05-10 14:33:22",
      "score": 10,
      "num_children": 1,
      "author": 48067,
      "replies": [
        {
          "id": "i82cs6w",
          "text": "Met my grandmothers sister at my grandmas funeral, spitting image, like 2 years apart, they lived up north in sweden so just met her once as a small child.. i was a grown man but had to do a double take..  eerie sensation",
          "timestamp": "2022-05-10 15:58:44",
          "score": 4,
          "num_children": 0,
          "author": 299366,
          "replies": []
        }
      ]
    },
    {
      "id": "i820oz9",
      "text": "My dad always had a beard, one day I went home for a visit and knocked on the door, oddly my uncle answered the door except it wasn't my uncle, it was my dad who after 30, maybe longer, years decided to have it shaved off. I never realised how similar they looked, not twins but yeah very very alike.",
      "timestamp": "2022-05-10 14:38:57",
      "score": 9,
      "num_children": 0,
      "author": 350460,
      "replies": []
    },
    {
      "id": "i82j9rf",
      "text": "I've been in a similar boat, I had an Uncle who had a twin brother the family \"Didn't talk about\", because he was \"Really close friends with another man\", and if you did talk about him then you needed to remember they were \"JUST FRIENDS NOTHING MORE!\"  \n\n\nHe showed up at a family reunion a year after his brother's death for two reasons  \n1. His brother died, and he felt he needed to be with the family to grieve\n\n2. They were becoming a lot cooler with him being gay due to the changing social climate\n\n&#x200B;\n\nGave me a heart attack when I saw him because he looked the same, had the same beard and dress sense and everything.",
      "timestamp": "2022-05-10 16:40:56",
      "score": 10,
      "num_children": 0,
      "author": 45188,
      "replies": []
    },
    {
      "id": "i81pqqy",
      "text": "I wish my grandmother had a twin. Atleast I could have heard and saw her one more time, even if it’s not her.",
      "timestamp": "2022-05-10 13:18:32",
      "score": 44,
      "num_children": 1,
      "author": 402724,
      "replies": [
        {
          "id": "i81r7nz",
          "text": "I feel you. We lost my opa (grandpa) almost two years ago. I miss the little things.",
          "timestamp": "2022-05-10 13:30:01",
          "score": 26,
          "num_children": 2,
          "author": 301523,
          "replies": [
            {
              "id": "i81vqyg",
              "text": "Little things. Yes. Huge things, yes. Their unconditional love, yes. God, I miss her(them).",
              "timestamp": "2022-05-10 14:04:06",
              "score": 9,
              "num_children": 1,
              "author": 402724,
              "replies": [
                {
                  "id": "i8246wh",
                  "text": "i have dreams about my grandparents all the time.  in the dreams they never died and we are jus continuing to live life like we were before",
                  "timestamp": "2022-05-10 15:02:26",
                  "score": 7,
                  "num_children": 0,
                  "author": 398118,
                  "replies": []
                }
              ]
            },
            {
              "id": "i825zc1",
              "text": "I lost my opa almost two years ago. Brother?",
              "timestamp": "2022-05-10 15:14:13",
              "score": 4,
              "num_children": 1,
              "author": 317482,
              "replies": [
                {
                  "id": "i82cdg0",
                  "text": "Nope hahaha I doubt it. Dutch?",
                  "timestamp": "2022-05-10 15:56:01",
                  "score": 1,
                  "num_children": 1,
                  "author": 301523,
                  "replies": [
                    {
                      "id": "i831mvu",
                      "text": "No my name isn't Dutch, it's Daniel",
                      "timestamp": "2022-05-10 18:45:01",
                      "score": 0,
                      "num_children": 1,
                      "author": 317482,
                      "replies": [
                        {
                          "id": "i838hrz",
                          "text": "Are you Dutch?",
                          "timestamp": "2022-05-10 19:30:47",
                          "score": 1,
                          "num_children": 1,
                          "author": 301523,
                          "replies": [
                            {
                              "id": "i83b2sy",
                              "text": "No I'm Daniel",
                              "timestamp": "2022-05-10 19:47:49",
                              "score": 0,
                              "num_children": 1,
                              "author": 317482,
                              "replies": [
                                {
                                  "id": "i84pk86",
                                  "text": "Fucking hell man. What's your background? I'm Dutch and that's why my grandpa is called an opa.",
                                  "timestamp": "2022-05-11 01:51:09",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 301523,
                                  "replies": [
                                    {
                                      "id": "i8hbg07",
                                      "text": "My background is a camping trip I took in 2019",
                                      "timestamp": "2022-05-13 18:06:03",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 317482,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i824i29",
      "text": "Something similar happened to my ex-husband. First side note that's important to the story...He's deaf from a family that doesn't sign.  All his life he believed his parents had married divorced and remarried years later.  Turns out his mom married his dad and later married his dad's identical twin.  Imagine his surprise when I told him his parent's didn't remarry; his mom married both brothers.  His mom was confused as to why my ex was understandably upset that no one had told him his dad had a twin. Mom's defense...it was common knowledge that there were two of them. Second side note... if you want a deaf person to know something TELL THEM!  Third side note...if you have a deaf child LEARN TO SIGN!!! It's not that hard.  Oops! I'm on my soapbox. Sorry.  Anyway...years later he saw both men at the same time and they all had a good laugh about it. So that's good.",
      "timestamp": "2022-05-10 15:04:30",
      "score": 9,
      "num_children": 0,
      "author": 121622,
      "replies": []
    },
    {
      "id": "i825oi7",
      "text": "This happened at my grandfather's funeral. His twin brother stood up and started talking and there was a horrified gasp around the church. And then he said \"I'm guessing many of you didn't know that he had a twin brother.\" It was a nice moment on a sad day.",
      "timestamp": "2022-05-10 15:12:20",
      "score": 9,
      "num_children": 0,
      "author": 217594,
      "replies": []
    },
    {
      "id": "i81t5lz",
      "text": "Right after I got here I ordered some spaghetti with marinara sauce and I got egg noodles and ketchup….",
      "timestamp": "2022-05-10 13:44:52",
      "score": 8,
      "num_children": 0,
      "author": 303399,
      "replies": []
    },
    {
      "id": "i82kubo",
      "text": "As an identical twin myself, I’ve always been told by friends/coworkers to lead with my name, followed swiftly by “I have an identical twin”.",
      "timestamp": "2022-05-10 16:51:08",
      "score": 9,
      "num_children": 0,
      "author": 101120,
      "replies": []
    },
    {
      "id": "i81vs13",
      "text": "Imagine if no one actually told the guy about it, dude would probably sleep with the lights on for the rest of his life",
      "timestamp": "2022-05-10 14:04:20",
      "score": 6,
      "num_children": 0,
      "author": 128143,
      "replies": []
    },
    {
      "id": "i81w9ek",
      "text": "My grandfather had a twin sister. There was a passing resemblance. They're both gone now.",
      "timestamp": "2022-05-10 14:07:49",
      "score": 6,
      "num_children": 0,
      "author": 112955,
      "replies": []
    },
    {
      "id": "i820z1u",
      "text": "I was about 8. My grandpa passed. While shopping with my father, I saw my grandpa's twin. Never knew about him. He had long hair, so I knew he was a different person, but it was so trippy. I haven't thought about that in a loooong time",
      "timestamp": "2022-05-10 14:40:51",
      "score": 7,
      "num_children": 0,
      "author": 269467,
      "replies": []
    },
    {
      "id": "i81wemg",
      "text": "I'm Oscar (.com)",
      "timestamp": "2022-05-10 14:08:52",
      "score": 7,
      "num_children": 1,
      "author": 259217,
      "replies": [
        {
          "id": "i822ib1",
          "text": "Pop-pop?",
          "timestamp": "2022-05-10 14:51:09",
          "score": 3,
          "num_children": 1,
          "author": 237199,
          "replies": [
            {
              "id": "i82eocb",
              "text": "The mere fact that you call making love 'Pop Pop' tells me that you're not ready",
              "timestamp": "2022-05-10 16:11:08",
              "score": 3,
              "num_children": 1,
              "author": 22742,
              "replies": [
                {
                  "id": "i82eusi",
                  "text": "I’m telling you I’m not Oscar, I’m George!",
                  "timestamp": "2022-05-10 16:12:18",
                  "score": 2,
                  "num_children": 0,
                  "author": 237199,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i821i46",
      "text": "My Granddad was a gregarious man who could talk to you for hours about anything. I once listened to him talk about his experience in WWII for over two hours, and all he did was watch over a dock in Hawaii after Pearl Harbor.\n\nBut he never said a word about his family.\n\nWe did get him to talk about his dad once, who apparently died when my Granddad was young in a construction accident, but his mom? Brothers? Sisters? Relatives? Nothing. Far as he was concerned, my Grandmother and his kids were his family and that was that. There were rumors that something had happened between him and the rest of his family that caused a rift, but nobody had details and my Granddad refused to talk about it.\n\nA few weeks after he died, an old woman showed up at my Grandmother's place and introduced herself as my Granddad's sister. At first we thought she was crazy, since she lived nearby and knew where my Grandparents lived but never showed up until now, but she knew things about my Granddad that people wouldn't normally know and she never tried to scam us or anything. Just a nice old woman who we sort of regretted not meeting until now.\n\nSadly, she was almost as tight-lipped about her family as my Granddad, and wouldn't go into details about  why she had avoided us until now. She passed about two years later, and nobody else came forward after her.\n\nAs far as we know, what happened has gone to both of their graves and it'll forever remain a mystery to us.",
      "timestamp": "2022-05-10 14:44:26",
      "score": 5,
      "num_children": 0,
      "author": 96360,
      "replies": []
    },
    {
      "id": "i8243wt",
      "text": "My grandma had a twin sister. We had a family reunion one year when I was probably under 5 and I didn't know about her. I went and climbed up on the twin's lap because I thought she was my grandma and then I looked down the table and saw my grandma and it really freaked me out. At least it wasn't at a funeral so everyone could have a laugh.",
      "timestamp": "2022-05-10 15:01:53",
      "score": 6,
      "num_children": 0,
      "author": 68002,
      "replies": []
    },
    {
      "id": "i82fk0k",
      "text": "A few less commas would be second nicest too.",
      "timestamp": "2022-05-10 16:16:55",
      "score": 5,
      "num_children": 0,
      "author": 25695,
      "replies": []
    },
    {
      "id": "i82j9o8",
      "text": "Almost the same thing happened to me when I was 13. My grandfather was very sick. I knew he had a brother but not that they were twins. So while he was in the hospital dying of cancer. I suddenly came home to him being there alright and casually drinking coffee. \n\nIt was quite embarrassing.",
      "timestamp": "2022-05-10 16:40:55",
      "score": 6,
      "num_children": 0,
      "author": 25613,
      "replies": []
    },
    {
      "id": "i82enet",
      "text": "I didn't encounter my mom's twin, but after she died, I found out she had an older brother named Tom who I'd never even heard mentioned once in the first 25 years of my life.",
      "timestamp": "2022-05-10 16:10:57",
      "score": 3,
      "num_children": 0,
      "author": 255514,
      "replies": []
    },
    {
      "id": "i843cz4",
      "text": "My dad had a brother that looked nothing like him. My Uncle Dave had curly hair, my Dad did not, Uncle was really thin, my Dad had a somewhat muscular body with a bit of weight (not fat at all), Uncle had dark brown hair, Dad had medium brown with some gray in it. My Dad was handsome and Uncle was awkward looking. We hadn't seen my Uncle for about 5 yrs until my Dads funeral (he was 39yrs). He looked identical to my Dad. My sister and I could only stare for the first few minutes. It. Was. Crazy!!",
      "timestamp": "2022-05-10 23:03:25",
      "score": 4,
      "num_children": 0,
      "author": 249189,
      "replies": []
    },
    {
      "id": "i81wbu9",
      "text": "/r/lowhangingcomedy",
      "timestamp": "2022-05-10 14:08:18",
      "score": 7,
      "num_children": 1,
      "author": 255957,
      "replies": [
        {
          "id": "i81xw9j",
          "text": "I saw my grandfather's balls once. They hung pretty low.",
          "timestamp": "2022-05-10 14:19:33",
          "score": 6,
          "num_children": 1,
          "replies": [
            {
              "id": "i822540",
              "text": "But were they identical?",
              "timestamp": "2022-05-10 14:48:43",
              "score": 1,
              "num_children": 1,
              "author": 171540,
              "replies": [
                {
                  "id": "i8271vg",
                  "text": "In my nightmares they are",
                  "timestamp": "2022-05-10 15:21:01",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i8278he",
      "text": "The majority of my husbands family didn't know his great grandpa had a twin.. until he showed up at his grandpa's funeral. His own kids didn't know.",
      "timestamp": "2022-05-10 15:22:14",
      "score": 3,
      "num_children": 1,
      "author": 240930,
      "replies": [
        {
          "id": "i82qni7",
          "text": "How’d everyone react to that?",
          "timestamp": "2022-05-10 17:30:37",
          "score": 1,
          "num_children": 0,
          "author": 78736,
          "replies": []
        }
      ]
    },
    {
      "id": "i82fqyi",
      "text": "God, that would be a funny scene in a movie.",
      "timestamp": "2022-05-10 16:18:11",
      "score": 3,
      "num_children": 1,
      "author": 395759,
      "replies": [
        {
          "id": "i88g6sx",
          "text": "You should watch Beerfest!",
          "timestamp": "2022-05-11 20:58:05",
          "score": 1,
          "num_children": 0,
          "author": 244063,
          "replies": []
        }
      ]
    },
    {
      "id": "i82jhj2",
      "text": "What's the point of having a twin if not to engage in such shenanigans?",
      "timestamp": "2022-05-10 16:42:19",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i82ji5q",
      "text": "I've been in a similar situation, but fortunately it was for my grandpa's retirement and not his funeral. Ran into my great uncle as a five year old at the party and was super confused why Grandpa was slightly skinnier and was wearing glasses. Happy to say both the dudes are still alive too! Love my grandpa very much.",
      "timestamp": "2022-05-10 16:42:26",
      "score": 3,
      "num_children": 0,
      "author": 174445,
      "replies": []
    },
    {
      "id": "i82pxhe",
      "text": "I found out my bosses wife had a twin at her funeral. After a spotted her I had a solid 20 minutes thinking I completely missed something important and had been wildly confused about the nature of the gathering.",
      "timestamp": "2022-05-10 17:25:43",
      "score": 3,
      "num_children": 0,
      "author": 283166,
      "replies": []
    },
    {
      "id": "i82pz9g",
      "text": "I never met my grandpas brother until his funeral. I didn’t even know he had one.. He looked exactly like my grandpa but shorter. Same haircut basically the same outfit.. He sat in my grandpas seat he always sat at next to my grandma and I had to go take a walk and cry. It really fucked me up.",
      "timestamp": "2022-05-10 17:26:03",
      "score": 3,
      "num_children": 0,
      "author": 35791,
      "replies": []
    },
    {
      "id": "i82rgj5",
      "text": "I had a similar experience, my grandfather had a brother who was only about a year different in age but I never met him (or even knew he existed). My grandfather died when I was in my late 20's. I popped to the toilet at the funeral home and found myself standing at a urinal next to a guy who looked and sounded exactly like my grandfather. Fucking weird.",
      "timestamp": "2022-05-10 17:36:13",
      "score": 3,
      "num_children": 0,
      "author": 221548,
      "replies": []
    },
    {
      "id": "i82rzty",
      "text": "When my best friend passed away his brother whom I never met in person came to the funeral.  It was very odd having him stand next to me looking over his younger brother since they looked alike.  I couldn't stop staring at him and being so young myself at the time, it made it all the more feel like a bad dream I couldn't wake from.",
      "timestamp": "2022-05-10 17:39:52",
      "score": 3,
      "num_children": 0,
      "author": 28379,
      "replies": []
    },
    {
      "id": "i82tdyp",
      "text": "Hey, my uncle used to be my stepdad and my step dad used to be my uncle",
      "timestamp": "2022-05-10 17:49:16",
      "score": 3,
      "num_children": 1,
      "author": 274178,
      "replies": [
        {
          "id": "i83qgpx",
          "text": "I knew a guy that his Father was a twin and they married twin sisters. After some time they got divorced and switched partners. Pretty fricken weird if you ask me.",
          "timestamp": "2022-05-10 21:30:22",
          "score": 1,
          "num_children": 0,
          "author": 195097,
          "replies": []
        }
      ]
    },
    {
      "id": "i82xclf",
      "text": "This is why my mother didn’t go to her identical twin sister’s funeral. She felt like it would be a bit much, having the deceased’s doppelgänger sitting in the front row, like a backup Kathe, ready to step in.",
      "timestamp": "2022-05-10 18:15:46",
      "score": 3,
      "num_children": 0,
      "author": 129488,
      "replies": []
    },
    {
      "id": "i83lju6",
      "text": "Arrested development vibes",
      "timestamp": "2022-05-10 20:56:54",
      "score": 3,
      "num_children": 0,
      "author": 134492,
      "replies": []
    },
    {
      "id": "i83r43k",
      "text": "My uncle was a real dipshit. When I was growing up, he was the mean one and when us kids were just being kids and having fun, he was always the one to ruin it for us. Even after the other adults told him we were fine and just playing around, he would always say some shit to ruin everyone’s good time. He was such an asshole. I have so many memories of him like that. I have no ‘cool’ memories of him at all, nothing where he is agreeable or funny or charming or sweet. He’s just a massive dick. \n\nWell, years later my uncle died. And me, grown ass, sees this man pop up at the funeral that looks *exactly* like him from twenty years before. It takes me back to when I was a kid. I still hated him. Same hair, same face, same build, same mannerisms. Immediately soured the mood. Then I realize this was impossible, the fucker is gone. \n\nNah it turns out it’s his eldest son. Who he had no hand in raising bc he left the family he created (the first of three that he did that to). And this cousin of mine comes over and gives his condolences… and his eyes were different. *Kind*. I’ll never forget that moment, seeing the laugh lines at the corners. Sweet, funny, considerate. He’s a beautiful soul. I’m so glad my uncle had no influence on him as a young man.",
      "timestamp": "2022-05-10 21:34:53",
      "score": 3,
      "num_children": 0,
      "author": 133593,
      "replies": []
    },
    {
      "id": "i8420l6",
      "text": "I worked with a girl at a pizza place for my first job and my second job was warehouse work. Imagine my surprise walking in my first day and I see the girl I left at the pizza place is my trainer. Lol they were obviously twins but it was a funny little \"small world\" moment for me.",
      "timestamp": "2022-05-10 22:53:33",
      "score": 3,
      "num_children": 0,
      "author": 358956,
      "replies": []
    },
    {
      "id": "i8686gu",
      "text": "This same thing happened to me!  My pop-pop’s brother with long hair was even shagging my Gangie while Pop-pop was in prison.",
      "timestamp": "2022-05-11 11:50:22",
      "score": 3,
      "num_children": 0,
      "author": 372170,
      "replies": []
    },
    {
      "id": "i8262wc",
      "text": "Nixon’s brother was apparently the late president’s splitting image, so naturally he used to wander around his brother’s public library after his death (much to the horror of guests).",
      "timestamp": "2022-05-10 15:14:43",
      "score": 6,
      "num_children": 1,
      "author": 334284,
      "replies": [
        {
          "id": "i8355wr",
          "text": "Was the brother a crook too",
          "timestamp": "2022-05-10 19:08:41",
          "score": 1,
          "num_children": 0,
          "author": 9485,
          "replies": []
        }
      ]
    },
    {
      "id": "i8263ei",
      "text": "Nixon’s brother was apparently the late president’s splitting image, so naturally he used to wander around his brother’s public library after his death (much to the horror of guests).",
      "timestamp": "2022-05-10 15:14:48",
      "score": 4,
      "num_children": 0,
      "author": 334284,
      "replies": []
    },
    {
      "id": "i81xdxx",
      "text": "Holy shit",
      "timestamp": "2022-05-10 14:15:56",
      "score": 2,
      "num_children": 0,
      "author": 55470,
      "replies": []
    },
    {
      "id": "i821f0v",
      "text": "Something similar happened to me. I can't remember if I was told my grandfather had a brother, but I was shocked when I saw him at my grandfather's funeral. I was 15 at the time. Dude said 2 words to me and I never heard from him again.",
      "timestamp": "2022-05-10 14:43:51",
      "score": 2,
      "num_children": 0,
      "author": 101891,
      "replies": []
    },
    {
      "id": "i822ng2",
      "text": "the same thing happened to me! I met my grandpa's twin at his funeral. I was 8 years old and couldn't believe my eyes. Somehow, it made it so much sadder to see \"his\" face at his own funeral.",
      "timestamp": "2022-05-10 14:52:07",
      "score": 2,
      "num_children": 0,
      "author": 339230,
      "replies": []
    },
    {
      "id": "i823jnh",
      "text": "When I was like 2-3 my aunt got married. So the whole family was there including my grampa's brother. I actually remember what he looked like. He looked incredibly similar to my grampa except he had no mustache. From what I have been told I spent the whole time staring at this guy. And yes I do actually have some memories from when I was 3ish. But I can't remember last week.",
      "timestamp": "2022-05-10 14:58:08",
      "score": 2,
      "num_children": 0,
      "author": 324657,
      "replies": []
    },
    {
      "id": "i823qaq",
      "text": "A 5 year old went to a funeral of a relative he hadn't met. When he was sat at the back of the room, an old geezer came over to him and said a few words (\"thank you for coming. It means a lot\" etc.) before leaving. When they later approached the open casket to pay respects, the deceased was the same bloke that had sat with him earlier! The kid was so spooked he didn't tell anyone what happened and he spent the next 30-odd years of his life believing he'd seen a ghost.",
      "timestamp": "2022-05-10 14:59:22",
      "score": 2,
      "num_children": 0,
      "author": 398118,
      "replies": []
    },
    {
      "id": "i8246xn",
      "text": "This is the kind of shit that only happens in Soaps",
      "timestamp": "2022-05-10 15:02:26",
      "score": 2,
      "num_children": 0,
      "author": 13459,
      "replies": []
    },
    {
      "id": "i824cw1",
      "text": "I read fucking and grand*ma* and said wait the fuck before rereading it in the correct order with the correct words",
      "timestamp": "2022-05-10 15:03:33",
      "score": 2,
      "num_children": 0,
      "author": 362373,
      "replies": []
    },
    {
      "id": "i82641f",
      "text": "Nixon’s brother was apparently the late president’s splitting image, so naturally he used to wander around his brother’s public library after his death (much to the horror of guests).",
      "timestamp": "2022-05-10 15:14:54",
      "score": 2,
      "num_children": 0,
      "author": 334284,
      "replies": []
    },
    {
      "id": "i828s9a",
      "text": "I had this exact thing happen to me when my granda passed away. I thought I’d lost my mind and no-one even explained it to me afterwards. It gave me the weirdest nightmares for weeks afterwards, because I still thought I’d seen his ghost attend his own funeral…",
      "timestamp": "2022-05-10 15:32:30",
      "score": 2,
      "num_children": 0,
      "author": 145426,
      "replies": []
    },
    {
      "id": "i828ynm",
      "text": "My pops passed in 2017. One of his childhood friends from Jamaica had come up to visit for the funeral.\n\nThe man walked through the door. Same style(Jean jacket, baseball cap, similar height/build). I looked at him as he walked through the door and gapped for a second. Immediately looked at my siblings and they were startled too. Was wiiiiiild. Even weirder because they aren't blood relatives.",
      "timestamp": "2022-05-10 15:33:41",
      "score": 2,
      "num_children": 0,
      "author": 190073,
      "replies": []
    },
    {
      "id": "i829mz6",
      "text": "I had a co-worker who passed away. I had forgotten that he had a twin brother until the visiting hours of the funeral. I can’t say I didn’t do a double take.",
      "timestamp": "2022-05-10 15:38:09",
      "score": 2,
      "num_children": 0,
      "author": 385964,
      "replies": []
    },
    {
      "id": "i82buv3",
      "text": "Pop pop?",
      "timestamp": "2022-05-10 15:52:42",
      "score": 2,
      "num_children": 0,
      "author": 224901,
      "replies": []
    },
    {
      "id": "i82c0qy",
      "text": "He’s still, genetically speaking, the same exact Grandpa",
      "timestamp": "2022-05-10 15:53:46",
      "score": 2,
      "num_children": 0,
      "author": 15661,
      "replies": []
    },
    {
      "id": "i82d704",
      "text": "I'm Oscar!",
      "timestamp": "2022-05-10 16:01:21",
      "score": 2,
      "num_children": 0,
      "author": 277353,
      "replies": []
    },
    {
      "id": "i82e2cp",
      "text": "When my grandma’s twin that I didn’t know about came to visit from Chicago... my head exploded!",
      "timestamp": "2022-05-10 16:07:06",
      "score": 2,
      "num_children": 0,
      "author": 134129,
      "replies": []
    },
    {
      "id": "i82f7xh",
      "text": "Years after my dad died I was grocery shopping and there was somebody facing away from me as I turned to go down an aisle. This person had the same build, looks, and movements of my dad and I was shocked for a few seconds as my brain processed what was happening. That never happened before or since, but when it does happen for a short time it really messes with your head.",
      "timestamp": "2022-05-10 16:14:44",
      "score": 2,
      "num_children": 0,
      "author": 20394,
      "replies": []
    },
    {
      "id": "i82goej",
      "text": "My grandpas brother looked like my grandgrandpa (his father that died when I was 7 or 8 and i never saw his brother since he lived abroad). When my grandpa died his brother came to funeral, sun was shining just behind him and it looked like he had a halo with his silver hair. I was 17 and let me tell you I almost passed out. We are standing there around the grave, ready for burial, I turned to my mother and asked does she see the angel, she looked at me and asked what angel. I sad look it's grandgrandpa, she didn't know to laugh or cry and told me it's grandpas brother.",
      "timestamp": "2022-05-10 16:24:09",
      "score": 2,
      "num_children": 0,
      "author": 328555,
      "replies": []
    },
    {
      "id": "i82hdm0",
      "text": "My grandfather did not take care of himself. He smoked, had broken his legs so bad they were different lengths, and he gave himself alzheimers through prescription drug abuse. He died during my sophomore year of college.\n\nWhile we were sitting in my grandma's living room the night before the funeral in jogs a man who looked like a 30 year younger version of my grandfather.\n\nHe was wearing really expensive clothes and he spoke the same way but the words made sense.\n\nI was shocked. Actually shocked. Who was this man. A rich ghost perhaps. Nope twins brother who worker for the oil industry rather than becoming a pharmacist.\n\nIt was jarring.",
      "timestamp": "2022-05-10 16:28:42",
      "score": 2,
      "num_children": 0,
      "author": 220556,
      "replies": []
    },
    {
      "id": "i82he5m",
      "text": "I went out with a twin a couple of times. She didn't tell me .  One time we were standing in front of her house, a car pulls up and turn my head away from her a towards the car, then her twin emerges from the car. A true wtf moment.\n\nSo yea, a heads up would have been nice",
      "timestamp": "2022-05-10 16:28:47",
      "score": 2,
      "num_children": 0,
      "author": 399279,
      "replies": []
    },
    {
      "id": "i82hgpj",
      "text": "That happened when my mom died. Her twin tapped me on the shoulder while I was viewing her in the casket.",
      "timestamp": "2022-05-10 16:29:15",
      "score": 2,
      "num_children": 0,
      "author": 106719,
      "replies": []
    },
    {
      "id": "i82hn8n",
      "text": "Try meeting a doppleganger of an ex-gf! Not once, but twice. 😁",
      "timestamp": "2022-05-10 16:30:25",
      "score": 2,
      "num_children": 0,
      "author": 286750,
      "replies": []
    },
    {
      "id": "i82j5ic",
      "text": "Pop pop?",
      "timestamp": "2022-05-10 16:40:11",
      "score": 2,
      "num_children": 0,
      "author": 291751,
      "replies": []
    },
    {
      "id": "i82pzps",
      "text": "This happened to me. In middle school I went to a classmates house to play games. To my surprise my moms boyfriend was there. The look on my face was probably shocking. I didn’t say nothing. Turns out my moms bf had a younger brother that was damn near identical.",
      "timestamp": "2022-05-10 17:26:08",
      "score": 2,
      "num_children": 0,
      "author": 327076,
      "replies": []
    },
    {
      "id": "i82tqzj",
      "text": "Haha! My grandad was an identical twin so I can imagine this perfectly. At my grandad's funeral it was very weird being with his surviving twin and anytime after that. It felt very odd, sharp intake of breath when you saw him and it hurt a lot.",
      "timestamp": "2022-05-10 17:51:40",
      "score": 2,
      "num_children": 0,
      "author": 363791,
      "replies": []
    },
    {
      "id": "i82vzcc",
      "text": "My Nana had an identical sister. The sister would ask my four year old cousin \"Who am I, Bradley?\" and he would look at my Nana and say \"You.\"",
      "timestamp": "2022-05-10 18:06:38",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i82w2bw",
      "text": "Dude... I've always known my grandpa was a twin, but I forgot (distant family, never really spent time with his twin).\n\nWent to another funeral recently and he was there and I almost lost my marbles.\n\nGhosts, man.",
      "timestamp": "2022-05-10 18:07:10",
      "score": 2,
      "num_children": 0,
      "author": 22795,
      "replies": []
    },
    {
      "id": "i82x4p0",
      "text": "Similar story happened at my old man’s funeral. Wasn’t close to his side of the family so I was unaware that I had an uncle that was the spitting image of my father. When I first saw him my heart stopped and I almost greeted him with a “didn’t you just die?”",
      "timestamp": "2022-05-10 18:14:17",
      "score": 2,
      "num_children": 0,
      "author": 162741,
      "replies": []
    },
    {
      "id": "i83c0ax",
      "text": "This was a recurring theme in arrested development too",
      "timestamp": "2022-05-10 19:53:50",
      "score": 2,
      "num_children": 0,
      "author": 73890,
      "replies": []
    },
    {
      "id": "i83hgvf",
      "text": "Happened at my dads funeral. He was A. a bug prankster and B. Estranged from his family.\n\nWhen his twin brother showed up unexpectantly, I saw the perfect opportunity to payoff the old man’s final prank and didn’t tell anyone.\n\nI just followed my uncle around and watched my dads friend’s reaction.\n\nTo a person, after the figured it out thanked me for the scare. It was a payoff 30 years in the making.",
      "timestamp": "2022-05-10 20:29:35",
      "score": 2,
      "num_children": 0,
      "author": 234285,
      "replies": []
    },
    {
      "id": "i83ybew",
      "text": "Went to a friend's funeral and was talking with her widower when someone walked up behind me and *started speaking with Maryann's voice*... you know, *the one in the casket in front of me*.  Turns out it was her sister, who looks nothing like her but sounded identical. They got a good laugh out of the look on my face.",
      "timestamp": "2022-05-10 22:26:31",
      "score": 2,
      "num_children": 0,
      "author": 128103,
      "replies": []
    },
    {
      "id": "i846zzn",
      "text": "Would have been nice if karmafuckingfarmer pietradolce had given a heads up that many people on Reddit would be seeing this for the fiftieth time.",
      "timestamp": "2022-05-10 23:30:56",
      "score": 2,
      "num_children": 0,
      "author": 37181,
      "replies": []
    },
    {
      "id": "i84kg8b",
      "text": "I read this in Gordon Ramsay's voice",
      "timestamp": "2022-05-11 01:12:33",
      "score": 2,
      "num_children": 0,
      "author": 305340,
      "replies": []
    },
    {
      "id": "i84prpg",
      "text": "This happened with my father-in-law, although not at a funeral.   I had only mer him once or twice (early in our dating) and then I saw \"him\" at the grocery store.  I waved and he looked at me like I was crazy.  Told my now-husband about it and he said \"oh yeah, that's Leo, his twin.\"  I felt like a total idiot.",
      "timestamp": "2022-05-11 01:52:45",
      "score": 2,
      "num_children": 0,
      "author": 92974,
      "replies": []
    },
    {
      "id": "i84qa9o",
      "text": "Wait so... You didn't know you had a great-uncle??\n\nWhere was he up until this point?",
      "timestamp": "2022-05-11 01:56:41",
      "score": 2,
      "num_children": 0,
      "author": 119284,
      "replies": []
    },
    {
      "id": "i85yidl",
      "text": "Grandpa always said I'd be back to haunt you! Booga, Booga!",
      "timestamp": "2022-05-11 09:59:43",
      "score": 2,
      "num_children": 0,
      "author": 166802,
      "replies": []
    },
    {
      "id": "i86ad3l",
      "text": "Happened to me with my grandmother who had a heart attack and died in front of me three days after my seventh birthday. I had a half day of school because of an impending snowstorm and was dropped off at grandma’s house that day. She was in the middle of making lunch when she crumpled onto the floor. I can still see her reaching for me, non-verbal and scared. My brothers and I ran outside to go to a neighbors house and there was already a foot of snow on the ground. There was smoke filling the house because something had caught fire in the kitchen on the stove. My brothers and I were shaking like leaves because we thought she was turning into a monster. \n\nI mention all of this because after a traumatic experience like that, my grandmother’s twin sister was at the funeral, who we had never met before. I started moan-screaming at the funeral, pointing at my great aunt while everyone is in tears and looking at me like I was an idiot.",
      "timestamp": "2022-05-11 12:10:44",
      "score": 2,
      "num_children": 0,
      "author": 279038,
      "replies": []
    },
    {
      "id": "i8a3tvg",
      "text": "I remember this happened in a documentary about some friends competing in drinking games. One of the guys died due to mysterious circumstances and his twin brother shows up at the funeral. He even tells all the friends to just call him by the same nickname, Landfill, and they become great friends and continue to win at drinking games in some national tournament in Europe. I think the documentary was called “Beerfest.”",
      "timestamp": "2022-05-12 04:39:49",
      "score": 2,
      "num_children": 0,
      "author": 333213,
      "replies": []
    },
    {
      "id": "i81qsla",
      "text": "🤣",
      "timestamp": "2022-05-10 13:26:42",
      "score": -1,
      "num_children": 0,
      "author": 360058,
      "replies": []
    },
    {
      "id": "i8373yl",
      "text": "Papaa?",
      "timestamp": "2022-05-10 19:21:44",
      "score": 1,
      "num_children": 0,
      "author": 331667,
      "replies": []
    },
    {
      "id": "i823h9z",
      "text": "extra points if you see him in the basement and in the distance because he was trying to find his brothers old wrist watch",
      "timestamp": "2022-05-10 14:57:41",
      "score": 1,
      "num_children": 1,
      "author": 398118,
      "replies": [
        {
          "id": "i82qgsr",
          "text": "Is this a reference to something?",
          "timestamp": "2022-05-10 17:29:22",
          "score": 1,
          "num_children": 0,
          "author": 78736,
          "replies": []
        }
      ]
    },
    {
      "id": "i8249re",
      "text": "Poor Ray Liota",
      "timestamp": "2022-05-10 15:02:59",
      "score": 1,
      "num_children": 0,
      "author": 65528,
      "replies": []
    },
    {
      "id": "i826hro",
      "text": "Kenny Powers!",
      "timestamp": "2022-05-10 15:17:21",
      "score": 1,
      "num_children": 0,
      "author": 85742,
      "replies": []
    },
    {
      "id": "i827qzu",
      "text": "Before your grandfather owed $40k to the mob, he didn't know he had a twin brother either",
      "timestamp": "2022-05-10 15:25:39",
      "score": 1,
      "num_children": 0,
      "author": 288555,
      "replies": []
    },
    {
      "id": "i82b71r",
      "text": "Oh hey grandpa, how’d you get out of the coffin?”",
      "timestamp": "2022-05-10 15:48:23",
      "score": 1,
      "num_children": 0,
      "author": 343280,
      "replies": []
    },
    {
      "id": "i82bciy",
      "text": "That fucking punctuation though.",
      "timestamp": "2022-05-10 15:49:22",
      "score": 1,
      "num_children": 0,
      "author": 332641,
      "replies": []
    },
    {
      "id": "i82caep",
      "text": "That is brutal",
      "timestamp": "2022-05-10 15:55:28",
      "score": 1,
      "num_children": 0,
      "author": 180194,
      "replies": []
    },
    {
      "id": "i82cnba",
      "text": "i really cant imagine the scenario where my dad has a twin and when my dad passed away, then at the funeral when i walk in the ceremony and then see my dad's twin standing in front of me and say \"thank you for attending my funeral\". id be fucking confused af and not know how to react to this whether laigh about it or cry in disappointment",
      "timestamp": "2022-05-10 15:57:50",
      "score": 1,
      "num_children": 0,
      "author": 188169,
      "replies": []
    },
    {
      "id": "i82dxpy",
      "text": "A head's up from your dead grandpa? No, that would be terrifying.",
      "timestamp": "2022-05-10 16:06:15",
      "score": 1,
      "num_children": 0,
      "author": 11353,
      "replies": []
    },
    {
      "id": "i82k8jk",
      "text": "thats fucked",
      "timestamp": "2022-05-10 16:47:13",
      "score": 1,
      "num_children": 0,
      "author": 373532,
      "replies": []
    },
    {
      "id": "i82kbdy",
      "text": "Pure gold",
      "timestamp": "2022-05-10 16:47:44",
      "score": 1,
      "num_children": 0,
      "author": 13889,
      "replies": []
    },
    {
      "id": "i82ltbc",
      "text": "I laughed way too hard at this.",
      "timestamp": "2022-05-10 16:57:32",
      "score": 1,
      "num_children": 0,
      "author": 306847,
      "replies": []
    },
    {
      "id": "i82md51",
      "text": "I didn’t know my grandpa had a brother until my 30’s and didn’t meet him until my grandma’s funeral. Apparently my grandma hated him and cut him out of their lives.",
      "timestamp": "2022-05-10 17:01:12",
      "score": 1,
      "num_children": 0,
      "author": 104259,
      "replies": []
    },
    {
      "id": "i82mg9i",
      "text": "Uncle Stan?",
      "timestamp": "2022-05-10 17:01:47",
      "score": 1,
      "num_children": 0,
      "author": 354292,
      "replies": []
    },
    {
      "id": "i82n2o7",
      "text": "Lmao",
      "timestamp": "2022-05-10 17:06:03",
      "score": 1,
      "num_children": 0,
      "author": 333460,
      "replies": []
    },
    {
      "id": "i82o5yv",
      "text": "The twin grandpa was waiting to fuck with the family",
      "timestamp": "2022-05-10 17:13:34",
      "score": 1,
      "num_children": 0,
      "author": 204557,
      "replies": []
    },
    {
      "id": "i82pvv4",
      "text": "When I was 12 my only last remaining grandfather died.  They never let me see him.  I looked for him for years afterword whenever we would go places.  Part of me didn’t believe the adults telling me he was gone.",
      "timestamp": "2022-05-10 17:25:24",
      "score": 1,
      "num_children": 0,
      "author": 402703,
      "replies": []
    },
    {
      "id": "i82rfyg",
      "text": "I feel badly but this made me laugh a little",
      "timestamp": "2022-05-10 17:36:06",
      "score": 1,
      "num_children": 0,
      "author": 81331,
      "replies": []
    },
    {
      "id": "i82sbp6",
      "text": "I had this same issues, not twins but my grandpa and his brother that lived in another county looked identical and took more than a fast glance to notice it.",
      "timestamp": "2022-05-10 17:42:05",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i82toge",
      "text": "Hey, can I karma whore this post next week?",
      "timestamp": "2022-05-10 17:51:12",
      "score": 1,
      "num_children": 0,
      "author": 387067,
      "replies": []
    },
    {
      "id": "i82u14n",
      "text": "Just imagining him at the funeral,\n\n\"*Grandpa is right there! Why is no one reacting?*\"\n\n\"*Can I see dead people?*\"",
      "timestamp": "2022-05-10 17:53:32",
      "score": 1,
      "num_children": 0,
      "author": 366846,
      "replies": []
    },
    {
      "id": "i82vjkd",
      "text": "Just respectfully call him Landfill, like he asked.",
      "timestamp": "2022-05-10 18:03:41",
      "score": 1,
      "num_children": 0,
      "author": 299296,
      "replies": []
    },
    {
      "id": "i82xj1h",
      "text": "A perfect opportunity for a semicolon.\n> When I was five, I found out my\ngrandpa had a twin; I saw him after my grandpa's funeral.",
      "timestamp": "2022-05-10 18:16:57",
      "score": 1,
      "num_children": 0,
      "author": 22117,
      "replies": []
    },
    {
      "id": "i82y2h8",
      "text": "Story twist: your granpa didn't have a twin brother",
      "timestamp": "2022-05-10 18:20:34",
      "score": 1,
      "num_children": 0,
      "author": 308567,
      "replies": []
    },
    {
      "id": "i82y9p1",
      "text": "Explaining to child me that older folks have dentures and sometimes wear wigs would have been good to know, because when my grandmother took off her hair and removed her teeth I lost it and ran from the room to hide because I didn't want to see what else she was going to take off next.",
      "timestamp": "2022-05-10 18:22:05",
      "score": 1,
      "num_children": 0,
      "author": 38640,
      "replies": []
    },
    {
      "id": "i82yltv",
      "text": "Maybe that was their plan all along lol.",
      "timestamp": "2022-05-10 18:24:22",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i82z1sl",
      "text": "\"I see dead people\".",
      "timestamp": "2022-05-10 18:27:30",
      "score": 1,
      "num_children": 0,
      "author": 286889,
      "replies": []
    },
    {
      "id": "i82z92a",
      "text": "My grandfather wasn’t a twin but his brother does look exceptionally like him. A few years after his funeral my family was at a different funeral and my cousin suddenly looked like she was going to faint. Apparently she didn’t know our great unkle yet.",
      "timestamp": "2022-05-10 18:28:52",
      "score": 1,
      "num_children": 0,
      "author": 84880,
      "replies": []
    },
    {
      "id": "i82zffj",
      "text": "My grandmother was a twin but I knew about it my whole life.  It was still very weird seeing my great aunt at the funeral.  She was devastated and just kept saying “It should have been me”. Her voice is different from my grandmother’s voice but it was still creepy.",
      "timestamp": "2022-05-10 18:30:04",
      "score": 1,
      "num_children": 0,
      "author": 270031,
      "replies": []
    },
    {
      "id": "i82zg96",
      "text": "The grandpa of my best friend at the time, was very old and died. \n\nFew week later i pass by his house, they were still at lunch so he tells me to come in. And his grandpa was sitting there and eating AS IF HE DIDN'T EVEN DIE.\n\nThen my friend's mom say something about her dad and call the old man uncle. And I saw the stupid grin on my friend face... click.. oh yeah, twins...",
      "timestamp": "2022-05-10 18:30:13",
      "score": 1,
      "num_children": 0,
      "author": 36733,
      "replies": []
    },
    {
      "id": "i8308sp",
      "text": "I found out at age FIFTY that my mom was adopted and my Grandpa was not really my GP!She said “I just thought you knew”? WTF",
      "timestamp": "2022-05-10 18:35:36",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i830htz",
      "text": "I would've had an \"out of body\" experience moment",
      "timestamp": "2022-05-10 18:37:20",
      "score": 1,
      "num_children": 0,
      "author": 199679,
      "replies": []
    },
    {
      "id": "i832ots",
      "text": "Wow!",
      "timestamp": "2022-05-10 18:52:08",
      "score": 1,
      "num_children": 0,
      "author": 117126,
      "replies": []
    },
    {
      "id": "i832zzy",
      "text": "I walked in to my grandfather’s funeral many years ago and his brother was sitting near the casket.\n\nI’d never met George before and I’ll be damned if he wasn’t a dead ringer for my grandpa.\n\nThanks for the heads up, Fam",
      "timestamp": "2022-05-10 18:54:14",
      "score": 1,
      "num_children": 0,
      "author": 13410,
      "replies": []
    },
    {
      "id": "i8333ux",
      "text": "this is so fucked on so many levels -\\_\\_-",
      "timestamp": "2022-05-10 18:54:57",
      "score": 1,
      "num_children": 0,
      "author": 377265,
      "replies": []
    },
    {
      "id": "i833nmv",
      "text": "The week after my grandpas funeral, my uncle who looked almost identical to him was sleeping on the couch at a gathering, four year old me not understanding my grandpa was dead, pointed at my uncle and said “Grandpa bob’s snoring!”",
      "timestamp": "2022-05-10 18:58:37",
      "score": 1,
      "num_children": 0,
      "author": 396353,
      "replies": []
    },
    {
      "id": "i833z14",
      "text": "I can’t remember why, but one time in 8th grade, I was in a rush to get home which was within walking distance. So as soon as the bell rang, I bolted for the exit. I was literally the first person out the door. After I took a few steps, I saw a classmate of mine sitting on the sidewalk wearing different clothes. I freaked out!! \n\nI was sitting next to her in uniform in the classroom a minute ago. How and when did she change and beat me outside?!\n\nTurns out, even though they were unrelated, they were identical. I mean identical like twins. Same age, exact same height, hair, face, etc. it was creepy. \n\nThey bumped into each other years prior and became friends. She was outside waiting for my classmate to hangout after school. \n\nI’ll never forget the terror I felt until I figured out what happened.",
      "timestamp": "2022-05-10 19:00:43",
      "score": 1,
      "num_children": 0,
      "author": 104883,
      "replies": []
    },
    {
      "id": "i835891",
      "text": "This happened to me on the day of my grandpa's funeral, I saw my grandpa's brother and he was the spitting image of my grandpa, it knocked me for six. I'd met him when I was younger but too young to remember him and what he looked like. It really messed with my head at the time.",
      "timestamp": "2022-05-10 19:09:07",
      "score": 1,
      "num_children": 0,
      "author": 128118,
      "replies": []
    },
    {
      "id": "i836vgr",
      "text": "A similar thing happened to me at my grandpa’s funeral. Turns out my dad’s cousin looks a whole lot like his uncle (my grandpa). That gave me the shock of my life.",
      "timestamp": "2022-05-10 19:20:13",
      "score": 1,
      "num_children": 0,
      "author": 42169,
      "replies": []
    },
    {
      "id": "i838rvq",
      "text": "Shane had a twin. Kenny thought Shane came back to life when it was just Shane's lesser twin",
      "timestamp": "2022-05-10 19:32:39",
      "score": 1,
      "num_children": 0,
      "author": 132854,
      "replies": []
    },
    {
      "id": "i8393xt",
      "text": "“I’m not Curly, i’m Curly’s brother… duke”",
      "timestamp": "2022-05-10 19:34:52",
      "score": 1,
      "num_children": 0,
      "author": 321251,
      "replies": []
    },
    {
      "id": "i839k65",
      "text": "I experienced the same thing with my grandmother...when she passed I saw her younger sister for the first time in my life at the funerals....I was in shock it was like seing a younger granny. She hadn't spoken to her in decades and nobody talked about her. I was convinced she only had a brother...",
      "timestamp": "2022-05-10 19:37:54",
      "score": 1,
      "num_children": 0,
      "author": 330600,
      "replies": []
    },
    {
      "id": "i83a1cj",
      "text": "imagine facepalming a fucking five year old. the real facepalm is OP",
      "timestamp": "2022-05-10 19:41:01",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i83alux",
      "text": "A great uncle of mine was a twin, and I had no idea, I think I was 7-8 years old when I saw them standing together at a family reunion, my mind was blown.",
      "timestamp": "2022-05-10 19:44:44",
      "score": 1,
      "num_children": 0,
      "author": 31531,
      "replies": []
    },
    {
      "id": "i83bs31",
      "text": "You can just call me Landifll so we don’t have that awkward getting to know you phase.",
      "timestamp": "2022-05-10 19:52:19",
      "score": 1,
      "num_children": 1,
      "author": 54569,
      "replies": [
        {
          "id": "i8a43zn",
          "text": "The funniest part to me about that whole thing was how they all accepted it and the original character was basically cast aside like he never existed.",
          "timestamp": "2022-05-12 04:42:41",
          "score": 1,
          "num_children": 0,
          "author": 333213,
          "replies": []
        }
      ]
    },
    {
      "id": "i83c3vk",
      "text": "This happened to me at family reunion when I was little. I didn't know my grandpa had a brother, and I was too scared to meet him.",
      "timestamp": "2022-05-10 19:54:29",
      "score": 1,
      "num_children": 0,
      "author": 297154,
      "replies": []
    },
    {
      "id": "i83cazj",
      "text": "I went to high school with a set of identical twins and I shit you not I didn't know until the day they walked across that stage at graduation.",
      "timestamp": "2022-05-10 19:55:46",
      "score": 1,
      "num_children": 0,
      "author": 131845,
      "replies": []
    },
    {
      "id": "i83crac",
      "text": "Man, it's spooky even when you're aware of the twin. My uncle Bill passed away a couple years ago and my dad said it was *very* strange seeing Bill's identical twin at the funeral, even though he'd met and talked to the guy previously.",
      "timestamp": "2022-05-10 19:58:42",
      "score": 1,
      "num_children": 0,
      "author": 21450,
      "replies": []
    },
    {
      "id": "i83cwmm",
      "text": "This exact thing happened to me with my grandma when I was 12",
      "timestamp": "2022-05-10 19:59:41",
      "score": 1,
      "num_children": 0,
      "author": 295980,
      "replies": []
    },
    {
      "id": "i83dh4j",
      "text": "How can he put his head up. He's dead.",
      "timestamp": "2022-05-10 20:03:22",
      "score": 1,
      "num_children": 0,
      "author": 175913,
      "replies": []
    },
    {
      "id": "i83e6yf",
      "text": "My grandfather had 4 brothers that look EXACTLY like him. This same thing happened to me during his funeral mass. Walked right by them after eating the Jesus cracker when I was 7 years old like What the Fuck.",
      "timestamp": "2022-05-10 20:08:06",
      "score": 1,
      "num_children": 0,
      "author": 357659,
      "replies": []
    },
    {
      "id": "i83edqo",
      "text": "This happened to me as well. My dad died when I was 10 and he had a brother who wasn’t a twin but looked enough like him for 10-year-old me to flip the hell out at the funeral. My mom got mad at me if can you believe it.",
      "timestamp": "2022-05-10 20:09:21",
      "score": 1,
      "num_children": 0,
      "author": 192970,
      "replies": []
    },
    {
      "id": "i83g5sg",
      "text": "This kind of reminds me of the first SAT test I took. I was in the room by myself because with my ADD and other learning disability I have, I got tested and qualified for extra time on the test. I show up and get situated in the assigned room to take the test. The instructor in the room was an elderly man and he looked almost exactly like my grandpa who had died when I was about 8-9. It was so weird. But he’d always fall asleep and somehow managed to wake himself up in time to let me know I had five minutes left lol",
      "timestamp": "2022-05-10 20:21:01",
      "score": 1,
      "num_children": 0,
      "author": 42559,
      "replies": []
    },
    {
      "id": "i83g804",
      "text": "similar happened to me, it was my friends dad, he had a younger brother that looked almond identical like him (they weren't twins).",
      "timestamp": "2022-05-10 20:21:25",
      "score": 1,
      "num_children": 0,
      "author": 164634,
      "replies": []
    },
    {
      "id": "i83ipfo",
      "text": "This happened to the little girl who lived next door to us.  She lives with her grandparents and when her Pop-Pop died, obviously she was heartbroken.  Then his twin walks in and looks IDENTICAL to her pop-pop.   That poor kid was so confused.",
      "timestamp": "2022-05-10 20:37:52",
      "score": 1,
      "num_children": 0,
      "author": 280209,
      "replies": []
    },
    {
      "id": "i83na9w",
      "text": "That’s hilarious! Insert “Brain Damage” meme",
      "timestamp": "2022-05-10 21:08:40",
      "score": 1,
      "num_children": 0,
      "author": 31474,
      "replies": []
    },
    {
      "id": "i83op5x",
      "text": "Probably terrified about who they buried",
      "timestamp": "2022-05-10 21:18:20",
      "score": 1,
      "num_children": 0,
      "author": 7230,
      "replies": []
    },
    {
      "id": "i83r8i5",
      "text": "Had a neighbor dad go to prison for raping his kids. His twin brother shows up a week later to ref my soccer game. The dads went crazy. A heads up on that would’ve been great 😌",
      "timestamp": "2022-05-10 21:35:44",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i83skyk",
      "text": "This never happened to me. With anyone. Ever. \n\nMy somewhat wealthy father had left me out of his will. THAT would have been a nice heads-up. Thanks, the three of you, who knew you were getting it all.",
      "timestamp": "2022-05-10 21:45:11",
      "score": 1,
      "num_children": 0,
      "author": 259343,
      "replies": []
    },
    {
      "id": "i83x4ud",
      "text": "This happened with my grandmother! But I was 8 and I lost my shit.",
      "timestamp": "2022-05-10 22:17:56",
      "score": 1,
      "num_children": 0,
      "author": 158386,
      "replies": []
    },
    {
      "id": "i83xd3w",
      "text": "“I thought you were dead!”\n\n“My death was greatly exaggerated.”",
      "timestamp": "2022-05-10 22:19:34",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i83xs45",
      "text": "Similar story here.Went to a funeral of a friend of the family and after we all gathered at the local lounge to have drinks in her honor.And who walks in the door?Her identical twin sister!Holy shit I just about had a heart attack as well as everyone else at our tables.I guess she was a recluse for many years but came in for her sister's funeral. God damn I've never felt fright like that in my life.And it was only said during the service she was survived by a sister.",
      "timestamp": "2022-05-10 22:22:35",
      "score": 1,
      "num_children": 0,
      "author": 203151,
      "replies": []
    },
    {
      "id": "i83yqql",
      "text": "It's a fantasy that the family has your back. Family, in many cases, can be the worst thing in ones life.",
      "timestamp": "2022-05-10 22:29:37",
      "score": 1,
      "num_children": 0,
      "author": 8100,
      "replies": []
    },
    {
      "id": "i840luy",
      "text": ":0 which one died, Stan or ford",
      "timestamp": "2022-05-10 22:43:16",
      "score": 1,
      "num_children": 0,
      "author": 103927,
      "replies": []
    },
    {
      "id": "i84n4tt",
      "text": "OOOOOOH NOOOOOOOOO!!!",
      "timestamp": "2022-05-11 01:32:51",
      "score": 1,
      "num_children": 0,
      "author": 73773,
      "replies": []
    },
    {
      "id": "i84n6u8",
      "text": "My daughter was about 18 months old the first time she met my stepdad’s twin. She grabbed his leg and held on because we were all laughing. Everyone said that she thought it was her grandpa! She’s nearly 13 and to this day she does a double take when she sees him. It’s still funny.",
      "timestamp": "2022-05-11 01:33:17",
      "score": 1,
      "num_children": 0,
      "author": 369809,
      "replies": []
    },
    {
      "id": "i84tf87",
      "text": "Happened to my fam. Father in law passed. Has an identical, like mirror identical, twin brother. Same mannerisms same voice. I had never met him before the funeral and for me it was a giant mind fk when I first saw him. My husband and I never thought to give anyone on my side of the family who were attending the funeral a heads up. There was also a fair bit of people that attended that didn’t know my FIL was a twin. There were audible gasps. Needless to say even among the sadness we had a bit of a giggle. FIL would have thoroughly enjoyed the shock factor reactions.",
      "timestamp": "2022-05-11 02:20:35",
      "score": 1,
      "num_children": 0,
      "author": 202485,
      "replies": []
    },
    {
      "id": "i84z466",
      "text": "I would have a twin at birth but I ate him and became the stronger twin. Kinda wish I meet him though",
      "timestamp": "2022-05-11 03:04:52",
      "score": 1,
      "num_children": 0,
      "author": 40634,
      "replies": []
    },
    {
      "id": "i84zpre",
      "text": "PLOT TWIST: nobody else can see this twin...",
      "timestamp": "2022-05-11 03:09:53",
      "score": 1,
      "num_children": 0,
      "author": 311526,
      "replies": []
    },
    {
      "id": "i85bly5",
      "text": "ME TOO!",
      "timestamp": "2022-05-11 04:58:27",
      "score": 1,
      "num_children": 0,
      "author": 62796,
      "replies": []
    },
    {
      "id": "i85cha8",
      "text": "Bruh.  Families are so secretive, in my world my family has covered up:  borderline extortion between family members, a few divorces, & a tranny on the family.",
      "timestamp": "2022-05-11 05:07:29",
      "score": 1,
      "num_children": 0,
      "author": 213535,
      "replies": []
    },
    {
      "id": "i85iqm1",
      "text": "This is not uncommon. At my grandma's funeral I found out that she had a sister that was 10 years younger and looked almost the same. Difference being height, hair style, and grandma had a mole on her chin.",
      "timestamp": "2022-05-11 06:19:30",
      "score": 1,
      "num_children": 0,
      "author": 329447,
      "replies": []
    },
    {
      "id": "i85lu28",
      "text": "Yeah my grandpa had a twin also. I never met him in real life but his pictures look identical.",
      "timestamp": "2022-05-11 06:58:54",
      "score": 1,
      "num_children": 0,
      "author": 128539,
      "replies": []
    },
    {
      "id": "i85n3du",
      "text": "d jl. 248 240. 248 240 24 24 240 248 24 \n240 g",
      "timestamp": "2022-05-11 07:15:47",
      "score": 1,
      "num_children": 0,
      "author": 268710,
      "replies": []
    },
    {
      "id": "i85w4o6",
      "text": "My grandfather had 6 brothers, each about a year apart in age. They all looked almost identical for all of their lives. Even they couldn’t tell who was who in old photos. \n\nAnyway family reunions were always super confusing for us grandkids, all running around looking for our Pops only to run into 6 other guys who look just like your Pop but isn’t.",
      "timestamp": "2022-05-11 09:25:47",
      "score": 1,
      "num_children": 0,
      "author": 322597,
      "replies": []
    },
    {
      "id": "i89pgbe",
      "text": "One of my late friends had an unwitting doppelgänger. I ran into her, and almost ran out of the place screaming. Weirdest moment, ever.",
      "timestamp": "2022-05-12 02:32:55",
      "score": 1,
      "num_children": 0,
      "author": 282575,
      "replies": []
    },
    {
      "id": "i8l2buy",
      "text": "This happened to me too actually.  Family never thought to tell me about my Noni’s identical twin.   I just saw what I saw and I was petrified. Why wouldn’t anyone know that’s an important thing to talk about",
      "timestamp": "2022-05-14 15:19:21",
      "score": 1,
      "num_children": 0,
      "author": 153848,
      "replies": []
    },
    {
      "id": "i8s4d19",
      "text": "This happened to me. It was an emotional rollercoaster.",
      "timestamp": "2022-05-16 04:02:25",
      "score": 1,
      "num_children": 0,
      "author": 213242,
      "replies": []
    },
    {
      "id": "iercgxf",
      "text": "This reminds me of the video on Reddit of a toddler meeting his moms identical twin sister, and the kid being REALLY confused, on the verge of terrified.",
      "timestamp": "2022-07-03 23:58:26",
      "score": 1,
      "num_children": 0,
      "author": 28052,
      "replies": []
    }
  ]
}