{
  "id": "upf7r7",
  "text": "A Christian school in Kentucky had kids write letters persuading a friend to stop being gay | Hemant: \"The overall goal is turn these kids into future bigots like the adults running this school...schools like this use religion as cover to indoctrinate children with hateful, evidence-free beliefs\"\n",
  "timestamp": "2022-05-14 11:23:17",
  "score": 17359,
  "subreddit": "t5_2qh2p",
  "num_children": 159,
  "author": 221311,
  "replies": [
    {
      "id": "i8l5og3",
      "text": "Hello r/all, Welcome to r/atheism!\n\nPlease read our [Commandments](http://www.reddit.com/r/atheism/wiki/guidelines) and [FAQ](http://www.reddit.com/r/atheism/wiki/FAQ) before commenting. If you follow the rules and act civilly we can avoid a lot of bans. While everyone is welcome here, this sub is intended for atheists to discuss things of interest to us. This means that a wide variety of subjects are on-topic here. This is not a sub about just atheism.\n\nRemember: The mods do not choose which posts get voted up the frontpage. They remove the posts that violate the [Commandments](/r/atheism/w/guidelines); they don't police quality.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*",
      "timestamp": "2022-05-14 15:44:52",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "i8ke94c",
      "text": "their friends are smart enough NOT to share their deepest selves with these people. \n\ni finally got to apologize to my bestie from High school for not having been a safe person for her to come out to (she came out 3 years after HS and we had lost contact). \ni was trained to not only write these letters BUT also verbalize all those horrible things to people of the LGBTQ+ community. \ni deeply regret these past beliefs & am making active attempts to make ammends for horrible things i said when i was an Evengelical.",
      "timestamp": "2022-05-14 11:39:15",
      "score": 618,
      "num_children": 7,
      "author": 213146,
      "replies": [
        {
          "id": "i8l52bp",
          "text": "I think that reaching out and attempting to apologize says a lot to how much you’ve changed after leaving evengelical thoughts behind. If you don’t mind me asking “are you besties again? Or have you gone your separate ways?” \n\nIt’s understandable if you don’t answer.\n\nEdited: I wasn’t expecting nearly 100 up votes thanks",
          "timestamp": "2022-05-14 15:40:15",
          "score": 133,
          "num_children": 0,
          "author": 379416,
          "replies": []
        },
        {
          "id": "i8l6j0j",
          "text": "I know I'm just a random gay guy from the internet but this is so nice to hear. A close friend of mine reacted so awfully when I came out to her and it's always stuck with me. One of the stranger things she said to me was that I should try to find a manly looking woman to date as maybe I'd be more attracted to a manly woman.",
          "timestamp": "2022-05-14 15:51:15",
          "score": 79,
          "num_children": 2,
          "author": 143350,
          "replies": [
            {
              "id": "i8ltyfz",
              "text": "The best way to stop Christians is to spread the word that Jesus was gay.",
              "timestamp": "2022-05-14 18:48:03",
              "score": 59,
              "num_children": 3,
              "author": 282475,
              "replies": [
                {
                  "id": "i8lv2ut",
                  "text": "[deleted]",
                  "timestamp": "2022-05-14 18:56:39",
                  "score": 58,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "i8m3qaw",
                      "text": "The Last Supper was an orgy.",
                      "timestamp": "2022-05-14 20:04:11",
                      "score": 38,
                      "num_children": 1,
                      "author": 38033,
                      "replies": [
                        {
                          "id": "i8m7mc9",
                          "text": "Break this bread, for it is my body, and drink this wine, for it is my blood\n\nAnd for dessert, eat this cake, for it is my ass",
                          "timestamp": "2022-05-14 20:34:01",
                          "score": 48,
                          "num_children": 1,
                          "author": 334526,
                          "replies": [
                            {
                              "id": "i8q9wtu",
                              "text": "I needed that laugh, thanks 😊",
                              "timestamp": "2022-05-15 19:18:37",
                              "score": 3,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i8mdfcj",
                      "text": "He liked hanging out with whores too, the disciples were just his bros.",
                      "timestamp": "2022-05-14 21:18:44",
                      "score": 13,
                      "num_children": 1,
                      "author": 59659,
                      "replies": [
                        {
                          "id": "i8mfb1j",
                          "text": "If he's your bro, it's no homo. There's definitely an evangelical somewhere that's said that and meant it.",
                          "timestamp": "2022-05-14 21:33:08",
                          "score": 13,
                          "num_children": 0,
                          "author": 182010,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i8o3ky7",
                  "text": "Sorry to burst your bubble, but Christians do not care what Jesus said or did. They only care what someone said Jesus said or did. To love the bible makes you a Christian. To read and understand the bible makes you an Atheist.",
                  "timestamp": "2022-05-15 06:49:56",
                  "score": 8,
                  "num_children": 0,
                  "author": 111092,
                  "replies": []
                },
                {
                  "id": "i8m3esr",
                  "text": "That’s not the best way to stop Christians",
                  "timestamp": "2022-05-14 20:01:46",
                  "score": 4,
                  "num_children": 0,
                  "author": 195161,
                  "replies": []
                }
              ]
            },
            {
              "id": "i8lmiz9",
              "text": "I like the idea that gay/bi people don’t consider this themselves?",
              "timestamp": "2022-05-14 17:51:33",
              "score": 14,
              "num_children": 0,
              "author": 78173,
              "replies": []
            }
          ]
        },
        {
          "id": "i8lfyeb",
          "text": "in 2009 (after 9 years) we were finally able to reconnect having both moved back to our town of birth. \nand while we both deconstructed from Christianity, the paths we took each were vastly different. \nand its a small comfort to have a singular remenant of my childhood…now aligned with my current goals & life.",
          "timestamp": "2022-05-14 17:01:37",
          "score": 27,
          "num_children": 0,
          "author": 213146,
          "replies": []
        },
        {
          "id": "i8lc4wv",
          "text": "It's nice that you're trying to make right, but I hope you realize that the conversations you're having are about you, not about them. It's been so long that they've already healed. It's the plight of the gay person.\n\nThose people you've hurt have had to overcome that damage from you and countless others to move on with their lives. There's literally nothing you can do to make it right, and it's been so long that the scars are already in place. \n\nYour amends aren't about them, they're about you. About relieving your guilt and shame. \n\nSo just realize that you aren't doing anything for them, you're asking them to do something for you. \n\nAnd I'm not trying to be bitter or jaded or nasty. I think you deserve that relief, to an extent. But just realize that it's by their grace that you receive it.",
          "timestamp": "2022-05-14 16:33:06",
          "score": 18,
          "num_children": 5,
          "author": 19864,
          "replies": [
            {
              "id": "i8lfjo6",
              "text": "I think about this a lot. \n\nI said some racist things to a friend in high school. I wasn’t trying to be racist and I really liked that person. I didn’t know any better. I thought I was being funny. I didn’t understand why he acted hurt and I didn’t realize what I’d really done until years later. I feel horrible about it now. \n\nI’ve spent 20 years wondering if I should apologize to him. I looked him up on Facebook years ago and almost wrote a message. But I looked at his pictures and he looked happy. I doubt he’s thought about me in particular since high school. What I said was one of a million comments he’d dealt with in his life. For me it was this one huge thing. For him it was just every day.\n\nI was just looking to relieve my guilt. But for him I would be digging up old stuff and putting him in a position where it felt like he needed to forgive me. \n\nBut he doesn’t. I don’t deserve forgiveness. I need to use the shitty feeling I get thinking about it to help me not make that mistake in the future. I don’t need him to tell me it’s ok. Because it isn’t and wasn’t. I don’t need him to congratulate me on overcoming prejudices, because I’m never going to be done working to get rid of them. \n\nI don’t feel I have the right to bring all this stuff up to him again just because I feel bad.",
              "timestamp": "2022-05-14 16:58:30",
              "score": 40,
              "num_children": 5,
              "author": 125626,
              "replies": [
                {
                  "id": "i8lh6s6",
                  "text": "[deleted]",
                  "timestamp": "2022-05-14 17:11:00",
                  "score": 24,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i8lmrfg",
                      "text": "You make a good point. I have friends who have said they'll exact harm on people who express homophobic sentiment. \n\nI vehemently disagree with that. To their confusion. \n\nI try to explain that it took me *years* to become okay with myself.  I knew I was gay when I was around 11. At least, that's when I started having sexual urges and believed something wasn't \"right.\"  I fought it through middle and high school. By the time I was 16, I had given up on a plan for the future and replaced it with a plan to kill myself. \n\nIt took me over a decade to finally come to terms with who I am. And at 34, there are times where I still feel broken and wrong.\n\nI firmly believe that those who express homophobic (or other bigoted) sentiment are worthy of grace. Because if I didn't allow myself that same grace, I wouldn't be here.",
                      "timestamp": "2022-05-14 17:53:18",
                      "score": 14,
                      "num_children": 1,
                      "author": 19864,
                      "replies": [
                        {
                          "id": "i8ltejg",
                          "text": "You are loved! The broken parts only makes us thicker. It's always comforting knowing that you can feel, even the heaviest feelings but you can and you can overcome anything because you're here and now. It would be misery to live cutting your branches until you become a solid piece of wood to fit in what's right",
                          "timestamp": "2022-05-14 18:43:47",
                          "score": 9,
                          "num_children": 0,
                          "author": 206960,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i8m4e0l",
                  "text": "I had a friend in high school who me and my best friend hung out with in 10th and 11th grade. Senior year he started hanging out with some of the \" A-listers\" and not only stopped hanging out with us, but actively joined them in harassing and bullying us for being nerds. \n   35 years later he found me on FB and said he's been looking for me forever to apologize for what he did as a 12th grader. It haunted him for years. He said he even made a point of teaching his kids to not bully others because of what he had done.\n   I was tempted to say \" I was in therapy for years after high school, couldn't function in society and nearly killed myself etc\" but I told him the truth, that it didn't affect me or my friend all that much since we had each other and other friends as well, and I had mostly forgotten about it. But for him, it was cathartic and a big relief for him to know I was okay.",
                  "timestamp": "2022-05-14 20:09:14",
                  "score": 12,
                  "num_children": 0,
                  "author": 127810,
                  "replies": []
                },
                {
                  "id": "i8lidwd",
                  "text": "There might be a way to say sorry and reduce the ask from his side. A gift with a note and no return address might work. Include something like \"if you want to look me up I'm ##### on twitter, if not I understand and hope this finds you well\".",
                  "timestamp": "2022-05-14 17:20:10",
                  "score": 8,
                  "num_children": 0,
                  "author": 317138,
                  "replies": []
                },
                {
                  "id": "i8n80pm",
                  "text": "It’s such a hard thing to judge.      \n        \nFor one person, someone reaching from the past and saying sorry can mean the world.      \n\nFor the next it will just drag up old memories that they prefer to leave in the past.     \n     \nI had a friend who decided to reach out to the persons partner first, and they said you are better off leaving it in the past, so he did.",
                  "timestamp": "2022-05-15 01:25:26",
                  "score": 3,
                  "num_children": 0,
                  "author": 122682,
                  "replies": []
                },
                {
                  "id": "i8libgu",
                  "text": "So you're mostly there. \n\nYou do deserve forgiveness. Maybe not from him. But you do deserve it, regardless. You've already realized he has no obligation to give it to you. You've already realized your apology would be an act for you, not for him. \n\nStill, you deserve forgiveness. You've changed.  You've looked at yourself and realized what you thought you knew was wrong. That the way you acted was wrong. You have regret. You hold love in your heart. \n\nThat is worthy of forgiveness. \n\nForgiveness is something we grant ourselves, but also something granted from others.  Sometimes our transgressions are so great that we can't remediate them ourselves. \n\nIf you really feel a need to reach out to him, then don't pretend it's about him.  Because that's the worst part, and that's what I wanted to address.\n\nTell him you apologize not only for past acts, but for bringing them up again. Tell him you aren't asking for his forgiveness, because you know he's moved far beyond the hurt you caused him, but you just wanted to let him know that you've changed.  Because even though you can't make it right, at least you know you were wrong.  So he can rest a little easier knowing that.",
                  "timestamp": "2022-05-14 17:19:40",
                  "score": 7,
                  "num_children": 0,
                  "author": 19864,
                  "replies": []
                }
              ]
            },
            {
              "id": "i8m0dnk",
              "text": "Coming from the other end I was raised in a conservative Christian homeschooling environment and my assigned \"friend\" (yeah, it was weird like that, but we were girls of the same age in the same homeschool group, so we were \"friended\" together) participated in an intervention to try to keep me from \"losing my faith\" and from that point forward, I didn't think of her as a safe person. Years later, after we both grew up and got Facebook, I accepted her friend request but still was bitter and didn't trust her. Finally, in my 30s, I brought it up to her and she remembered and apologized profusely. Apparently she was coerced into it by her own parents, and since then, her parents did the same thing to her when she got got divorced from her husband (a pastor) and again when she came out as a lesbian and learned how hurtful it was. Knowing all that, and knowing that she now knows better gave me closure, and now instead of being angry or hurt, it's just a \"funny story from my childhood\". The Christianity (and the adults enforcing it) is the toxic, hurtful force, not the children once trapped in it.",
              "timestamp": "2022-05-14 19:38:08",
              "score": 13,
              "num_children": 0,
              "author": 306795,
              "replies": []
            },
            {
              "id": "i8lhbky",
              "text": "Don't assume others would not want or accept an apology based solely on your experiences.",
              "timestamp": "2022-05-14 17:12:03",
              "score": 9,
              "num_children": 2,
              "author": 373865,
              "replies": [
                {
                  "id": "i8ljxg0",
                  "text": "Sure, no one can speak for everyone.\n\nIt's just that generally speaking, I find these redemptionist apologies to be more about the giver than the receiver.  \n\nIt gets old not only healing from your trauma, but having to bear the weight of those who caused it. \n\nThere is a way to go about it. And it should be centered on the receiver.  That's all I wanted to convey.",
                  "timestamp": "2022-05-14 17:31:52",
                  "score": 4,
                  "num_children": 0,
                  "author": 19864,
                  "replies": []
                },
                {
                  "id": "i8lrxp4",
                  "text": "Don't assume either way, and let them address it if they really want to. Those who are the transgressors have the responsibility of putting the other person first. If the other person wants an apology then let them tell you that. Don't assume they do or do not. Respect their boundaries. That is the general point.",
                  "timestamp": "2022-05-14 18:32:40",
                  "score": 0,
                  "num_children": 1,
                  "author": 284438,
                  "replies": [
                    {
                      "id": "i8lu94i",
                      "text": "Mmmm people forget to listen to what they truly want, what the heart is asking for. It's true sometimes apologies feel selfish when they don't come with a whole changed persona. At the same time we are free to mistake, express what hurts us and if you feel like reaching out maybe waking that up that person will know how to deal with it regardless of your imaginative weakness.  We're love! Stop the voice in the head a little and love more. If you love that person, what do you really want to do for them? Or is it that you are trying to love yourself thru the love others give you with their forgiveness? That's another way to validate love to yourself. Insecurities only hurt so do it with you heart and go all in!",
                      "timestamp": "2022-05-14 18:50:16",
                      "score": 1,
                      "num_children": 0,
                      "author": 206960,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i8lrm3h",
              "text": "Thank you. This is the main reason I don't reach out to the person I wish so badly I had treated better. But it wouldn't be right to force her to relive what happened when we were 10 years old. She's been through too much in her life, and it just wouldn't be fair to do that to her.",
              "timestamp": "2022-05-14 18:30:09",
              "score": 2,
              "num_children": 0,
              "author": 284438,
              "replies": []
            },
            {
              "id": "i8lsj8k",
              "text": "True. We can actively help society but it comes within your hand what you GIVE to lgbtq+ community. \nI share this thought.  You can do more and you have done great! There's more children, teens and adults that need our help to be at peace (being part ot not of lgbtq+)",
              "timestamp": "2022-05-14 18:37:16",
              "score": 2,
              "num_children": 0,
              "author": 206960,
              "replies": []
            }
          ]
        },
        {
          "id": "i8lxvw4",
          "text": "Yes, but they didn't do the full number on you unless you did it because you cared about them. Seriously, fuck those guys.",
          "timestamp": "2022-05-14 19:18:36",
          "score": 2,
          "num_children": 0,
          "author": 152598,
          "replies": []
        },
        {
          "id": "i8m90g4",
          "text": "Thank you. \n\nThat sounds like sincere atonement.",
          "timestamp": "2022-05-14 20:44:38",
          "score": 1,
          "num_children": 0,
          "author": 233835,
          "replies": []
        },
        {
          "id": "i8nz373",
          "text": "ReMindme! 2 days",
          "timestamp": "2022-05-15 05:51:18",
          "score": 1,
          "num_children": 0,
          "author": 322389,
          "replies": []
        }
      ]
    },
    {
      "id": "i8ki7k1",
      "text": "> An “excellent” score is given to kids who quote from Scripture, communicate “truth lovingly,” and have a “logical argument to persuade.”\n\nLogical? Lol.",
      "timestamp": "2022-05-14 12:23:43",
      "score": 158,
      "num_children": 3,
      "author": 342614,
      "replies": [
        {
          "id": "i8kra5x",
          "text": "'Use this book of make believe fairy tales as evidence for your arguments.'",
          "timestamp": "2022-05-14 13:49:49",
          "score": 73,
          "num_children": 0,
          "author": 224735,
          "replies": []
        },
        {
          "id": "i8l7hpy",
          "text": "What would a \"logical\" argument against being gay even sound like? It's an issue entirely driven by \"gayness is bad because it makes me feel yucky inside\".",
          "timestamp": "2022-05-14 15:58:31",
          "score": 44,
          "num_children": 4,
          "replies": [
            {
              "id": "i8l99t8",
              "text": "Well you see it was Adam and Eve so therefore it couldn’t have been Adam and Steve",
              "timestamp": "2022-05-14 16:11:57",
              "score": 17,
              "num_children": 0,
              "author": 408481,
              "replies": []
            },
            {
              "id": "i8ld8dw",
              "text": "\"Dicks are gross. Boobs are awesome. QED.\"\n\nJust don't show this to any women. Could end the human race as we know it.",
              "timestamp": "2022-05-14 16:41:06",
              "score": 13,
              "num_children": 0,
              "author": 66832,
              "replies": []
            },
            {
              "id": "i8mop39",
              "text": "\"You're making our teacher needlessly aroused and that makes it harder for him to teach classes. Besides, his self-restraint might fail him and if he rapes you, he'll be in trouble. Please think of the adults.\".\n\nSomething like this?",
              "timestamp": "2022-05-14 22:46:19",
              "score": 8,
              "num_children": 0,
              "author": 301366,
              "replies": []
            },
            {
              "id": "i8mlkg3",
              "text": "Yes!",
              "timestamp": "2022-05-14 22:21:48",
              "score": 3,
              "num_children": 0,
              "author": 342614,
              "replies": []
            }
          ]
        },
        {
          "id": "i8psdz5",
          "text": "https://imgur.com/a/shP04RD \n\nWhat CAL thinks are \"logical arguments against homosexuality\". Highlights not my own.",
          "timestamp": "2022-05-15 17:10:20",
          "score": 2,
          "num_children": 1,
          "author": 91003,
          "replies": [
            {
              "id": "i8qrntf",
              "text": "That made my brain hurt.",
              "timestamp": "2022-05-15 21:28:29",
              "score": 1,
              "num_children": 0,
              "author": 342614,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i8kdlfo",
      "text": "Okay, kids, that didn’t work because your love for Jesus isn’t strong enough, so we’re going to have to move on to Phase 2: beating the gay out of them on the playground and in the locker room. \n\nGo show how much you love Jesus! \n\nBoys, try not to get too aroused, though.",
      "timestamp": "2022-05-14 11:31:18",
      "score": 832,
      "num_children": 6,
      "author": 367491,
      "replies": [
        {
          "id": "i8kof3n",
          "text": "Okay so I teach and some of the boys will literally just pop up at recess like \"MR, HE'S GAY!!\" while pointing at each other. I always reply with \"there isn't anything wrong with being gay\"\n\nThese kids will use gay as an insult, but then I see them spinning in circles in the playground holding hands after derogatorily calling each other gay and I'm just sitting there like...\n\n\"....what... is even....huh?\"\n\nI'm left with more questions than answers lol",
          "timestamp": "2022-05-14 13:24:41",
          "score": 278,
          "num_children": 5,
          "replies": [
            {
              "id": "i8ktycy",
              "text": "I’ve also moved into teaching middle schoolers over the past couple years, and I’ve also found their leering anticipation of my reaction to be pretty gross. \n\nTattling is a learned behavior, and I’m a teacher, not a Stasi informant, so I’ve just started replying quietly, “Your wanting to see him punished says a lot more about you than it does about him.” \n\nOnce they see I’m not willing to play along, they give up and have to find a new way to torment their friends.",
              "timestamp": "2022-05-14 14:12:17",
              "score": 166,
              "num_children": 4,
              "author": 367491,
              "replies": [
                {
                  "id": "i8kzzlc",
                  "text": "I had a teacher who would punish the kids who told on other kids rather than punish the kids who did something wrong.\n\nThat shit stopped real fast.. lol",
                  "timestamp": "2022-05-14 15:01:01",
                  "score": 82,
                  "num_children": 3,
                  "replies": [
                    {
                      "id": "i8l06m2",
                      "text": "Usually the kid telling on other kids is also doing something wrong. I get this one a lot \n\n\"Mr! So 'n' so is on their phone! You have to take it away!\"\n\n\"Okay, if we're following the rules you need to give me the airpods you think you are hiding from me in your hair, do you want to play this game right now?\"",
                      "timestamp": "2022-05-14 15:02:33",
                      "score": 79,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "i8lktyc",
                          "text": "I had this shit happen at work.\n\nBossman was like \"ok, if you want to go there how about we start with you being late everyday.\"\n\nThey shut up real fucking quick.",
                          "timestamp": "2022-05-14 17:38:48",
                          "score": 28,
                          "num_children": 1,
                          "author": 363699,
                          "replies": [
                            {
                              "id": "i8mtd5a",
                              "text": "We have a coworker who is late everyday, usually not too long 10 min tops. We've just started asking her what flavor of coffee made her late today cuz she always has some drive through coffee with her lol",
                              "timestamp": "2022-05-14 23:22:27",
                              "score": 9,
                              "num_children": 2,
                              "author": 2190,
                              "replies": [
                                {
                                  "id": "i8op6a3",
                                  "text": "Just get Flexi time. No more late then",
                                  "timestamp": "2022-05-15 11:48:47",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 391283,
                                  "replies": []
                                },
                                {
                                  "id": "i8o361g",
                                  "text": "That's a definite rub. If I'm leaving past when I usually should im not going to stop and add 7 minutes or more for coffee.",
                                  "timestamp": "2022-05-15 06:44:27",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 225198,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i8op34w",
                          "text": "So it's a deflection technique",
                          "timestamp": "2022-05-15 11:47:48",
                          "score": 1,
                          "num_children": 1,
                          "author": 391283,
                          "replies": [
                            {
                              "id": "i8q3o66",
                              "text": "More or less. If we're at the end of the year and you're listening to your airpods, you're choosing to fail. I'm going to help the other kids and not bother stopping class to pick up all the airpods",
                              "timestamp": "2022-05-15 18:32:20",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i8ld5l5",
                      "text": "Teaching kids to not snitch is important.",
                      "timestamp": "2022-05-14 16:40:33",
                      "score": 9,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i8lkz1k",
                          "text": "It's not so black and white. That mentality is also why some school shootings happen even when other kids knew it might.\n\nhttps://www.latimes.com/nation/la-na-florida-shooting-research-20180216-story.html\n\n>In 81% of the incidents, at least one person had information that the attacker was thinking about or planning a school attack. In more than half of the incidents — 59% — more than one person knew, according to the study, which was conducted jointly by the U.S. Secret Service and U.S. Department of Education.\n\n>Jeff Daniels, a professor of counseling psychology at West Virginia University, said one reason students don’t tell teachers or administrators about potential threats is because of a “code of silence” that can exist among young people. Students sometimes don’t want to be seen as a “snitch,” he said.",
                          "timestamp": "2022-05-14 17:39:54",
                          "score": 29,
                          "num_children": 3,
                          "author": 73941,
                          "replies": [
                            {
                              "id": "i8lov6q",
                              "text": "There needs to be a clear line between \"tattling\" and getting help. This literally made me think of stuff from when I was a kid, things like \"person A is throwing things at person B\", \"person A is threatening person B\" \"person A just hit person B\" gets thrown in the same box as \"person A has their cell phone out\" -_- note: first 3 are examples from my own life.\nI literally knew someone who got out of school suspension because his bully hit him and broke his finger in the process. Teachers didn't see but he tried to tell a teacher. He had a black eye but other kid had a broken finger. The teachers had ignored him every time he tried to \"tattle\" on his bullies because \"they didn't see it\" there should be a clear line, but there's not, apparently not for (some) teachers, and especially for kids. I had someone who repeatedly hit me upside the head with a notebook, tried telling, got brushed off and had other kids calling me a tattletale. Thankfully he ended up doing it in front of a teacher and got told off.\nI feel like specifying this was all sooo many years ago, I'm in my late 20's and these are middle school memories. I am perfectly safe. Previous comments had me annoyed and the one I'm replying to specifically made me go \"thank goodness someone said something\".",
                              "timestamp": "2022-05-14 18:09:14",
                              "score": 11,
                              "num_children": 2,
                              "author": 4693,
                              "replies": [
                                {
                                  "id": "i8ls711",
                                  "text": "Well, the problem is that there just isn't a clear line - it's a spectrum - and that's hard to convey with kids. Many adults want to keep everything simple for them, so they end up with the dumb policies like always punishing the tattler or punishing everyone or whatever. \n\nAnd different kids are wired differently. My daughter is an adult, and to this day gets stressed out when people are breaking rules. That didn't come from us. When she was little, I'd pick her up from school and she'd be upset because she saw one of the other kids chewing gum in class. I'd ask why it bothered her so much and she'd say because it's against the rules. I'd tell her that, for something that isn't hurting anyone else, she should just let the teacher deal with it, and there was no reason to stress over it, but stuff like that always bothered her, and the adult equivalents still do today.",
                                  "timestamp": "2022-05-14 18:34:42",
                                  "score": 12,
                                  "num_children": 1,
                                  "author": 73941,
                                  "replies": [
                                    {
                                      "id": "i8optlp",
                                      "text": "Tbh I lump this in with my black and white view of the world as an autistic. So could be somthing there to mild to count but still leaking out",
                                      "timestamp": "2022-05-15 11:55:59",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 391283,
                                      "replies": [
                                        {
                                          "id": "i8pno0m",
                                          "text": "Oh, I do think there's a good possibility that she's on the spectrum. Mild, like you say, but there are a few indicators.",
                                          "timestamp": "2022-05-15 16:36:12",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 73941,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "i8m7kl4",
                                  "text": "Was also bullied. Authorities were not there to help. Snitching only ever causes problems.",
                                  "timestamp": "2022-05-14 20:33:38",
                                  "score": 4,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "i8m7ehw",
                              "text": "Cops kill way more kids than kids do.\n\nAlso, cops don't really stop violence... Maybe ever? Like in school shootings for example, they notoriously tend to just wait it out til the shooter runs out of rounds or kills himself.",
                              "timestamp": "2022-05-14 20:32:20",
                              "score": 7,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "i8m7oh5",
                                  "text": "If you have a problem and call the cops, now you have two problems.",
                                  "timestamp": "2022-05-14 20:34:29",
                                  "score": 12,
                                  "num_children": 1,
                                  "author": 58930,
                                  "replies": [
                                    {
                                      "id": "i8nwem3",
                                      "text": "I mean, best case it's just a Jason Mendoza type solution.",
                                      "timestamp": "2022-05-15 05:18:57",
                                      "score": 1,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "i8m8hjw",
                                  "text": "What does any of that have to do with this thread or my comment?",
                                  "timestamp": "2022-05-14 20:40:42",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 73941,
                                  "replies": [
                                    {
                                      "id": "i8nwlcu",
                                      "text": "There is no broad institutional roadblock to the mass murder of children, even when the future killers identity and means are known. And when you snitch, you're not stopping anything bad, but you are potentially hurting someone-its actually more likely to cause harm if you were wrong.",
                                      "timestamp": "2022-05-15 05:21:03",
                                      "score": 0,
                                      "num_children": 2,
                                      "replies": [
                                        {
                                          "id": "i8o0kmt",
                                          "text": "Wow, I can't believe you're suggesting that someone who is aware of plans by a student to shoot other students shouldn't report it because the cops might be worse. What the hell kind of world do you live in?",
                                          "timestamp": "2022-05-15 06:10:20",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 73941,
                                          "replies": []
                                        },
                                        {
                                          "id": "i8oh14e",
                                          "text": "God forbid a little murderer gets suspended",
                                          "timestamp": "2022-05-15 10:00:56",
                                          "score": 1,
                                          "num_children": 2,
                                          "author": 397099,
                                          "replies": [
                                            {
                                              "id": "i8oh60b",
                                              "text": "God forbid a kid that acts in a suspicious way and is innocent gets suspended. The horror that inflicts on the nice kid obviously drives him to become a murderer.",
                                              "timestamp": "2022-05-15 10:02:55",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 397099,
                                              "replies": []
                                            },
                                            {
                                              "id": "i8q6gt7",
                                              "text": "Yes. Suspending school shooters absolutely stops them from doing the thing. Being told to stay home for a couple days and farther isolated is the solution. Thank God we live in a functional society with a real future.",
                                              "timestamp": "2022-05-15 18:52:57",
                                              "score": 1,
                                              "num_children": 0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "i8ogjz6",
                              "text": "\"Snitch\" is different in different circumstances and our kids are not morons. They know the difference from \"snitch\" he used a fake hall pass and \"snitch\" I'm being mean and trying to get this person in trouble and \"snitch\" I think this person is dangerous.",
                              "timestamp": "2022-05-15 09:54:05",
                              "score": 1,
                              "num_children": 1,
                              "author": 397099,
                              "replies": [
                                {
                                  "id": "i8pn7fg",
                                  "text": "I worked at a school when I was in college. No, many young kids don't know that distinction, and that's my point. Even some adults are pretty black and white about it - read the other responses to my comment.",
                                  "timestamp": "2022-05-15 16:32:58",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 73941,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i8op1ti",
                      "text": "So what happend to the wrong doers? All that teaches is that doing wrogn goes unpunished and that reporting is bad",
                      "timestamp": "2022-05-15 11:47:22",
                      "score": 1,
                      "num_children": 0,
                      "author": 391283,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i8lufif",
                  "text": "I remember being in middle school. Essentially everything I said or did was to get a rise out of someone and nothing else. Kids are assholes.",
                  "timestamp": "2022-05-14 18:51:40",
                  "score": 6,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "i8ooyrg",
                  "text": "I teach at a cadets squad. Kids are just evil shits overall",
                  "timestamp": "2022-05-15 11:46:24",
                  "score": 1,
                  "num_children": 1,
                  "author": 391283,
                  "replies": [
                    {
                      "id": "i8otjlz",
                      "text": "Whose job is it to teach them not to be?",
                      "timestamp": "2022-05-15 12:35:22",
                      "score": 1,
                      "num_children": 0,
                      "author": 367491,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i8malsx",
                  "text": "That sounds like you just instead created more of a circle of social enforcement for what is appriate to be talked about rather than listening to why the children are bringing up issues.  If anything you are acting a bit more like a stasi informant by enforcing that information within the circle should be kept within the circle",
                  "timestamp": "2022-05-14 20:56:59",
                  "score": 0,
                  "num_children": 1,
                  "author": 37279,
                  "replies": [
                    {
                      "id": "i8n9y97",
                      "text": "Well, since you bring it up, one of the things that I learned at a Stasi Interrogation course at a dim warehouse in East Berlin was how to interpret nonverbal cues to determine whether or not a captive is being truthful. \n\nKids at this age have an awful lot of tells. If I see the faintest indication that the kid is not just trying to get attention, mess with a friend, or waste class time, I follow through.  I’m an atheist, not an amoral, ambivalent monster.",
                      "timestamp": "2022-05-15 01:42:31",
                      "score": 2,
                      "num_children": 0,
                      "author": 367491,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i8llstz",
              "text": "I think a lot of young kids are rightfully confused about the acceptance of things and more than likely are testing the waters of general reaction by accusing others of the exact feelings they fear might be socially harming to explore or admit.",
              "timestamp": "2022-05-14 17:46:09",
              "score": 12,
              "num_children": 2,
              "author": 178660,
              "replies": [
                {
                  "id": "i8lrvhk",
                  "text": "I agree. I was confused and I'm sure some of them may be. That was the point of my post \n\nSOME people are misreading what I posted, though",
                  "timestamp": "2022-05-14 18:32:12",
                  "score": 4,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i8lucuk",
                      "text": "You handle it beautifully in my opinion and I know many humans whose lives would've benefitted extremely from an authority figure like yourself helping young impressionable minds know that they, their feelings, and all people's feelings are valid.",
                      "timestamp": "2022-05-14 18:51:05",
                      "score": 1,
                      "num_children": 0,
                      "author": 178660,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i8opwnh",
                  "text": "That sounds way too complex for a kid",
                  "timestamp": "2022-05-15 11:56:54",
                  "score": 1,
                  "num_children": 0,
                  "author": 391283,
                  "replies": []
                }
              ]
            },
            {
              "id": "i8l8i8s",
              "text": "[deleted]",
              "timestamp": "2022-05-14 16:06:08",
              "score": -7,
              "num_children": 3,
              "replies": [
                {
                  "id": "i8l9n1y",
                  "text": "I was also confused but I think they mean that the kids will happily do something that could also be called ‘gay’, so maybe the kids don’t even really have an understanding of what gay is?",
                  "timestamp": "2022-05-14 16:14:41",
                  "score": 8,
                  "num_children": 0,
                  "author": 171626,
                  "replies": []
                },
                {
                  "id": "i8lk9qq",
                  "text": "The point is the anti gay behavior/rhetoric is learned from bigoted adults.  Kids don’t care… holding hands and having fun is natural. \n\nEver been to south east Asia? Male adults hold hands just walking around. It’s a sign of friendship and caring. It’s normal for them.  And NOT gay.\n\nEdit: Parts of south east Asia, and South Asia, ie Pakistan.",
                  "timestamp": "2022-05-14 17:34:28",
                  "score": 6,
                  "num_children": 1,
                  "author": 264700,
                  "replies": [
                    {
                      "id": "i8lnczw",
                      "text": "This... Isn't really true.\n\nI live in southeast Asia, if you're holding hands, you're typically intimate with that person somewhat.\n\nYou might be thinking of South Asia/the Indian Subcontinent, where what you're saying is true to some extent. Some migrant workers from that region working in southeast Asia will display that type of behaviour here as well, but it definitely isn't an intrinsically southeast Asian thing. Its their own culture that they've simply brought with them to our region, and we don't question it.",
                      "timestamp": "2022-05-14 17:57:54",
                      "score": -2,
                      "num_children": 1,
                      "author": 119539,
                      "replies": [
                        {
                          "id": "i8lsb80",
                          "text": "Notice my broad stroke.  It’s not fully inclusive, or shouldn’t be taken that way. I updated my post.  I worked with the UN a while back and all the military guys from South Asia and south east Asia held hands everywhere they went….everywhere.  First time I saw that. I’m from the US and no one here does that at all, u less they’re intimate.",
                          "timestamp": "2022-05-14 18:35:35",
                          "score": 1,
                          "num_children": 0,
                          "author": 264700,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i8lcmab",
                  "text": "So, like, \n\nThey attack each other and make fun of each other for being 'gay' if they accidentally tap each other, but then will be spinning in circles holding hands trying to get dizzy and stuff\n\nI'm just sitting there thinking....\n\nPick a lane?",
                  "timestamp": "2022-05-14 16:36:35",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i8liji2",
                      "text": "[deleted]",
                      "timestamp": "2022-05-14 17:21:19",
                      "score": -1,
                      "num_children": 3,
                      "replies": [
                        {
                          "id": "i8lk8dx",
                          "text": "Technically yes but that’s definitely the way the kids are using the word and that’s very much a behavior that I’ve heard kids call “gay” in a derogatory way. So I don’t think OP meant it in a derogatory way but merely was using it the same way kids too",
                          "timestamp": "2022-05-14 17:34:12",
                          "score": 3,
                          "num_children": 0,
                          "author": 210845,
                          "replies": []
                        },
                        {
                          "id": "i8ljpnw",
                          "text": "No, \n\nThey are using gay derogatorily towards themselves for doing something, but then do that thing religiously\n\nI'm not labeling it - they are - that's the point",
                          "timestamp": "2022-05-14 17:30:13",
                          "score": 2,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i8lkvz3",
                              "text": "[deleted]",
                              "timestamp": "2022-05-14 17:39:15",
                              "score": 0,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "i8lrouf",
                                  "text": "Incorrect. Please stop trying to saddle me with your bullshit\n\nTHEY labeled TOUCHING EACH OTHER as gay. Then, THEY REPEATEDLY TOUCH EACH OTHER\n\nNO WHERE in that exchange am I labeling their actions as anything\n\nUnderstand? Or do I need to break it down as if you were actually in 5th grade? I can do this, we can play this game",
                                  "timestamp": "2022-05-14 18:30:44",
                                  "score": 2,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i8lkkto",
                          "text": "Not the impression I got at all. To me what ther are saying is that by trying to get someone in trouble for being gay they are participating in the toxic masculinity that typically shuns all non violent contact between boys as homosexual, a quite common aspect of such. Then they proceed to completely reject this notion and hold hands spinning in a circle, something that the toxic masculinity culture would quite obviously view as Gay. I do not think they mean to imply that it actually is Gay, but rather that based on the previous behavior it would be considered so by the same boys. To me the fact that they do not consider it so tells me there is hope yet.",
                          "timestamp": "2022-05-14 17:36:49",
                          "score": 1,
                          "num_children": 1,
                          "author": 363727,
                          "replies": [
                            {
                              "id": "i8lm8g3",
                              "text": "[deleted]",
                              "timestamp": "2022-05-14 17:49:22",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "i8ln60f",
                                  "text": "Listen, if you can't comprehend the difference between recognizing what patterns of belief certain groups have and personally holding those beliefs there is no help for you. I recognize that white supremacists consider interracial relationships as bad, and would be confused if there were a Klan member married to a Black woman. This does not mean I agree with them though does it? It means that humans can recognize when you are not consistent with your own evident beliefs. Though your grievance isn't with that is it. It is evident by the fact you put the very real and present cultural problem of toxic masculinity in scare quotes.",
                                  "timestamp": "2022-05-14 17:56:25",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 363727,
                                  "replies": [
                                    {
                                      "id": "i8lptqt",
                                      "text": "[deleted]",
                                      "timestamp": "2022-05-14 18:16:27",
                                      "score": 1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "i8lqk57",
                                          "text": "Do I now have to explain scare quotes to you as well? This isn't a productive conversation, and you clearly aren't a good faith actor. The whole \"would you base a funny reddit comment\" bullshit shows that well enough. You are either too stupid to recognize the difference I so clearly laid out for you, or you don't want to. In either case I have no time for fools. I stand on my experiences as a member of the lgbtq community that grew up in the deeply evangelical south to say that your misconstrued view of what was said here amounts to nothing more than projection.",
                                          "timestamp": "2022-05-14 18:21:56",
                                          "score": 1,
                                          "num_children": 2,
                                          "author": 363727,
                                          "replies": [
                                            {
                                              "id": "i8lqwog",
                                              "text": "[deleted]",
                                              "timestamp": "2022-05-14 18:24:34",
                                              "score": 1,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "i8lr4ng",
                                                  "text": "Ironically you are about 5 steps away from getting it, and it so simple that your refusal to understand in this instance is solid evidence of bad faith.",
                                                  "timestamp": "2022-05-14 18:26:17",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 363727,
                                                  "replies": [
                                                    {
                                                      "id": "i8lr7wb",
                                                      "text": "[deleted]",
                                                      "timestamp": "2022-05-14 18:27:00",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "i8lrvtz",
                                                          "text": "Oh please all enlightened redditor. Bestow upon us simple folk your magically concealed \"point\"(oh look I used them again)",
                                                          "timestamp": "2022-05-14 18:32:16",
                                                          "score": 1,
                                                          "num_children": 0,
                                                          "author": 363727,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "i8lr4eg",
                                              "text": "[deleted]",
                                              "timestamp": "2022-05-14 18:26:14",
                                              "score": 1,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "i8lr87q",
                                                  "text": "I already do \"get it,\" oh look, scare quotes. Go home to your bridge, troll.",
                                                  "timestamp": "2022-05-14 18:27:04",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 363727,
                                                  "replies": [
                                                    {
                                                      "id": "i8lraj5",
                                                      "text": "[deleted]",
                                                      "timestamp": "2022-05-14 18:27:35",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "i8lryr6",
                                                          "text": "Still waiting for you to actually have a point. Right now you've proven yourself to be little more than a contrarian waste of space.",
                                                          "timestamp": "2022-05-14 18:32:53",
                                                          "score": 2,
                                                          "num_children": 0,
                                                          "author": 363727,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i8lkn2r",
              "text": "Gay is still an insult? I thought that shit went out of style in the aughts",
              "timestamp": "2022-05-14 17:37:18",
              "score": 0,
              "num_children": 1,
              "author": 363699,
              "replies": [
                {
                  "id": "i8lky9m",
                  "text": "No way. Not where I live (Southern US, primarily minority area)\n\nKids are still saying gay as an insult daily. If I had to write referrals every time I heard it I wouldn't get anything done",
                  "timestamp": "2022-05-14 17:39:44",
                  "score": 4,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i8ll7c2",
                      "text": "Wow. When I was a kid it was gay this and gay that...it took me a while to stop calling things gay because it's not very nice.",
                      "timestamp": "2022-05-14 17:41:37",
                      "score": 5,
                      "num_children": 1,
                      "author": 363699,
                      "replies": [
                        {
                          "id": "i8lrrvg",
                          "text": "Yea, I always tell them that there is nothing wrong with being gay every time they do it",
                          "timestamp": "2022-05-14 18:31:25",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i8m9ty2",
              "text": "To be fair there is even another layer beyond this which is that a lot of people including homosexual dont neccsarily always associate gay with homosexual in how they joke about it. Your kids kinda sound like that although they also seem to have a different standard of what would be considered signs of being gay cukturally then you do too.",
              "timestamp": "2022-05-14 20:51:01",
              "score": 0,
              "num_children": 1,
              "author": 37279,
              "replies": [
                {
                  "id": "i8mbp03",
                  "text": "Yea I have to admit I don't really understand it. That's why my post ended on a super confused note. \n\nIt just seemed very strange to me. I was nonplussed when it happened. I'm not calling them gay, but they were definitely doing things that they were making fun of each other for being gay for doing... \n\nI don't miss being a teenager is all I'm saying",
                  "timestamp": "2022-05-14 21:05:18",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i8lj7r6",
          "text": "The Christian obsession with gay sex is deeply disturbing. It is also tactical. Every hate group chooses a minority to oppress because it coheres the group around a binary world view “us versus them”. This simplistic worldview is a core facet of EVERY organized religion. It is how they get “organized” in the first place. You choose a target. Decide to torment them. When they defend themselves you accuse them of oppressing you. Rinse and repeat. If you are in an organized religion you are a cult member. Full stop. That’s the whole point.",
          "timestamp": "2022-05-14 17:26:27",
          "score": 41,
          "num_children": 1,
          "author": 87361,
          "replies": [
            {
              "id": "i8lnfgg",
              "text": ">Every hate group chooses a minority to oppress because it coheres the group around a binary world view   “us versus them”\n\nExactly. We really need to stop with the \"Christians are secretly gay\" accusations. \n\nOP's \"Boys, try not to get too aroused\" is disturbing",
              "timestamp": "2022-05-14 17:58:26",
              "score": 3,
              "num_children": 1,
              "author": 390457,
              "replies": [
                {
                  "id": "i8n7f75",
                  "text": "[removed]",
                  "timestamp": "2022-05-15 01:20:14",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i8otmf1",
                      "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for using abusive language, personal attacks, being a dick, or fighting with other users. These activities are against the [rules](https://www.reddit.com/r/atheism/wiki/guidelines).   \r\nConnected comments may also be removed for the same reason, though editing out the direct attack may merit your comment being restored.  Users who don't cease this behavior may get banned temporarily or permanently.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                      "timestamp": "2022-05-15 12:36:10",
                      "score": 1,
                      "num_children": 0,
                      "author": 122319,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i8ktqab",
          "text": ">Boys, try not to get too aroused, though.\n\nYou want to talk about \"grooming\"? \n\nThis is the accusation the right wing are throwing at progressives for supporting LGBQT+ freedom. Except every accusation from the right is a confession, and they're the groomers. Starts with brainwashing stunts like this, and it plants the seed that the children can only trust their church and their pastor and everyone else is evil and worships Satan.\n\nThen when the pastor wants a little private playtime with the kiddos, they go trustingly.",
          "timestamp": "2022-05-14 14:10:24",
          "score": 67,
          "num_children": 0,
          "author": 7016,
          "replies": []
        },
        {
          "id": "i8ll1la",
          "text": "If you *do* get **too** aroused, Phase 3 is \"corrective\" rape",
          "timestamp": "2022-05-14 17:40:25",
          "score": 5,
          "num_children": 0,
          "author": 40828,
          "replies": []
        },
        {
          "id": "i8lo9ti",
          "text": "Why does this sound like something that's been/ being/ will be said (even if not that overtly)?",
          "timestamp": "2022-05-14 18:04:46",
          "score": 1,
          "num_children": 1,
          "author": 183314,
          "replies": [
            {
              "id": "i8n8fx2",
              "text": "I remembered reading on here that failure during Mormon missions is by design because it reinforces the us and them mentality. \n\nThis is a similar situation. No one is going to talk anyone out of being gay, and most people know this. What you can get, though, is 25 hardcore little Christian maniacs, so it counts as a win for them in the long run. I assume that other Christians are willing to steal a page from the Mormon playbook; you can’t argue with something the size of their bank accounts.",
              "timestamp": "2022-05-15 01:29:11",
              "score": 1,
              "num_children": 0,
              "author": 367491,
              "replies": []
            }
          ]
        },
        {
          "id": "i8no946",
          "text": "I overheard 3 religious teens having a milkshake and discussing how great certain biblical heroes are. Like they are from the MCU or something.\n\nI also have heard these kids get crushed at university when their thesis on why Jesus is the ultimate superhero gets a fail",
          "timestamp": "2022-05-15 03:52:24",
          "score": 1,
          "num_children": 0,
          "author": 123706,
          "replies": []
        }
      ]
    },
    {
      "id": "i8kl8va",
      "text": "actual “GROOMING”!",
      "timestamp": "2022-05-14 12:54:36",
      "score": 131,
      "num_children": 3,
      "author": 64512,
      "replies": [
        {
          "id": "i8kroie",
          "text": "Everything the right claims others are doing they are simply projecting, everything. There isn't one good thing to come out of republicans in decades, they're just corrupt 100%",
          "timestamp": "2022-05-14 13:53:14",
          "score": 44,
          "num_children": 2,
          "replies": [
            {
              "id": "i8nfy6o",
              "text": "Gaslight\n\nObstruct\n\nProject",
              "timestamp": "2022-05-15 02:34:27",
              "score": 1,
              "num_children": 0,
              "author": 379758,
              "replies": []
            },
            {
              "id": "i8p6568",
              "text": "Like an IMAX!",
              "timestamp": "2022-05-15 14:26:03",
              "score": 1,
              "num_children": 0,
              "author": 279065,
              "replies": []
            }
          ]
        },
        {
          "id": "i8kpwre",
          "text": "\"Don't say gay\" doesn't apply when you're putting the boot in.",
          "timestamp": "2022-05-14 13:37:56",
          "score": 20,
          "num_children": 0,
          "author": 370419,
          "replies": []
        },
        {
          "id": "i8kug0q",
          "text": "Every accusation from the right wing is a confession.",
          "timestamp": "2022-05-14 14:16:22",
          "score": 17,
          "num_children": 0,
          "author": 7016,
          "replies": []
        }
      ]
    },
    {
      "id": "i8kg5bb",
      "text": "Should have had them write letters encouraging their friends to go to the police and tell them what that priest has been doing during to them on those overnight '[retreats](https://www.cbsnews.com/newyork/news/parents-why-was-once-accused-pedophile-priest-on-youth-retreats/).'",
      "timestamp": "2022-05-14 12:01:15",
      "score": 68,
      "num_children": 1,
      "author": 39036,
      "replies": [
        {
          "id": "i8ldbpb",
          "text": "This looks like an evangelical school. They would likely say that Catholics aren’t “real” Christians. \n\nSource: went to evangelical school for 9 years in the 90s.",
          "timestamp": "2022-05-14 16:41:46",
          "score": 8,
          "num_children": 2,
          "author": 222012,
          "replies": [
            {
              "id": "i8m4lj4",
              "text": "True. Instead, as an evangelical high school I’m curious how many teachers are married to former students…",
              "timestamp": "2022-05-14 20:10:49",
              "score": 7,
              "num_children": 0,
              "author": 161811,
              "replies": []
            },
            {
              "id": "i8mch6e",
              "text": "[deleted]",
              "timestamp": "2022-05-14 21:11:21",
              "score": 3,
              "num_children": 1,
              "replies": [
                {
                  "id": "i8mdk54",
                  "text": "Just telling you what evangelicals would say. Don’t disagree",
                  "timestamp": "2022-05-14 21:19:47",
                  "score": 2,
                  "num_children": 0,
                  "author": 222012,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i8kny8z",
      "text": "Conservatives: *The GaYs are using our schools to indoctrinate our children!!!1!!!1!*\n\nAlso Conservatives:",
      "timestamp": "2022-05-14 13:20:23",
      "score": 71,
      "num_children": 1,
      "author": 342289,
      "replies": [
        {
          "id": "i8laspr",
          "text": "Well yeah, it's not indoctrination if it agrees with my beliefs, then it's just proper teachin'",
          "timestamp": "2022-05-14 16:23:04",
          "score": 16,
          "num_children": 1,
          "author": 44778,
          "replies": [
            {
              "id": "i8n6r9c",
              "text": "I hate that this is so accurate to their mentality.",
              "timestamp": "2022-05-15 01:14:29",
              "score": 5,
              "num_children": 0,
              "author": 393977,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i8kiwhr",
      "text": "1. Private schools are a bad idea!\n2. How aren’t every single LGBT+ in the US person livid about Christianity?\n3. Why isn’t this fought against politically tooth and nail?\n\nThis is the same type of shit Nazis and other fascists pulled in the past. Now kids, you each write an essay about the evil of the Jew. Best essay wins a Volkswagen stamp for your family!\n\nWhat a fucking terrible timeline we live in:(",
      "timestamp": "2022-05-14 12:30:59",
      "score": 258,
      "num_children": 11,
      "author": 242458,
      "replies": [
        {
          "id": "i8kmfq3",
          "text": "Yeah I really don't get it when other LGBTQ people don't hate Christianity and Islam. Bigotry is baked into the religions, it's right in the text, so even the \"good ones\" are still promoting pushing books with homophobic messages on kids. And religion is the cause of like, at least 90% of homophobia, the vast majority of non-religious people aren't homophobic.",
          "timestamp": "2022-05-14 13:06:06",
          "score": 114,
          "num_children": 5,
          "author": 217162,
          "replies": [
            {
              "id": "i8kqvvb",
              "text": "Oh no, a guy likes sausages and a lady likes tacos, whatever shall we do?\n\nGet your filthy authoritatian hands out of their sex lives is what you should do, \"Land of the Free\" doesnt mean anything if you dont. Wouldnt the \"Home of the Brave\" have people *brave* enough to talk to homosexuals and learn about them? Doesnt sound free, doesnt sound brave.\n\n**We should expect this, though. We have a Bill of Privileges not a Bill of Rights.** Ask Japanese Americans who survived internment camps in WWII how free this country is.",
              "timestamp": "2022-05-14 13:46:25",
              "score": 64,
              "num_children": 1,
              "replies": [
                {
                  "id": "i8nhdi6",
                  "text": "And they have the audacity to claim to be the party of “small government” when they want the government to control/covert/eliminate part of the essence of who you are.",
                  "timestamp": "2022-05-15 02:47:15",
                  "score": 2,
                  "num_children": 1,
                  "author": 379758,
                  "replies": [
                    {
                      "id": "i8noc7e",
                      "text": "Small government for me but not for thee. Cant make money off of people with rights.",
                      "timestamp": "2022-05-15 03:53:15",
                      "score": 2,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i8lbgcc",
              "text": "The same exact thing with women. Women should abandon Christianity, the Catholic church and Evangelism especially. Yet, they are its biggest bloc attenders. If women abandon the churches trying to suppress them, Christian churches would collapse.",
              "timestamp": "2022-05-14 16:28:01",
              "score": 27,
              "num_children": 0,
              "author": 153396,
              "replies": []
            },
            {
              "id": "i8kqv39",
              "text": "We are still in the best timeline though, everything before was worse. Society is ever so slowly moving in the right direction. As always with lots of 2 steps forward, one step back.\n\nBut this is only true for some countries.\n\nIt's sad that there are big parts of the world, that don't even talk or think about changing anything related sex , but prefer further culminating the \"perversion\" in anything different.\nAnd then, there are the ones actively persecuting anyone diverging from the classic cis scheme.",
              "timestamp": "2022-05-14 13:46:14",
              "score": 7,
              "num_children": 1,
              "author": 236043,
              "replies": [
                {
                  "id": "i8lbsn3",
                  "text": "Society has always been progressing in America even when the times were the darkest here, we were still always progressing through our laws and culturally. We are no longer progressing, we are actually regressing and that is a new thing, this isn't normal. People need to stop saying this is normal, it isn't at all.",
                  "timestamp": "2022-05-14 16:30:34",
                  "score": 4,
                  "num_children": 1,
                  "author": 153396,
                  "replies": [
                    {
                      "id": "i8ldmp5",
                      "text": "I think it depends on how you look at it. The youth are still progressing. I'm in my 30s and I would be willing to bet the people in their 20s are much more open than the people were when I was. And with the bills that have been passing, there have been protests at different high schools and middle schools. \n\nThe only problem is how long can we hold our with our laws before they go backwards to the point of no return? Can they change things before we get another holocaust? Or before we start to enter into Handmaids Tale territory with us in the LGBT community in prisons for existing? That's the thing that worries me. Especially since we have a history of young people not voting. And while I get why a lot of leftists are moving away from voting for dems since the dems don't care, it does worry me that this will only make things worse in the long run.",
                      "timestamp": "2022-05-14 16:44:02",
                      "score": 4,
                      "num_children": 1,
                      "author": 405442,
                      "replies": [
                        {
                          "id": "i8lgnhl",
                          "text": "It doesn't matter what your views are, get that when it comes to actual federal and state laws. The laws made are all that matters in the end.  Your opinion, your generation's opinion doesn't become law, and the opinion of millions may not become law. America, as it set up is where the minority opinion ends up winning in the end and making laws. We are set up by our own constitution for the majority to NOT actually matter, the minority opinion has more power. Our system is that fucked up. You can vote and yes if Millennials actually showed up to the polls it would help especially in state elections but Millennials have failed miserably at actually showing up to vote unless it is a general election. So the minority opinion wins, in the end, wins because they always, always show up to vote. Also, its is too late at this point.2016 was the deciding factor and people voted for Trump. SCOTUS is stacked as is until Alito or Thomas probably dies or retires.  Which is going to be years down the road.",
                          "timestamp": "2022-05-14 17:06:54",
                          "score": 3,
                          "num_children": 1,
                          "author": 153396,
                          "replies": [
                            {
                              "id": "i8nhpnz",
                              "text": "I’ve always thought that stacking the judiciary (he appointed a shit-ton of lower judges as well as the SCOTUS) was perhaps the most damaging thing he’s done to the country.",
                              "timestamp": "2022-05-15 02:50:19",
                              "score": 1,
                              "num_children": 0,
                              "author": 379758,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i8r1jv8",
              "text": "idk y my comment got deleted.\n\n> Yeah I really don't get it when other LGBTQ people don't hate Christianity and Islam.\n\nidk much about [the main 3] religion bc im from an area that practiced something completely different. but comments like this always exclude Judaism, is there any reason why? while i dont know much i do know that the two you mentioned root from it. so did Christianity/Islam add on homophobic crap to an otherwise 'progressive' ideology? and if not wouldnt they be just as much to blame?\n\n>And religion is the cause of like, at least 90% of homophobia, the vast majority of non-religious people aren't homophobic.\n\nit might be for why a child is homophobic. but when it comes to violent adults, like a group of guys beating the crap out of someone bc he's gay, i dont think a single person in that group of homophobic adults beating the gay guy is religious. IDK what makes them do it but i dont think its for their god.\n\ndownvoted so much for a question.\n\nYou're able to compartmentalize and then judge jews. as in you can take them and split them up instead of judging them as one collective mindset(as you should but you refuse to do this with the other 2). and then i said it seems that the issue is population. it's just about numbers. superficial people aren't bothered by what they don't see.\n\nthe christian and muslim population is massive. they're not all the same, they don't all think the same and have their own conflicts within each other because so. but they can be split up into groups easily. but this conversation is had as if each one is a collective mind, conspiring and executing. but it's not the case at all.",
              "timestamp": "2022-05-15 22:42:22",
              "score": 1,
              "num_children": 0,
              "author": 163417,
              "replies": []
            },
            {
              "id": "i8l90x9",
              "text": "[removed]",
              "timestamp": "2022-05-14 16:10:05",
              "score": -3,
              "num_children": 2,
              "replies": [
                {
                  "id": "i8lqz6p",
                  "text": "\n>idk much about [the main 3] religion bc im from an area that practiced something completely different. but comments like this always exclude Judaism, is there any reason why? while i dont know much i do know that the two you mentioned root from it. so did Christianity/Islam add on homophobic crap to an otherwise 'progressive' ideology? and if not wouldnt they be just as much to blame?\n\nFrom my understanding Judaism is more of a set of traditions followed mostly by the Hebrew people to honor their god and give thanks for supposedly breaking them out of slavery in Egypt than it is a full-blown religion. For one, they don't proselytize, as entering the 'faith' actually has some hurdles to jump through, so they have no reason to go around pushing their beliefs on others. If they have a problem with homosexuality, they keep it to themselves. Also, no real belief in an afterlife as all that was added in the new testament and quran, so no fear of being damned or desire to 'save the souls' of others. So yeah, Jews are pretty chill compared to the others.",
                  "timestamp": "2022-05-14 18:25:06",
                  "score": 2,
                  "num_children": 0,
                  "author": 272296,
                  "replies": []
                },
                {
                  "id": "i8leuyd",
                  "text": "There is homophobia in the Jewish texts, but most modern Jews actually don't tend to be homophobic, and even if they were, it's a tiny religion, less than one fifth of one percent of the world population, so the overall amount of homophobia they could be contributing to the world couldn't possibly be very much. The third religion in the \"main 3\" is actually Hinduism—Christianity, Islam and Hinduism are by far the biggest 3 religions in the world.\n\nThe kind of people who beat up gay people are definitely often religious! In Muslim countries, gay people regularly get murdered for religious reasons, and in the West it's mostly conservative Christians who attack gay people. Religion has always caused violence. People regularly murder for their god.",
                  "timestamp": "2022-05-14 16:53:16",
                  "score": 3,
                  "num_children": 1,
                  "author": 217162,
                  "replies": [
                    {
                      "id": "i8ngicz",
                      "text": "[removed]",
                      "timestamp": "2022-05-15 02:39:25",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i8pk55m",
                          "text": "Proselytizing and forcing their will upon others just isn't baked into Judaism the way it is in Christianity and Islam. Even if they had the numbers, I don't think they'd have the desire. So yeah, we don't hate on the Jews because there's zero reason to. They don't bother us. They don't try to enact bills against women's rights, or LGBTQ rights, or POC rights, those are strictly Christian issues in the US, and in the Muslim world those people just don't have any rights and can be killed at any time. Israel is in the same shitty little area as most of the Muslim countries and they don't persecute that way. Sure, they have their issues with Palestine, but that's a fight over land and politics, not religious bullshit.",
                          "timestamp": "2022-05-15 16:11:07",
                          "score": 1,
                          "num_children": 0,
                          "author": 272296,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i8kzqna",
          "text": "The gay Christians I know are just as good at cherry picking from the Bible as their Evangelical cousins. Being queer does not bestow one with perfect rationality.",
          "timestamp": "2022-05-14 14:59:07",
          "score": 30,
          "num_children": 3,
          "author": 74142,
          "replies": [
            {
              "id": "i8ljp50",
              "text": "All Christian sects are like this. Either they pick and choose or strictly follow the teachings of someone who picked and chose for them. That's why it's better to blame individuals rather than Christianity itself.",
              "timestamp": "2022-05-14 17:30:06",
              "score": 3,
              "num_children": 0,
              "author": 317138,
              "replies": []
            },
            {
              "id": "i8lkyxy",
              "text": "Yuuuup",
              "timestamp": "2022-05-14 17:39:53",
              "score": 2,
              "num_children": 0,
              "author": 38110,
              "replies": []
            },
            {
              "id": "i8l9rzd",
              "text": "Nobody is or even should be \"perfectly rational\". We're not vulcans.",
              "timestamp": "2022-05-14 16:15:43",
              "score": 4,
              "num_children": 3,
              "author": 268749,
              "replies": [
                {
                  "id": "i8lcohx",
                  "text": "Well I don't know what the downside is but it does seem to be a goal worth pursuing. The world would a much better place if people were easy to convince with just logic and not having to deal with all the emotional bullshit.",
                  "timestamp": "2022-05-14 16:37:01",
                  "score": 5,
                  "num_children": 1,
                  "author": 244527,
                  "replies": [
                    {
                      "id": "i8lhpst",
                      "text": "I mean you're describing something so alien to the human condition that I don't think you can meaningfully extrapolate to it but go off king.",
                      "timestamp": "2022-05-14 17:15:05",
                      "score": -1,
                      "num_children": 0,
                      "author": 268749,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i8la0s7",
                  "text": "Lately I feel like we’re more Romulans anyways. Dumb Romulans.",
                  "timestamp": "2022-05-14 16:17:29",
                  "score": 3,
                  "num_children": 0,
                  "author": 74142,
                  "replies": []
                },
                {
                  "id": "i8lty0x",
                  "text": "Speak for yourself.. Live long and prosper 🖖",
                  "timestamp": "2022-05-14 18:47:57",
                  "score": 1,
                  "num_children": 0,
                  "author": 272296,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i8l2vff",
          "text": "I'm bi and my family doesn't know, it'd cause a massive show with my parents, my siblings would be a mixed bag. \n\nIn the end I don't care why they're bitching, I just want them to leave me alone about it. It's like complaining at someone because their toe is slightly rotated, it just is, I just want to be left alone about it",
          "timestamp": "2022-05-14 15:23:28",
          "score": 14,
          "num_children": 0,
          "author": 8777,
          "replies": []
        },
        {
          "id": "i8kud8h",
          "text": "I know an openly gay pastor who's recently been married.\n\nHe's not Catholic (if that isn't clear, and married to a guy if that isn't either ).\n\nDifferent people find different ways m flavours of Christianity and thus they all find a way to look past the atrocities other Christians say or do.",
          "timestamp": "2022-05-14 14:15:44",
          "score": 7,
          "num_children": 0,
          "author": 301930,
          "replies": []
        },
        {
          "id": "i8lbc6s",
          "text": "Because the US is actually a pretty shit country that's always just been about rich people. We've been raping and murdering brown people from the moment we arrived here. Nazi Germany and Apartheid South Africa both cited the US as an inspiration.\n\nThe current president is a segregationist. That's how far we've not come.",
          "timestamp": "2022-05-14 16:27:08",
          "score": 5,
          "num_children": 0,
          "author": 209758,
          "replies": []
        },
        {
          "id": "i8lctc1",
          "text": "Agree on all but there private schools are a bad idea. When Public schools stop being shit, we can have that discussion.\n\nHowever, like I said I agree on most and particularly when it comes to Xtian private schools. I was in an evangelical school from grade 2-10 and it was awful.",
          "timestamp": "2022-05-14 16:38:02",
          "score": 1,
          "num_children": 1,
          "author": 222012,
          "replies": [
            {
              "id": "i8o8j1e",
              "text": "US Public schools are being undermined to prop up private schools. You have a chicken and egg problem. School voucher programs are an example of this sabotage.",
              "timestamp": "2022-05-15 07:58:54",
              "score": 1,
              "num_children": 0,
              "author": 294804,
              "replies": []
            }
          ]
        },
        {
          "id": "i8lqttp",
          "text": "Because mental illness is seen as “freedom of religion”",
          "timestamp": "2022-05-14 18:23:58",
          "score": 1,
          "num_children": 0,
          "author": 380482,
          "replies": []
        },
        {
          "id": "i8lsniw",
          "text": "I think because so many of us were raised to support silent unrest instead of vocal activism. I think a lot of us are learning how harmful that is, but it's certainly taken some time. I think voting red, which is casting a vote for a fascist theocracy at this point, needs to be so embarrassing that people hide it along with the white hoods. It is my sincerest hope someday that people can vote republican *and* vote in their best interests, but we just aren't there, and we still have a lot of people that are in denial about it. I think part of the reason behind that is *because* of the expectation of silent unrest. \n\nBut there's nothing wrong with speaking up. There's nothing wrong with standing up for what's right. There's nothing wrong with holding each other accountable for spreading and supporting misinformation. We have a duty to speak up because the less we do, the more shit like in the OP happens.",
          "timestamp": "2022-05-14 18:38:09",
          "score": 1,
          "num_children": 0,
          "author": 284438,
          "replies": []
        },
        {
          "id": "i8lwdpg",
          "text": "1.\tYes, the quality expected from a private school should be in all of our public schools\n2.\twe are. \n3.\tbecause Christians outnumber us",
          "timestamp": "2022-05-14 19:06:45",
          "score": 1,
          "num_children": 0,
          "author": 73343,
          "replies": []
        },
        {
          "id": "i8ky6pk",
          "text": "Private schools a bad idea? There’s no way I’m sending my kids into public school with all the riff raff",
          "timestamp": "2022-05-14 14:46:39",
          "score": -15,
          "num_children": 1,
          "replies": [
            {
              "id": "i8lcxpi",
              "text": "Private schools aren’t a bad idea. Indoctrination factories are a bad idea—public or private. But they should be legal. We live in a country where it’s legal to be homophobic, even if those people are literally evil.",
              "timestamp": "2022-05-14 16:38:58",
              "score": -2,
              "num_children": 0,
              "author": 222012,
              "replies": []
            }
          ]
        },
        {
          "id": "i8l4n6b",
          "text": "Christianity, as in following Jesus, isn't the problem. It's just that out of 100,000 self proclaimed christians, maybe 1 or 2 actually are.",
          "timestamp": "2022-05-14 15:37:05",
          "score": -9,
          "num_children": 3,
          "author": 309359,
          "replies": [
            {
              "id": "i8lg7oz",
              "text": "Nope. The others still are, and as a gay man I'm getting tired of this mentality. It's Christianity. It has been and will be. Are there more and more Christians becoming progressive and accepting? Sure. Most of my family is Christian, and while one half doesn't accept me, the other does. \n\nBut if we rule stuff like this out and say it's not a part of the religion, then Christianity is small enough to be considered a cult, and has only really existed for maybe a decade or so. It wasn't until the late 2000s that we started to see acceptance in society. And then it wasn't u tol the start of the 2010s that the majority of people started to accept us. Before that? At best we got \"love the sinner hate the sin\" or what ever thing people said to make themselves look better. But we were still beaten and killed fairly regularly. Shit, that still happens today. And honestly, this feels more like a slap in the face than allyship. Because people have been killed in the name of Christianity. Many of us suffered in the name of Christianity. And to simply hand wave that away does nothing but sweep the problem under the rug.\n\nAnd it's not just the gay community. Religion was used to justify slavery. Then we moved away from that and it was used to justify everything else black people went through. Christians would gather their families together to go sit down at the park and have a picnic while watching the local entertainment of having black people hung from trees or burned to death.\n\nIt was also a large part of manifest destiny... which was basically us just committing genocide against the natives and stealing their land. \n\nHow about women? Well, we can go all the way back to the Salem Witch Trials where women were killed because people thought they were worshiping Satan. Or we can talk about the fact that women have always been seen as property to men. Even so much so that women couldn't even get their own bank account until the 70s. Like really think about that. Even when they started being able to work, the money went to the husband's account. Not generally a joint account. The husband's. Because it was his. \n\nThere's a reason Christianity is dying. No, really, [people are leaving the religion.](https://www.upi.com/Top_News/US/2021/12/14/Pew-poll-religion/4101639510653/) It's gonna take awhile before it's even close to gone, but the youth are moving on. Many are doing so because we have seen the hatred coming from it.\n\nIf you want to be an ally to marginalized communities, don't pretend like there isn't a problem, or just push those people are the others. Like I'm white, and I am fully willing to admit that our problems with racism come from white people. I am willing to call them out.\n\nI also don't say \"Not all men\" when women are talking about the problems they have. Because while, sure, technically true, all it does is diminish the problems men cause, and doesn't address the issue so we can fix it.\n\nPeople need to move past this notion that they're not real Christians. Even ignoring that it is a no true Scotsman, to me all I hear is that you are the victim by people associating your religion with the bigotry it has always had, rather than the people actually suffering. I don't suffer from racism. And the problems men face tend to actually be problems caused by men that were used to systematically attack women. I am ultimately not the victim, so I am not gonna try to be. When people call out white people, I agree because I support black liberation. When people call out men, I agree because I support women's rights. I'm even willing to call out other gay people when they are being bigoted. And I do this because I want my community to do better so other people don't suffer.",
              "timestamp": "2022-05-14 17:03:36",
              "score": 10,
              "num_children": 1,
              "author": 405442,
              "replies": [
                {
                  "id": "i8lva9y",
                  "text": "LYSM! yessssss",
                  "timestamp": "2022-05-14 18:58:17",
                  "score": 5,
                  "num_children": 0,
                  "author": 206960,
                  "replies": []
                }
              ]
            },
            {
              "id": "i8lqkfj",
              "text": "You mean the character who is also its own father, the same father which both commanded and carried out acts of genocide? Fuck that guy.",
              "timestamp": "2022-05-14 18:22:00",
              "score": 3,
              "num_children": 0,
              "author": 55402,
              "replies": []
            },
            {
              "id": "i8nabvq",
              "text": "The following of jesus is not Christianity. Just search for religions with jesus.. Also have you even read that book of yours? Full of butt fucking blokes. The only thing Christians want is to live in a world like China where everything is controlled by them.",
              "timestamp": "2022-05-15 01:45:52",
              "score": 1,
              "num_children": 0,
              "author": 221475,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i8kj4yo",
      "text": "I really struggle to understand people's priorities.  Don't other people have very important and time consuming things to look after like retirement planning,  personal finances,  career development,\n medical care, maintaining a household, a fucking model railroad hobby?  The shit these people spend time on reminds me of poets living on commission from the nobility.",
      "timestamp": "2022-05-14 12:33:23",
      "score": 30,
      "num_children": 0,
      "author": 192607,
      "replies": []
    },
    {
      "id": "i8kmki8",
      "text": "Poor kids being brainwashed this way",
      "timestamp": "2022-05-14 13:07:24",
      "score": 25,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i8kqdn8",
      "text": "I live in Louisville, Kentucky.  I went to a Baptist school for two years.  They tried to throw me out because they had heard that I sold weed to someone at a party off campus.  They successfully expelled a bunch of seniors that year who drank at a party off campus.\n\nFuck these schools and everything they stand for.",
      "timestamp": "2022-05-14 13:42:01",
      "score": 23,
      "num_children": 1,
      "replies": [
        {
          "id": "i8lgsdu",
          "text": "Also live in Louisville. This school in particular has been called out for its odd cult like behavior before. They were the ones sueing to stop maks mandates and wanted to force kids into school at the height of the pandemic as well.\n\nThey are not just a religious school, the people that lead it are far right Maga true believers.",
          "timestamp": "2022-05-14 17:07:57",
          "score": 4,
          "num_children": 2,
          "author": 3917,
          "replies": [
            {
              "id": "i8m2y6q",
              "text": "I heard some of these schools received 100x more applicants than normal during COVID because parents wanted to find a place to send their kids in person.",
              "timestamp": "2022-05-14 19:58:15",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "i8mb1sb",
                  "text": "Louisville is a very liberal city, but its very odd just how many Catholic schools there are here.",
                  "timestamp": "2022-05-14 21:00:28",
                  "score": 1,
                  "num_children": 0,
                  "author": 3917,
                  "replies": []
                }
              ]
            },
            {
              "id": "i8m3ixs",
              "text": "I live on the outskirts of Louisville. Jefferson County is apparently one of the most democratic counties in Kentucky, besides maybe Frankfort in Franklin County. If that's what the schools are pulling in Louisville I am scared to see what's going on in BFE Kentucky.",
              "timestamp": "2022-05-14 20:02:38",
              "score": 1,
              "num_children": 1,
              "author": 34950,
              "replies": [
                {
                  "id": "i8mbrhf",
                  "text": "If you live on the outskirts of Louisville, you would know it is a very liberal city. We always elect Democratic mayors and the Rep from the local district has been a liberal Dem for my whole life. \n\nIt is really just this weird pocket of Catholic schools that a lot of odd racist idiots send their kids to due to the busing of students to end segregation. There was even a case that went to the supreme court over it in the 70's.",
                  "timestamp": "2022-05-14 21:05:49",
                  "score": 1,
                  "num_children": 1,
                  "author": 3917,
                  "replies": [
                    {
                      "id": "i8mcdi5",
                      "text": ">It is really just this weird pocket of Catholic schools that a lot of odd racist idiots send their kids to due to the busing of students to end segregation. There was even a case that went to the supreme court over it in the 70's.\n\nI didn't know this. I always have known there's religious schools in Louisville but never thought much about them, other than them being expensive to go to.",
                      "timestamp": "2022-05-14 21:10:33",
                      "score": 2,
                      "num_children": 0,
                      "author": 34950,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i8ksqt1",
      "text": "kentucky ranked forty fifth in education last year.",
      "timestamp": "2022-05-14 14:02:12",
      "score": 19,
      "num_children": 3,
      "replies": [
        {
          "id": "i8lq5ll",
          "text": "What you do not realize, even with the Senate’s most powerful Senator (from Kentucky), for 30 years, they remain among the most ignorant in the USA.\n\nShould we also bring up poverty, health quality of life, murder/homicide, etc?",
          "timestamp": "2022-05-14 18:18:58",
          "score": 5,
          "num_children": 0,
          "author": 190921,
          "replies": []
        },
        {
          "id": "i8m322o",
          "text": "....which is why people send their kids to private schools.",
          "timestamp": "2022-05-14 19:59:05",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i8lvf6c",
          "text": "There are so many ranking systems out there.. I have no idea which to trust. The one I found with Kentucky at 44 had Alabama at 26. I find that hard to believe. Another with Alabama at 43 (believable) had Kentucky at 19 (not believable), so who the fuck knows?",
          "timestamp": "2022-05-14 18:59:21",
          "score": 0,
          "num_children": 2,
          "author": 272296,
          "replies": [
            {
              "id": "i8m3a12",
              "text": "Ky public schools are really really bad.\n\nLike the very best, crown jewel public schools in KY are like in average school in Virginia...hahha",
              "timestamp": "2022-05-14 20:00:44",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "i8m62sp",
                  "text": "Fwiw trinity, st x, manual, male, eastern, and the girl catholic schools are all good schools. But yeah outside of louisville and Lexington the school system is pretty bad lol",
                  "timestamp": "2022-05-14 20:22:04",
                  "score": 1,
                  "num_children": 0,
                  "author": 145118,
                  "replies": []
                }
              ]
            },
            {
              "id": "i8mbe1z",
              "text": "I have seen stories recently about alabama making a lot of investment in education and it starting to pay off well - though those stories are usually shared in groups that talk about dyslexia / special needs.",
              "timestamp": "2022-05-14 21:03:03",
              "score": 1,
              "num_children": 1,
              "author": 33725,
              "replies": [
                {
                  "id": "i8me7d8",
                  "text": "Maybe in Huntsville and Mobile... Public schools elsewhere are still backward and authoritarian.",
                  "timestamp": "2022-05-14 21:24:40",
                  "score": 1,
                  "num_children": 0,
                  "author": 272296,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i8kifvl",
      "text": "Saying they use religion as “a cover” is putting it mildly. These assholes, including most of the US Supreme Court, use religion as the legal *justification* for bigotry. It’s disgusting. \n\nI hope some kid write, “Don’t change who you are. I’ll love you no matter what.”",
      "timestamp": "2022-05-14 12:26:09",
      "score": 60,
      "num_children": 1,
      "author": 196132,
      "replies": [
        {
          "id": "i8l8ol6",
          "text": "It’s less of a cover and more of a bludgeon.",
          "timestamp": "2022-05-14 16:07:29",
          "score": 8,
          "num_children": 0,
          "author": 373060,
          "replies": []
        }
      ]
    },
    {
      "id": "i8krnld",
      "text": "Ask the teacher when did they choose to go straight.\n\nThey can't answer that truthfully because it's not a choice a person can make.",
      "timestamp": "2022-05-14 13:53:00",
      "score": 15,
      "num_children": 1,
      "author": 341994,
      "replies": [
        {
          "id": "i8kyh0a",
          "text": "Yeah but fundamentalists just default to \"you're automatically straight because God wants you that way. You don't have to decide that. You only have to decide if you're going to go against God\"\n\nYour argument, while I think it's a good one, only works if they accept that they are two sides of the same coin. They don't.",
          "timestamp": "2022-05-14 14:48:56",
          "score": 9,
          "num_children": 0,
          "author": 298529,
          "replies": []
        }
      ]
    },
    {
      "id": "i8ktoo4",
      "text": "You can't use religion \"as a cover to indoctrinate children with evidence-free beliefs\", because that's what religion is. Indoctrinating children with evidence-free beliefs.",
      "timestamp": "2022-05-14 14:10:02",
      "score": 11,
      "num_children": 0,
      "author": 58881,
      "replies": []
    },
    {
      "id": "i8knpd9",
      "text": "As cover? Where do these beliefs originate? Where did they get the idea that believing things without evidence is a virtue?",
      "timestamp": "2022-05-14 13:18:09",
      "score": 11,
      "num_children": 2,
      "author": 371652,
      "replies": [
        {
          "id": "i8krrnh",
          "text": "Its the basis of the entire religious experience so they apply it to the rest of life and we have to deal with it",
          "timestamp": "2022-05-14 13:53:58",
          "score": 4,
          "num_children": 0,
          "author": 224735,
          "replies": []
        },
        {
          "id": "i8kykfi",
          "text": "Jesus told them. Duh.",
          "timestamp": "2022-05-14 14:49:41",
          "score": 4,
          "num_children": 0,
          "author": 298529,
          "replies": []
        }
      ]
    },
    {
      "id": "i8l026w",
      "text": "A good example of why private religious schools should be banned…",
      "timestamp": "2022-05-14 15:01:35",
      "score": 11,
      "num_children": 1,
      "author": 139434,
      "replies": [
        {
          "id": "i8l758m",
          "text": "I don't care if religious schools exist. You're Catholic, and you want your kid to be taught in a Catholic school? Fine. Do that. But the church and the families who choose that school should be the sole sources of funds that make that decision possible. Federal and state resources should never be used to support those schools. Vouchers for religious schools should not be a thing.\n\nI get that in some communities, parents choose to send their kids to private religious schools because those schools are better than the public options available, but the solution to that problem is to make the public option better, not to increase the numbers of kids exposed to bigoted, anti-science, religious instruction. \n\nPushing the false narrative that public schools are teaching kids to be gay or -- everybody panic now -- trans is just another projection by the party actually attempting indoctrination.",
          "timestamp": "2022-05-14 15:55:52",
          "score": 3,
          "num_children": 2,
          "author": 26484,
          "replies": [
            {
              "id": "i8mbxx1",
              "text": "I wish they could do it like we do in NZ.    \nAll schools, private or public must teach the same curriculum. Sure there are variations but each student gets a standard level of education which includes things like a proper science class (evolution, sex-ed etc) even in religious schools. And its not a money thing as both public and state-integrated (semi-private) schools get government funding.    \nIf you send your kid to a school that doesnt teach the standard curriculum then the kid is a truant because they aren't considered \"at school\" and the parents can be hauled up in court.",
              "timestamp": "2022-05-14 21:07:10",
              "score": 3,
              "num_children": 0,
              "author": 33725,
              "replies": []
            },
            {
              "id": "i8m3rqq",
              "text": "I live in Kentucky. \n\nMy choice was send my kids to almost the worst public schools in the country or send my kids to an private school that places kids at ivy league schools every year. It was a pretty easy choice.\n\nSaying \"just make the schools better\" in a place like Kentucky is hilarious. It's beyond repair.",
              "timestamp": "2022-05-14 20:04:29",
              "score": 2,
              "num_children": 1,
              "replies": [
                {
                  "id": "i8mwppt",
                  "text": "I get what you're saying, and it's an impossible choice for some of us with kids in the system now. I'm an advocate of public school education, but when my kids were born, we moved to an area with good public schools rather than stick them in school in the crap system we were in. If we couldn't have relocated for whatever reason, I would have made the same choice as you. \n\nIt's too late for kids in school now, but I do hope that someday parents will be able to send their kids to public schools anywhere in the country and feel like they are getting the education they deserve in one of the world's wealthiest nations. I do think it's feasible to fix things for future kids, but if our elected officials (state and federal) keep taking steps to funnel more kids and more money into private schools without making any radical, expensive changes to improve public schools, public schools will just keep getting worse.",
                  "timestamp": "2022-05-14 23:49:17",
                  "score": 1,
                  "num_children": 0,
                  "author": 26484,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i8kn1mv",
      "text": "imagine caring this much about other people's sexual preference.",
      "timestamp": "2022-05-14 13:11:59",
      "score": 24,
      "num_children": 1,
      "author": 301812,
      "replies": [
        {
          "id": "i8qapjw",
          "text": "“You don’t get to have a say about what my dick goes inside!!” - queer people. \n\n“HEY, that’s OUR line!” - church priests, probably.",
          "timestamp": "2022-05-15 19:24:31",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i8kwakb",
      "text": "All the closeted gay kids at the school must be feeling so awful, they're to ones i feel the worst for",
      "timestamp": "2022-05-14 14:31:32",
      "score": 8,
      "num_children": 0,
      "author": 74967,
      "replies": []
    },
    {
      "id": "i8kyotk",
      "text": "PROVING ONCE AGAIN THAT RELIGION POISONS EVERYTHING",
      "timestamp": "2022-05-14 14:50:39",
      "score": 8,
      "num_children": 0,
      "author": 179050,
      "replies": []
    },
    {
      "id": "i8kyya2",
      "text": "I really seriously don’t understand why Christians care about gay people so much. Isn’t it their god’s job to judge, not theirs? How do other people being gay affect them in any way? I really don’t understand it. Why do they care who some stranger loves or sleeps with? It makes no sense.",
      "timestamp": "2022-05-14 14:52:48",
      "score": 8,
      "num_children": 2,
      "author": 215329,
      "replies": [
        {
          "id": "i8lfet8",
          "text": "Because it's really not about whether these individuals are gay, it's about control.\n\nIt centers around there being an \"in\" group, and the \"others\". These religions have had millenia to perfect their methods and messages to the point where they have permiated virtually every facet of society, and shape the laws of every nation where they have a significant population. Most \"members\" of these religions may not consciously recognize it, but the entire thing is structured to enforce a hierarchy, and a class system where some people are \"better\" than others, and a select few are \"ordained\" to possess the preponderance of wealth, authority, and control. It's been used as the justification for kings, queens, emperors, and \"royalty\" since the beginning.\n\nThe modern iteration has adapted itself to more democratic governments by manipulating the \"members\" into electing rulers that reinforce the hierarchy, in order to ensure the \"others\" are \"kept in their place\", even if that runs counter to their own self-interests.\n\nThroughout history, these religions have been extremely successful in convincing the masses that ideas like slavery, racism, classism, misogyny, homophobia, religious discrimination, eugenics, genocide, and countless atrocities against a group of \"others\" is justified and right, because their particular brand of god ordained it.",
          "timestamp": "2022-05-14 16:57:29",
          "score": 9,
          "num_children": 0,
          "author": 248641,
          "replies": []
        },
        {
          "id": "i8l2w5j",
          "text": "The bible passages on it are vague as well lol",
          "timestamp": "2022-05-14 15:23:38",
          "score": 7,
          "num_children": 0,
          "author": 329407,
          "replies": []
        }
      ]
    },
    {
      "id": "i8lprcf",
      "text": "My GOP father-in-law just told us that kids are \"becoming gay\" because that's what's taught in schools. I asked him, \"Could you have been turned gay by *learning* about being gay?\" His answer: \"No, of course not.\"\n\nThat's all you need to know about this shit.",
      "timestamp": "2022-05-14 18:15:57",
      "score": 8,
      "num_children": 0,
      "author": 89442,
      "replies": []
    },
    {
      "id": "i8kzmvd",
      "text": "i went to jesus camp, mostly to try and hook up with the girls.  ah, the south.\n\nanyway, they had this big jesus night, with all this shit.  everybody is crying.\n\ni remember being like, ok I'm REALLY trying.  huh i guess god doesn't exist.  oh well hopefully i can finger bang kali...\n\nbut many aren't so lucky.  their brains bullshit filter isn't as strong i guess.",
      "timestamp": "2022-05-14 14:58:16",
      "score": 7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i8l3g6q",
      "text": "Religion= indoctrination",
      "timestamp": "2022-05-14 15:27:58",
      "score": 8,
      "num_children": 0,
      "author": 378576,
      "replies": []
    },
    {
      "id": "i8lkov5",
      "text": "Dear Gay,\n\nBoobs and Butts. Gotta love those Boobs and Butts. God is good, God is great, love the vag, don’t be a f*g. 2 in the pink, zero in the stink… I guess. Anyways, gotta go. Have a good summer! Don’t forget to write! Boobs.\n\nA++++",
      "timestamp": "2022-05-14 17:37:42",
      "score": 7,
      "num_children": 1,
      "replies": [
        {
          "id": "i8lxurg",
          "text": "Ha! Thanks. This article made me pretty sad, but this comment is brilliant. Thanks for the laugh.",
          "timestamp": "2022-05-14 19:18:21",
          "score": 2,
          "num_children": 1,
          "author": 247073,
          "replies": [
            {
              "id": "i8m766p",
              "text": "Aw. I’m sorry you felt sad. It IS sad. I’m happy I could make you laugh… that’s all we can do unfortunately for ignorant people. I grew up in the bible belt and I’m a blonde/blue eyed hetero female… I just have always seen through the bullshit. That’s what I’m teaching my girls… someone’s sexuality is just one small facet of who they are as an individual… I just tell them “be who you want, just don’t be an A-hole” I did give all those nuns, priests/preachers, church ladies, young life camp counselors, and all HELL though…my mom would accidentally drop me off at pray at the flag pole at school and I’d walked up and go “I’m here for orgy” during that dumb abstinence talk where they showed a roast beef sandwich as a loose vagina, I’d raise my hand and go “that cool and all, but I think my vagina is more of like BLT or a muffaletta… wanna see it?” and even now with the whole trans bathroom issue I look them dead in the eye and go “I don’t understand why everyone is so pressed, why can’t they take a dump on the floor like I always do? we don’t bathrooms..”",
              "timestamp": "2022-05-14 20:30:30",
              "score": 3,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i8ktzpe",
      "text": "\"The left are indoctrinating our kids!!! Also, write a letter to your gay friend explaining why they should cut it out. Being gay is bad. Say it with me, kids! BEING GAY IS A SIN!!!!!!!\"",
      "timestamp": "2022-05-14 14:12:36",
      "score": 7,
      "num_children": 0,
      "author": 322691,
      "replies": []
    },
    {
      "id": "i8l8p4x",
      "text": "It's the new Christianity... all the hate, none of the compassion.",
      "timestamp": "2022-05-14 16:07:35",
      "score": 6,
      "num_children": 0,
      "author": 191534,
      "replies": []
    },
    {
      "id": "i8ldawo",
      "text": "But, as a public school teacher, if I tell one of my kids who is openly gay “that’s cool” I’m a groomer and should be murdered.",
      "timestamp": "2022-05-14 16:41:37",
      "score": 7,
      "num_children": 0,
      "author": 214659,
      "replies": []
    },
    {
      "id": "i8ljdx4",
      "text": "All religion's are cults. When you realize your gods are not real but your cult is. GTFO out of it. \n\nBe a good person. Live a good life.",
      "timestamp": "2022-05-14 17:27:46",
      "score": 5,
      "num_children": 0,
      "author": 74101,
      "replies": []
    },
    {
      "id": "i8muva0",
      "text": "The USA, once known as \"land of freedom\" is becoming a world capital of hate.",
      "timestamp": "2022-05-14 23:34:20",
      "score": 7,
      "num_children": 0,
      "author": 67980,
      "replies": []
    },
    {
      "id": "i8ktwix",
      "text": "The only \"grooming\"going on in American schools.",
      "timestamp": "2022-05-14 14:11:51",
      "score": 5,
      "num_children": 0,
      "author": 271639,
      "replies": []
    },
    {
      "id": "i8kue49",
      "text": "\"My dearest sodomite...\"",
      "timestamp": "2022-05-14 14:15:56",
      "score": 5,
      "num_children": 0,
      "author": 359068,
      "replies": []
    },
    {
      "id": "i8l3dqg",
      "text": "The reason that Republicans do most of what they do is because they’re terrified their kids won’t turn out to be dumb bigots like they are.",
      "timestamp": "2022-05-14 15:27:26",
      "score": 5,
      "num_children": 0,
      "author": 101555,
      "replies": []
    },
    {
      "id": "i8lgk2x",
      "text": "Religious schools of any kind at the K-12 level should be illegal. Their only goal is indoctrination and whatever write offs or other financial benefits it gives them. If you decide to be religious and want to go to a seminary as an adult, fine. Forceful indoctrination of children is child abuse.",
      "timestamp": "2022-05-14 17:06:10",
      "score": 4,
      "num_children": 0,
      "author": 22183,
      "replies": []
    },
    {
      "id": "i8m88ne",
      "text": "Christian school near me didn't let kids read Harry Potter.\n\nBack in the days I had a gf that was also in a school ran partly by nuns or smth and they took her necklace that I gave her.\n\nIt was a small Egyptian cross that I got as a souvenir from egypt.",
      "timestamp": "2022-05-14 20:38:48",
      "score": 6,
      "num_children": 2,
      "author": 366348,
      "replies": [
        {
          "id": "i8mk2si",
          "text": "Had a person in a church we used to go to tell us the issues we were having with our son was because of Harry Potter.",
          "timestamp": "2022-05-14 22:10:06",
          "score": 3,
          "num_children": 0,
          "author": 352574,
          "replies": []
        },
        {
          "id": "i8mk46j",
          "text": "Had a person in a church we used to go to tell us the issues we were having with our son was because of Harry Potter.",
          "timestamp": "2022-05-14 22:10:24",
          "score": 2,
          "num_children": 1,
          "author": 352574,
          "replies": [
            {
              "id": "i8mmgzo",
              "text": "Gotta hate the muggles.\n\nYeah that's awful. I loved HP as a kid. It was just such a beautiful and magical thing to read and watch.\n\nI found the first book in my parents cabinet when I was couple years old. They said I'm too young but in the end they read it to me in bed. We went like this through a couple of books. Good memories and quality parent - kid time.",
              "timestamp": "2022-05-14 22:28:56",
              "score": 2,
              "num_children": 0,
              "author": 366348,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i8nbjt5",
      "text": "Hate sells. Just look at Social Media.",
      "timestamp": "2022-05-15 01:56:00",
      "score": 6,
      "num_children": 0,
      "author": 35543,
      "replies": []
    },
    {
      "id": "i8kxx4r",
      "text": "There are parents on here who see no problem sending their kids to Christian schools because they assume their kids will ignore these teachings and that Christian schools offer a “good education” “without much religion at all.”\n\nBe wary. Check the curriculum. Especially if it isn’t a Catholic school, because this type of thing happens in schools other than Catholic.",
      "timestamp": "2022-05-14 14:44:31",
      "score": 5,
      "num_children": 0,
      "author": 81881,
      "replies": []
    },
    {
      "id": "i8ky5q4",
      "text": "Them: don't indoctrinate my kid, liberal!\n\nUs:\n\nThem: tell your peers why their feelings are invalid and wrong because I'm afraid of gayness.",
      "timestamp": "2022-05-14 14:46:27",
      "score": 3,
      "num_children": 0,
      "author": 111216,
      "replies": []
    },
    {
      "id": "i8kz23k",
      "text": "Christian terrorist training facility.",
      "timestamp": "2022-05-14 14:53:39",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i8l1mkr",
      "text": "We knew this was coming. Anything the GOP accuses others of, they will eventually do in the near future. Gaslight Obstruct Project.",
      "timestamp": "2022-05-14 15:13:54",
      "score": 6,
      "num_children": 0,
      "author": 368127,
      "replies": []
    },
    {
      "id": "i8l48vu",
      "text": "\nThe don’t use religion as cover to indoctrinate children with hateful, evidence-free beliefs. Religion IS the hateful evidence-free belief.",
      "timestamp": "2022-05-14 15:34:04",
      "score": 5,
      "num_children": 0,
      "author": 224516,
      "replies": []
    },
    {
      "id": "i8l99m3",
      "text": "A great deal of the three Mosaic religions activity is around intensely grooming children.  This is why it is so simple for the clergy to sexually abuse them; it's the same skill set.",
      "timestamp": "2022-05-14 16:11:55",
      "score": 5,
      "num_children": 0,
      "author": 95477,
      "replies": []
    },
    {
      "id": "i8le4e1",
      "text": "The “they’re too young to be knowing about sexuality” crowd has gone quiet",
      "timestamp": "2022-05-14 16:47:45",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i8lmlb0",
      "text": "Ban religion from government only vote for Atheist's.",
      "timestamp": "2022-05-14 17:52:00",
      "score": 3,
      "num_children": 0,
      "author": 307782,
      "replies": []
    },
    {
      "id": "i8lxghm",
      "text": "The goal of the church is for gay kids to kill themselves, or to encourage bigots to murder us. This isn’t education; it’s terrorism.",
      "timestamp": "2022-05-14 19:15:14",
      "score": 4,
      "num_children": 0,
      "author": 247073,
      "replies": []
    },
    {
      "id": "i8m1nsb",
      "text": "When you disguise homophobia as righteous love, it's hard to break away from oppression. It makes the oppressor feel like the victim, they have this shit down to an art.",
      "timestamp": "2022-05-14 19:48:09",
      "score": 3,
      "num_children": 0,
      "author": 230120,
      "replies": []
    },
    {
      "id": "i8mcagz",
      "text": "Can't send a kid to Conversion Therapy camp anymore? No problem, just get the kids to do Conversion Therapy for you!",
      "timestamp": "2022-05-14 21:09:53",
      "score": 4,
      "num_children": 0,
      "author": 159420,
      "replies": []
    },
    {
      "id": "i8mqdio",
      "text": "I'm so glad I found this. I keep using articles like this as ammo against my religious friends who keep trying to \"save me.\"   not only is religion dumb it turns good people into wicked monsters",
      "timestamp": "2022-05-14 22:59:26",
      "score": 5,
      "num_children": 0,
      "author": 100280,
      "replies": []
    },
    {
      "id": "i8mvtt4",
      "text": "\"Almost any sect, cult, or religion will legislate its creed into law if it acquires the political power to do so, and will follow it by suppressing opposition, subverting all education to seize early the minds of the young, and by killing, locking up, or driving underground all heretics \"\n\nROBERT A. HEINLEIN",
      "timestamp": "2022-05-14 23:42:04",
      "score": 4,
      "num_children": 0,
      "author": 22401,
      "replies": []
    },
    {
      "id": "i8n0gjf",
      "text": "\"Christian school\" is an oxymoron. You take an evidence free system and let it run an evidence dependent system.",
      "timestamp": "2022-05-15 00:20:51",
      "score": 4,
      "num_children": 0,
      "author": 220399,
      "replies": []
    },
    {
      "id": "i8n2v3a",
      "text": "My daughter is a junior in high school and is bi. She said she’s going to get all the kids from GSA to write letters to a straight kid asking them to become gay. It’s what these Jesus freaks think is happening in public schools anyway.",
      "timestamp": "2022-05-15 00:40:57",
      "score": 4,
      "num_children": 0,
      "author": 76147,
      "replies": []
    },
    {
      "id": "i8nf51k",
      "text": "As someone who grew up with a parent who’d go the extra mile to squash any gay tendencies by yelling and threatening me, she really was thrown for a loop when she found out I was trans.  ;)\n\nBut she also tried to force me to change my sex back after SRS and I refused.  ;)\n\nMy whole family can go to hell…..  as can anyone who’d push this crap on any of my kids or people I knew who were gay",
      "timestamp": "2022-05-15 02:27:14",
      "score": 4,
      "num_children": 0,
      "author": 32174,
      "replies": []
    },
    {
      "id": "i8nlfpt",
      "text": "\"A Christian school in Kentucky...\" is all I needed to hear- smh",
      "timestamp": "2022-05-15 03:25:10",
      "score": 3,
      "num_children": 0,
      "author": 240483,
      "replies": []
    },
    {
      "id": "i8o0ngu",
      "text": "Ironic how the most religious people can be the most hateful ones that believe they are doing the right things and will get into heaven… or whatever they call it. Its amazing how hateful their “Gods” tell them to be… isnt their God ashamed of their behavior? I guess its hard to differentiate between right and wrong when ur just so brainwashed…",
      "timestamp": "2022-05-15 06:11:20",
      "score": 5,
      "num_children": 0,
      "author": 231544,
      "replies": []
    },
    {
      "id": "i8o78z4",
      "text": "The right in America is garbage just like the people brainwashed to be Nazis in Germany.",
      "timestamp": "2022-05-15 07:40:43",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i8oewlu",
      "text": "This is why religious schools shouldn't exist. \n\n\nSchool is for learning things, not for perpetuating the same lies for centuries and speading hate towards other people.",
      "timestamp": "2022-05-15 09:30:09",
      "score": 5,
      "num_children": 0,
      "author": 318104,
      "replies": []
    },
    {
      "id": "i8l02lg",
      "text": "Murica to the Middle East: Ya'll got any more of that Sharia Law?",
      "timestamp": "2022-05-14 15:01:41",
      "score": 10,
      "num_children": 0,
      "author": 342213,
      "replies": []
    },
    {
      "id": "i8l83fz",
      "text": "I've been saying this forever religion is a vehicle for control and some of the most nasty bigoted people I've ever met are those that are Christians",
      "timestamp": "2022-05-14 16:03:05",
      "score": 3,
      "num_children": 0,
      "author": 146997,
      "replies": []
    },
    {
      "id": "i8lc6rh",
      "text": "Ah, religious schools, a fine place to start the indoctrination of future bigots.",
      "timestamp": "2022-05-14 16:33:27",
      "score": 3,
      "num_children": 0,
      "author": 152301,
      "replies": []
    },
    {
      "id": "i8lf9cg",
      "text": "How very religious of them.  Just goes to prove it - hate is *taught*, and Christians just make up ways to do it, using stories of fantasy and fear to do it.",
      "timestamp": "2022-05-14 16:56:19",
      "score": 3,
      "num_children": 0,
      "author": 164082,
      "replies": []
    },
    {
      "id": "i8lif56",
      "text": "This is fucking evil.",
      "timestamp": "2022-05-14 17:20:25",
      "score": 3,
      "num_children": 0,
      "author": 355690,
      "replies": []
    },
    {
      "id": "i8lmas4",
      "text": "I hate living in Kentucky because we have bullshit like this and of course the two asshat, Russian stooges of McConnell and Rand Paul. I absolutely have the means to move, and did leave the state for many years, but I feel I must stay to keep some blue outside of Lexington and Louisville. \n\nIt’s a beautiful state full of hateful, bigoted, religious idiots outside the two cities. \n\nFor those not familiar with Kentucky, besides the aforementioned morons, there are some good things here. Like AppHarvest which is trying to change how we grow crops more efficiently indoors.\n\nAffordability of land is good here too compared to the larger metro areas. If the internet was better in rural areas then I’d recommend more people move here. Preferably atheists and more liberally minded people. :-)",
      "timestamp": "2022-05-14 17:49:50",
      "score": 3,
      "num_children": 0,
      "author": 361227,
      "replies": []
    },
    {
      "id": "i8lnmc3",
      "text": "I went to a Catholic grammar school for 5 years and if you were caught swearing, even a casual \"aw crap\" you were in serious trouble. But casual homophobia? Not only was it fine, teachers would playfully join in.",
      "timestamp": "2022-05-14 17:59:55",
      "score": 3,
      "num_children": 0,
      "author": 58582,
      "replies": []
    },
    {
      "id": "i8lwsh4",
      "text": "I actually went to this school. I’m not a Christian and wasn’t while there. That particular unit was taught to me as a senior in high school. We were never asked to write letters or have conversation, but they definitely prepared us for conversation. They don’t teach hate, but it’s a weird type of love. As an openly non-Christian who went there it’s not some crazy southerner school that teaches wild ideals, they loosely follow the Bible. They’re racists as hell though there (students).",
      "timestamp": "2022-05-14 19:09:58",
      "score": 3,
      "num_children": 0,
      "author": 369599,
      "replies": []
    },
    {
      "id": "i8ly0aa",
      "text": "This is the kind of disgusting shit schools have been doing for decades. How do you think the boomers ended up as mostly awful, terrible people who are so locked in their shitty beliefs that it is impossible to change their minds? It's not just their parents. \n\nThe difference is now it is documented and discussed all over the internet. I have hope that these kinds of horrible things being brought to light and discussed will severely decrease the amount of bad people in future generations.",
      "timestamp": "2022-05-14 19:19:32",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i8m4xtg",
      "text": "Meanwhile in China they're teaching their kids science, mathematics, engineering, computer science... and how easily the US can be nudged into a once great former super power.",
      "timestamp": "2022-05-14 20:13:27",
      "score": 3,
      "num_children": 0,
      "author": 52614,
      "replies": []
    },
    {
      "id": "i8m8uqx",
      "text": "Are these letters being read by a third party ? \n\nIf so, that is a breach of privacy. \n\nThe teachers and administration of this school should be sued into bankruptcy.",
      "timestamp": "2022-05-14 20:43:26",
      "score": 3,
      "num_children": 0,
      "author": 233835,
      "replies": []
    },
    {
      "id": "i8meeyq",
      "text": "ChristoFascists",
      "timestamp": "2022-05-14 21:26:19",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i8mfgne",
      "text": "These things make me really scared for our children's future.... How can it be that we see such massive steps backwards?!",
      "timestamp": "2022-05-14 21:34:18",
      "score": 3,
      "num_children": 0,
      "author": 224859,
      "replies": []
    },
    {
      "id": "i8mizqn",
      "text": "No wonder the conservatives are winning politically, they're weaponizing everything",
      "timestamp": "2022-05-14 22:01:38",
      "score": 3,
      "num_children": 0,
      "author": 13891,
      "replies": []
    },
    {
      "id": "i8mni4l",
      "text": "I’m willing to take some D just out of spite at this point.",
      "timestamp": "2022-05-14 22:36:59",
      "score": 3,
      "num_children": 0,
      "author": 298752,
      "replies": []
    },
    {
      "id": "i8mnwmg",
      "text": "Groomers",
      "timestamp": "2022-05-14 22:40:08",
      "score": 3,
      "num_children": 0,
      "author": 390088,
      "replies": []
    },
    {
      "id": "i8mtqcs",
      "text": "Let’s write letters to the school: stop being straight",
      "timestamp": "2022-05-14 23:25:22",
      "score": 3,
      "num_children": 0,
      "author": 33076,
      "replies": []
    },
    {
      "id": "i8muuvq",
      "text": "Isnt the entire concept of religion a... evidence-free belief\n\nIg evidence-free belief here means that its not written in a book",
      "timestamp": "2022-05-14 23:34:14",
      "score": 3,
      "num_children": 0,
      "author": 309108,
      "replies": []
    },
    {
      "id": "i8n85f0",
      "text": "Easily solved with a Molotov cocktail",
      "timestamp": "2022-05-15 01:26:34",
      "score": 3,
      "num_children": 0,
      "author": 361368,
      "replies": []
    },
    {
      "id": "i8n9lr1",
      "text": "Religion teaches the willful ignorance of unquestioning blind faith as well as fear and hate.",
      "timestamp": "2022-05-15 01:39:27",
      "score": 3,
      "num_children": 0,
      "author": 395557,
      "replies": []
    },
    {
      "id": "i8nauiu",
      "text": "Kids can read or write in Kentucky? Since when? They're damn near last in education. Mitch and Rand are doing a great job with that state.",
      "timestamp": "2022-05-15 01:50:12",
      "score": 3,
      "num_children": 0,
      "author": 406737,
      "replies": []
    },
    {
      "id": "i8nce74",
      "text": ">  evidence-free beliefs\n\nI need to remember that one.",
      "timestamp": "2022-05-15 02:03:10",
      "score": 3,
      "num_children": 0,
      "author": 129864,
      "replies": []
    },
    {
      "id": "i8ni2ku",
      "text": "I’m curious, I realize these Christian schools are probably private, but don’t they have to adhere to the same laws as the rest of the country? What was done to this person by all the students is a cute and malignant bigotry! And as far as I know, it is highly illegal in America at this point! Can I honestly get away from this lawfully because of religion? A Christian saying that they’re allowed to be bigots and racist snow? Hey let’s have some fun kids, find me a passage in the Bible that even talks about abortion or honest homosexuality, You really won’t find any, however you will find four stories of incest in the Bible.",
      "timestamp": "2022-05-15 02:53:37",
      "score": 3,
      "num_children": 0,
      "author": 266213,
      "replies": []
    },
    {
      "id": "i8ni82j",
      "text": "Christian madrasa indoctrinating the next generation of Y’all Qaeda",
      "timestamp": "2022-05-15 02:55:01",
      "score": 3,
      "num_children": 0,
      "author": 204568,
      "replies": []
    },
    {
      "id": "i8nlubw",
      "text": "Yeah. Religion is really really harmful to people in a lot of ways. We have no dearth of evidence here. Religion sucks ass. \n\nOf course we need to keep talking about it until the religious actually listen. But it's really frustrating...",
      "timestamp": "2022-05-15 03:29:04",
      "score": 3,
      "num_children": 0,
      "author": 216152,
      "replies": []
    },
    {
      "id": "i8ny7ab",
      "text": "Am from KY. Not surprised.\n\nI was once called \"hysterical\" for pointing out that a private school here that had \"the crusaders\" as a mascot was fucking demented.",
      "timestamp": "2022-05-15 05:40:27",
      "score": 3,
      "num_children": 0,
      "author": 81810,
      "replies": []
    },
    {
      "id": "i8o5p0v",
      "text": "Would the world be a better place with more gay people or more Christians?",
      "timestamp": "2022-05-15 07:18:55",
      "score": 3,
      "num_children": 0,
      "author": 141119,
      "replies": []
    },
    {
      "id": "i8l07o6",
      "text": "Christianity should be banned.",
      "timestamp": "2022-05-14 15:02:47",
      "score": 12,
      "num_children": 1,
      "replies": [
        {
          "id": "i8l2qru",
          "text": "Not all Christians are bad just saying. Banning it will be  a form of persecution just like the American Christians are doing. Its complicated and sucks. Worlds not black and white",
          "timestamp": "2022-05-14 15:22:29",
          "score": -2,
          "num_children": 1,
          "author": 329407,
          "replies": [
            {
              "id": "i8l6xhn",
              "text": ">Not all Christians are bad just saying.\n\nOkay. But the vast majority of the \"good ones\" don't seem to be holding the \"bad ones\" accountable when shit like this happens. Ever. Sure sounds alot like complacency and enabling.\n\nChristians have persecuted countless scores of people for millennia to achieve the power they have and look where it has taken society?\nTheir time is over and they have long worn out their welcome. Taking a page from their book, \"You reep what you sow.\"",
              "timestamp": "2022-05-14 15:54:18",
              "score": 9,
              "num_children": 1,
              "replies": [
                {
                  "id": "i8l7sgx",
                  "text": "I'm agnostic fyi. Majority of religions do this as well. You cant just ban religion though. Multiple countries have tried it just doesn't work",
                  "timestamp": "2022-05-14 16:00:47",
                  "score": -3,
                  "num_children": 2,
                  "author": 329407,
                  "replies": [
                    {
                      "id": "i8mkwmb",
                      "text": "You can ban anything. It's a matter of enforcement. If we \"persecuted\" Christians the way Christians *claim* they are being persecuted, the world would be a better place. But I'm an asshole so that's just my asshole opinion.",
                      "timestamp": "2022-05-14 22:16:38",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i8mp1hl",
                          "text": "Well don't talk down yourself :(. I agree it would be better just ain't gonna happen",
                          "timestamp": "2022-05-14 22:49:01",
                          "score": 1,
                          "num_children": 1,
                          "author": 329407,
                          "replies": [
                            {
                              "id": "i8mp8gg",
                              "text": "I'm just self-aware that my opinions tend to be extremist and unpopular. Thanks for being cool about it.",
                              "timestamp": "2022-05-14 22:50:27",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "i8mpuzo",
                                  "text": "For sure some of mine are to lol",
                                  "timestamp": "2022-05-14 22:55:26",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 329407,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i8lnips",
                      "text": "So downvoted and no reply. Such maturity lol",
                      "timestamp": "2022-05-14 17:59:08",
                      "score": -2,
                      "num_children": 1,
                      "author": 329407,
                      "replies": [
                        {
                          "id": "i8mkyeq",
                          "text": "You talking about me? Some of us work for a living. I didn't downvote you, I just read the reply.",
                          "timestamp": "2022-05-14 22:17:02",
                          "score": 3,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i8mp4fw",
                              "text": "Sure",
                              "timestamp": "2022-05-14 22:49:37",
                              "score": 0,
                              "num_children": 0,
                              "author": 329407,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i8m3k2h",
      "text": "I hate my state more with each passing day",
      "timestamp": "2022-05-14 20:02:53",
      "score": 5,
      "num_children": 0,
      "author": 174693,
      "replies": []
    },
    {
      "id": "i8l218y",
      "text": "Indoctrination and default Christianity being taught to the next generation. Way to not break the cycle, another example of christians being the worst enemy of Christianity.",
      "timestamp": "2022-05-14 15:17:04",
      "score": 2,
      "num_children": 0,
      "author": 238439,
      "replies": []
    },
    {
      "id": "i8l41ba",
      "text": "of course they do, thats what its fucking for.",
      "timestamp": "2022-05-14 15:32:30",
      "score": 2,
      "num_children": 0,
      "author": 278817,
      "replies": []
    },
    {
      "id": "i8l6cf7",
      "text": "Has the term “Homosexual” always been in the Bible? NO\nhttps://www.forgeonline.org/blog/2019/3/8/what-about-romans-124-27",
      "timestamp": "2022-05-14 15:49:53",
      "score": 2,
      "num_children": 0,
      "author": 320247,
      "replies": []
    },
    {
      "id": "i8lbehe",
      "text": "“Teach them how to think, not what to think.” I’ve heard that somewhere before…..",
      "timestamp": "2022-05-14 16:27:37",
      "score": 2,
      "num_children": 0,
      "author": 177462,
      "replies": []
    },
    {
      "id": "i8lct60",
      "text": "Maybe if they wrote a hypothetical letter to their priest about why pedophilia isn't okay despite its implicit acceptance by the Bible they'd make a greater impact.",
      "timestamp": "2022-05-14 16:38:00",
      "score": 2,
      "num_children": 0,
      "author": 19864,
      "replies": []
    },
    {
      "id": "i8ldroc",
      "text": "\"hateful, evidence-free beliefs\" is pretty much Christianity.",
      "timestamp": "2022-05-14 16:45:04",
      "score": 2,
      "num_children": 0,
      "author": 316384,
      "replies": []
    },
    {
      "id": "i8llhcl",
      "text": "The gay \"friend\" should write back simply to stop believing in fairy tales and quit being an asshole.",
      "timestamp": "2022-05-14 17:43:43",
      "score": 2,
      "num_children": 0,
      "author": 9658,
      "replies": []
    },
    {
      "id": "i8ln14d",
      "text": "Grrrr",
      "timestamp": "2022-05-14 17:55:21",
      "score": 2,
      "num_children": 0,
      "author": 34814,
      "replies": []
    },
    {
      "id": "i8lnqj5",
      "text": "It's (moderately) interesting to look at other browser tabs people have open.  In one of the screenshots, the user has a tab open to a Turkish-language page called (in Turkish) \"Everything You Wanted To Know About Our Solar System.\"\n\nThat web page is on a website called bukrek.com, which is named after Bükrek, the \"good dragon\" in the mythology of the [Altai people](https://en.wikipedia.org/wiki/Altai_people).  The \"bad dragon\" is called Sangal.   According to the myth, the dragons fought for 9 years.  Hmmm, that seems a little short-sighted for ancient mythology.\n\nBükrek (bukrek.com) should be confused with Bukrek (bukrek.net), a Ukranian publishing house.\n\nTo the left of that Turkish page on the solar system is a tab in which, presumably, is an image of the solar system, which was presumably found by searching Bing, which is the tab to the left of that.\n\nBing is interesting to me, because it's not Google.  But that might just be because this user is on Windows, the default browser on Windows is currently Edge, and the default search engine in Edge is Bing.\n\nBut another thought that I had is of certain Christians over the years, who have avoided the use of Google because \"they pay for abortions,\" or some shit.  So I wonder if this school requires the use of Bing (and you would think if you're avoiding Google, you would avoid Microsoft for the same reasons).\n\nObviously the most interesting thing about this is the Turkish-language website, suggesting that this Christian school student is at least of Turkish descent, and may even find it easier to read about the solar system in their native language than in English.\n\nBut alas, I'm looking too deeply into this :)\n\nWeird that science would appear in the same browser session as this nonsense.  Seems like they would teach that all the students need to know about \"the heavens\" they could learn from The Bible.\n\nI was a little surprised I couldn't identify that task-evaluation software, based on what it is (I've used software like that, specifically Taskstream) and the favicon that's right there in the tab.  But no dice on that.  It's not a big deal, but it's an exact clone of what I remember about Taskstream.   I'm a little surprised that a secondary-school student (lower than university) would be using task software like that, but I guess remote learning was a boon for that sort of thing.\n\nEdit:  Found it.  It's called [Canvas](https://www.instructure.com/k12/products/canvas).  That's what the school uses for their \"digital classroom\" stuff.",
      "timestamp": "2022-05-14 18:00:46",
      "score": 2,
      "num_children": 0,
      "author": 151583,
      "replies": []
    },
    {
      "id": "i8lntv4",
      "text": "I would call their bluff. Tell my kid not to do it and take the thing all the way to the Supreme Cour-ahhhhh fuck.",
      "timestamp": "2022-05-14 18:01:27",
      "score": 2,
      "num_children": 0,
      "author": 325226,
      "replies": []
    },
    {
      "id": "i8lo3wn",
      "text": "Yikes.  The sad thing is religious leaders brainwash people into thinking they need to reject others.",
      "timestamp": "2022-05-14 18:03:33",
      "score": 2,
      "num_children": 0,
      "author": 102686,
      "replies": []
    },
    {
      "id": "i8lpdle",
      "text": "\"Grooming is only wrong when other people do it\"",
      "timestamp": "2022-05-14 18:13:06",
      "score": 2,
      "num_children": 0,
      "author": 376296,
      "replies": []
    },
    {
      "id": "i8lpgps",
      "text": "I'd like to write these kids a letter encouraging them to read the bible all the way through and apologize to those friends.",
      "timestamp": "2022-05-14 18:13:45",
      "score": 2,
      "num_children": 0,
      "author": 156778,
      "replies": []
    },
    {
      "id": "i8lqffl",
      "text": "That's basically what churches have been doing forever.",
      "timestamp": "2022-05-14 18:20:58",
      "score": 2,
      "num_children": 0,
      "author": 313777,
      "replies": []
    },
    {
      "id": "i8lqfki",
      "text": "But science is indoctrination...",
      "timestamp": "2022-05-14 18:20:59",
      "score": 2,
      "num_children": 0,
      "author": 32176,
      "replies": []
    },
    {
      "id": "i8lqfx6",
      "text": "That's basically what churches have been doing forever.",
      "timestamp": "2022-05-14 18:21:04",
      "score": 2,
      "num_children": 0,
      "author": 313777,
      "replies": []
    },
    {
      "id": "i8lqnss",
      "text": "Those schools shouldn't be counted for a child's mandatory grades of education, they are not real schools and do a disservice to children!",
      "timestamp": "2022-05-14 18:22:42",
      "score": 2,
      "num_children": 0,
      "author": 191548,
      "replies": []
    },
    {
      "id": "i8lrj2d",
      "text": "Huh. How did the explain what gay was without teaching them about gayness?   Perhaps DeSantis should sue Kentucky.",
      "timestamp": "2022-05-14 18:29:29",
      "score": 2,
      "num_children": 0,
      "author": 46861,
      "replies": []
    },
    {
      "id": "i8ltt14",
      "text": "Some of these Deep South towns really are like time traveling when you visit them. \n\nMy moms family is originally from a super tiny town deep in North Carolina that my grandmas funeral was in. \n\nLiterally the first time in my life I heard people use the term “colored” still or just really felt like it was still 1950 or something. Bigots, racists, homophobic etc \n\n‘‘Twas not a good time. \n\nReal beautiful there though 😆",
      "timestamp": "2022-05-14 18:46:52",
      "score": 2,
      "num_children": 0,
      "author": 387921,
      "replies": []
    },
    {
      "id": "i8lvnsf",
      "text": "It's not a cover, the point of organized religion is indoctrination and most of their dogma relies on discrimination, hate and a superiority complex.",
      "timestamp": "2022-05-14 19:01:09",
      "score": 2,
      "num_children": 0,
      "author": 285950,
      "replies": []
    },
    {
      "id": "i8lwocf",
      "text": "Me and my friends would've wrote:\n\nDear Josue,\n\nYo you shouldn't be gay. I understand that dicks are so tantalizing with their girthy trunks dangling underneath gymshorts, and their velvety sacks that can make any creature salivate but it's not for us unless you become a priest.",
      "timestamp": "2022-05-14 19:09:05",
      "score": 2,
      "num_children": 0,
      "author": 239531,
      "replies": []
    },
    {
      "id": "i8lyr89",
      "text": "This story is just another one of the many examples of why RELIGION IS THE BANE OF HUMANITY AND IT MUST BE STOPPED.",
      "timestamp": "2022-05-14 19:25:25",
      "score": 2,
      "num_children": 0,
      "author": 1045,
      "replies": []
    },
    {
      "id": "i8lz33n",
      "text": "What a wonderful way to teach kids to mind their own fucking business and worry about themselves....\n\nHow annoying and not at all surprising",
      "timestamp": "2022-05-14 19:28:02",
      "score": 2,
      "num_children": 0,
      "author": 362330,
      "replies": []
    },
    {
      "id": "i8m3mcx",
      "text": "Again I say..... When is this human species going to evolve socially and emotionally?  And, don't think that this is just endemic to the American South.   This is worldwide and it has been this way since humans started to document their activities. All I can suggest is that we all do our part to discourage hate and ignorance.   I feel for these kids.  I'm a retired School Psychologist and I'm proud that I got to work with so many needy kids in supporting and encouraging them to not get sucked into this evangelical and illogical bullshit.  Now, I have grandkids entering adolescence and THEY are experiencing eye opening events.  My 13 year old granddaughter wants to be a boy.   It's a good thing that our family loves and supports our kids to be the best that they can be and that we are on this journey with them.  We have no secrets in our family and we all appreciate and respect science and medical research.  Communication is key and let's keep up the fight despite this  primitive SCOTUS that we have now.   What century are they residing in?  Check out the cold opening of last week's SNL.  It's pretty good.",
      "timestamp": "2022-05-14 20:03:22",
      "score": 2,
      "num_children": 0,
      "author": 253763,
      "replies": []
    },
    {
      "id": "i8m5j4y",
      "text": "Christianity=evidence free. Hard to separate the two…",
      "timestamp": "2022-05-14 20:17:58",
      "score": 2,
      "num_children": 0,
      "author": 320163,
      "replies": []
    },
    {
      "id": "i8m78o9",
      "text": "And they do it all tax free",
      "timestamp": "2022-05-14 20:31:03",
      "score": 2,
      "num_children": 0,
      "author": 240770,
      "replies": []
    },
    {
      "id": "i8meplw",
      "text": "I don’t know how, but I bet Mitch owns a piece of this",
      "timestamp": "2022-05-14 21:28:38",
      "score": 2,
      "num_children": 0,
      "author": 165062,
      "replies": []
    },
    {
      "id": "i8meugv",
      "text": "They made us do the same thing in gradeschool in  PUBLIC school back in the early 80s.",
      "timestamp": "2022-05-14 21:29:39",
      "score": 2,
      "num_children": 0,
      "author": 369894,
      "replies": []
    },
    {
      "id": "i8mogr4",
      "text": "Shut up stupid",
      "timestamp": "2022-05-14 22:44:33",
      "score": 2,
      "num_children": 0,
      "author": 289146,
      "replies": []
    },
    {
      "id": "i8mplyy",
      "text": "[removed]",
      "timestamp": "2022-05-14 22:53:26",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "i8ouc37",
          "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
          "timestamp": "2022-05-15 12:43:13",
          "score": 1,
          "num_children": 0,
          "author": 122319,
          "replies": []
        }
      ]
    },
    {
      "id": "i8mq8io",
      "text": "I hope they wrote similar letters for every sin in the Bible. \n\nWhat am I saying, of course they didn’t",
      "timestamp": "2022-05-14 22:58:20",
      "score": 2,
      "num_children": 0,
      "author": 15628,
      "replies": []
    },
    {
      "id": "i8mqj2u",
      "text": "I hope some of the kids wrote letters encouraging him to be himself",
      "timestamp": "2022-05-14 23:00:37",
      "score": 2,
      "num_children": 0,
      "author": 284808,
      "replies": []
    },
    {
      "id": "i8msxqw",
      "text": "\"Dear gay dude friend,\n\nYou should be straight instead of gay because God gave women titties which are so much fun to play with, you just wouldn't believe. Even Jesus would totally cop a feel if he could do it without his dad finding out. Amen.\n\nYour totally straight friend, \nNathaniel\"",
      "timestamp": "2022-05-14 23:19:06",
      "score": 2,
      "num_children": 0,
      "author": 218198,
      "replies": []
    },
    {
      "id": "i8mzzss",
      "text": "In the science class they encouraged them to ask gravity to reverse itself and renounce its attraction to mass.",
      "timestamp": "2022-05-15 00:16:53",
      "score": 2,
      "num_children": 0,
      "author": 275923,
      "replies": []
    },
    {
      "id": "i8n33h8",
      "text": "Probably should focus on why incest is wrong first…",
      "timestamp": "2022-05-15 00:42:52",
      "score": 2,
      "num_children": 0,
      "author": 9043,
      "replies": []
    },
    {
      "id": "i8ncjvp",
      "text": "The funniest thing is how hypocritical their teachings are. “Jesus died for our sins but I swear to God if you don’t stop being gay this very minute you’ll burn in hell”",
      "timestamp": "2022-05-15 02:04:32",
      "score": 2,
      "num_children": 0,
      "author": 257863,
      "replies": []
    },
    {
      "id": "i8ngy2r",
      "text": "These people are so so stupid.",
      "timestamp": "2022-05-15 02:43:18",
      "score": 2,
      "num_children": 1,
      "author": 13211,
      "replies": [
        {
          "id": "i8p2lqj",
          "text": "They’re evil.",
          "timestamp": "2022-05-15 13:57:44",
          "score": 1,
          "num_children": 0,
          "author": 55631,
          "replies": []
        }
      ]
    },
    {
      "id": "i8o1ux0",
      "text": "I kind of look forward to this day with my kids. That seems like the perfect reason to teach kids naughty words,  and I'd love to see the teachers face when they open a note from my kids that says \"Stop being a fucking lying, disgusting,  bigoted douche bag!\" It would be so fun to see that mix of shock on the teachers face, obviously just before we cleaned out the kids possessions from the school and called a lawyer on the way out.",
      "timestamp": "2022-05-15 06:27:09",
      "score": 2,
      "num_children": 1,
      "author": 254002,
      "replies": [
        {
          "id": "i8o268i",
          "text": "Not so easy.  The teacher may be complying to keep their job, the real anger and vitriol should be on those responsible, school board.\n\nStill do it, but send the letter where it needs to go.",
          "timestamp": "2022-05-15 06:31:26",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "i8o2vzk",
              "text": "I have a feeling it would get there.  What teacher gets an \"improper\" paper from a student and doesn't immediately run up the chain of command?",
              "timestamp": "2022-05-15 06:40:45",
              "score": 2,
              "num_children": 0,
              "author": 254002,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i8o5gl2",
      "text": "Yikes. When I saw the headline I assumed it was one of the backwoods Baptist run schools here in Kentucky (we have a lot of them), but CAL is a fairly large school for a private school, and is generally well respected throughout the state. Not a good look.",
      "timestamp": "2022-05-15 07:15:37",
      "score": 2,
      "num_children": 0,
      "author": 83636,
      "replies": []
    },
    {
      "id": "i8ojelk",
      "text": "You found the homework you fail if you do it?",
      "timestamp": "2022-05-15 10:34:48",
      "score": 2,
      "num_children": 0,
      "author": 343754,
      "replies": []
    },
    {
      "id": "i8oopr9",
      "text": "Can 69u take the school to court for discrimination?",
      "timestamp": "2022-05-15 11:43:31",
      "score": 2,
      "num_children": 0,
      "author": 391283,
      "replies": []
    },
    {
      "id": "i8otc2y",
      "text": "I truly hope the parents of this child not only withdrew them from this unsafe space, but sued the everliving fuck out of them for harassment and mental health distress and discrimination.",
      "timestamp": "2022-05-15 12:33:17",
      "score": 2,
      "num_children": 0,
      "author": 11407,
      "replies": []
    },
    {
      "id": "i8l66wx",
      "text": "I probably shouldn't be here because i am Christian and i believe in god but i hate how people do stuff like that especially when it comes to saying lgbtq and stuff like that isn't ok because thats not true and we are supposed to respect it, i kinda feel as id anyone who does stuff like what this post is talking about is more deserveing of hell, although you have to be pretty awfull to go to hell",
      "timestamp": "2022-05-14 15:48:45",
      "score": 0,
      "num_children": 2,
      "replies": [
        {
          "id": "i8lajpp",
          "text": "With all due respect, it seems that Christians like you aren't doing enough about Christians like them.",
          "timestamp": "2022-05-14 16:21:13",
          "score": 21,
          "num_children": 1,
          "author": 68428,
          "replies": [
            {
              "id": "i8lbmfu",
              "text": "And you are completely right",
              "timestamp": "2022-05-14 16:29:17",
              "score": 6,
              "num_children": 1,
              "replies": [
                {
                  "id": "i8levt7",
                  "text": "Do you support the LGBTQ+ community?",
                  "timestamp": "2022-05-14 16:53:27",
                  "score": 5,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "i8lfnwr",
                      "text": "Yea, i see nothing wrong with any of it, aslong as they are respectful of others and are good people then i have no reason to not support them, plus most of my friends are part of it",
                      "timestamp": "2022-05-14 16:59:26",
                      "score": 4,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "i8lfoua",
                      "text": "Yea, i see nothing wrong with any of it, aslong as they are respectful of others and are good people then i have no reason to not support them, plus most of my friends are part of it",
                      "timestamp": "2022-05-14 16:59:38",
                      "score": 4,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i8lmxeb",
                          "text": "Am i the only one that sees 2 of my reply",
                          "timestamp": "2022-05-14 17:54:33",
                          "score": 2,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i8lsv75",
                              "text": "No, I see it too. You can just delete one of them.",
                              "timestamp": "2022-05-14 18:39:45",
                              "score": 1,
                              "num_children": 1,
                              "author": 68428,
                              "replies": [
                                {
                                  "id": "i8lx1y0",
                                  "text": "Oh ok",
                                  "timestamp": "2022-05-14 19:12:04",
                                  "score": 1,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i8lgfs8",
          "text": "As a gay atheist, I'm fine with you, and appreciate the support.",
          "timestamp": "2022-05-14 17:05:16",
          "score": 4,
          "num_children": 0,
          "author": 405442,
          "replies": []
        }
      ]
    },
    {
      "id": "i8m1jfq",
      "text": "Jesus wore a skirt.\n\nThat has nothing to do with being gay...just mentioning it.  :)",
      "timestamp": "2022-05-14 19:47:13",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i8lmbmb",
      "text": "Can they do the opposite as well to falsify the exercise - write letters or whatever to convince x person from being heterosexual? (Short and long answer, cause Jeezis, is no.)",
      "timestamp": "2022-05-14 17:50:00",
      "score": 1,
      "num_children": 0,
      "author": 287765,
      "replies": []
    },
    {
      "id": "i8mlha2",
      "text": "1. Go to a Christian school\n\n2. Take a voluntary Christian class\n\n3. Be shocked at Christian content\n\n4. ???\n\n5. Profit",
      "timestamp": "2022-05-14 22:21:05",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i8m5v6h",
      "text": "The end goal of christian schools is to get kids who attend them to be Christian? I'm shock... Shocked!!! \n\n*Well not really...*\n\nIs this really a surprise to anyone? Christians who want their kids to be Christians, teach their kids Christian values and send them to Christian schools that reinforce those values.",
      "timestamp": "2022-05-14 20:20:27",
      "score": -7,
      "num_children": 1,
      "replies": [
        {
          "id": "i8nde5t",
          "text": "You can Christian and not be a fucking bigot",
          "timestamp": "2022-05-15 02:11:52",
          "score": 5,
          "num_children": 1,
          "author": 16946,
          "replies": [
            {
              "id": "i8ndkdp",
              "text": "Most Christian's oppose gay rights.",
              "timestamp": "2022-05-15 02:13:23",
              "score": 0,
              "num_children": 1,
              "replies": [
                {
                  "id": "i8nduli",
                  "text": "1. Christianity is complex, massive group of people support wide range of beliefs and ideas, so saying \"most\" I find pretty off the mark.\n\n2. Christians who do oppose LGBTQ rights not because of some fundamental belief in Bible, it's mainly due too a much later belief in keeping a strict hirechy system in place.",
                  "timestamp": "2022-05-15 02:15:54",
                  "score": 0,
                  "num_children": 1,
                  "author": 16946,
                  "replies": [
                    {
                      "id": "i8nhw5i",
                      "text": "1. Walk into a random Christian church and ask about their views on the gays. I'll bet you good money %75 will oppose gay rights.\n\n2. This point changes absolutely nothing about modern Christian values.",
                      "timestamp": "2022-05-15 02:51:59",
                      "score": 0,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i8ni8so",
                          "text": "Liek mate, I'm the last person who wants or will defend the Christian church ch but I think you are taking this blanket statement way too far",
                          "timestamp": "2022-05-15 02:55:12",
                          "score": 1,
                          "num_children": 1,
                          "author": 16946,
                          "replies": [
                            {
                              "id": "i8nj32j",
                              "text": "Walk into a random Christian church and ask about their views on the gays. I'll bet you good money %75 will oppose gay rights.",
                              "timestamp": "2022-05-15 03:02:59",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i8kw5ux",
      "text": "I truly hope someone that resisted the brainwashing had wrote \"No! Don't be gay! Bad! No! Just don't ok?\" I mean I would, not sure I could hold a straight face though.",
      "timestamp": "2022-05-14 14:30:28",
      "score": 1,
      "num_children": 0,
      "author": 388577,
      "replies": []
    },
    {
      "id": "i8l6hqb",
      "text": "Persuade? May as well try to seduce your \"friends\" or make them watch porn. Anyways, not something \"friends\" do. Friends accept their friends.",
      "timestamp": "2022-05-14 15:50:59",
      "score": 1,
      "num_children": 0,
      "author": 103425,
      "replies": []
    },
    {
      "id": "i8l8go1",
      "text": "[removed]",
      "timestamp": "2022-05-14 16:05:48",
      "score": 1,
      "num_children": 2,
      "replies": [
        {
          "id": "i8leklx",
          "text": "Why?",
          "timestamp": "2022-05-14 16:51:06",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i8lfabm",
          "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
          "timestamp": "2022-05-14 16:56:32",
          "score": 1,
          "num_children": 0,
          "author": 122319,
          "replies": []
        }
      ]
    },
    {
      "id": "i8ldqoc",
      "text": "Write letters back convincing them to not be straight",
      "timestamp": "2022-05-14 16:44:51",
      "score": 1,
      "num_children": 0,
      "author": 318836,
      "replies": []
    },
    {
      "id": "i8le58c",
      "text": "It’s the goal of the weak minded humans that can’t accept death. One way or another, they’re gonna keep their awful mentality here on earth. Or get some dumb thing named after them so they can be “immortal.” Fucking idiots.",
      "timestamp": "2022-05-14 16:47:55",
      "score": 1,
      "num_children": 0,
      "author": 377945,
      "replies": []
    },
    {
      "id": "i8lggge",
      "text": "You're all sick and diseased and depraved! Uh, change that to read WE'RE all sick.... Muhahahahhaha!",
      "timestamp": "2022-05-14 17:05:25",
      "score": 1,
      "num_children": 0,
      "author": 384038,
      "replies": []
    },
    {
      "id": "i8licl3",
      "text": "Dear Gay,\n\nJesus will love you more if you stop poking your pole into any ole hole!\n\nDon't stick in your tongue or have any fun and God will embrace you! \n\nOtherwise, burn in Hell for eternity.\n\nYour best friend, and concerned for your soul advocate, march_rogue. \n\nOw, why did you punch me? Hey, why won't you take my calls? /s",
      "timestamp": "2022-05-14 17:19:54",
      "score": 1,
      "num_children": 1,
      "author": 37348,
      "replies": [
        {
          "id": "i8limv6",
          "text": "In a more serious response, I can't imagine that it would any fun to receive a letter like that. It causes way more damage than it helps, and truly shows where the bigotry comes from (because we all know, it couldn't possibly be from an all loving, all knowing God.)",
          "timestamp": "2022-05-14 17:22:02",
          "score": 2,
          "num_children": 0,
          "author": 37348,
          "replies": []
        }
      ]
    },
    {
      "id": "i8lkenk",
      "text": "I saw the word Kentucky and instantly knew whatever I was about to read would be disgusting.",
      "timestamp": "2022-05-14 17:35:30",
      "score": 1,
      "num_children": 0,
      "author": 204904,
      "replies": []
    },
    {
      "id": "i8lkjqe",
      "text": "I'm Christian but I'd never put my kids in a Christian school. That's weird that such places even exist and I'm even more amazed that they would force teach our beliefs. It doesn't make any sense from an actual Christian perspective. Believing in Jesus is entirely by choice and no one is forced.",
      "timestamp": "2022-05-14 17:36:35",
      "score": 1,
      "num_children": 0,
      "author": 273767,
      "replies": []
    },
    {
      "id": "i8lklzt",
      "text": "This whole country is a shit hole",
      "timestamp": "2022-05-14 17:37:04",
      "score": 1,
      "num_children": 0,
      "author": 264598,
      "replies": []
    },
    {
      "id": "i8nzg85",
      "text": "This just like telling other people's kids about sex are both things that have no place in school just saying\nEdit~bad at word",
      "timestamp": "2022-05-15 05:55:54",
      "score": 1,
      "num_children": 0,
      "author": 234465,
      "replies": []
    },
    {
      "id": "i8qtcyp",
      "text": "If only the staff could be encouraged to renounce their faith. It's not like they weren't born with it.\n\nAnd hopefully at least some kids recognised it it for the BS it is and refused to participate.",
      "timestamp": "2022-05-15 21:40:44",
      "score": 1,
      "num_children": 0,
      "author": 407907,
      "replies": []
    },
    {
      "id": "i8qzvwr",
      "text": "As a gay man, I am not surprised at this.  I'm sure that there are religious schools all across this country that are doing things like this as well. They are brainwashing these kids to hate when they are supposed to be learning other things instead like math, reading, English, history and the list goes on. But instead, they are making the kids do stuff like this. It's sickening.",
      "timestamp": "2022-05-15 22:29:20",
      "score": 1,
      "num_children": 0,
      "author": 131983,
      "replies": []
    },
    {
      "id": "i8u4tp6",
      "text": "I'm just waiting for the obviously logical follow-up assignments: (1) How to talk to your friend from a rich family about not getting into heaven unless they give everything to the poor. (2) Boys who commit the sin of lust should be prepared to blind themselves, which is why we're removing the dress code. (3) Letting your fatty friend know you still pray for them in spite of their gluttony.",
      "timestamp": "2022-05-16 16:29:09",
      "score": 1,
      "num_children": 0,
      "author": 131484,
      "replies": []
    },
    {
      "id": "i8kv1hb",
      "text": "If this was Islam the assignment would be bring a weapon to class to deal with the gay student.",
      "timestamp": "2022-05-14 14:21:13",
      "score": -25,
      "num_children": 3,
      "author": 92858,
      "replies": [
        {
          "id": "i8lfhg3",
          "text": "American kids are far more likely to be bringing a weapon to school",
          "timestamp": "2022-05-14 16:58:02",
          "score": 15,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i8lk1yl",
          "text": "School shooters tend to be white",
          "timestamp": "2022-05-14 17:32:50",
          "score": 9,
          "num_children": 1,
          "replies": [
            {
              "id": "i8lkb8e",
              "text": "School shooters in the west, yes. In the Arab world gay people don't get off with just strongly worded letter. It's beheaded or burned alive.",
              "timestamp": "2022-05-14 17:34:47",
              "score": -1,
              "num_children": 1,
              "author": 92858,
              "replies": [
                {
                  "id": "i8q3rv8",
                  "text": "In a handful of countries, yea; but we're talking about mass shooters here.",
                  "timestamp": "2022-05-15 18:33:06",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i8lh23b",
          "text": "Because Christians haven't been the ones killing gay people in the US or other largely Christian countries?",
          "timestamp": "2022-05-14 17:10:01",
          "score": 7,
          "num_children": 0,
          "author": 405442,
          "replies": []
        }
      ]
    },
    {
      "id": "i8ke670",
      "text": "Honestly these posts annoy me it's such a strawman, Christians goals are not to be hateful like these posts assume, their goal is to worship their God the problem is their God is a hateful.\n\nStop demonizing people and assuming motives it's literally no better than what they do, and you'll never convince them otherwise by this method.",
      "timestamp": "2022-05-14 11:38:17",
      "score": -108,
      "num_children": 5,
      "author": 102579,
      "replies": [
        {
          "id": "i8kfegf",
          "text": "You don't have to know you're a bigot to be one.\n\nThese teachers want these kids to think like them. Therefore, by teaching these kids to write hateful letters they are being hateful. Their intent really doesn't matter.",
          "timestamp": "2022-05-14 11:52:40",
          "score": 46,
          "num_children": 2,
          "author": 316271,
          "replies": [
            {
              "id": "i8kxlo7",
              "text": "The truly insidious part of the assignment is that it teaches kids that the hate is love.",
              "timestamp": "2022-05-14 14:41:57",
              "score": 10,
              "num_children": 0,
              "author": 81881,
              "replies": []
            },
            {
              "id": "i8kfjqm",
              "text": "I agree i hate the indoctrination too but the problem is their beliefs in god that make them bigots not that they believe in god to cover their bigotry.",
              "timestamp": "2022-05-14 11:54:23",
              "score": -26,
              "num_children": 2,
              "author": 102579,
              "replies": [
                {
                  "id": "i8kfpbz",
                  "text": "That's fair, I'm just saying that the distinction between the two doesn't matter.",
                  "timestamp": "2022-05-14 11:56:12",
                  "score": 23,
                  "num_children": 1,
                  "author": 316271,
                  "replies": [
                    {
                      "id": "i8kgz9c",
                      "text": "That's true i care about how an action affects others more than the motive.  To change them though i think it's better to be more charitable to them they are humans just like us that have been indoctrinated just like those kids.  They genuinely believe that being gay will hurt that person to them it is out of love but they are wrong about that.  \n\nFor many if they can get rid of the religion the bigotry will go with it because for many that is the source not the cover.  It happened to me i was against homosexuality when i was a Christian because i had to be now I'm cool with it no more dogma telling me i had to believe it was wrong.",
                      "timestamp": "2022-05-14 12:10:31",
                      "score": -16,
                      "num_children": 1,
                      "author": 102579,
                      "replies": [
                        {
                          "id": "i8ksptd",
                          "text": "We've attempted to deal with Republicans that way for 30 years and where has it gotten us? Desperately trying to protect Roe v Wade. It doesn't work. Empathy is wonderful, but it's lost on zealots",
                          "timestamp": "2022-05-14 14:01:57",
                          "score": 9,
                          "num_children": 0,
                          "author": 224735,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i8kiq78",
                  "text": "Then explain why Christians are opposed to abortion, when the only time it’s mentioned in the bible is when their god gives instructions on how to perform one. \n\nI’m not suggesting your wrong, though. I think that maybe for a majority, what you say is true. But they are following the horrible cunts that use Christianity to further their political/ financial gains. I.E. republican politicians and megachurch pastors. Just my 2¢",
                  "timestamp": "2022-05-14 12:29:10",
                  "score": 14,
                  "num_children": 2,
                  "author": 364757,
                  "replies": [
                    {
                      "id": "i8lrno1",
                      "text": "So I remember watching a video of woman throwing her baby in the dumpster, and it made me rather upset. I found myself thinking, how could someone do that to a poor little baby and was so mad at this woman I didn’t even know anything about. It made me think about why this upsets me but abortion does not. \n\nhttps://youtu.be/8-2zLgpfrZc\n\nI think the reason most people are against abortion, including those who are Christian, has less to do with their religious text and how they view abortion. They feel the same way about abortion as I felt about women throwing their babies in the dumpster. To them it’s the same thing, so of course they feel very strongly about it. It doesn’t matter so much about extenuating circumstances, as it’s viewed generally as being wrong so it should be illegal in the same way. \n\nNow I don’t agree with them, but I can understand their position if this is indeed how they feel. I realize that my reaction to the dumpster baby video probably had more to do with my own fatherly instincts kicking in and projecting my emotions to protect my own children onto this baby.",
                      "timestamp": "2022-05-14 18:30:30",
                      "score": 1,
                      "num_children": 0,
                      "author": 381416,
                      "replies": []
                    },
                    {
                      "id": "i8kjkxl",
                      "text": "I dont have a good reason for why they are against abortion scriptures don't really hit it directly and when they do its not really against it persay. Mostly that it feels wrong to them, because of the created in gods image thing.  That is probably more of a peer pressure thing similar to antivax and q anon which is painfully common in religion.",
                      "timestamp": "2022-05-14 12:37:59",
                      "score": -2,
                      "num_children": 1,
                      "author": 102579,
                      "replies": [
                        {
                          "id": "i8m0xob",
                          "text": "Most of them feel that it's wrong because right wing propaganda has been screeching that at then for 30 years or more.  Abortion was never the massive wedge issue it is now before the religious right decided to make it one to control votes.",
                          "timestamp": "2022-05-14 19:42:29",
                          "score": 1,
                          "num_children": 0,
                          "author": 175727,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i8ks6t2",
          "text": "No one cares about their intentions or their goals. No one wants them to attempt to reform us. Everyone just needs to stay in their fucking lane. I don't believe the same bullshit fairy tales they do and it's bigotry when they criticize and scorn me for fixing the fact that God decided to assign me the wrong gender. Just let people be happy and worry about your own damnation. How hard is this?",
          "timestamp": "2022-05-14 13:57:34",
          "score": 9,
          "num_children": 0,
          "author": 224735,
          "replies": []
        },
        {
          "id": "i8kioaf",
          "text": "There are plenty of faiths, and Christian sects that do not oppose homosexuality. These people were taught hate, and perpetuate it by teaching hate, but it's the hate that is the problem, not faith.\n\nI'm an atheist because I'm a rational skeptic, and find no evidence to convince me of any supreme being. This does not mean that I need to demonize faith, or people that seem to need it.",
          "timestamp": "2022-05-14 12:28:36",
          "score": 13,
          "num_children": 2,
          "author": 396364,
          "replies": [
            {
              "id": "i8kudgs",
              "text": "That some religions and certain sects within religions don’t hate gay people doesn’t change the fact that religion is at the root of the problem. \n\nThat certain sects of Christianity don’t preach against gay people doesn’t change the fact the foundational book of Christianity, the Bible, calls gay people an abomination and calls for our murder. \n\nThat that book has been used to justify killing gay people.  And until very recently in the US (within my adult lifetime) to imprison people for being gay. \n\nThat this foundation of anti gay sentiment in the major religions of the world is directly the reason for oppression and discrimination and actual legal action against gays throughout the world. \n\nSo it’s very nice that some Episcopal churches don’t hate on gays, and some reformed Jewish groups, and a few fringe religions. \n\nGood for them they are better at cherry-picking than most of the other cherry-picking religionists. \n\nNone of that changes the fact the big C Christianity is anti gay and the cause of much of the anti gay rhetoric and action in the western world, and that the majority of world religion is anti gay and has been the enemy of gay people throughout modern history. \n\nTo quote Steven Weinberg: \n\n“Religion is an insult to human dignity. Without it you would have good people doing good things and evil people doing evil things.\nBut for good people to do evil things, that takes religion.”",
              "timestamp": "2022-05-14 14:15:47",
              "score": 10,
              "num_children": 1,
              "author": 208715,
              "replies": [
                {
                  "id": "i8kwoia",
                  "text": "Don't think I'm defending Christianity here, or organized religion in general. They most definitely codified and propagated homophobia, among other harmful byproducts of their control of their adherents and propagation methods.\n\nI just don't think it's the 'source'. It capitalizes on the human impulse to demonize those who are different.\n\nI do wish more people could see religion for what it is, and put it aside for a logical understanding of morality, and the importance of all human rights.",
                  "timestamp": "2022-05-14 14:34:37",
                  "score": 2,
                  "num_children": 1,
                  "author": 396364,
                  "replies": [
                    {
                      "id": "i8lnls1",
                      "text": "We will have to disagree. \n\nWhile there has been a lot of crap foisted on the concept of homosexuality over the ages, the vitriol and persecution of it pretty much started with monotheism. \n\nSure, there were certain social expectations around it in the ancient world but for the most part it was at least tolerated. In some instances sanctioned. \n\nKilling people for being gay pretty much started with the Abrahamic religions. In fact I believe that in the western world the first actual known law banning homosexuality was in 1290, and was deemed an offense against God.",
                      "timestamp": "2022-05-14 17:59:48",
                      "score": 2,
                      "num_children": 1,
                      "author": 208715,
                      "replies": [
                        {
                          "id": "i8lqiv3",
                          "text": "Hard to say since those religious are so old they cover so most of written history. A brief search on the subject turns up some variety depending on location and culture before the common era, but it's spotty at best. \n\nMany places had no law referencing it, there are records of both hetero and homosexual prostitution. Some places with no law still attached a social stigma to it.\n\nThere is a pre-Christian Asyrian law which considers such an act an offense against the state, and further stipulates that \"If he is formally convicted, [he is subjected] to a twofold penalty, namely to be treated in the same way as he has treated his victim and to be made a eunuch.\"^^1\n\n\nThe dominance of Christianity and Muslim faiths certainly meant that their persecution of homosexuality dominated human culture along with it.\n\n^^1 Assyrian Laws edited by Driver and Miles, 1935",
                          "timestamp": "2022-05-14 18:21:41",
                          "score": 1,
                          "num_children": 0,
                          "author": 396364,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i8kka3x",
              "text": "I don't find any evidence to convince of a god either im also a skeptic.  But for them they are not and there are direct scriptures that call it an abomination so it does not matter to me that some sects find homosexuality fine, Christianity as a whole is against it.  \n\nI still stick with faith is the problem that created the bigotry for many not all im sure some are genuine hateful people even without their faith.   I am an example of i was against it when i was religious and almost immediately leaving religion was ok with it, because that was the source of the bigotry not the cover for it.",
              "timestamp": "2022-05-14 12:45:04",
              "score": -3,
              "num_children": 1,
              "author": 102579,
              "replies": [
                {
                  "id": "i8kl2oi",
                  "text": "People that are genuinely self-reflective are better able to overcome their conditioning, whether it's religion, or bigotry. \n\nSadly, many people that find some of what they are looking for in things like the Bible, keep looking. They find other things they agree with, and have it's support, and reject the things they find that they don't agree with. This is why someone can quote Leviticus about homosexuality, and simply ignore Leviticus when it says the same thing about tattoos, or mixing two types of cloth.\n\nThe bible is a 1700 year old rorschach test.",
                  "timestamp": "2022-05-14 12:52:55",
                  "score": 10,
                  "num_children": 0,
                  "author": 396364,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i8lhfip",
          "text": "If you worship a hateful God and are hateful because of his hateful laws and act on that hate in these ways\n\nyou're a hateful bigot.\n\nYou're just getting to the same conclusion with a longer route. But if they do this, they are homophobic.",
          "timestamp": "2022-05-14 17:12:53",
          "score": 3,
          "num_children": 1,
          "author": 405442,
          "replies": [
            {
              "id": "i8lhs80",
              "text": "I aggree with all of what you said i just dont aggree that the religion is a cover for their inner bigotry, i think in many case its the opposite.  If they were not religious many of them would not be bigots and the religion is the source of the bigotry rather than the cover for it.\n\nEdit: you missed a great joke at the end by the way you should have said bigotry with extra steps!",
              "timestamp": "2022-05-14 17:15:36",
              "score": 0,
              "num_children": 0,
              "author": 102579,
              "replies": []
            }
          ]
        },
        {
          "id": "i8nf12l",
          "text": "Tell me what you think the definition of a strawman is",
          "timestamp": "2022-05-15 02:26:16",
          "score": 2,
          "num_children": 0,
          "author": 177147,
          "replies": []
        }
      ]
    },
    {
      "id": "i8l26bp",
      "text": "[removed]",
      "timestamp": "2022-05-14 15:18:11",
      "score": -12,
      "num_children": 2,
      "replies": [
        {
          "id": "i8l47r0",
          "text": "Less than a week old troll account. Nice. Hating someone for being a bigot is not the same as being a bigot. Try again later troll.",
          "timestamp": "2022-05-14 15:33:49",
          "score": 14,
          "num_children": 0,
          "author": 147861,
          "replies": []
        },
        {
          "id": "i8lbbb0",
          "text": "Hating someone who doesn't like gays is not the same as hating gays.",
          "timestamp": "2022-05-14 16:26:57",
          "score": 9,
          "num_children": 0,
          "author": 183913,
          "replies": []
        }
      ]
    },
    {
      "id": "i8kwqr6",
      "text": "Meanwhile another school is trying to actively trying to change a girl into a boy by cousin. Can you just leave this out of the schools and teach the basics!\n\nLet’s increase some scores",
      "timestamp": "2022-05-14 14:35:06",
      "score": -37,
      "num_children": 4,
      "author": 208716,
      "replies": [
        {
          "id": "i8kxbxp",
          "text": "That sounds like nonsense made up by parents who can’t imagine their kids being anything but straight or cis.",
          "timestamp": "2022-05-14 14:39:51",
          "score": 22,
          "num_children": 1,
          "author": 81881,
          "replies": [
            {
              "id": "i8kxrgo",
              "text": "https://i.redd.it/204tra5cafz81.jpg",
              "timestamp": "2022-05-14 14:43:14",
              "score": -28,
              "num_children": 2,
              "author": 208716,
              "replies": [
                {
                  "id": "i8ky2wn",
                  "text": "First, Daily Mail\n\nSecond, like I said, a parent who couldn’t imagine their kid was anything other than cis so they blame the teacher.",
                  "timestamp": "2022-05-14 14:45:49",
                  "score": 23,
                  "num_children": 0,
                  "author": 81881,
                  "replies": []
                },
                {
                  "id": "i8laviy",
                  "text": "Daily Fail, lol\n\nWhat's next, OAN and Alex Jones as sources?",
                  "timestamp": "2022-05-14 16:23:40",
                  "score": 17,
                  "num_children": 0,
                  "author": 329831,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i8l390d",
          "text": "This comment sounds like it was generated by an AI.",
          "timestamp": "2022-05-14 15:26:25",
          "score": 15,
          "num_children": 0,
          "author": 307865,
          "replies": []
        },
        {
          "id": "i8lk6e9",
          "text": "You can't turn gay kids straight. You also can't turn cis kids Trans, it doesn't work that way.",
          "timestamp": "2022-05-14 17:33:46",
          "score": 4,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i8lrfcx",
          "text": "Lemme get a source on that.",
          "timestamp": "2022-05-14 18:28:39",
          "score": 4,
          "num_children": 0,
          "author": 93963,
          "replies": []
        }
      ]
    },
    {
      "id": "i8l2s5u",
      "text": "It's a private company like Twitter.\n\nThey can do what they want",
      "timestamp": "2022-05-14 15:22:47",
      "score": -28,
      "num_children": 1,
      "replies": [
        {
          "id": "i8lara6",
          "text": "I believe you will find that no, that's not how rights work.",
          "timestamp": "2022-05-14 16:22:46",
          "score": 16,
          "num_children": 1,
          "author": 329831,
          "replies": [
            {
              "id": "i8lyzyi",
              "text": "What right? A right to do homework?\n\nA right to send your kid to any other private or public school.\n\nYou don't like it, go somewhere else like all the people banned from twitter :)",
              "timestamp": "2022-05-14 19:27:21",
              "score": -12,
              "num_children": 1,
              "replies": [
                {
                  "id": "i8n4a8z",
                  "text": "Who gives a shit about Twitter? Reread your own comment: \"They can do whatever they want.\"\n\nWe have laws. Nobody (unless maybe the stupidly rich) can do whatever they want.",
                  "timestamp": "2022-05-15 00:52:57",
                  "score": 4,
                  "num_children": 0,
                  "author": 329831,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i8lx4ia",
      "text": "I'm sorry but I'm pretty sure being gay isnt the person's choice but a result of innocence of the outer lying factors of what that person is going though. Sometimes the person needs help from the people around them. And I'm pretty sure they're doing the right thing bc even I had talked myself into doing something gay. So it's just not right to allow it to go under the radar when the person could definitely benefit from his class mates concern. So how dare you.",
      "timestamp": "2022-05-14 19:12:37",
      "score": -17,
      "num_children": 1,
      "author": 4061,
      "replies": [
        {
          "id": "i8m0cnf",
          "text": "Lol, that's also not how being gay works you dunce.",
          "timestamp": "2022-05-14 19:37:54",
          "score": 11,
          "num_children": 1,
          "author": 175727,
          "replies": [
            {
              "id": "i8mfvzr",
              "text": "Yeah but what I meant was that there's no one making him question his innocence bc of the human connection. Maybe he just don't know",
              "timestamp": "2022-05-14 21:37:33",
              "score": -9,
              "num_children": 0,
              "author": 4061,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i8lt9xz",
      "text": "[removed]",
      "timestamp": "2022-05-14 18:42:48",
      "score": -15,
      "num_children": 2,
      "replies": [
        {
          "id": "i8mtjkd",
          "text": "So is Gandalf",
          "timestamp": "2022-05-14 23:23:52",
          "score": 8,
          "num_children": 1,
          "author": 149247,
          "replies": [
            {
              "id": "i8of6my",
              "text": "Gandalf probably has a higher probability to turn out real than god.",
              "timestamp": "2022-05-15 09:34:10",
              "score": 1,
              "num_children": 0,
              "author": 318104,
              "replies": []
            }
          ]
        },
        {
          "id": "i8ovc36",
          "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\r\n\r\n--\r\n\r\n* This comment has been removed for [proselytizing](https://www.reddit.com/r/atheism/wiki/faq#wiki_what_is_.22proselytizing.3F.22).  This sub is not your personal mission field.  \r\n\r\nRemovals of this type may also include subreddit bans and/or suspensions from the whole site depending on the severity of the offense.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
          "timestamp": "2022-05-15 12:52:54",
          "score": 1,
          "num_children": 0,
          "author": 122319,
          "replies": []
        }
      ]
    },
    {
      "id": "i8le93c",
      "text": "[removed]",
      "timestamp": "2022-05-14 16:48:42",
      "score": -6,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i8l5zq5",
      "text": "[removed]",
      "timestamp": "2022-05-14 15:47:15",
      "score": -7,
      "num_children": 2,
      "replies": [
        {
          "id": "i8ldsuj",
          "text": "[deleted]",
          "timestamp": "2022-05-14 16:45:19",
          "score": 5,
          "num_children": 1,
          "replies": [
            {
              "id": "i8le1s1",
              "text": "[removed]",
              "timestamp": "2022-05-14 16:47:12",
              "score": -9,
              "num_children": 1,
              "replies": [
                {
                  "id": "i8lgx6u",
                  "text": "They can understand the basics. Like they know their mom and dad love each other. They're are capable of that. If their uncle loves another man, that's fairly simple for them to grasp. Will they have a deeper understanding of relationship? No. But no one is expecting them to.",
                  "timestamp": "2022-05-14 17:08:59",
                  "score": 4,
                  "num_children": 0,
                  "author": 405442,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i8leqkh",
          "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
          "timestamp": "2022-05-14 16:52:21",
          "score": 2,
          "num_children": 0,
          "author": 122319,
          "replies": []
        }
      ]
    },
    {
      "id": "i8lahu1",
      "text": "[removed]",
      "timestamp": "2022-05-14 16:20:50",
      "score": -6,
      "num_children": 2,
      "replies": [
        {
          "id": "i8ldkcl",
          "text": ">  And I believe that Homosexuality should be looked at similar to addiction or disease. It is an individuals decision.\n\nIf you chose to be straight, then maybe you're not actually straight lol. people typically don't choose their sexual orientation. it's not a decision to fall in love with someone, regardless of their sex. just like it's not a decision to be attracted to the same sex or the opposite sex. \n\nit has literally nothing in common with addiction and disease either. unless being straight is also a disease or addiction. animals all throughout the animal kingdom have been observed to exhibit homosexual behavior.\n\n>Homosexuality seems out of touch with reality, and not aligned with the natural order of things. The whole point of sex is reproduction. Last time I checked that requires a male and female. So it’s just as deranged to sleep with another man as it is an animal. It’s just self pleasure.\n\nwell then all sex for pleasure is deranged. if you enjoy it then you're deranged, right? regardless, your disagreement with something benign does not give you power to then prevent other people from doing it.",
          "timestamp": "2022-05-14 16:43:32",
          "score": 11,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i8lenlc",
          "text": "Homophobic garbage. Religious people go through such great lengths to explain why them hating an entire group of people who both can’t control who they are and don’t negatively impact their lives at all is justified.",
          "timestamp": "2022-05-14 16:51:43",
          "score": 6,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i8lf80i",
      "text": "[removed]",
      "timestamp": "2022-05-14 16:56:02",
      "score": -3,
      "num_children": 1,
      "replies": [
        {
          "id": "i8lh46s",
          "text": "yeah you will. At least you admit you’re a god damned bigot though so that will help us silence you.",
          "timestamp": "2022-05-14 17:10:27",
          "score": 3,
          "num_children": 0,
          "author": 412371,
          "replies": []
        }
      ]
    },
    {
      "id": "i8mbdbm",
      "text": "Seems like a sketchy source",
      "timestamp": "2022-05-14 21:02:54",
      "score": 0,
      "num_children": 0,
      "author": 78967,
      "replies": []
    },
    {
      "id": "i8n4ip9",
      "text": "You could hang that clickbait title on the wall with all that framing.",
      "timestamp": "2022-05-15 00:55:01",
      "score": 0,
      "num_children": 0,
      "author": 326300,
      "replies": []
    }
  ]
}