{
  "id": "uro5g2",
  "text": "TIFU by causing abrupt chaos on a Zoom meeting.\nBackground: I've been sick for a week or so with a wicked cough. I also have asthma, so it's rough. I'm going to the doctor later today, but in the meantime had to attend a Zoom meeting this morning.\n\nI was in this Zoom meeting with about 15 other people when I unmuted to ask a question. I leaned back in my chair to really give off the beard-stroking academic vibe, and I heard a crack as some piece in my old AF Ikea desk chair exploded and the chair back went all the way backwards. And so did I.\n\nBoth of my cats, situated nicely under the computer monitors on my desk, did what cats do when there's an unexpected noise and completely lost their noodles. In classic kitty form, they destroyed everything in their path, knocking my mug off the desk and onto the floor, shattering it.\n\nMeanwhile, I lay on the floor on my back having a huge coughing fit. I untangled myself from my chair and headphone wires and got up to go grab my inhaler. In the process, I stepped on some pieces from the shattered mug with my bare feet. I let out another round of cough-laden expletives as I walked away.\n\nA few minutes later, I had my shit sorted out and came back to my desk and keeping with the theme of pandemic-related TIFU posts, I realized I had been unmuted the whole time and with my video on. Apparently my colleagues had just spent that time conjecturing on whether I had left my earthly body behind or what.\n\nMinus 5 points professionalism for me, plus 10 points hilarity.\n\nTLDR - unmuted on Zoom, chaos ensued.\n\nedit: removed cat tax so my fuzzballs don't dox me",
  "timestamp": "2022-05-17 14:50:15",
  "score": 32322,
  "subreddit": "t5_2to41",
  "num_children": 256,
  "author": 192106,
  "replies": [
    {
      "id": "i8yep9k",
      "text": "Im sorry OP, but I hope your colleagues recorded that because i would watch it on repeat.",
      "timestamp": "2022-05-17 15:20:28",
      "score": 8414,
      "num_children": 5,
      "author": 130640,
      "replies": [
        {
          "id": "i8z3utm",
          "text": "Honestly this was the first question I asked when I got back haha",
          "timestamp": "2022-05-17 18:10:37",
          "score": 3168,
          "num_children": 8,
          "author": 192106,
          "replies": [
            {
              "id": "i8z6ani",
              "text": "What was the answer?",
              "timestamp": "2022-05-17 18:27:13",
              "score": 853,
              "num_children": 5,
              "replies": [
                {
                  "id": "i90ier7",
                  "text": "Ha, I had asked it in jest, we don't record our zoom meetings 😭😭",
                  "timestamp": "2022-05-18 00:17:36",
                  "score": 884,
                  "num_children": 3,
                  "author": 192106,
                  "replies": [
                    {
                      "id": "i90l997",
                      "text": ":(\n\nYou do now though, right?",
                      "timestamp": "2022-05-18 00:39:47",
                      "score": 260,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "i915ka6",
                      "text": "Email China MSS. They probably have a copy.",
                      "timestamp": "2022-05-18 03:22:54",
                      "score": 149,
                      "num_children": 2,
                      "author": 250209,
                      "replies": [
                        {
                          "id": "i91z4xo",
                          "text": "Happy cake day!",
                          "timestamp": "2022-05-18 09:39:29",
                          "score": 4,
                          "num_children": 0,
                          "author": 349668,
                          "replies": []
                        },
                        {
                          "id": "i91i8y1",
                          "text": "Right, China... Didn't even take 10 years and Reddit is back in denial",
                          "timestamp": "2022-05-18 05:35:02",
                          "score": -27,
                          "num_children": 3,
                          "author": 253469,
                          "replies": [
                            {
                              "id": "i91zstx",
                              "text": "?",
                              "timestamp": "2022-05-18 09:49:19",
                              "score": 9,
                              "num_children": 1,
                              "author": 206461,
                              "replies": [
                                {
                                  "id": "i929sae",
                                  "text": "NSA?",
                                  "timestamp": "2022-05-18 11:52:48",
                                  "score": -1,
                                  "num_children": 1,
                                  "author": 253469,
                                  "replies": [
                                    {
                                      "id": "i92yp96",
                                      "text": "The NSA doesn’t like to share.",
                                      "timestamp": "2022-05-18 15:12:34",
                                      "score": 2,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "i93m2es",
                                          "text": "Five Eyes says otherwise",
                                          "timestamp": "2022-05-18 17:50:04",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 253469,
                                          "replies": [
                                            {
                                              "id": "i9427kx",
                                              "text": "Who?",
                                              "timestamp": "2022-05-18 19:39:29",
                                              "score": 1,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "i945ady",
                                                  "text": "No, not WHO, FVEY",
                                                  "timestamp": "2022-05-18 20:00:13",
                                                  "score": 0,
                                                  "num_children": 0,
                                                  "author": 253469,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "i929wdp",
                              "text": "My dude, Ukranian drone fighters were getting bombed because they were using [drones](https://youtu.be/b166ecyNBCw?t=117) designed, coded, and made in China, and China was accessing and transmitting the data to Russia. (See DJI)\n\n~~American soldiers doxxed their own bases by using certain fitness apps and tiktok, which (surprise surprise) were made in China.~~ (edit: came to my attention that I didn't check my sources thoroughly and relied on cognitive bias; it was an american company)\n\nEdit: drone fighters meaning the operators were getting bombed because by using the drones, they were revealing their GPS coordinates to China",
                              "timestamp": "2022-05-18 11:53:58",
                              "score": 5,
                              "num_children": 2,
                              "author": 372074,
                              "replies": [
                                {
                                  "id": "i92cwgr",
                                  "text": "„My dude“ \n\nThe fitness trackers that leaked the us bases are made by an American company. The same company released the heatmap.  \n\nI don’t know about the Chinese transmitting data to Russia. You got a source for that? They clearly stated they won’t interfere in the war.\n\nEdit: thank you for the correction and for adding sources.",
                                  "timestamp": "2022-05-18 12:23:16",
                                  "score": 4,
                                  "num_children": 2,
                                  "author": 391786,
                                  "replies": [
                                    {
                                      "id": "i92z085",
                                      "text": "They’re helping Russia less than we’re helping Ukraine, which is better than I expected, so…",
                                      "timestamp": "2022-05-18 15:14:43",
                                      "score": 1,
                                      "num_children": 0,
                                      "replies": []
                                    },
                                    {
                                      "id": "i93tmxe",
                                      "text": "Iirc the Chinese drone company that relayed GPS locations is DJI. Not sourcing as I'm on my phone.\nAs far as I know, whatever Chinese consumer grade stuff they have, such as DJI, is now running a custom ROM or is not used, but I don't fully recall the details.",
                                      "timestamp": "2022-05-18 18:41:06",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 230615,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "i92cexn",
                                  "text": "And Russians get their positions exposed by US intelligence. You have processed that we are talking about war here, huh?\n\nDid you really forget that the US is spying on the entiere Western World, including US citizens?",
                                  "timestamp": "2022-05-18 12:18:44",
                                  "score": -3,
                                  "num_children": 1,
                                  "author": 253469,
                                  "replies": [
                                    {
                                      "id": "i92ddzq",
                                      "text": "You're missing the point. The topic was talking about China. I fully acknowledge that the US (and pretty much every government) spies on everyone. You're just using whataboutism.\n\nI'll summararize the conversation so far:\n\nusernamesarefortools: China spies on people.  \nOnion-mush: Nahhh...  \npassed_tense: Yeah... (lists evidence).  \nOnion-mush: Ok, but EVERYBODY does it and it's war, so it's ok and y'all are wrong",
                                      "timestamp": "2022-05-18 12:27:47",
                                      "score": 3,
                                      "num_children": 2,
                                      "author": 372074,
                                      "replies": [
                                        {
                                          "id": "i93jp6x",
                                          "text": ">The topic was talking about China. \n\nThe topic is Zoom Meetings. That's a US company. OP just randomly switched the topic to China, with no apparent reason.\n\nThat person literally did what you are accusing me of, which is what I complained about. So close, yet so far\n\nOn top of that, you refuted both of your own claims. Bravo!",
                                          "timestamp": "2022-05-18 17:34:17",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 253469,
                                          "replies": [
                                            {
                                              "id": "i94wxxi",
                                              "text": "Oh seems I was misinformed about zoom’s origins so my bad on that. Though being Chinese myself (abc) I have a good reason to be highly distrustful of the CCP",
                                              "timestamp": "2022-05-18 23:18:42",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 372074,
                                              "replies": []
                                            }
                                          ]
                                        },
                                        {
                                          "id": "i93515l",
                                          "text": "I mean tbf it's more likely the NSA has zoom recordings than China does though. We aren't talking about a warzone here....not like it was tiktok or WeChat.",
                                          "timestamp": "2022-05-18 15:55:43",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 372250,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "i93t1kq",
                              "text": "Zoom's three subcontracted companies that make up their developer force (at least 2 years ago) are Chinese, so it's not a weird suggestion.",
                              "timestamp": "2022-05-18 18:36:58",
                              "score": 1,
                              "num_children": 1,
                              "author": 230615,
                              "replies": [
                                {
                                  "id": "i93tcil",
                                  "text": "https://explore.zoom.us/en/subprocessors/\n\nOP just jumped on a opportunity to meme about Chinese surveillance and failed miserably at it",
                                  "timestamp": "2022-05-18 18:39:05",
                                  "score": 1,
                                  "num_children": 2,
                                  "author": 253469,
                                  "replies": [
                                    {
                                      "id": "i93v93g",
                                      "text": "Yeah, dunno about what OP was referring to. Let me look into my old 'all the stuff wrong with Zoom's security' list, a source for the dev companies thing should be in there.\n\n[This](https://www.axios.com/2020/06/16/zoom-us-china) was listed as source, but that's a giant list about their Chinese ties. It links to their SEC filing in regards to their 700 Chinese R&D department. I see it's easily searchable, they were not subcontracted:\n\nhttps://www.google.com/search?hl=en&q=zoom%20700%20developers%20china",
                                      "timestamp": "2022-05-18 18:52:08",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 230615,
                                      "replies": [
                                        {
                                          "id": "i9460c7",
                                          "text": "Yeah, non of this implies that Zoom is spying on US users, on the CCP's demand",
                                          "timestamp": "2022-05-18 20:05:05",
                                          "score": 0,
                                          "num_children": 1,
                                          "author": 253469,
                                          "replies": [
                                            {
                                              "id": "i95lp3y",
                                              "text": "Every company in China is an extension of the government and a company of Zoom's size has at least one dedicated officer. The whole point is that their entire R&D has been based in China. If you think that's all peachy, then never mind.\n\nThe situation has been improved with Zoom implementing actual E2EE, rather than them calling regular encryption E2EE like they still did in 2020.",
                                              "timestamp": "2022-05-19 02:32:51",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 230615,
                                              "replies": [
                                                {
                                                  "id": "i96cu3b",
                                                  "text": "To get the basic facts straight: Zoom's R&D was never and isn't entirely or even majoritively based in China. \n\nTo address you talking out of your ass: I have worked for 2 inzernational AAA companies in China, a automotive company and a Software company.\n\nThe state is primarely in keeping Chinese employees in check, meaning that they don't get easy access to ourside media and making sure that users within China don't use the software to communicate without surveillance, online.\n\nAlthough I fundementally disagree with those practices, there isn't much evidence that the glaring security flaws of Zoom existed on behalf of the chinese gov or in order to mass surveil people from other countries. In fact, \n\nLast but not least, it's laughable how you try to derail the topic. It's almost as if you don't care about the suvrillance, but like OP, about being able to shine q bad light on a single potential actor.",
                                                  "timestamp": "2022-05-19 07:25:25",
                                                  "score": 2,
                                                  "num_children": 1,
                                                  "author": 253469,
                                                  "replies": [
                                                    {
                                                      "id": "i96onkm",
                                                      "text": "When nearly the entirety of their developer force is located in China, the onus is on them to provide a secure product that is not pwnable out of the gate. I don't care that you seem to have a similar level of trust towards the Chinese government as to other governments, or point at the NSA, they're not trustworthy. Zoom used to be as secure as Swiss cheese with its developer base being based in China. Not a good combination at all.\n\nI don't know what you think I derailed, we're still talking about Zoom and China. Zoom has pushed many fixes including structural changes internally. Despite some data having been routed through China, it seems not to have happened again after they were blasted for it. And having the option to use E2EE means that, provided you trust Zoom and their E2EE, at least the call will be secure.\n\nI just provided relevant info to the topic of China and Zoom. I'm not here to change your mind. Enjoy China, I don't care.",
                                                      "timestamp": "2022-05-19 10:21:35",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 230615,
                                                      "replies": [
                                                        {
                                                          "id": "i96ylod",
                                                          "text": ">When nearly the entirety of their developer force is located in China\n\nIt's just not.\n\n>I don't know what you think I derailed\n\nThat's what it's called, when you pile up irrelevant claims, without backing up the core statement you made. You even acknowledge that \n\n>Despite some data having been routed through China, it seems not to have happened again after they were blasted for it.\n\nbye kiddo",
                                                          "timestamp": "2022-05-19 12:13:24",
                                                          "score": 0,
                                                          "num_children": 0,
                                                          "author": 253469,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "i976vvf",
                                      "text": "Geez guys, he’s very sick! And just went through some bad stuff. ☹️",
                                      "timestamp": "2022-05-19 13:25:44",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 187384,
                                      "replies": [
                                        {
                                          "id": "i97i1p8",
                                          "text": "? lol",
                                          "timestamp": "2022-05-19 14:48:30",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 253469,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i91wfel",
                      "text": "Well, I’m sure it’s burned into their memories.",
                      "timestamp": "2022-05-18 08:57:42",
                      "score": 2,
                      "num_children": 0,
                      "author": 393298,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i8z9lbv",
                  "text": "Hang tight. OP just leaned back again....",
                  "timestamp": "2022-05-17 18:49:37",
                  "score": 579,
                  "num_children": 1,
                  "author": 324054,
                  "replies": [
                    {
                      "id": "i90iaub",
                      "text": "Do we think he left his earthly body?",
                      "timestamp": "2022-05-18 00:16:44",
                      "score": 92,
                      "num_children": 1,
                      "author": 107830,
                      "replies": [
                        {
                          "id": "i918ltw",
                          "text": "Not permanently. OP had since posted.\n\nOr was it the cats? Hmmmm",
                          "timestamp": "2022-05-18 03:50:54",
                          "score": 23,
                          "num_children": 0,
                          "author": 324054,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i8z6x18",
                  "text": "Inquiring minds *need* to know OP",
                  "timestamp": "2022-05-17 18:31:27",
                  "score": 307,
                  "num_children": 1,
                  "author": 331105,
                  "replies": [
                    {
                      "id": "i8zgngf",
                      "text": "Omg it happened again",
                      "timestamp": "2022-05-17 19:37:44",
                      "score": 257,
                      "num_children": 2,
                      "author": 165095,
                      "replies": [
                        {
                          "id": "i9022cn",
                          "text": "Kind of sounds like OP is going to have to do a reenactment to get it on video.\n\nApologies in advance to both his cats and his body, but it must be done. I don't make the rules.",
                          "timestamp": "2022-05-17 22:08:38",
                          "score": 107,
                          "num_children": 1,
                          "author": 76385,
                          "replies": [
                            {
                              "id": "i905wki",
                              "text": "And less blurry cat tax. RRS doesn't accept blurry info.",
                              "timestamp": "2022-05-17 22:37:52",
                              "score": 20,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "i8zn5pg",
                          "text": "Yip... Join the club",
                          "timestamp": "2022-05-17 20:22:35",
                          "score": 16,
                          "num_children": 0,
                          "author": 276877,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i8zmdwj",
                  "text": "\"The recording has been forwarded to the OHS committee. Expect a call.\"",
                  "timestamp": "2022-05-17 20:17:15",
                  "score": 47,
                  "num_children": 1,
                  "author": 186555,
                  "replies": [
                    {
                      "id": "i8znr70",
                      "text": "Can we see recording please?",
                      "timestamp": "2022-05-17 20:26:44",
                      "score": 9,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i904nak",
                  "text": "At least we know they aren’t a cat.",
                  "timestamp": "2022-05-17 22:28:19",
                  "score": 13,
                  "num_children": 0,
                  "author": 157873,
                  "replies": []
                }
              ]
            },
            {
              "id": "i8zp6hp",
              "text": "Please, for the good of humanity, post the video if it exists",
              "timestamp": "2022-05-17 20:36:43",
              "score": 38,
              "num_children": 0,
              "author": 34004,
              "replies": []
            },
            {
              "id": "i8zybmd",
              "text": "If they did, can I have a copy? I have to give a safety presentation to a bunch of desk jockeys next week, and this is something relevant to their interests!",
              "timestamp": "2022-05-17 21:41:04",
              "score": 23,
              "num_children": 0,
              "author": 258497,
              "replies": []
            },
            {
              "id": "i8z6z08",
              "text": "...and then?",
              "timestamp": "2022-05-17 18:31:49",
              "score": 24,
              "num_children": 1,
              "author": 179077,
              "replies": [
                {
                  "id": "i8zxw9t",
                  "text": "And no and then!",
                  "timestamp": "2022-05-17 21:37:58",
                  "score": 19,
                  "num_children": 1,
                  "author": 185950,
                  "replies": [
                    {
                      "id": "i917j5g",
                      "text": "Andthenandthenandthenandthenandthen!",
                      "timestamp": "2022-05-18 03:40:51",
                      "score": 6,
                      "num_children": 0,
                      "author": 173896,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i8zgejg",
              "text": "Office Christmas party highlight WFH highlight reel",
              "timestamp": "2022-05-17 19:36:03",
              "score": 42,
              "num_children": 0,
              "author": 12834,
              "replies": []
            },
            {
              "id": "i8zu8j4",
              "text": "What is the model/name of keyboard that is in your \"cat tax\" picture?",
              "timestamp": "2022-05-17 21:11:57",
              "score": 8,
              "num_children": 2,
              "author": 115846,
              "replies": [
                {
                  "id": "i90074y",
                  "text": "Looks like a Corsair K70 RGB",
                  "timestamp": "2022-05-17 21:54:47",
                  "score": 6,
                  "num_children": 1,
                  "author": 168939,
                  "replies": [
                    {
                      "id": "i903fsa",
                      "text": "Which is a great keyboard, by the way. I’ve had the cherry brown version for a few years.",
                      "timestamp": "2022-05-17 22:19:00",
                      "score": 1,
                      "num_children": 1,
                      "author": 265730,
                      "replies": [
                        {
                          "id": "i904sd1",
                          "text": "Same, I have 3 of varying ages, oldest is 7 years old, all in active use",
                          "timestamp": "2022-05-17 22:29:23",
                          "score": 1,
                          "num_children": 0,
                          "author": 168939,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i9042d4",
                  "text": "Corsair K70 mk2. I think its the low profile version, but hard to tell from that angle.",
                  "timestamp": "2022-05-17 22:23:48",
                  "score": 1,
                  "num_children": 0,
                  "author": 211245,
                  "replies": []
                }
              ]
            },
            {
              "id": "i91eech",
              "text": "You have me dying laughing at this",
              "timestamp": "2022-05-18 04:50:07",
              "score": 1,
              "num_children": 0,
              "author": 192600,
              "replies": []
            },
            {
              "id": "i976c0n",
              "text": "You told your story so well I could very vividly picture cats adding to the chaos, plus my husband works from home and has a beard. Which means I’ve seen that very scholarly action many times. After I stop laughing I think I’m going to go get him a new chair. \n\nOh and please feel better! I actually hated laughing at you bc bad cough+asthma sucks!\n\nEdit I understand your risk but I need that cat tax!",
              "timestamp": "2022-05-19 13:21:21",
              "score": 1,
              "num_children": 0,
              "author": 187384,
              "replies": []
            }
          ]
        },
        {
          "id": "i8ynux6",
          "text": "and slo mo.  Did the camera capture his face when he realized the chair was tipping over...",
          "timestamp": "2022-05-17 16:23:34",
          "score": 858,
          "num_children": 4,
          "author": 271905,
          "replies": [
            {
              "id": "i8ywe8i",
              "text": "[removed]",
              "timestamp": "2022-05-17 17:20:43",
              "score": 121,
              "num_children": 2,
              "replies": [
                {
                  "id": "i8z1hx7",
                  "text": "I came here for this",
                  "timestamp": "2022-05-17 17:54:36",
                  "score": 33,
                  "num_children": 1,
                  "author": 257236,
                  "replies": [
                    {
                      "id": "i8zj2w9",
                      "text": "So did Toobin",
                      "timestamp": "2022-05-17 19:54:24",
                      "score": 20,
                      "num_children": 1,
                      "author": 307818,
                      "replies": [
                        {
                          "id": "i8zjhlv",
                          "text": "Staaaahp Jesus Christ I just had surgery and it hurts to laugh and I can’t stop now",
                          "timestamp": "2022-05-17 19:57:15",
                          "score": 21,
                          "num_children": 2,
                          "author": 176969,
                          "replies": [
                            {
                              "id": "i90a7os",
                              "text": "Recovering from Covid and SAME",
                              "timestamp": "2022-05-17 23:11:34",
                              "score": 5,
                              "num_children": 0,
                              "author": 402457,
                              "replies": []
                            },
                            {
                              "id": "i90ri5t",
                              "text": "I'd better not reddit after my upcoming surgery then",
                              "timestamp": "2022-05-18 01:28:48",
                              "score": 2,
                              "num_children": 0,
                              "author": 335,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i8zrbdr",
                  "text": "CEO. Enterpreneur...",
                  "timestamp": "2022-05-17 20:51:27",
                  "score": 2,
                  "num_children": 1,
                  "author": 286942,
                  "replies": [
                    {
                      "id": "i8zrmsg",
                      "text": "Born in 1964...",
                      "timestamp": "2022-05-17 20:53:39",
                      "score": 2,
                      "num_children": 0,
                      "author": 353906,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i8zkm74",
              "text": "Like [this](https://youtu.be/cnQEo4bazIo?t=65)?",
              "timestamp": "2022-05-17 20:05:00",
              "score": 21,
              "num_children": 3,
              "author": 90065,
              "replies": [
                {
                  "id": "i8zqksk",
                  "text": "Ahh I love Die Hard. Alan Rickman was a treasure and he played an absolutely awesome villain.",
                  "timestamp": "2022-05-17 20:46:22",
                  "score": 24,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "i8zohyo",
                  "text": "or [this](https://youtu.be/SZvzaA0RvwE)",
                  "timestamp": "2022-05-17 20:31:57",
                  "score": 15,
                  "num_children": 0,
                  "author": 271905,
                  "replies": []
                },
                {
                  "id": "ia2g53u",
                  "text": "I half expected to be rick rolled",
                  "timestamp": "2022-05-26 14:16:00",
                  "score": 1,
                  "num_children": 0,
                  "author": 182992,
                  "replies": []
                }
              ]
            },
            {
              "id": "i8zn8yb",
              "text": "Him?  For some reason I was assuming OP was a chick.\n\nEdit: found a comment stating op was a \"rare girl\" so I'm going with my initial read of the post unless op corrects me.",
              "timestamp": "2022-05-17 20:23:14",
              "score": 23,
              "num_children": 1,
              "author": 250998,
              "replies": [
                {
                  "id": "i8zqwui",
                  "text": "the beard part threw me.",
                  "timestamp": "2022-05-17 20:48:40",
                  "score": 39,
                  "num_children": 1,
                  "author": 271905,
                  "replies": [
                    {
                      "id": "i901km3",
                      "text": "Holy shit. Yeah, I apparently read right off the beard stroking part.",
                      "timestamp": "2022-05-17 22:05:00",
                      "score": 8,
                      "num_children": 1,
                      "author": 250998,
                      "replies": [
                        {
                          "id": "i905pzw",
                          "text": "I still assumed woman but with a super raspy voice from being sick. Sounding like an flannel wearing, big tree chopping, axe swinging loggers, before them fancy machine were made to take der jobs\n\nEdit: i just remember that a girls mom said that sick voices were \"sexy voices\"... I believe her mom gave me a unintended thing for raspy voices.",
                          "timestamp": "2022-05-17 22:36:25",
                          "score": 11,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i906ag5",
                              "text": "Yeah, I tried to cheat and check their comment and post history but that didn't help either. No posts that declare one way or the other so it could go any number of ways.\n\nEdit: nvm, found one that says \"rare girl\" so I think you're right.",
                              "timestamp": "2022-05-17 22:40:48",
                              "score": 8,
                              "num_children": 1,
                              "author": 250998,
                              "replies": [
                                {
                                  "id": "i977anh",
                                  "text": "“Wait! Sandy is a GIRL?????????”",
                                  "timestamp": "2022-05-19 13:28:59",
                                  "score": 3,
                                  "num_children": 1,
                                  "author": 187384,
                                  "replies": [
                                    {
                                      "id": "i978hrb",
                                      "text": "?? Sorry if this is a whoosh moment for me but where are you seeing Sandy? That definitely would have been a no brainer at that point lol",
                                      "timestamp": "2022-05-19 13:38:29",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 250998,
                                      "replies": [
                                        {
                                          "id": "i97asmz",
                                          "text": "Sorry! Random SpongeBob joke.",
                                          "timestamp": "2022-05-19 13:55:59",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 187384,
                                          "replies": [
                                            {
                                              "id": "i97cbmk",
                                              "text": "Oh lol. Yeah I can see that now. Apparently I need more coffee this morning. I can totally hear SpongeBob saying that now and can picture the scene in my head lol.",
                                              "timestamp": "2022-05-19 14:07:20",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 250998,
                                              "replies": [
                                                {
                                                  "id": "i97dpd8",
                                                  "text": "Ok. You seriously need to rewatch some SpongeBob…Patrick is the one that says it! Lol\n\nhttps://youtu.be/A8yRflpbIcs\n\nI’m allowed to link to YouTube, right?",
                                                  "timestamp": "2022-05-19 14:17:28",
                                                  "score": 2,
                                                  "num_children": 1,
                                                  "author": 187384,
                                                  "replies": [
                                                    {
                                                      "id": "i97fcah",
                                                      "text": "Wait, what?  Yeah, that's the scene I was thinking of but for some reason I was thinking SpongeBob said it after going \"Whaaaaattttt?\" I will agree I need to go back through and rewatch some of it.",
                                                      "timestamp": "2022-05-19 14:29:15",
                                                      "score": 2,
                                                      "num_children": 0,
                                                      "author": 250998,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i8zy42g",
              "text": "\"Back and to the left\"\n\n\"Back and to the left\"\n\nOver and over.",
              "timestamp": "2022-05-17 21:39:33",
              "score": 1,
              "num_children": 0,
              "author": 331122,
              "replies": []
            }
          ]
        },
        {
          "id": "i90vzfq",
          "text": "Genie I want to change my last wish to this",
          "timestamp": "2022-05-18 02:03:56",
          "score": 2,
          "num_children": 0,
          "author": 278405,
          "replies": []
        },
        {
          "id": "i9150xv",
          "text": "Hopefully it'll be on the frontpage of Reddit tomorrow",
          "timestamp": "2022-05-18 03:18:15",
          "score": 2,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i917bxb",
          "text": "Colleague: CLIP IT!",
          "timestamp": "2022-05-18 03:39:00",
          "score": 2,
          "num_children": 0,
          "author": 102098,
          "replies": []
        }
      ]
    },
    {
      "id": "i8yiem2",
      "text": "Man I haven't actually laughed out loud at a TIFU in a long time, thank you OP",
      "timestamp": "2022-05-17 15:46:02",
      "score": 5000,
      "num_children": 20,
      "author": 156586,
      "replies": [
        {
          "id": "i9040f6",
          "text": "I barely rarely even click on posts from this sub anymore because it's all \"TIFU when I had sex while I had sex having sex and sex sex\".\n\nThis one was legit funny and might restore my faith in this sub.",
          "timestamp": "2022-05-17 22:23:23",
          "score": 612,
          "num_children": 6,
          "author": 159047,
          "replies": [
            {
              "id": "i90cnnq",
              "text": "And that's from the least horny redditors",
              "timestamp": "2022-05-17 23:30:59",
              "score": 86,
              "num_children": 0,
              "author": 292683,
              "replies": []
            },
            {
              "id": "i90i7tv",
              "text": "It's to the point now where mods need to ban sex related stuff entirely.",
              "timestamp": "2022-05-18 00:16:02",
              "score": 67,
              "num_children": 2,
              "author": 168207,
              "replies": [
                {
                  "id": "i90s4xo",
                  "text": "Or at the very least make a separate community for that.",
                  "timestamp": "2022-05-18 01:33:42",
                  "score": 34,
                  "num_children": 1,
                  "author": 82638,
                  "replies": [
                    {
                      "id": "i90sjid",
                      "text": "Today I Fucked r/TIF",
                      "timestamp": "2022-05-18 01:36:52",
                      "score": 64,
                      "num_children": 2,
                      "author": 23821,
                      "replies": [
                        {
                          "id": "i90v5m2",
                          "text": "I can't see what's there.",
                          "timestamp": "2022-05-18 01:57:21",
                          "score": 5,
                          "num_children": 1,
                          "author": 82638,
                          "replies": [
                            {
                              "id": "i90zpbi",
                              "text": "Nothing, I just made it up. When you put r/ before some text it shows up like a link to a sub.",
                              "timestamp": "2022-05-18 02:33:34",
                              "score": 7,
                              "num_children": 0,
                              "author": 23821,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "i945jxo",
                          "text": "That would be perfect. And yes, were looking at you, r/TIFU mods.",
                          "timestamp": "2022-05-18 20:01:59",
                          "score": 2,
                          "num_children": 0,
                          "author": 168207,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i916bpu",
                  "text": "Rule 5. But they disregard it constantly.",
                  "timestamp": "2022-05-18 03:29:41",
                  "score": 2,
                  "num_children": 0,
                  "author": 292544,
                  "replies": []
                }
              ]
            },
            {
              "id": "i90guj2",
              "text": "I love your description of this sub.",
              "timestamp": "2022-05-18 00:04:55",
              "score": 9,
              "num_children": 0,
              "author": 22719,
              "replies": []
            },
            {
              "id": "i90r7oh",
              "text": "They need to start a sub for all the sex stories called r/TIF. \n\nEdit: it's actually banned",
              "timestamp": "2022-05-18 01:26:32",
              "score": 2,
              "num_children": 0,
              "author": 335,
              "replies": []
            },
            {
              "id": "i914uf5",
              "text": "This just made me lose it all over again. I couldn’t make it through the OP without stopping to snort-laugh several times. Your comment is hilarious because it’s true. 😅",
              "timestamp": "2022-05-18 03:16:43",
              "score": 1,
              "num_children": 0,
              "author": 245106,
              "replies": []
            },
            {
              "id": "i92left",
              "text": "💯",
              "timestamp": "2022-05-18 13:35:31",
              "score": 1,
              "num_children": 0,
              "author": 41448,
              "replies": []
            }
          ]
        },
        {
          "id": "i8zceb8",
          "text": "I read it out loud to my daughter while laughing the whole time and I'm crying.  This is one of the funniest things I've ever read.",
          "timestamp": "2022-05-17 19:08:43",
          "score": 1023,
          "num_children": 2,
          "author": 82131,
          "replies": [
            {
              "id": "i903dsn",
              "text": "i can only imagine how chaotic the room would've looked and sounded like during this ordeal",
              "timestamp": "2022-05-17 22:18:36",
              "score": 282,
              "num_children": 0,
              "author": 302333,
              "replies": []
            },
            {
              "id": "i90af3c",
              "text": "I am laughing like the dude from that meme telling a story while in hysterics",
              "timestamp": "2022-05-17 23:13:13",
              "score": 65,
              "num_children": 0,
              "author": 80895,
              "replies": []
            }
          ]
        },
        {
          "id": "i900erg",
          "text": "I'm about to read this to my husband.... He is a stoic ass mf-er. I'll try to convey his response.",
          "timestamp": "2022-05-17 21:56:22",
          "score": 53,
          "num_children": 2,
          "author": 78122,
          "replies": [
            {
              "id": "i902u3v",
              "text": "What was his reaction?",
              "timestamp": "2022-05-17 22:14:26",
              "score": 24,
              "num_children": 1,
              "author": 277768,
              "replies": [
                {
                  "id": "i90grp7",
                  "text": "😐",
                  "timestamp": "2022-05-18 00:04:19",
                  "score": 32,
                  "num_children": 1,
                  "author": 351270,
                  "replies": [
                    {
                      "id": "i90swkh",
                      "text": "Stoic. Once again his response is highly with held...",
                      "timestamp": "2022-05-18 01:39:46",
                      "score": 23,
                      "num_children": 0,
                      "author": 78122,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i977lqg",
              "text": "Mine is a stoic ass mf-er too! Unless he’s showing me something that he thinks is funny. Which it’s usually not.",
              "timestamp": "2022-05-19 13:31:24",
              "score": 2,
              "num_children": 1,
              "author": 187384,
              "replies": [
                {
                  "id": "i97m2bn",
                  "text": "What is up stoic ass mf-ers? I have one too. I can basically be hyperventilating with laughter, actual tears rolling, and he's just sitting there with barely a smile. I find myself saying things like BUT DONT YOU THINK THIS IS FUCKING HILARIOUS? more than any reasonable person should.",
                  "timestamp": "2022-05-19 15:16:27",
                  "score": 2,
                  "num_children": 0,
                  "author": 35954,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i8zih1z",
          "text": "Me too!! Hahahahahaha",
          "timestamp": "2022-05-17 19:50:15",
          "score": 42,
          "num_children": 0,
          "author": 373450,
          "replies": []
        },
        {
          "id": "i8zkpsx",
          "text": "Lmao needed this so bad",
          "timestamp": "2022-05-17 20:05:42",
          "score": 32,
          "num_children": 0,
          "author": 43347,
          "replies": []
        },
        {
          "id": "i9007jk",
          "text": "I’m chuckling to myself while lying on my bed after having read this",
          "timestamp": "2022-05-17 21:54:52",
          "score": 25,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i90g0qs",
          "text": "Same 😂 omg. If someone was recording the zoom call PLEASE edit for faces and post it.",
          "timestamp": "2022-05-17 23:58:14",
          "score": 19,
          "num_children": 0,
          "author": 201432,
          "replies": []
        },
        {
          "id": "i8zzgax",
          "text": "Same!!! Hilarious! Glad you’re okay, OP!",
          "timestamp": "2022-05-17 21:49:16",
          "score": 16,
          "num_children": 0,
          "author": 224892,
          "replies": []
        },
        {
          "id": "i90e4p8",
          "text": "The placement of those cats just makes its so much better lol",
          "timestamp": "2022-05-17 23:42:50",
          "score": 11,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i90hb9u",
          "text": "I’m sitting in the bathroom at work laughing so hard trying to keep quiet",
          "timestamp": "2022-05-18 00:08:42",
          "score": 8,
          "num_children": 0,
          "author": 298730,
          "replies": []
        },
        {
          "id": "i90fdxy",
          "text": "Tried reading that to my wife... It couldn't get past a sentence without losing my own shit",
          "timestamp": "2022-05-17 23:53:03",
          "score": 8,
          "num_children": 0,
          "author": 3732,
          "replies": []
        },
        {
          "id": "i90rpky",
          "text": "Right I’m literally cackling. ☠️",
          "timestamp": "2022-05-18 01:30:22",
          "score": 2,
          "num_children": 0,
          "author": 264682,
          "replies": []
        },
        {
          "id": "i91qcft",
          "text": "\"Lost their noodles\" has now entered my lexicon. Legendary guffaws.",
          "timestamp": "2022-05-18 07:23:45",
          "score": 2,
          "num_children": 0,
          "author": 262532,
          "replies": []
        },
        {
          "id": "i9025qi",
          "text": "???",
          "timestamp": "2022-05-17 22:09:21",
          "score": 1,
          "num_children": 0,
          "author": 220352,
          "replies": []
        },
        {
          "id": "i90334q",
          "text": "I laughed so hard at this post that the zoom meeting I was unmuted in thought I passed away",
          "timestamp": "2022-05-17 22:16:20",
          "score": 1,
          "num_children": 0,
          "author": 9956,
          "replies": []
        },
        {
          "id": "i9075h3",
          "text": "Agreed. Thanks OP!",
          "timestamp": "2022-05-17 22:47:31",
          "score": 1,
          "num_children": 0,
          "author": 408938,
          "replies": []
        },
        {
          "id": "i90rhjh",
          "text": "Omg same! Real laughter!",
          "timestamp": "2022-05-18 01:28:39",
          "score": 1,
          "num_children": 0,
          "author": 15416,
          "replies": []
        },
        {
          "id": "i90sfnx",
          "text": "Same",
          "timestamp": "2022-05-18 01:36:01",
          "score": 1,
          "num_children": 0,
          "author": 388456,
          "replies": []
        },
        {
          "id": "i91eadi",
          "text": "Waiting for my mandated 15 minute post-vaccine shot safety window and laughed so hard everyone in the waiting room looked alarmed. Thank you 😊 this made my day.",
          "timestamp": "2022-05-18 04:48:55",
          "score": 1,
          "num_children": 0,
          "author": 44090,
          "replies": []
        },
        {
          "id": "i91unan",
          "text": "my stomach is hurting cause im laughing so hard at this LOL i have the mental image playing in my brain lol",
          "timestamp": "2022-05-18 08:29:17",
          "score": 1,
          "num_children": 0,
          "author": 217951,
          "replies": []
        }
      ]
    },
    {
      "id": "i8yti75",
      "text": "\"I leaned back in my chair to really give off the beard-stroking academic vibe...\"\n\nWhen flexing via Zoom goes wrong.",
      "timestamp": "2022-05-17 17:01:14",
      "score": 4783,
      "num_children": 5,
      "author": 352466,
      "replies": [
        {
          "id": "i8zjux4",
          "text": "But his chair kept it realer...",
          "timestamp": "2022-05-17 19:59:48",
          "score": 661,
          "num_children": 2,
          "author": 380697,
          "replies": [
            {
              "id": "i906f93",
              "text": "\"What OP didn't know is that the Ikea Chair was a black belt in falling apart at the perfect moment and making the Hall of Fame of \"Keeping it Real\"\"",
              "timestamp": "2022-05-17 22:41:50",
              "score": 109,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i8zrf9w",
              "text": "r/whenkeepingitrealgoeswrong",
              "timestamp": "2022-05-17 20:52:13",
              "score": 138,
              "num_children": 2,
              "author": 227354,
              "replies": [
                {
                  "id": "i8zs8wi",
                  "text": "r/nametoolong",
                  "timestamp": "2022-05-17 20:57:55",
                  "score": 56,
                  "num_children": 6,
                  "replies": [
                    {
                      "id": "i8zsxfk",
                      "text": "I am never not astonished at the fact that there’s literally a sub for everything here.",
                      "timestamp": "2022-05-17 21:02:40",
                      "score": 50,
                      "num_children": 2,
                      "author": 392571,
                      "replies": [
                        {
                          "id": "i8ztd4j",
                          "text": "r/everything",
                          "timestamp": "2022-05-17 21:05:40",
                          "score": 23,
                          "num_children": 0,
                          "author": 285058,
                          "replies": []
                        },
                        {
                          "id": "i9060gu",
                          "text": "But have you seen r/methsex\n\nThank God that's not real but there's r/meth",
                          "timestamp": "2022-05-17 22:38:43",
                          "score": 9,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i91owkq",
                              "text": "There was definitely a subreddit for heroin addicts to hook up on. I can't remember exactly, but it was baaad",
                              "timestamp": "2022-05-18 07:02:49",
                              "score": 6,
                              "num_children": 1,
                              "author": 267040,
                              "replies": [
                                {
                                  "id": "i91p6mm",
                                  "text": "I can only imagine how bad it and the sub that thankfully doesn't exist could be. I feel like a lot of drug stealing would be happening though.",
                                  "timestamp": "2022-05-18 07:06:44",
                                  "score": 2,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "i91vela",
                                      "text": "Yeah half the posts were just \"THIS USER JACKED MY GEAR AFTER WE FUCKED\" :l",
                                      "timestamp": "2022-05-18 08:41:17",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 267040,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i900x3u",
                      "text": "r/Twentycharacterlimit",
                      "timestamp": "2022-05-17 22:00:08",
                      "score": 2,
                      "num_children": 0,
                      "author": 153432,
                      "replies": []
                    },
                    {
                      "id": "i901d0x",
                      "text": "r/21charactersandnomore",
                      "timestamp": "2022-05-17 22:03:26",
                      "score": 2,
                      "num_children": 0,
                      "author": 80539,
                      "replies": []
                    },
                    {
                      "id": "i90dpc0",
                      "text": "r/keepinitrealgoeswrong",
                      "timestamp": "2022-05-17 23:39:28",
                      "score": 2,
                      "num_children": 0,
                      "author": 84947,
                      "replies": []
                    },
                    {
                      "id": "i8zyl7i",
                      "text": "r/21charactersorless",
                      "timestamp": "2022-05-17 21:43:00",
                      "score": 2,
                      "num_children": 0,
                      "author": 268669,
                      "replies": []
                    },
                    {
                      "id": "i8zvdy3",
                      "text": "Keptrealgw",
                      "timestamp": "2022-05-17 21:20:05",
                      "score": 1,
                      "num_children": 0,
                      "author": 38352,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i90dgrb",
                  "text": "r/keepinitrealgoeswrong",
                  "timestamp": "2022-05-17 23:37:29",
                  "score": 1,
                  "num_children": 0,
                  "author": 84947,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i8zrf53",
          "text": "When keeping it real goes wrong",
          "timestamp": "2022-05-17 20:52:12",
          "score": 24,
          "num_children": 0,
          "author": 111468,
          "replies": []
        },
        {
          "id": "i90gadm",
          "text": "At least OP wasn't masturbating.",
          "timestamp": "2022-05-18 00:00:29",
          "score": 2,
          "num_children": 0,
          "author": 346763,
          "replies": []
        },
        {
          "id": "i8zrnch",
          "text": "Keeping it real went wrong.",
          "timestamp": "2022-05-17 20:53:46",
          "score": 2,
          "num_children": 0,
          "author": 223598,
          "replies": []
        },
        {
          "id": "i8zyfop",
          "text": "/r/instantkarma",
          "timestamp": "2022-05-17 21:41:53",
          "score": -2,
          "num_children": 0,
          "author": 249038,
          "replies": []
        }
      ]
    },
    {
      "id": "i8z7hhk",
      "text": "A TIFU that is not a horny weirdo story is so refreshing.",
      "timestamp": "2022-05-17 18:35:16",
      "score": 280,
      "num_children": 0,
      "author": 392685,
      "replies": []
    },
    {
      "id": "i8z0exo",
      "text": "This shit sounds like it would have been absolute gold to witness and I am now sadder for having missed it. I hope your job records their zoom meetings because my lord",
      "timestamp": "2022-05-17 17:47:22",
      "score": 645,
      "num_children": 2,
      "author": 370820,
      "replies": [
        {
          "id": "i8zu14q",
          "text": "If they do, OP has to post it!",
          "timestamp": "2022-05-17 21:10:28",
          "score": 69,
          "num_children": 0,
          "author": 334410,
          "replies": []
        },
        {
          "id": "i91me5s",
          "text": "is that you Colin Robinson",
          "timestamp": "2022-05-18 06:28:12",
          "score": 2,
          "num_children": 0,
          "author": 73265,
          "replies": []
        }
      ]
    },
    {
      "id": "i8yglog",
      "text": "Hahahaha! This is one of the better TIFU’s I’ve read in a while. Hopefully you’re ok. And maybe it’s time to invest in a proper work chair and let the IKEA chairs handle the more casual seating arrangements?",
      "timestamp": "2022-05-17 15:33:39",
      "score": 1158,
      "num_children": 3,
      "author": 187950,
      "replies": [
        {
          "id": "i8z26f2",
          "text": "Just bought one from staples this morning!",
          "timestamp": "2022-05-17 17:59:10",
          "score": 522,
          "num_children": 5,
          "author": 192106,
          "replies": [
            {
              "id": "i8z7ad1",
              "text": "Ugh you might end up with another TIFU.  I am sitting on my uncomfortable staples chair and thinking of switching to my IKEA chair.",
              "timestamp": "2022-05-17 18:33:58",
              "score": 278,
              "num_children": 2,
              "author": 278089,
              "replies": [
                {
                  "id": "i909sg6",
                  "text": "staples sells much better chairs than ikea when I've gone in there. it sounds like you done fucked up by cheaping out",
                  "timestamp": "2022-05-17 23:08:14",
                  "score": 30,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i90a77v",
                      "text": "It was more expensive than the ikea chair 🤷🏿‍♂️",
                      "timestamp": "2022-05-17 23:11:28",
                      "score": 24,
                      "num_children": 0,
                      "author": 278089,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i913crb",
                  "text": "Idk I love my staples chair. Was only like $175 too.",
                  "timestamp": "2022-05-18 03:03:51",
                  "score": 2,
                  "num_children": 0,
                  "author": 144920,
                  "replies": []
                }
              ]
            },
            {
              "id": "i8z750n",
              "text": "I hope it was this chair. It's awesome that I bought two (one for me and my son)\n\nhttps://www.staples.com/staples-dexley-mesh-task-chair-black-56946/product_24398921?icid=WFATOP10:CHAIRS:2439821::::",
              "timestamp": "2022-05-17 18:32:59",
              "score": 159,
              "num_children": 9,
              "author": 179077,
              "replies": [
                {
                  "id": "i8zcuii",
                  "text": "No way man are you for real that is exactly the one I got!",
                  "timestamp": "2022-05-17 19:11:50",
                  "score": 191,
                  "num_children": 6,
                  "author": 192106,
                  "replies": [
                    {
                      "id": "i8zcz6b",
                      "text": "I’m super cereal! Great choice! You’re gonna love it",
                      "timestamp": "2022-05-17 19:12:43",
                      "score": 85,
                      "num_children": 2,
                      "author": 179077,
                      "replies": [
                        {
                          "id": "i8zm3ya",
                          "text": "Turns out this was all an elaborate ruse to promote a Staples desk chair",
                          "timestamp": "2022-05-17 20:15:18",
                          "score": 159,
                          "num_children": 3,
                          "author": 307770,
                          "replies": [
                            {
                              "id": "i8zrqkr",
                              "text": "And big cereal",
                              "timestamp": "2022-05-17 20:54:23",
                              "score": 38,
                              "num_children": 0,
                              "author": 297486,
                              "replies": []
                            },
                            {
                              "id": "i8zm6nt",
                              "text": "Lol I wish",
                              "timestamp": "2022-05-17 20:15:51",
                              "score": 14,
                              "num_children": 0,
                              "author": 179077,
                              "replies": []
                            },
                            {
                              "id": "i8zxdjs",
                              "text": "Their username does have the word ‘guerilla’ in it.",
                              "timestamp": "2022-05-17 21:34:15",
                              "score": 8,
                              "num_children": 0,
                              "author": 327887,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "i90eak0",
                          "text": "I just got one too and I like it but i feel like the bottom mesh needs to be secured better.  I'm only 175 but after 3 weeks I bottom it out sometimes.",
                          "timestamp": "2022-05-17 23:44:09",
                          "score": 5,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i91rfxs",
                              "text": ">I'm only 175 \n\nI found the reason you find this chair insufficient. Hate to break it to you bro, but you are a ghost.",
                              "timestamp": "2022-05-18 07:40:05",
                              "score": 0,
                              "num_children": 0,
                              "author": 53775,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i8zyc11",
                      "text": "That's a good chair. When you set it up search in YouTube for videos that tell you how you should sit ergonomically so you take full advantage of the chair.\n\nAlso, if you have your monitors at a low level you will tend to lean forwards to see the screen (not using the headrest or keeping a good posture), which can lead to neck pain in the long term. You can solve this with a dual hydraulic monitor arm (like this one https://m.media-amazon.com/images/I/71oPdIcALXL._AC_SL1500_.jpg ). With this you can set your monitors at the level of your eyes while leaning back on the chair, so you keep a better posture while working. This arms also free a lot of space on your desk, which is a nice extra plus.",
                      "timestamp": "2022-05-17 21:41:08",
                      "score": 23,
                      "num_children": 1,
                      "author": 85378,
                      "replies": [
                        {
                          "id": "i900vbb",
                          "text": "I think I subconsciously realized/experienced this issue as I've been working off a damn laptop for two years (and I never propped it up on anything, even a stack of books or anything smart like that), my new iMac should be here in two weeks and I'm so looking forward to it upending many of my bad work habits",
                          "timestamp": "2022-05-17 21:59:47",
                          "score": 9,
                          "num_children": 0,
                          "author": 185215,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i900d1l",
                      "text": "Yo that makes 3 of us, I got a red one on sale about 5 weeks ago when my last one shit the bed\n\n5 weeks in and it's nothing but the best chair I've ever had at my personal desk",
                      "timestamp": "2022-05-17 21:56:00",
                      "score": 1,
                      "num_children": 0,
                      "author": 143778,
                      "replies": []
                    },
                    {
                      "id": "i9020wc",
                      "text": "Oh hey, my boyfriend has that chair!",
                      "timestamp": "2022-05-17 22:08:20",
                      "score": 1,
                      "num_children": 0,
                      "author": 292095,
                      "replies": []
                    },
                    {
                      "id": "i90cuzn",
                      "text": "Bought one November of ‘20, wished I had months before. It’s a pretty good chair.",
                      "timestamp": "2022-05-17 23:32:38",
                      "score": 1,
                      "num_children": 0,
                      "author": 237705,
                      "replies": []
                    },
                    {
                      "id": "i90uv3h",
                      "text": "I too also have that chair and I really love it! Sturdy and super comfy. Watch out for the wheels though because they're toe killers.",
                      "timestamp": "2022-05-18 01:55:01",
                      "score": 1,
                      "num_children": 1,
                      "author": 289099,
                      "replies": [
                        {
                          "id": "i91syhm",
                          "text": "You can solve this by spending $20 on rollerblade wheels.",
                          "timestamp": "2022-05-18 08:03:00",
                          "score": 2,
                          "num_children": 1,
                          "author": 222255,
                          "replies": [
                            {
                              "id": "i91tozz",
                              "text": "Good to know! I'll look into that. Thanks!",
                              "timestamp": "2022-05-18 08:14:24",
                              "score": 1,
                              "num_children": 0,
                              "author": 289099,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i8zfke5",
                  "text": "I'm in the market and struggling to find something good.  This is so much less expensive than what I've been looking at..I have questions, if you don't mind.\n\nIs it creaking/noisy?  How long have you had it? How heavy are you? How many hours a day do you sit in it?",
                  "timestamp": "2022-05-17 19:30:20",
                  "score": 28,
                  "num_children": 4,
                  "author": 393473,
                  "replies": [
                    {
                      "id": "i8zg7h3",
                      "text": "No creaking or noise\n\nThe first one I have (8 years old) and the second one I’ve had for about 3 years\n\n200lbs and 6-8 hours a day. No swamp ass or pain/fatigue",
                      "timestamp": "2022-05-17 19:34:42",
                      "score": 22,
                      "num_children": 0,
                      "author": 179077,
                      "replies": []
                    },
                    {
                      "id": "i8zyt3i",
                      "text": "A few months ago I bought a La-Z-Boy office chair from Costco. It’s amazing and super padded. I sit AAAALLLLLLL day with some breaks. I mean like 7:00am-11:00pm with various breaks in there. \n\nI love that it’s wide enough for me to sit cross legged and the arms fold up, too. It feels like luxurious leather and has arch support & adjustable height. There is a paddle to lock the chair straight up or allow it to recline. \n\nIf I can sit cross legged, this seat is big enough for a much beefier person. Lol. I highly recommend it and it’s totally worth it if you sit all day like me.\n\nMy previous chair also broke to hilarious effect when I leaned back wit it.",
                      "timestamp": "2022-05-17 21:44:36",
                      "score": 9,
                      "num_children": 0,
                      "author": 294236,
                      "replies": []
                    },
                    {
                      "id": "i8zuduh",
                      "text": "It will get noisy after some use. I have 2 of these chairs at home and they were quiet when brand new, but now will randomly squeak or make a pop sound when leaning. Not often. I've had 1 of these chairs for at least 5 years and the other for about 2 years. 160 lbs. 5-12 hours a day, every week for at least the last 2 years, maybe 3 hours a day before that.",
                      "timestamp": "2022-05-17 21:13:01",
                      "score": 8,
                      "num_children": 2,
                      "author": 135097,
                      "replies": [
                        {
                          "id": "i90k27b",
                          "text": "Mine developed a creak when leaning after a few weeks, but I WD-40'd the part where the main column meets the leg base and the seat base, and it's been silent ever since.",
                          "timestamp": "2022-05-18 00:30:17",
                          "score": 6,
                          "num_children": 0,
                          "author": 139760,
                          "replies": []
                        },
                        {
                          "id": "i90efjh",
                          "text": "Did you feel like the bottom mesh stayed taught?  I'm only 175 but after 3 weeks I'm bottoming out on it.",
                          "timestamp": "2022-05-17 23:45:15",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i90exmw",
                              "text": "Mine are both pretty taut still. No noticeable bottoming out unless I slam myself into the chair.\n\nI will say though that one of the arm rests has developed a crack from where I push down on it when adjusting how I sit. That's on the older seat.",
                              "timestamp": "2022-05-17 23:49:21",
                              "score": 2,
                              "num_children": 1,
                              "author": 135097,
                              "replies": [
                                {
                                  "id": "i90k532",
                                  "text": "Hmmmm ok.  Might warranty this one.  Thanks.",
                                  "timestamp": "2022-05-18 00:30:56",
                                  "score": 1,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i9061ax",
                      "text": "Don't feel as if you need to be stingy with your chairs. Anything that separates you from the ground should have ample consideration.",
                      "timestamp": "2022-05-17 22:38:53",
                      "score": 2,
                      "num_children": 1,
                      "author": 352355,
                      "replies": [
                        {
                          "id": "i93i14x",
                          "text": "I'm semi ready to drop about a grand on a chair.  Like I said, this one mentioned is much less expensive and I have my doubts LOL",
                          "timestamp": "2022-05-18 17:23:01",
                          "score": 1,
                          "num_children": 1,
                          "author": 393473,
                          "replies": [
                            {
                              "id": "i93km9y",
                              "text": "I dropped 600 for my steelseries chair. Totally worth it. I'm sure I could have found a chair that I'd be comfortable in for cheaper, but I'd have preferred to try chairs out before purchasing and I liked the feel of the steelseries one. I'm planning on babying the chair and trying to keep it for 10+ years. I'm looking at it as an investment into my butt and back at this point. Hope you find something that you like mate.",
                              "timestamp": "2022-05-18 17:40:31",
                              "score": 1,
                              "num_children": 0,
                              "author": 352355,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i8zl5t3",
                  "text": "Fair warning, if you're anything north of 160lbs, the back will sit at 120 degrees when locked after 8 months. 140 degrees unlocked. I do not recommend this chair to anyone that's bigger",
                  "timestamp": "2022-05-17 20:08:47",
                  "score": 9,
                  "num_children": 0,
                  "author": 33734,
                  "replies": []
                },
                {
                  "id": "i8zlaoe",
                  "text": "hahah thats funny you posted this one! i was going to get one of these because i used one for a while at my old job, awesome chairs! these mesh type ones always feel the best leaning way back\n\ni went with one of those racing gaming chairs instead tho, an akracing master something. big wide flat seat because i sit criss cross apple sauce or on my legs a lot and this chair big and flat enough for me to do so comfortably! way way more expensive tho, only got it because of my weird sitting habits",
                  "timestamp": "2022-05-17 20:09:43",
                  "score": 5,
                  "num_children": 0,
                  "author": 383155,
                  "replies": []
                },
                {
                  "id": "i8zxl06",
                  "text": "I have a very similar one from staples! It doesn't have the head rest (spouse attached one for me from Amazon). It has held up really well over the years. It is a favorite spot for our cats, too. They sharpen their claws on it pretty regularly & there is no visible damage.",
                  "timestamp": "2022-05-17 21:35:43",
                  "score": 2,
                  "num_children": 0,
                  "author": 322008,
                  "replies": []
                },
                {
                  "id": "i905t20",
                  "text": "I just bought that one for work too!!! Most comfortable and supportive chair I have ever owned",
                  "timestamp": "2022-05-17 22:37:06",
                  "score": 2,
                  "num_children": 0,
                  "author": 61105,
                  "replies": []
                },
                {
                  "id": "i90jdf1",
                  "text": "I'm glad you shared that. I'm currently using a lawn chair which is more comfortable than my first chair. I have been trying to figure out what to buy.",
                  "timestamp": "2022-05-18 00:24:58",
                  "score": 2,
                  "num_children": 0,
                  "author": 46110,
                  "replies": []
                },
                {
                  "id": "i916bk6",
                  "text": "Poor man’s Herman Miller Aeron. If you can’t/don’t want to afford a used Aeron, this is a good option.",
                  "timestamp": "2022-05-18 03:29:39",
                  "score": 2,
                  "num_children": 1,
                  "author": 295317,
                  "replies": [
                    {
                      "id": "i916i7c",
                      "text": "Basically this\n\nStill better than those ugly bright ass gaming chairs",
                      "timestamp": "2022-05-18 03:31:20",
                      "score": 1,
                      "num_children": 0,
                      "author": 179077,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i90ci4p",
                  "text": "That looks exactly like my chair…",
                  "timestamp": "2022-05-17 23:29:44",
                  "score": 1,
                  "num_children": 0,
                  "author": 11751,
                  "replies": []
                }
              ]
            },
            {
              "id": "i8zwtxr",
              "text": "Careful...don't fall in love with the chair model. She died in a tragic car accident.",
              "timestamp": "2022-05-17 21:30:17",
              "score": 5,
              "num_children": 0,
              "author": 174068,
              "replies": []
            },
            {
              "id": "i911hch",
              "text": "Lmao as a person that does have Staples in my country I just fast read this as \"I bought some staples\" and tought you were gonna try to fix the chair with staples.",
              "timestamp": "2022-05-18 02:48:04",
              "score": 2,
              "num_children": 0,
              "author": 152941,
              "replies": []
            },
            {
              "id": "i8zyk7j",
              "text": "Oh fuck cancel that order and go to somewhere less crappy. I used Global Office for my husbands chair. https://www.globalindustrial.com/c/office/seating/task_desk_chairs_1/task_desk_chairs",
              "timestamp": "2022-05-17 21:42:48",
              "score": -1,
              "num_children": 0,
              "author": 374071,
              "replies": []
            }
          ]
        },
        {
          "id": "i90hpor",
          "text": "It's IKEA Markus or 1k fancy ergo chair for me. And I can't afford the fancy chair.",
          "timestamp": "2022-05-18 00:11:57",
          "score": 1,
          "num_children": 1,
          "author": 308864,
          "replies": [
            {
              "id": "i919wne",
              "text": "Honestly, Markus is a bloody good chair. I replace him every 5 year or so, but for a medium price range, it is hard to find something better.",
              "timestamp": "2022-05-18 04:03:32",
              "score": 2,
              "num_children": 0,
              "author": 197508,
              "replies": []
            }
          ]
        },
        {
          "id": "i90n2vb",
          "text": "Ikeas jarvfjallet is an office chair I can’t recommend enough.",
          "timestamp": "2022-05-18 00:54:05",
          "score": 1,
          "num_children": 0,
          "author": 269615,
          "replies": []
        }
      ]
    },
    {
      "id": "i8z27z7",
      "text": "I saw a hilarious clip about zoom calls gone wrong. 2 business men were having a zoom call and the 1 it started with was the subordinate and trying to be very serious. His 2 kids ran in, around 2-4 years old and he jumped up to usher them out and was in his boxers! He came back and saw himself in his underwear on the screen and was embarrassed and kept apologizing. \"I'm so sorry, that was unprofessional of me. It won't happen again.\" The older man, his superior, said \"that's alright\" and stood up showing his boxers too. It was so funny! \nPS. The kids were adorable and that was cute too.",
      "timestamp": "2022-05-17 17:59:28",
      "score": 331,
      "num_children": 3,
      "author": 202052,
      "replies": [
        {
          "id": "i8zm507",
          "text": "[deleted]",
          "timestamp": "2022-05-17 20:15:31",
          "score": 179,
          "num_children": 1,
          "replies": [
            {
              "id": "i8ztn2d",
              "text": "This one put me and my coworkers, who are lawyers, into complete hysterics. I've never seen my law colleagues laugh at anything before and they just totally lost it at this video. Great stuff.",
              "timestamp": "2022-05-17 21:07:39",
              "score": 97,
              "num_children": 0,
              "author": 126181,
              "replies": []
            }
          ]
        },
        {
          "id": "i91ggew",
          "text": "I had a lead once who not only had several kids himself, but would trade off with his brothers family every other day for who watches all their kids. So hed have like 6 kids running around half the time.\n\nWe were having a serious one on one, and he's literally just got kids swarming all over him and he's doing his best to ignore them. One kid is just polishing his bald spot with a cloth, another is putting Elton Jon sunglasses on him, one kid is giving another kid the peoples elbow off the dresser behind him. It's just chaos and he sits there's like it isn't even happening",
          "timestamp": "2022-05-18 05:13:38",
          "score": 16,
          "num_children": 1,
          "author": 384400,
          "replies": [
            {
              "id": "i91vmdy",
              "text": "I upvote you. That's hilarious to picture. He must have the patience of Job. I never wanted kids and at 42 don't have any.",
              "timestamp": "2022-05-18 08:44:44",
              "score": 3,
              "num_children": 0,
              "author": 202052,
              "replies": []
            }
          ]
        },
        {
          "id": "i92u6h3",
          "text": "Much milder, but my old boss and I would both usually have a cat (me) or small dog (him) in our lap during calls.  If things got boring we'd play tail chicken and let a little cat/dog tail flick up until someone else noticed and one of us \"lost\".",
          "timestamp": "2022-05-18 14:41:05",
          "score": 1,
          "num_children": 0,
          "author": 156557,
          "replies": []
        }
      ]
    },
    {
      "id": "i8yg8ym",
      "text": "I can't stop laughing. Best TIFU I've seen in a while",
      "timestamp": "2022-05-17 15:31:11",
      "score": 662,
      "num_children": 2,
      "author": 342309,
      "replies": [
        {
          "id": "i8zbb52",
          "text": "Literally. I’m in the middle of math class and snorting",
          "timestamp": "2022-05-17 19:01:21",
          "score": 88,
          "num_children": 1,
          "author": 319604,
          "replies": [
            {
              "id": "i8zccg0",
              "text": "I just re-read it and started giggling again 😂🤣",
              "timestamp": "2022-05-17 19:08:22",
              "score": 33,
              "num_children": 0,
              "author": 342309,
              "replies": []
            }
          ]
        },
        {
          "id": "i916i08",
          "text": "I’ve had a difficult week so far and this made me laugh till I cried. I can relate to this so much and It honestly turned my mood around. I’m still laughing just replaying it In my head 😂",
          "timestamp": "2022-05-18 03:31:17",
          "score": 2,
          "num_children": 0,
          "author": 215501,
          "replies": []
        }
      ]
    },
    {
      "id": "i8zrn06",
      "text": "Trust me dude. You didn't fuck up. You just gave your entire team and anyone else on that meeting a welcome change of pace after being stuck in zoom hell for the last 2 years.\n\nThey'll forgive every single f-bomb you dropped as they basically got to witness an unplanned cacaphony of comedy as nature swiped your legs out from underneath you and then just when you thought you had your act together, back came Sergeant Dokes \"Surprise Motherfucker!“\n\nAnd best of all? Two cats absolutely lost their shit and added to the absolute chaos. This story will be told for the rest of their lives and you have now become legend.\n\nThis is like taking down prod on your first job. Wear it with a badge of honor, just don't gloat about it.",
      "timestamp": "2022-05-17 20:53:42",
      "score": 90,
      "num_children": 1,
      "author": 363775,
      "replies": [
        {
          "id": "i90982x",
          "text": "Sergeant Dokes is a name I haven’t heard in a long, long time…",
          "timestamp": "2022-05-17 23:03:46",
          "score": 10,
          "num_children": 0,
          "author": 172222,
          "replies": []
        }
      ]
    },
    {
      "id": "i8yvmy9",
      "text": "Similar thing (but not as dramatic) happened to a friend during a d&d session and caught on video. I may have edited a special clip celebrating the event complete with slow mo.",
      "timestamp": "2022-05-17 17:15:40",
      "score": 76,
      "num_children": 1,
      "author": 238977,
      "replies": [
        {
          "id": "i8zt3xr",
          "text": "Vid or it didn’t happen lol",
          "timestamp": "2022-05-17 21:03:54",
          "score": 20,
          "num_children": 1,
          "author": 364882,
          "replies": [
            {
              "id": "i90a38r",
              "text": "[oh fine](https://www.reddit.com/r/DnD/comments/uryyop/oc_player_on_player_vicious_hand_chop/)",
              "timestamp": "2022-05-17 23:10:37",
              "score": 41,
              "num_children": 2,
              "author": 238977,
              "replies": [
                {
                  "id": "i90a9qc",
                  "text": "Dude I freaking love the thumbs up at the end like “I’m good bro!” That just made my day!",
                  "timestamp": "2022-05-17 23:12:01",
                  "score": 21,
                  "num_children": 1,
                  "author": 364882,
                  "replies": [
                    {
                      "id": "i90atge",
                      "text": "total terminator moment",
                      "timestamp": "2022-05-17 23:16:25",
                      "score": 6,
                      "num_children": 0,
                      "author": 238977,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i911pn6",
                  "text": "That was great:-p",
                  "timestamp": "2022-05-18 02:49:57",
                  "score": 1,
                  "num_children": 0,
                  "author": 298659,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i8yqj9i",
      "text": "Can we get a video with this post please",
      "timestamp": "2022-05-17 16:41:24",
      "score": 71,
      "num_children": 1,
      "author": 144622,
      "replies": [
        {
          "id": "i90fqay",
          "text": "I’m imagining the same vibe as r/startledcats",
          "timestamp": "2022-05-17 23:55:51",
          "score": 2,
          "num_children": 1,
          "author": 20813,
          "replies": [
            {
              "id": "i91asoo",
              "text": "Another day, another cat subreddit. Today is a good day",
              "timestamp": "2022-05-18 04:12:20",
              "score": 2,
              "num_children": 0,
              "author": 153671,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i8yhq9n",
      "text": "I’m picturing that Dali photo with the cats and the water.",
      "timestamp": "2022-05-17 15:41:22",
      "score": 65,
      "num_children": 0,
      "author": 311091,
      "replies": []
    },
    {
      "id": "i8yik7b",
      "text": "Lost their noodles!",
      "timestamp": "2022-05-17 15:47:06",
      "score": 153,
      "num_children": 2,
      "author": 191077,
      "replies": [
        {
          "id": "i8z4bix",
          "text": "This phrase is so perfectly cat-like I got the whole visual movie. Stupid chair. Get a beanbag and ditch the desk? Lol!",
          "timestamp": "2022-05-17 18:13:46",
          "score": 48,
          "num_children": 0,
          "author": 388830,
          "replies": []
        },
        {
          "id": "i97m4rd",
          "text": "That line was the best.",
          "timestamp": "2022-05-19 15:16:55",
          "score": 2,
          "num_children": 0,
          "author": 35954,
          "replies": []
        }
      ]
    },
    {
      "id": "i8z4rf7",
      "text": "...are you ok? Last time I interacted with a broken coffee mug I ended up in the hospital, so... are you ok?",
      "timestamp": "2022-05-17 18:16:47",
      "score": 41,
      "num_children": 1,
      "author": 271438,
      "replies": [
        {
          "id": "i8zczpn",
          "text": "I am! They were large shards, weren't embedded or anything",
          "timestamp": "2022-05-17 19:12:49",
          "score": 41,
          "num_children": 0,
          "author": 192106,
          "replies": []
        }
      ]
    },
    {
      "id": "i8ynzq5",
      "text": "// A breakage in one of my chairs  \n// caught me and my cats unawares  \n// although I'm cut up  \n// Today I Fucked Up  \n// will eat up my com'dy of err'rs",
      "timestamp": "2022-05-17 16:24:29",
      "score": 307,
      "num_children": 3,
      "author": 137960,
      "replies": [
        {
          "id": "i8zknil",
          "text": "Beautifully put.",
          "timestamp": "2022-05-17 20:05:16",
          "score": 10,
          "num_children": 0,
          "author": 65009,
          "replies": []
        },
        {
          "id": "i90q6eb",
          "text": "I love a good limerick. There should be more limericks in the world.",
          "timestamp": "2022-05-18 01:18:28",
          "score": 2,
          "num_children": 1,
          "author": 188056,
          "replies": [
            {
              "id": "i94rxqc",
              "text": "// I certainly hope you're amused   \n// my methods, I hope are excused:  \n// the rhymes are all slant,   \n// clear wording is scant,   \n// and 'postrophes often abused",
              "timestamp": "2022-05-18 22:40:10",
              "score": 3,
              "num_children": 0,
              "author": 137960,
              "replies": []
            }
          ]
        },
        {
          "id": "i910hrj",
          "text": "I sang that on the melody of Enemy by Imagine Dragons",
          "timestamp": "2022-05-18 02:39:58",
          "score": 2,
          "num_children": 0,
          "author": 285014,
          "replies": []
        }
      ]
    },
    {
      "id": "i8yimn2",
      "text": "That's so funny. I can't stop laughing.",
      "timestamp": "2022-05-17 15:47:34",
      "score": 34,
      "num_children": 0,
      "author": 169936,
      "replies": []
    },
    {
      "id": "i8zrdpf",
      "text": "Glad to see someone is in a bigger Zoom hell than me. I was on a long strategy call Zoom yesterday with just one other person. He needed a quick toilet break. While he was gone, I took the opportunity to let out a loud fart. He came back, we carried on. At the end of the call he summarised our discussion and said he’d “send out a copy of the recording to his team to bring them up to speed”.",
      "timestamp": "2022-05-17 20:51:56",
      "score": 29,
      "num_children": 1,
      "author": 233899,
      "replies": [
        {
          "id": "i8zsr7g",
          "text": "This made me laugh until I was coughing!",
          "timestamp": "2022-05-17 21:01:25",
          "score": 8,
          "num_children": 0,
          "author": 202052,
          "replies": []
        }
      ]
    },
    {
      "id": "i8ymh8e",
      "text": "LMAO. That was hilarious. Hope you feel better soon. :)",
      "timestamp": "2022-05-17 16:14:08",
      "score": 18,
      "num_children": 0,
      "author": 55499,
      "replies": []
    },
    {
      "id": "i8yn01m",
      "text": "Thank you for that, I needed that laugh today! I'm glad you're okay!",
      "timestamp": "2022-05-17 16:17:46",
      "score": 15,
      "num_children": 0,
      "author": 325196,
      "replies": []
    },
    {
      "id": "i8z19cr",
      "text": "-5 professionalism sure but I would argue +100 for absolute hilarity of being human.",
      "timestamp": "2022-05-17 17:52:58",
      "score": 81,
      "num_children": 0,
      "author": 247615,
      "replies": []
    },
    {
      "id": "i8yoqo5",
      "text": "I laughed so hard my stomach hurts. Thank you. Sadly I have no awards to give.",
      "timestamp": "2022-05-17 16:29:27",
      "score": 18,
      "num_children": 0,
      "author": 354169,
      "replies": []
    },
    {
      "id": "i8yv2sj",
      "text": "Top tier TIFU",
      "timestamp": "2022-05-17 17:11:52",
      "score": 15,
      "num_children": 0,
      "author": 411520,
      "replies": []
    },
    {
      "id": "i8ykqoy",
      "text": "🤣🤣 a TIFU post that actually made me laugh. Thank you.\n\n Hope you feel better!",
      "timestamp": "2022-05-17 16:01:59",
      "score": 40,
      "num_children": 0,
      "author": 175161,
      "replies": []
    },
    {
      "id": "i8ynai6",
      "text": "Sorry but I’d been busting with laughter. Hope you are okay though, and get shot of that cough!",
      "timestamp": "2022-05-17 16:19:45",
      "score": 13,
      "num_children": 0,
      "author": 408150,
      "replies": []
    },
    {
      "id": "i8z48n9",
      "text": "The cats look adorable in their little beds :)",
      "timestamp": "2022-05-17 18:13:15",
      "score": 11,
      "num_children": 0,
      "author": 152171,
      "replies": []
    },
    {
      "id": "i8yoyjl",
      "text": "Fucking incredible. Hope you're ok.",
      "timestamp": "2022-05-17 16:30:56",
      "score": 9,
      "num_children": 0,
      "author": 232463,
      "replies": []
    },
    {
      "id": "i8yrxfh",
      "text": "I hope you are doing better, that gave a me a great laugh. I needed that, thank you for sharing. Almost in tears lmao.",
      "timestamp": "2022-05-17 16:50:46",
      "score": 8,
      "num_children": 0,
      "author": 289127,
      "replies": []
    },
    {
      "id": "i8ys19s",
      "text": "That IS pure chaos. Live it.",
      "timestamp": "2022-05-17 16:51:28",
      "score": 9,
      "num_children": 0,
      "author": 136251,
      "replies": []
    },
    {
      "id": "i8z035m",
      "text": "Please find out if that was recorded and post it. I am pissing myself picturing this hahaha",
      "timestamp": "2022-05-17 17:45:14",
      "score": 8,
      "num_children": 0,
      "author": 265916,
      "replies": []
    },
    {
      "id": "i8z5ktz",
      "text": "Thank you for the cat tax!!!!",
      "timestamp": "2022-05-17 18:22:21",
      "score": 10,
      "num_children": 0,
      "author": 111095,
      "replies": []
    },
    {
      "id": "i8yxo8d",
      "text": "This is great. I hate to laugh at your accident, but that was damn funny. Good on you for having a sense of humor about it!",
      "timestamp": "2022-05-17 17:29:08",
      "score": 9,
      "num_children": 0,
      "author": 278440,
      "replies": []
    },
    {
      "id": "i8zme2t",
      "text": "I was starting a big zoom meeting and one participant *thought* her whole headset wasn’t working. But actually her mic was working fine and her earphones were muted. So we all got to hear some ruffling and clicking and, “Great. Great! Now I can’t hear a FUCKING THING!” as she tried to fix the problem.  \nFunniest thing about it was that it was an inter-company call with a Chinese firm and one of the ladies made what might me called an “anime noise” in surprise.",
      "timestamp": "2022-05-17 20:17:17",
      "score": 7,
      "num_children": 0,
      "author": 360188,
      "replies": []
    },
    {
      "id": "i8yi0u6",
      "text": "I thought this was going to end with you jerking off somehow because that’s how this whole forum works. This is awesome! Thanks for the laugh.",
      "timestamp": "2022-05-17 15:43:23",
      "score": 18,
      "num_children": 2,
      "author": 62032,
      "replies": [
        {
          "id": "i8ymf56",
          "text": "Jeffrey Toobin?",
          "timestamp": "2022-05-17 16:13:45",
          "score": 5,
          "num_children": 0,
          "author": 98633,
          "replies": []
        },
        {
          "id": "i8zyxge",
          "text": "Or shitting his pants.",
          "timestamp": "2022-05-17 21:45:29",
          "score": 2,
          "num_children": 0,
          "author": 173751,
          "replies": []
        }
      ]
    },
    {
      "id": "i8zbrk2",
      "text": "Here to say, we have identical set up, down to the model of monitors and keyboard as well as having double desk cats and asthma...\n\nMy IKEA chair exploded and I now have an excellent quality chair which is very kind to my butt.",
      "timestamp": "2022-05-17 19:04:28",
      "score": 5,
      "num_children": 0,
      "author": 10294,
      "replies": []
    },
    {
      "id": "i8yklmy",
      "text": "Thanks for the visual! Thats funny 😂",
      "timestamp": "2022-05-17 16:01:02",
      "score": 16,
      "num_children": 0,
      "author": 107309,
      "replies": []
    },
    {
      "id": "i8yqlo1",
      "text": "That's actually  hilarious",
      "timestamp": "2022-05-17 16:41:51",
      "score": 4,
      "num_children": 0,
      "author": 232929,
      "replies": []
    },
    {
      "id": "i8yzcm5",
      "text": "Ah hell. This is hilarious! I hope you’re feeling better now but I’m definitely saving this for later reading and laughing when I need some hilarity.",
      "timestamp": "2022-05-17 17:40:27",
      "score": 5,
      "num_children": 0,
      "author": 158188,
      "replies": []
    },
    {
      "id": "i8zb6mu",
      "text": "That would fucking destroy me, I’d be crying laughing oh my god. Hope your foot is ok bro",
      "timestamp": "2022-05-17 19:00:30",
      "score": 5,
      "num_children": 0,
      "author": 319604,
      "replies": []
    },
    {
      "id": "i8znpzb",
      "text": "If you hadn’t been wearing pants, this would have been utter perfection.",
      "timestamp": "2022-05-17 20:26:30",
      "score": 5,
      "num_children": 1,
      "author": 278714,
      "replies": [
        {
          "id": "i90zb41",
          "text": "How is this not the top comment?",
          "timestamp": "2022-05-18 02:30:21",
          "score": 1,
          "num_children": 0,
          "author": 33429,
          "replies": []
        }
      ]
    },
    {
      "id": "i8zxscf",
      "text": "This happened to a colleague of mine twice with two separate chairs. He was there one second and then all we saw were feet. Thank god he was wearing pants. He started sitting on his couch for zoom meetings. Honestly, it was fucking hilarious. I could only assume he got his furniture dumpster diving because what are the odds? Twice? He wasn't a big guy. I think you win though with the added kitty chaos.",
      "timestamp": "2022-05-17 21:37:10",
      "score": 5,
      "num_children": 0,
      "author": 160119,
      "replies": []
    },
    {
      "id": "i8yo8a9",
      "text": "I'm dying, this was such an entertaining read. I'm sure someone in my office heard me cracking up 😂.\n\nGreat writing, appreciate the cat tax. Hope you feel better soon! 😊",
      "timestamp": "2022-05-17 16:26:04",
      "score": 12,
      "num_children": 0,
      "author": 105877,
      "replies": []
    },
    {
      "id": "i8yva6x",
      "text": "Was the meeting recorded?",
      "timestamp": "2022-05-17 17:13:16",
      "score": 4,
      "num_children": 0,
      "author": 384746,
      "replies": []
    },
    {
      "id": "i8z3wta",
      "text": "Stuck home with covid and seriously needed that laugh. I’m laughing so hard I’m crying! Hope you and kitties are okay!",
      "timestamp": "2022-05-17 18:11:00",
      "score": 5,
      "num_children": 0,
      "author": 333290,
      "replies": []
    },
    {
      "id": "i8z9td6",
      "text": "I'm so sorry this is fucking hilarious and I hope you feel better soon.",
      "timestamp": "2022-05-17 18:51:08",
      "score": 4,
      "num_children": 1,
      "author": 388822,
      "replies": [
        {
          "id": "i8za6lh",
          "text": "And I hope it was recorded because the visual I have is killing me",
          "timestamp": "2022-05-17 18:53:41",
          "score": 1,
          "num_children": 0,
          "author": 388822,
          "replies": []
        }
      ]
    },
    {
      "id": "i8zaayc",
      "text": "What a great story! I'm happy you didn't die.\n\nThank you very much for the cat pic, they're adorable!!!",
      "timestamp": "2022-05-17 18:54:30",
      "score": 4,
      "num_children": 0,
      "author": 55291,
      "replies": []
    },
    {
      "id": "i8zccys",
      "text": "This sort of thing is what makes life living though, seeing some unfortunate sod almost lose his shit to a series of unfortunate and hilarious events really breaks up your day.",
      "timestamp": "2022-05-17 19:08:28",
      "score": 4,
      "num_children": 0,
      "author": 14960,
      "replies": []
    },
    {
      "id": "i8zfs4o",
      "text": "thank you for paying your cat tax. They are adorable",
      "timestamp": "2022-05-17 19:31:49",
      "score": 4,
      "num_children": 0,
      "author": 398740,
      "replies": []
    },
    {
      "id": "i8zgbrq",
      "text": "Haha literally a TIFU. Thanks for sharing. I’m surprised no one said this yet but they should have killed your mic at least. I know when I am on Zoom calls if someone is making background noise we 1) ask them nicely to go on mute, and 2) if no response the host will mute them.",
      "timestamp": "2022-05-17 19:35:32",
      "score": 4,
      "num_children": 1,
      "author": 284154,
      "replies": [
        {
          "id": "i903byq",
          "text": "Counterpoint: the sound effects probably made everything 10 times funnier.",
          "timestamp": "2022-05-17 22:18:13",
          "score": 5,
          "num_children": 1,
          "author": 341203,
          "replies": [
            {
              "id": "i92posr",
              "text": "Ah yes. The old hilarity on a Zoom call ploy.",
              "timestamp": "2022-05-18 14:08:22",
              "score": 1,
              "num_children": 0,
              "author": 284154,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i8zxyxs",
      "text": "I’m crying with laughter. Are you OK though? You’re not too badly hurt are you?",
      "timestamp": "2022-05-17 21:38:30",
      "score": 4,
      "num_children": 0,
      "author": 5773,
      "replies": []
    },
    {
      "id": "i8zy0w8",
      "text": "That is utterly hilarious and as a consequence I woke my husband up - 100% worth it. \n\nI hope your injury was not too severe OP",
      "timestamp": "2022-05-17 21:38:54",
      "score": 4,
      "num_children": 0,
      "author": 33672,
      "replies": []
    },
    {
      "id": "i9011pk",
      "text": "The only F-up was not providing a link to the video. \n\nOtherwise, you sir are a legend. Long will people sing songs of your deeds!",
      "timestamp": "2022-05-17 22:01:04",
      "score": 5,
      "num_children": 0,
      "author": 411840,
      "replies": []
    },
    {
      "id": "i901te3",
      "text": "\"This meeting is being recorded\"",
      "timestamp": "2022-05-17 22:06:48",
      "score": 5,
      "num_children": 0,
      "author": 361141,
      "replies": []
    },
    {
      "id": "i905505",
      "text": "Do we call HR, IT, or 911 hmmm",
      "timestamp": "2022-05-17 22:32:03",
      "score": 4,
      "num_children": 0,
      "author": 19129,
      "replies": []
    },
    {
      "id": "i905bwz",
      "text": "Was announcing an mvp release for our team on zoom. Chair broke mid announce and fell out of the screen. Cat did exactly the same thing.",
      "timestamp": "2022-05-17 22:33:29",
      "score": 3,
      "num_children": 0,
      "author": 241508,
      "replies": []
    },
    {
      "id": "i906iry",
      "text": "Cats Tokyo drifting on top of a desk making sure everything on it is flung on the floor is a universal constant.",
      "timestamp": "2022-05-17 22:42:36",
      "score": 4,
      "num_children": 0,
      "author": 105505,
      "replies": []
    },
    {
      "id": "i906vlm",
      "text": "What a cat-astrophe",
      "timestamp": "2022-05-17 22:45:21",
      "score": 4,
      "num_children": 0,
      "author": 309733,
      "replies": []
    },
    {
      "id": "i90gpso",
      "text": "What are the chances one of your associates recorded the fiasco, and you could upload it?",
      "timestamp": "2022-05-18 00:03:53",
      "score": 5,
      "num_children": 0,
      "author": 189766,
      "replies": []
    },
    {
      "id": "i90grw2",
      "text": "Omg thank you for making me laugh! I am in bed sick and just had a wild coughing fit for laughing so hard at this. Totally worth it lol Hope your doctors appointment went well, OP!",
      "timestamp": "2022-05-18 00:04:21",
      "score": 5,
      "num_children": 0,
      "author": 75756,
      "replies": []
    },
    {
      "id": "i91a5x7",
      "text": "Man this just stayed on the gas pedal the entire way",
      "timestamp": "2022-05-18 04:06:02",
      "score": 3,
      "num_children": 0,
      "author": 305285,
      "replies": []
    },
    {
      "id": "i8z4ke7",
      "text": "I really hope someone was recording that Zoom.",
      "timestamp": "2022-05-17 18:15:25",
      "score": 3,
      "num_children": 0,
      "author": 284012,
      "replies": []
    },
    {
      "id": "i8z9dtf",
      "text": "Thank you for a much needed belly laugh!",
      "timestamp": "2022-05-17 18:48:10",
      "score": 3,
      "num_children": 0,
      "author": 388051,
      "replies": []
    },
    {
      "id": "i8zcjpw",
      "text": "Love this. Sorry, perfection on description! I feel like I just watched this and experienced at the same time. \n\nYou’re blowing my mind Frank",
      "timestamp": "2022-05-17 19:09:45",
      "score": 3,
      "num_children": 0,
      "author": 93870,
      "replies": []
    },
    {
      "id": "i8zd5k7",
      "text": "Thank you so much for sharing.  Thanks to you, I just laughed and laughed and laughed on a day in which I had not yet even smiled.",
      "timestamp": "2022-05-17 19:13:54",
      "score": 3,
      "num_children": 0,
      "author": 97418,
      "replies": []
    },
    {
      "id": "i8zi3h5",
      "text": "Cats freaking tf out when an unexpected noise happens never fails to make me laugh. Mine lose their shit too. so good.",
      "timestamp": "2022-05-17 19:47:41",
      "score": 3,
      "num_children": 1,
      "author": 39993,
      "replies": [
        {
          "id": "i8zz1bj",
          "text": "r/StartledCats",
          "timestamp": "2022-05-17 21:46:15",
          "score": 2,
          "num_children": 0,
          "author": 376354,
          "replies": []
        }
      ]
    },
    {
      "id": "i8zj3b9",
      "text": "So all these funny questions… but the cats have beds on the desk? I don’t think I’ve ever seen that before. And you have enough space to work?",
      "timestamp": "2022-05-17 19:54:29",
      "score": 3,
      "num_children": 0,
      "author": 234383,
      "replies": []
    },
    {
      "id": "i8zmc3n",
      "text": "WHY GOD WHY WAS THIS NOT RECORDED!!!!",
      "timestamp": "2022-05-17 20:16:54",
      "score": 3,
      "num_children": 0,
      "author": 43841,
      "replies": []
    },
    {
      "id": "i8zne0h",
      "text": "OP, I've had a shitty couple of days and you made me laugh until I cried, instead of the normal sad crying I've been doing. Bless you.",
      "timestamp": "2022-05-17 20:24:10",
      "score": 3,
      "num_children": 0,
      "author": 400360,
      "replies": []
    },
    {
      "id": "i8zny57",
      "text": "I had a horrible day. Thank you for making me blow snort bubbles into my Margarita 🤣👏🏼",
      "timestamp": "2022-05-17 20:28:06",
      "score": 3,
      "num_children": 0,
      "author": 173948,
      "replies": []
    },
    {
      "id": "i8zo57x",
      "text": "Keyboards need to come with a global \"Push to talk\" button",
      "timestamp": "2022-05-17 20:29:26",
      "score": 3,
      "num_children": 0,
      "author": 371484,
      "replies": []
    },
    {
      "id": "i8zvbns",
      "text": "I have tried to cat trap my office with baskets and beds and blankies apparently I’m too freaking boring at work to nap with",
      "timestamp": "2022-05-17 21:19:38",
      "score": 3,
      "num_children": 0,
      "author": 8467,
      "replies": []
    },
    {
      "id": "i8zzgh3",
      "text": "This really made me chuckle. Thanks for the good TIFU and hope you feel better soon!",
      "timestamp": "2022-05-17 21:49:18",
      "score": 3,
      "num_children": 0,
      "author": 23863,
      "replies": []
    },
    {
      "id": "i901cu6",
      "text": "I laughed so hard at this that I got the hiccups. Thank you.",
      "timestamp": "2022-05-17 22:03:24",
      "score": 3,
      "num_children": 0,
      "author": 245004,
      "replies": []
    },
    {
      "id": "i904ukb",
      "text": "Any chance this meeting was recorded? Asking for all of Reddit.",
      "timestamp": "2022-05-17 22:29:49",
      "score": 3,
      "num_children": 0,
      "author": 351211,
      "replies": []
    },
    {
      "id": "i907s50",
      "text": "It is the first Zoom TIFU I read has nothing to do with sex",
      "timestamp": "2022-05-17 22:52:22",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i90e34r",
      "text": "Today, on a zoom call, I asked my boss's boss's boss if \"there was poop in there\". Was unmuted. Talking to my daughter....\n\nI'm getting a muteme. Google it if you would like to know more.",
      "timestamp": "2022-05-17 23:42:28",
      "score": 3,
      "num_children": 1,
      "author": 352974,
      "replies": [
        {
          "id": "i92usc3",
          "text": "Similar to that, why I almost always use the dial-in option.  Then double mute, with the app and the phone mute.",
          "timestamp": "2022-05-18 14:45:23",
          "score": 2,
          "num_children": 1,
          "author": 156557,
          "replies": [
            {
              "id": "i9410i9",
              "text": "Look at you, being way smarter than me. LOL. 😁",
              "timestamp": "2022-05-18 19:31:22",
              "score": 1,
              "num_children": 0,
              "author": 352974,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i90fokf",
      "text": "i’ve never laughed out loud to a tifu before lmao",
      "timestamp": "2022-05-17 23:55:27",
      "score": 3,
      "num_children": 0,
      "author": 163572,
      "replies": []
    },
    {
      "id": "i90g0fq",
      "text": "Jesus Christ, I’m legit wheezing over here. I hope you’re ok, friend. \n\nAlso, I love your cats. #fact",
      "timestamp": "2022-05-17 23:58:10",
      "score": 3,
      "num_children": 0,
      "author": 402773,
      "replies": []
    },
    {
      "id": "i90gw39",
      "text": "Tears running down my face as I visualized every moment. Well done. That was genuinely hilarious.",
      "timestamp": "2022-05-18 00:05:16",
      "score": 3,
      "num_children": 0,
      "author": 146015,
      "replies": []
    },
    {
      "id": "i90nxdf",
      "text": "I hope someone recorded that call, damn",
      "timestamp": "2022-05-18 01:00:42",
      "score": 3,
      "num_children": 0,
      "author": 295265,
      "replies": []
    },
    {
      "id": "i9150dk",
      "text": "Yerh online meetings.. a total call for cluster mistakes.. \nI was in a meeting and the CFO was speaking, I had my mic off, but it was a USB connected detached unit.. I reached over to grab something and I must of bushed the sensor and the mic came on.. \n\nThen I'm sitting back trying to do my actual work.. and all these ass kissing office workers are all praising the CFO and how wonderful it is that we won't be getting decent pay rises with this upcoming massive inflation (a few months ago when inflation was up and everyone knew it was going brrrrrr )\n\nAnd I keep losing focus to these popup comments section.. and I'm trying to turn the comments off but focus keeps leaving the menus for the comments and I can't find the option..\n\nSo loudly vent my frustrations. \"FOR F***'S SAKE\"\n\nand someone running the meeting assumes it's coming from the open area the CFO is in and bang she's muted.. opps 😂",
      "timestamp": "2022-05-18 03:18:08",
      "score": 3,
      "num_children": 0,
      "author": 400180,
      "replies": []
    },
    {
      "id": "i91wrrn",
      "text": "I hope other posters see this and get a lesson on what this sub must be used for. Thanks for the laugh, it was so long that you gave me back a couple of years that I lost cause I'm a smoker.",
      "timestamp": "2022-05-18 09:02:52",
      "score": 3,
      "num_children": 0,
      "author": 148998,
      "replies": []
    },
    {
      "id": "i8zdajc",
      "text": "https://clips.twitch.tv/CourteousFreezingMochaTwitchRaid\n\nStreamer friend breaking his chair on stream.",
      "timestamp": "2022-05-17 19:14:51",
      "score": 6,
      "num_children": 0,
      "author": 188437,
      "replies": []
    },
    {
      "id": "i8zebpf",
      "text": "Finally, a good TIFU! It’s not only believable but it’s not just “one time, I did a thing and then the secks happens, but I didn’t mean to so TIFU”",
      "timestamp": "2022-05-17 19:21:49",
      "score": 6,
      "num_children": 0,
      "author": 104132,
      "replies": []
    },
    {
      "id": "i8z5hyg",
      "text": "Please tell me you got video of this! 😂😂",
      "timestamp": "2022-05-17 18:21:49",
      "score": 2,
      "num_children": 0,
      "author": 88161,
      "replies": []
    },
    {
      "id": "i8z8f75",
      "text": "I can’t stop laughing CTFU!",
      "timestamp": "2022-05-17 18:41:40",
      "score": 2,
      "num_children": 0,
      "author": 17486,
      "replies": []
    },
    {
      "id": "i8zbj97",
      "text": "The cat tax must always be paid",
      "timestamp": "2022-05-17 19:02:55",
      "score": 2,
      "num_children": 0,
      "author": 228067,
      "replies": []
    },
    {
      "id": "i8zdyr2",
      "text": "Wow what a beard stroking academic",
      "timestamp": "2022-05-17 19:19:26",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i8zer2d",
      "text": "This gave me life. Thank you for this absolute art, and I’m glad you’re okay!",
      "timestamp": "2022-05-17 19:24:41",
      "score": 2,
      "num_children": 0,
      "author": 26471,
      "replies": []
    },
    {
      "id": "i8zjy6m",
      "text": "I love that your kitties each have a bed under your monitors.  My little dude has a pedestal next to my chair that he'll come chill on when he wants to be my digital accomplice.  Sometimes I feel like Dr. Claw from Inspector Gadget tbh except that my cat is named Max instead of Mad Cat and we're not over here intentionally hatching evil plots or being a menace.",
      "timestamp": "2022-05-17 20:00:24",
      "score": 2,
      "num_children": 0,
      "author": 295051,
      "replies": []
    },
    {
      "id": "i8zm7hi",
      "text": "You did good.",
      "timestamp": "2022-05-17 20:16:01",
      "score": 2,
      "num_children": 0,
      "author": 93433,
      "replies": []
    },
    {
      "id": "i8znfnx",
      "text": "I have that same dual monitor stand complete with mismatched monitors, but my bigger/better one is on the let and the smaller/older one is on the right.",
      "timestamp": "2022-05-17 20:24:29",
      "score": 2,
      "num_children": 0,
      "author": 178448,
      "replies": []
    },
    {
      "id": "i8zodk9",
      "text": "Oh wow, I got a great belly laugh out of that one! Hope you and the cats are OK now!",
      "timestamp": "2022-05-17 20:31:05",
      "score": 2,
      "num_children": 0,
      "author": 412386,
      "replies": []
    },
    {
      "id": "i8zoebb",
      "text": "\"anyways...\"",
      "timestamp": "2022-05-17 20:31:14",
      "score": 2,
      "num_children": 0,
      "author": 261841,
      "replies": []
    },
    {
      "id": "i8zrb93",
      "text": "If there’s is a recording of this.. DYING TO SEE THIS xD",
      "timestamp": "2022-05-17 20:51:26",
      "score": 2,
      "num_children": 0,
      "author": 265876,
      "replies": []
    },
    {
      "id": "i8zrqyo",
      "text": "This is when you really wish the meeting had been recorded...",
      "timestamp": "2022-05-17 20:54:28",
      "score": 2,
      "num_children": 0,
      "author": 103679,
      "replies": []
    },
    {
      "id": "i8zs05n",
      "text": "Good shit lol",
      "timestamp": "2022-05-17 20:56:12",
      "score": 2,
      "num_children": 0,
      "author": 100890,
      "replies": []
    },
    {
      "id": "i8zsg2a",
      "text": "lmfao",
      "timestamp": "2022-05-17 20:59:19",
      "score": 2,
      "num_children": 0,
      "author": 170937,
      "replies": []
    },
    {
      "id": "i8zt6ep",
      "text": "Did you get a pitty induced raise?",
      "timestamp": "2022-05-17 21:04:23",
      "score": 2,
      "num_children": 0,
      "author": 323038,
      "replies": []
    },
    {
      "id": "i8ztchi",
      "text": "This made me chuckle. 😂\n\nHope you heal up quickly!",
      "timestamp": "2022-05-17 21:05:33",
      "score": 2,
      "num_children": 0,
      "author": 367887,
      "replies": []
    },
    {
      "id": "i8zts0s",
      "text": "This made me laugh so hard. I'm sorry it's at your misfortune but you described it perfectly. Thanks OP needed the laughs",
      "timestamp": "2022-05-17 21:08:39",
      "score": 2,
      "num_children": 0,
      "author": 334410,
      "replies": []
    },
    {
      "id": "i8zttpj",
      "text": "[OP is this you?](https://youtu.be/XfdJGrGfA_Y)",
      "timestamp": "2022-05-17 21:09:00",
      "score": 2,
      "num_children": 0,
      "author": 244016,
      "replies": []
    },
    {
      "id": "i90e07g",
      "text": "Please tell me someone was recording this meeting",
      "timestamp": "2022-05-17 23:41:50",
      "score": 2,
      "num_children": 0,
      "author": 162258,
      "replies": []
    },
    {
      "id": "i90f0cj",
      "text": "Sanka, ya dead?",
      "timestamp": "2022-05-17 23:49:57",
      "score": 2,
      "num_children": 0,
      "author": 108019,
      "replies": []
    },
    {
      "id": "i90lchj",
      "text": "Thank you so much for this, I haven’t laughed this hard at anything for a loong time, I had to stop a couple of times to wipe the tears to see the screen😂😂😂",
      "timestamp": "2022-05-18 00:40:29",
      "score": 2,
      "num_children": 0,
      "author": 17523,
      "replies": []
    },
    {
      "id": "i90mi23",
      "text": "I love the way you wrote this OP. Much needed laugh after a shitty work day 🤣",
      "timestamp": "2022-05-18 00:49:28",
      "score": 2,
      "num_children": 0,
      "author": 13543,
      "replies": []
    },
    {
      "id": "i90myvt",
      "text": "Like cats do and lost their noodles. Absolute best part and I'm going to start using that term",
      "timestamp": "2022-05-18 00:53:13",
      "score": 2,
      "num_children": 0,
      "author": 192667,
      "replies": []
    },
    {
      "id": "i90nbrf",
      "text": "At least they were woken up and fully involved",
      "timestamp": "2022-05-18 00:56:01",
      "score": 2,
      "num_children": 0,
      "author": 204198,
      "replies": []
    },
    {
      "id": "i90o2xa",
      "text": "Office funny guy, huh? Now you need to stick to the slapstick routine and become an absolute legend at work.",
      "timestamp": "2022-05-18 01:01:53",
      "score": 2,
      "num_children": 0,
      "author": 395616,
      "replies": []
    },
    {
      "id": "i90oryb",
      "text": "I am dealing with a cough too. Thanks for making me laugh hard enough to cough and wake up my 3 year old.",
      "timestamp": "2022-05-18 01:07:19",
      "score": 2,
      "num_children": 0,
      "author": 65093,
      "replies": []
    },
    {
      "id": "i90ouwc",
      "text": "I laughed long and hard while reading this and I am sorry. I hope you’re okay but damn. I wish I was on that call, not gonna lie.",
      "timestamp": "2022-05-18 01:07:58",
      "score": 2,
      "num_children": 0,
      "author": 349374,
      "replies": []
    },
    {
      "id": "i90r2op",
      "text": "I did the same thing to a coworker. I sneezed super loudly and she had her speakers on (no headphones) and her cat launched itself off her desk, causing chaos and destruction. It's not unusual for me to sneeze on a zoom but I normally have enough warning that a sneeze is coming to mute myself. Not this time. Best part was the cat climbing back up on the desk and giving the camera the stink eye for disturbing his sleep.",
      "timestamp": "2022-05-18 01:25:26",
      "score": 2,
      "num_children": 0,
      "author": 41370,
      "replies": []
    },
    {
      "id": "i90u1iv",
      "text": "This made me laugh out loud for real",
      "timestamp": "2022-05-18 01:48:32",
      "score": 2,
      "num_children": 0,
      "author": 152829,
      "replies": []
    },
    {
      "id": "i90v2ku",
      "text": "I laughed so hard at this, thank you for sharing this with everyone, you're amazing and I hope you and the kitties are okay now.",
      "timestamp": "2022-05-18 01:56:40",
      "score": 2,
      "num_children": 0,
      "author": 370636,
      "replies": []
    },
    {
      "id": "i90z6u3",
      "text": "DID YOU NOT TAKE PHOTOS?",
      "timestamp": "2022-05-18 02:29:23",
      "score": 2,
      "num_children": 0,
      "author": 127910,
      "replies": []
    },
    {
      "id": "i912rlq",
      "text": "Jerry/Garry is that you?",
      "timestamp": "2022-05-18 02:58:57",
      "score": 2,
      "num_children": 0,
      "author": 376745,
      "replies": []
    },
    {
      "id": "i91c69b",
      "text": "This is bloody hilarious and I had to restrict my laughter to keep my partner from waking up. Ty for that. Lol",
      "timestamp": "2022-05-18 04:26:16",
      "score": 2,
      "num_children": 0,
      "author": 272912,
      "replies": []
    },
    {
      "id": "i91crnq",
      "text": "Fix that useless tldr",
      "timestamp": "2022-05-18 04:32:34",
      "score": 2,
      "num_children": 0,
      "author": 293478,
      "replies": []
    },
    {
      "id": "i91kfpz",
      "text": "I feel for you being a asthmatic and fellow cat enthusiast but I have to say that was hilarious. It exactly sounds like something that I would do. I hope your feet heal, your asthma calms down, your cats calm and you get to enjoy another coffee.  Stay safe and watch out for those office chairs.  All I can say is (I am assuming) at least you were wearing pants during the zoom meeting.",
      "timestamp": "2022-05-18 06:02:30",
      "score": 2,
      "num_children": 0,
      "author": 317049,
      "replies": []
    },
    {
      "id": "i91v7cd",
      "text": "Sorry to hear for you but this encounters like this are the only way we've made it through Zoom classes for 5 semesters.",
      "timestamp": "2022-05-18 08:38:06",
      "score": 2,
      "num_children": 0,
      "author": 95554,
      "replies": []
    },
    {
      "id": "i9222zi",
      "text": "Rube Goldberg has a lot to answer for.",
      "timestamp": "2022-05-18 10:21:58",
      "score": 2,
      "num_children": 0,
      "author": 39167,
      "replies": []
    },
    {
      "id": "i938pyz",
      "text": "please link the video lol",
      "timestamp": "2022-05-18 16:20:53",
      "score": 2,
      "num_children": 0,
      "author": 220136,
      "replies": []
    },
    {
      "id": "i948l3x",
      "text": "Why the cat tax gone?",
      "timestamp": "2022-05-18 20:22:44",
      "score": 2,
      "num_children": 0,
      "author": 160394,
      "replies": []
    },
    {
      "id": "i8zzrlf",
      "text": "Worst  TL;DR in a long time.  Do better.",
      "timestamp": "2022-05-17 21:51:35",
      "score": -1,
      "num_children": 0,
      "author": 142705,
      "replies": []
    },
    {
      "id": "i8z277w",
      "text": "If someone was recording I want video!",
      "timestamp": "2022-05-17 17:59:19",
      "score": 1,
      "num_children": 0,
      "author": 248909,
      "replies": []
    },
    {
      "id": "i8z6ad8",
      "text": ">I leaned back in my chair to really give off the beard-stroking academic vibe\n\nAfter reading the whole ordeal, my imagination is actually running wild with Quinn Nelson from Snazzy Labs.",
      "timestamp": "2022-05-17 18:27:10",
      "score": 1,
      "num_children": 0,
      "author": 265744,
      "replies": []
    },
    {
      "id": "i8z6i91",
      "text": "I alway got my back on the seat of my chair and my legs on a wall or something. I’m most comfortable when my feet are above me.",
      "timestamp": "2022-05-17 18:28:40",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i8zcssz",
      "text": "The camera should've been on",
      "timestamp": "2022-05-17 19:11:30",
      "score": 1,
      "num_children": 0,
      "author": 370820,
      "replies": []
    },
    {
      "id": "i8ze7kh",
      "text": "Bro I thought you were about to say, **”I shitted myself and came back to my desk..”**",
      "timestamp": "2022-05-17 19:21:01",
      "score": 1,
      "num_children": 0,
      "author": 388416,
      "replies": []
    },
    {
      "id": "i8zf3r8",
      "text": "I must have the same cough, and it’s acting up while I’m laughing. Shit hurts. Not cool. #angryupvote",
      "timestamp": "2022-05-17 19:27:09",
      "score": 1,
      "num_children": 0,
      "author": 343516,
      "replies": []
    },
    {
      "id": "i8zff4w",
      "text": "But were you wearing pants?",
      "timestamp": "2022-05-17 19:29:21",
      "score": 1,
      "num_children": 1,
      "author": 199341,
      "replies": [
        {
          "id": "i8zgo35",
          "text": "My exact question. As someone who regularly attends computer meetings sans-pants this is the only thing I could think of that could have made this worse.",
          "timestamp": "2022-05-17 19:37:51",
          "score": 3,
          "num_children": 1,
          "author": 371489,
          "replies": [
            {
              "id": "i8zqsop",
              "text": "I could think of a few things that would make it worse, but no pants was the first to come to mind.\nAre you Canadian? When I say \"sans\" something, people don't understand, so I am happy to see it in the wild.",
              "timestamp": "2022-05-17 20:47:53",
              "score": 3,
              "num_children": 1,
              "author": 199341,
              "replies": [
                {
                  "id": "i8zzmd2",
                  "text": "I’m from Arizona, which is like oppositest of Canada within the US :P",
                  "timestamp": "2022-05-17 21:50:30",
                  "score": 3,
                  "num_children": 1,
                  "author": 371489,
                  "replies": [
                    {
                      "id": "i903hy0",
                      "text": "Nah, there are more opposite places! \nI guess it is just a thing some people say then... I should have mentioned the ones who don't understand are also Canadian.",
                      "timestamp": "2022-05-17 22:19:27",
                      "score": 2,
                      "num_children": 0,
                      "author": 199341,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i8zfowr",
      "text": "Sorry about the feet. thank you for blessing us with pictures of the floofs.",
      "timestamp": "2022-05-17 19:31:12",
      "score": 1,
      "num_children": 0,
      "author": 87033,
      "replies": []
    },
    {
      "id": "i8zmmhx",
      "text": "I wish this was recorded and you could share the whole performance.",
      "timestamp": "2022-05-17 20:18:55",
      "score": 1,
      "num_children": 0,
      "author": 71804,
      "replies": []
    },
    {
      "id": "i8zmx0d",
      "text": "I love your keyboard where did you get it?",
      "timestamp": "2022-05-17 20:20:54",
      "score": 1,
      "num_children": 0,
      "author": 207722,
      "replies": []
    },
    {
      "id": "i8zp1x9",
      "text": "You've got a nice monitor setup, and I'm jealous.",
      "timestamp": "2022-05-17 20:35:51",
      "score": 1,
      "num_children": 0,
      "author": 65747,
      "replies": []
    },
    {
      "id": "i8zqmk9",
      "text": "Uh oh spaghetti-ohs",
      "timestamp": "2022-05-17 20:46:43",
      "score": 1,
      "num_children": 0,
      "author": 278718,
      "replies": []
    },
    {
      "id": "i8ztxox",
      "text": "Thanks for setting the work from home movement back.",
      "timestamp": "2022-05-17 21:09:46",
      "score": 1,
      "num_children": 0,
      "author": 307127,
      "replies": []
    },
    {
      "id": "i8zwhi1",
      "text": "I'm disappointed in my coworkers for not giving me this level of entertainment. \n\nJust once!",
      "timestamp": "2022-05-17 21:27:46",
      "score": 1,
      "num_children": 0,
      "author": 87059,
      "replies": []
    },
    {
      "id": "i8zwqgk",
      "text": "Was the meeting recorded, cuz that would make an excellent safety video (on what not to do).",
      "timestamp": "2022-05-17 21:29:35",
      "score": 1,
      "num_children": 0,
      "author": 152301,
      "replies": []
    },
    {
      "id": "i8zx0g4",
      "text": "I think I busted a gut laughing after reading this.",
      "timestamp": "2022-05-17 21:31:36",
      "score": 1,
      "num_children": 0,
      "author": 224988,
      "replies": []
    },
    {
      "id": "i8zx6fu",
      "text": "I feel bad for laughing so much.",
      "timestamp": "2022-05-17 21:32:49",
      "score": 1,
      "num_children": 0,
      "author": 95871,
      "replies": []
    },
    {
      "id": "i8zx8hw",
      "text": "Oh that's absolutely hilarious! Bonus points for the amount of craziness in such a short time!",
      "timestamp": "2022-05-17 21:33:13",
      "score": 1,
      "num_children": 0,
      "author": 175670,
      "replies": []
    },
    {
      "id": "i8zyna4",
      "text": "\"Lost their noodles\" I love that term.",
      "timestamp": "2022-05-17 21:43:26",
      "score": 1,
      "num_children": 0,
      "author": 22986,
      "replies": []
    },
    {
      "id": "i8zynxz",
      "text": "Lesson to everyone,  always wear pants when on zoom. Otherwise OP would have to add that everyone in zoom got an eyeful",
      "timestamp": "2022-05-17 21:43:34",
      "score": 1,
      "num_children": 0,
      "author": 166886,
      "replies": []
    },
    {
      "id": "i8zyxgm",
      "text": "Thank you for the cat tax. Maybe petition the feline overlords to lounge in a safer place next time?",
      "timestamp": "2022-05-17 21:45:29",
      "score": 1,
      "num_children": 0,
      "author": 283466,
      "replies": []
    },
    {
      "id": "i8zz4xq",
      "text": "The whole country has \"a wicked cough\" currently. Some years are worse than others for allergies but this year is off the hook.",
      "timestamp": "2022-05-17 21:46:56",
      "score": 1,
      "num_children": 0,
      "author": 84069,
      "replies": []
    },
    {
      "id": "i8zzydz",
      "text": "WHERE IS THIS VIDEO SIR\n\nFail tax?",
      "timestamp": "2022-05-17 21:52:58",
      "score": 1,
      "num_children": 0,
      "author": 247447,
      "replies": []
    },
    {
      "id": "i9003te",
      "text": "How aggressively are your cats avoiding eye contact and grooming?",
      "timestamp": "2022-05-17 21:54:06",
      "score": 1,
      "num_children": 0,
      "author": 211643,
      "replies": []
    },
    {
      "id": "i900f3e",
      "text": "TLDR - A thing happened",
      "timestamp": "2022-05-17 21:56:26",
      "score": 1,
      "num_children": 0,
      "author": 410254,
      "replies": []
    },
    {
      "id": "i900qpe",
      "text": "Oh man OP, I needed that. That's just the right kind of TIFU that makes me feel bad, but also knows full well that you and your colleagues had a good laugh about it.",
      "timestamp": "2022-05-17 21:58:49",
      "score": 1,
      "num_children": 0,
      "author": 372302,
      "replies": []
    },
    {
      "id": "i901p8f",
      "text": "I'm sorry I missed that!",
      "timestamp": "2022-05-17 22:05:56",
      "score": 1,
      "num_children": 0,
      "author": 44833,
      "replies": []
    },
    {
      "id": "i901t2s",
      "text": "I’ve done almost the same I leaned back but chair tipped over backwards, thankfully nothing spilled, banged my head on the floor, spent the neck few minutes pissing ourselves laughing, all they could see was my feet and calves.",
      "timestamp": "2022-05-17 22:06:44",
      "score": 1,
      "num_children": 0,
      "author": 155044,
      "replies": []
    },
    {
      "id": "i902iio",
      "text": "This is hilarious. And your kitties are adorable!",
      "timestamp": "2022-05-17 22:12:02",
      "score": 1,
      "num_children": 0,
      "author": 56290,
      "replies": []
    },
    {
      "id": "i902lqp",
      "text": "Thank you kindly for the belly laugh and cat tax, I needed it. Hope your foot is ok.",
      "timestamp": "2022-05-17 22:12:42",
      "score": 1,
      "num_children": 0,
      "author": 306096,
      "replies": []
    },
    {
      "id": "i902vis",
      "text": "Lmao! I’m in tears! Thank you for posting this. I hope you’re doing okay.",
      "timestamp": "2022-05-17 22:14:44",
      "score": 1,
      "num_children": 0,
      "author": 93126,
      "replies": []
    },
    {
      "id": "i902zu6",
      "text": "This made me laugh my ass off!!\n\nWhere did you get the keyboard btw?!",
      "timestamp": "2022-05-17 22:15:38",
      "score": 1,
      "num_children": 0,
      "author": 85828,
      "replies": []
    },
    {
      "id": "i9036du",
      "text": ">Minus 5 points professionalism for me, plus 10 points hilarity.\n\nAnd 25 points for Gryffindor!",
      "timestamp": "2022-05-17 22:17:02",
      "score": 1,
      "num_children": 0,
      "author": 14135,
      "replies": []
    },
    {
      "id": "i903am8",
      "text": "This actually gave me a good chuckle. First one came when the desk chair exploded, but then the post just kept getting better. Hope you and your cats are alright",
      "timestamp": "2022-05-17 22:17:56",
      "score": 1,
      "num_children": 0,
      "author": 134162,
      "replies": []
    },
    {
      "id": "i9044ei",
      "text": "We need more Zoom meetings like this",
      "timestamp": "2022-05-17 22:24:13",
      "score": 1,
      "num_children": 0,
      "author": 383555,
      "replies": []
    },
    {
      "id": "i9046ep",
      "text": "Should have ended it with “I’m not a cat your honor”.",
      "timestamp": "2022-05-17 22:24:39",
      "score": 1,
      "num_children": 0,
      "author": 37130,
      "replies": []
    },
    {
      "id": "i904a2q",
      "text": "Epic payment of the cat tax. 10/10 cuteness overload. Thank you.",
      "timestamp": "2022-05-17 22:25:26",
      "score": 1,
      "num_children": 0,
      "author": 72798,
      "replies": []
    },
    {
      "id": "i904rsp",
      "text": " I love a good not sex related TIFU. Congrats, sir.",
      "timestamp": "2022-05-17 22:29:15",
      "score": 1,
      "num_children": 0,
      "author": 143889,
      "replies": []
    },
    {
      "id": "i905lrw",
      "text": "D'oh!\n\nI am also finishing whatever yuck has been going around, so, in chuckling out loud at the mental image of your cartoonish blunder, a coughing fit ensued.",
      "timestamp": "2022-05-17 22:35:30",
      "score": 1,
      "num_children": 0,
      "author": 409324,
      "replies": []
    },
    {
      "id": "i905rg9",
      "text": "I love this! Hope you’re feeling right as rain very soon!",
      "timestamp": "2022-05-17 22:36:45",
      "score": 1,
      "num_children": 0,
      "author": 135041,
      "replies": []
    },
    {
      "id": "i9066nv",
      "text": "Glad you’re okay.  If it was me in my team’s Zoom Meeting, my team would’ve either called 911 or laughed!",
      "timestamp": "2022-05-17 22:40:01",
      "score": 1,
      "num_children": 0,
      "author": 321781,
      "replies": []
    },
    {
      "id": "i9088zs",
      "text": "That's an OHS write up. Also get a covid test.",
      "timestamp": "2022-05-17 22:56:05",
      "score": 1,
      "num_children": 0,
      "author": 220589,
      "replies": []
    },
    {
      "id": "i909gk9",
      "text": "bro, the back of my computer chair came unbolted from the seat in the middle of a counter strike game. I threw myself back in my chair when I died and almost died IRL. \n\n0/10 would not recommend.",
      "timestamp": "2022-05-17 23:05:36",
      "score": 1,
      "num_children": 0,
      "author": 341586,
      "replies": []
    },
    {
      "id": "i909jwc",
      "text": "That is a lot of desktop icons. Why so many?",
      "timestamp": "2022-05-17 23:06:20",
      "score": 1,
      "num_children": 0,
      "author": 307123,
      "replies": []
    },
    {
      "id": "i909lln",
      "text": "The mad lad unmuted themselves and lo, and behold, chaos ensued. 🤘",
      "timestamp": "2022-05-17 23:06:43",
      "score": 1,
      "num_children": 0,
      "author": 192282,
      "replies": []
    },
    {
      "id": "i909pn8",
      "text": "Did you get your question answered?",
      "timestamp": "2022-05-17 23:07:37",
      "score": 1,
      "num_children": 0,
      "author": 390522,
      "replies": []
    },
    {
      "id": "i909wcd",
      "text": "Finally, a meeting that couldn't have been an email.",
      "timestamp": "2022-05-17 23:09:07",
      "score": 1,
      "num_children": 0,
      "author": 359937,
      "replies": []
    },
    {
      "id": "i909yrs",
      "text": "Oh my lord! Pmsl...Can you get a copy! I can imagine FFS.🤣 when it rains it pours..least you didn't stand in a plug as well...!bet there was some effin n jeffin going on!",
      "timestamp": "2022-05-17 23:09:39",
      "score": 1,
      "num_children": 0,
      "author": 290717,
      "replies": []
    },
    {
      "id": "i90adp4",
      "text": "Hahahaha man that gave me a good belly laugh. Hope you’re alright!",
      "timestamp": "2022-05-17 23:12:55",
      "score": 1,
      "num_children": 0,
      "author": 4337,
      "replies": []
    },
    {
      "id": "i90b32m",
      "text": "Did any of the other meeting attendees get a screen cap of the chaos? \nMy coworkers would have been just that devious and it would have spread like wildfire through the office...",
      "timestamp": "2022-05-17 23:18:32",
      "score": 1,
      "num_children": 0,
      "author": 323284,
      "replies": []
    },
    {
      "id": "i90bh2n",
      "text": "I unmuted to make a comment the other day—cam off. And that was the exact moment my puppy chose to chase the cat and bark at her. Of course it was.",
      "timestamp": "2022-05-17 23:21:31",
      "score": 1,
      "num_children": 0,
      "author": 13505,
      "replies": []
    },
    {
      "id": "i90bjx8",
      "text": "Tl;dr explained a lot",
      "timestamp": "2022-05-17 23:22:08",
      "score": 1,
      "num_children": 0,
      "author": 82356,
      "replies": []
    },
    {
      "id": "i90c352",
      "text": "Did anyone ask if you were ok?",
      "timestamp": "2022-05-17 23:26:24",
      "score": 1,
      "num_children": 0,
      "author": 271232,
      "replies": []
    },
    {
      "id": "i90co2m",
      "text": "I hope they were recording. I want them to post the video.",
      "timestamp": "2022-05-17 23:31:04",
      "score": 1,
      "num_children": 0,
      "author": 268010,
      "replies": []
    },
    {
      "id": "i90ej76",
      "text": "I hope that the meeting was being recorded hahaha",
      "timestamp": "2022-05-17 23:46:05",
      "score": 1,
      "num_children": 0,
      "author": 8181,
      "replies": []
    },
    {
      "id": "i90etkg",
      "text": "Story verified by cats. Nice.",
      "timestamp": "2022-05-17 23:48:25",
      "score": 1,
      "num_children": 0,
      "author": 231431,
      "replies": []
    },
    {
      "id": "i90eyc0",
      "text": "F",
      "timestamp": "2022-05-17 23:49:30",
      "score": 1,
      "num_children": 0,
      "author": 363849,
      "replies": []
    },
    {
      "id": "i90f5qu",
      "text": "Could you imagine if the camera was on as well?",
      "timestamp": "2022-05-17 23:51:11",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "i90fzmy",
          "text": ">Could you imagine if the camera was on as well?\n\nCan you imagine actually reading what you're commenting on?\n\n>  realized I had been unmuted the whole time and with my video on.",
          "timestamp": "2022-05-17 23:57:59",
          "score": 1,
          "num_children": 1,
          "author": 255410,
          "replies": [
            {
              "id": "i90rw6c",
              "text": "Doh, I read that but blocked it out as they said they were sick.  Who the fuck puts their video on after being sick.",
              "timestamp": "2022-05-18 01:31:47",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i90id8u",
      "text": "I’m crying. That was amazing",
      "timestamp": "2022-05-18 00:17:16",
      "score": 1,
      "num_children": 0,
      "author": 310530,
      "replies": []
    },
    {
      "id": "i90il3f",
      "text": "LMAO…oh you just gave me a belly laugh! I needed one. You did a fabulous job at describing the scene. Love you’re own sense of humor around it. Gawd I would pay for the video 🤣",
      "timestamp": "2022-05-18 00:19:02",
      "score": 1,
      "num_children": 0,
      "author": 173830,
      "replies": []
    },
    {
      "id": "i90j2xi",
      "text": "Did you get video for r/startledcats ?",
      "timestamp": "2022-05-18 00:22:42",
      "score": 1,
      "num_children": 0,
      "author": 1561,
      "replies": []
    },
    {
      "id": "i90jfgj",
      "text": "if you call out tomorrow are they going to require a doctor‘s note?",
      "timestamp": "2022-05-18 00:25:24",
      "score": 1,
      "num_children": 0,
      "author": 391189,
      "replies": []
    },
    {
      "id": "i90jikl",
      "text": "I...kinda wanna see this video.",
      "timestamp": "2022-05-18 00:26:05",
      "score": 1,
      "num_children": 0,
      "author": 192299,
      "replies": []
    },
    {
      "id": "i90ju5m",
      "text": "This sounds like something that would happen to a modern day Chandler Bing",
      "timestamp": "2022-05-18 00:28:30",
      "score": 1,
      "num_children": 0,
      "author": 51236,
      "replies": []
    },
    {
      "id": "i90kemp",
      "text": "How big of a desk will I need to fit 2 cat beds lol",
      "timestamp": "2022-05-18 00:33:02",
      "score": 1,
      "num_children": 0,
      "author": 340408,
      "replies": []
    },
    {
      "id": "i90l8e9",
      "text": "Please record your meetings for us.",
      "timestamp": "2022-05-18 00:39:36",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i90lw17",
      "text": "I really wish I could have seen this",
      "timestamp": "2022-05-18 00:44:42",
      "score": 1,
      "num_children": 0,
      "author": 395399,
      "replies": []
    },
    {
      "id": "i90m1bm",
      "text": "please tell me the reunion was being recorded",
      "timestamp": "2022-05-18 00:45:51",
      "score": 1,
      "num_children": 0,
      "author": 166223,
      "replies": []
    },
    {
      "id": "i90pkku",
      "text": "always use the space bar to unmute",
      "timestamp": "2022-05-18 01:13:40",
      "score": 1,
      "num_children": 0,
      "author": 292895,
      "replies": []
    },
    {
      "id": "i90pocd",
      "text": "You should be a sitcom writer!",
      "timestamp": "2022-05-18 01:14:30",
      "score": 1,
      "num_children": 0,
      "author": 204642,
      "replies": []
    },
    {
      "id": "i90ptto",
      "text": "Sorry don’t mean to LoL 😂",
      "timestamp": "2022-05-18 01:15:42",
      "score": 1,
      "num_children": 0,
      "author": 266109,
      "replies": []
    },
    {
      "id": "i90q9hw",
      "text": "Haha I was expecting you to slip on a banana peel at the very end",
      "timestamp": "2022-05-18 01:19:08",
      "score": 1,
      "num_children": 0,
      "author": 390434,
      "replies": []
    },
    {
      "id": "i90qqfr",
      "text": "Overall a win, I’d say.",
      "timestamp": "2022-05-18 01:22:51",
      "score": 1,
      "num_children": 0,
      "author": 85155,
      "replies": []
    },
    {
      "id": "i90resc",
      "text": "Sound like a scene from an upcoming remake of The Office, Pandemic Edition.",
      "timestamp": "2022-05-18 01:28:04",
      "score": 1,
      "num_children": 0,
      "author": 171201,
      "replies": []
    },
    {
      "id": "i90v4ti",
      "text": "Please tell me your pants were off, too! hahaha",
      "timestamp": "2022-05-18 01:57:11",
      "score": 1,
      "num_children": 0,
      "author": 22718,
      "replies": []
    },
    {
      "id": "i90wr00",
      "text": "lol similar happened to me today. I leaned back in the chair to get something and fell flat on my ass. My cat thought the world was ending",
      "timestamp": "2022-05-18 02:10:01",
      "score": 1,
      "num_children": 0,
      "author": 402161,
      "replies": []
    },
    {
      "id": "i90wxfk",
      "text": "Sh\\*t happens, but wow, THAT was awesome... did they record it by any chance?  I'd love to see that go down... lol",
      "timestamp": "2022-05-18 02:11:27",
      "score": 1,
      "num_children": 0,
      "author": 306603,
      "replies": []
    },
    {
      "id": "i90wyyo",
      "text": "You are a fucking legend at that company forever",
      "timestamp": "2022-05-18 02:11:48",
      "score": 1,
      "num_children": 0,
      "author": 109219,
      "replies": []
    },
    {
      "id": "i90xka8",
      "text": "As another person with cough variant asthma, you have my deepest sympathy. I felt this post down in my soul. \n\nI cough because it is Tuesday, because I choked on my own spit, because I tried to drink water, and worst of all when I’m getting over a cold. (No inhaler=coughing for MONTHS.)\n\nI had a gigantic coughing fit on an airplane two weeks ago because dry air and I had allergies. Boy, that was fun for everyone! \n\nBonus points for coughing til you gag. Truly a joyous experience!",
      "timestamp": "2022-05-18 02:16:26",
      "score": 1,
      "num_children": 0,
      "author": 122260,
      "replies": []
    },
    {
      "id": "i90xm1r",
      "text": "I cant see this happening",
      "timestamp": "2022-05-18 02:16:50",
      "score": 1,
      "num_children": 0,
      "author": 337198,
      "replies": []
    },
    {
      "id": "i90yw0l",
      "text": "Dude, i laughed so hard at your pain! #sorrynotsorry",
      "timestamp": "2022-05-18 02:26:55",
      "score": 1,
      "num_children": 0,
      "author": 212178,
      "replies": []
    },
    {
      "id": "i90ze8l",
      "text": "As an asmatic I can totally sympathize and at least you didn’t shit yourself during your coughing fit…lol",
      "timestamp": "2022-05-18 02:31:03",
      "score": 1,
      "num_children": 0,
      "author": 198989,
      "replies": []
    },
    {
      "id": "i90znc4",
      "text": "I am so sorry(ish) this happened... But, fuck have you ever made me laugh! Thank you!",
      "timestamp": "2022-05-18 02:33:06",
      "score": 1,
      "num_children": 0,
      "author": 363601,
      "replies": []
    },
    {
      "id": "i9112hz",
      "text": "I laughed pretty hard at the events that transpired, but your TLDR is both accurate and non-descriptive. I had to read the whole thing to understand what happened at all.",
      "timestamp": "2022-05-18 02:44:37",
      "score": 1,
      "num_children": 0,
      "author": 225620,
      "replies": []
    },
    {
      "id": "i911jxy",
      "text": "Just woke up hubby from deep nasal laugh. And now I need my inhaler.",
      "timestamp": "2022-05-18 02:48:39",
      "score": 1,
      "num_children": 0,
      "author": 188494,
      "replies": []
    },
    {
      "id": "i911rp6",
      "text": "Nice one. Great story.",
      "timestamp": "2022-05-18 02:50:26",
      "score": 1,
      "num_children": 0,
      "author": 280984,
      "replies": []
    },
    {
      "id": "i912h7u",
      "text": "Hahahahahaha OMG! trust me, you spiced up the day for everyone",
      "timestamp": "2022-05-18 02:56:27",
      "score": 1,
      "num_children": 0,
      "author": 219951,
      "replies": []
    },
    {
      "id": "i914phr",
      "text": "I can only hope my full day of zoom meetings might end this way. Glad you’re okay.",
      "timestamp": "2022-05-18 03:15:31",
      "score": 1,
      "num_children": 0,
      "author": 92701,
      "replies": []
    },
    {
      "id": "i915rsw",
      "text": "Cue the Benny Hill music....",
      "timestamp": "2022-05-18 03:24:44",
      "score": 1,
      "num_children": 0,
      "author": 94471,
      "replies": []
    },
    {
      "id": "i915t54",
      "text": "How do ur cats dox u? Really curious on this 😂",
      "timestamp": "2022-05-18 03:25:04",
      "score": 1,
      "num_children": 0,
      "author": 140256,
      "replies": []
    },
    {
      "id": "i916cst",
      "text": "Oh hope your ok don't suppose you can record the misshap so you'll forever treassure it",
      "timestamp": "2022-05-18 03:29:58",
      "score": 1,
      "num_children": 0,
      "author": 152631,
      "replies": []
    },
    {
      "id": "i916ndz",
      "text": "I can’t even remember the last time I laughed this hard from something on the internet😂",
      "timestamp": "2022-05-18 03:32:40",
      "score": 1,
      "num_children": 0,
      "author": 119755,
      "replies": []
    },
    {
      "id": "i9178nb",
      "text": "Push to talk…",
      "timestamp": "2022-05-18 03:38:09",
      "score": 1,
      "num_children": 0,
      "author": 369710,
      "replies": []
    },
    {
      "id": "i917e83",
      "text": "So where’s the video?",
      "timestamp": "2022-05-18 03:39:37",
      "score": 1,
      "num_children": 0,
      "author": 396534,
      "replies": []
    },
    {
      "id": "i917jic",
      "text": "+50 if the video shows",
      "timestamp": "2022-05-18 03:40:57",
      "score": 1,
      "num_children": 0,
      "author": 376108,
      "replies": []
    },
    {
      "id": "i919b87",
      "text": "Here looking for the \"I was there!\" post from coworkers.. XD",
      "timestamp": "2022-05-18 03:57:45",
      "score": 1,
      "num_children": 0,
      "author": 175211,
      "replies": []
    },
    {
      "id": "i919j01",
      "text": "This made me laugh-cry.",
      "timestamp": "2022-05-18 03:59:54",
      "score": 1,
      "num_children": 0,
      "author": 251872,
      "replies": []
    },
    {
      "id": "i91afsx",
      "text": "Thanks for the laughs!  Sorry for the hurting and awkwardness!",
      "timestamp": "2022-05-18 04:08:48",
      "score": 1,
      "num_children": 0,
      "author": 303407,
      "replies": []
    },
    {
      "id": "i91d5wp",
      "text": "Welp, this is some shit I would do. So I laughed. Really hard at the age in my head. \n\nGood on you for having a sense of humor. I do hope you feel better soon and that the cats didn't destroy too much.",
      "timestamp": "2022-05-18 04:36:44",
      "score": 1,
      "num_children": 0,
      "author": 318792,
      "replies": []
    },
    {
      "id": "i91eufp",
      "text": "“Completely lost their noodles” is my favourite part of this and encapsulates cats 100% 😂 sorry about your mug 😅",
      "timestamp": "2022-05-18 04:55:11",
      "score": 1,
      "num_children": 0,
      "author": 298357,
      "replies": []
    },
    {
      "id": "i91fw69",
      "text": "Shoes off, def ded",
      "timestamp": "2022-05-18 05:07:01",
      "score": 1,
      "num_children": 0,
      "author": 53342,
      "replies": []
    },
    {
      "id": "i91g0hz",
      "text": "Your co-workers \"Hmmm do you think he died?\" \"Should someone call 911?\" \"Lets give him another minute first\" hahah",
      "timestamp": "2022-05-18 05:08:24",
      "score": 1,
      "num_children": 0,
      "author": 218047,
      "replies": []
    },
    {
      "id": "i91gkut",
      "text": "In fourth grade I began sitting in the back row of desks in our classroom. A couple of friends of mine sat there as well. We’d always lean back in our chairs, on the back two legs as teachers always tell you not to. So one day I’m leaning way back and suddenly there goes balance and I go all the way down, smacking the floor. At the same time my feet hit my desk- it didn’t knock over but the things on top went flying. I hit the ground and the classroom goes silent, my buddy looking down at me with a joyful “you’re gonna get it” face- right then, in that moment of dead silence, I unexpectedly ripped a powerful loud fart as I lay on my back with my feet in the air. With the attention of my whole class! My buddy’s face went into an even more gleeful expression as our teacher, an older Peruvian lady, said “Mr Mat-chow, desk in the hallway for the remainder of the day.” She loved me for the most part. I had to have an uncomfortable word with the school superintendent as he made his rounds and came upon me that afternoon. Ah, memories",
      "timestamp": "2022-05-18 05:15:06",
      "score": 1,
      "num_children": 0,
      "author": 400626,
      "replies": []
    },
    {
      "id": "i91hazb",
      "text": "Thank you so much for the laugh, needed that today !",
      "timestamp": "2022-05-18 05:23:35",
      "score": 1,
      "num_children": 0,
      "author": 333976,
      "replies": []
    },
    {
      "id": "i91k0xq",
      "text": "This was fucking hilarious 😂",
      "timestamp": "2022-05-18 05:57:19",
      "score": 1,
      "num_children": 0,
      "author": 229556,
      "replies": []
    },
    {
      "id": "i91l33e",
      "text": "Thanks, this made me chuckle and cheered me up, mate. Good luck going forward lol.",
      "timestamp": "2022-05-18 06:10:55",
      "score": 1,
      "num_children": 0,
      "author": 256451,
      "replies": []
    },
    {
      "id": "i91lcpj",
      "text": "This was so funny I read it 3 times. I would have paid to see this, the image in my mind killed me.",
      "timestamp": "2022-05-18 06:14:27",
      "score": 1,
      "num_children": 0,
      "author": 359270,
      "replies": []
    },
    {
      "id": "i91m0a1",
      "text": "I'm just here to ruin \"420 comments\".\n\nhttps://imgur.com/gallery/mxVAzQd",
      "timestamp": "2022-05-18 06:22:59",
      "score": 1,
      "num_children": 0,
      "author": 195357,
      "replies": []
    },
    {
      "id": "i91onop",
      "text": "🤣🤣🤣",
      "timestamp": "2022-05-18 06:59:29",
      "score": 1,
      "num_children": 0,
      "author": 78237,
      "replies": []
    },
    {
      "id": "i91qw16",
      "text": "Upvoted for the edit",
      "timestamp": "2022-05-18 07:31:43",
      "score": 1,
      "num_children": 0,
      "author": 261729,
      "replies": []
    },
    {
      "id": "i91r57p",
      "text": "that's rough but I would have loved to see that",
      "timestamp": "2022-05-18 07:35:32",
      "score": 1,
      "num_children": 0,
      "author": 290588,
      "replies": []
    },
    {
      "id": "i91rb36",
      "text": "So relatable ahah.. drop something small from desk, push chair back and stand up to pick it up, stand on it and greet Satan",
      "timestamp": "2022-05-18 07:38:01",
      "score": 1,
      "num_children": 0,
      "author": 220113,
      "replies": []
    },
    {
      "id": "i91t1pn",
      "text": "\"cats lost their noodles\" :\"\"D",
      "timestamp": "2022-05-18 08:04:23",
      "score": 1,
      "num_children": 0,
      "author": 240559,
      "replies": []
    },
    {
      "id": "i91u9xz",
      "text": "This is a TIFU for sure. But damn its a good light hearted one. Next time try not to die on the Zoom meeting Dave.",
      "timestamp": "2022-05-18 08:23:29",
      "score": 1,
      "num_children": 0,
      "author": 388656,
      "replies": []
    },
    {
      "id": "i91yn15",
      "text": "I'm so sorry to hear about your f/u. I was attracted to your story, because I too have a cough and asthma.. You're story had me laughing wheezing as I tried to read it off loud to hubby!\nI hope you get better soon - stay well! 😁",
      "timestamp": "2022-05-18 09:31:58",
      "score": 1,
      "num_children": 0,
      "author": 72242,
      "replies": []
    },
    {
      "id": "i920fqo",
      "text": "Good read OP",
      "timestamp": "2022-05-18 09:58:45",
      "score": 1,
      "num_children": 0,
      "author": 207711,
      "replies": []
    },
    {
      "id": "i92460e",
      "text": "I would watch a video of that with the song “lean back” by Fat Joe playing in the background ![gif](emote|free_emotes_pack|joy)",
      "timestamp": "2022-05-18 10:49:33",
      "score": 1,
      "num_children": 0,
      "author": 155914,
      "replies": []
    },
    {
      "id": "i9250z6",
      "text": "This is the best thing I have ever read",
      "timestamp": "2022-05-18 11:00:12",
      "score": 1,
      "num_children": 0,
      "author": 324750,
      "replies": []
    },
    {
      "id": "i9266eb",
      "text": "Tldr your tldr sucks.",
      "timestamp": "2022-05-18 11:13:33",
      "score": 1,
      "num_children": 0,
      "author": 333675,
      "replies": []
    },
    {
      "id": "i928u96",
      "text": "Better than the telephone conference I was in once, where a sales person was driving and ran off the highway into a tree. The top of the tree. \n\nAfter a few minutes of panic, we could hear him quietly ask for the fire department to help him get out of the tree. He was only mildly hurt.",
      "timestamp": "2022-05-18 11:43:05",
      "score": 1,
      "num_children": 0,
      "author": 382785,
      "replies": []
    },
    {
      "id": "i92ad1r",
      "text": "Dang m, hope your doing ok OP!",
      "timestamp": "2022-05-18 11:58:39",
      "score": 1,
      "num_children": 0,
      "author": 174040,
      "replies": []
    },
    {
      "id": "i92bwr7",
      "text": "Hilarious as long as you didn't get into trouble.",
      "timestamp": "2022-05-18 12:13:54",
      "score": 1,
      "num_children": 0,
      "author": 316297,
      "replies": []
    },
    {
      "id": "i92hufp",
      "text": "Lost my absolute shit reading this. Thank you, your misery has really made day.",
      "timestamp": "2022-05-18 13:06:53",
      "score": 1,
      "num_children": 0,
      "author": 58726,
      "replies": []
    },
    {
      "id": "i92mmpw",
      "text": "That's better then 99% of meetings I have gone to. Hope you and the cats recovered ok!",
      "timestamp": "2022-05-18 13:45:12",
      "score": 1,
      "num_children": 0,
      "author": 109417,
      "replies": []
    },
    {
      "id": "i92nt0i",
      "text": "as a fellow asthmatic i am both sympathetic and wholeheartedly amused 😂☠️",
      "timestamp": "2022-05-18 13:54:08",
      "score": 1,
      "num_children": 0,
      "author": 243435,
      "replies": []
    },
    {
      "id": "i92odgi",
      "text": "Oh gads, thanks for the laugh!",
      "timestamp": "2022-05-18 13:58:30",
      "score": 1,
      "num_children": 0,
      "author": 56143,
      "replies": []
    },
    {
      "id": "i92pf0o",
      "text": "The choas of this all is truly amazingly hilarious",
      "timestamp": "2022-05-18 14:06:20",
      "score": 1,
      "num_children": 0,
      "author": 66139,
      "replies": []
    },
    {
      "id": "i95oq3m",
      "text": "Sounds like this was pulled out of a sitcom. Rip.",
      "timestamp": "2022-05-19 02:58:03",
      "score": 1,
      "num_children": 0,
      "author": 119717,
      "replies": []
    },
    {
      "id": "i906o87",
      "text": "I'm sorry, but why are you raising pet cats if you have asthma ?",
      "timestamp": "2022-05-17 22:43:45",
      "score": -15,
      "num_children": 1,
      "author": 332360,
      "replies": [
        {
          "id": "i90jcte",
          "text": "Because r/cats are fucking awesome.",
          "timestamp": "2022-05-18 00:24:50",
          "score": 3,
          "num_children": 1,
          "author": 1561,
          "replies": [
            {
              "id": "i92wanl",
              "text": "Ofc they are awesome. I was just concerned because cats trigger my friend's asthma like anything. Not that everyone with asthma are averse to cats, OP's probably lucky to have pets around while many of them unfortunately can't.",
              "timestamp": "2022-05-18 14:55:54",
              "score": 2,
              "num_children": 0,
              "author": 332360,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i909jll",
      "text": "Out of all the tifu posts, this is the one I can actually believe might have possibly happened lmao\n\nSound like the most neckbeard shit",
      "timestamp": "2022-05-17 23:06:16",
      "score": -5,
      "num_children": 0,
      "author": 23868,
      "replies": []
    },
    {
      "id": "i8zf5r7",
      "text": "[deleted]",
      "timestamp": "2022-05-17 19:27:32",
      "score": -1,
      "num_children": 1,
      "replies": [
        {
          "id": "i905qh5",
          "text": "Dude unmutes and falls backwards breaking his chair",
          "timestamp": "2022-05-17 22:36:32",
          "score": 1,
          "num_children": 0,
          "author": 390160,
          "replies": []
        }
      ]
    },
    {
      "id": "i92dqz4",
      "text": "TLDR: OP leaned into their chair breaking it. Falling ass first unto the ground, having an asthma attack while their cat knocked their shit off the desk all the while innocent zoom bystanders watch in horror.",
      "timestamp": "2022-05-18 12:31:04",
      "score": -1,
      "num_children": 0,
      "author": 256135,
      "replies": []
    },
    {
      "id": "i92bpo9",
      "text": "Dude, minus points for unmuting yourself to put on a \"look at how smart I look\" show INSTEAD of asking your question. Next time just ask your damn question without the amateur theater. If you need your coworkers to think you're smart, let your question be intelligent enough to offer that impression. \n\nI wish the universe would smack people upside the head like that more often.",
      "timestamp": "2022-05-18 12:12:01",
      "score": 0,
      "num_children": 0,
      "author": 60992,
      "replies": []
    }
  ]
}