{
  "id": "ut4hkc",
  "text": "Scratches head, well uhm, well I just don’t know anymore.\n",
  "timestamp": "2022-05-19 14:20:16",
  "score": 5565,
  "subreddit": "t5_3fdcn",
  "num_children": 40,
  "author": 120825,
  "replies": [
    {
      "id": "i97pm70",
      "text": "Man the conservative side of Reddit is alive with people thinking democrats are pure evil…",
      "timestamp": "2022-05-19 15:40:43",
      "score": 337,
      "num_children": 4,
      "replies": [
        {
          "id": "i97pww2",
          "text": "There's really no hope for Republicans and conservatives at this point. They are so far up their own assholes they don't even know what's real anymore.",
          "timestamp": "2022-05-19 15:42:41",
          "score": 258,
          "num_children": 6,
          "author": 169109,
          "replies": [
            {
              "id": "i97q6sf",
              "text": "Yea I admit I’ve been following their side to know thy enemy and yea it is really a full buy in on alternate facts. All the sources are newmax or worse and you have to know things from before to make sense of what they are saying now. It is definitely a cult.",
              "timestamp": "2022-05-19 15:44:33",
              "score": 131,
              "num_children": 3,
              "replies": [
                {
                  "id": "i980thc",
                  "text": "To me it's just a simple strategy. Oppose ANTYHING the other side supports. Regardless if it causes cognitive dissonance.",
                  "timestamp": "2022-05-19 16:55:40",
                  "score": 75,
                  "num_children": 2,
                  "author": 31888,
                  "replies": [
                    {
                      "id": "i99f0cb",
                      "text": "Ironically, this is the side that refers to themselves as \"free thinkers.\"",
                      "timestamp": "2022-05-19 23:04:48",
                      "score": 20,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i99gsr9",
                          "text": "If you look in a mirror and say \"I'm good looking\" it doesn't make you good looking. \n\nIt makes you conceited.",
                          "timestamp": "2022-05-19 23:19:56",
                          "score": 9,
                          "num_children": 1,
                          "author": 31888,
                          "replies": [
                            {
                              "id": "i9an157",
                              "text": "Hey man that was the only thing that kept me going \n:(",
                              "timestamp": "2022-05-20 05:42:43",
                              "score": 8,
                              "num_children": 1,
                              "author": 157329,
                              "replies": [
                                {
                                  "id": "i9aqrne",
                                  "text": "You're good looking!  There, now someone else told you that.",
                                  "timestamp": "2022-05-20 06:29:50",
                                  "score": 6,
                                  "num_children": 1,
                                  "author": 147585,
                                  "replies": [
                                    {
                                      "id": "i9ash9i",
                                      "text": "Thank you King / Queen!",
                                      "timestamp": "2022-05-20 06:52:36",
                                      "score": 4,
                                      "num_children": 0,
                                      "author": 157329,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i99tzfn",
                      "text": "[deleted]",
                      "timestamp": "2022-05-20 01:11:04",
                      "score": 8,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i99y30j",
                          "text": "I believe that to be the case. Loyalty to their cause no matter how many lives it cost. \n\nMy family lost two to this insanity.",
                          "timestamp": "2022-05-20 01:44:15",
                          "score": 5,
                          "num_children": 0,
                          "author": 31888,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i985bp9",
                  "text": "I always find it irritating when people use that term when there is almost nothing factual about their claims.  They just made up another term for lying, threw in the word “fact,” and for some reason, we just went along with it.",
                  "timestamp": "2022-05-19 17:25:45",
                  "score": 20,
                  "num_children": 1,
                  "author": 363611,
                  "replies": [
                    {
                      "id": "i98fg4v",
                      "text": "Kellyanne Conway invented the term \"alternative facts\" while blatantly lying one day. It's used synonymously with lying, and (so far) is not meant to imply any actual credence.",
                      "timestamp": "2022-05-19 18:34:21",
                      "score": 27,
                      "num_children": 1,
                      "author": 192640,
                      "replies": [
                        {
                          "id": "i98ojt9",
                          "text": "Correct.  To normal people who can use critical reasoning, it’s another term for lying. \n\nTo other people, it implies that there are two different realities, and that it’s okay to accept a reality that isn’t factually based.  It can be confusing and serves no purpose other than to muddy the waters.  \n\nLying is lying.  We don’t need to make up other terms for it.",
                          "timestamp": "2022-05-19 19:36:12",
                          "score": 17,
                          "num_children": 0,
                          "author": 363611,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i99673n",
                  "text": "It’s the classic us vs them stand point.  No matter what, you have to hate democrats and own the libs.  They’ve been brainwashed by Russian talking points.",
                  "timestamp": "2022-05-19 21:54:44",
                  "score": 5,
                  "num_children": 0,
                  "author": 297729,
                  "replies": []
                }
              ]
            },
            {
              "id": "i97t56j",
              "text": "And if you try to have a dialogue, you earn a permanent ban if you quote sources and facts that don’t conform to their preferred narrative. The conservative subs are becoming hollow brittle echo chambers. It’s bad. (Same thing is happening on some “left” subs that are captured by Russian troll farms, and won’t tolerate criticism of the Russian invasion of Ukraine) Reddit has a metastatic cancer.",
              "timestamp": "2022-05-19 16:04:20",
              "score": 43,
              "num_children": 2,
              "author": 15607,
              "replies": [
                {
                  "id": "i97wdwq",
                  "text": "Yea I am banned for no real reason other than I am not an asshole. Which is unfortunate because I was actually curious about engaging and seeing if they could make sense. But I got banned after my first question…",
                  "timestamp": "2022-05-19 16:26:07",
                  "score": 19,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i9880l1",
                      "text": "I got banned from Trumpvirus and the anti-Nazi sub for not backing anything and everything Sleepy Joe does and says. No bashing took place. Apparently questioning and not being mindlessly 100% on board doesn’t cut it anymore…",
                      "timestamp": "2022-05-19 17:43:46",
                      "score": -35,
                      "num_children": 2,
                      "author": 120084,
                      "replies": [
                        {
                          "id": "i997haq",
                          "text": "Maybe it's less 'valid criticism' and more 'saying dumb shit like \"Sleepy Joe\" ' that got you booted, hmm?",
                          "timestamp": "2022-05-19 22:04:32",
                          "score": 20,
                          "num_children": 0,
                          "author": 152315,
                          "replies": []
                        },
                        {
                          "id": "i9a2q9w",
                          "text": "Sorry, but people who have legitimate criticisms of Joe Biden don't call him \"Sleepy Joe\" like a child on the playground. Those are mutually exclusive",
                          "timestamp": "2022-05-20 02:22:19",
                          "score": 12,
                          "num_children": 0,
                          "author": 192458,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i98hv7b",
                  "text": "I wonder if it's just how Reddit is set up or just how we are set up. *Sad cowboy*",
                  "timestamp": "2022-05-19 18:50:49",
                  "score": 6,
                  "num_children": 1,
                  "author": 313118,
                  "replies": [
                    {
                      "id": "i98js4j",
                      "text": "We are wired to like the familiar. A familiar tune or meal will light up parts of the brain and make happy dopamine chemicals. It doesn’t need to be particularly good as evidenced by some pop hits and fast food places, the product isn’t great, but it’s consistent and will elicit happy brain chemicals for being familiar. \n\nDo we like intellectual bubbles where everyone only sings the hits in the same way? The narratives and interpretations of the world that we already know make our brains light up, happy with the familiar, even when it’s incoherent bullshit?",
                      "timestamp": "2022-05-19 19:03:48",
                      "score": 5,
                      "num_children": 0,
                      "author": 15607,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i98kc50",
              "text": ">There's really no hope for Republicans and conservatives at this point.\n\nNo hope for US seeing them improve, that's correct...\n\nBut also from a republican standpoint their prospects for the future are dim... and they all point toward totalitarian fascism.",
              "timestamp": "2022-05-19 19:07:36",
              "score": 6,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i980m65",
              "text": "I think there's hope for conservatives who cling to what the base principles of that ideology (or the past definitions) mean. \n\nFor those conservatives who are just playing the binary (you lose I win) philosophy, then I agree completely.",
              "timestamp": "2022-05-19 16:54:19",
              "score": 5,
              "num_children": 1,
              "author": 31888,
              "replies": [
                {
                  "id": "i9b6f7a",
                  "text": "> conservatives who cling to what the base principles of that ideology\n\nBase principle has always been bad.\n\nThere might be hope for folks who got pulled in by dogwhistles who didn't realise what they were really saying though.",
                  "timestamp": "2022-05-20 10:09:23",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "i98vuto",
              "text": "That’s how propaganda works unfortunately",
              "timestamp": "2022-05-19 20:34:34",
              "score": 3,
              "num_children": 0,
              "author": 160305,
              "replies": []
            },
            {
              "id": "i9a4oxv",
              "text": "It's not about not knowing. It's about not caring. Lots of them *know*.",
              "timestamp": "2022-05-20 02:38:38",
              "score": 3,
              "num_children": 0,
              "author": 215411,
              "replies": []
            }
          ]
        },
        {
          "id": "i995i2t",
          "text": "That's what happens you have two functioning brain cells fighting each other for third place.",
          "timestamp": "2022-05-19 21:49:29",
          "score": 8,
          "num_children": 0,
          "author": 86101,
          "replies": []
        },
        {
          "id": "i9a4mjh",
          "text": "Please remember that they say wrong things on purpose, and that the hypocrisy is intentional and proudly performed.",
          "timestamp": "2022-05-20 02:38:05",
          "score": 6,
          "num_children": 0,
          "author": 215411,
          "replies": []
        },
        {
          "id": "i999n25",
          "text": ">thinking\n\nYou give them way too much credit.",
          "timestamp": "2022-05-19 22:21:19",
          "score": 4,
          "num_children": 0,
          "author": 367111,
          "replies": []
        }
      ]
    },
    {
      "id": "i97nkx0",
      "text": "Do these self proclaimed pro-lifers realize that babies died from contaminated formula and the laziness and mismanagement by the company in charge of production is why we are in this position in the first place?",
      "timestamp": "2022-05-19 15:26:52",
      "score": 100,
      "num_children": 2,
      "author": 328367,
      "replies": [
        {
          "id": "i97x4o5",
          "text": "Bold of you to assume they care about babies after they are born.",
          "timestamp": "2022-05-19 16:31:04",
          "score": 46,
          "num_children": 1,
          "replies": [
            {
              "id": "i98v270",
              "text": "As if they cared about them before they are born. All they care about is punishing women for enjoying their sexuality.",
              "timestamp": "2022-05-19 20:20:52",
              "score": 23,
              "num_children": 1,
              "replies": [
                {
                  "id": "i9a98r3",
                  "text": "No, they're also on board with punishing babies for *being born*.  This formula stuff right here is an example of that. 😒",
                  "timestamp": "2022-05-20 03:18:07",
                  "score": 6,
                  "num_children": 0,
                  "author": 354546,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i97p8if",
          "text": "Don't you know that \"regulations\" are the contaminant they found in the formula? Get rid of the regulations and everything's okay, because all problems go away once you stop looking for them!",
          "timestamp": "2022-05-19 15:38:09",
          "score": 59,
          "num_children": 2,
          "author": 16961,
          "replies": [
            {
              "id": "i97w7kx",
              "text": "Like when the last president said that the COVID numbers would go down if we just stop with that pesky testing.",
              "timestamp": "2022-05-19 16:24:57",
              "score": 40,
              "num_children": 1,
              "author": 149098,
              "replies": [
                {
                  "id": "i9b6h8y",
                  "text": "Technically true, in the worst possible way.",
                  "timestamp": "2022-05-20 10:10:12",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "i98ve2e",
              "text": "After the first kid dies the parents will simply vote with their wallet and buy another brand of formula contaminated at the same facility. The free market works!",
              "timestamp": "2022-05-19 20:23:13",
              "score": 14,
              "num_children": 0,
              "author": 16999,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i97h746",
      "text": "This makes perfect sense. Their constituency is not going to look any further than what they're told, so they can live in both worlds and still benefit from both worlds.\n\nThey're Schrodinger's political party.",
      "timestamp": "2022-05-19 14:42:31",
      "score": 172,
      "num_children": 2,
      "author": 47950,
      "replies": [
        {
          "id": "i97p0ys",
          "text": "Yeah, they need these problems or else their base wouldn’t have any other reason to keep voting for them.",
          "timestamp": "2022-05-19 15:36:43",
          "score": 35,
          "num_children": 1,
          "author": 1012,
          "replies": [
            {
              "id": "i98j4py",
              "text": "Totally. It’s not like they have any actual ideas to fix anything. They don’t even talk about policy anymore. It’s 24/7 culture wars.",
              "timestamp": "2022-05-19 18:59:21",
              "score": 14,
              "num_children": 0,
              "author": 371927,
              "replies": []
            }
          ]
        },
        {
          "id": "i98frng",
          "text": "Yep, taking points went out and are spreading on reddit.\n\nHere's the big one I've heard:\n\"The FDA has a 6+ billion dollar budget, this is a ridiculous feel good bill that will do NOTHING to help the shortage, everyone should have voted no.\"\n\nOf course if it cost more they'd say its too expensive. But I'd argue if it's pennies and could save even some lives, seems like no brainer for\" pro-life\" people. \n\nThe other angle is that the FDA is incompetent so it's throwing good money after bad. If you see this taking point, quote this part of the bill:\n>the Commissioner of Food and Drugs shall report to the Committees on Appropriations of the House of Representatives and the Senate on a weekly basis on obligations of funding under this heading in this Act to address the shortage of infant formula and certain medical foods in the United States. \n\nRepublicans didn't just vote against additional funding for the FDA but also additional oversight.",
          "timestamp": "2022-05-19 18:36:32",
          "score": 19,
          "num_children": 0,
          "author": 195555,
          "replies": []
        }
      ]
    },
    {
      "id": "i97lrib",
      "text": "The only thing consistent about republicans it's their inconsistency",
      "timestamp": "2022-05-19 15:14:20",
      "score": 48,
      "num_children": 2,
      "author": 373543,
      "replies": [
        {
          "id": "i97mumg",
          "text": "You misspelled hypocrisy.",
          "timestamp": "2022-05-19 15:21:51",
          "score": 32,
          "num_children": 2,
          "author": 178008,
          "replies": [
            {
              "id": "i9978ob",
              "text": "You misspelled cruelty.",
              "timestamp": "2022-05-19 22:02:41",
              "score": 8,
              "num_children": 1,
              "author": 337568,
              "replies": [
                {
                  "id": "i99lejl",
                  "text": "hypruelty?",
                  "timestamp": "2022-05-19 23:58:59",
                  "score": 1,
                  "num_children": 0,
                  "author": 178008,
                  "replies": []
                }
              ]
            },
            {
              "id": "i98csz4",
              "text": "That too",
              "timestamp": "2022-05-19 18:16:15",
              "score": 2,
              "num_children": 0,
              "author": 373543,
              "replies": []
            }
          ]
        },
        {
          "id": "i999qcl",
          "text": "and the odor",
          "timestamp": "2022-05-19 22:22:01",
          "score": 2,
          "num_children": 0,
          "author": 367111,
          "replies": []
        }
      ]
    },
    {
      "id": "i97kndw",
      "text": "gop: \"if there's access to baby formula, then we wouldn't be able to complain about a shortage, so we have to block access to it, so we can still have something to complain about\"",
      "timestamp": "2022-05-19 15:06:34",
      "score": 92,
      "num_children": 5,
      "author": 11182,
      "replies": [
        {
          "id": "i97voyc",
          "text": "Every. Single. Issue.",
          "timestamp": "2022-05-19 16:21:31",
          "score": 34,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i97wdpt",
          "text": "All they have to do is make something up to complain about and their base will believe it though.",
          "timestamp": "2022-05-19 16:26:04",
          "score": 14,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i982smb",
          "text": "Hey Americans, you guys familiar with the French Revolution? You should be, it was inspired by your own revolution of the wanks vs yanks. Y'all should complete that cute little circle.",
          "timestamp": "2022-05-19 17:08:52",
          "score": 12,
          "num_children": 0,
          "author": 110149,
          "replies": []
        },
        {
          "id": "i99rnwk",
          "text": "It's called starving the beast. Defund and cripple the government so that it can't adequately meet the public's needs, then turn around and use that ineffectiveness to \"prove\" why government programs don't work and justify privatization.",
          "timestamp": "2022-05-20 00:51:55",
          "score": 8,
          "num_children": 0,
          "author": 252676,
          "replies": []
        },
        {
          "id": "i99hn0m",
          "text": "How are they justifying voting no on this bill? Genuinely asking.",
          "timestamp": "2022-05-19 23:27:01",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "i9a9fpe",
              "text": "They don't have to justify it.  Qult45 will cheer them on no matter what they do.",
              "timestamp": "2022-05-20 03:19:53",
              "score": 3,
              "num_children": 0,
              "author": 354546,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i97pmku",
      "text": "The dumbest people on Earth",
      "timestamp": "2022-05-19 15:40:47",
      "score": 28,
      "num_children": 2,
      "author": 13532,
      "replies": [
        {
          "id": "i97rodd",
          "text": "As somebody else said, the only thing they’re consistent with is inconsistency, cruelty, hypocrisy, and stupidity…. projection too",
          "timestamp": "2022-05-19 15:54:27",
          "score": 20,
          "num_children": 0,
          "author": 10827,
          "replies": []
        },
        {
          "id": "i989obu",
          "text": "They exactly know what they're doing. No one from their electorate will wonder if they were doing something because Biden should do something! Fox will tell them all day it's all to blame on Democrats.",
          "timestamp": "2022-05-19 17:54:51",
          "score": 6,
          "num_children": 0,
          "author": 188884,
          "replies": []
        }
      ]
    },
    {
      "id": "i97m7ka",
      "text": "Republican politics only work if they have someone else to blame for everything that's going wrong.",
      "timestamp": "2022-05-19 15:17:29",
      "score": 21,
      "num_children": 0,
      "author": 154171,
      "replies": []
    },
    {
      "id": "i97vaem",
      "text": "Remember, you gotta \"own the libs!\" By any means necessary even when I doesn't make sense in doing so.",
      "timestamp": "2022-05-19 16:18:51",
      "score": 15,
      "num_children": 2,
      "author": 330390,
      "replies": [
        {
          "id": "i983qb4",
          "text": "But, it makes perfect sense.  Remember how they kept accusing the Obama admin of living by the motto of \"never let a crisis go to waste?\"  They were, once again, telegraphing their own philosophy.\n\nSo, they establish that the baby-killer Democrats are responsible for the formula shortage, then prolong it so that it does as much damage as possible.  The party of pro-life wins big in 2022!  Magnifique!",
          "timestamp": "2022-05-19 17:15:10",
          "score": 8,
          "num_children": 1,
          "author": 319784,
          "replies": [
            {
              "id": "i991y76",
              "text": "Right",
              "timestamp": "2022-05-19 21:22:28",
              "score": 1,
              "num_children": 0,
              "author": 330390,
              "replies": []
            }
          ]
        },
        {
          "id": "i97vpql",
          "text": "Truth.",
          "timestamp": "2022-05-19 16:21:39",
          "score": 2,
          "num_children": 0,
          "author": 120825,
          "replies": []
        }
      ]
    },
    {
      "id": "i97inn6",
      "text": "Not governance. Only obstruction.",
      "timestamp": "2022-05-19 14:52:39",
      "score": 39,
      "num_children": 1,
      "author": 237742,
      "replies": [
        {
          "id": "i98cch6",
          "text": "They need to break the governments so they can “prove” it’s broken to privatize everything.",
          "timestamp": "2022-05-19 18:13:06",
          "score": 7,
          "num_children": 0,
          "author": 307989,
          "replies": []
        }
      ]
    },
    {
      "id": "i97p490",
      "text": "Because of course they did. If they didn't stand for hypocrisy, they wouldn't have a leg to stand on.",
      "timestamp": "2022-05-19 15:37:20",
      "score": 11,
      "num_children": 0,
      "author": 13855,
      "replies": []
    },
    {
      "id": "i99jj9l",
      "text": "In case you haven't noticed, they've been doing this for decades. Obama was blamed for the economic crash which started in 2007. He was blamed for the war on terror, which was started by the republicans. He was blamed for the troubles in Iraq and Afghanistan, both started by republicans. He was blamed for the sudden withdrawal from Iraq, which created a power vacuum, that was signed by Bush. Biden was blamed for the pandemic casualties already in March 2021. Biden was blamed for a sudden and chaotic withdrawal from Afghanistan, that was signed by Trump.\n\nRepublicans do things they know will hurt people and the US, so that they can win elections and stuff their pockets while blaming it on the democrats. They've been doing this for many decades.",
      "timestamp": "2022-05-19 23:43:01",
      "score": 11,
      "num_children": 1,
      "author": 377260,
      "replies": [
        {
          "id": "i9bmz0z",
          "text": "You’re right, seems every Democratic President is always cleaning up a Republicans mess, and in doing so the Republicans try snd block every move to fix it.",
          "timestamp": "2022-05-20 12:52:52",
          "score": 2,
          "num_children": 0,
          "author": 120825,
          "replies": []
        }
      ]
    },
    {
      "id": "i97ea18",
      "text": "191 no votes in the House  and 9 no votes in the Senate",
      "timestamp": "2022-05-19 14:21:32",
      "score": 27,
      "num_children": 0,
      "author": 120825,
      "replies": []
    },
    {
      "id": "i98i1un",
      "text": "But imagine how the Republican media will report this.  They will spin it to blame dems...I've heard it a million times.  Then their Bernie Bro allies will repeat it.  Moderate dems will soon believe it's weak dems who caused it.  That's how it always goes.",
      "timestamp": "2022-05-19 18:52:03",
      "score": 6,
      "num_children": 0,
      "author": 278325,
      "replies": []
    },
    {
      "id": "i98l73a",
      "text": "The “pro-life” party that will literally let babies starve so they can manipulate their base into thinking Dems are the cause of supply chain issues.",
      "timestamp": "2022-05-19 19:13:25",
      "score": 8,
      "num_children": 0,
      "author": 378938,
      "replies": []
    },
    {
      "id": "i98mpre",
      "text": "This has been, like, THE Republican strategy for the last 50 years, not as if it's anything new. Fuck up the US and blame the Democrats for everything you did wrong. Cut taxes for the rich, hand out gigantic bailouts to infeasible businesses who just so happened to fund your campaign last year, skyrocket the national debt and then blame the Dems for it. Cut welfare and workers' rights, block affordable housing, then blame the Dems for the homeless.",
      "timestamp": "2022-05-19 19:23:36",
      "score": 7,
      "num_children": 0,
      "author": 305114,
      "replies": []
    },
    {
      "id": "i97ie2s",
      "text": "I am Jack's complete lack of surprise.",
      "timestamp": "2022-05-19 14:50:51",
      "score": 18,
      "num_children": 1,
      "author": 168282,
      "replies": [
        {
          "id": "i97s4u5",
          "text": "I am Jack’s raging bile duct.",
          "timestamp": "2022-05-19 15:57:35",
          "score": 8,
          "num_children": 0,
          "author": 167600,
          "replies": []
        }
      ]
    },
    {
      "id": "i98djd5",
      "text": "Blaming others for problems they contributed to? Sounds Republican to me.",
      "timestamp": "2022-05-19 18:21:16",
      "score": 6,
      "num_children": 0,
      "author": 10078,
      "replies": []
    },
    {
      "id": "i982ffe",
      "text": "Because their goal is not to govern and help people, but make things worse and blame democrats.",
      "timestamp": "2022-05-19 17:06:24",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i98app3",
      "text": "Makes sense. You have these people who are always thinking everything's a conspiracy and that you can't trust anything, especially the news.  Yet they watch Fox News and believe everything they say.  Fox News is smart enough to know this so they keep pushing and pushing and pushing boundaries and these people keep eating it all up.  r/conspiracy seems to be about 75-80% conservative.  They don't fucking believe anything you tell them.... but boy do they trust Tucker Carlson.",
      "timestamp": "2022-05-19 18:01:54",
      "score": 5,
      "num_children": 0,
      "author": 340119,
      "replies": []
    },
    {
      "id": "i98cqf4",
      "text": "Same story with gas prices.  Actually that's way worse because it will be successfully blocked",
      "timestamp": "2022-05-19 18:15:45",
      "score": 5,
      "num_children": 1,
      "author": 34076,
      "replies": [
        {
          "id": "i99efq4",
          "text": "Oil companies post record breaking 4quarter profits and the prices go up, again Republicans using it for political value while we suffer, do it by executive order if that’s possible.",
          "timestamp": "2022-05-19 23:00:07",
          "score": 3,
          "num_children": 0,
          "author": 120825,
          "replies": []
        }
      ]
    },
    {
      "id": "i97zih3",
      "text": "\"That cake right there? I wanna eat it. No, wait. I just want to keep it. Actually, I want  to devour it. No, save it.  No, I'll gulp it down.",
      "timestamp": "2022-05-19 16:46:59",
      "score": 4,
      "num_children": 0,
      "author": 252900,
      "replies": []
    },
    {
      "id": "i9859cn",
      "text": "The create and then complain about the problem. Republicans are dragging America down and rolling it back decades",
      "timestamp": "2022-05-19 17:25:19",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i98av8o",
      "text": "They just love really leaning into problems and never allowing government to provide any solution so that they can talk about how incompetent government is.\n\nRepublican government is definitely very incompetent.",
      "timestamp": "2022-05-19 18:02:57",
      "score": 4,
      "num_children": 0,
      "author": 166101,
      "replies": []
    },
    {
      "id": "i98ivp1",
      "text": "They need to keep these crisises continuing, it's the only way they're going to get votes for the midterms.",
      "timestamp": "2022-05-19 18:57:41",
      "score": 4,
      "num_children": 0,
      "author": 332952,
      "replies": []
    },
    {
      "id": "i98sg6q",
      "text": "Proving once again that they don't give a shit about actual babies, just the political power of hypothetical babies.\n\nedit: meanwhile, real babies on the altar to be sacrificed to the likes of our modern GOP.",
      "timestamp": "2022-05-19 20:02:55",
      "score": 5,
      "num_children": 1,
      "author": 121177,
      "replies": [
        {
          "id": "i99e4an",
          "text": "That it’s nothing but political football, instead of working together to show the country we’re here to help you in a crisis it’s just a Fuck your blame the Dems.",
          "timestamp": "2022-05-19 22:57:27",
          "score": 2,
          "num_children": 0,
          "author": 120825,
          "replies": []
        }
      ]
    },
    {
      "id": "i98vtm6",
      "text": "*Breaks system. Blames other party for breaking system.*",
      "timestamp": "2022-05-19 20:34:02",
      "score": 3,
      "num_children": 0,
      "author": 160305,
      "replies": []
    },
    {
      "id": "i98mwbz",
      "text": "Fucking evil bastards.",
      "timestamp": "2022-05-19 19:24:50",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9b29o5",
      "text": "An important part of conservative/reactionary propaganda is blaming Democrats for things the Republicans are responsible for making happen.",
      "timestamp": "2022-05-20 09:14:54",
      "score": 2,
      "num_children": 0,
      "author": 281001,
      "replies": []
    },
    {
      "id": "i9biizy",
      "text": "And their voters will only pay attention to the press conference and casually forget that the people they elected won't even do the most basic, bare minimum to improve their lives and will actively vote against things that will improve their lives.",
      "timestamp": "2022-05-20 12:16:10",
      "score": 2,
      "num_children": 0,
      "author": 116418,
      "replies": []
    },
    {
      "id": "i995ut2",
      "text": "They do love their victim card",
      "timestamp": "2022-05-19 21:52:05",
      "score": 1,
      "num_children": 0,
      "author": 297729,
      "replies": []
    },
    {
      "id": "i999kot",
      "text": "Because they’re disingenuous knobs, and they can count on their constituency to be, without exception, slack jawed yokels.",
      "timestamp": "2022-05-19 22:20:49",
      "score": 1,
      "num_children": 0,
      "author": 367111,
      "replies": []
    },
    {
      "id": "i99mlqo",
      "text": "Wow, USA politics is getting more ridiculous by the day...",
      "timestamp": "2022-05-20 00:09:09",
      "score": 1,
      "num_children": 0,
      "author": 58259,
      "replies": []
    },
    {
      "id": "i99ybmo",
      "text": "This mentality if disagreeing with someone because you didn't think of it is so fucking stupid.",
      "timestamp": "2022-05-20 01:46:11",
      "score": 1,
      "num_children": 0,
      "author": 191744,
      "replies": []
    },
    {
      "id": "i9ahv1m",
      "text": "Doesn't matter. They're a captive audience. There are no real consequences for anything a republican politician can ever say or do, because their voters won't accept sources of information other than their leader's.\n\nIt is a cult.",
      "timestamp": "2022-05-20 04:43:03",
      "score": 1,
      "num_children": 0,
      "author": 96457,
      "replies": []
    },
    {
      "id": "i9ai23m",
      "text": "I wish we could get away with shit like this but our voters watch more than one tv channel",
      "timestamp": "2022-05-20 04:45:10",
      "score": 1,
      "num_children": 0,
      "author": 62836,
      "replies": []
    },
    {
      "id": "i9apj45",
      "text": "So sick of these useless moochers with no scruples.",
      "timestamp": "2022-05-20 06:13:51",
      "score": 1,
      "num_children": 0,
      "author": 154797,
      "replies": []
    },
    {
      "id": "i9ex65u",
      "text": "Which bill?",
      "timestamp": "2022-05-21 04:08:51",
      "score": 1,
      "num_children": 1,
      "author": 326316,
      "replies": [
        {
          "id": "i9g9akk",
          "text": "https://www.newsweek.com/full-list-house-republicans-voted-against-fda-baby-formula-bill-1708036\n\nhttps://www.msn.com/en-us/news/politics/these-nine-republicans-voted-against-expanding-access-to-baby-formula/ar-AAXsrsF",
          "timestamp": "2022-05-21 14:10:18",
          "score": 1,
          "num_children": 0,
          "author": 120825,
          "replies": []
        }
      ]
    },
    {
      "id": "i98btiz",
      "text": "I hate both parties: wings of same bird poop from same hole….\n\n414 voted to expand the rights of mothers whom receive WIC benefits…. The second bill you are referring too: allocated 28 million to the FDA to police this…. & people say it’s about ordering baby formula… if the 28 million was allotted for formula only & at the current code of $40 = 28 mil would buy 700 k of formula units…. Why are we celebrating giving agencies money & wasteful spending…. We increased WIC with a very partisan vote…. \n\nThe Republican bill wanted to police the fda & fix the issue from happening again.. but what is really going on & I turn to Hollywood for this:\n\nWho remembers deep impact (asteroid movie) & why the governments were hoarding boost/ensure nutritional drinks?\n Isn’t ironic - don’t you think?",
      "timestamp": "2022-05-19 18:09:29",
      "score": -20,
      "num_children": 3,
      "author": 209583,
      "replies": [
        {
          "id": "i997e5x",
          "text": "Basing real life from a terrible movie. Brilliant.",
          "timestamp": "2022-05-19 22:03:52",
          "score": 10,
          "num_children": 1,
          "replies": [
            {
              "id": "i998zgr",
              "text": "Isn’t Hollywood the proxy machine",
              "timestamp": "2022-05-19 22:16:11",
              "score": -10,
              "num_children": 2,
              "author": 209583,
              "replies": [
                {
                  "id": "i99gwg3",
                  "text": "No.  That phrase is nonsense.",
                  "timestamp": "2022-05-19 23:20:45",
                  "score": 9,
                  "num_children": 0,
                  "author": 52466,
                  "replies": []
                },
                {
                  "id": "i9bcm3t",
                  "text": "You're literally not saying anything. You base your world view off the easiest thing that makes sense to you. Try harder.",
                  "timestamp": "2022-05-20 11:21:39",
                  "score": 2,
                  "num_children": 0,
                  "author": 78249,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i99eysi",
          "text": "Police the FDA, fix the issues, Republicans fix issues which the can gain political points, won’t happen, they like it this way, even if they got the oversight they wouldn’t do anything, maybe lip service.",
          "timestamp": "2022-05-19 23:04:28",
          "score": 5,
          "num_children": 1,
          "author": 120825,
          "replies": [
            {
              "id": "i99xvc6",
              "text": "Agreed… it’s like Medusa scratching her own back…",
              "timestamp": "2022-05-20 01:42:32",
              "score": 0,
              "num_children": 0,
              "author": 209583,
              "replies": []
            }
          ]
        },
        {
          "id": "i9b6txr",
          "text": "> I hate both parties: wings of same bird poop from same hole….\n\nSo both parties have attempted literal coups when they lost elections?",
          "timestamp": "2022-05-20 10:15:01",
          "score": 5,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i98wdww",
      "text": "[conservatives, everyone.](https://i.imgur.com/0ynmrGj.png)",
      "timestamp": "2022-05-19 20:40:02",
      "score": 0,
      "num_children": 0,
      "author": 123069,
      "replies": []
    },
    {
      "id": "i9b5s8r",
      "text": "Can't complain about something if we let you fix it",
      "timestamp": "2022-05-20 10:00:37",
      "score": 0,
      "num_children": 0,
      "author": 51074,
      "replies": []
    }
  ]
}