{
  "id": "ut7dvr",
  "text": "My money worshipping evangelical grandparents ran a puppy mill from their barn and it showed me how much evangelical Christians value money over life.\nMy dad’s parents were both mega church attending evangelical Christians.  They owned a construction business and we’re decently successful so they always made a big show of their ‘generosity’ by donating some new addition for the church or traveling to some other country to build a school or church (it had to have their name or company name on it or associated with it).  They were always involved in church activities and constantly put down anyone they didn’t think was Christian enough.  Their gossip about others was nasty and mean so I had never viewed them as ‘good’ but I had no idea how bad they really were. \nSo, despite being so successful, my grandfather had a secret side business.  His father had bred Dalmatians and he continued that himself.  I was almost 10 before I even knew about it.  There was an old barn on the edge of their property that we never really went near because it was so far from the house.  I never saw any dogs on their property ever and never would have even thought they had dogs.  One day, my dad needed to see his dad about something and he drove down to the barn to speak with him and I happened to be in the truck. We got out and I was stunned when we went in the barn…Dalmatians in little cages stacked high all around the walls and in the middle of the barn.  Worse, there were dead ones (puppies and adult) in a corner.  I just remembered it smelled really bad and the dogs just kinda whimpered constantly.  I was horrified.  \nWhen we got back in the truck I asked my dad about the dogs.  He told me grandpa breeds dogs and sells them.  I told him I have never seen dogs running around.  He said they never leave that barn, they’re born there and then sold.  I said some of the dogs were adults and he told me those were used for making more dogs so they stay but the rest get sold.  He literally seemed to think nothing of this.  I asked about the dead dogs and he said not all dogs are ‘born right’ so they get put down. My grandparents constant need to be seen as super Christian was already off putting to me but finding this ‘secret’ dog business showed me something darker. \n\nBy the time I was a teen I knew a little more of the truth of this barn.  They talked openly about the business at times.  They literally were the worst of the worst type of dog breeder.  This group of dogs were the same line his father had so they’re all very inbred.   He would kill many of them due to the serious health problems that made them unable to be sold.  However, he knowingly bread deaf dogs saying that ‘it’s not guaranteed their puppies will be deaf.’  He bred them constantly to make up for how many had to be put down.  These dogs never saw a vet, never left that barn, rarely even left the dirty cages and lived a life of pure hell.  I only went back in the barn one other time.  My dad had injured his back and told me to help him bring newspaper down to the barn for the cages.  I remember seeing so many caged dogs.  I saw 2 mother dogs scrawny, laying there on urine soaked newspaper, unable to stand, missing teeth and with wounds on their body…and very pregnant.  I also realized he literally killed dogs by hitting them with a bat when I saw a bat with blood and dog bits on it next to a pile of dead dogs.  My grandfather was taking pictures and choked a puppy that whined too much and wouldn’t be still when he took it out of its cage to be photographed for sale. He had no issue with how he treated these dogs and had no problem brutally killing these animals.  My dad and his mom also didn’t seem to have any issues with this ‘business’. My grandfather referred to the dogs as ‘merchandise’, they literally only had monetary value…he didn’t care that they were living creatures (supposedly made by his God).\n\nWhen I had first seen the barn, I was little (9) and it was brief so I had questioned if maybe I was just not remembering right.  I thought they sold the dogs and they just didn’t think of them as pets so they must have been unintentionally mean.  However, after the second time I saw the barn when I was 14, I knew it was worse than I remembered.  I was so disturbed I told my mom.  By this time my parents were divorced.  My mom said she vaguely knew about the dog breeding but had no idea it was this.  She called the county and humane society and anonymously reported it.  Nothing every happened  with the report….but I refused to ever see my grandparents again and limited my visits with my dad.  I often wonder if the person disregarded the whole report because so many people in town went to that church  and my grandparent were obviously ‘good Christians’.  \n\nMy grandparents sent me bibles, religious books, cards, etc…for years trying to get me to ‘return to Jesus’ but I never replied. They stayed active in that church until they died.  My mom did mention that she drove past that church a year or so ago and they had renamed the huge addition my grandparents built after some other local rich religious nut.  Shows you only matter to the church for the money…my grandparents and their church did have the same values after all.",
  "timestamp": "2022-05-19 16:35:48",
  "score": 12330,
  "subreddit": "t5_2qh2p",
  "num_children": 192,
  "author": 21489,
  "replies": [
    {
      "id": "i986zuc",
      "text": "This is the most awful thing I read on this sub for a long time.",
      "timestamp": "2022-05-19 17:36:58",
      "score": 853,
      "num_children": 5,
      "author": 360882,
      "replies": [
        {
          "id": "i9987y9",
          "text": "I’m glad I came to the comments looking for a TL;DR or summarization first. Now I’ll just pass on it all together. Thanks",
          "timestamp": "2022-05-19 22:10:11",
          "score": 178,
          "num_children": 3,
          "author": 196915,
          "replies": [
            {
              "id": "i99tdy1",
              "text": "The tl;dr is basically the title",
              "timestamp": "2022-05-20 01:06:09",
              "score": 54,
              "num_children": 1,
              "author": 238361,
              "replies": [
                {
                  "id": "i9aaedi",
                  "text": "Mill?",
                  "timestamp": "2022-05-20 03:28:40",
                  "score": 1,
                  "num_children": 1,
                  "author": 196915,
                  "replies": [
                    {
                      "id": "i9aqs3g",
                      "text": "The grandfather of OP bred dalmations, then sold them. They were always put inside small cages in a barn. Any dog which wasn't good enough for the grandfather was brutally killed with a bat, and there was a pile of dead dogs as well. I will refuse to elaborate any further, for the sake of our sanity.",
                      "timestamp": "2022-05-20 06:30:00",
                      "score": 8,
                      "num_children": 1,
                      "author": 358137,
                      "replies": [
                        {
                          "id": "i9atr7f",
                          "text": "Jeez. Thanks for that! You gave me just enough of the graphic part.",
                          "timestamp": "2022-05-20 07:10:14",
                          "score": 3,
                          "num_children": 0,
                          "author": 196915,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9agsju",
              "text": "Yeah it’s fucked. And I stopped halfway.",
              "timestamp": "2022-05-20 04:31:42",
              "score": 2,
              "num_children": 0,
              "author": 314558,
              "replies": []
            },
            {
              "id": "i9bwebt",
              "text": "Well it kinda was a tldr in that sense",
              "timestamp": "2022-05-20 14:02:43",
              "score": 1,
              "num_children": 0,
              "author": 324013,
              "replies": []
            }
          ]
        },
        {
          "id": "i99ju2i",
          "text": "This really could benefit from a content warning; it's heartbreaking. A couple years ago, I lost a cat to illness and it was legitimately traumatic. My wife and I barely slept for a few weeks and we spent thousands of dollars trying to get her better, but we still lost her. The only thing that made it easier to deal with and work past is knowing that we did everything we could for her. Reading something like this really pulls those memories back up to the forefront. \n\nI can't imagine the kind of cruelty and heartlessness it takes to wilfully inflicting that kind of suffering on a living, feeling creature, especially one that depends on and needs you. How can people like that live with themselves?",
          "timestamp": "2022-05-19 23:45:31",
          "score": 115,
          "num_children": 4,
          "author": 28166,
          "replies": [
            {
              "id": "i9a39w0",
              "text": "I had a similar experience with my dog. He was 15-16 when everything went down hill. We fed him the same amount of food as our other dogs but he just couldn’t put on weight. We thought we weren’t feeding him enough. So we fed him more. He still was getting weaker and he started loosing his sight and his hearing. We knew by then he was losing the fight. We knew we rather let him go before he gets so bad he can’t fully function. He had a good life and we did everything to make him happy. I cried on and off for a month when he left us. \n\nI will never understand how people can look at something that has nothing but unconditional love and joy, and see it as a product.",
              "timestamp": "2022-05-20 02:26:49",
              "score": 30,
              "num_children": 0,
              "author": 285296,
              "replies": []
            },
            {
              "id": "i9edrxo",
              "text": "I only really wish that religion and an afterlife were real so that the people who ignorantly justify their cruelty could die and then be disowned by a righteous god before spending the rest of their existence in hell.",
              "timestamp": "2022-05-21 01:12:23",
              "score": 2,
              "num_children": 0,
              "author": 41965,
              "replies": []
            },
            {
              "id": "i9bc7ju",
              "text": "Sorry for your loss and that you went through that, I completely understand.  My wife and I lost our 6 month old kitten due to a rare genetic heart defect.  When he was put under to get neutered, he never woke up.  The pain that caused us is indescribable and I don't think we will ever fully be 'over it'.  It just leaves such a void in a place that was once nothing but love and joy.\n\nI can't fathom how sick an individual would need to be to treat living creatures in such a manner.  The only silver lining to OP's story is that the ghoul is dead and thankfully can never hurt another doggo.",
              "timestamp": "2022-05-20 11:17:42",
              "score": 1,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i9cnrnr",
              "text": "I get animals being a business.  I grew up helping on my uncles farm.  You know what I never saw there though?  Intentional animal cruelty.  You treated the animals well and tried to keep them healthy and happy. Just because something is raised to be food or a product doesn't make being cruel acceptable.",
              "timestamp": "2022-05-20 17:04:22",
              "score": 1,
              "num_children": 0,
              "author": 14032,
              "replies": []
            }
          ]
        },
        {
          "id": "i9asv1l",
          "text": "So many animals lived and died without ever knowing happiness or kindness…",
          "timestamp": "2022-05-20 06:57:53",
          "score": 13,
          "num_children": 0,
          "author": 84057,
          "replies": []
        },
        {
          "id": "i99nm5g",
          "text": "Don't google where your bacon and chicken and beef come from then",
          "timestamp": "2022-05-20 00:17:53",
          "score": 5,
          "num_children": 1,
          "author": 77416,
          "replies": [
            {
              "id": "i9ag6k3",
              "text": "Purdue's not in my face telling me I'm amoral garbage while doing everything they do *in the name of Jesus.*\n          \nWere I a god, I know who I'd smite first. Talk about a stench in my nostrils.",
              "timestamp": "2022-05-20 04:25:14",
              "score": 13,
              "num_children": 1,
              "author": 136415,
              "replies": [
                {
                  "id": "i9ann8b",
                  "text": "Fair, but that's overall a pretty minor issue when compared with the scale and intensity of the evil and cruelty itself. The victims don't care either way",
                  "timestamp": "2022-05-20 05:50:17",
                  "score": -1,
                  "num_children": 0,
                  "author": 77416,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i9adunq",
          "text": "Same. I had to stop reading halfway through.",
          "timestamp": "2022-05-20 04:01:36",
          "score": 1,
          "num_children": 0,
          "author": 182399,
          "replies": []
        }
      ]
    },
    {
      "id": "i98dyac",
      "text": "Those are the same attitudes that allowed them to look at other human beings who had darker skin and see them as merchandise and property. And your grandparents treatment of the animals mirrors the way slaves were treated. It all buds from the same vile plant.",
      "timestamp": "2022-05-19 18:24:07",
      "score": 1289,
      "num_children": 8,
      "author": 314341,
      "replies": [
        {
          "id": "i98sxph",
          "text": "Ya I just read Frederick Douglass’s book and he explicitly says the more religious each slave owner was, the worse to their slaves they were. He luckily was moved to an owner who wasn’t very religious at the end, had a better quality of life and that’s when he managed to escape.",
          "timestamp": "2022-05-19 20:06:13",
          "score": 346,
          "num_children": 2,
          "author": 151159,
          "replies": [
            {
              "id": "i99ffdq",
              "text": "I never miss a chance to simp for Frederick Douglass. His book is one of the most powerful things I've ever read.",
              "timestamp": "2022-05-19 23:08:18",
              "score": 99,
              "num_children": 2,
              "author": 352860,
              "replies": [
                {
                  "id": "i99zbgz",
                  "text": "It really was! I didn’t really have an interest in it because I’m already depressed about the world, but he made it so easy to listen to. I listened on Audible by the way and I would highly recommend.",
                  "timestamp": "2022-05-20 01:54:14",
                  "score": 22,
                  "num_children": 1,
                  "author": 151159,
                  "replies": [
                    {
                      "id": "i9bujgq",
                      "text": "People keep trying to get me to watch Handmaidens Tale and I won't because I don't want to see people treated horribly even in fiction.  Furthermore, with each passing year these dystopian fantasy feel closer and closer to reality.",
                      "timestamp": "2022-05-20 13:49:30",
                      "score": 2,
                      "num_children": 0,
                      "author": 388877,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i9bd0j1",
                  "text": "His fourth of July speech is required reading in my classes (deep south school named after Robert E. Lee).",
                  "timestamp": "2022-05-20 11:25:41",
                  "score": 3,
                  "num_children": 0,
                  "author": 278916,
                  "replies": []
                }
              ]
            },
            {
              "id": "i998pfz",
              "text": "It's so funny that progress of human rights is religion catching up with secular humanism not the other way around. \n\nIt's obviously more nuanced than that and I'm very biased on what I see as morals and ethics (based on reduction of unnecessary suffering and improved well being, which is vague).",
              "timestamp": "2022-05-19 22:14:01",
              "score": 102,
              "num_children": 1,
              "author": 340507,
              "replies": [
                {
                  "id": "i9ae3og",
                  "text": "I like this observation but chose to substitute \"bitterly ironic\" in place of funny.",
                  "timestamp": "2022-05-20 04:04:03",
                  "score": 11,
                  "num_children": 0,
                  "author": 149732,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i98irzr",
          "text": "Excellent point. It's important to remember how religious those slaveholders were.",
          "timestamp": "2022-05-19 18:57:01",
          "score": 268,
          "num_children": 2,
          "author": 123584,
          "replies": [
            {
              "id": "i99904l",
              "text": "In one of king los' freestyle he says\n\n\"You think it's odd they slave you, if the slavemaster serve the same god they gave you\n\n400 years later and you hardly stable now you turn around and beg that same god to save you\"",
              "timestamp": "2022-05-19 22:16:20",
              "score": 199,
              "num_children": 1,
              "author": 152713,
              "replies": [
                {
                  "id": "i9a6xxh",
                  "text": "Yes! I have never understood why so many African Americans are so steadfastly Christian when that religion was forced on them and their own cultures ripped away from them. The same God that entitled the white people to enslave them, they now worship? How does that make any sense? I don’t understand it.",
                  "timestamp": "2022-05-20 02:57:42",
                  "score": 73,
                  "num_children": 4,
                  "author": 343748,
                  "replies": [
                    {
                      "id": "i9apmxy",
                      "text": "As a Mexican I can totally relate to this. The country is still over 90% Roman Catholic. It makes you wonder how absolutely horrifying the inquisition must have been for the church to still have such a stranglehold on the country more than 200 years after it gained it's independence from Spain.",
                      "timestamp": "2022-05-20 06:15:12",
                      "score": 26,
                      "num_children": 0,
                      "author": 89089,
                      "replies": []
                    },
                    {
                      "id": "i9aab90",
                      "text": "I once read a comment more articulate than mine is going to be that changed my mind of this matter. \n\nBasically, church was the only time slaves got to socialize, sing and dance together. It was the only joy allowed to them and often it was the only education they were given.\n\nSo of course they believed in it and passed it down to their children.",
                      "timestamp": "2022-05-20 03:27:51",
                      "score": 47,
                      "num_children": 2,
                      "author": 17493,
                      "replies": [
                        {
                          "id": "i9ah7ty",
                          "text": "Still.. That's some Stockholm syndrome shit",
                          "timestamp": "2022-05-20 04:36:11",
                          "score": 33,
                          "num_children": 3,
                          "author": 365814,
                          "replies": [
                            {
                              "id": "i9amr0y",
                              "text": "Imagine your whole culture, gone. No connection to your family, your family traditions, nothing. \n\nNow imagine you're in a strange place after one of the most violent and torturous events of your life. Being uprooted and moved halfway across the world like a piece of cargo on a ship for months.  \n\nIn this new place the only friendly strangers are people who kind of look like you, but have nothing else in common with you. You don't speak the same language; really the only connection you have is that you're all in a shitty situation. \n\nYou remember bits and pieces of your past, try and convey that during the only time you're allowed to socialize, which just so happens to revolve around a religion that guarantees while this life is hard, the next one will be better if you simply believe. \n\nYou combine that with the parts of your culture you can scrounge up and share, and it becomes one of the most transformative experiences of your life.\n\nThe African American experience was an (unintentional) real time experiment in how syncretic traditions can come together and form a new culture. Of course this was passed down.",
                              "timestamp": "2022-05-20 05:39:22",
                              "score": 30,
                              "num_children": 0,
                              "author": 48086,
                              "replies": []
                            },
                            {
                              "id": "i9aw8ij",
                              "text": "Yes and that was the point.  Religion is built to make people subservient",
                              "timestamp": "2022-05-20 07:46:34",
                              "score": 12,
                              "num_children": 0,
                              "author": 18816,
                              "replies": []
                            },
                            {
                              "id": "i9bohpq",
                              "text": "Yeah, that's kind of how it was, compounded over generations.\n\nLook how difficult it is proving to be to change the hearts and minds of the poor white folks in the south/red states.  They've been raised on a steady diet of \"Well at least we're better off than ___\".",
                              "timestamp": "2022-05-20 13:04:55",
                              "score": 1,
                              "num_children": 0,
                              "author": 72619,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "i9amcjf",
                          "text": "It also teaches suffering in this life for a reward after dying.",
                          "timestamp": "2022-05-20 05:34:31",
                          "score": 11,
                          "num_children": 2,
                          "author": 129974,
                          "replies": [
                            {
                              "id": "i9c2omu",
                              "text": "the ultimate ponzi scheme",
                              "timestamp": "2022-05-20 14:45:31",
                              "score": 3,
                              "num_children": 0,
                              "author": 348750,
                              "replies": []
                            },
                            {
                              "id": "i9ba4zl",
                              "text": "If the reward comes after you die,  it's a death cult,  and cannot be trusted to treat correctly those whom are alive.",
                              "timestamp": "2022-05-20 10:56:23",
                              "score": 1,
                              "num_children": 0,
                              "author": 238959,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i9c41lq",
                      "text": "Because Christians don't read their Bibles, and most of the minority that actually do, don't do so with reading compression. Most of our population is effectively illiterate.\n\nWe also have that they were indoctrinated into believing in that religion and it isn't too bad at shifting the goalposts to get past little inconveniences like \"slavery is good! Here's some guidelines on how you should be doing it.\"\n\nSo, you wind up with an uneducated population with a strong faith that is hard to dislodge. And they just remain oppressed -the chains look a little different, but Christianity remains an integral link in those shackles.",
                      "timestamp": "2022-05-20 14:54:32",
                      "score": 2,
                      "num_children": 0,
                      "author": 346676,
                      "replies": []
                    },
                    {
                      "id": "i9amumd",
                      "text": "Kinda same think happened with sout slaves (btw, similaruty between words slav and and slave is not coincidence).  There were some peacefull conversions, But there were force full too.\n\nI think that after 2 generations People dont see their old religion and colture as still their - its something that their dranparents did ages ago, Why should they do it too now?",
                      "timestamp": "2022-05-20 05:40:33",
                      "score": 1,
                      "num_children": 0,
                      "author": 72721,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i999dj7",
              "text": "They were not only religious but the religion encourages it and instructs how much you can beat \"your property\". We're just lucky they're  forced to ignore that part of the Bible now.",
              "timestamp": "2022-05-19 22:19:18",
              "score": 61,
              "num_children": 1,
              "author": 153551,
              "replies": [
                {
                  "id": "i99c775",
                  "text": "“When God, in verse forty-five\n\nSaid that slaves are okay to buy\n\nHe meant that people all from the start\n\nEach have 'slaves' within their hearts:\n\nThings that we have sold or bought\n\nThen are forced to pick our moral cotton\n\nGod calls us to set these free\n\nFree our hearts from slavery\n\nAnd then as God goes on to explain\n\nThe logistics of buying and selling slaves…\n\nUh… he, the bible's sorta like uh… there's like, typos…”",
                  "timestamp": "2022-05-19 22:41:47",
                  "score": 54,
                  "num_children": 0,
                  "author": 285757,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i99k7h6",
          "text": "[Billie Holiday - Strange Fruit](https://youtu.be/-DGY9HvChXk)",
          "timestamp": "2022-05-19 23:48:41",
          "score": 14,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i99igc9",
          "text": "Are we not treating farm animals the same? As a commodity to be used and abused and killed without any regard? Isn't it funny how many holocaust survivors ended up being vegan/vegetarian and are now supporting animal rights because they realise that the same mental procese that enabled nazis to treat them as things and kill them we utilise today to treat other living creatures as things?",
          "timestamp": "2022-05-19 23:33:53",
          "score": 37,
          "num_children": 2,
          "author": 192249,
          "replies": [
            {
              "id": "i9b8dgx",
              "text": "As someone who eats meat I wish it was easier to find sustainably sourced food. Plant production does immense damage to ecosystems and natural habitats and animal rearing ranges from very reasonable to extremely inhumane. The companies and individuals that do source sustainable food tend to be very expensive and we have to recognize that as the luxury and privilege that it is.",
              "timestamp": "2022-05-20 10:35:14",
              "score": 6,
              "num_children": 1,
              "author": 314341,
              "replies": [
                {
                  "id": "i9baf5r",
                  "text": "As it turns out, we actually have to grow far more plants in order to feed livestock. [Over 3 quarters of the global soy production goes to livestock.](https://ourworldindata.org/soy). And this is what's really driving massive ecological destruction. \n\nIn most 1st world countries, billions are shelled out in subsidies for meat and dairy ($38 billion annually in the U.S.) while less than a percent of that amount ($17 million or 0.04% in the U.S.) is given to fruits and vegetables. This keeps meat prices artificially lower to make up for the inefficient costs of creating it.\n\nIn spite of all this, it's a lot cheaper to buy plant protein than most expect. Just don't rely on the pricier impossible/beyond meat. Beans, lentils, chick peas, tofu, and most grains are extremely cheap and offer great protein sources. Personally, I buy pea protein/wheat protein which are cheaper than meat per gram of protein.",
                  "timestamp": "2022-05-20 10:59:10",
                  "score": 6,
                  "num_children": 0,
                  "author": 94316,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9dkf4t",
              "text": "That is true, for some of them.     \n      \nOn the other hand, a lot of Jewish groups find the comparison super offensive.  And a PETA campaign comparing factory farming to the holocaust was banned in Germany for \"trivializing\" the holocaust.      \n          \nPersonally, I think the comparison has some merit to it, if you consider some animals to be deserving of rights and empathy.  Also, a key ingredient in getting a population to be OK with atrocities against an \"enemy\" is getting them to see the enemy like \"animals.\"  And given the scale of atrocities we consider \"normal\" against animals... well, if you can get people to see a group of humans as animals, then atrocities against them will be \"normal.\"",
              "timestamp": "2022-05-20 21:07:31",
              "score": 1,
              "num_children": 0,
              "author": 314991,
              "replies": []
            }
          ]
        },
        {
          "id": "i99qi7d",
          "text": "The way those Dalmatians were treated is pretty Nazi-like, but I don't think even Adolf Hitler would approve of their business (IIRC, Hitler liked dogs...)\n\nAwful stuff...",
          "timestamp": "2022-05-20 00:42:16",
          "score": 8,
          "num_children": 0,
          "author": 232438,
          "replies": []
        },
        {
          "id": "i9ak0b3",
          "text": "Which book?",
          "timestamp": "2022-05-20 05:07:03",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i9arpvb",
          "text": "Generational trauma.",
          "timestamp": "2022-05-20 06:42:20",
          "score": 1,
          "num_children": 0,
          "author": 192268,
          "replies": []
        },
        {
          "id": "i9brpsx",
          "text": "Eh I would not say it stems from religion. My ancestors were Spanish slavers from the 16th century to the late 19th century. And they were not catholics in anything else other than pretense. Sometimes people just do things that benefit them without care for others.",
          "timestamp": "2022-05-20 13:29:03",
          "score": 1,
          "num_children": 0,
          "author": 247764,
          "replies": []
        }
      ]
    },
    {
      "id": "i983249",
      "text": "It's good that you were able to recognize evil. Your dad was raised with it and didn't recognize it. At the very least he distanced you or knew your mother wouldn't allow you in the barn with the few exceptions. Because what they did I terrible.",
      "timestamp": "2022-05-19 17:10:39",
      "score": 321,
      "num_children": 2,
      "author": 28665,
      "replies": [
        {
          "id": "i98vyt5",
          "text": "Thanks for that, I have never told anyone this story but I finally wanted to get it out.  I think my maternal grandmother protected us a lot and I give her credit for a lot of how I was raised.  My mom obviously made bad choices - one being picking my dad.  My grandma was a smart lady and I think she saw my other grandparents and my dad for what they were right away.  I spent so much time with her and very little time with them, thankfully",
          "timestamp": "2022-05-19 20:36:00",
          "score": 129,
          "num_children": 1,
          "author": 21489,
          "replies": [
            {
              "id": "i99nr5m",
              "text": "I’m glad you had your grandma, then. And that you didn’t have to get used to such a horrible thing.",
              "timestamp": "2022-05-20 00:19:03",
              "score": 18,
              "num_children": 0,
              "author": 26174,
              "replies": []
            }
          ]
        },
        {
          "id": "i98og0q",
          "text": "Terrible AND felonious.",
          "timestamp": "2022-05-19 19:35:29",
          "score": 48,
          "num_children": 0,
          "author": 35111,
          "replies": []
        }
      ]
    },
    {
      "id": "i97yc42",
      "text": "Bro if there is a hell in their eyes they are headed to the 9th circle",
      "timestamp": "2022-05-19 16:39:10",
      "score": 698,
      "num_children": 8,
      "author": 2943,
      "replies": [
        {
          "id": "i98h09j",
          "text": "Nah Christians believe it's okay to kill animals how they see fit since they don't have souls.",
          "timestamp": "2022-05-19 18:45:02",
          "score": 279,
          "num_children": 9,
          "author": 237915,
          "replies": [
            {
              "id": "i98iv22",
              "text": "that's some old philosophy from aristotle and the division of the soul. with an apathetic \"christian\" mindset, a lack of reason makes dogs incomplete souls and therefore free game for cruelty. anyone who has a heart though knows you don't need to be human to be abused.",
              "timestamp": "2022-05-19 18:57:34",
              "score": 109,
              "num_children": 2,
              "author": 289574,
              "replies": [
                {
                  "id": "i98qlg3",
                  "text": "God gave man dominion over the lesser beasts. Animals are only just behind women in Abrahamic religions.",
                  "timestamp": "2022-05-19 19:50:16",
                  "score": 97,
                  "num_children": 1,
                  "author": 91861,
                  "replies": [
                    {
                      "id": "i98tjpd",
                      "text": "I was wondering about that verse Gen 1:28 a few months back and the Jewish thinking is that to have dominion means to take environmental responsibility and stewardship over nature. https://www.bbc.co.uk/bitesize/guides/zw9ky4j/revision/4 \n\nIt’s really a far cry from what evangelicals think it means",
                      "timestamp": "2022-05-19 20:10:26",
                      "score": 56,
                      "num_children": 5,
                      "author": 391750,
                      "replies": [
                        {
                          "id": "i996n6c",
                          "text": "Not just evangelicals. Genesis says “dominion” and that means ownership and control. Any of the countless varieties of Christianity that say otherwise are recently reformed (probably the last 100 years). \n\nBear in mind that the whole idea that you can be cruel to animals is a relatively recent thing in the West, and that widespread cruelty is commonplace in other parts of the world.",
                          "timestamp": "2022-05-19 21:58:11",
                          "score": 22,
                          "num_children": 1,
                          "author": 172974,
                          "replies": [
                            {
                              "id": "i99p5rr",
                              "text": "It's a shame in so many ways how high a regard 21st century \"natives\" hold humans in. It's more sad than anything, because it's as if people just don't want to believe that by and large, humans just aren't very complicated or exceptional, and no whatever philosophical thoughts you think you have that make you high minded are not new, and cannot be understood by most. Otherwise we would have achieved some sort of ethical humanist utopia 2500 years ago.",
                              "timestamp": "2022-05-20 00:30:56",
                              "score": 3,
                              "num_children": 1,
                              "author": 35626,
                              "replies": [
                                {
                                  "id": "i9dtje4",
                                  "text": "‘Twas ever thus, though…",
                                  "timestamp": "2022-05-20 22:18:39",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 172974,
                                  "replies": [
                                    {
                                      "id": "i9fyorn",
                                      "text": "There's a quote I remember from Pathologic (great fucking game btw) which I think is the gentlest way of putting it: \"A genius is always damned to learn the inevitability of being a victim of circumstance.\"",
                                      "timestamp": "2022-05-21 12:32:58",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 35626,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i995b0x",
                          "text": "I mean that's a nice idea, but it's not true in any way. When the Bible was written, people didn't think they could control or really even impact nature. They literally didn't know animals *could* go extinct. They also certainly weren't worried about animal cruelty. It's simply dishonest if they are claiming that was the original intent, and I think many Orthodox Jews now think it's blasphemous to claim that we are responsible for climate change or that we can reverse it.",
                          "timestamp": "2022-05-19 21:48:00",
                          "score": 11,
                          "num_children": 2,
                          "author": 270300,
                          "replies": [
                            {
                              "id": "i9a57zw",
                              "text": "> Orthodox Jews now think it's blasphemous\n\nNot for nothing, but Orthodox Jews think a lot of wacky things are blasphemous.",
                              "timestamp": "2022-05-20 02:43:04",
                              "score": 3,
                              "num_children": 0,
                              "author": 210376,
                              "replies": []
                            },
                            {
                              "id": "i9cj4th",
                              "text": ">When the Bible was written, people didn't think they could control or really even impact nature. They literally didn't know animals *could* go extinct. They also certainly weren't worried about animal cruelty. It's simply dishonest if they are claiming that was the original intent\n\nexcept you're misunderstanding whose original intent is at play. if you believe in god and the bible, the shortcomings of the writers are irrelevant because the author is god and god knew all that. so it's not necessarily* dishonest. they have a different, possibly* honestly held, belief.",
                              "timestamp": "2022-05-20 16:33:57",
                              "score": 1,
                              "num_children": 0,
                              "author": 65957,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "i99bdz8",
                          "text": "When the Lord your God hands it over to you, you must strike down all its males with the sword. But you may take the women, children, animals, and whatever else is in the city — all its spoil — as plunder. You may enjoy the spoil of your enemies that the Lord your God has given you. This is how you are to treat all the cities that are far away from you and are not among the cities of these nations. However, you must not let any living thing survive among the cities of these people the Lord your God is giving you as an inheritance. You must completely destroy them — the Hittite, Amorite, Canaanite, Perizzite, Hivite, and Jebusite — as the Lord your God has commanded you, so that they won’t teach you to do all the detestable things they do for their gods, and you sin against the Lord your God. “When you lay siege to a city for a long time, fighting against it in order to capture it, you must not destroy its trees by putting an ax to them, because you can get food from them. You must not cut them down. Are trees of the field human, to come under siege by you? But you may destroy the trees that you know do not produce food. You may cut them down to build siege works against the city that is waging war against you, until it falls.\r\n\nDeuteronomy 20:13‭-‬20\n\nYour ignoring the rest of that chapter where it instructs the israelites to slaughter all the mean and keep the women and children for themselves. What do you think they did with those women? Not to mention it says right after to cut down any and all trees that don't have fruit, to build weapons. there are also other times where \"god\" instructs them to \"dash their babies upon the rocks.\" These new meaning are just that. *NEW* meanings. They've been translated over and over from their original language and reinterpreted to have a new meaning, a very common practice among Jewish scholarship. \n\nTLDR: Those verses didn't mean what you think they meant. Make sure not to omit things carelessly.",
                          "timestamp": "2022-05-19 22:35:17",
                          "score": 6,
                          "num_children": 0,
                          "author": 153551,
                          "replies": []
                        },
                        {
                          "id": "i997a4g",
                          "text": "These interpretations are just heavily inspired by secular environmentalism, you didnt see religious groups pushing environmental policy until it was already mainstream.",
                          "timestamp": "2022-05-19 22:03:00",
                          "score": 10,
                          "num_children": 0,
                          "author": 298217,
                          "replies": []
                        },
                        {
                          "id": "i993di5",
                          "text": "I’m a Christian and I know what that means. It is supposed to be a sacred stewardship.",
                          "timestamp": "2022-05-19 21:33:21",
                          "score": 3,
                          "num_children": 1,
                          "author": 204347,
                          "replies": [
                            {
                              "id": "i99blo2",
                              "text": "They may be taken that way now, but that's not what they meant originally; that's also not how many evangelicals take it now either.",
                              "timestamp": "2022-05-19 22:36:59",
                              "score": 10,
                              "num_children": 1,
                              "author": 153551,
                              "replies": [
                                {
                                  "id": "i99jry1",
                                  "text": "Let me clarify. The word ‘dominion’, in terms of man and animal, means that Gods creation on earth is subject to mankind. We are to steward over it with care, as it was created for us to enjoy. I’m not a Hebrew scholar but that’s how I’ve always interpreted that. That, along with other texts like Proverbs 12:10, “a righteous man regards the life of his beast.”",
                                  "timestamp": "2022-05-19 23:45:02",
                                  "score": 1,
                                  "num_children": 2,
                                  "author": 204347,
                                  "replies": [
                                    {
                                      "id": "i9a62fc",
                                      "text": "Yeah thats fine if you pull out those kinds of meaning from it. When I was a Christian, that's how I took it too. That we were meant to be caretakers of the world, but at the same time dominate them. Somehow I made those two coincide in my head; but I did alot of that. My point is, these aren't the original interpretation, I think it's important to recognize that. The Bible has gone through countless translations. It goes back further than just Hebrew and even that is hard to gleam proper context from. \n\nIt's fine if you take personal meanings from it, but I try to do my best to be honest about the best understanding we have of those words, and they show us it was written by primitive cruel men. I'd rather not give credence to an ancient textbook of cruelty.",
                                      "timestamp": "2022-05-20 02:50:10",
                                      "score": 3,
                                      "num_children": 1,
                                      "author": 153551,
                                      "replies": [
                                        {
                                          "id": "i9br62a",
                                          "text": "I don’t intend to argue with you, but Hebrew is in fact the original language that passage in Genesis was written in. I think the many translations you’re referring to are the early translations to the Greek and then to Latin. Later, again translated from original Hebrew to the Latin. Then from Latin to English, but also from Greek to English and from Hebrew to English.",
                                          "timestamp": "2022-05-20 13:25:00",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 204347,
                                          "replies": [
                                            {
                                              "id": "i9c7jpn",
                                              "text": "No its OK your not arguing with me your pointing out a mistake I made. I double checked and your right, genesis was written down in an ancient form of Hebrew. I had mixed up the cuneiform tablets and the genesis accounts. We have cuneiform tablets reciting the Babylon flood myth that mirror Noah's flood, but are much much older, showing us that the story of Noah's flood was heavily influenced by the Babylonian culture and legends. That was my mistake cuneiform wasn't a Semitic language but Babylonian.",
                                              "timestamp": "2022-05-20 15:17:59",
                                              "score": 2,
                                              "num_children": 0,
                                              "author": 153551,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "i9aeeqy",
                                      "text": "And upon your passing, you will have a lot to answer for....",
                                      "timestamp": "2022-05-20 04:07:07",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 149732,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i9bb7qq",
                  "text": "The entire idea of a soul comes from Greek philosophy. The early Christians and Hebrews didn't have a concept of a soul.",
                  "timestamp": "2022-05-20 11:07:17",
                  "score": 2,
                  "num_children": 0,
                  "author": 343634,
                  "replies": []
                }
              ]
            },
            {
              "id": "i98opz1",
              "text": "It's even worse, as long as they confess their sins to the lich king, they get a free pass",
              "timestamp": "2022-05-19 19:37:22",
              "score": 45,
              "num_children": 2,
              "author": 342179,
              "replies": [
                {
                  "id": "i990g2e",
                  "text": "Lich King made my day.",
                  "timestamp": "2022-05-19 21:11:01",
                  "score": 8,
                  "num_children": 1,
                  "author": 144011,
                  "replies": [
                    {
                      "id": "i994sa5",
                      "text": "I remember seeing a post about that years back where someone walked through the characteristics of various fictional creatures and exhaustively assembled Jesus' powers based on miracles listed and then applied the power set to the arch types of creatures, from vampire, to zombie and eventually settled on Lich as the best fit for his power set, and since he is the king of kings also, he is the Lich King.  Might have been a WoW subreddit now that I think about it.",
                      "timestamp": "2022-05-19 21:44:05",
                      "score": 10,
                      "num_children": 0,
                      "author": 342179,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i997bwt",
                  "text": "Haven’t seen the word [“lich”](https://en.wikipedia.org/wiki/Lychgate) in a while. :)",
                  "timestamp": "2022-05-19 22:03:23",
                  "score": 4,
                  "num_children": 0,
                  "author": 172974,
                  "replies": []
                }
              ]
            },
            {
              "id": "i98tgfl",
              "text": "Yup, Bible says humans were given dominion over animals.",
              "timestamp": "2022-05-19 20:09:48",
              "score": 9,
              "num_children": 0,
              "author": 9293,
              "replies": []
            },
            {
              "id": "i98wtln",
              "text": "I think it depends on the sect actually. The bible itself has verses that seem to imply that animals do have souls. Ecclesiastes 3:19 says that \"For what happens to the children of man and what happens to the beasts is the same; as one dies, so dies the other.\"\n\nIirc there was some debate about this among catholics because different popes have said different things about animals.\n\nI'm not christian though so I'm not an expert on the subject. I suppose it wouldn't be the first time christians ignored their bible.\n\nE: As with all sins in christianity, if you say that you're sorry to a priest, it doesn't matter how many animals you've brutally killed.",
              "timestamp": "2022-05-19 20:43:34",
              "score": 7,
              "num_children": 1,
              "author": 194035,
              "replies": [
                {
                  "id": "i990bee",
                  "text": "I suspect that most Christians would really disapprove of the abuse that OP described. I was raised Baptist and was a Christian into my 30s (fully and happily de-converted now). I was always taught to be a \"good shepherd\" of what was given. A good shepherd would keep his flock with love. Plus Jesus told parables about the shepherd taking care of his flock. Just my 2 cents.",
                  "timestamp": "2022-05-19 21:10:00",
                  "score": 3,
                  "num_children": 1,
                  "author": 332036,
                  "replies": [
                    {
                      "id": "i99d9wk",
                      "text": "If a Christian objects to reprehensible behavior, it’s because they are a decent person, which you can be and be of any or no religious stripe,  certain sects seem to have higher or lower concentrations of assholes though.",
                      "timestamp": "2022-05-19 22:50:29",
                      "score": 7,
                      "num_children": 0,
                      "author": 87902,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9970kc",
              "text": "Hell, about 10 years ago I had to correct my little brother because a teacher told him \"animals don't feel pain\"",
              "timestamp": "2022-05-19 22:00:56",
              "score": 3,
              "num_children": 0,
              "author": 291986,
              "replies": []
            },
            {
              "id": "i99lzl3",
              "text": "That's the same justification they had with how they treated the slaves. Wasn't right then and it still ain't right with anything else, living or dead. Look at how this mindset has affected the planet.",
              "timestamp": "2022-05-20 00:03:57",
              "score": 3,
              "num_children": 0,
              "author": 21970,
              "replies": []
            },
            {
              "id": "i99yhsz",
              "text": "most people believe it's okay to kill animals how they see fit since they like bacon",
              "timestamp": "2022-05-20 01:47:35",
              "score": 3,
              "num_children": 0,
              "author": 169723,
              "replies": []
            },
            {
              "id": "i99ke6p",
              "text": "Dogs have souls, that's why right wingers love them so much, because we taught them to suffer.",
              "timestamp": "2022-05-19 23:50:16",
              "score": 1,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i9bqwkq",
              "text": "Cows do tho because cows are mentioned being in heaven in the bible they must have souls, and I think bees go to heaven too.",
              "timestamp": "2022-05-20 13:23:04",
              "score": 1,
              "num_children": 0,
              "author": 167187,
              "replies": []
            }
          ]
        },
        {
          "id": "i99dulk",
          "text": "After all, their god did murder all the animals in the earth because some humans sinned, and got his henchman to run a mill on his Ark supposedly with 2 animals of each kind.",
          "timestamp": "2022-05-19 22:55:11",
          "score": 9,
          "num_children": 0,
          "author": 2514,
          "replies": []
        },
        {
          "id": "i992k7z",
          "text": "You can just accept Jesus and be absolved of all sins on their death bed. It's that simple.",
          "timestamp": "2022-05-19 21:27:06",
          "score": 7,
          "num_children": 1,
          "replies": [
            {
              "id": "i997kly",
              "text": "As long as you put cash in the donation basket so the priest can get a new car then you get a reserved seat in heaven.",
              "timestamp": "2022-05-19 22:05:13",
              "score": 7,
              "num_children": 0,
              "author": 2943,
              "replies": []
            }
          ]
        },
        {
          "id": "i98x9qq",
          "text": "Straight to hell, to the boiler room of hell, all the way down.",
          "timestamp": "2022-05-19 20:47:02",
          "score": 3,
          "num_children": 0,
          "author": 403355,
          "replies": []
        },
        {
          "id": "i9arete",
          "text": "Most likely the 4th circle (greed) or the 7th circle (violence) but my money is on the 4th",
          "timestamp": "2022-05-20 06:38:19",
          "score": 2,
          "num_children": 0,
          "author": 379416,
          "replies": []
        },
        {
          "id": "i99nh37",
          "text": "How is this different than factory farming conditions? Do you eat meat? If so, you're also headed to the 9th circle",
          "timestamp": "2022-05-20 00:16:39",
          "score": 5,
          "num_children": 2,
          "author": 77416,
          "replies": [
            {
              "id": "i9ag6t6",
              "text": "Yep, I wonder how many people in this thread who make excuses for engaging with needless animal abuse while condemning these other abusers. \n\nNeedless animal abuse is needless animal abuse at the end of the day and we can get all the nutrition we need from plants. \n\n>  “A vegan diet is probably the single biggest way to reduce your impact on planet Earth, **not just greenhouse gases, but global acidification, eutrophication, land use and water use**,” said Joseph Poore, at the University of Oxford, UK, who led the research. **“It is far bigger than cutting down on your flights or buying an electric car,” he said, as these only cut greenhouse gas emissions.\"**\n\n[The new research shows that without meat and dairy consumption, global farmland use could be reduced by more than 75% – an area equivalent to the US, China, European Union and Australia combined – and still feed the world. **Loss of wild areas to agriculture is the leading cause of the current mass extinction of wildlife.**](https://www.theguardian.com/environment/2018/may/31/avoiding-meat-and-dairy-is-single-biggest-way-to-reduce-your-impact-on-earth)",
              "timestamp": "2022-05-20 04:25:18",
              "score": 5,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i99nw6w",
              "text": "[removed]",
              "timestamp": "2022-05-20 00:20:13",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "i99uxoi",
                  "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for using abusive language, personal attacks, being a dick, or fighting with other users. These activities are against the [rules](https://www.reddit.com/r/atheism/wiki/guidelines).   \r\nConnected comments may also be removed for the same reason, though editing out the direct attack may merit your comment being restored.  Users who don't cease this behavior may get banned temporarily or permanently.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                  "timestamp": "2022-05-20 01:18:54",
                  "score": 1,
                  "num_children": 0,
                  "author": 122319,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i99ybyb",
          "text": "are you vegan or something? animals exist to be bred FOR us, stop being so judgemental.",
          "timestamp": "2022-05-20 01:46:16",
          "score": -3,
          "num_children": 1,
          "author": 169723,
          "replies": [
            {
              "id": "i99yq4p",
              "text": "I don’t think any person can say that they would want to clobber puppies with a baseball bat, something just feels off about that",
              "timestamp": "2022-05-20 01:49:26",
              "score": 7,
              "num_children": 1,
              "author": 2943,
              "replies": [
                {
                  "id": "i99z0td",
                  "text": "https://www.youtube.com/watch?v=yfk63fJOdRw viewer discretion but you would be shocked at how we treat our fellow creatures without a second thought",
                  "timestamp": "2022-05-20 01:51:48",
                  "score": 1,
                  "num_children": 1,
                  "author": 169723,
                  "replies": [
                    {
                      "id": "i9a0xn1",
                      "text": "But we use those animals for food, what is the point in killing puppies for no reason. I agree animals are meant for us to use, but for us to use wisely",
                      "timestamp": "2022-05-20 02:07:33",
                      "score": 1,
                      "num_children": 1,
                      "author": 2943,
                      "replies": [
                        {
                          "id": "i9ace63",
                          "text": "> what is the point in killing puppies for no reason\n\nThere is a reason, it's just a bad one.\n\n> Animals are meant for us to use, but for us to use wisely\n\nAnd it's also a bad reason to breed animals for food in 2022 (unnecessary to meet our nutritional needs, wastes calorie feed input 16:1 to waste, destroys the environment in mass, does not produce good health outcomes compared to vegan diets)",
                          "timestamp": "2022-05-20 03:47:19",
                          "score": 4,
                          "num_children": 1,
                          "author": 169723,
                          "replies": [
                            {
                              "id": "i9ahji1",
                              "text": "I need bacon I don’t think you understand my carnal lust for bacon I can’t live without it",
                              "timestamp": "2022-05-20 04:39:41",
                              "score": 1,
                              "num_children": 0,
                              "author": 2943,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i99hfyl",
          "text": "Don't you mean the canine-th circle?",
          "timestamp": "2022-05-19 23:25:20",
          "score": 0,
          "num_children": 1,
          "author": 179133,
          "replies": [
            {
              "id": "i99ntwz",
              "text": "💀💀",
              "timestamp": "2022-05-20 00:19:41",
              "score": 1,
              "num_children": 0,
              "author": 2943,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i985pz6",
      "text": "A lot of Christians have really weird ideas about other animals that allows them to justify doing horrible things to them. They think they are made in the image of God but other animals aren’t, so it’s fine to treat them like shit. Some Christians don’t even believe that other animals can experience pain. Christian philosopher William Lane Craig argues for this, and Christians I’ve talked to have said that they see animals like advanced robots. \n\nWhen I was a Christian, I didn’t think animals were unfeeling robots, but I did think that they were put here by God for us to use. Now I’m an atheist, and it has led me to be a much more compassionate person towards animals and humans. I no longer support animal agriculture, and I no longer hold the homophobic and sexist beliefs that I did as a Christian. I’m a much better person now, so I think it is ironic that there are Christians who actually believe you can’t be moral without being Christian.",
      "timestamp": "2022-05-19 17:28:26",
      "score": 247,
      "num_children": 11,
      "replies": [
        {
          "id": "i98nuk6",
          "text": "The book of Genesis has a line about god saying some shit about humans being the \"stewards of the Earth\". I, being someone who assumes the best in people, think that that was *supposed* to be interpreted as \"you need to care for the planet and all its creatures or you will lose them\" but right wing fundie nutjobs hijacked any nuance in that concept to mean \"pillage the earth for profit because god said it was your destiny\".",
          "timestamp": "2022-05-19 19:31:19",
          "score": 53,
          "num_children": 2,
          "author": 79187,
          "replies": [
            {
              "id": "i98tz2h",
              "text": "You aren’t wrong at all. That was what the Jewish interpretation was acc. to https://www.bbc.co.uk/bitesize/guides/zw9ky4j/revision/4\n\nthe Jewish thinking re: to have dominion means to take environmental responsibility and stewardship over nature. \n\nIt’s really a far cry from what evangelicals think it means",
              "timestamp": "2022-05-19 20:13:24",
              "score": 27,
              "num_children": 0,
              "author": 391750,
              "replies": []
            },
            {
              "id": "i98u3o5",
              "text": "Yes! I just comemnted this before I saw yours. It makes me so mad, basically manifest destiny bullshit has continued to this day. If you follow the Bible then humans were supposed to care for earth in the garden. We fucked that up but Christians should still do that as far I see it.",
              "timestamp": "2022-05-19 20:14:17",
              "score": 2,
              "num_children": 0,
              "author": 240562,
              "replies": []
            }
          ]
        },
        {
          "id": "i98a28f",
          "text": "I have really felt so much empathy for animals.  This made me look into dog breeding and kennel clubs, etc…After learning about dog breeding and how domestic dogs have changed, I have never wanted to own a dog and never will.  I feel so bad for what humans have done to them.",
          "timestamp": "2022-05-19 17:57:29",
          "score": 73,
          "num_children": 5,
          "author": 21489,
          "replies": [
            {
              "id": "i98cxyr",
              "text": "I have a different perspective for you to consider, but you certainly don't need to listen to me. I fully appreciate where you're coming from.\n\nYes, humans have done many deplorable things to the species, especially the eugenic-like focus on specialized breeding. YOU did none of this, and you are potentially in a position to make the life/lives of adoptable mutts much better and more comfortable by adopting from a reputable shelter. You can provide them shelter, food, comfort and love; they can provide you companionship, comfort, and some would call it reciprocated love. Having a companion animal can be an incredibly rewarding thing for all creatures involved.\n\nAgain, this is just a different perspective. I respect your decisions regardless.",
              "timestamp": "2022-05-19 18:17:13",
              "score": 64,
              "num_children": 1,
              "author": 237587,
              "replies": [
                {
                  "id": "i99rf4y",
                  "text": "Mutts are great dogs to adopt !",
                  "timestamp": "2022-05-20 00:49:53",
                  "score": 8,
                  "num_children": 0,
                  "author": 232438,
                  "replies": []
                }
              ]
            },
            {
              "id": "i98d9gl",
              "text": "Just know you can always save a dog by adopting. I enjoy our dog a lot and she was a rescue -same with our two cats. Boycotting breeders like your grandpa is the right course of action. That sucks you had this happening within your family and no one thought anything of it.",
              "timestamp": "2022-05-19 18:19:25",
              "score": 37,
              "num_children": 0,
              "author": 158211,
              "replies": []
            },
            {
              "id": "i98i2bf",
              "text": "I'm a strong believer of going to the place where you get your dog. When we got our golden we went to their farm, and we had to wait a bit because the dogs were off swimming in the pond. I almost felt bad taking her away from there.",
              "timestamp": "2022-05-19 18:52:09",
              "score": 16,
              "num_children": 0,
              "author": 123584,
              "replies": []
            },
            {
              "id": "i98yvtl",
              "text": "You should visit a factory farm and see where your meat is made.",
              "timestamp": "2022-05-19 20:59:06",
              "score": 11,
              "num_children": 2,
              "author": 97051,
              "replies": [
                {
                  "id": "i99jax3",
                  "text": "That kind of abuse is perfectly acceptable because bacon.\nThere is obviously a HUGE difference between cows and dogs that makes it totally unacceptable to abuse a cute pup but perfectly fine to subjugate cows to horrific abuse. And if you dare to mention otherwise you'll be downvoted to hell..",
                  "timestamp": "2022-05-19 23:41:03",
                  "score": 13,
                  "num_children": 0,
                  "author": 192249,
                  "replies": []
                },
                {
                  "id": "i9agf0v",
                  "text": "Did you know that animal agriculture is also the driving force behind the current mass extinction of wildlife? \n\nSo in addition to needlessly abusing animals directly, meat consumers are also helping finance the abuse of animals in the wild as well. \n\n>  “A vegan diet is probably the single biggest way to reduce your impact on planet Earth, **not just greenhouse gases, but global acidification, eutrophication, land use and water use**,” said Joseph Poore, at the University of Oxford, UK, who led the research. **“It is far bigger than cutting down on your flights or buying an electric car,” he said, as these only cut greenhouse gas emissions.\"**\n\n[The new research shows that without meat and dairy consumption, global farmland use could be reduced by more than 75% – an area equivalent to the US, China, European Union and Australia combined – and still feed the world. **Loss of wild areas to agriculture is the leading cause of the current mass extinction of wildlife.**](https://www.theguardian.com/environment/2018/may/31/avoiding-meat-and-dairy-is-single-biggest-way-to-reduce-your-impact-on-earth)",
                  "timestamp": "2022-05-20 04:27:41",
                  "score": 6,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "i99iytr",
              "text": "You can always adopt you know? That way you would be saving some animal that was abandoned (and in many cases abused) and give her a nice life. Buying purebreds is not the only option....",
              "timestamp": "2022-05-19 23:38:12",
              "score": 1,
              "num_children": 0,
              "author": 192249,
              "replies": []
            }
          ]
        },
        {
          "id": "i98g7so",
          "text": "I think this stems from the \"dominion over\"that they are taught. Conveniently, this justifies all kinds of terrible behavior",
          "timestamp": "2022-05-19 18:39:39",
          "score": 21,
          "num_children": 2,
          "author": 144782,
          "replies": [
            {
              "id": "i9992v8",
              "text": "Wanna hear the insane part?\n\nNot only do these beliefs grant them [exclusive rights](https://en.m.wikipedia.org/wiki/Dominion_theology) to abuse animals and destroy the planet because \"God gave them dominion over it,\" they believe that destroying the planet is the goal.\n\nSome of them (possibly some on the US supreme court) believe it is desirable to [actively bring about](https://www.vox.com/platform/amp/2017/12/12/16763230/raptureanxiety-calls-out-evangelicals-obsession-with-the-end-times-roy-moore-evangelical-jerusalem) the [end of the world.](https://www.haaretz.com/israel-news/.premium-armageddon-bring-it-on-the-evangelical-force-behind-trump-s-jerusalem-speech-1.5628081)",
              "timestamp": "2022-05-19 22:16:56",
              "score": 6,
              "num_children": 0,
              "author": 154023,
              "replies": []
            },
            {
              "id": "i99i11l",
              "text": "It's a grotesque take on the word \"dominion,\" too. Of course, they take it to mean \"dominate,\" when it really means something more like \"sovereignty.\" It's saying that we've been given a duty to be good stewards over animals and the environment.\n\nBut of course, when evangelicals think about any kind of power, they don't see it as responsibility, they see it as the ability to subjugate and control. They have a tyrannical view of the world.",
              "timestamp": "2022-05-19 23:30:18",
              "score": 3,
              "num_children": 0,
              "author": 28166,
              "replies": []
            }
          ]
        },
        {
          "id": "i98tq9n",
          "text": "This Christian view on animals and nature in general is such a skewed messed up twisting of the 'given dominion over' part of the Bible. The meaning/intended translation for that was given responsibility to care for and nurture. Following the biblicalsin/fallen humans theory we were supposed to protect the earth in the garden of eden so by extension Christians should care for it as humans were meant to. Right?",
          "timestamp": "2022-05-19 20:11:43",
          "score": 7,
          "num_children": 0,
          "author": 240562,
          "replies": []
        },
        {
          "id": "i98v7dc",
          "text": "It's kind of disturbing that belief still persists despite being demonstrably untrue, honestly. \n\nWe can literally *see* them experiencing emotions/pain with the technology we have available, and somehow there are still people who think animals don't really have feelings. \n\nSure, a dog doesn't have the same level of awareness/reasoning as a human, but it's really not hard to notice that they absolutely can be sad, happy, angry, in pain, etc. unless you *choose* not to see it.",
          "timestamp": "2022-05-19 20:21:49",
          "score": 7,
          "num_children": 0,
          "author": 314755,
          "replies": []
        },
        {
          "id": "i9a9qv6",
          "text": "Do you have a source for William Lane Craig arguing for animals not feeling pain?\n\nWow, what a silly thing to argue, if what you're saying is true. It's akin to arguing humans cannot feel pain. It's also scary because he's one of the most respected modern Christian philosophers. Please send me a source if you have one...",
          "timestamp": "2022-05-20 03:22:42",
          "score": 2,
          "num_children": 1,
          "author": 140581,
          "replies": [
            {
              "id": "i9adfb1",
              "text": "https://youtu.be/k1r_nHZqn_E\n\n“Therefore even though animals are in pain, they aren’t aware of it.”\n\nThe relevant part starts around 1:42.",
              "timestamp": "2022-05-20 03:57:22",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i9axy6j",
          "text": "> When I was a Christian, I didn’t think animals were unfeeling robots, but I did think that they were put here by God for us to use. Now I’m an atheist, and it has led me to be a much more compassionate person towards animals and humans. I no longer support animal agriculture, and I no longer hold the homophobic and sexist beliefs that I did as a Christian. I’m a much better person now, so I think it is ironic that there are Christians who actually believe you can’t be moral without being Christian.\n\nScary how similar our sentiments are/were. This covers 100% how I felt about animals as a Christian vs what I feel now.",
          "timestamp": "2022-05-20 08:12:15",
          "score": 2,
          "num_children": 0,
          "author": 84929,
          "replies": []
        },
        {
          "id": "i98fybb",
          "text": "You can use an animal and still treat it humanely. Not saying this against you in particular, but so many animals are treated poorly it breaks my heart.",
          "timestamp": "2022-05-19 18:37:49",
          "score": -3,
          "num_children": 0,
          "author": 310952,
          "replies": []
        },
        {
          "id": "i98xacz",
          "text": "Advanced robots?\n\nI apologize to Alexa if I yell at her when I'm frustrated.  I couldn't imagine harming an animal in such a way.",
          "timestamp": "2022-05-19 20:47:10",
          "score": 1,
          "num_children": 0,
          "author": 56144,
          "replies": []
        },
        {
          "id": "i99jaho",
          "text": "People that don't believe you can be moral without Christianity should frighten you. To me anyways, it implies they're one crisis of faith from raping, pillaging and killing people, seeing as they usually ask what's stopping you from doing those things without God bearing down on you.",
          "timestamp": "2022-05-19 23:40:57",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i9bk4pk",
          "text": "The most concerning thing I've heard Christians say is that religion keeps people from raping and murdering people. It concerns me because it makes me think that their church/faith/scheming-to-go-to-eternal-heaven is the only thing keeping them from doing horrible things to other people.",
          "timestamp": "2022-05-20 12:29:43",
          "score": 1,
          "num_children": 0,
          "author": 219851,
          "replies": []
        }
      ]
    },
    {
      "id": "i982r2w",
      "text": "So surely your grandparents are now burning in their biblical Hellfire; what of the dogs?",
      "timestamp": "2022-05-19 17:08:35",
      "score": 63,
      "num_children": 1,
      "author": 207914,
      "replies": [
        {
          "id": "i98g4bp",
          "text": "All dogs go to heaven. Then their pee rains down to help fuel the hellfire.",
          "timestamp": "2022-05-19 18:38:58",
          "score": 44,
          "num_children": 0,
          "author": 310952,
          "replies": []
        }
      ]
    },
    {
      "id": "i98fmf0",
      "text": "The only concept of good and bad Christians understand is are you Christian or not. \n\nThe kindest, generous, selfless atheist is evil while the vilest Christian is good.",
      "timestamp": "2022-05-19 18:35:33",
      "score": 60,
      "num_children": 2,
      "author": 199255,
      "replies": [
        {
          "id": "i98t2dn",
          "text": "My mom is a devout Christian, Billy Graham magazine subscriber, “personal relationship with Jesus Christ” type. She is also just a mean-spirited, selfish, judgmental, gossipy, grudge-holding, narrow-minded bigot. It boggles my mind that she considers herself a good Christian who is going to heaven and she isn’t even a nice person. Maybe I’m too close to the situation but that’s almost worse than being downright evil to me.",
          "timestamp": "2022-05-19 20:07:06",
          "score": 30,
          "num_children": 1,
          "author": 131419,
          "replies": [
            {
              "id": "i98uqjb",
              "text": "There are good people who are Christians of course but I find people like your mom are the majority for sure. The scariest part to me is they think that being a “mean-spirited, selfish, judgmental, gossipy, grudge-holding, narrow-minded bigot” as you put it is actually good and moral behaviour. Religion has twisted them so bad.",
              "timestamp": "2022-05-19 20:18:39",
              "score": 16,
              "num_children": 0,
              "author": 199255,
              "replies": []
            }
          ]
        },
        {
          "id": "i98ugov",
          "text": "Excellent point. Applies to politics, too, obviously",
          "timestamp": "2022-05-19 20:16:46",
          "score": 1,
          "num_children": 0,
          "author": 189808,
          "replies": []
        }
      ]
    },
    {
      "id": "i98c0mh",
      "text": "I truly appreciate the effort to write that. I couldn't finish it. Just too hard to contemplate that level of cruelty.",
      "timestamp": "2022-05-19 18:10:50",
      "score": 45,
      "num_children": 0,
      "author": 260197,
      "replies": []
    },
    {
      "id": "i98lb5l",
      "text": "I've noticed conservatives in general have less compassion for living creatures.",
      "timestamp": "2022-05-19 19:14:12",
      "score": 52,
      "num_children": 2,
      "author": 216533,
      "replies": [
        {
          "id": "i99k9t9",
          "text": "Sometimes I'm not sure if conservatives even care about themselves.",
          "timestamp": "2022-05-19 23:49:13",
          "score": 6,
          "num_children": 0,
          "author": 318056,
          "replies": []
        },
        {
          "id": "i99t6l6",
          "text": "This is true, but then if you ask progressives to extend that compassion to animals outside of pet animals to animals like pigs/cows/chickens and suddenly that compassion matters a lot less than taste buds",
          "timestamp": "2022-05-20 01:04:31",
          "score": 7,
          "num_children": 0,
          "author": 77416,
          "replies": []
        }
      ]
    },
    {
      "id": "i986ho1",
      "text": "Fucking monster. I’m sorry you had grandparents like that. I can only hope that you had therapy for what you saw, and that no one is continuing breeding the dogs. It’s horrific what “good Christians” will do to make money or obtain power.",
      "timestamp": "2022-05-19 17:33:38",
      "score": 46,
      "num_children": 0,
      "author": 13140,
      "replies": []
    },
    {
      "id": "i98m2e2",
      "text": "I saw a puppy mill once. Same situation- dogs in cages to the ceiling of a huge barn.\n\nI was so disgusted. This was on a Mennonite farm in Virginia. I was delivering things to their farm and they thought nothing of a random fellow child of a farmer seeing it.\n\nThe most religious you can be. They didn't have phones yall. But making money off dogs was apparently fine in gods eyes. Religion + capitalism is a horrific combination\n\nWhat was crazy is everyone in that area had cattle. But you couldn't treat cattle like that- the USDA won't let you sell a sick cow and other farmers would get on you for ruining the meat and producing poor quality animals if nothing else.\n\nI also reported them and contacted the rescue society of that breed and told them as well, and they said they were already aware of it and couldn't do anything. Law knew. Nobody could do anything.",
      "timestamp": "2022-05-19 19:19:18",
      "score": 31,
      "num_children": 1,
      "author": 236654,
      "replies": [
        {
          "id": "i998ew4",
          "text": "Burn it to the ground.",
          "timestamp": "2022-05-19 22:11:42",
          "score": 6,
          "num_children": 1,
          "author": 319831,
          "replies": [
            {
              "id": "i99ql6s",
              "text": "Not with the dogs inside",
              "timestamp": "2022-05-20 00:42:58",
              "score": 4,
              "num_children": 1,
              "author": 231914,
              "replies": [
                {
                  "id": "i99te0h",
                  "text": "Well sure, rescue them first",
                  "timestamp": "2022-05-20 01:06:10",
                  "score": 1,
                  "num_children": 0,
                  "author": 319831,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i990cpt",
      "text": "[deleted]",
      "timestamp": "2022-05-19 21:10:17",
      "score": 26,
      "num_children": 1,
      "replies": [
        {
          "id": "i9913f6",
          "text": "I went vegan after I admitted I was an atheist. Cool to see another vegan on the atheist subreddit.",
          "timestamp": "2022-05-19 21:16:02",
          "score": 23,
          "num_children": 4,
          "author": 96503,
          "replies": [
            {
              "id": "i99280r",
              "text": "[deleted]",
              "timestamp": "2022-05-19 21:24:32",
              "score": 11,
              "num_children": 1,
              "replies": [
                {
                  "id": "i992zdh",
                  "text": "It’s been 6months since I went vegan. I was doing a half plant-based half-Omni for environmental reasons for 4months prior. I travel for work so it was easier to be Omni at home than spend my very limited time arguing with my wife to buy my food for me. Since the pandemic, I had kind of finally built myself a non-religious based moral compass and ethics which was basically I decide my purpose and I wanted to decrease suffering and increase compassion. Well, I found veganism was the best way to do that. Plus, I love animals and not being a hypocrite with my values.",
                  "timestamp": "2022-05-19 21:30:22",
                  "score": 11,
                  "num_children": 0,
                  "author": 96503,
                  "replies": []
                }
              ]
            },
            {
              "id": "i998icj",
              "text": "There's a lot of us! Morality comes from the heart, not the patriarchy.",
              "timestamp": "2022-05-19 22:12:26",
              "score": 11,
              "num_children": 1,
              "author": 319831,
              "replies": [
                {
                  "id": "i999yn1",
                  "text": "Yea, I’m in the vegan subreddit as well. It gave me the necessary information to help me go vegan. There are a lot of atheist in that subreddit I’ve noticed. I don’t know why but I see people asking religious affiliation from time to time there.",
                  "timestamp": "2022-05-19 22:23:52",
                  "score": 9,
                  "num_children": 0,
                  "author": 96503,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9as509",
              "text": "Another one here! :)",
              "timestamp": "2022-05-20 06:47:59",
              "score": 3,
              "num_children": 0,
              "author": 412028,
              "replies": []
            },
            {
              "id": "i9atcai",
              "text": "Same",
              "timestamp": "2022-05-20 07:04:29",
              "score": 3,
              "num_children": 0,
              "author": 315609,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i982dtq",
      "text": "Puppy mill people are the worst.  F'n monsters",
      "timestamp": "2022-05-19 17:06:06",
      "score": 115,
      "num_children": 4,
      "author": 132509,
      "replies": [
        {
          "id": "i988297",
          "text": "What they do is criminal. Disgusting.",
          "timestamp": "2022-05-19 17:44:05",
          "score": 30,
          "num_children": 1,
          "author": 16178,
          "replies": [
            {
              "id": "i98c35j",
              "text": "In their minds financial success means they're godly, and if they're godly then by definition anything they do is godly. They very likely saw no moral issues with any of it.\n\nEdit: typo",
              "timestamp": "2022-05-19 18:11:20",
              "score": 25,
              "num_children": 1,
              "author": 237587,
              "replies": [
                {
                  "id": "i98ou4z",
                  "text": "It's genuinely insane how self described \"good christian families\" make absurd excuses for horrible acts like this. A kid I was friends with at school grew up in a household like that, where his parents were excessively religious and constantly looked down on anyone who didn't share their degree of religious values. The same family also had four foster children (in addition to 5 or 6 biological children) who they received income for being care givers for, two of whom were severely mentally handicapped. Those foster kids were basically put in a room on the far side of the house and left in diapers with a TV playing veggie tales 24/7. I had a few sleepovers at his house and aside from his oldest brother all of the biological sibilings just treated the non handicapped kids like shit... Constantly throwing shit at them, calling them names, and bullying them without any sense of remorse or concern.",
                  "timestamp": "2022-05-19 19:38:10",
                  "score": 14,
                  "num_children": 0,
                  "author": 97899,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i99t3b8",
          "text": "Almost identical in terms of cruelty to factory farming. Do you eat meat? Are you not then a \"F'n monster\" too?",
          "timestamp": "2022-05-20 01:03:47",
          "score": 9,
          "num_children": 2,
          "author": 77416,
          "replies": [
            {
              "id": "i9aod5u",
              "text": "Yeah I face that internal dilemma when i read stories like this. I despise puppy farming and hearing stories like this makes me mad but then at the same time, am I really in a position to judge as we eat chicken 3 or 4 times a week that probably came out of a farm very similar.\n\nIn summary, fuck them and fuck me I guess.",
              "timestamp": "2022-05-20 05:59:20",
              "score": 3,
              "num_children": 1,
              "author": 311142,
              "replies": [
                {
                  "id": "i9b0n3d",
                  "text": "At least you're honest. Now you just need to align your actions with your morals.",
                  "timestamp": "2022-05-20 08:52:50",
                  "score": 5,
                  "num_children": 0,
                  "author": 118924,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9ckch7",
              "text": "/u/Dudeist-Priest imagine being such a coward that you're out here calling people f'n monsters yet when it's pointed out you do/support the same things you just ignore it because your ego can't handle the reality. I personally have too much self respect to blatantly lie to myself like that but I guess your low moral standards extend further than just animal abuse.",
              "timestamp": "2022-05-20 16:41:49",
              "score": 1,
              "num_children": 1,
              "author": 77416,
              "replies": [
                {
                  "id": "i9clgs9",
                  "text": "I actually originally upvoted your comment because I thought it made a good point.  And it's funny that you assume I'm a big meat eater, when in fact, I eat very little meat and most of what I do eat is local.  \n\nThat being said, there is a HUGE difference between an ethical dog breeder and a puppy mill just like there is a difference between meat producers.\n\nSo get off your f'n high horse you sanctimonious douchebag.  I don't owe you a response to a comment.  But here it is anyway.",
                  "timestamp": "2022-05-20 16:49:06",
                  "score": 1,
                  "num_children": 1,
                  "author": 132509,
                  "replies": [
                    {
                      "id": "i9cmkxp",
                      "text": "> \n> That being said, there is a HUGE difference between an ethical dog breeder and a puppy mill just like there is a difference between meat producers.\n\nOf course, but in the US 99% of meat comes from factory farms so the \"not all meat!!11!!\" excuse is not valid.\n\nIf you're calling people fucking monsters, make sure you're not throwing stones from a glass house",
                      "timestamp": "2022-05-20 16:56:26",
                      "score": 1,
                      "num_children": 0,
                      "author": 77416,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i9afru7",
          "text": "Any form of animal agriculture is horrible. \n\nPigs are smarter than dogs and cows are basically big dogs. \n\nNone of these animals deserve to be needlessly treated for the sake of greed/pleasure of others when we can get all the nutrients we need from plants.\n\nAnimal agriculture is also the driving force behind the current mass extinction of wildlife. \n\n>  “A vegan diet is probably the single biggest way to reduce your impact on planet Earth, **not just greenhouse gases, but global acidification, eutrophication, land use and water use**,” said Joseph Poore, at the University of Oxford, UK, who led the research. **“It is far bigger than cutting down on your flights or buying an electric car,” he said, as these only cut greenhouse gas emissions.\"**\n\n[The new research shows that without meat and dairy consumption, global farmland use could be reduced by more than 75% – an area equivalent to the US, China, European Union and Australia combined – and still feed the world. **Loss of wild areas to agriculture is the leading cause of the current mass extinction of wildlife.**](https://www.theguardian.com/environment/2018/may/31/avoiding-meat-and-dairy-is-single-biggest-way-to-reduce-your-impact-on-earth)",
          "timestamp": "2022-05-20 04:21:03",
          "score": 5,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i99esmp",
          "text": "Sounds nothing like any farming I've been around either.\n\nMy dad used to work on a factory farm, and stories he's told are.... unhappy, but not cruel. Like, they don't let the animals live in filth or stay wounded, anything that affects their health is undesirable.\n\nSure they're bred for the meat factory, but between those two points the animal needs to be healthy. A cruel means of culling them is also inefficient and dangerous.",
          "timestamp": "2022-05-19 23:03:02",
          "score": 0,
          "num_children": 0,
          "author": 7759,
          "replies": []
        }
      ]
    },
    {
      "id": "i98ih4e",
      "text": "[removed]",
      "timestamp": "2022-05-19 18:54:57",
      "score": 22,
      "num_children": 1,
      "replies": [
        {
          "id": "i98y50c",
          "text": "I went to Christian schools from third grade... I kinda agree.",
          "timestamp": "2022-05-19 20:53:35",
          "score": 3,
          "num_children": 0,
          "author": 21938,
          "replies": []
        }
      ]
    },
    {
      "id": "i9889tz",
      "text": "How long ago was this?\n\nIs it still happening now?",
      "timestamp": "2022-05-19 17:45:28",
      "score": 17,
      "num_children": 1,
      "author": 369192,
      "replies": [
        {
          "id": "i98911b",
          "text": "This was in the late 90s, my grandparents and my dad are both dead now.  My grandfather did get really severe, progressive MS and went from walking to wheelchair in less than 6 months and died a year later so he did have a bad end.",
          "timestamp": "2022-05-19 17:50:30",
          "score": 56,
          "num_children": 2,
          "author": 21489,
          "replies": [
            {
              "id": "i98evf2",
              "text": "Good.",
              "timestamp": "2022-05-19 18:30:25",
              "score": 29,
              "num_children": 0,
              "author": 281733,
              "replies": []
            },
            {
              "id": "i98ongg",
              "text": "Do you know for sure it doesn’t still exist? Maybe another good Christian took over the operation. I’m assuming the property is no longer in the family so you definitely wouldn’t want to go collect some photographic evidence if it is still running. Just remember YOU don’t need a search warrant for evidence to be admissible, and a judge would likely throw out a trespassing charge if you were doing it to shut down a known puppy mill. All that being said, I don’t recommend this but I would do it myself to save those poor pups.\n\nEdit- I’m sure many on this sub or Reddit in general would be willing to do some investigating with a few details.",
              "timestamp": "2022-05-19 19:36:53",
              "score": 11,
              "num_children": 1,
              "author": 74700,
              "replies": [
                {
                  "id": "i98r2f5",
                  "text": "After my grandfather died, they sold that property to a neighbor…who then immediately sold it to a developer for way more money.  It is a community of ridiculous huge houses.",
                  "timestamp": "2022-05-19 19:53:28",
                  "score": 21,
                  "num_children": 1,
                  "author": 21489,
                  "replies": [
                    {
                      "id": "i98xiib",
                      "text": "Well, that gives me a little peace of mind. I just don’t understand how anyone could do that to a living being.",
                      "timestamp": "2022-05-19 20:48:55",
                      "score": 9,
                      "num_children": 0,
                      "author": 74700,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i98kcv6",
      "text": "Sadly this doesn't surprise me a bit.  The Amish are also well known for operating puppy mills.",
      "timestamp": "2022-05-19 19:07:43",
      "score": 17,
      "num_children": 0,
      "author": 81465,
      "replies": []
    },
    {
      "id": "i98jkev",
      "text": "Pretty sure the Bible said that animals are put here for humans to use to their advantage. \n\nThey value HUMAN life. Supposedly. \n\nThis doesn't go against Christianity at all.",
      "timestamp": "2022-05-19 19:02:19",
      "score": 12,
      "num_children": 0,
      "author": 52737,
      "replies": []
    },
    {
      "id": "i98gw1z",
      "text": "Reading this makes me so mad I have tears in my eyes. What in the ever-loving fuck...",
      "timestamp": "2022-05-19 18:44:13",
      "score": 8,
      "num_children": 1,
      "author": 231690,
      "replies": [
        {
          "id": "i9cowrs",
          "text": "Just wait until you learn about how bacon is made.",
          "timestamp": "2022-05-20 17:11:57",
          "score": 1,
          "num_children": 0,
          "author": 366772,
          "replies": []
        }
      ]
    },
    {
      "id": "i98pmjv",
      "text": "Read this in the middle of a zoom meeting, and I'm literally trying to hold back tears (bad idea to read this during a meeting). This is another reason why I'm against religion and specifically Christianity. The hypocrisy with Christianity is beyond me.",
      "timestamp": "2022-05-19 19:43:39",
      "score": 8,
      "num_children": 0,
      "author": 107697,
      "replies": []
    },
    {
      "id": "i99e825",
      "text": "Where I live in central Indiana we are surrounded by Amish puppy mills. They are right up there with the worst humans. They treat animals so poorly and I’ve heard of lots of sexual abuse of children in their communities also. Terrible people that should burn in fake hell.",
      "timestamp": "2022-05-19 22:58:21",
      "score": 10,
      "num_children": 0,
      "author": 56621,
      "replies": []
    },
    {
      "id": "i989d1v",
      "text": "Sounds like horror game/movie setup",
      "timestamp": "2022-05-19 17:52:44",
      "score": 6,
      "num_children": 0,
      "author": 243075,
      "replies": []
    },
    {
      "id": "i98hg6n",
      "text": "God only values christian human lives, didn't you know? Bit of a cunt",
      "timestamp": "2022-05-19 18:48:01",
      "score": 7,
      "num_children": 0,
      "author": 260494,
      "replies": []
    },
    {
      "id": "i98m8kw",
      "text": "Reminds me of an old German saying: \"*The hand that protects can strike just as easily*\".\n\nMore often than not, it does - particularly, if it's a 'virtuous' one.",
      "timestamp": "2022-05-19 19:20:26",
      "score": 8,
      "num_children": 0,
      "author": 24896,
      "replies": []
    },
    {
      "id": "i98r3t5",
      "text": "Being a Christian doesn't mean you're a good person🙄🙄🙄. Most Christians I know are hypocrites and only using their religion as a shield for terrible internal moral compass. The money part is irrelevant IMO.",
      "timestamp": "2022-05-19 19:53:44",
      "score": 7,
      "num_children": 0,
      "author": 21339,
      "replies": []
    },
    {
      "id": "i99bheh",
      "text": "Because God put animals here for us to use. That's the excuse I ALWAYS hear when I question a Christian on why they have no problem being a brutal savage with no concern for anything that doesn't think and look like them. They are mean to animals, children, and anyone who is different in appearance or beliefs.",
      "timestamp": "2022-05-19 22:36:03",
      "score": 6,
      "num_children": 0,
      "author": 19707,
      "replies": []
    },
    {
      "id": "i98vq1z",
      "text": "I'm sorry I read that.\n\nMy wife and I foster dogs for a rescue, so we've seen and heard more than enough to know how shitty people are towards animals. Still, the thing with the baseball bat got to me.",
      "timestamp": "2022-05-19 20:31:05",
      "score": 6,
      "num_children": 0,
      "author": 265067,
      "replies": []
    },
    {
      "id": "i99117t",
      "text": "The Amish, who are supposedly such peaceful loving Christians, are infamous for their puppy mills. They think of animals as having no souls and therefore not even self-aware.\n\nWe adopted my boyhood dog from the local ASPCA pound. He was a puppy who had been given up by a family who's daughter was allergic. He was a mutt (not purebred) and he was an intelligent and loving part of the family. No one can convince me that he wasn't a self-aware being who understood at some level a lot of what was going on around him.",
      "timestamp": "2022-05-19 21:15:33",
      "score": 5,
      "num_children": 0,
      "author": 74312,
      "replies": []
    },
    {
      "id": "i99bxp2",
      "text": "My wife and I have had three dogs.  The first was a male shih tzu that came from a backyard breeder.  We thought we were buying from a family, but it was obvious shih tzu puppies were a side business for them.  He was a good boy, but he had manageable behavioural problems.  The second came from a loving home and was the sweetest little dog.  The third was an SPCA rescue, an ~18 month female that was born in a puppy mill and kept as breeding stock because she had a bad hip and a collapsed trachea affecting her breathing making her unlikely to sell.  Although she was only about 18 months when we got her, she had already had at least two litters according to our vet.  Being so tiny, the pregnancy damaged her internal organs, and when she was fixed at the spca they couldn't get all the hormone producing tissue, so she still goes into heat.  We've taken great care of her, and she'll turn 14 sometime around next month, but the effects of her first 18 months are apparent in her gait and her breathing.\n\nFuck these people, I hope they all get shut down and fined into bankruptcy.",
      "timestamp": "2022-05-19 22:39:40",
      "score": 6,
      "num_children": 0,
      "author": 159266,
      "replies": []
    },
    {
      "id": "i99orqw",
      "text": "Very related https://www.dominionmovement.com/watch",
      "timestamp": "2022-05-20 00:27:36",
      "score": 5,
      "num_children": 0,
      "author": 28618,
      "replies": []
    },
    {
      "id": "i98nx2u",
      "text": "Small comfort to know that when those two POSes died, their disgusting puppy mill operation died with them.\n\nAdopt, don’t shop.",
      "timestamp": "2022-05-19 19:31:49",
      "score": 14,
      "num_children": 2,
      "author": 27246,
      "replies": [
        {
          "id": "i98pc1h",
          "text": "Why do people always have to live in black and white",
          "timestamp": "2022-05-19 19:41:37",
          "score": -4,
          "num_children": 0,
          "author": 348972,
          "replies": []
        },
        {
          "id": "i98p96k",
          "text": "What if I want an American Hairless Terrier for specific reason?",
          "timestamp": "2022-05-19 19:41:04",
          "score": -6,
          "num_children": 3,
          "author": 348972,
          "replies": [
            {
              "id": "i99w5kv",
              "text": "I'm a strong believer in \"adopt, don't shop,\" but if people need a specific breed for some reason, there are plenty of ways to do it without supporting horrible businesses like this one. \n\nIf you buy from a pet store or online seller, it's almost always from a puppy mill. Breeders who care about their dogs usually only have one litter at a time and they will happily let you meet the litter's parents.\n\nI do a lot of volunteering for dog rescues, so I just wanted to share this information in case you were looking to buy a dog (although rescues are the best!)",
              "timestamp": "2022-05-20 01:28:45",
              "score": 8,
              "num_children": 0,
              "author": 167773,
              "replies": []
            },
            {
              "id": "i98qt10",
              "text": "What would that reason be?",
              "timestamp": "2022-05-19 19:51:41",
              "score": 6,
              "num_children": 1,
              "author": 286151,
              "replies": [
                {
                  "id": "i9b09cp",
                  "text": "I'm allergic to cat and dog fur and dander and I need a medium sized dog that can be energetic and courageous when need be. I hate seeing dogs in shelters and would love to adopt all of them but I can't support someone else's bad decisions.",
                  "timestamp": "2022-05-20 08:47:18",
                  "score": 2,
                  "num_children": 0,
                  "author": 348972,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9atf2t",
              "text": "You'll have to convert to Christianity. With God, everything is permissible.",
              "timestamp": "2022-05-20 07:05:33",
              "score": 1,
              "num_children": 0,
              "author": 315609,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i98qr9g",
      "text": "My fiirst real job was at a winery. Nice enough hick couple was top waiters. They didnt push it on me but were both evangelical christians. And ran a puppy mill.",
      "timestamp": "2022-05-19 19:51:21",
      "score": 5,
      "num_children": 0,
      "author": 399168,
      "replies": []
    },
    {
      "id": "i98gw0w",
      "text": "I had to stop reading halfway through. That’s so horrible",
      "timestamp": "2022-05-19 18:44:13",
      "score": 3,
      "num_children": 0,
      "author": 7662,
      "replies": []
    },
    {
      "id": "i98nx65",
      "text": "Human conceit at its worst.",
      "timestamp": "2022-05-19 19:31:50",
      "score": 2,
      "num_children": 0,
      "author": 134763,
      "replies": []
    },
    {
      "id": "i98ss7r",
      "text": "It's the convenient aspects of christianity that allow them to do certain horrible things that piss me off the most. They think that their only morality needs to come from whatever the current iteration of the Bible is. Anything else is permissible regardless of how vile and evil it is. \n\nThe whole \"animals not having souls\" thing was the first step, then it became heretics are okay to kill too. \n\nGood riddance to your piece of shit grandparents",
      "timestamp": "2022-05-19 20:05:11",
      "score": 4,
      "num_children": 0,
      "author": 301466,
      "replies": []
    },
    {
      "id": "i98tozw",
      "text": "Well, if *that's* not definitive proof that \"Christian\" doesn't automatically equate to \"moral,\" I don't know what is. Turns out they're just as capable of being cruel monsters as anyone else.",
      "timestamp": "2022-05-19 20:11:28",
      "score": 3,
      "num_children": 0,
      "author": 314755,
      "replies": []
    },
    {
      "id": "i98z2ub",
      "text": "The Amish are notorious for puppy mills too.",
      "timestamp": "2022-05-19 21:00:34",
      "score": 3,
      "num_children": 0,
      "author": 282644,
      "replies": []
    },
    {
      "id": "i990zwq",
      "text": "Wow, I wish I had not read this. I’ve been against animal breeding longer than I’ve been an atheist. Also, this behavior happens in slaughterhouses all around the world for many many different types of animals. So, it’s not just religious nuts that are capable of murderous acts.",
      "timestamp": "2022-05-19 21:15:16",
      "score": 3,
      "num_children": 0,
      "author": 96503,
      "replies": []
    },
    {
      "id": "i996vss",
      "text": "As a vet who has a service dog , these people are can rightfully fuck themselves with a broken bottle.",
      "timestamp": "2022-05-19 21:59:59",
      "score": 4,
      "num_children": 0,
      "author": 363962,
      "replies": []
    },
    {
      "id": "i99741h",
      "text": "Why should Christians care a damn thing for this world? They don't give a fuck how much they wreck or how much pain they cause because the REAL life is with big daddy in the sky and the beautiful perfect heaven he lives in.\n\nWhat a philosophy of life.  Screw all you non-believers and whatever else here on earth I'm going to a better place.  \n\nRELIGION IS THE BANE IF HUMANITY. IT MUST BE STOPPED. IT HURTS US ALL.",
      "timestamp": "2022-05-19 22:01:41",
      "score": 3,
      "num_children": 0,
      "author": 1045,
      "replies": []
    },
    {
      "id": "i99aptr",
      "text": "OP this is grim, sad and horrible. I'm sorry you had to see all of that abuse.",
      "timestamp": "2022-05-19 22:29:55",
      "score": 5,
      "num_children": 0,
      "author": 345801,
      "replies": []
    },
    {
      "id": "i99fgey",
      "text": "Many Amish people are in business like this too. No care for the lives at all. All about $$$\n\nI’m active in animal rights and it’s certainly known how many of these puppy mills there are and how many people that run them consider themselves Christians\n\nSadly other Christians buy the dogs and the circle continues \n\nI’m sorry you had to see this as a young child. I had a stepfather who did all kinds of abuse upon animals and humans and it still gives me nightmares 40 years later",
      "timestamp": "2022-05-19 23:08:34",
      "score": 5,
      "num_children": 0,
      "author": 411633,
      "replies": []
    },
    {
      "id": "i99kow2",
      "text": "If more people knew about these conditions, they would think twice before supporting such a business. Slaughterhouses and dairy farms are not really different.",
      "timestamp": "2022-05-19 23:52:50",
      "score": 2,
      "num_children": 0,
      "author": 357320,
      "replies": []
    },
    {
      "id": "i98klxv",
      "text": "I'm a high end dog breeder thats very well connected to the breeding world at large (for my breed).  Consistently there is nobody worse to animals than quakers, shakers, Pennsylvania dutch, menonites, etc.",
      "timestamp": "2022-05-19 19:09:26",
      "score": 19,
      "num_children": 0,
      "author": 256671,
      "replies": []
    },
    {
      "id": "i998g1u",
      "text": "I wonder how many people bought those puppies and justified buying from a breeder by saying “well they are christians like me so of course they must be good people.” Makes me sick.",
      "timestamp": "2022-05-19 22:11:57",
      "score": 3,
      "num_children": 1,
      "author": 197220,
      "replies": [
        {
          "id": "i999yi5",
          "text": "I remember when the live action movie version of 101 Dalmatians came out in the late 90s we saw a poster in the theater and my dad made a passing comment about how in demand the Dalmatian puppies were.  It made me physically sick, I thought about it for so long afterwards.",
          "timestamp": "2022-05-19 22:23:50",
          "score": 3,
          "num_children": 0,
          "author": 21489,
          "replies": []
        }
      ]
    },
    {
      "id": "i99hv06",
      "text": "Humanity is proof there is no God. Disgusting creatures left to our own vices sometimes.",
      "timestamp": "2022-05-19 23:28:55",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i99hy69",
      "text": "This is so sad and not surprising at all. I think seeing Evangelicals up close in their own element was one of the things that made me realize there is no Gods of any kind. I grew up around many of them. I've often wondered if I would've ever become an Atheist without being exposed to them truly up close and personal. I don't think I would've sadly.",
      "timestamp": "2022-05-19 23:29:39",
      "score": 3,
      "num_children": 0,
      "author": 362330,
      "replies": []
    },
    {
      "id": "i99l0eb",
      "text": "They don't care about animals, animals don't go to heaven. Just like nature, they're here to be ravaged, abused and uncared for. This is all a temporary gift from their god.",
      "timestamp": "2022-05-19 23:55:35",
      "score": 3,
      "num_children": 0,
      "author": 69372,
      "replies": []
    },
    {
      "id": "i99oxpi",
      "text": "I wish I could smash your grandfather's and grandmother's heads with a bat. Got my blood is boiling.",
      "timestamp": "2022-05-20 00:29:01",
      "score": 3,
      "num_children": 0,
      "author": 256559,
      "replies": []
    },
    {
      "id": "i9adr0a",
      "text": "Were they the kind of evangelicals that raged against the concept of evolution, too? You know, despite seeing its horrific aspects played out in their nightmare barn for decades on end?",
      "timestamp": "2022-05-20 04:00:36",
      "score": 3,
      "num_children": 0,
      "author": 102476,
      "replies": []
    },
    {
      "id": "i9aejma",
      "text": "Bro those same Christians have repeatedly tried to exterminate groups of humans for being different in a small way.\n\nTo them a dog is absolutely nothing",
      "timestamp": "2022-05-20 04:08:30",
      "score": 3,
      "num_children": 0,
      "author": 96689,
      "replies": []
    },
    {
      "id": "i9aggbs",
      "text": "These people will literally say that atheist are demons and can't tell right from wrong without believing in god and see nothing wrong with this...",
      "timestamp": "2022-05-20 04:28:04",
      "score": 3,
      "num_children": 0,
      "author": 80744,
      "replies": []
    },
    {
      "id": "i9aq6lj",
      "text": "I don't comment usually but what in the fuckity uckity fuck.",
      "timestamp": "2022-05-20 06:22:10",
      "score": 3,
      "num_children": 0,
      "author": 234885,
      "replies": []
    },
    {
      "id": "i9at53v",
      "text": "This sounds pretty Christian to me. They usually believe they are owners of the World and all the non-human animals in them; for them to use and abuse, as a gift from their god. Dog farming is not different than any of the other animal farming that's practiced and Christians have tried to declare non-human animals as \"objects\" for a very long time, it's literally in their apologetics. They do not want humans to be considered animals, and that has business benefits too.",
      "timestamp": "2022-05-20 07:01:45",
      "score": 3,
      "num_children": 0,
      "author": 315609,
      "replies": []
    },
    {
      "id": "i9axzck",
      "text": "Proverbs 12:10 A righteous man regards the life of his animal,\nBut the tender mercies of the wicked are cruel.\n\nFellow \"Christians\" make me very angry. I had one of those old men who watched megachurches on tv pull a gun on me. He hated it when I called him out on his hypocrisy...",
      "timestamp": "2022-05-20 08:12:45",
      "score": 3,
      "num_children": 0,
      "author": 327553,
      "replies": []
    },
    {
      "id": "i9bdx24",
      "text": "Sadly that's the expected outcome when humans are declared as \"not animals\" and animals just as \"things\" that humans shall have \"dominion\" over.",
      "timestamp": "2022-05-20 11:34:35",
      "score": 3,
      "num_children": 1,
      "author": 170410,
      "replies": [
        {
          "id": "i9cv354",
          "text": "Should have linked the documentary when you mentioned \"[dominion](https://youtu.be/LQRAfJyEsko)\".",
          "timestamp": "2022-05-20 17:54:33",
          "score": 1,
          "num_children": 0,
          "author": 366772,
          "replies": []
        }
      ]
    },
    {
      "id": "i9btks3",
      "text": "I am an atheist, but I come from a Catholic background, and I was enmeshed in an Evangelical youth group as a teen, as well as a a “non-denominational” youth group where I developed some religious trauma that makes me bitter. I don’t believe in the afterlife but I do have fantasies of reincarnation. It’s the only sort of afterlife scenario that makes sense to me and provides and sort of true justice/learning/growing/etc. I have this wish that when we die we have to come back and live the lives of all the people we hurt. In that scenario, your grandfather would live many times over his own brutality in the form of each dog he tortured, suffering at his own hand. He would have to see himself through the eyes of each dog being strangled, bludgeoned, overbred, etc. It only seems fair.",
      "timestamp": "2022-05-20 13:42:34",
      "score": 3,
      "num_children": 0,
      "author": 195682,
      "replies": []
    },
    {
      "id": "i9bug17",
      "text": "As someone who has had Dalmatians most my life, also currently have a five year old male and five month old female, I could only skim this. I’m about ready to cry. My dals are my babies. My last girl was my whole life and I’ve had to tell so many people not to get these dogs. They are not like the movies. The movie cause so much of this right here. Bread disease, aggression, and causes so much torture for the dogs. They are now seen as aggressive and terrible dogs to many, but you know what? Fine. If that keeps your ass from having one, I’m glad. They aren’t labs. They aren’t retrievers. They are highly intelligent, stubborn, and hyper dogs. They do eventually mellow out tho and my god, if I just don’t feel the most love in the world from these guys. There was a time half were in shelters by the time they were a year old. These people contributed to the breeds destruction. Only due to the loving and caring breeders have they finally made a comeback in recent years. This absolutely tears my heart out",
      "timestamp": "2022-05-20 13:48:48",
      "score": 3,
      "num_children": 0,
      "author": 333616,
      "replies": []
    },
    {
      "id": "i9butut",
      "text": "I think there are few things that are guaranteed to make you question god at a young age more than the suffering of innocents. Animals, kids, or even people you think or know are good having something terrible happen to them.\n\nKnowing there are so many monsters out there who willingly do this to animals only for monetary gain is something I shouldn't be in disbelief of, but am still just appalled by all of it. People who can take advantage of a things innocence are to me, the worst kind of people.\n\nAnd I feel like that's a core trait of religious institutions. But it also seems to be just what drives most people away at some point or another.",
      "timestamp": "2022-05-20 13:51:35",
      "score": 3,
      "num_children": 0,
      "author": 111904,
      "replies": []
    },
    {
      "id": "i9bv7nm",
      "text": "Gotta say, this doesn't surprise me. Multiple churches I was forced to go to as a child taught that animals do not have souls (but humans do) and that humans have complete dominion over them. Ergo, anything we do to them doesn't matter from the angle of their wellbeing, but rather, the humans'. Eg if you rape a dog, it is a sin...but not because you victimized the dog, rather because you have sexual impurities and you gave into the temptation.",
      "timestamp": "2022-05-20 13:54:19",
      "score": 3,
      "num_children": 0,
      "author": 346676,
      "replies": []
    },
    {
      "id": "i9byf0s",
      "text": "This is why I support the death penalty. I think if someone gets caught and convicted of torture of animals or human beings, they take them out back and shoot them dead.",
      "timestamp": "2022-05-20 14:16:44",
      "score": 3,
      "num_children": 0,
      "author": 8409,
      "replies": []
    },
    {
      "id": "i99w9j5",
      "text": "I sympathize with you and the poor animals that had to go through a process like that. As many others have already expressed, this is vile and should be regarded as such. Some even have compared it too slavery, in which it is in many regards.\n\nBut...\n\nI don't wanna get preachy and stuff but I do think it's good that you see the morally bankrupt mindset that is required to run a \"mill\" like that. Breeding and putting animals through misery is truly evil.\n\nI want you to reflect upon that realization and be critical of yourself, as we all should as rational thinkers. Dogs are lovable creatures yet they unfortunately aren't that different from other animals, we just love them more because they are near and dear to us. Other animals suffer similar if not worse fates in slaughter houses and industrial farms. Mother's get their calf's taken away within days if not hours cause we want their milk.\n\nFrom one human to another, I implore you to view your actions and the indirect impact that might have on other living creatures. Perhaps we can do without milk, beef or pork and try (as much as possible) to not put any animal through needless pain for our enjoyment!\n\nI'm not a preachy vegan, I just try to be mindful and consistent in how I view actions. Don't hate on me just because I brought it up!",
      "timestamp": "2022-05-20 01:29:39",
      "score": 6,
      "num_children": 1,
      "author": 339741,
      "replies": [
        {
          "id": "i9cuu12",
          "text": "You're preachy and that's okay. People should speak out against animal abuse, and people should stop supporting animal abuse.",
          "timestamp": "2022-05-20 17:52:37",
          "score": 3,
          "num_children": 0,
          "author": 366772,
          "replies": []
        }
      ]
    },
    {
      "id": "i99ajuu",
      "text": "This is horrendous. I agree wholeheartedly with everyone here that calls out animal abuse.\n\nSince you do care about animal abuse, look into the reality of animal agriculture, behind industry propaganda of lush pastures and 'happy animals'. The standard, legal practices in animal agriculture are horrendously abusive. See watchdominion.org for a rundown of standard legal practices in all major animal industries.\n\nSince most people scroll by, let me give some examples of standard practices:\nWe agree that abusing a dog is wrong. Now a question: Would it be worse to kick a dog, or to slit their throat? You can be 100% certain that an animal has been killed at a fraction of their lifespan for any meat you eat. Most chickens are killed at 6 weeks of age, even though they can live to 15 years. At those 6 weeks they suffer from lameness because their legs and joints cannot support the unnaturally large weight they have been bred to grow to within just 6 weeks, and they suffer ammonia burns and respiratory illness from standing and laying in their own feces.\n\nEgg-laying chickens are a different breed from broiler chickens used for meat, and grow more slowly. Only females lay eggs of course, and so the male chicks are considered useless. They are disposed of on their first day of life most commonly by being ground up alive in macerators, or sometimes by being gassed or suffocated in bags. The females have it worse. The ancestors of chickens laid around 12 eggs per year, but we have artificially bred chickens to lay more than 300. This places a large toll on their bodies and many hens suffer from osteoporosis because their calcium goes to making eggs. Most 'cage-free' or 'free-range' chickens are kept in large sheds in incredibly cramped conditions. To optimize productivity it is most efficient to pack as many chickens as possible in a single shed, even if that causes a few percent of chickens to die from the bad conditions. It is the productivity per shed and per input of feed that matters, not the productivity per chicken.\n\nWhy does a cow give milk? Because she has a baby. To run a profitable business, a dairy farmer artificially impregnates their cows every year, then takes away the baby almost as soon as it's born because otherwise they would drink the milk that the farmer wants to sell. Cows and calves have a very strong bond and being separated causes intense anguish.\nMale dairy calves are sold for veal or meat, or just killed at the farm as an undesirable 'waste product'. Cows have been bred to produce as much milk as possible, which also causes them to have high rates of mastitis, udder infection. After 5-6 years of continuous pregnancy the cow's body has either given up completely, or her milk production declines to where it's more profitable to replace her and so she is sent to slaughter. Cows can live to 25.\n\nTL:DR We agree dog abuse is bad. Research the legal, standard practices that are used in animal agriculture and you'll see that similarly egregious abuse is inherent in animal agriculture. Watchdominion.org\n\nFor help making the switch to a lifestyle that doesn't contribute to animal abuse: Challenge22.com\n\nMore info in the sidebar of: r/vegan",
      "timestamp": "2022-05-19 22:28:35",
      "score": 14,
      "num_children": 1,
      "author": 129305,
      "replies": [
        {
          "id": "i9bjdbf",
          "text": "Animal abuse is horrible and those considering vegan lifestyle, by all means go for it.\n\nI do feel like guilt tripping people into anything is wrong and no different than what religion does, so I feel compelled to offer a different take, so people can make decisions for themselves. \n\nAgain, not downplaying factory farming practices, they are horrible and I am all for changing relevant laws. With that said, research can only get you so far, experiencing first hand gives you a much better understanding. Most of you will likely never have an opportunity to live on an actual farm and see where food comes from, so I did it for you! I come from a long line of farmers in European country,  and although I grew up in the city, I spent a few years with my relatives helping on their farms.\n\nLush pastures and happy animals do exist. You won't find their meat in grocery stores though. Those animals are well cared for and slaughtered as painlessly as possible. Humans are omnivores, and while we technically can get nutrition from plant sources, it does not mean it is feasible or healthy for everyone. Some vegans will go as far as feeding their cats (obligatory carnivores) plant based food, which I consider animal abuse. But I digress. Bottom line is, it is entirely possible to not abuse animals and to still continue eating them. We've been doing it for thousands of years, and only recently we've become so disconnected from our food sources. Animals can be food, they can be pets, and as long as they are treated humanely, don't let anyone guilt trip you for being human.",
          "timestamp": "2022-05-20 12:23:18",
          "score": -1,
          "num_children": 2,
          "author": 131415,
          "replies": [
            {
              "id": "i9bsqgb",
              "text": "I also think that the difference between farming and factory farming is literally the factory.\n\nHumans suck at being able to care for living beings under time constraint. Whether you're a farm worker having to feed way too many calves or a nurse with 4 patients on a shift, we can't do it, and neglect, frustration, mistakes and horrific abuse are the result.\n\nThere is farming that allows for cows to run around in the mountains and chase tourists for fun (including yours truly) and have an absolute blast. It's expensive though, and we consumers aren't willing to pay for it. \n\nI have seen people refuse to pay a mere euro more for local dairy that would have ensured survival of farmers whose cows get to jump around in the mountains, but then turn around and reduce meat/whine about factory farming. They also then eat avocados (drought inducing), almond dairy (drought inducing),  quinoa (drought inducing, soil stripping, and indigenous culture destroying), trying to get their nutrients in, all shipped with fossil fuels (war inducing) to the EU. Cool, but you could have also just bought the butter, supported better practices, including sustainability, culture, and securing a local food supply which keeps the factory agriculture out, and ultimately supported less global suffering of all animals (human animals included) all around. \n\nSome animals eat other animals, including the aforementioned chickens (which are omnivores) and pigs (which are ominvores). If you are able to go vegan more power to you. I prefer a flexitarian approach.\n\nBut I support small farming practices because it secures our food, if harnessed could really move the needle on environmental issues, and is interwoven in cultural practices.",
              "timestamp": "2022-05-20 13:36:29",
              "score": 1,
              "num_children": 0,
              "author": 276324,
              "replies": []
            },
            {
              "id": "ia3oj3h",
              "text": "A lot of what I described is standard even in small farms though. All egg-laying chickens come from breeders that kill the male chicks and have the parent chickens living in awful conditions. And all are selectively bred to lay as many eggs as possible, which is not good for their health or well-being.\n\nMilk cows are also bred for maximum milk production giving them a high risk of udder infection and discomfort. They need to be artificially impregnated every year and give birth to keep up milk production. And even small farms separate mother and child almost immediately because otherwise the calf would drink the milk that the farmer needs to sell.\n\nThings like branding, castrating without anaesthetic are common. And the most important: All of these sentient beings will be killed at a fraction of their lifespan. The egg-laying chickens and cows used for milk when their production declines, and the animals raised for meat when they reach slaughter weight. \n\nHow is it acceptable to end the life of another individual for a kind of meal that we do not need? For taste pleasure and convenience?\n\nKeeping it to the topic of this thread: Is it acceptable for me to kill my dog if I've treated them well before killing them? \nThere is a real-life scenario of this, where a YouTube family killed their healthy dog browser. They faced some serious backlash becaguse people (rightly imo) consider this unacceptable.\nwww.youtube.com/watch?v=eEGDe6qTl7M\n\nAnd this small family dog meat farm, producing organic dog meat:\nwww.Elwooddogmeat.com",
              "timestamp": "2022-05-26 19:14:15",
              "score": 1,
              "num_children": 0,
              "author": 129305,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i994pyb",
      "text": "If you take a similar concept, throw a bunch of money into it, and turn it into a massive business it’s called factory farming. In the US it’s companies like Tyson, Cargill, JBS, Smithfield, and Purdue doing things to animals similar to what you’ve described your grandfather doing. It’s absolutely horrible.",
      "timestamp": "2022-05-19 21:43:35",
      "score": 3,
      "num_children": 0,
      "author": 99211,
      "replies": []
    },
    {
      "id": "i98juw0",
      "text": "Good riddance",
      "timestamp": "2022-05-19 19:04:20",
      "score": 2,
      "num_children": 0,
      "author": 208162,
      "replies": []
    },
    {
      "id": "i98x9ka",
      "text": "Yeah family or not that called for a peta activist on crack with a shotty.",
      "timestamp": "2022-05-19 20:47:00",
      "score": 2,
      "num_children": 0,
      "author": 174789,
      "replies": []
    },
    {
      "id": "i98yy7t",
      "text": "Are you kidding? Breeding is what evangelicals are all about. They would lower the age for marriage even more if they could.",
      "timestamp": "2022-05-19 20:59:37",
      "score": 2,
      "num_children": 0,
      "author": 215784,
      "replies": []
    },
    {
      "id": "i99131p",
      "text": "Their dear old gawd doesn't say a word against animal abuse. I'm sure they're content believing they have \"dominion\" over those poor dogs. Makes me wish hell was real and run by animals!",
      "timestamp": "2022-05-19 21:15:57",
      "score": 2,
      "num_children": 0,
      "author": 357261,
      "replies": []
    },
    {
      "id": "i9958i3",
      "text": "I have always believed evangelical Christianity was just one's extreme denial of one's own insecurities and failures in order to avoid personal shame and psychological discomfort. Why do people seek religion, esp evangelism? Usually because they are at a point in their life where they are questioning the purpose of life, and thus, their existence within this time and universe. \n\nThe utter aspect that there is no after life, that there is no final forgiveness, and that there will be no chance to fix one's mistakes is horrifying at first glance. There being nothing in the end means that one's actions are final and thus, their actions create final judgements of their character. Every atheist has confronted this. Some still feel anxiety over the thought. \n\nBut think about who the type of person who would immediately reject the notion of no afterlife, thus no redemption, would be: someone who is easy to influence through psycho-emotional appeals and furthermore, those who feel guilty about their past actions. Hell, it must be easy to indulge in extralegal and extrabiblical behavior when you are forgiven for it by an external source that is not the judicial system. With no afterlife, their character is forever imprinted in time. Facing reality would make them feel so much shame and disappointment that they would rather deny it. Thankfully, it appears religion is just having a final kick out as the toxicity of Christianity spreads via the internet and more people see its ugly face.",
      "timestamp": "2022-05-19 21:47:27",
      "score": 2,
      "num_children": 0,
      "author": 138495,
      "replies": []
    },
    {
      "id": "i995puf",
      "text": ">they died\n\nBest part of the story by far",
      "timestamp": "2022-05-19 21:51:04",
      "score": 2,
      "num_children": 0,
      "author": 36495,
      "replies": []
    },
    {
      "id": "i99bfgk",
      "text": "Man reading this Boiled my blood.\n\nI was hoping to read that you freed the dogs one day, and then burned down the shed. That would've been a great ending",
      "timestamp": "2022-05-19 22:35:38",
      "score": 2,
      "num_children": 0,
      "author": 82972,
      "replies": []
    },
    {
      "id": "i99ct74",
      "text": "Yeah, unfortunately \"be kind to animals\" doesn't seem to be covered by christianity.",
      "timestamp": "2022-05-19 22:46:43",
      "score": 2,
      "num_children": 0,
      "author": 231433,
      "replies": []
    },
    {
      "id": "i99esxo",
      "text": "Your mother reported this anonymously, and nothing happened. Is the puppy mill still going? If so, you need to report it again. Maybe let your local animal rights people know about it, or at least journalists.",
      "timestamp": "2022-05-19 23:03:06",
      "score": 2,
      "num_children": 0,
      "author": 22679,
      "replies": []
    },
    {
      "id": "i99guw5",
      "text": "Once you look at most of the Christians and their business you can see a pattern. Members of the cult seem to miss it but it's there.",
      "timestamp": "2022-05-19 23:20:24",
      "score": 2,
      "num_children": 0,
      "author": 303966,
      "replies": []
    },
    {
      "id": "i99l1x4",
      "text": "This was just horrifying to read. Shows the whole \"christian love\" in all it's glory, though. To think absolutely NOTHING of living, feeling beings just because you think you're more important than them. Fucking disgusting.\n\nWhen it comes to your grandparents, I would be sorry for your loss if they were any kind of decent beings. But in my eyes, they really fucking were not. So I sincerely hope their so-called \"afterlife\" treats them the same way they treated those poor, innocent dogs.",
      "timestamp": "2022-05-19 23:55:56",
      "score": 2,
      "num_children": 0,
      "author": 130942,
      "replies": []
    },
    {
      "id": "i99zmlw",
      "text": "When you are a Christian, heaven becomes the primary world and your existence in this world becomes temporary and bascially just route to get to heaven. They at some point probably reflected on thier treatment of things and their belief in God, but then excused themselves from any moral consquences because as long as they pray and believe, heaven awaits. Christians do not value the Bible as a code to follow or as scripture to study and understand how Jesus would want them to act, but value the Bible as a relief from the moral questions and consequences. \n\n\"The purpose of my life and me\" is always \"Gods will and plan\". So since you life already has that purpose, you can rationalize anything you do as the influence and plan of God. Pray it all away and be devoted, so then all life suffering that you cause or are effected by are just temporary tribulations before you can live in eternal and ethereal existence.",
      "timestamp": "2022-05-20 01:56:46",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9a73el",
      "text": "I'm generally glad the world is finally starting to see that most of the believers in the Abrahamic religions are just awful people who are willing to do what ever they want no matter the lives they hurt or take away.",
      "timestamp": "2022-05-20 02:59:00",
      "score": 2,
      "num_children": 0,
      "author": 355192,
      "replies": []
    },
    {
      "id": "i9a8qjf",
      "text": "Normalize beating the shit out of animal abusers",
      "timestamp": "2022-05-20 03:13:31",
      "score": 2,
      "num_children": 0,
      "author": 18270,
      "replies": []
    },
    {
      "id": "i9ac3te",
      "text": "Pretty much sums up the two parties. One always looking to give, one always looking to take. As long as Faux News tells Republicans they’re the ones giving, they can live with their a absence of morality.",
      "timestamp": "2022-05-20 03:44:33",
      "score": 2,
      "num_children": 0,
      "author": 230535,
      "replies": []
    },
    {
      "id": "i9albvo",
      "text": "Oh OP please tell me this is fake or tell me they shut the mills down once your grandparents have died. The animal abuse you described was just downright horrible.",
      "timestamp": "2022-05-20 05:22:16",
      "score": 2,
      "num_children": 0,
      "author": 201414,
      "replies": []
    },
    {
      "id": "i9aprgv",
      "text": "Call me whatever but your grandfather deserved to be beaten to death with a bat and that is a fact i will stand by",
      "timestamp": "2022-05-20 06:16:51",
      "score": 2,
      "num_children": 0,
      "author": 303618,
      "replies": []
    },
    {
      "id": "i9apy0c",
      "text": "My devout Christian of a mother mother told me when I was young that the Bible says animals are less than humans. I don't know where is says this, but if it's true your grandparents 100% used that as justification for their atrocious \"side-hustle\". \n\nThose poor, poor animals. This made me feel sick.",
      "timestamp": "2022-05-20 06:19:13",
      "score": 2,
      "num_children": 0,
      "author": 166139,
      "replies": []
    },
    {
      "id": "i9aqlid",
      "text": "Please please adopt don’t shop and do what you can in your communities to shut cretins like this down.\nAlso foster dogs and cats if you can",
      "timestamp": "2022-05-20 06:27:33",
      "score": 2,
      "num_children": 0,
      "author": 8467,
      "replies": []
    },
    {
      "id": "i9aqpcp",
      "text": "Not surprising. Christianity is not about merciful or being a good human being.\nIt's only about being a conservative piece of shit and collecting shit loads of money for spreading this religious cancer further.\nPlease note that Pope or other Christian leaders never condemned Nazis, concentration camps, etc. The same we see today with Russian orthodox church, which supports war on Ukraine.\nIt's always about power. \nNever about caring for people.",
      "timestamp": "2022-05-20 06:28:59",
      "score": 2,
      "num_children": 0,
      "author": 45630,
      "replies": []
    },
    {
      "id": "i9ar5s0",
      "text": "\"animals don't have souls so it's fine.\" probably their logic.",
      "timestamp": "2022-05-20 06:35:02",
      "score": 2,
      "num_children": 0,
      "author": 179225,
      "replies": []
    },
    {
      "id": "i9avjkm",
      "text": "The bible specifically gives humans dominion over all living things, so they can do all this and still feel like they're living in a Christian way.  I've always thought it's one of the ways we ended up with factory farms in the first place.",
      "timestamp": "2022-05-20 07:36:10",
      "score": 2,
      "num_children": 0,
      "author": 226051,
      "replies": []
    },
    {
      "id": "i9avu54",
      "text": "Evangelicals believe in what is called the prosperity gospel.  If you are a good person or doing good things God will reward you with material wealth.\n\nThe puppy mill made them stacks so in their twisted minds god wanted them to do this",
      "timestamp": "2022-05-20 07:40:35",
      "score": 2,
      "num_children": 0,
      "author": 18816,
      "replies": []
    },
    {
      "id": "i9awtmd",
      "text": "As someone who knows a lot of farmers and people living in rural areas, you can know everything you want to know about a person by looking at how he treats and farms his animals.\n\nPeople who take real good care of their livestock are usually good people.",
      "timestamp": "2022-05-20 07:55:16",
      "score": 2,
      "num_children": 0,
      "author": 265068,
      "replies": []
    },
    {
      "id": "i9b5cf7",
      "text": "Well if anything will promote atheism it's this horrific story. Take my upvote.",
      "timestamp": "2022-05-20 09:54:26",
      "score": 2,
      "num_children": 0,
      "author": 76611,
      "replies": []
    },
    {
      "id": "i9b8pl1",
      "text": "If God is real and he is the all forgiving all loving God that they say he is, then he wouldn’t only love humans he would love all beings, especially loyal loving dogs. Some of the religious tend to totally disregard this. Sad.",
      "timestamp": "2022-05-20 10:39:34",
      "score": 2,
      "num_children": 0,
      "author": 403987,
      "replies": []
    },
    {
      "id": "i9be9eh",
      "text": "I hate religious people. They just think they are good humans just by attending church. If they sin, they penance and keep on doing the same shit.",
      "timestamp": "2022-05-20 11:37:51",
      "score": 2,
      "num_children": 0,
      "author": 353718,
      "replies": []
    },
    {
      "id": "i9bfl1f",
      "text": "Holy shit that’s just pure evil. Unfiltered raw evil.",
      "timestamp": "2022-05-20 11:50:08",
      "score": 2,
      "num_children": 1,
      "author": 175437,
      "replies": [
        {
          "id": "i9cvhvf",
          "text": "[Just wait until you learn about how most animals are treated for meat, eggs and dairy and other things.](https://youtu.be/LQRAfJyEsko)",
          "timestamp": "2022-05-20 17:57:36",
          "score": 0,
          "num_children": 0,
          "author": 366772,
          "replies": []
        }
      ]
    },
    {
      "id": "i9bhae7",
      "text": "The louder they preach the more evil they are",
      "timestamp": "2022-05-20 12:05:18",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9bhro3",
      "text": "This post made me nauseous. I’m so sorry little child you had to witness this evil. People like that would do that to other humans given the chance.\n\nYour grandparents were fucking scum, I’m glad you didn’t succumb to it, like seriously, good for you.",
      "timestamp": "2022-05-20 12:09:32",
      "score": 2,
      "num_children": 0,
      "author": 47421,
      "replies": []
    },
    {
      "id": "i9bm9pq",
      "text": "It’s not necessarily that they value money over life, it’s just that they are inherently selfish people who only care about themselves. Puppy mills exist already so better that “good” Christians like them do it than, well, those “other” people. You know the kind. Just add in the fact that you can justify anything you do in life as “god’s will” and ask for forgiveness and become reborn every Sunday! Fun!\n\nEvangelicals are inherently evil, white supremacist, fear-mongering extremists who care about power, and yes money is a necessary element of maintaining power. All under the guise of being the one truly saved group of people and everyone else is just evil. Fuck em.",
      "timestamp": "2022-05-20 12:47:12",
      "score": 2,
      "num_children": 0,
      "author": 376022,
      "replies": []
    },
    {
      "id": "i9bodd8",
      "text": "I've gotten a lot of abuse on Reddit for being vegan,there's no end of people that want to angrily inform you that farming is good for animals, animals don't suffer at all and they KNOW that because their gran,or uncle or dad or teacher or someone they knows owns a pig farm and they're \"good people\". People never want to believe that \"good people\" do bad things or could be complicit in bad things. \n\nGood for you op, it's evidently not easy to put common sense above personal bias. Most people blindly defend the actions of their own, even if they must know deep down its a immoral action.",
      "timestamp": "2022-05-20 13:04:01",
      "score": 2,
      "num_children": 0,
      "author": 167187,
      "replies": []
    },
    {
      "id": "i9bpp3l",
      "text": "\"You can't serve God and Mammon\" -Sermon on the mount. Mammon is greed.",
      "timestamp": "2022-05-20 13:14:05",
      "score": 2,
      "num_children": 0,
      "author": 223629,
      "replies": []
    },
    {
      "id": "i9bqx9x",
      "text": "Nothing came of a report like that? I’d venture to guess she never filed on considering you were 14",
      "timestamp": "2022-05-20 13:23:13",
      "score": 2,
      "num_children": 0,
      "author": 232700,
      "replies": []
    },
    {
      "id": "i9brsv3",
      "text": "Share with them this Bible verse and see what they say.  \n\nGiving to the Needy\n\nMathew 6:\n\n6 “Be careful not to practice your righteousness in front of others to be seen by them. If you do, you will have no reward from your Father in heaven.\n\n2 “So when you give to the needy, do not announce it with trumpets, as the hypocrites do in the synagogues and on the streets, to be honored by others. Truly I tell you, they have received their reward in full. 3 But when you give to the needy, do not let your left hand know what your right hand is doing, 4 so that your giving may be in secret. Then your Father, who sees what is done in secret, will reward you.",
      "timestamp": "2022-05-20 13:29:41",
      "score": 2,
      "num_children": 0,
      "author": 274635,
      "replies": []
    },
    {
      "id": "i9bs94t",
      "text": "Belief in a supreme being tends to negate both personal accountability and reason.",
      "timestamp": "2022-05-20 13:33:01",
      "score": 2,
      "num_children": 0,
      "author": 77878,
      "replies": []
    },
    {
      "id": "i9bsiwp",
      "text": "Stopped reading at dead puppies in the corner. Well that's enough reddit for today a t its9:34am~ thanks",
      "timestamp": "2022-05-20 13:34:58",
      "score": 2,
      "num_children": 0,
      "author": 223082,
      "replies": []
    },
    {
      "id": "i9bt5w4",
      "text": "It's nowadays called the \"Prosperity Gospel\". 300 years ago the Puritans called it \"Visible Sainthood\". Same bullshit, different day.",
      "timestamp": "2022-05-20 13:39:36",
      "score": 2,
      "num_children": 0,
      "author": 56807,
      "replies": []
    },
    {
      "id": "i9bz4b5",
      "text": "https://en.m.wikipedia.org/wiki/The_Protestant_Ethic_and_the_Spirit_of_Capitalism",
      "timestamp": "2022-05-20 14:21:32",
      "score": 2,
      "num_children": 0,
      "author": 175766,
      "replies": []
    },
    {
      "id": "i9bz9x3",
      "text": "Sounds like the kinda people that would've bred people the same way without a second thought if it were legal. Shoulda burned that place down.",
      "timestamp": "2022-05-20 14:22:36",
      "score": 2,
      "num_children": 0,
      "author": 59198,
      "replies": []
    },
    {
      "id": "i9bzc98",
      "text": "But dogs don't have soooooulsss",
      "timestamp": "2022-05-20 14:23:02",
      "score": 2,
      "num_children": 0,
      "author": 354395,
      "replies": []
    },
    {
      "id": "i9c1u6t",
      "text": "If the local police did nothing about the report consider the FBI.",
      "timestamp": "2022-05-20 14:39:55",
      "score": 2,
      "num_children": 0,
      "author": 372561,
      "replies": []
    },
    {
      "id": "i985ub4",
      "text": "Please report them to the police and/or local animal welfare groups, that is horrific",
      "timestamp": "2022-05-19 17:29:13",
      "score": 8,
      "num_children": 1,
      "author": 85463,
      "replies": [
        {
          "id": "i989x37",
          "text": "They're dead.",
          "timestamp": "2022-05-19 17:56:31",
          "score": 14,
          "num_children": 1,
          "replies": [
            {
              "id": "i9bdgbc",
              "text": "Good",
              "timestamp": "2022-05-20 11:30:05",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i98jp53",
      "text": "You should call animal services on them.",
      "timestamp": "2022-05-19 19:03:14",
      "score": 4,
      "num_children": 1,
      "author": 217695,
      "replies": [
        {
          "id": "i98ury0",
          "text": "Not OP but it Happened in the 90s. They are dead and property gone.",
          "timestamp": "2022-05-19 20:18:55",
          "score": 4,
          "num_children": 0,
          "author": 189808,
          "replies": []
        }
      ]
    },
    {
      "id": "i99jah7",
      "text": "If this bothers you ought to look into factory farms. Pretty much all the meat in the supermarket comes from animals treated like this. This is awful, but it’s also just what life is like for billions of animals.",
      "timestamp": "2022-05-19 23:40:57",
      "score": 5,
      "num_children": 0,
      "author": 183259,
      "replies": []
    },
    {
      "id": "i99s5jb",
      "text": "So treating dogs like this is very bad. But cows are allowed to have these same living conditions?",
      "timestamp": "2022-05-20 00:55:58",
      "score": 4,
      "num_children": 0,
      "author": 50949,
      "replies": []
    },
    {
      "id": "i98u5ep",
      "text": "Not just Christians. My son rescued a female dog from an  Amish puppy mill. She was never allowed out of her cage and was just a puppy machine. She didn't  even know how to play.",
      "timestamp": "2022-05-19 20:14:37",
      "score": 4,
      "num_children": 1,
      "author": 330705,
      "replies": [
        {
          "id": "i98yycg",
          "text": "The Amish are Christians.",
          "timestamp": "2022-05-19 20:59:38",
          "score": 7,
          "num_children": 1,
          "author": 178902,
          "replies": [
            {
              "id": "i991nyx",
              "text": "I realized that right after I posted. They just seem so different than your typical evangelical.",
              "timestamp": "2022-05-19 21:20:22",
              "score": 0,
              "num_children": 0,
              "author": 330705,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i99m6w4",
      "text": "Crazy, and sad. Valuing human life and valuing animal life should go hand-in-hand. I don’t necessarily think their being religious is directly tied to the dog abuse (read:many non-religious types abuse animals)  but it makes it worse when you think that a ‘Christian’ person should want to behave in a manner that reflects their highest ideals. I.e: Christ. And Christ certainly wouldn’t reflect positively on your grandfathers treatment of those animals. Frankly speaking even a religious ‘nut’ should condemn what he did, it’s just WRONG.",
      "timestamp": "2022-05-20 00:05:39",
      "score": 2,
      "num_children": 0,
      "author": 317328,
      "replies": []
    },
    {
      "id": "i99ex58",
      "text": "Same shit for cows, no one cares.",
      "timestamp": "2022-05-19 23:04:05",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i98dlm4",
      "text": "Hopefully everyone here calling out this evil are vegans… If you think this is bad wait until you hear about factory farming",
      "timestamp": "2022-05-19 18:21:42",
      "score": -17,
      "num_children": 2,
      "author": 110050,
      "replies": [
        {
          "id": "i98e2uw",
          "text": "Is having fragile ego and low self esteem mandatory traits for becoming a vegan? All of you really love putting down others and act like you're superior.\n\nThis isn't very effective way to spread beliefs you know.",
          "timestamp": "2022-05-19 18:24:59",
          "score": 5,
          "num_children": 2,
          "author": 265020,
          "replies": [
            {
              "id": "i98uixg",
              "text": "They literally just pointed out the hypocrisy and stated a fact. You act like they threw insults at everyone who eats meat. Is your ego really that fragile that you get offended by that? By someone stating a fact? Or maybe it's just your conscience speaking.",
              "timestamp": "2022-05-19 20:17:11",
              "score": 9,
              "num_children": 1,
              "author": 153641,
              "replies": [
                {
                  "id": "i99qhrw",
                  "text": " No facts were stated. Factory farming is most energy efficient farming method, despite not being the most ethical one. Everyone are aware of it already, no need to repeat that everytime.\n\nBeing disgusted by cruel treatment of pets isn't hypocrisy, it's a normal reaction. Do you expect for everyone to stop keeping pets as well, because a lot of breeders aren't very ethical?",
                  "timestamp": "2022-05-20 00:42:09",
                  "score": -6,
                  "num_children": 3,
                  "author": 265020,
                  "replies": [
                    {
                      "id": "i9a0b4w",
                      "text": "Just, adopt? There are so many adoption agencies it’s actually ridiculous to claim buying a pet is better or easier.",
                      "timestamp": "2022-05-20 02:02:24",
                      "score": 4,
                      "num_children": 0,
                      "author": 291712,
                      "replies": []
                    },
                    {
                      "id": "i9bbymf",
                      "text": "Over 3 quarters of the word's soy production has to be used for livestock feed. We actually have to clear out more land in order to feed the livestock that we then kill and eat ourselves instead of growing food directly for us.",
                      "timestamp": "2022-05-20 11:15:12",
                      "score": 1,
                      "num_children": 1,
                      "author": 94316,
                      "replies": [
                        {
                          "id": "i9bjyxw",
                          "text": "I'm know that. That's why I mentioned this issue in different comment, but worded it differently. Beef is one of the most inefficient and causes the most polution, while chicken is the most efficient. If more people ate only chicken in stead of other meat, pollution would be smaller",
                          "timestamp": "2022-05-20 12:28:21",
                          "score": 1,
                          "num_children": 0,
                          "author": 265020,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i9br5nd",
                      "text": ">Factory farming is most energy efficient farming method\n\nHow many plant calories does it take to produce one calorie of beef? How much water goes into it? Hell, chicken is better but still not by much. And its treated way worse.",
                      "timestamp": "2022-05-20 13:24:55",
                      "score": 0,
                      "num_children": 1,
                      "author": 223197,
                      "replies": [
                        {
                          "id": "i9bz7v0",
                          "text": "On average beef produces 15 kg of CO2 per kg\n\nChicken produces 2.33 kg of C02 per kg of meat\n\nNot much? Here's the [Source ](https://www.ecoandbeyond.co/articles/most-environmentally-friendly-meat/) by the way",
                          "timestamp": "2022-05-20 14:22:12",
                          "score": 0,
                          "num_children": 1,
                          "author": 265020,
                          "replies": [
                            {
                              "id": "i9em13v",
                              "text": "I wasn't talking about CO2, I asked how many CALORIES",
                              "timestamp": "2022-05-21 02:24:23",
                              "score": 1,
                              "num_children": 0,
                              "author": 223197,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9bp1mr",
              "text": "I know! All these people getting angry about the puppy farm are holier than thou stuck up vegan assholes. All these people in here are just get all worked up and ridiculous over animals, fucking animals!\n\nWhat do they even get out of putting down breeding practice, I bet they don't care when they buy puppies. Everyone loves puppies, their just so cute, these vegan assholes can prise my cute puppies out of my cold dead hands.",
              "timestamp": "2022-05-20 13:09:09",
              "score": 1,
              "num_children": 0,
              "author": 167187,
              "replies": []
            }
          ]
        },
        {
          "id": "i98gn1p",
          "text": "Dude, have seen what happens to vegetables while they’re still alive!!! At least the cows are killed before they start processing the carcass.",
          "timestamp": "2022-05-19 18:42:31",
          "score": -1,
          "num_children": 1,
          "author": 199255,
          "replies": [
            {
              "id": "i98z5fo",
              "text": "If you really believe that then veganism is still the better position that minimizes the demand (the animals are fed plant based diets). I know you think you're being funny, but show me evidence that vegetables have pain receptors and are comparable to beings that experience emotions and suffering on a level that is not unlike even ourselves. Crying when we take away their babies and spilling blood when their throats are cut",
              "timestamp": "2022-05-19 21:01:07",
              "score": 6,
              "num_children": 1,
              "author": 110050,
              "replies": [
                {
                  "id": "i994epy",
                  "text": "You can moralize all you want but all you do is push people away. Do I wish the gov would ban factory farming? Of course but it’s never gonna happen because all the politicians are bought and paid for. Do I think eating meat is immoral? No. \n\nDo you have a cat? Cause if you do or any other vegan does then you’re a hypocrite. Cats MUST eat meat. Therefore you are participating in the very thing you rally against. \n\nIf you don’t want to eat meat then more power to you. Just realize that trying to shame others just turns everyone against you.",
                  "timestamp": "2022-05-19 21:41:13",
                  "score": -10,
                  "num_children": 2,
                  "author": 199255,
                  "replies": [
                    {
                      "id": "i996wa6",
                      "text": "The point of veganism is recognizing an unethical situation and realizing we CAN do something about it regardless of corrupt politics… which is by not paying for it. You yourself wish the government would ban factory farming but you pay for it otherwise? Interesting. \n\nNot sure how we are pushing people away - is OP by pointing out a cruel situation? There is mass agreement that puppy mills are unethical. And actually no, I don’t have a cat.",
                      "timestamp": "2022-05-19 22:00:05",
                      "score": 9,
                      "num_children": 1,
                      "author": 110050,
                      "replies": [
                        {
                          "id": "i99b729",
                          "text": ">\tbut you pay for it otherwise?\n\nI do?  Where did I admit to that?\n\nSimply put you are trying to make a vet muddled thing into pure black and white. Is it always under every single circumstance immoral to kill animals? Where is the line?\n\nIs there a line where any animal below it is not worthy of our concern? Can we factory farm them? I’m sure you have no issues whatsoever over the exploitation of bacteria. So then, at exactly what point does it become evil to kill an animal? Mice? Insects? Shellfish?\n\nYou equate the actions of someone who orgasms over profit through cruelty with a person having a turkey sandwich for lunch. You paint everything with one giant brush without consideration of circumstance or detail and that is why you are dismissed and laughed at.",
                          "timestamp": "2022-05-19 22:33:45",
                          "score": -6,
                          "num_children": 1,
                          "author": 199255,
                          "replies": [
                            {
                              "id": "i9bl937",
                              "text": ">\tDamn right I do. I’d draw it at pigs too if they didn’t taste SO FUCKING GOOD!",
                              "timestamp": "2022-05-20 12:39:02",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i9952n4",
                      "text": ">Do I think eating meat is immoral? No.\n\nThis is your barn on the backside of the property",
                      "timestamp": "2022-05-19 21:46:12",
                      "score": 5,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i998l5p",
                          "text": "When was the last time you swatted a fly or mosquito? Yogurt, cheese? Bacteria. Argue all you want but those are animals.  Reasonable people understand the difference between farming/sustenance/living and cruelty.",
                          "timestamp": "2022-05-19 22:13:03",
                          "score": -1,
                          "num_children": 1,
                          "author": 199255,
                          "replies": [
                            {
                              "id": "i998qzc",
                              "text": "Bacteria isn’t sentient. You sound extremely foolish.",
                              "timestamp": "2022-05-19 22:14:21",
                              "score": -1,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "i999kns",
                                  "text": "Sentience is not the topic of this discussion. But I’ll humour you. Draw me the line as to exactly at what point I am free to massacre at will but cross that line I am a murdering monster.",
                                  "timestamp": "2022-05-19 22:20:48",
                                  "score": 1,
                                  "num_children": 2,
                                  "author": 199255,
                                  "replies": [
                                    {
                                      "id": "i999vo6",
                                      "text": "you draw it at dogs, apparently",
                                      "timestamp": "2022-05-19 22:23:12",
                                      "score": 6,
                                      "num_children": 1,
                                      "author": 110050,
                                      "replies": [
                                        {
                                          "id": "i99bi0j",
                                          "text": "Damn right I do. I’d draw it at pigs too if they didn’t taste SO FUCKING GOOD!",
                                          "timestamp": "2022-05-19 22:36:11",
                                          "score": -2,
                                          "num_children": 2,
                                          "author": 199255,
                                          "replies": [
                                            {
                                              "id": "i9a0hvp",
                                              "text": "You literally just admitted you don’t have an argument. Haha, wow you pay to kill animals with the intelligence of 3 year olds. You’re really funny.",
                                              "timestamp": "2022-05-20 02:03:57",
                                              "score": 3,
                                              "num_children": 1,
                                              "author": 291712,
                                              "replies": [
                                                {
                                                  "id": "i9bg3i9",
                                                  "text": "Yes, that was my best and greatest argument. God you’re a tool.",
                                                  "timestamp": "2022-05-20 11:54:49",
                                                  "score": 0,
                                                  "num_children": 1,
                                                  "author": 199255,
                                                  "replies": [
                                                    {
                                                      "id": "i9bkzzc",
                                                      "text": "You pissed yourself.",
                                                      "timestamp": "2022-05-20 12:36:58",
                                                      "score": 2,
                                                      "num_children": 0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "i9bqkaj",
                                              "text": "Yeah, you just sacrificed any footing you would have had by engaging dishonestly. And if you *are* being honest, you're immoral for sacrificing a life you claim you'd value for the sake of taste buds.",
                                              "timestamp": "2022-05-20 13:20:34",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 223197,
                                              "replies": [
                                                {
                                                  "id": "i9c48w7",
                                                  "text": "Are you people so caught up in your moral indignation that your ability to spot a sarcastic troll comment is broken? I was sick and tired of arguing with you MFs.",
                                                  "timestamp": "2022-05-20 14:55:54",
                                                  "score": -1,
                                                  "num_children": 2,
                                                  "author": 199255,
                                                  "replies": [
                                                    {
                                                      "id": "i9c7bc7",
                                                      "text": "So stop",
                                                      "timestamp": "2022-05-20 15:16:25",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "i9cz77d",
                                                          "text": "Dude. Nobody here was bitching about vegans, or ever does, till you started equating food with the willful, gleeful, for profit torturing in a puppy mill. If you want to have a meaningful conversation I’m all for it but if you are going to start throwing shit at people saying they’re exactly the same as a puppy murderer because the ate some bacon then you can fuck right off.",
                                                          "timestamp": "2022-05-20 18:25:48",
                                                          "score": -1,
                                                          "num_children": 1,
                                                          "author": 199255,
                                                          "replies": [
                                                            {
                                                              "id": "i9d4kzt",
                                                              "text": "It’s an apt comparison.",
                                                              "timestamp": "2022-05-20 19:08:03",
                                                              "score": 1,
                                                              "num_children": 1,
                                                              "replies": [
                                                                {
                                                                  "id": "i9dmkjx",
                                                                  "text": "And that is why we mock you. It’s pretty much the same as people who compare everything to Hitler and the Nazis.",
                                                                  "timestamp": "2022-05-20 21:24:12",
                                                                  "score": -1,
                                                                  "num_children": 1,
                                                                  "author": 199255,
                                                                  "replies": [
                                                                    {
                                                                      "id": "i9dniuy",
                                                                      "text": "Wrong again.",
                                                                      "timestamp": "2022-05-20 21:31:37",
                                                                      "score": 1,
                                                                      "num_children": 1,
                                                                      "replies": [
                                                                        {
                                                                          "id": "i9e52ms",
                                                                          "text": "No different than a religious person. You knocked over the pieces, shit on the board and strutting around like you won. Congratulations, I give.",
                                                                          "timestamp": "2022-05-20 23:54:55",
                                                                          "score": 0,
                                                                          "num_children": 1,
                                                                          "author": 199255,
                                                                          "replies": [
                                                                            {
                                                                              "id": "i9e54qy",
                                                                              "text": "If there’s any pigeons around here it’s yourself",
                                                                              "timestamp": "2022-05-20 23:55:26",
                                                                              "score": 2,
                                                                              "num_children": 0,
                                                                              "replies": []
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    },
                                                    {
                                                      "id": "i9elxjk",
                                                      "text": "Are you so insecure in your position that you rely on troll comments because your position can't hold merit in an actual philosophical discussion?",
                                                      "timestamp": "2022-05-21 02:23:29",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 223197,
                                                      "replies": [
                                                        {
                                                          "id": "i9fz367",
                                                          "text": "As I have already said, making ridiculous comparisons where you are calling your discussion opponent a criminal does not make anyone want to talk with you. \n\nIf I was going to start a discussion though it would be that your moral position is one of convenience. You can only say that eating animals is immoral because we live in a time where we have the option. Were people in the past evil for eating meat? Are the few groups left who are not part of our modern society evil? If Russia launches its nuclear arsenal and destroys our infrastructure will the people who don’t have access to the variety of plant material needed for a proper diet be evil?\n\nPretty much everything we hold on a high moral position does not change with the times. Murder, slavery, being a dick etc are evil because the act in and of itself is evil. You are only able to say that bacon is akin to puppy torture because you are privileged.",
                                                          "timestamp": "2022-05-21 12:37:05",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 199255,
                                                          "replies": [
                                                            {
                                                              "id": "i9ghxd2",
                                                              "text": "I've never said eating meat is immoral did I?\n\nI would say that not eating meat is *more* moral. Whether or not eating meat is immoral depends on the circumstance. At best it's amoral at worst it's immoral.",
                                                              "timestamp": "2022-05-21 15:17:34",
                                                              "score": 1,
                                                              "num_children": 1,
                                                              "author": 223197,
                                                              "replies": [
                                                                {
                                                                  "id": "i9gn54x",
                                                                  "text": "Sigh. This is why there was no point in continuing the conversation. This all started with one of you saying that any person who eats meat is just as guilty as the puppy mill guy. Not one vegan took that guy to task but there were many who echoed his claim. \n\nSo if you don’t feel that way then what was the point if any of this?",
                                                                  "timestamp": "2022-05-21 15:57:39",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "author": 199255,
                                                                  "replies": [
                                                                    {
                                                                      "id": "i9ifoou",
                                                                      "text": "Because they stated their beliefs with consistency, you resorted to trolling and inconsistency. Whether I agree with them or not is irrelevant to my position of consistency of views.\n\nAlso your logic is faulty, but that's another conversation. It doesn't take privilege to determine less harm is better than more harm or that supporting an industry that slaughters millions of animals a year only for 30-40% of it to go to landfill is fucked up.",
                                                                      "timestamp": "2022-05-22 00:53:02",
                                                                      "score": 1,
                                                                      "num_children": 1,
                                                                      "author": 223197,
                                                                      "replies": [
                                                                        {
                                                                          "id": "i9k3xci",
                                                                          "text": "Consistent in that they didn’t back down but that’s it. I’ve had infinitely more intelligent discussions with flat earthers. Ridiculous positions only deserve ridicule especially when their position is 100% emotional and has no rational basis. \n\nThe argument that eating meat should be a punishable, criminal offence is right up there with being “pro-life”. Like any rational person I would love to see animals not abused and tortured but as I already pointed out, vegetarianism is an option only available to the privileged. Remove that economic, technological, geographic privilege and its back to eat meat or die. Are the Inuit monsters for not having the ability to have fields of fruits and veggies that can farm and live off of? Why wouldn’t I mock and deride such a ridiculous stance?\n\nI have no beef, pun intended, with you. Your stance is reasonable and lends itself to discussion but that is not what all this was about.",
                                                                          "timestamp": "2022-05-22 12:55:23",
                                                                          "score": 1,
                                                                          "num_children": 0,
                                                                          "author": 199255,
                                                                          "replies": []
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "i999u2c",
                                      "text": "Sentience is everything about this discussion.\n\nMy boy, you are arguing in bad faith to protect the weak points of your mind.\n\nJust admit that the shit is fucked up and you’ll try to do better. Nobody is born vegan.",
                                      "timestamp": "2022-05-19 22:22:50",
                                      "score": 2,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "i99ckz0",
                                          "text": "Love how you avoided my challenge. \n\nFirst off, DID YOU JUST ASSUME MY GENDER!!!!!!! \n\nSecond, I don’t want to see cruelty anywhere. I’d love to see the day this is all a non-issue with lab grown meat. Thing is that equating the cruelty of a puppy mill with eating a turkey sandwich will not lead to any kind of positive discussion. \n\nYou guys are making the statement but unwilling to draw the lines. It makes you look wishy washy and without a solid stance.",
                                          "timestamp": "2022-05-19 22:44:52",
                                          "score": -2,
                                          "num_children": 1,
                                          "author": 199255,
                                          "replies": [
                                            {
                                              "id": "i99cvf3",
                                              "text": "Uh yeah I can’t wait for lab grown meat that’s completely harm free. It’ll shut the dipshit edgelords up. \n\nUntil then, seitan is fine. It’s pretty fucking good honestly\n\n\nedit : OK to your challenge. It’s up to you. I don’t give a fuck about killing roaches but I help spiders survive.. Like a normal fuckin person. \n\nBasically anything that’s not a bug or actively trying to do serious harm to myself or others around me (like a wild animal or dog attack). Including bugs.. But I was like that before.\n\nedit 2 :  [Turkey processing ](https://youtu.be/rh9-DkLgHiU)",
                                              "timestamp": "2022-05-19 22:47:14",
                                              "score": 4,
                                              "num_children": 0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "i9bhdwc",
                                  "text": "https://www.wired.com/2010/01/slime-mold-grows-network-just-like-tokyo-rail-system/",
                                  "timestamp": "2022-05-20 12:06:07",
                                  "score": 0,
                                  "num_children": 1,
                                  "author": 191958,
                                  "replies": [
                                    {
                                      "id": "i9bj7bo",
                                      "text": "This isn’t sentience. Also, embarrassing for you.",
                                      "timestamp": "2022-05-20 12:21:55",
                                      "score": 0,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "i9blm90",
                                          "text": "I think you're confusing self awareness with sentience. Chemotaxis is a good place to start.",
                                          "timestamp": "2022-05-20 12:41:57",
                                          "score": 0,
                                          "num_children": 1,
                                          "author": 191958,
                                          "replies": [
                                            {
                                              "id": "i9bms78",
                                              "text": "No.\n\nReal quick bubba, which of these is sentient :\n\nYour maine coon, or mold.\n\nYou flair yourself as an atheist and argue against science and reason.",
                                              "timestamp": "2022-05-20 12:51:20",
                                              "score": 0,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "i9bpesc",
                                                  "text": "Lol look into slime molds",
                                                  "timestamp": "2022-05-20 13:11:57",
                                                  "score": 0,
                                                  "num_children": 1,
                                                  "author": 191958,
                                                  "replies": [
                                                    {
                                                      "id": "i9bs14o",
                                                      "text": "I saw that article too dude\n\nLook into your cats eyes.",
                                                      "timestamp": "2022-05-20 13:31:22",
                                                      "score": 0,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "i9c6jeg",
                                                          "text": "Drop some more false equivalencies",
                                                          "timestamp": "2022-05-20 15:11:14",
                                                          "score": 0,
                                                          "num_children": 1,
                                                          "author": 191958,
                                                          "replies": [
                                                            {
                                                              "id": "i9c76fn",
                                                              "text": "Pigs are smarter than cats and dogs, so you’re correct… guy that compares molds to sentient animals",
                                                              "timestamp": "2022-05-20 15:15:30",
                                                              "score": 0,
                                                              "num_children": 0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i98rk7w",
      "text": "I woulda burned that fucking barn in the middle of the night.  Some might say “what about the dogs” but from the sounds of it burning down the barn and putting an end to the torture they and future dogs would endure is enough to make their sacrifice justified.",
      "timestamp": "2022-05-19 19:56:51",
      "score": 1,
      "num_children": 1,
      "author": 344638,
      "replies": [
        {
          "id": "i99r3o8",
          "text": "Burning to death is one of the worst ways to go, the dogs wouldn’t deserve that.",
          "timestamp": "2022-05-20 00:47:13",
          "score": 6,
          "num_children": 1,
          "author": 231914,
          "replies": [
            {
              "id": "i9caxca",
              "text": "I upvoted this comment because you’re right they don’t deserve it but I’d rather see them suffocate from smoke inhalation than have them suffer any longer if animal control doesn’t step in.  Every dog in there is probably getting euthanized if the authorities ever get involved.  Sometimes it’s necessary to do the wrong thing for the right reason :(",
              "timestamp": "2022-05-20 15:40:16",
              "score": 1,
              "num_children": 0,
              "author": 344638,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i99nl2m",
      "text": "Report the barn to the health department. \n\nI used to do land surveying. I went to a puppy mill one day due to a county health department requirement. Turns out that it's a health hazard to have that many dogs shitting and pissing in one place.",
      "timestamp": "2022-05-20 00:17:37",
      "score": 1,
      "num_children": 0,
      "author": 107935,
      "replies": []
    },
    {
      "id": "i9apiyb",
      "text": "You really need to call somebody ASAP. This is animal abuse, no ifs ands or buts and your family needs to suffer the consequences.\nI'm kind of surprised nobody has suggested this.",
      "timestamp": "2022-05-20 06:13:48",
      "score": 1,
      "num_children": 0,
      "author": 198238,
      "replies": []
    },
    {
      "id": "i98aicm",
      "text": "If you eat animals you are no better than your grandparents. Literally everything you described is what society subjects to cows, pigs, and chickens everyday, in many cases worse. I'm not saying you have to go vegan, but it's important for you to recognize the hypocrisy here, and acknowledge that these animals suffer as a direct result of your actions. You shouldn't claim or imply kindness and empathy if you've none to offer.",
      "timestamp": "2022-05-19 18:00:31",
      "score": -31,
      "num_children": 8,
      "author": 332084,
      "replies": [
        {
          "id": "i98bu4b",
          "text": "I dont want to get into an argument, but what about instead making sure you source your food from places that treat them right? I grew up on a  farm, the animals always had green pastures, shelter, extra food, etc. Often I would go out and sit with the cows and read a books. They were extremely well loved. And when the time came to butcher them, it was done on the property. No stress, no moving them to an unfamiliar setting and no extended pain. \n\nSaying that someone who eats animals is comparable to someone who literally beat dogs to death and mistreated them terribly is... not a comparison that holds up in my mind.",
          "timestamp": "2022-05-19 18:09:36",
          "score": 15,
          "num_children": 3,
          "author": 202619,
          "replies": [
            {
              "id": "i993zal",
              "text": "Food animals are killed at a fraction of their lifespan",
              "timestamp": "2022-05-19 21:37:58",
              "score": 7,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i9ccasf",
              "text": "Cool story and all, but cows being happy before butchering them still doesn’t justify taking their life. In fact it is tragic on another level… if someone is happy and loves life, it’s pretty fucked up to murder them",
              "timestamp": "2022-05-20 15:49:19",
              "score": 2,
              "num_children": 0,
              "author": 110050,
              "replies": []
            },
            {
              "id": "i98k0c8",
              "text": "I'm glad to hear you read to the animals you exploited and murdered.",
              "timestamp": "2022-05-19 19:05:22",
              "score": -1,
              "num_children": 2,
              "author": 332084,
              "replies": [
                {
                  "id": "i98p8l3",
                  "text": "Just curious- do primitive hunter-gatherer groups exploit and murder animals?",
                  "timestamp": "2022-05-19 19:40:57",
                  "score": 3,
                  "num_children": 3,
                  "author": 286151,
                  "replies": [
                    {
                      "id": "i98s8c5",
                      "text": "They kill animals but they have no other choice. Most of us here on this sub do.",
                      "timestamp": "2022-05-19 20:01:26",
                      "score": 8,
                      "num_children": 1,
                      "author": 153641,
                      "replies": [
                        {
                          "id": "i98se6d",
                          "text": "I'm going to ask you the same question I asked the other person:\n\n> Ok, so the poor people who live in food deserts and don't have access to much fresh produce are also on the 'survival' line when it comes to meat, right?",
                          "timestamp": "2022-05-19 20:02:32",
                          "score": 0,
                          "num_children": 2,
                          "author": 286151,
                          "replies": [
                            {
                              "id": "i9942my",
                              "text": "Do you live in a food desert?",
                              "timestamp": "2022-05-19 21:38:40",
                              "score": 5,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "i99abme",
                                  "text": "Thankfully, no. But *many* people do.",
                                  "timestamp": "2022-05-19 22:26:44",
                                  "score": 0,
                                  "num_children": 1,
                                  "author": 286151,
                                  "replies": [
                                    {
                                      "id": "i99aw7o",
                                      "text": "This is true. \n\nBut you, you’re good.",
                                      "timestamp": "2022-05-19 22:31:21",
                                      "score": 5,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "i99b17o",
                                          "text": "Ok, but this isn't about me personally. Nor should it be.",
                                          "timestamp": "2022-05-19 22:32:28",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 286151,
                                          "replies": [
                                            {
                                              "id": "i99bas6",
                                              "text": "Well, yes, it is. \n\nReason leads a person to atheism. The same can be said of the V word.",
                                              "timestamp": "2022-05-19 22:34:35",
                                              "score": 7,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "i99bfoy",
                                                  "text": "I never said whether or not I was a vegan, nor do I intend to, because, again, this is not about me.",
                                                  "timestamp": "2022-05-19 22:35:41",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 286151,
                                                  "replies": [
                                                    {
                                                      "id": "i99c99y",
                                                      "text": "No one expects people in food deserts, indigenous hunting peoples, or otherwise to be vegan.\n\npeople in the west, in general, with access to grocery stores, department stores, etc have a duty to pull their heads out of their asses.",
                                                      "timestamp": "2022-05-19 22:42:15",
                                                      "score": 7,
                                                      "num_children": 0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "i98szjt",
                              "text": "Depends on what their specific options are. But generally, yes, I would say they are.",
                              "timestamp": "2022-05-19 20:06:34",
                              "score": 5,
                              "num_children": 1,
                              "author": 153641,
                              "replies": [
                                {
                                  "id": "i98u11y",
                                  "text": "Well then it's a little silly to lecture people about eating meat until we have a way to serve them that doesn't involve farming animals. Because until that happens, animals are going to be farmed no matter what OP wants. Necessarily so.",
                                  "timestamp": "2022-05-19 20:13:47",
                                  "score": -6,
                                  "num_children": 0,
                                  "author": 286151,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i98rbyu",
                      "text": "Just curious - In the United States in 2022, does the practices or beliefs of hunter-gatherers have any relevance whatsoever?",
                      "timestamp": "2022-05-19 19:55:17",
                      "score": 8,
                      "num_children": 1,
                      "author": 401159,
                      "replies": [
                        {
                          "id": "i98rt00",
                          "text": "I never said it did. I'm trying to find out if it is *always* exploitation and murder to kill and eat an animal or if there are exceptions and where the line is drawn.",
                          "timestamp": "2022-05-19 19:58:32",
                          "score": 1,
                          "num_children": 1,
                          "author": 286151,
                          "replies": [
                            {
                              "id": "i98t4nt",
                              "text": "Honestly.  Who cares?  We are talking about 2022 America.  Theoretical arguments about ancient people are stupid.  If somebody mentions rape in 2022  do you ponder if cavemen would consider it rape?",
                              "timestamp": "2022-05-19 20:07:32",
                              "score": 1,
                              "num_children": 1,
                              "author": 401159,
                              "replies": [
                                {
                                  "id": "i98tojo",
                                  "text": "I care. Hence my asking. Also, hunter-gatherer groups still exist.",
                                  "timestamp": "2022-05-19 20:11:23",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 286151,
                                  "replies": [
                                    {
                                      "id": "i98v4xk",
                                      "text": "https://en.wikipedia.org/wiki/Fallacy",
                                      "timestamp": "2022-05-19 20:21:22",
                                      "score": 0,
                                      "num_children": 1,
                                      "author": 401159,
                                      "replies": [
                                        {
                                          "id": "i98w1c2",
                                          "text": "What fallacy in specific am I committing?",
                                          "timestamp": "2022-05-19 20:36:48",
                                          "score": 3,
                                          "num_children": 0,
                                          "author": 286151,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i98refv",
                      "text": "By the strict definition I believe so; however, is it immoral for them to do so? I think not. In my opinion there is a clear delineation between survival and pleasure.",
                      "timestamp": "2022-05-19 19:55:45",
                      "score": 1,
                      "num_children": 1,
                      "author": 332084,
                      "replies": [
                        {
                          "id": "i98rqnv",
                          "text": "Ok, so the poor people who live in food deserts and don't have access to much fresh produce are also on the 'survival' line when it comes to meat, right?",
                          "timestamp": "2022-05-19 19:58:06",
                          "score": 7,
                          "num_children": 1,
                          "author": 286151,
                          "replies": [
                            {
                              "id": "i98wx2u",
                              "text": "This is a good question. I often find it hard to believe that these people don't have access to rice and beans, or can't at least vastly reduce their animal consumption. But I have never lived in or been to such an area. I've lived in the hood before, but always had access to something. I want to say no, but I'm afraid that answer would come from personal incredulity. My inclination would be to say no, abject poverty doesn't excuse exploitation; however, I can't help but find myself empathic to their plight. This isn't an answer but I'm afraid it's the best I have.",
                              "timestamp": "2022-05-19 20:44:18",
                              "score": 7,
                              "num_children": 0,
                              "author": 332084,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i98qjw6",
                  "text": "Dude you sound like one of those people who makes their dog or cat go vegan. Humans are omnivores, animals just like the rest and life is full of animals eating each other. The very least we can do is make sure that we take good care of our animals before we eat them. I don't care if someone wants to go vegan or vegetarian but you're honestly kind of reminding me of an evangelical christian here 😅",
                  "timestamp": "2022-05-19 19:49:58",
                  "score": -1,
                  "num_children": 1,
                  "author": 202619,
                  "replies": [
                    {
                      "id": "i9cdwl5",
                      "text": "I love taking care of my dog, making sure he’s very happy before I will slit its throat one day",
                      "timestamp": "2022-05-20 15:59:50",
                      "score": 1,
                      "num_children": 1,
                      "author": 110050,
                      "replies": [
                        {
                          "id": "i9cf44p",
                          "text": "You're making assumptions about the way we butchered our animals. Considering that the entirely horde of vegans who have started to argue over this comment thread and it's replies have never addressed my points nor made a convincing calm argument themselves, instead clutching their pearls and shouting \"murder! Injustice!\" In a way that vaguely reminds me of the pro-life crowd, I don't see any need to continue the conversation unless I'm actually going to learn something from it or have an interesting debate or discussion over whether or not there is nuance.",
                          "timestamp": "2022-05-20 16:07:47",
                          "score": 1,
                          "num_children": 1,
                          "author": 202619,
                          "replies": [
                            {
                              "id": "i9cjx8m",
                              "text": "Okay, is there a scenario where the animal does not end up butchered in your happy farm stories?\n\nHow would you prefer we get the message across? We’re in a Reddit post that is literally about animal cruelty, where there is mass agreement when it comes to dogs… but how dare us mention other animals.\n\n(Edited for autocorrect)",
                              "timestamp": "2022-05-20 16:39:06",
                              "score": 2,
                              "num_children": 0,
                              "author": 110050,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i98rum1",
          "text": "I was looking for this comment. Thank you so much for pointing out the hypocrisy! If you replaced the word \"dogs\" in this post with \"chicken\", \"pig\" or \"cow\", nobody here would bat an eye. The number of downvotes on your comment just shows that even atheists can still be subjects of cognitive dissonance (sadly).",
          "timestamp": "2022-05-19 19:58:51",
          "score": 9,
          "num_children": 1,
          "author": 153641,
          "replies": [
            {
              "id": "i98u3p5",
              "text": "Agreed... I'm really depressed about this. And we are a group that proudly boasts about reason and superior critical thinking skills. Pointing out the inconsistency by replacing dalmatians for pigs, cows, goats, whatever (basically not pets), we're down voted and shamed. While they themselves call it evil. Mind blowing hypocrisy",
              "timestamp": "2022-05-19 20:14:18",
              "score": 7,
              "num_children": 1,
              "author": 110050,
              "replies": [
                {
                  "id": "i98w58v",
                  "text": "Same, it's so sad. I think this happens because...People like to think that they are good. When they are presented with information that could challenge that view, they get upset. And it's much easier to get upset than reflect on their choices, admit that they may not have been acting in the best way, and change.",
                  "timestamp": "2022-05-19 20:37:52",
                  "score": 9,
                  "num_children": 1,
                  "author": 153641,
                  "replies": [
                    {
                      "id": "i9amv2p",
                      "text": "[removed]",
                      "timestamp": "2022-05-20 05:40:41",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i9c92up",
                          "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                          "timestamp": "2022-05-20 15:28:06",
                          "score": 1,
                          "num_children": 0,
                          "author": 122319,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i98bzhp",
          "text": "Are you fucking serious? Buddy, shaming won't make anyone want to eat less meat. Maybe you should consider that to be taken seriously, you shouldn't act like a child. This behavior is exactly why everyone treats vegans like a joke.\n\nMaybe you should look at your own hypocrisy as well? You're doing exact same thing Christians are doing. They say that everyone who don't believe in God are evil and have no morals. You say that everyone who eat meat are evil and have no morals.",
          "timestamp": "2022-05-19 18:10:37",
          "score": 8,
          "num_children": 3,
          "author": 265020,
          "replies": [
            {
              "id": "i98v32t",
              "text": "are you not participating in a post that is actively calling the cruel treatment of dogs evil and immoral? Why do only Dalmatian's get special consideration?",
              "timestamp": "2022-05-19 20:21:03",
              "score": 9,
              "num_children": 0,
              "author": 110050,
              "replies": []
            },
            {
              "id": "i98qf1m",
              "text": "Funny you bring up Christianity. They are brainwashed to believe animals are here for their pleasure, says so in Genesis. I have never met a vegan Christian, they probably exist, just not to my knowledge. My question now is, how do you justify funding animal exploitation and abuse?",
              "timestamp": "2022-05-19 19:49:04",
              "score": 2,
              "num_children": 1,
              "author": 332084,
              "replies": [
                {
                  "id": "i98semj",
                  "text": "I don't justify it. There are far more issues than just animal abuse with farming animals for meat, it causes large amounts of pollution. And overall is a very inefficient way to produce food that wastes a huge amount of resources.\n\nI'm simply telling you that people won't stop treating you vegans like a joke until you start behaving like actual adults instead of trying to put everyone down to declare your superiority.",
                  "timestamp": "2022-05-19 20:02:38",
                  "score": 1,
                  "num_children": 2,
                  "author": 265020,
                  "replies": [
                    {
                      "id": "i99gqd3",
                      "text": "I think their comments are factual and polite. People just get really defensive when faced with the idea that something they think is normal is immoral and unnecessary. I'm curious, how do you think vegans should advocate for animals? By keeping their mouth shut and waiting for change to happen? The climate crisis is here now, we don't have time to kiss ass.",
                      "timestamp": "2022-05-19 23:19:23",
                      "score": 4,
                      "num_children": 2,
                      "author": 350130,
                      "replies": [
                        {
                          "id": "i99jtc5",
                          "text": "Vegan: *opens their mouth, takes a breath-*\n\n\nOmnis: \"Oh my God, stop guilt tripping us, you'll never convince people to go vegan with this attitude!!!\"",
                          "timestamp": "2022-05-19 23:45:21",
                          "score": 5,
                          "num_children": 0,
                          "author": 153641,
                          "replies": []
                        },
                        {
                          "id": "i99lhgl",
                          "text": "By presenting actual facts, benefits of not eating meat, meat alternatives ect.\n\nScreeching that we're murderers for eating meat and should be ashamed of ourselves isn't going to do jack shit if you haven't realized\n\nWhat do you find so punctual? Comparing op to person who beats puppies with literal baseball bat to death is factual and punctual to you?",
                          "timestamp": "2022-05-19 23:59:41",
                          "score": 2,
                          "num_children": 2,
                          "author": 265020,
                          "replies": [
                            {
                              "id": "i99n1ds",
                              "text": "Actually, you're wrong. Many people, including me, converted exactly thanks to being shamed by other vegans. There are many different ways of spreading the message, and they can all be effective, it only depends on the listener. \n\nAlso, if OP isn't vegan, they are indirectly supporting an industry that routinely and legally smashes the heads of baby piglets against concrete floor. That is a fact for you, you can look it up.",
                              "timestamp": "2022-05-20 00:12:53",
                              "score": 4,
                              "num_children": 1,
                              "author": 153641,
                              "replies": [
                                {
                                  "id": "i99pco5",
                                  "text": "I know that, guess what shaming works only on like 5%. The rest of us only get annoyed, start to avoid and make fun of you. And yes I'm aware of that, cruelty on farms is a well-known fact to everyone. Such tactics don't work on me, and the majority of people.\n\nI'm not vegan and will never become one, mainly because animal products are healthy and tasty, and partly because vegans act like clowns and I don't want to associate with them. Vegetarian, maybe someday. But for now, I'm still eating meat, but less of it, and only the most energy-efficient meat - chicken.\n\nAlso different people have different priorities. Majority if us only care about the price, I'm one of them. Im not wealthy enough to exclusively buy meat only from farms which pet cickens daily. If its on discount, sure. If not then I'd rather have cheaper option.",
                                  "timestamp": "2022-05-20 00:32:32",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 265020,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "i99yh0w",
                              "text": "Who is screeching? And what do you mean by punctual? The reason all this came up is because the conditions OP described on the puppy mill are identical to factory farms. If you've been inside one (I have) it's impossible not to make the comparison. Some people don't realize the reality of animal agriculture, and it's really important they're made aware. If someone's delivery of that information makes you uncomfortable, well, you'll live.\n\nYou should check out u/Plants_are_tasty's comment on the OP, I think you will find it less abrasive and they did a great job laying out a plethora of facts. Cheers",
                              "timestamp": "2022-05-20 01:47:25",
                              "score": 4,
                              "num_children": 0,
                              "author": 350130,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i9cer37",
                      "text": "How would you prefer we get the message across then? Pointing out cruelties and trying to get people to think about their actions… in a Reddit post actually about animal cruelty… sorry to trigger you",
                      "timestamp": "2022-05-20 16:05:23",
                      "score": 1,
                      "num_children": 1,
                      "author": 110050,
                      "replies": [
                        {
                          "id": "i9cyboa",
                          "text": "I already answered this question, I'm not going to repeat myself. Not my fault you cant read through entire thread before responding",
                          "timestamp": "2022-05-20 18:19:04",
                          "score": 0,
                          "num_children": 0,
                          "author": 265020,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9cvwsl",
              "text": "> Buddy, shaming won't make anyone want to eat less meat.\n\nPeople calling out my hypocrisy is precisely what made me go vegan.",
              "timestamp": "2022-05-20 18:00:41",
              "score": 0,
              "num_children": 0,
              "author": 366772,
              "replies": []
            }
          ]
        },
        {
          "id": "i98bjrf",
          "text": "Bullshit. Allowing or even indirectly supporting the potential abuse of animals does not make someone \"no better\" than a person who *actively and actually* abuses animals.\n\nThsts like saying having a friend who committed a murder makes you no better than a murderer yourself.\n\nYes, there is a hypocrisy there, and you're absolutely right to call it out but to pretend that there is no nuance or levels to this is dishonest and honestly works against you.",
          "timestamp": "2022-05-19 18:07:38",
          "score": 6,
          "num_children": 3,
          "author": 85864,
          "replies": [
            {
              "id": "i995uoi",
              "text": "You say 'potential abuse', which sounds to me as if most farms are free from abuse but it happens in a few regrettable instances. This is not the case at all. Abuse is inherent.\n\nLegal standard practices in animal agriculture are horrendously abusive. And a question that is worth considering: Is it worse to kick a dog, or to slit their throat? \n\nYou can know with 100% certainty that an animal had their life taken from them at a fraction of their lifespan for any meat you are eating, and all chickens used for eggs and cows used for milk go to slaughter too at a fraction of their lifespan. Either when their bodies give up after constant pregnancy and milking or egg-laying, or when their production declines to an unprofitable level.\nI encourage you to research what the standard, legal practices are that animals are subjected to within these despicable industries. Watchdominion.org shows standard practices for all major animal industries.",
              "timestamp": "2022-05-19 21:52:03",
              "score": 7,
              "num_children": 0,
              "author": 129305,
              "replies": []
            },
            {
              "id": "i98ia5d",
              "text": "If you pay your friend to murder someone would you not be considered related to that murder? You act as if you have no connection or shouldn't be considered an accomplice to an act you pay for.",
              "timestamp": "2022-05-19 18:53:39",
              "score": 3,
              "num_children": 0,
              "author": 332084,
              "replies": []
            },
            {
              "id": "i9c5i71",
              "text": "> Yes, there is a hypocrisy there, and you're absolutely right to call it out\n\nBOOM he said it",
              "timestamp": "2022-05-20 15:04:21",
              "score": 1,
              "num_children": 0,
              "author": 56063,
              "replies": []
            }
          ]
        },
        {
          "id": "i98cwji",
          "text": "If you want people to change their ways attacking them and claiming they lack kindness and empathy is just goin for create more people who will now “eat two animals for everyone you don’t”.",
          "timestamp": "2022-05-19 18:16:56",
          "score": 3,
          "num_children": 2,
          "author": 106022,
          "replies": [
            {
              "id": "i9944zj",
              "text": "I hope OP deletes this post; we don’t want anyone beating two dalmations to death for every one we don’t.",
              "timestamp": "2022-05-19 21:39:10",
              "score": 8,
              "num_children": 0,
              "author": 349811,
              "replies": []
            },
            {
              "id": "i9brk06",
              "text": "Stupid people like those \"I'm just gonna eat more meat\" will always exist. And you know what? Good. At least less will go to waste. So many animals killed just to be thrown away. The US throws enough away to nearly satisfy the caloric requirements of the country.",
              "timestamp": "2022-05-20 13:27:53",
              "score": 2,
              "num_children": 1,
              "author": 223197,
              "replies": [
                {
                  "id": "i9bsduk",
                  "text": "It is shocking the food waste. I try keep mine to a minimum, having chickens and composting really helps recycle scraps back into food and flowers",
                  "timestamp": "2022-05-20 13:33:57",
                  "score": 2,
                  "num_children": 1,
                  "author": 106022,
                  "replies": [
                    {
                      "id": "i9emwe0",
                      "text": "That really is the best use of food waste too. \n\nAnother big misconception in the general public is that food breaks down so it's alright to go into a landfill, but that's so far from the truth. The waste is shitty from a food security position, an economic position, an environmental position and all the governments do is subsidise the industries so they keep producing more and more shit only to be thrown away.\n\nWhat I don't understand is why farmers won't invest in some community composting, they reap the benefits of the compost and can play on the community sympatheties of the \"poor hard done by farmer\" to keep the waste coming plus it's way better for the environment and getting nutrients back into the soil.",
                      "timestamp": "2022-05-21 02:32:25",
                      "score": 1,
                      "num_children": 1,
                      "author": 223197,
                      "replies": [
                        {
                          "id": "i9fztcr",
                          "text": "Here in vermont places like the intervals community gardens have been composting for years and now it is required that all food waste be composted (well if you have your own garden composter meat waste can still be binned).\n\nI think the misconception of landfill waste comes from people not understanding the difference between aerobic decomposition you get with composting and the anaerobic process in a lane fill that provides so much more methane.",
                          "timestamp": "2022-05-21 12:44:28",
                          "score": 2,
                          "num_children": 1,
                          "author": 106022,
                          "replies": [
                            {
                              "id": "i9ghq3d",
                              "text": "Love a good community garden! Great for the environment, helps improve biodiversity, more nature lowers crime and domestic violence, improves mental health and is just a good place to meet your neighbours.",
                              "timestamp": "2022-05-21 15:16:00",
                              "score": 2,
                              "num_children": 0,
                              "author": 223197,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i98gu4l",
          "text": "Ah, the age old question “How do you know if someone is vegan?” Is answered once again.",
          "timestamp": "2022-05-19 18:43:52",
          "score": 5,
          "num_children": 1,
          "author": 199255,
          "replies": [
            {
              "id": "i99ckxg",
              "text": "https://www.reddit.com/r/vegan/comments/4jhv9s/how_can_you_tell_if_someone_is_vegan/",
              "timestamp": "2022-05-19 22:44:52",
              "score": 1,
              "num_children": 2,
              "author": 401159,
              "replies": [
                {
                  "id": "i99d1sa",
                  "text": "That's not what happened here though.",
                  "timestamp": "2022-05-19 22:48:40",
                  "score": 4,
                  "num_children": 0,
                  "author": 300797,
                  "replies": []
                },
                {
                  "id": "i99cz5j",
                  "text": "I think you need to pay a bit more attention. Really not what happened here.",
                  "timestamp": "2022-05-19 22:48:05",
                  "score": 4,
                  "num_children": 0,
                  "author": 199255,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i99a6rf",
          "text": "This reads like a copy pasta meme. This isn't how you convince people to eat less meat and bring awareness to animal treatment on butcher farms. This is how you push people away.",
          "timestamp": "2022-05-19 22:25:39",
          "score": 1,
          "num_children": 0,
          "author": 300797,
          "replies": []
        },
        {
          "id": "i9a5c7v",
          "text": "I'll continue eating animals",
          "timestamp": "2022-05-20 02:44:03",
          "score": 1,
          "num_children": 0,
          "author": 327244,
          "replies": []
        }
      ]
    },
    {
      "id": "i9b31su",
      "text": "I know I will probably be down voted but this is one of the reasons I became vegan. This same treatment you witnessed is what happens to all animals bred for food.\n\nBreeding in general is a horrible practice that should be outlawed regardless of the animal. It really is terrible what we as a species do to others (our own as well as our animal compatriots).",
      "timestamp": "2022-05-20 09:25:00",
      "score": -1,
      "num_children": 0,
      "author": 246856,
      "replies": []
    },
    {
      "id": "i98g0pk",
      "text": "Self-centered and feeling Superior.",
      "timestamp": "2022-05-19 18:38:17",
      "score": 1,
      "num_children": 0,
      "author": 144782,
      "replies": []
    },
    {
      "id": "i98w5lv",
      "text": "Wow this is truly horrible.  🤢",
      "timestamp": "2022-05-19 20:37:58",
      "score": 1,
      "num_children": 0,
      "author": 204633,
      "replies": []
    },
    {
      "id": "i993bjq",
      "text": "Now I'm sad. I'm gonna go grab my 2 rescue boys and hug them tight. If there is an afterlife I hope it's like Letterkenny says \"there's a special place in heaven for animal lovers\" and I hope the inverse is the same.",
      "timestamp": "2022-05-19 21:32:56",
      "score": 1,
      "num_children": 0,
      "author": 278135,
      "replies": []
    },
    {
      "id": "i994yeq",
      "text": "Prosperity theology.",
      "timestamp": "2022-05-19 21:45:20",
      "score": 1,
      "num_children": 0,
      "author": 189765,
      "replies": []
    },
    {
      "id": "i995606",
      "text": "Evangelical's entire belief system is \"Do what I say or burn in hell\" and that sums up everything you need to know about how much they value life.",
      "timestamp": "2022-05-19 21:46:56",
      "score": 1,
      "num_children": 0,
      "author": 301511,
      "replies": []
    },
    {
      "id": "i995f8b",
      "text": "they only really care about unborn human life.",
      "timestamp": "2022-05-19 21:48:53",
      "score": 1,
      "num_children": 0,
      "author": 142772,
      "replies": []
    },
    {
      "id": "i995rty",
      "text": "Evangelicals commit adultery and have abortions too. I have a source on that.",
      "timestamp": "2022-05-19 21:51:28",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i995yox",
      "text": "Evangelical Christianity is a religion of greed, hate, and selfish narcissism.",
      "timestamp": "2022-05-19 21:52:55",
      "score": 1,
      "num_children": 0,
      "author": 391006,
      "replies": []
    },
    {
      "id": "i996dpo",
      "text": "If your grandparents are dead now, what happened to the property and the barn?",
      "timestamp": "2022-05-19 21:56:10",
      "score": 1,
      "num_children": 0,
      "author": 4354,
      "replies": []
    },
    {
      "id": "i996hlb",
      "text": "Evangelicals care about one thing and one thing only, themselves. Money is helpful to the self so it is morally good to obtain it, whatever the means.",
      "timestamp": "2022-05-19 21:57:00",
      "score": 1,
      "num_children": 0,
      "author": 221112,
      "replies": []
    },
    {
      "id": "i998y36",
      "text": "That is horrifying. If you’ll excuse me, I need to give my furchild a nice long walk and an equally long hug 😢",
      "timestamp": "2022-05-19 22:15:53",
      "score": 1,
      "num_children": 0,
      "author": 291768,
      "replies": []
    },
    {
      "id": "i999qxi",
      "text": "Makes you wonder what happened to all of those dogs after your grandparents died. Tragic what happens when they think only their own soul has value.",
      "timestamp": "2022-05-19 22:22:09",
      "score": 1,
      "num_children": 0,
      "author": 300245,
      "replies": []
    },
    {
      "id": "i99d1vh",
      "text": "That’s so , so sick. I’m sorry.",
      "timestamp": "2022-05-19 22:48:41",
      "score": 1,
      "num_children": 0,
      "author": 322944,
      "replies": []
    },
    {
      "id": "i99gph6",
      "text": "These are the kind of people Oliver Queen should have visited. \n\nEspecially out in the woods? Some dude walking in there in green, with face paint and a bow? Wouldn’t even stand out to anyone.",
      "timestamp": "2022-05-19 23:19:10",
      "score": 1,
      "num_children": 0,
      "author": 311461,
      "replies": []
    },
    {
      "id": "i99r3is",
      "text": "I never wish harm on random people. But I wish there's a hell and they're rotting there for eternity",
      "timestamp": "2022-05-20 00:47:11",
      "score": 1,
      "num_children": 0,
      "author": 93156,
      "replies": []
    },
    {
      "id": "i99srx5",
      "text": "Religion is money.",
      "timestamp": "2022-05-20 01:01:12",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i99vbgr",
      "text": "Jesus loves money and the prosperity gospel says we should give all our money to the preachers",
      "timestamp": "2022-05-20 01:21:58",
      "score": 1,
      "num_children": 0,
      "author": 344812,
      "replies": []
    },
    {
      "id": "i99x8gz",
      "text": "It breaks my heart to read this, but sadly, it didn't shock me because I'm pretty familiar with the puppy mill industry. My first dog as a kid was rescued from a puppy mill after breeding for 6 years and she was terrified of the world. Now I regularly foster dogs, and many of them are also puppy mill survivors. Many of them are too scared to even be touched, and I met one who didn't even know how to walk. \n\nSadly, the only reason puppy mills keep operating is because people are supporting them, sometimes without knowing. Pet stores and online puppy sellers are almost always puppy mills. So, if anyone reading this is currently looking for a dog, please do your research. I definitely recommend a rescue dog - they're just as sweet as any other dog and they deserve so much love!",
      "timestamp": "2022-05-20 01:37:25",
      "score": 1,
      "num_children": 0,
      "author": 167773,
      "replies": []
    },
    {
      "id": "i99xu9i",
      "text": "You had a very tough lesson in life just don't be like your folks I understand and I have lost family members because of religion they disowned me I haven't seen him in years wish you the best of luck",
      "timestamp": "2022-05-20 01:42:17",
      "score": 1,
      "num_children": 0,
      "author": 345942,
      "replies": []
    },
    {
      "id": "i99yj3i",
      "text": "This is why Buddhism appeals to me more than Christianity— at least in theory, we are meant to consider every sentient being as equal to every other. I don’t have the answers, but there’s no way I can consider any creature’s suffering to be less than my own.",
      "timestamp": "2022-05-20 01:47:53",
      "score": 1,
      "num_children": 1,
      "author": 357306,
      "replies": [
        {
          "id": "i9cw4fs",
          "text": "How does that translate into your lifestyle?",
          "timestamp": "2022-05-20 18:02:17",
          "score": 1,
          "num_children": 1,
          "author": 366772,
          "replies": [
            {
              "id": "i9e59hn",
              "text": "Most Buddhists are pretty pragmatic. I fall into that category, I’d say. I live a standard American life while trying to buy, eat, and live with compassion and care. \n\nNote I say “trying”. I’m faulty and I do eat meat but I’m working on that. If that seems hypocritical keep in mind the traditional Tibetan diet is meat-based. It’s a paradox for sure.\n\nhttps://international.ucla.edu/apc/event/13526\n\n… anyhow, there are tons of better, more dedicated American Buddhists than myself. I’m a work in progress.\n\nEdit: most of the meat I eat is when I share chicken with my cats, who are obligate carnivores, and cannot opt out. I try to buy humanely raised and killed animals only. \n\nNo easy answers in life…",
              "timestamp": "2022-05-20 23:56:35",
              "score": 2,
              "num_children": 0,
              "author": 357306,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9a2wm1",
      "text": "Damn, that's heavy.",
      "timestamp": "2022-05-20 02:23:46",
      "score": 1,
      "num_children": 0,
      "author": 55391,
      "replies": []
    },
    {
      "id": "i9a3v29",
      "text": "Most  business owners  who put the Jesus fish in their company logo do it for marketing",
      "timestamp": "2022-05-20 02:31:47",
      "score": 1,
      "num_children": 0,
      "author": 134311,
      "replies": []
    },
    {
      "id": "i9a53bj",
      "text": "Will you take their money when they die?",
      "timestamp": "2022-05-20 02:41:59",
      "score": 1,
      "num_children": 0,
      "author": 351089,
      "replies": []
    },
    {
      "id": "i9a5cc8",
      "text": "My family also follows the Prosperity Doctrine. \n\nPretty much the Manifest Destiny of the American suburbs.",
      "timestamp": "2022-05-20 02:44:05",
      "score": 1,
      "num_children": 0,
      "author": 284635,
      "replies": []
    },
    {
      "id": "i9a5mw6",
      "text": "Sounds right on point.  Rules for me not for thee…",
      "timestamp": "2022-05-20 02:46:33",
      "score": 1,
      "num_children": 0,
      "author": 282876,
      "replies": []
    },
    {
      "id": "i9a7chk",
      "text": "It's okay to be a vile rotten person as long as you ask Jesus for forgiveness.",
      "timestamp": "2022-05-20 03:01:10",
      "score": 1,
      "num_children": 0,
      "author": 158434,
      "replies": []
    },
    {
      "id": "i9a89je",
      "text": "There is a belief that God rewards the faithful. So by being monetarily well off they are showing how God rewards them.",
      "timestamp": "2022-05-20 03:09:15",
      "score": 1,
      "num_children": 0,
      "author": 10521,
      "replies": []
    },
    {
      "id": "i9a911g",
      "text": "This sent a chill down my spine. Ive always considered a correlation between being *ultra* religious and being pure evil, because religion allows you to believe the only judgement is in the afterlife and none here on Earth. Those poor dogs.\nEdit: added “ultra”",
      "timestamp": "2022-05-20 03:16:11",
      "score": 1,
      "num_children": 0,
      "author": 208726,
      "replies": []
    },
    {
      "id": "i9a9dre",
      "text": "WTH. That's horrible to hear, about the puppy doom factory. Thank goodness your mom reported it and also better that you have higher morals over book cover christians.",
      "timestamp": "2022-05-20 03:19:25",
      "score": 1,
      "num_children": 0,
      "author": 155865,
      "replies": []
    },
    {
      "id": "i9a9piu",
      "text": "it's sad how this is happening, I wish the worst did not seem so appealing with the general public :(",
      "timestamp": "2022-05-20 03:22:21",
      "score": 1,
      "num_children": 0,
      "author": 325093,
      "replies": []
    },
    {
      "id": "i9a9rr0",
      "text": "This was just depressing to read",
      "timestamp": "2022-05-20 03:22:55",
      "score": 1,
      "num_children": 0,
      "author": 237104,
      "replies": []
    },
    {
      "id": "i9aai8d",
      "text": "Prosperity gospel....",
      "timestamp": "2022-05-20 03:29:38",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9abq60",
      "text": "Motion to declare a writ of boys-will-be-boys.\n\nMotion granted.\n\nCase dismissed.",
      "timestamp": "2022-05-20 03:40:55",
      "score": 1,
      "num_children": 0,
      "author": 395058,
      "replies": []
    },
    {
      "id": "i9ac628",
      "text": "Sweet! Man made horrors beyond my comprehension!",
      "timestamp": "2022-05-20 03:45:08",
      "score": 1,
      "num_children": 0,
      "author": 156654,
      "replies": []
    },
    {
      "id": "i9acz4v",
      "text": "Church people are the scum of earth",
      "timestamp": "2022-05-20 03:52:53",
      "score": 1,
      "num_children": 0,
      "author": 161565,
      "replies": []
    },
    {
      "id": "i9aioza",
      "text": "Couldn't they get arrested for animal right violations or something like that?",
      "timestamp": "2022-05-20 04:52:07",
      "score": 1,
      "num_children": 0,
      "author": 254048,
      "replies": []
    },
    {
      "id": "i9aolmw",
      "text": "I fuckin hate your grandparents, man. I really do.",
      "timestamp": "2022-05-20 06:02:12",
      "score": 1,
      "num_children": 0,
      "author": 68106,
      "replies": []
    },
    {
      "id": "i9aopk8",
      "text": "So.  For no reason at all I'm considering a trip to whatever hellhole shit town,  so I'd like to know where to go to not commit arson and/or murder.....\n\nPlease don't tell me where this is.  I have time on my hands and would hate to spend it destroying this place.",
      "timestamp": "2022-05-20 06:03:34",
      "score": 1,
      "num_children": 0,
      "author": 227590,
      "replies": []
    },
    {
      "id": "i9aos45",
      "text": "Thank you because although traumatic, it was a very valuable attestation. It also shows that not all apples fall near the tree. Lastly as somebody mentioned, we should keep very much in mind that most meat and dairy we consume follow a very similar route, and try to act consequently, for exemple greatly reducing their unnecessarily and unhealthily high consumption, or voting for somebody who makes this immense ethical and environmental issue prominent part of his agenda.",
      "timestamp": "2022-05-20 06:04:25",
      "score": 1,
      "num_children": 0,
      "author": 149965,
      "replies": []
    },
    {
      "id": "i9avug1",
      "text": "It seems so many of these heavily devout Christians seem to justify there bad actions because they workship god , as if there was a gog at the end they wouldn't be judged on there actions not because they worshiped them",
      "timestamp": "2022-05-20 07:40:42",
      "score": 1,
      "num_children": 0,
      "author": 249829,
      "replies": []
    },
    {
      "id": "i9b720d",
      "text": "Destroy their legacy",
      "timestamp": "2022-05-20 10:18:03",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9b82h5",
      "text": "All living beings must be dealt with compassion. Non-Christians aren't really \"alive\" in a true sense. So fuck them. /s",
      "timestamp": "2022-05-20 10:31:23",
      "score": 1,
      "num_children": 1,
      "author": 313980,
      "replies": [
        {
          "id": "i9cwfvt",
          "text": "> All living beings must be dealt with compassion.\n\nTrees don't need compassion because they have no feelings to have compassion for.\n\nAll sentient beings must be dealt with compassion.\n\nNormalize sentientism instead of typical humanism.",
          "timestamp": "2022-05-20 18:04:42",
          "score": 1,
          "num_children": 0,
          "author": 366772,
          "replies": []
        }
      ]
    },
    {
      "id": "i9bgkk4",
      "text": "Can u be a breeder of dogs and not be considered a puppy mill? I got a pup from Green Acres from an amish farm up in PA and now i might feel pretty crappy about it..",
      "timestamp": "2022-05-20 11:59:04",
      "score": 1,
      "num_children": 1,
      "author": 240068,
      "replies": [
        {
          "id": "i9bk14k",
          "text": "Yes. Knew a family that bred Dachshunds. They lived on a farm and took very good care of their dogs. They just really loved the breed and would follow up on any dogs they sold to ensure they went to good homes.",
          "timestamp": "2022-05-20 12:28:52",
          "score": 3,
          "num_children": 1,
          "author": 95020,
          "replies": [
            {
              "id": "i9bn0kp",
              "text": "Thats good news!",
              "timestamp": "2022-05-20 12:53:14",
              "score": 1,
              "num_children": 0,
              "author": 240068,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9bk9i8",
      "text": "2 people of a group being “bad” doesn’t make their whole group also bad. Millions of years of evolution developed our brains well beyond the tribalistic little groups you see the world in.",
      "timestamp": "2022-05-20 12:30:52",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9bl9c0",
      "text": "If you really feel so strongly and if they are still doing it then call animal control. That is definitely animal abuse",
      "timestamp": "2022-05-20 12:39:05",
      "score": 1,
      "num_children": 0,
      "author": 129313,
      "replies": []
    },
    {
      "id": "i9bsk5i",
      "text": "Torch it.",
      "timestamp": "2022-05-20 13:35:12",
      "score": 1,
      "num_children": 0,
      "author": 119141,
      "replies": []
    },
    {
      "id": "i9bup6m",
      "text": "I am so sorry, this is heartbreaking",
      "timestamp": "2022-05-20 13:50:39",
      "score": 1,
      "num_children": 0,
      "author": 201765,
      "replies": []
    },
    {
      "id": "i9bveg5",
      "text": "lf all dogs go to heaven then Jesus is going to go to town on your fucking grandpa with a baseball bat.",
      "timestamp": "2022-05-20 13:55:39",
      "score": 1,
      "num_children": 0,
      "author": 58862,
      "replies": []
    },
    {
      "id": "i9bwyw4",
      "text": "its ok god will vindicate his actions as long as he repents",
      "timestamp": "2022-05-20 14:06:42",
      "score": 1,
      "num_children": 0,
      "author": 160095,
      "replies": []
    },
    {
      "id": "i9c4msf",
      "text": "everyone commenting has probably eaten hundreds or thousands of animals. and yet they still think this is unusual? what do you think happened to your food before it came to your plate",
      "timestamp": "2022-05-20 14:58:29",
      "score": 1,
      "num_children": 0,
      "author": 56063,
      "replies": []
    },
    {
      "id": "i9c6b20",
      "text": "Religion is little more than a well executed cover for evil.  My thanks to you for seeing through their lies to the truth. I honor your courage in eliminating these vile derelicts from your life. I look forward to their passing from this world. I hope their passing resembles the hell they imposed on helpless creatures.",
      "timestamp": "2022-05-20 15:09:42",
      "score": 1,
      "num_children": 0,
      "author": 248574,
      "replies": []
    },
    {
      "id": "i9cg6v8",
      "text": "Wow! I'm laying in bed with my dog reading this and it almost made me cry.",
      "timestamp": "2022-05-20 16:14:50",
      "score": 1,
      "num_children": 0,
      "author": 209361,
      "replies": []
    },
    {
      "id": "i9cq3ih",
      "text": "Fuck",
      "timestamp": "2022-05-20 17:19:58",
      "score": 1,
      "num_children": 0,
      "author": 122759,
      "replies": []
    },
    {
      "id": "i9ix9q6",
      "text": "Isn't it Christian ideology that animals don't have soul or something?\nI remember reading Descarte arguing that animals are some sort of biological automatons.",
      "timestamp": "2022-05-22 03:34:16",
      "score": 1,
      "num_children": 0,
      "author": 111879,
      "replies": []
    },
    {
      "id": "i99t64c",
      "text": "[removed]",
      "timestamp": "2022-05-20 01:04:24",
      "score": -3,
      "num_children": 1,
      "replies": [
        {
          "id": "i9ifj6s",
          "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for breaking site-wide [reddit rules](http://www.reddit.com/rules). Removals of this type may also include subreddit bans and/or suspensions from the whole site depending on the severity of the offense.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
          "timestamp": "2022-05-22 00:51:39",
          "score": 1,
          "num_children": 0,
          "author": 122319,
          "replies": []
        }
      ]
    },
    {
      "id": "i99l0s6",
      "text": "You generalized from one case to a whole group of millions? You don't say...",
      "timestamp": "2022-05-19 23:55:41",
      "score": -4,
      "num_children": 0,
      "author": 310420,
      "replies": []
    },
    {
      "id": "i99irgc",
      "text": "\"I saw one person do this so they all do it.\"\n\nVery stupid logic there.",
      "timestamp": "2022-05-19 23:36:29",
      "score": -7,
      "num_children": 0,
      "author": 214462,
      "replies": []
    },
    {
      "id": "i99cqf0",
      "text": "Oh yeah, judge a whole community based off one person",
      "timestamp": "2022-05-19 22:46:05",
      "score": -9,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i98iwwb",
      "text": "[removed]",
      "timestamp": "2022-05-19 18:57:54",
      "score": -19,
      "num_children": 3,
      "replies": [
        {
          "id": "i98kanl",
          "text": "The child molesting cult?",
          "timestamp": "2022-05-19 19:07:19",
          "score": 15,
          "num_children": 0,
          "author": 405723,
          "replies": []
        },
        {
          "id": "i98pc2l",
          "text": "Or, you know, no religion at all because they're all bullshit.",
          "timestamp": "2022-05-19 19:41:37",
          "score": 7,
          "num_children": 0,
          "author": 286151,
          "replies": []
        },
        {
          "id": "i999a09",
          "text": "My grandma is catholic. The last time I visited her we watched a new segment about child abuse and rape in the Catholic church and she went on a rant about how everyone should leave Catholics alone. \n\nShe wasn't upset about the abuse or rape she was upset about people talking about it. Catholicism is the right way?",
          "timestamp": "2022-05-19 22:18:32",
          "score": 3,
          "num_children": 0,
          "author": 300797,
          "replies": []
        }
      ]
    },
    {
      "id": "i98lgs0",
      "text": "Matthew 24:5\n\nFor many will come in my name, claiming, ‘I am the Messiah,’ and will deceive many.",
      "timestamp": "2022-05-19 19:15:15",
      "score": -13,
      "num_children": 0,
      "author": 1875,
      "replies": []
    },
    {
      "id": "i98kyhy",
      "text": "If they ever read the Bible, they would be religious",
      "timestamp": "2022-05-19 19:11:48",
      "score": -12,
      "num_children": 0,
      "author": 164082,
      "replies": []
    },
    {
      "id": "i99nqgw",
      "text": "Two people from one group did a bad thing and now I believe that all people from that group are that way. Do you see how this might be a poor way to judge a group?",
      "timestamp": "2022-05-20 00:18:53",
      "score": -6,
      "num_children": 0,
      "author": 295531,
      "replies": []
    },
    {
      "id": "i99zl9e",
      "text": "Cool so anecdotal evidence can completely skew you entire psyche",
      "timestamp": "2022-05-20 01:56:27",
      "score": -5,
      "num_children": 0,
      "author": 186434,
      "replies": []
    },
    {
      "id": "i99f71k",
      "text": "Almost like people are people no matter their religious beliefs",
      "timestamp": "2022-05-19 23:06:21",
      "score": -4,
      "num_children": 0,
      "author": 341027,
      "replies": []
    },
    {
      "id": "i9ajbvi",
      "text": "That’s just your grandparents.",
      "timestamp": "2022-05-20 04:59:21",
      "score": -4,
      "num_children": 0,
      "author": 182271,
      "replies": []
    },
    {
      "id": "i9a2lap",
      "text": "Sad that they irresponsibly Bred Dalmatians. Dalmatians would not have such a bad reputation if people Bred them responsibly. I responsibly Breed mine.",
      "timestamp": "2022-05-20 02:21:11",
      "score": -3,
      "num_children": 0,
      "author": 163711,
      "replies": []
    },
    {
      "id": "i99zzex",
      "text": "Also, bringing hundreds of  Dalmatians into this world is a grievous sin as well, because they are one of the worst breed of dogs.",
      "timestamp": "2022-05-20 01:59:43",
      "score": -2,
      "num_children": 0,
      "author": 196222,
      "replies": []
    },
    {
      "id": "i99wjeb",
      "text": "poor dogs; as a breeder myself i find these places atrocious. Dalmatians especially are riddled with genetic issues that require tremendous amounts of health screening and general testing.  \n\nmany of the self quoted christians that i know are some of the worse people i've ever met, who will screw you over in a heartbeat. my own family member promised me the opportunity to rent out her 2nd house and perform repairs, but on the last day she had me drive down to her while she said she changed her mind and that her coworkers said she could get more money renting it to others; she didn't even care that if i had postponed renewing my apartment lease, i would have been homeless. That's just one story too. My other aunt tried to marry me off to a mormon missionary at the age of 8 year old. many of these people are SCUM",
      "timestamp": "2022-05-20 01:31:54",
      "score": 0,
      "num_children": 0,
      "author": 385339,
      "replies": []
    },
    {
      "id": "i99zdnw",
      "text": "Did you...take pictures as evidence and report them to authorities? \nI know you might be having mixed feelings since they are family members, but they truly belong in prison!\n\nedit: oh, I just noticed it was in your post already. that's so fucked up, that nobody acted on the report. maybe it wasn't containing enough evidence? If people disregarded it because they were 'well known good christians', I totally would've went to the next higher instance and reported on those local officials for not doing their jobs correctly. Alternatively also get the press involved. Gotta go up the food chain.",
      "timestamp": "2022-05-20 01:54:43",
      "score": 0,
      "num_children": 0,
      "author": 386170,
      "replies": []
    },
    {
      "id": "i9aajhx",
      "text": "Their hell will being reincarnated as those dogs.",
      "timestamp": "2022-05-20 03:29:58",
      "score": 0,
      "num_children": 0,
      "author": 144512,
      "replies": []
    },
    {
      "id": "i9ap6t0",
      "text": "Humans are more important than dogs. One human life is worth more than a dog. But dogs are innocent and our friends. Is our moral obligation to protect them.",
      "timestamp": "2022-05-20 06:09:32",
      "score": 0,
      "num_children": 1,
      "author": 148455,
      "replies": [
        {
          "id": "i9cwbjf",
          "text": "> But dogs are innocent and our friends.\n\nWhat if a dog doesn't like to be social and friendly with humans, but is also harmless, should they also be protected against abuse?\n\nHow do you define animal abuse?",
          "timestamp": "2022-05-20 18:03:48",
          "score": 1,
          "num_children": 1,
          "author": 366772,
          "replies": [
            {
              "id": "i9sr6ry",
              "text": "Thats basically the novel Frankestein. A inocent creature can be turn into a monster with blood in his hands. At that point your only moral option could be to kill the monster. But also make sure he dont suffer and fight to the causes that turned him into a monster. If there where a isle where the monster might live alone, might be a moral option to move him there. I dont know.",
              "timestamp": "2022-05-24 12:17:30",
              "score": 1,
              "num_children": 1,
              "author": 148455,
              "replies": [
                {
                  "id": "i9stt5u",
                  "text": "> At that point your only moral option could be to kill the monster. \n\nBetter to not create them in the first place.\n\nYou completely missed my point.\n\nI'm not talking about a harmful dog, I was very clear about it.\n\nYou said dogs were innocents and our friends, implying that's why they should be protected from being killed.\n\nI said: **What if a dog doesn't like to be social and friendly with humans, but is also harmless, should they also be protected against abuse?**\n\nThat's basically a dog that's only innocent, not our friend.\n\nWould it be wrong to kill that dog then? Is \"friend\" a requirement to have a right to live, or is \"innocent\" enough?",
                  "timestamp": "2022-05-24 12:42:21",
                  "score": 1,
                  "num_children": 1,
                  "author": 366772,
                  "replies": [
                    {
                      "id": "ibpbvfe",
                      "text": "we would still help the dog because we owe friendship for generations. we kill other animals for meat, or when they become a risk to our lives, but we owe something to dogs and is generational.. bigger than a single animal",
                      "timestamp": "2022-06-09 06:16:37",
                      "score": 1,
                      "num_children": 1,
                      "author": 148455,
                      "replies": [
                        {
                          "id": "ibpmr96",
                          "text": "\n\n\nAnd that's a cringe take right there. Especially on this subreddit.\n\nAny newly born individual that had nothing to do with the acts of their ancestors doesn't deserve any particular privilege or punishment.\n\nTo believe the actions of ancestors should affect how children are treated, that's religious logic right there, analogous to original sin bullshit.\n\nIt's amazing how you people can sometimes fail to use basic logic whenever religion isn't the main topic.",
                          "timestamp": "2022-06-09 08:59:01",
                          "score": 1,
                          "num_children": 0,
                          "author": 366772,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9awag6",
      "text": "If it’s still active. You can report them to USDA. They administer over “high volume” dealers. And if he doesn’t have licensure, I am certain they’d love to hear about it.",
      "timestamp": "2022-05-20 07:47:19",
      "score": 0,
      "num_children": 0,
      "author": 156305,
      "replies": []
    },
    {
      "id": "i9b9pmm",
      "text": "I m muslım",
      "timestamp": "2022-05-20 10:51:57",
      "score": 0,
      "num_children": 0,
      "author": 140549,
      "replies": []
    },
    {
      "id": "i9beeoy",
      "text": "[deleted]",
      "timestamp": "2022-05-20 11:39:16",
      "score": 0,
      "num_children": 1,
      "replies": [
        {
          "id": "i9bhuo1",
          "text": "Shut the fuck up.",
          "timestamp": "2022-05-20 12:10:17",
          "score": 0,
          "num_children": 0,
          "author": 395190,
          "replies": []
        }
      ]
    }
  ]
}