{
  "id": "utv8k2",
  "text": "Satanic Temple to send 'Hail Satan' decals to Kansas town that reversed ban on 'God' from police cars | Satanic Temple's decal designs for police cars include: 'Duty, Honor, Community, Hail Satan'\n",
  "timestamp": "2022-05-20 13:04:39",
  "score": 18334,
  "subreddit": "t5_2qh2p",
  "num_children": 123,
  "author": 221311,
  "replies": [
    {
      "id": "i9cuw6n",
      "text": "Hello r/all, Welcome to r/atheism!\n\nPlease read our [Commandments](http://www.reddit.com/r/atheism/wiki/guidelines) and [FAQ](http://www.reddit.com/r/atheism/wiki/FAQ) before commenting. If you follow the rules and act civilly we can avoid a lot of bans. While everyone is welcome here, this sub is intended for atheists to discuss things of interest to us. This means that a wide variety of subjects are on-topic here. This is not a sub about just atheism.\n\nRemember: The mods do not choose which posts get voted up the frontpage. They remove the posts that violate the [Commandments](/r/atheism/w/guidelines); they don't police quality.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*",
      "timestamp": "2022-05-20 17:53:05",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "i9bokj3",
      "text": "So far only Fox News is reporting this. But fuck linking to them. archive.org ftw!",
      "timestamp": "2022-05-20 13:05:30",
      "score": 2409,
      "num_children": 9,
      "author": 221311,
      "replies": [
        {
          "id": "i9bvsjs",
          "text": "O-ohhh. That's it! I thought they already deleted it! Well, kudos for that intention, I guess.",
          "timestamp": "2022-05-20 13:58:25",
          "score": 400,
          "num_children": 0,
          "author": 407907,
          "replies": []
        },
        {
          "id": "i9c77n5",
          "text": "Yeah, but then you don't get to see insightful comments like:\n\n\"People need to stop worrying about \"inclusion\" and just go back to the way things were. America is great, pledge allegiance to the flag, in God we trust. Too bad if people are offended. Go move to some other country.\"  \n\n\n\"Sorry, but our country was founded on Christianity. Get with the program. You're gonna need it when you pass from this life to the next.\"\n\n\"Sounds like what the Republicans have been saying to the Democrat's.  Stop injecting Race, Gender Identity, Equity, and CRT into everything!!!!!!!!!!!!!!!!!!!\"\n\n\"Go stand in line to recharge your Tesla Karen..lol\"\n\n&#x200B;\n\n\"For sure, Hillary has finally found a place she can feel at home & worship!\"",
          "timestamp": "2022-05-20 15:15:44",
          "score": 353,
          "num_children": 17,
          "author": 185622,
          "replies": [
            {
              "id": "i9cgzxx",
              "text": "I love the comment about go to another country… those asshats are the same ones who refuse to help immigrants, stating “go back and fight to fix your country!”",
              "timestamp": "2022-05-20 16:20:07",
              "score": 247,
              "num_children": 6,
              "author": 140317,
              "replies": [
                {
                  "id": "i9ch8qg",
                  "text": "There's a few people fighting the good fight, but these Foxers are too far gone.\n\nEDIT: The Clinton comments are always good. I've heard them since '92!",
                  "timestamp": "2022-05-20 16:21:41",
                  "score": 94,
                  "num_children": 3,
                  "author": 185622,
                  "replies": [
                    {
                      "id": "i9d5zfe",
                      "text": "I had an ex-girlfriend who unironically used the word Clinton as a synonym for liar.  She was 12 when Bill left office, too.",
                      "timestamp": "2022-05-20 19:19:06",
                      "score": 14,
                      "num_children": 1,
                      "author": 351475,
                      "replies": [
                        {
                          "id": "i9d6g38",
                          "text": ">I had an ex-girlfriend who unironically used the word Clinton as a synonym for liar.  She was 12 when Bill left office, too.\n\nTalked to her lately? Does she use Trump now?",
                          "timestamp": "2022-05-20 19:22:31",
                          "score": 10,
                          "num_children": 1,
                          "author": 185622,
                          "replies": [
                            {
                              "id": "i9d7ldf",
                              "text": "Thankfully we don’t talk any more so I don’t need to know or care.",
                              "timestamp": "2022-05-20 19:31:15",
                              "score": 17,
                              "num_children": 0,
                              "author": 351475,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i9co7yq",
                      "text": "Fox viewers are the more reasonable bunch. OAN and NewsMax viewers slam Fox for being \"too liberal\".",
                      "timestamp": "2022-05-20 17:07:19",
                      "score": 55,
                      "num_children": 5,
                      "author": 315954,
                      "replies": [
                        {
                          "id": "i9coxff",
                          "text": "Well hopefully those people watching that much TV are Rascal scooter warriors.\n\nEDIT: Fix spelling.",
                          "timestamp": "2022-05-20 17:12:04",
                          "score": 29,
                          "num_children": 1,
                          "author": 185622,
                          "replies": [
                            {
                              "id": "i9cxn7b",
                              "text": ">Well hopefully those peoplexeatching that much TV are Rascal scooter warriors.\n\nThey are the bunch that keep saying \"socialized medicine bad\" from the seat of the scooter paid for by socialized medicine.",
                              "timestamp": "2022-05-20 18:13:50",
                              "score": 39,
                              "num_children": 3,
                              "author": 315954,
                              "replies": [
                                {
                                  "id": "i9d2nsz",
                                  "text": "I take care of an uncle that's somewhat like this and it's infuriating. He's currently trying to get on disability, which he needs, he's very sick and hasn't been able to work in years. The only reason he has a shot is because he's had insurance via the ACA for the last few years so he has a medical history of all of his issues. He literally didnt go to the doctor before that for years and years because he couldn't afford to. \n\nYet he never hesitates to complain about \"Obamacare\" or refer to it sarcastically. He likely wouldn't be alive without it. He *voted for Obama*. Yet, somehow its bad. He's totally gotten it from Facebook and the idiots he's friends with on there. It's just maddening.",
                                  "timestamp": "2022-05-20 18:52:53",
                                  "score": 38,
                                  "num_children": 2,
                                  "author": 264848,
                                  "replies": [
                                    {
                                      "id": "i9d4g0q",
                                      "text": "These guys are always on disability...Not that they shouldn't be, but it's \"I need it,\" but other people are just lazy and entitled.",
                                      "timestamp": "2022-05-20 19:06:57",
                                      "score": 27,
                                      "num_children": 3,
                                      "author": 185622,
                                      "replies": [
                                        {
                                          "id": "i9d9owh",
                                          "text": "Thankfully, at least, he doesn't think others don't need it, he hasnt dove that far into the deep end... yet. \n\nI don't think he can actually verbalize what is \"bad\" about it, he's just chosing to listen to the wrong people and take what they say at fave value. Once in a blue moon he'll actually ask me about something he's been told that I can tell he's conflicted about. Sometimes he'll listen to me, other times not so much.",
                                          "timestamp": "2022-05-20 19:46:42",
                                          "score": 9,
                                          "num_children": 1,
                                          "author": 264848,
                                          "replies": [
                                            {
                                              "id": "i9dovmx",
                                              "text": "It's this self-reliance thing that some Christians, GOP types harp on to an unhealthy extent. \nLike sure, you need to pull your weight. But when you can't pull anything it doesn't do any good to blame the wrong people.",
                                              "timestamp": "2022-05-20 21:42:04",
                                              "score": 4,
                                              "num_children": 0,
                                              "author": 185622,
                                              "replies": []
                                            }
                                          ]
                                        },
                                        {
                                          "id": "i9fbnoq",
                                          "text": "Yeah, but they’re real Americans. /s",
                                          "timestamp": "2022-05-21 07:09:30",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 170686,
                                          "replies": []
                                        },
                                        {
                                          "id": "i9e95v2",
                                          "text": "Fuck yes they shouldn't be. Why the fuck should my dollars go to pay for some sicko who needs to pull his ass up by the bootstraps.",
                                          "timestamp": "2022-05-21 00:31:06",
                                          "score": 0,
                                          "num_children": 0,
                                          "author": 163521,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "i9ddwsw",
                                      "text": "My ex. Man has never ever really worked. Spent most of his life avoiding responsibility for anything with a generous bit of time in and out of prison. Now get SSI cuz he's nuts (really) after spending what was likely a several hundred thousand inheritance when his mom passed. Has gone full MAGA but doesn't see to realize that other than he's white, he's exactly the type the right wing hates. Never a day go by where I'm not grateful for divorce.",
                                      "timestamp": "2022-05-20 20:18:17",
                                      "score": 11,
                                      "num_children": 1,
                                      "author": 216131,
                                      "replies": [
                                        {
                                          "id": "i9dht0q",
                                          "text": "I'm so glad you got away from that, much better for your own safety and sanity!",
                                          "timestamp": "2022-05-20 20:47:39",
                                          "score": 5,
                                          "num_children": 0,
                                          "author": 264848,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "i9drge5",
                                  "text": "\"Socialism bad\"\n\n-my Republican dad, who is putting off retirement until my mom is old enough for medicare because they can't afford insurance otherwise",
                                  "timestamp": "2022-05-20 22:02:00",
                                  "score": 17,
                                  "num_children": 1,
                                  "author": 134868,
                                  "replies": [
                                    {
                                      "id": "i9ey531",
                                      "text": "As a semi-professional software engineer I've been recently approached by defense contractors here in the USA. I would not work for them because \"THAT'S SOCIALISM!\"",
                                      "timestamp": "2022-05-21 04:19:15",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 185622,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "i9dn8dd",
                                  "text": "Pretty sure that's also the fox viewers too, pretty much any republican and probably a few democrats too",
                                  "timestamp": "2022-05-20 21:29:22",
                                  "score": 4,
                                  "num_children": 0,
                                  "author": 28829,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i9d4y31",
                          "text": "Me, a foreigner: there is worse than Fox?",
                          "timestamp": "2022-05-20 19:10:56",
                          "score": 13,
                          "num_children": 2,
                          "author": 213427,
                          "replies": [
                            {
                              "id": "i9d72vg",
                              "text": "Oh yes. Very much worse. OAN and Newsmax make Fox look like a DNC luncheon. \n\nAll of them are bad, but Fox is the most reasonable of the bunch.",
                              "timestamp": "2022-05-20 19:27:21",
                              "score": 20,
                              "num_children": 1,
                              "author": 380439,
                              "replies": [
                                {
                                  "id": "i9dpki6",
                                  "text": "Not too long ago I couldn't imagine this statement being said, much less be true. What a strange future I find myself in. I want my legal pharmaceutical grade drugs and flying car dammit",
                                  "timestamp": "2022-05-20 21:47:25",
                                  "score": 14,
                                  "num_children": 0,
                                  "author": 20264,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "i9ej2s9",
                              "text": "The GOP is a recursive arrangement of bad to worse on an infinite scale. They get so abysmally low they can walk under a carbon nanotube and have room to jump a thousand times their own height.",
                              "timestamp": "2022-05-21 01:58:16",
                              "score": 1,
                              "num_children": 0,
                              "author": 250529,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "i9dyu18",
                          "text": "America is too far gone",
                          "timestamp": "2022-05-20 23:01:53",
                          "score": 5,
                          "num_children": 0,
                          "author": 274788,
                          "replies": []
                        },
                        {
                          "id": "i9dp5rl",
                          "text": "There is no excuse for the blatant lies and innuendo from Fox.  They are the same as OAN and NewsMax.",
                          "timestamp": "2022-05-20 21:44:16",
                          "score": 2,
                          "num_children": 1,
                          "author": 48549,
                          "replies": [
                            {
                              "id": "i9dqsxd",
                              "text": "Fox at least deserves a modicum of respect for doing the bare minimum and at least admitting that their God Emperor had in fact lost the election.\n\nNot much better than OAN/NewsMax, but a little.",
                              "timestamp": "2022-05-20 21:57:01",
                              "score": 2,
                              "num_children": 1,
                              "author": 315954,
                              "replies": [
                                {
                                  "id": "i9eja5y",
                                  "text": "No they don't there is nothing acceptable about them.",
                                  "timestamp": "2022-05-21 02:00:00",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 250529,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i9d4w29",
                          "text": "[removed]",
                          "timestamp": "2022-05-20 19:10:29",
                          "score": -15,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i9ejzss",
                              "text": "That's what every other religion says. \n\nProve that any book is the word of any deity. You can't! It's irresponsible to accept claims like this without verifiable, falsifiable, and consistent evidence that bares out the particulars. If any theist had this they wouldn't need to punt to faith. Religious faith is truly an outdated mode of superstitious thinking.",
                              "timestamp": "2022-05-21 02:06:06",
                              "score": 1,
                              "num_children": 0,
                              "author": 250529,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i9dysh8",
                      "text": "Seriously though who is even thinking about the Clintons in 2022? Neither of them are really involved in politics anymore and haven't been for 5+ years. I'm waiting for the Al Gore jokes now",
                      "timestamp": "2022-05-20 23:01:32",
                      "score": 7,
                      "num_children": 0,
                      "author": 274788,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i9cmyw2",
                  "text": "If the South ever secedes again, they can keep it next time.",
                  "timestamp": "2022-05-20 16:59:02",
                  "score": 32,
                  "num_children": 6,
                  "author": 252179,
                  "replies": [
                    {
                      "id": "i9dq03h",
                      "text": "What sucks is a lot of southern states close to, and in some cases more than 50% of the population aren't conservatives. The system is rigged to keep them in power and it's fuckin crazy.",
                      "timestamp": "2022-05-20 21:50:45",
                      "score": 10,
                      "num_children": 0,
                      "author": 20264,
                      "replies": []
                    },
                    {
                      "id": "i9cx4rg",
                      "text": "If the South ever secedes again, all the traitors need to be dealt with harshly instead of treated with kid gloves like they were at the end of the Civil War.  Those pardons are a good part of why we have all these shit gibbons nowadays.",
                      "timestamp": "2022-05-20 18:09:55",
                      "score": 29,
                      "num_children": 1,
                      "author": 205064,
                      "replies": [
                        {
                          "id": "i9dh4ng",
                          "text": "They should have executed everyone in the Confederate government as well as any former US officers and men who defected to serve the Confederate army. Then they should have seized the land of slave owners and permanently redistributed them to the slaves. \n\nSay what you will about how the North Vietnamese dealt with those who served the South Vietnamese government, but they at least didn’t let them up off the ground.",
                          "timestamp": "2022-05-20 20:42:30",
                          "score": 17,
                          "num_children": 1,
                          "author": 47849,
                          "replies": [
                            {
                              "id": "i9epvbv",
                              "text": "Yeah, that's kinda what I was getting at, but I've already been banned from Reddit by admins for three days for \"threatening violence\" once when I said that some kids who committed premeditated rape and murder with a bat against a 60 year old lady should be taken out back and shot.  So now I beat around the bush a bit.  \n\nAnd no, admins, \"beating around the bush\" isn't threatening anyone either.  I'm not going to beat anyone, or even any bushes.",
                              "timestamp": "2022-05-21 02:59:14",
                              "score": 3,
                              "num_children": 0,
                              "author": 205064,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i9cw4v1",
                      "text": "Fuck that. The south is beautiful and should be part of the Union. Just because some racist idiots have bad ideas doesn’t mean we should lose it IMO",
                      "timestamp": "2022-05-20 18:02:23",
                      "score": 23,
                      "num_children": 3,
                      "author": 231612,
                      "replies": [
                        {
                          "id": "i9d1890",
                          "text": "What about just Florida?",
                          "timestamp": "2022-05-20 18:41:34",
                          "score": 15,
                          "num_children": 0,
                          "author": 283489,
                          "replies": []
                        },
                        {
                          "id": "i9d0vrh",
                          "text": "Yeah, they've just been, like, a looot of trouble for us. Thanks for breaking the reset button, ancestors. Real great job you did there.",
                          "timestamp": "2022-05-20 18:38:55",
                          "score": 5,
                          "num_children": 0,
                          "author": 319522,
                          "replies": []
                        },
                        {
                          "id": "i9dgpu2",
                          "text": "We managed to put the Native Americans on those little reservations in the middle of nowhere, so I’m sure we could manage it with these fascists.",
                          "timestamp": "2022-05-20 20:39:25",
                          "score": 0,
                          "num_children": 0,
                          "author": 47849,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i9czq76",
                      "text": "Let me get out of here before it does though",
                      "timestamp": "2022-05-20 18:29:55",
                      "score": 5,
                      "num_children": 1,
                      "author": 219424,
                      "replies": [
                        {
                          "id": "i9da00e",
                          "text": "Hey you're alright, don't come to the south tomorrow. Lol",
                          "timestamp": "2022-05-20 19:48:57",
                          "score": 3,
                          "num_children": 0,
                          "author": 118191,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i9e38nw",
                      "text": "No dice. This time we just need to make sure we finish the job. Last time we focused on reconstruction and let the confederate leaders stay in power, let the confederate citizens speak propaganda. This time we need to completely reeducated them.",
                      "timestamp": "2022-05-20 23:39:07",
                      "score": 3,
                      "num_children": 0,
                      "author": 102109,
                      "replies": []
                    },
                    {
                      "id": "i9cy06m",
                      "text": "The Union must and shall persevere",
                      "timestamp": "2022-05-20 18:16:37",
                      "score": 10,
                      "num_children": 0,
                      "author": 301975,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i9dvp22",
                  "text": "If conservatives didn't have double standards, they wouldn't have any at all.",
                  "timestamp": "2022-05-20 22:36:06",
                  "score": 7,
                  "num_children": 0,
                  "author": 361055,
                  "replies": []
                },
                {
                  "id": "i9dh4ic",
                  "text": "I love the nascent peek of self-awareness in that third one. It’s almost as if “we” are the ones doing the things we spend all our time whining about THE LEFT doing.",
                  "timestamp": "2022-05-20 20:42:28",
                  "score": 4,
                  "num_children": 0,
                  "author": 361182,
                  "replies": []
                },
                {
                  "id": "i9djy2q",
                  "text": "And unless those asshats are full-blooded Native American, they're descended from immigrants too, and it's real easy to turn that around on them. Especially when it's an actual Native American telling them, \"Why don't you go back, instead?\"",
                  "timestamp": "2022-05-20 21:03:53",
                  "score": 3,
                  "num_children": 0,
                  "author": 228074,
                  "replies": []
                },
                {
                  "id": "i9e1yz8",
                  "text": "It’s more of a once people get freedom they don’t understand it sort of thing… they take it for granted… like you using your phone to voice a opinion that will ring out and come back because you live in a echo chamber. You just repeat and hear the same thing. I’m sorry I had to break it down for you because you are incapable of having your own thoughts. The man @lachrymologyislegit is basically saying if you live here you’re a American. So adopt American ideals. Like if I lived in another place I would respect and try to come custom to their ideals. Not try and systematically change them by brainwashing. People are sheep.",
                  "timestamp": "2022-05-20 23:28:14",
                  "score": -1,
                  "num_children": 0,
                  "author": 81392,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9cqph7",
              "text": "6 years on and they still obsess over Hillary lmao",
              "timestamp": "2022-05-20 17:24:05",
              "score": 24,
              "num_children": 1,
              "author": 307538,
              "replies": [
                {
                  "id": "i9cqyy1",
                  "text": "And they think Grandma Clinton has personally killed 3000 people or something. I mean her and her husband are probably responsible for 100s of thousand of deaths, just like every other president / administration.",
                  "timestamp": "2022-05-20 17:25:53",
                  "score": 11,
                  "num_children": 1,
                  "author": 185622,
                  "replies": [
                    {
                      "id": "i9e9e5y",
                      "text": "And every politician who's approved a significant military budget.",
                      "timestamp": "2022-05-21 00:33:12",
                      "score": 6,
                      "num_children": 0,
                      "author": 307729,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9dez6l",
              "text": "> America is great\n\nHaven't these people gone back into their \"America sucks\" mode? Remember in 2016 Trump ran an entire campaign based on saying how much he thought the US sucked. It seems like their entire philosophy is if a Republican is President the US is awesome and if a Democrat is President we are a shit country.",
              "timestamp": "2022-05-20 20:26:13",
              "score": 10,
              "num_children": 0,
              "author": 126565,
              "replies": []
            },
            {
              "id": "i9crigp",
              "text": "I keep hearing people say that, “but are country was founded Christianity” \n\nThen I tell no, no it wasn’t, the founding fathers never said that. They never wanted religion to be apart of anything.",
              "timestamp": "2022-05-20 17:29:32",
              "score": 35,
              "num_children": 4,
              "author": 245738,
              "replies": [
                {
                  "id": "i9cshbr",
                  "text": ">just go back to the way things were.\n\nAgree and hey, they said it themselves! Of course they don't mean something like THAT! They mean when people not like them \"knew their place.\"\n\n&#x200B;\n\nEDIT: I've read that before the Red Scare in the 1950s religion was more of a private thing. Probably more people would be going to church or whatnot, just not being so jingoistic.",
                  "timestamp": "2022-05-20 17:36:06",
                  "score": 18,
                  "num_children": 2,
                  "author": 185622,
                  "replies": [
                    {
                      "id": "i9dhdhn",
                      "text": "[Let’s go back to the original pledge!](https://www.google.com/search?q=original+pledge+of+allegiance&rlz=1CDGOYI_enUS934US935&oq=original+pledge&aqs=chrome.0.0i512j69i57j0i512l4.9166j0j7&hl=en-US&sourceid=chrome-mobile&ie=UTF-8#crs=q:pledge%20of%20allegiance%20book,stick:H4sIAAAAAAAAAONgfcSYxC3w8sc9YanISWtOXmMM5uL0zCtJLSpOTS4REuFi9y9ILUrMSxHiFGLnYnXKz88uFjJAiKoKKXNxBqXmJJakpoTkC4lxsbnmlWSWVArxSHFxcejn6hukm1Xm8SxilSzISU1JT1XIT1NIzMlJTc9MzEtOVUgCmgcAPv5r2oMAAAA,cid:overview&imgrc=NwmPpwHoCGCwJM)",
                      "timestamp": "2022-05-20 20:44:22",
                      "score": 10,
                      "num_children": 0,
                      "author": 295910,
                      "replies": []
                    },
                    {
                      "id": "i9d7nqc",
                      "text": "Make sure darkie gets out of city limits before sunset. \n\n/s",
                      "timestamp": "2022-05-20 19:31:45",
                      "score": 4,
                      "num_children": 0,
                      "author": 227495,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i9d1qvg",
                  "text": "It was founded to avoid state-sponsored religion. The pilgrims left so they wouldn't be forced to worship at Church of England. The founding fathers fought their asses off to keep God out of the Constitution.",
                  "timestamp": "2022-05-20 18:45:37",
                  "score": 14,
                  "num_children": 0,
                  "author": 2535,
                  "replies": []
                },
                {
                  "id": "i9dpnuk",
                  "text": "Yes, when the pilgrims came to our shore they were “Quakers”, not christians.  The christians of today have nothing in common with the Quakers or the christians of that time.  They have devolved into greed and control freaks.",
                  "timestamp": "2022-05-20 21:48:09",
                  "score": 4,
                  "num_children": 2,
                  "author": 48549,
                  "replies": [
                    {
                      "id": "i9e57of",
                      "text": "With absolutely nothing but my high school history recollections, I thought many of the pilgrims considered CoE to be too liberal in regards to celebrating Christmas, drinking alcohol, etc.",
                      "timestamp": "2022-05-20 23:56:09",
                      "score": 2,
                      "num_children": 0,
                      "author": 291641,
                      "replies": []
                    },
                    {
                      "id": "i9elq13",
                      "text": "Quakers- Mary Dyer among them were hanged on Boston Commen because she and 3 other Quakers kept coming back to  Massachusetts Plantation Colony in spite of being thrown out for their heresy (not agreeing with the Pilgrims theology). Go figure.",
                      "timestamp": "2022-05-21 02:21:34",
                      "score": 1,
                      "num_children": 0,
                      "author": 406524,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i9hsrgn",
                  "text": "Those who say that traditional attitudes and beliefs should be important to government are unaware that tradition is made of whole cloth, which cannot be accepted or rejected piecemeal, nor in any partial configuration. Accept tradition, and you accept all of it. Those who claim to honor only the particular aspects of tradition that agree with their present beliefs are obviously rejecting tradition as much as accepting it, and cannot claim to be following tradition.",
                  "timestamp": "2022-05-21 21:29:25",
                  "score": 1,
                  "num_children": 0,
                  "author": 33116,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9cyc5r",
              "text": "Like arguing with my conservative dad. Who by the way isn’t even religious. But he defends Christian GOP because the other side of the coin is a Marxist USA. It’s his number one fear. Communism taking over the US. Bonkers.",
              "timestamp": "2022-05-20 18:19:10",
              "score": 8,
              "num_children": 1,
              "author": 224509,
              "replies": [
                {
                  "id": "i9e4zsj",
                  "text": "How does he figure that's going to happen when communists and socialists have a combined goose egg in political power?",
                  "timestamp": "2022-05-20 23:54:13",
                  "score": 1,
                  "num_children": 1,
                  "author": 282331,
                  "replies": [
                    {
                      "id": "i9e5al6",
                      "text": "He’s a delusional gaslighter. My entire life he said that global warming was a hoax. Then suddenly he said it was real. And denied saying he ever denied it. He’s scary.",
                      "timestamp": "2022-05-20 23:56:50",
                      "score": 3,
                      "num_children": 0,
                      "author": 224509,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9d5log",
              "text": "And then you'll have Tucker Carlson whining like he usually does at how unfair this is while leaving out parts of the story that will make the police dept and the city look bad.",
              "timestamp": "2022-05-20 19:16:09",
              "score": 7,
              "num_children": 0,
              "author": 220749,
              "replies": []
            },
            {
              "id": "i9ddw8i",
              "text": "Our country was also founded on genocide  and slavery…….",
              "timestamp": "2022-05-20 20:18:10",
              "score": 7,
              "num_children": 0,
              "author": 79661,
              "replies": []
            },
            {
              "id": "i9dsah7",
              "text": "Man constantly seeing comments like that just make me want to root for global warming. I saw a recent gas prices video and it was ignorant inbreds blaming biden and ukraine for gas prices. (When companies are making double or quadruple profit) and republicans unanimously voted against a bill to combat the price gouging...",
              "timestamp": "2022-05-20 22:08:38",
              "score": 7,
              "num_children": 1,
              "author": 294482,
              "replies": [
                {
                  "id": "i9dsov7",
                  "text": "\"Gas prices are high because of Priuses (Prii?) and Teslas!\"",
                  "timestamp": "2022-05-20 22:11:52",
                  "score": 5,
                  "num_children": 0,
                  "author": 185622,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9cvjcm",
              "text": "Get your critical religion theory out of my politics",
              "timestamp": "2022-05-20 17:57:54",
              "score": 7,
              "num_children": 1,
              "author": 237345,
              "replies": [
                {
                  "id": "i9cw6n3",
                  "text": "I misread that as \"critical thinking\" at first.\n\nThat'll give them something to whine about:\n\n\"There (sic) teaching these kids CT!!!!!!\"",
                  "timestamp": "2022-05-20 18:02:46",
                  "score": 4,
                  "num_children": 0,
                  "author": 185622,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9emt8p",
              "text": "Why do people constantly keep saying that the country was founded on Christianity when it has been proven time and time again that it wasn’t?",
              "timestamp": "2022-05-21 02:31:35",
              "score": 5,
              "num_children": 0,
              "author": 122329,
              "replies": []
            },
            {
              "id": "i9dzr8l",
              "text": "Stand in line to charge a Tesla? EV’s can be charged at home and for pennies on the dollar compared to your gas you have to drive somewhere else to get. These fucking nitwits.",
              "timestamp": "2022-05-20 23:09:31",
              "score": 5,
              "num_children": 0,
              "author": 224462,
              "replies": []
            },
            {
              "id": "i9d5i8q",
              "text": "The comments on that article are absolutely amazingly badtakes.",
              "timestamp": "2022-05-20 19:15:24",
              "score": 3,
              "num_children": 0,
              "author": 238449,
              "replies": []
            },
            {
              "id": "i9dk1wj",
              "text": "> Too bad if people are offended. Go move to some other country.\n\nBut it sounds like this person is offended. They removed the text and then brought it back after people complained. Why doesn't this person move to another country if they don't like it?",
              "timestamp": "2022-05-20 21:04:42",
              "score": 3,
              "num_children": 0,
              "author": 62469,
              "replies": []
            },
            {
              "id": "i9gbohx",
              "text": "I'm not American and even I know your country is not founded in christianity, America is great is just your opinion, there are many people on this planet that going your country is a shit hole.",
              "timestamp": "2022-05-21 14:29:18",
              "score": 2,
              "num_children": 1,
              "author": 71233,
              "replies": [
                {
                  "id": "i9iqjsm",
                  "text": "These are copied from a television news organization's website/comment section owned by Rupert Murdoch. To be clear. Not all of us USAns, ie United States of Americans think like this.",
                  "timestamp": "2022-05-22 02:31:10",
                  "score": 2,
                  "num_children": 1,
                  "author": 185622,
                  "replies": [
                    {
                      "id": "i9jlutu",
                      "text": "Murdoch has a lot to answer for in your country, Australia and the UK, Trump is no longer in power, Morrison has hopefully been ousted, if we can rid ourselves of Johnson and the idiot running Brazil, we might have a chance, these fascist, nazis need to go.",
                      "timestamp": "2022-05-22 08:58:52",
                      "score": 2,
                      "num_children": 0,
                      "author": 71233,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9conx7",
              "text": "> \"Sorry, but our country was founded on Christianity.\"\n\nTrue.  And well over 90% of our representative bodies are staffed by Christians (except the presidency which sits at 100% of all current and former) despite only 60% of the nation being Christian.\n\nThen they go on to complain about how fucked up the government is.\n\nI can guess why.  Can you?",
              "timestamp": "2022-05-20 17:10:18",
              "score": 2,
              "num_children": 6,
              "author": 184256,
              "replies": [
                {
                  "id": "i9csfre",
                  "text": "False. This country was not founded on Christianity. Don’t let them get away with that lie.",
                  "timestamp": "2022-05-20 17:35:48",
                  "score": 35,
                  "num_children": 0,
                  "author": 133913,
                  "replies": []
                },
                {
                  "id": "i9d3qg6",
                  "text": "Treaty of Tripoli. Ratified by congress and signed by John Adams, 2nd president. 1796. So, they'd know what the founders were thinking.\n\nhttps://en.wikipedia.org/wiki/Treaty_of_Tripoli\n\n>The Treaty is often cited in discussions regarding the role of religion in United States government for a clause in Article 11 of the English language American version which states that \"the Government of the United States of America is not, in any sense, founded on the Christian religion.",
                  "timestamp": "2022-05-20 19:01:22",
                  "score": 22,
                  "num_children": 0,
                  "author": 98276,
                  "replies": []
                },
                {
                  "id": "i9cs5i4",
                  "text": "Definitely not True.",
                  "timestamp": "2022-05-20 17:33:54",
                  "score": 16,
                  "num_children": 0,
                  "author": 363699,
                  "replies": []
                },
                {
                  "id": "i9cpfy9",
                  "text": "Not true. The country was absolutely not founded on christianity. They went to great pains to ensure no religion at all in the government.",
                  "timestamp": "2022-05-20 17:15:31",
                  "score": 46,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "i9cqna7",
                  "text": "You know, I think when people are asked if they are Christian a good portion of them being polled kind of casually say they are because they went to church and have a vague idea of what God is.\n\nMe and a few of my friends and cousin would always say we were Christian if asked but eventually I sort of “grew out of it”.\n\nNow, that’s not to say there aren’t radical religious zealots. There’s *too* many in this country. My dad being one of them.\n\nBut I’d imagine if people **really** thought about the question on wether they believe in God or Jesus they’d probably just poll as “idk”.",
                  "timestamp": "2022-05-20 17:23:40",
                  "score": 7,
                  "num_children": 0,
                  "author": 359123,
                  "replies": []
                },
                {
                  "id": "i9e5nkm",
                  "text": "[The Founding Myth](https://www.amazon.com/Founding-Myth-Christian-Nationalism-American/dp/1454933275) goes into great detail in disproving that notion. It's written by a Constitutional lawyer who runs the Freedom From Religion Foundation.",
                  "timestamp": "2022-05-21 00:00:03",
                  "score": 2,
                  "num_children": 0,
                  "author": 157842,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9dn1xj",
              "text": "That second to last one really reveals their racism and transphobia into everything.  They really just don't want to deal with the fact that other races and genders exist.  It's too much mental labor for them lol",
              "timestamp": "2022-05-20 21:27:57",
              "score": 1,
              "num_children": 1,
              "author": 28829,
              "replies": [
                {
                  "id": "i9do4l9",
                  "text": "It's also weird how Fox News and GOP politicians insert racism and transphobia into everything. Almost like the Democrats wouldn't have to push back as hard...",
                  "timestamp": "2022-05-20 21:36:16",
                  "score": 2,
                  "num_children": 0,
                  "author": 185622,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9dbtgk",
              "text": "The pledge used to not have the under god part, that was added in the 1950's to fight communism....",
              "timestamp": "2022-05-20 20:02:28",
              "score": 1,
              "num_children": 1,
              "author": 2814,
              "replies": [
                {
                  "id": "i9dbxu3",
                  "text": "Yup, I say one nation under Canada.",
                  "timestamp": "2022-05-20 20:03:21",
                  "score": 2,
                  "num_children": 0,
                  "author": 185622,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i9cvz3d",
          "text": ">\"he said he thought nothing of it when one of his officers approached him last year, asking to place the phrase on one of the cruisers.\"\n\nand then\n\n>Schaffer said another point of contention was that he posted Psalm 46:1 on the department's Facebook page .... \"Somebody took offense to that, as well,\" he said, adding that he removed it from the department's page and also took down \"He Is Risen\" and \"Happy Easter\" after it proved controversial.\n\n\nSo he definitely would have \"*thought something of it*\" if it had been a controversy before, one that he had to delete off facebook multiple times. \n\nThese people are liars. \"Bearing false witness\" is against their sacred ten commandments. They don't actually care about upholding their faith. It's about imposing their will on others.",
          "timestamp": "2022-05-20 18:01:10",
          "score": 28,
          "num_children": 0,
          "author": 390457,
          "replies": []
        },
        {
          "id": "i9cahvd",
          "text": "OP is the hero we don't deserve.",
          "timestamp": "2022-05-20 15:37:24",
          "score": 18,
          "num_children": 0,
          "author": 246943,
          "replies": []
        },
        {
          "id": "i9cfkvg",
          "text": "thank you for doing that!",
          "timestamp": "2022-05-20 16:10:48",
          "score": 8,
          "num_children": 0,
          "author": 234721,
          "replies": []
        },
        {
          "id": "i9cukj0",
          "text": "I love not giving them ad revenue or having to see the comments section.\n\nI love that the articles last line is a comment that emphasizes the person in the article is “pro Christian” likely so their more aggressive readers don’t harass him",
          "timestamp": "2022-05-20 17:50:40",
          "score": 7,
          "num_children": 0,
          "author": 200715,
          "replies": []
        },
        {
          "id": "i9dbpxl",
          "text": "Why would you watch/read Faux News?",
          "timestamp": "2022-05-20 20:01:45",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i9dce63",
          "text": "And it makes what's basically a joke - sending some stickers to a town -  seem like a much bigger deal than it is. They aren't putting the decals on cop cars.",
          "timestamp": "2022-05-20 20:06:40",
          "score": 1,
          "num_children": 0,
          "author": 76896,
          "replies": []
        },
        {
          "id": "i9dm299",
          "text": "Now you might just mean the big media outlets are the only ones talking about this. But there is at least one other article about this issue and it goes so far as to include the amazing designs the TST submitted. I've included the link if anyone missed it, cause I think I found it posted here originally.\n\nhttps://onlysky.media/hemant-mehta/rural-kansas-town-votes-to-reinstate-in-god-we-trust-on-police-cars/",
          "timestamp": "2022-05-20 21:20:18",
          "score": 1,
          "num_children": 0,
          "author": 403938,
          "replies": []
        }
      ]
    },
    {
      "id": "i9bp4s3",
      "text": "Hell will freeze over before they actually use them but it is rather amusing regardless.",
      "timestamp": "2022-05-20 13:09:50",
      "score": 708,
      "num_children": 5,
      "author": 167561,
      "replies": [
        {
          "id": "i9bpalq",
          "text": "The town's government already said other religious messages must be allowed on police cars if they have 'In God We Trust' on them.",
          "timestamp": "2022-05-20 13:11:04",
          "score": 582,
          "num_children": 11,
          "author": 286151,
          "replies": [
            {
              "id": "i9bpo6d",
              "text": "Right but saying and enforcing are two different things. Particularly when it comes to 'Murica.",
              "timestamp": "2022-05-20 13:13:54",
              "score": 470,
              "num_children": 8,
              "author": 167561,
              "replies": [
                {
                  "id": "i9bsniz",
                  "text": "knowing small towns in kansas, theyll just print the jesus ones and throw away everything else",
                  "timestamp": "2022-05-20 13:35:54",
                  "score": 214,
                  "num_children": 6,
                  "author": 160095,
                  "replies": [
                    {
                      "id": "i9bx1ze",
                      "text": "“We never received any others. If we had, we would certainly use them as the law requires.”\n\n*(casually slides full trash can further under the table)*",
                      "timestamp": "2022-05-20 14:07:18",
                      "score": 225,
                      "num_children": 3,
                      "author": 285968,
                      "replies": [
                        {
                          "id": "i9c1f7g",
                          "text": "In which case TST should make a show about hand delivering them.",
                          "timestamp": "2022-05-20 14:37:07",
                          "score": 151,
                          "num_children": 3,
                          "author": 353476,
                          "replies": [
                            {
                              "id": "i9cseuh",
                              "text": "And helping put them on the cars",
                              "timestamp": "2022-05-20 17:35:38",
                              "score": 74,
                              "num_children": 0,
                              "author": 123673,
                              "replies": []
                            },
                            {
                              "id": "i9d394u",
                              "text": "Or at least tracking with signature required.",
                              "timestamp": "2022-05-20 18:57:33",
                              "score": 17,
                              "num_children": 0,
                              "author": 347428,
                              "replies": []
                            },
                            {
                              "id": "i9eqpoc",
                              "text": "And that’s how they get a $20 donation, I don’t need to eat..",
                              "timestamp": "2022-05-21 03:06:47",
                              "score": 1,
                              "num_children": 0,
                              "author": 394744,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "i9c1fgo",
                          "text": "That's why they need to make sure someone signs for them and that there is a solid delivery trail.",
                          "timestamp": "2022-05-20 14:37:10",
                          "score": 81,
                          "num_children": 1,
                          "author": 232118,
                          "replies": [
                            {
                              "id": "i9c5r2s",
                              "text": "So once they do that and then the town still doesn't use them, TST takes them to court and after two years of legal battles, a right wing judge decides they don't need to use the Satan ones because lack of standing or whatever.  This country's a joke.",
                              "timestamp": "2022-05-20 15:05:58",
                              "score": 88,
                              "num_children": 2,
                              "author": 231481,
                              "replies": [
                                {
                                  "id": "i9c682n",
                                  "text": "All on the taxpayers dime.",
                                  "timestamp": "2022-05-20 15:09:08",
                                  "score": 57,
                                  "num_children": 0,
                                  "author": 191346,
                                  "replies": []
                                },
                                {
                                  "id": "i9cdtuk",
                                  "text": "Cool, so just give up then?",
                                  "timestamp": "2022-05-20 15:59:21",
                                  "score": 42,
                                  "num_children": 2,
                                  "author": 131644,
                                  "replies": [
                                    {
                                      "id": "i9cl37i",
                                      "text": "This. No quarter given, even knowing we won't win sometimes. Maybe a lot of times.",
                                      "timestamp": "2022-05-20 16:46:37",
                                      "score": 29,
                                      "num_children": 1,
                                      "author": 281721,
                                      "replies": [
                                        {
                                          "id": "i9dl6bq",
                                          "text": "Woah, I’m ready to bash the fash too but let’s not start using the “no quarter” thing, that’s fash shit. https://lawandcrime.com/live-trials/live-trials-current/george-floyd-death/republican-senator-called-for-no-quarter-military-response-to-looters-lawyers-note-thats-a-war-crime/",
                                          "timestamp": "2022-05-20 21:13:25",
                                          "score": 1,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "i9p2exd",
                                              "text": "Fine, barely any quarter then!",
                                              "timestamp": "2022-05-23 15:54:04",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 231481,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "i9d2759",
                                      "text": "TST is free to take it to the Supreme Court where 6/9 fundamentalist christians will side against them.\n\nThere’s no check, no balance, and nothing to stop them from issuing Christian-favoring rulings from the Supreme Court.",
                                      "timestamp": "2022-05-20 18:49:16",
                                      "score": 18,
                                      "num_children": 2,
                                      "author": 189439,
                                      "replies": [
                                        {
                                          "id": "i9dh8dm",
                                          "text": "> TST is free to take it to the Supreme Court where 6/9 fundamentalist christians will side against them.\n> There’s no check, no balance, and nothing to stop them from issuing Christian-favoring rulings from the Supreme Court.\n\nCool, so just give up then?",
                                          "timestamp": "2022-05-20 20:43:17",
                                          "score": 4,
                                          "num_children": 1,
                                          "author": 131644,
                                          "replies": [
                                            {
                                              "id": "i9di0og",
                                              "text": "I’m not sure what else you can do beyond taking it to the Supreme Court. Do you have any suggestions? Or just asking rhetorically?",
                                              "timestamp": "2022-05-20 20:49:15",
                                              "score": 1,
                                              "num_children": 2,
                                              "author": 189439,
                                              "replies": [
                                                {
                                                  "id": "i9dvoc9",
                                                  "text": ">I’m not sure what else you can do beyond taking it to the Supreme Court. Do you have any suggestions? Or just asking rhetorically?\n\nWhat do you do when all attempts at diplomacy have failed and you are still being oppressed? \n\nDo you just lay down and take it? Or do you fight back?",
                                                  "timestamp": "2022-05-20 22:35:56",
                                                  "score": 3,
                                                  "num_children": 1,
                                                  "author": 131644,
                                                  "replies": [
                                                    {
                                                      "id": "i9ebif1",
                                                      "text": "Can some revolutionaries come forward already? Dismantle it! It's already falling apart. It needs to be demolished before it can be fixed.",
                                                      "timestamp": "2022-05-21 00:51:58",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "author": 228712,
                                                      "replies": []
                                                    }
                                                  ]
                                                },
                                                {
                                                  "id": "i9djyoc",
                                                  "text": "> I’m not sure what else you can do beyond taking it to the Supreme Court. Do you have any suggestions? Or just asking rhetorically?\n\nCool, so just give up then?",
                                                  "timestamp": "2022-05-20 21:04:01",
                                                  "score": -2,
                                                  "num_children": 2,
                                                  "author": 49393,
                                                  "replies": [
                                                    {
                                                      "id": "i9dklis",
                                                      "text": "With this conversation? Yes.",
                                                      "timestamp": "2022-05-20 21:08:55",
                                                      "score": 4,
                                                      "num_children": 0,
                                                      "author": 189439,
                                                      "replies": []
                                                    },
                                                    {
                                                      "id": "i9dslkp",
                                                      "text": "Pick a better fight.",
                                                      "timestamp": "2022-05-20 22:11:08",
                                                      "score": 0,
                                                      "num_children": 0,
                                                      "author": 401758,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "i9du64k",
                                          "text": "Those are christofascists. Not Christians.",
                                          "timestamp": "2022-05-20 22:23:42",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 200488,
                                          "replies": [
                                            {
                                              "id": "i9p2nad",
                                              "text": "spot the differences?  \n\nthey're the same picture",
                                              "timestamp": "2022-05-23 15:55:41",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 231481,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i9choc6",
                          "text": "Former Kansan here. My small town would do that then think they were clever in doing it.",
                          "timestamp": "2022-05-20 16:24:32",
                          "score": 13,
                          "num_children": 0,
                          "author": 38803,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i9c7u3x",
                      "text": "Put it on the undercarriage and start conspiracy theories.",
                      "timestamp": "2022-05-20 15:19:54",
                      "score": 9,
                      "num_children": 0,
                      "author": 324467,
                      "replies": []
                    },
                    {
                      "id": "i9c59dy",
                      "text": "They’ll make it up to the officers and then fire anyone not properly Christian.",
                      "timestamp": "2022-05-20 15:02:42",
                      "score": 5,
                      "num_children": 0,
                      "author": 242458,
                      "replies": []
                    },
                    {
                      "id": "i9bw9kp",
                      "text": "I can only hope these will find their way on there somehow.",
                      "timestamp": "2022-05-20 14:01:46",
                      "score": 16,
                      "num_children": 1,
                      "author": 407907,
                      "replies": [
                        {
                          "id": "i9bx9zw",
                          "text": "i hope so too, but having spent some time in atchison county ks for a year or so. Whenever i think of small corrupt towns i think of kansas.",
                          "timestamp": "2022-05-20 14:08:51",
                          "score": 15,
                          "num_children": 0,
                          "author": 160095,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "i9cypgt",
                      "text": "People should sneak up on police cars and stick them on anyway.",
                      "timestamp": "2022-05-20 18:21:59",
                      "score": 1,
                      "num_children": 0,
                      "author": 356842,
                      "replies": []
                    },
                    {
                      "id": "i9dgdcl",
                      "text": "They'll put the Jesus ones over the Satan ones and then they'll be able to say the stickers are on there. Jesus wins through technicalities",
                      "timestamp": "2022-05-20 20:36:48",
                      "score": 0,
                      "num_children": 0,
                      "author": 5681,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i9cf5ja",
                  "text": "They'll throw it on one cruiser and keep it in the motor pool forever",
                  "timestamp": "2022-05-20 16:08:02",
                  "score": 9,
                  "num_children": 1,
                  "author": 328315,
                  "replies": [
                    {
                      "id": "i9d20eh",
                      "text": "Yep the parts car will have it lol",
                      "timestamp": "2022-05-20 18:47:46",
                      "score": 3,
                      "num_children": 0,
                      "author": 340394,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i9c4o7x",
                  "text": ">Right but saying and enforcing are two different things.\n\nIt's the law! If they don't do it, we'll call the... Oh. Right.",
                  "timestamp": "2022-05-20 14:58:45",
                  "score": 11,
                  "num_children": 0,
                  "author": 126726,
                  "replies": []
                },
                {
                  "id": "i9ctft6",
                  "text": "Pledged and donated",
                  "timestamp": "2022-05-20 17:42:39",
                  "score": 3,
                  "num_children": 0,
                  "author": 125002,
                  "replies": []
                },
                {
                  "id": "i9czk0m",
                  "text": "And then they’ll get sued",
                  "timestamp": "2022-05-20 18:28:34",
                  "score": 1,
                  "num_children": 0,
                  "author": 372751,
                  "replies": []
                },
                {
                  "id": "i9d0qgl",
                  "text": "That's what stencils and spray paint is for.",
                  "timestamp": "2022-05-20 18:37:46",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "i9d8e97",
                  "text": "They can sue to enforce",
                  "timestamp": "2022-05-20 19:37:14",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "i9f1fyk",
                  "text": "That's the fun part though! If they put that into law that they must include all religions, then if TST is denied due to their beliefs then they have a platform of discrimination to sue the city over.",
                  "timestamp": "2022-05-21 04:56:14",
                  "score": 1,
                  "num_children": 0,
                  "author": 115011,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9coewi",
              "text": "That town is going to raise taxes to buy an extra police car just so that no officer is riding the Satanmobile.  It'll get the sticker (after a lawsuit) and sit in a back lot somewhere.",
              "timestamp": "2022-05-20 17:08:37",
              "score": 26,
              "num_children": 0,
              "author": 75501,
              "replies": []
            },
            {
              "id": "i9cxbg7",
              "text": "That's what they say when other religions wanting to be treated equally is still theoretical.\n\nWhen actually confronted by that happening, they'll probably say that they've been forced to shut the program down because satanists are persecuting the poor oppressed Christians.\n\nAn example: Louisiana passed a law that would give out vouchers to religiously based private schools (no matter how shitty the school, one that applied had a football stadium but no library).  But when a Muslim school asked to join in, the people who wrote that law said they never expected anyone but Christians would be able to take advantage and quickly shut down the whole program.",
              "timestamp": "2022-05-20 18:11:18",
              "score": 15,
              "num_children": 2,
              "author": 40344,
              "replies": [
                {
                  "id": "i9dj1hu",
                  "text": "If that isn't the christian right in a nutshell. \n\nI deserve preferential treatment. But I'd rather no one gets anything than let a group other than mine receive any kind of benefit whatsoever.",
                  "timestamp": "2022-05-20 20:57:01",
                  "score": 9,
                  "num_children": 1,
                  "author": 380598,
                  "replies": [
                    {
                      "id": "i9e9qbj",
                      "text": "> subsidies for religious institutions\n\nFreeze peach! Freedom of religion!\n\n> non-Christian ones\n\nSmall government!",
                      "timestamp": "2022-05-21 00:36:08",
                      "score": 3,
                      "num_children": 0,
                      "author": 307729,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i9ewx4l",
                  "text": "Something similar happened with a charter in Alachua, Florida. Some Hare Krishnas tried to open their own charter, just like Christian groups had. They ended up doing it, but it took a court case.",
                  "timestamp": "2022-05-21 04:06:13",
                  "score": 1,
                  "num_children": 0,
                  "author": 1016,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9d1sni",
              "text": "Those cop cars are going to look like NASCAR rides now! \n\nPut the\"Hail Satan\" ones right next to the Pennzoil and Champion spark plug stickers. That would look awesome!",
              "timestamp": "2022-05-20 18:46:01",
              "score": 5,
              "num_children": 0,
              "author": 129174,
              "replies": []
            },
            {
              "id": "i9cbh2g",
              "text": "They'll put it on the skid plate under the car.",
              "timestamp": "2022-05-20 15:43:52",
              "score": 3,
              "num_children": 0,
              "author": 13325,
              "replies": []
            },
            {
              "id": "i9c8uc5",
              "text": "Correct me if I'm wrong, but my impression is that the messages would be allowed *if* the officer using the car wants it, not if the general public wants it.  I didn't think they were being used as billboards, I thought it was just a bunch of bible thumping cops.",
              "timestamp": "2022-05-20 15:26:32",
              "score": 15,
              "num_children": 2,
              "author": 235756,
              "replies": [
                {
                  "id": "i9dky8y",
                  "text": "Right, but that wouldn't be constitutional.\n\nThe car is public property, the officer shouldn't be allowed to decide what goes on it, and certainly not if he is applying a religious filter.",
                  "timestamp": "2022-05-20 21:11:39",
                  "score": 11,
                  "num_children": 0,
                  "author": 245683,
                  "replies": []
                },
                {
                  "id": "i9d5yrx",
                  "text": "I would kill to be able to put one of these on my squad car!",
                  "timestamp": "2022-05-20 19:18:58",
                  "score": 1,
                  "num_children": 1,
                  "author": 155883,
                  "replies": [
                    {
                      "id": "i9dkqui",
                      "text": "Don't you have some dogs to shoot??",
                      "timestamp": "2022-05-20 21:10:03",
                      "score": 2,
                      "num_children": 2,
                      "author": 13496,
                      "replies": [
                        {
                          "id": "i9dnb57",
                          "text": "Man, don't be an asshole.",
                          "timestamp": "2022-05-20 21:29:58",
                          "score": 5,
                          "num_children": 0,
                          "author": 73178,
                          "replies": []
                        },
                        {
                          "id": "i9dmaoq",
                          "text": "Nope, never shot a dog (or anything other than paper for that matter), nor do I have any desire to. Weird.",
                          "timestamp": "2022-05-20 21:22:04",
                          "score": 2,
                          "num_children": 0,
                          "author": 155883,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9cq8og",
              "text": "So you can anything then as long as it has the in god we trust already?",
              "timestamp": "2022-05-20 17:20:55",
              "score": 2,
              "num_children": 0,
              "author": 178427,
              "replies": []
            },
            {
              "id": "i9d65gq",
              "text": "May and Shall are very different terms. No one is going to make them out this on a car.",
              "timestamp": "2022-05-20 19:20:20",
              "score": 2,
              "num_children": 1,
              "author": 34485,
              "replies": [
                {
                  "id": "i9dzhqx",
                  "text": "That's the problem.\n\nThe US government, in all its incarnations, is constitutionally disallowed from showing any favoritism toward any denomination of faith. If the god-bothering decals are on the cruiser but not the Satan-bothering ones are not that could (and should) be construed as favoritism. I'm not sure how/if the preferences of the officer play into this though. Like if one officer doesn't want the god sticker, does he still have to take it, and the satan sticker? It's such a weird thing.\n\nHowever, this is a rerun, we've all seen this episode before. The christian character in government will push jebus on the public, the public will remind them that they have to allow Satan, and Vishnu, and Allah, and the Force, and, and, and... At which point the christian character in government will get pissy and rescind the original god-bother push. Episode over, roll credits, go to the bathroom.",
                  "timestamp": "2022-05-20 23:07:17",
                  "score": 1,
                  "num_children": 0,
                  "author": 239699,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9dvala",
              "text": "The Church of the Flying Spaghetti Monster needs a decal too now.",
              "timestamp": "2022-05-20 22:32:52",
              "score": 2,
              "num_children": 0,
              "author": 91261,
              "replies": []
            },
            {
              "id": "i9d9w2o",
              "text": "They'll throw some dogwhistle exception in there regarding something like \"acceptable boundaries of taste\"",
              "timestamp": "2022-05-20 19:48:09",
              "score": 1,
              "num_children": 0,
              "author": 14612,
              "replies": []
            },
            {
              "id": "i9dkbzi",
              "text": "They are allowed but that doesn't mean anyone will choose to do it",
              "timestamp": "2022-05-20 21:06:51",
              "score": 1,
              "num_children": 0,
              "author": 222034,
              "replies": []
            }
          ]
        },
        {
          "id": "i9ceib5",
          "text": "It would be terrible, just terrible, if some locals stuck them on the police cars",
          "timestamp": "2022-05-20 16:03:47",
          "score": 25,
          "num_children": 1,
          "author": 160278,
          "replies": [
            {
              "id": "i9cioew",
              "text": "With industrial grade epoxy....",
              "timestamp": "2022-05-20 16:31:00",
              "score": 13,
              "num_children": 0,
              "author": 168923,
              "replies": []
            }
          ]
        },
        {
          "id": "i9cqyfb",
          "text": "I hope the Temple sues them if they don't. Make an example for other little towns.",
          "timestamp": "2022-05-20 17:25:47",
          "score": 17,
          "num_children": 0,
          "author": 307538,
          "replies": []
        },
        {
          "id": "i9d8g96",
          "text": "Then comes the infringing upon freedom of religion court case, since they promote one religion over another with their current verbiage. So that gets proven in court and they have to remove it.",
          "timestamp": "2022-05-20 19:37:40",
          "score": 4,
          "num_children": 0,
          "author": 37948,
          "replies": []
        },
        {
          "id": "i9bszre",
          "text": "It's just trolling Christians, nothing more.\n\nI'm really not a fan, because it just reinforces the crazy ideas that Christians already have about atheists.",
          "timestamp": "2022-05-20 13:38:21",
          "score": -134,
          "num_children": 7,
          "author": 392424,
          "replies": [
            {
              "id": "i9buvjd",
              "text": "Actually, it's a valid way to test laws surrounding religion. If something is allowed under religious freedom it's prudent to test the same systems with alternate ideas to dominant religions.",
              "timestamp": "2022-05-20 13:51:55",
              "score": 145,
              "num_children": 2,
              "author": 83277,
              "replies": [
                {
                  "id": "i9c013u",
                  "text": "100%. Christian Fundamentalists are all about putting GAWD everywhere. \n\nHowever, in the USA, if you allow one religion (talking about Public things), you must allow all and the Fundies FREAK OUT at that prospect.",
                  "timestamp": "2022-05-20 14:27:43",
                  "score": 50,
                  "num_children": 1,
                  "author": 231674,
                  "replies": [
                    {
                      "id": "i9ccf3j",
                      "text": "Well it’s also a really great demonstration of why the separation of church and state benefits everyone, including the religious.",
                      "timestamp": "2022-05-20 15:50:06",
                      "score": 16,
                      "num_children": 0,
                      "author": 319536,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i9bwdan",
                  "text": ">Actually, it's a valid way to test laws surrounding religion.\n\nNonsense.  Sending them stickers has no effect on any laws at all.",
                  "timestamp": "2022-05-20 14:02:31",
                  "score": -87,
                  "num_children": 2,
                  "author": 392424,
                  "replies": [
                    {
                      "id": "i9bxf4r",
                      "text": "'it's just stickers' is just one aspect of religious seepage that isn't questioned.\n\nThe Satanic Temple highlights issues surrounding religious liberty.",
                      "timestamp": "2022-05-20 14:09:52",
                      "score": 51,
                      "num_children": 1,
                      "author": 83277,
                      "replies": [
                        {
                          "id": "i9byxvr",
                          "text": "5% or so of TST may actually do some good.  But 95% of it is atheists, mostly online, screaming \"I'm a satanist\" because they want to troll christians.\n\nSending stickers won't change any laws, and the stickers won't get used.  It serves no purpose.\n\nNaturally, the trolls love it.",
                          "timestamp": "2022-05-20 14:20:20",
                          "score": -88,
                          "num_children": 2,
                          "author": 392424,
                          "replies": [
                            {
                              "id": "i9c03ch",
                              "text": "This story is directly related to an issue regarding the desire for separation between church and state. It's a legitimate issue, and if it's not offensive to have Christian stickers, it's not offensive to have stickers of other denominations. I don't know about the legitimacy of your statistics but Lucien Greaves has been very open about his activism.\n\nThe real question is why some Christians find it so offensive when other religions are entitled to the same freedoms.",
                              "timestamp": "2022-05-20 14:28:09",
                              "score": 52,
                              "num_children": 1,
                              "author": 83277,
                              "replies": [
                                {
                                  "id": "i9c20ll",
                                  "text": "Yep, it's to prove a point. If religion A is ok to use these stickers, then so too should religion B be able to. If religion B can't, then neither should religion A.\n\nChristianity uses religious freedom as their means to push their agenda, but if it's only their religion given that right, then it's not religious freedom. That's what the real problem is, and this whole debacle is to prove that.",
                                  "timestamp": "2022-05-20 14:41:05",
                                  "score": 30,
                                  "num_children": 0,
                                  "author": 21074,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "i9cj1xh",
                              "text": ">Sending stickers won't change any laws\n\nYou mean, apart from ***all the other times the TST has done this exact thing*** and the town threw out the entire concept all together?",
                              "timestamp": "2022-05-20 16:33:26",
                              "score": 21,
                              "num_children": 1,
                              "author": 168923,
                              "replies": [
                                {
                                  "id": "i9cyqk8",
                                  "text": "Right?!?! u/Baldr_Torn just out here throwing out \"statistics\" like he's Fox News or something. I'm just curious how someone can even contort their body to type when their head is so far up their ass.",
                                  "timestamp": "2022-05-20 18:22:13",
                                  "score": 9,
                                  "num_children": 2,
                                  "author": 331597,
                                  "replies": [
                                    {
                                      "id": "i9e1l8f",
                                      "text": ">I'm just curious how someone can even contort their body to type when their head is so far up their ass.\n\nYou have every right to disagree with me, and I'll have a discussion with people who do.  But if you don't have the ability to be civil, I won't even attempt to be civil with you.  So fuck off, you stupid punk.  All you're doing is proving my point, you're just trolling, and too fucking stupid to make a real argument.",
                                      "timestamp": "2022-05-20 23:24:59",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 392424,
                                      "replies": [
                                        {
                                          "id": "i9e30eo",
                                          "text": "\nYou mad bro?",
                                          "timestamp": "2022-05-20 23:37:10",
                                          "score": 3,
                                          "num_children": 0,
                                          "author": 331597,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "i9dahgc",
                                      "text": "There's a lot of atheist apologists on these boards who scream and squeal at any form of resistance. Whereas my motto is more....[frenchy.](https://en.wikipedia.org/wiki/Guillotine)",
                                      "timestamp": "2022-05-20 19:52:32",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 168923,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i9bzvb2",
                      "text": "But the lawsuit that happens after they deny use of those stickers over religious preference for a different set does.",
                      "timestamp": "2022-05-20 14:26:38",
                      "score": 19,
                      "num_children": 0,
                      "author": 232118,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9c0f58",
              "text": "If you're trying to manage the Christian view on Atheists, you're going to lose every time. It doesn't matter what we actually say or do, they believe we are all satanists anyway.\n\nIf the law they passed says they have to use the decals, then when they don't, TST sues them, then they remove all the stickers and fix the law. This isn't new water. The tactic actually works.",
              "timestamp": "2022-05-20 14:30:23",
              "score": 61,
              "num_children": 1,
              "author": 291657,
              "replies": [
                {
                  "id": "i9c1nn1",
                  "text": ">If you're trying to manage the Christian view on Atheists,\n\nI'm not talking to Christians.  I'm talking to atheists and suggesting that we shouldn't go out of our way to try and make ourselves look as bad as possible.  Obviously, nearly everyone hates that idea.",
                  "timestamp": "2022-05-20 14:38:42",
                  "score": -11,
                  "num_children": 5,
                  "author": 392424,
                  "replies": [
                    {
                      "id": "i9c5ecj",
                      "text": "Why not? Christians already look as bad as possible to me. Fuck them, time to give them a taste of their own medicine.",
                      "timestamp": "2022-05-20 15:03:38",
                      "score": 26,
                      "num_children": 1,
                      "author": 133891,
                      "replies": [
                        {
                          "id": "i9c61nd",
                          "text": "[removed]",
                          "timestamp": "2022-05-20 15:07:56",
                          "score": -4,
                          "num_children": 5,
                          "replies": [
                            {
                              "id": "i9c6xkh",
                              "text": "If everyone followed that thought we would still own people.",
                              "timestamp": "2022-05-20 15:13:52",
                              "score": 31,
                              "num_children": 2,
                              "author": 149226,
                              "replies": [
                                {
                                  "id": "i9cbhzu",
                                  "text": "I don’t need a secret book of laws to tell me that owning people is wrong. /hsssss",
                                  "timestamp": "2022-05-20 15:44:02",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 270963,
                                  "replies": []
                                },
                                {
                                  "id": "i9e180j",
                                  "text": "How far do you think Martin Luthor King would have gotten if he was preaching \"Hail Satan!  All blacks worship Satan!\".\n\nYou know better.",
                                  "timestamp": "2022-05-20 23:21:53",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 392424,
                                  "replies": [
                                    {
                                      "id": "i9e1jv2",
                                      "text": "Say it with me. It doesn’t matter. A minority is a minority. Religious freedom is in the constitution.",
                                      "timestamp": "2022-05-20 23:24:40",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 149226,
                                      "replies": [
                                        {
                                          "id": "i9e1z8d",
                                          "text": ">A minority is a minority.\n\nAnd yet, that doesn't mean minorities should act like assholes and pretend to be Satanists.",
                                          "timestamp": "2022-05-20 23:28:17",
                                          "score": 0,
                                          "num_children": 0,
                                          "author": 392424,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "i9c79rx",
                              "text": "Pissing off any significantly sized minority is also a bad idea particularly when said minority (non-religious) is 25-30% of the population. And you know what? I'm pissed off.",
                              "timestamp": "2022-05-20 15:16:08",
                              "score": 11,
                              "num_children": 0,
                              "author": 133891,
                              "replies": []
                            },
                            {
                              "id": "i9cn593",
                              "text": "This is such a garbage mentality. We don’t have to accept them forcing their God on everything, because the constitution says we don’t have to. Just because there are more of them doesn’t make it acceptable.",
                              "timestamp": "2022-05-20 17:00:12",
                              "score": 7,
                              "num_children": 1,
                              "author": 205212,
                              "replies": [
                                {
                                  "id": "i9e00z3",
                                  "text": "We do not have to accept it.  I didn't say we should.  It's just a bad argument you built because it's easy to knock down.\n\nThe Freedom From Religion Foundation has done a hell of a lot more to help than a bunch of dorks running around yelling \"Hail Satan\".",
                                  "timestamp": "2022-05-20 23:11:46",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 392424,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "i9caos2",
                              "text": "I think you missed the point of one of the earlier points in this thread - Christians already dislike us merely by dint of \"we're not Christians\", so trying to manage their dislike of us on that basis is an exercise in futility.",
                              "timestamp": "2022-05-20 15:38:41",
                              "score": 7,
                              "num_children": 1,
                              "author": 288022,
                              "replies": [
                                {
                                  "id": "i9e1064",
                                  "text": "Essentially nothing we do will change the right wing, extremist types.  But I see no point in giving them ammunition.\n\nAnd not everyone fits that description.  There are a lot of more middle of the road people.  Telling those people \"Yeah, we're worshiping Satan\" does have an effect on how they think of atheists.",
                                  "timestamp": "2022-05-20 23:20:05",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 392424,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "i9dufzs",
                              "text": "[removed]",
                              "timestamp": "2022-05-20 22:25:58",
                              "score": 2,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i9cj2fb",
                      "text": "I don’t think exposing theocratic hypocrisy is a bad look at all",
                      "timestamp": "2022-05-20 16:33:31",
                      "score": 11,
                      "num_children": 0,
                      "author": 144897,
                      "replies": []
                    },
                    {
                      "id": "i9ciqcj",
                      "text": "I don't think it looks bad to test religious freedom.",
                      "timestamp": "2022-05-20 16:31:21",
                      "score": 5,
                      "num_children": 1,
                      "author": 92043,
                      "replies": [
                        {
                          "id": "i9e1i5k",
                          "text": "That's not a legit argument.  You're changing it from \"Hail Satan\" to \"There are limits to religious freedom\".  Those are very different things.\n\nThe Freedom From Religion Foundation has done a lot more than TST trolls to actually get things done.  All without dressing in fake horns and pretending to worship Satan.  They are evidence that you can test religious limits without all the stupid costumes and trolling.",
                          "timestamp": "2022-05-20 23:24:17",
                          "score": 0,
                          "num_children": 1,
                          "author": 392424,
                          "replies": [
                            {
                              "id": "i9e2byq",
                              "text": "There's more than one way to skin a cat. \n\nWhat's wrong with \"hail satan\" on a police car that isn't just as wrong with \"in god we trust\"?",
                              "timestamp": "2022-05-20 23:31:19",
                              "score": 1,
                              "num_children": 1,
                              "author": 92043,
                              "replies": [
                                {
                                  "id": "i9e2ok4",
                                  "text": ">What's wrong with \"hail satan\" on a police car that isn't just as wrong with \"in god we trust\"?\n\nWe both know that isn't going to be on a police car.  At least, they aren't going to do it intentionally.  I suppose one of the people here may make up a sticker and put it on when nobody is looking.",
                                  "timestamp": "2022-05-20 23:34:22",
                                  "score": 0,
                                  "num_children": 1,
                                  "author": 392424,
                                  "replies": [
                                    {
                                      "id": "i9e82ff",
                                      "text": "That doesn't answer the question.",
                                      "timestamp": "2022-05-21 00:21:18",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 92043,
                                      "replies": [
                                        {
                                          "id": "i9eaton",
                                          "text": "Neither should be there.  But that doesn't lead to running around yelling Hail Satan and thinking it's helping.",
                                          "timestamp": "2022-05-21 00:45:49",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 392424,
                                          "replies": [
                                            {
                                              "id": "i9eb5t7",
                                              "text": "I think pointing out that what's good for the goose is good for the gander is helpful. You're welcome to disagree but you haven't given me any reason to change my opinion.",
                                              "timestamp": "2022-05-21 00:48:53",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 92043,
                                              "replies": [
                                                {
                                                  "id": "i9ebpjz",
                                                  "text": "No, people who enjoy trolling aren't likely to change their opinion based on anything I say.",
                                                  "timestamp": "2022-05-21 00:53:43",
                                                  "score": 0,
                                                  "num_children": 1,
                                                  "author": 392424,
                                                  "replies": [
                                                    {
                                                      "id": "i9efxnk",
                                                      "text": "Disagreement isn't trolling. I'm just talking here.",
                                                      "timestamp": "2022-05-21 01:31:33",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "author": 92043,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i9cz2ba",
                      "text": "How does holding people accountable and asking for the same rights as christians doing anything to \"make ourselves look as bad as possible.\"?",
                      "timestamp": "2022-05-20 18:24:46",
                      "score": 2,
                      "num_children": 1,
                      "author": 331597,
                      "replies": [
                        {
                          "id": "i9dyhn7",
                          "text": "Are you honestly going to claim that claiming to worship Satan is the only possible way to do that?\n\nThe Freedom From Religion Foundation does a better job, without having to scream Hail Satan and wear fake horns.",
                          "timestamp": "2022-05-20 22:59:06",
                          "score": 0,
                          "num_children": 1,
                          "author": 392424,
                          "replies": [
                            {
                              "id": "i9e18j8",
                              "text": "Please tell me where I claimed “that claiming to worship Satan” is the only way to do this.\n\n I won’t hold my breath.",
                              "timestamp": "2022-05-20 23:22:01",
                              "score": 2,
                              "num_children": 1,
                              "author": 331597,
                              "replies": [
                                {
                                  "id": "i9e24hs",
                                  "text": ">Please tell me where I claimed “that claiming to worship Satan” is the only way to do this.\n\nWell, I haven't argued that we shouldn't hold anyone accountable, or ask for our rights.  You came up with that.  I've argued about trolling with TST.  I'm not sure what threat you think you are in.",
                                  "timestamp": "2022-05-20 23:29:32",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 392424,
                                  "replies": [
                                    {
                                      "id": "i9e36ip",
                                      "text": "I'm not sure what threat I'm in. I know which THREAD I'm in... but not sure of any threat.\n\nDoes this mean I am in danger?",
                                      "timestamp": "2022-05-20 23:38:35",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 331597,
                                      "replies": [
                                        {
                                          "id": "i9e3qml",
                                          "text": "Oh, you got me.  I typed one letter wrong.  Obviously, that invalidates everything I've said and means we haven't been discussing TST at all.",
                                          "timestamp": "2022-05-20 23:43:24",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 392424,
                                          "replies": [
                                            {
                                              "id": "i9e3tjz",
                                              "text": "Me- 1\nYou- 0",
                                              "timestamp": "2022-05-20 23:44:07",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 331597,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i9devb0",
                      "text": "All the people uncomfortable with calling themselves atheist are already \"agnostic\" whatever that means. Its no loss.",
                      "timestamp": "2022-05-20 20:25:25",
                      "score": 1,
                      "num_children": 1,
                      "author": 15399,
                      "replies": [
                        {
                          "id": "i9dy3k2",
                          "text": "On \\*any\\* issue, there are people who are closer to the middle than the extremes.  You may never change people on the extremes, but those in the middle, those certainly can be swayed.\n\nGiving your enemy ammo isn't a good plan.",
                          "timestamp": "2022-05-20 22:55:51",
                          "score": 1,
                          "num_children": 0,
                          "author": 392424,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9cnmpc",
              "text": "Why would Atheist's care what Christians think about them?",
              "timestamp": "2022-05-20 17:03:26",
              "score": 3,
              "num_children": 1,
              "author": 242253,
              "replies": [
                {
                  "id": "i9e1jkw",
                  "text": "Because the people who are on extremes aren't likely to change.  Not on the atheists side, and not on the evangelical Christian side.\n\nBut there are a lot of people who aren't on those extremes, and running around screaming \"Hail Satan\" doesn't help with those more in the middle.  And it gives more ammunition to the extreme fundie right wing types.",
                  "timestamp": "2022-05-20 23:24:36",
                  "score": 1,
                  "num_children": 1,
                  "author": 392424,
                  "replies": [
                    {
                      "id": "i9e71p5",
                      "text": "Not saying things like \"Hail Satan\" because it might scare people who believe in fairy tails isn't my concern. \n\nPeople more in the middle have to come to *reason,* not have their feelings coddled until they... I'm unsure what you imagine... begrudgingly just decide to follow sense.",
                      "timestamp": "2022-05-21 00:12:14",
                      "score": 1,
                      "num_children": 1,
                      "author": 242253,
                      "replies": [
                        {
                          "id": "i9eavnp",
                          "text": "Yelling \"Hail Satan\" isn't reason.",
                          "timestamp": "2022-05-21 00:46:18",
                          "score": 0,
                          "num_children": 1,
                          "author": 392424,
                          "replies": [
                            {
                              "id": "i9fdem2",
                              "text": "Neither is praising Jesus. Both are religions and both are allowed, though.",
                              "timestamp": "2022-05-21 07:35:10",
                              "score": 1,
                              "num_children": 1,
                              "author": 242253,
                              "replies": [
                                {
                                  "id": "i9fz1ps",
                                  "text": "If your goal is to be as wrong and stupid as Christians, then congratulations, you've made it.  You can troll and be proud of yourself.\n\nI have higher goals than that.",
                                  "timestamp": "2022-05-21 12:36:39",
                                  "score": 0,
                                  "num_children": 0,
                                  "author": 392424,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9cofm8",
              "text": "We're a nontheistic religion, too. We have rituals and a ministry, and a codified literary canon.",
              "timestamp": "2022-05-20 17:08:45",
              "score": 2,
              "num_children": 0,
              "author": 25680,
              "replies": []
            },
            {
              "id": "i9cmwwn",
              "text": "> because it just reinforces the crazy ideas that Christians already have about atheists.\n\ntheyre gonna have that regardless of what happens",
              "timestamp": "2022-05-20 16:58:39",
              "score": 1,
              "num_children": 0,
              "author": 318395,
              "replies": []
            },
            {
              "id": "i9c22cv",
              "text": "I wholeheartedly support their message, especially on abortion and church/state separation.  But, I think their effectiveness is diluted by the costumes and \"hail satan\", which probably turn some potential allies away.",
              "timestamp": "2022-05-20 14:41:24",
              "score": -12,
              "num_children": 0,
              "author": 81465,
              "replies": []
            },
            {
              "id": "i9bu217",
              "text": "[removed]",
              "timestamp": "2022-05-20 13:46:02",
              "score": -1,
              "num_children": 2,
              "replies": [
                {
                  "id": "i9bv5zu",
                  "text": "[removed]",
                  "timestamp": "2022-05-20 13:54:00",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i9bvd32",
                      "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for using abusive language, personal attacks, being a dick, or fighting with other users. These activities are against the [rules](https://www.reddit.com/r/atheism/wiki/guidelines).   \r\nConnected comments may also be removed for the same reason, though editing out the direct attack may merit your comment being restored.  Users who don't cease this behavior may get banned temporarily or permanently.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                      "timestamp": "2022-05-20 13:55:23",
                      "score": -1,
                      "num_children": 0,
                      "author": 122319,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i9bvcc8",
                  "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                  "timestamp": "2022-05-20 13:55:15",
                  "score": -2,
                  "num_children": 0,
                  "author": 122319,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9c6tiv",
      "text": "FYI most modern satanists are actually atheist, as far as I know.",
      "timestamp": "2022-05-20 15:13:07",
      "score": 275,
      "num_children": 8,
      "author": 13106,
      "replies": [
        {
          "id": "i9ccek2",
          "text": "TST certainly is.   Most others who could be described  as worshiping  satan (usually Baphomet) would say they fall under paganism or gnosticism.",
          "timestamp": "2022-05-20 15:50:00",
          "score": 149,
          "num_children": 1,
          "author": 221452,
          "replies": [
            {
              "id": "i9cmpgd",
              "text": "Cool! Thanks for sharing da knowledge :)",
              "timestamp": "2022-05-20 16:57:17",
              "score": 17,
              "num_children": 3,
              "author": 13106,
              "replies": [
                {
                  "id": "i9dbfxf",
                  "text": "Yep, The branding is just for more power with christians. Most of them will put up with a spaghetti monster statue, they'd find it silly, but Satan is going to upset them enough to often take back whatever they were proposing",
                  "timestamp": "2022-05-20 19:59:46",
                  "score": 11,
                  "num_children": 0,
                  "author": 82519,
                  "replies": []
                },
                {
                  "id": "i9dgafa",
                  "text": "Just make sure not to confuse TST with the Church of Satan. I don't think they believe in a literal Satan either, but they're right wing Ayn Rand worshipping nutters.",
                  "timestamp": "2022-05-20 20:36:11",
                  "score": 15,
                  "num_children": 0,
                  "author": 313379,
                  "replies": []
                },
                {
                  "id": "i9cnsfm",
                  "text": "No problem.  Not really a practicer, but I've been invited to a few black masses and various pagan ceremonies, mostly around Salem Mass.",
                  "timestamp": "2022-05-20 17:04:30",
                  "score": 8,
                  "num_children": 1,
                  "author": 221452,
                  "replies": [
                    {
                      "id": "i9cob4z",
                      "text": "What were they like? Did they have any interesting rituals? If you don't mind sharing.",
                      "timestamp": "2022-05-20 17:07:54",
                      "score": 5,
                      "num_children": 0,
                      "author": 13106,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i9dgl4p",
          "text": "As member of TST, I'd say we are Anti-theist.",
          "timestamp": "2022-05-20 20:38:26",
          "score": 39,
          "num_children": 2,
          "author": 405044,
          "replies": [
            {
              "id": "i9efswq",
              "text": "I identify as Anti-theist. Not really adding to the conversation, I just like saying it.",
              "timestamp": "2022-05-21 01:30:22",
              "score": 10,
              "num_children": 1,
              "author": 295887,
              "replies": [
                {
                  "id": "i9eidkw",
                  "text": "Same here. Nice flair.",
                  "timestamp": "2022-05-21 01:52:13",
                  "score": 2,
                  "num_children": 0,
                  "author": 352755,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9exmf3",
              "text": "As a member, I concur",
              "timestamp": "2022-05-21 04:13:41",
              "score": 1,
              "num_children": 0,
              "author": 340834,
              "replies": []
            }
          ]
        },
        {
          "id": "i9dne4l",
          "text": "I’m anti-theist but going by the Bible it’s pretty clear that Satan has done way more for us and God ever has. Hail Satan!",
          "timestamp": "2022-05-20 21:30:36",
          "score": 21,
          "num_children": 1,
          "author": 335581,
          "replies": [
            {
              "id": "i9drxbg",
              "text": "[Hail Gein!](https://www.lastpodcastontheleft.com/)",
              "timestamp": "2022-05-20 22:05:42",
              "score": 1,
              "num_children": 1,
              "author": 371056,
              "replies": [
                {
                  "id": "i9dudxt",
                  "text": "Megustalations",
                  "timestamp": "2022-05-20 22:25:30",
                  "score": 2,
                  "num_children": 1,
                  "author": 317221,
                  "replies": [
                    {
                      "id": "i9e7c09",
                      "text": "Hail yourselves!",
                      "timestamp": "2022-05-21 00:14:45",
                      "score": 2,
                      "num_children": 0,
                      "author": 369814,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i9eupjq",
          "text": "Yes, many of them are basically mocking Christians' idea of Satan. Christians describe Satan as a self-loving, self-respecting, charismatic leader who called out the dictatorship of God and tried to give humanity knowledge and wisdom so they could see that God is holding them back. Even in their own fairy tales, their imaginary friend is the bad guy.",
          "timestamp": "2022-05-21 03:44:00",
          "score": 2,
          "num_children": 0,
          "author": 100152,
          "replies": []
        },
        {
          "id": "i9e4fon",
          "text": "I'm really more a Craig Christ kind of guy.",
          "timestamp": "2022-05-20 23:49:23",
          "score": 1,
          "num_children": 0,
          "author": 94268,
          "replies": []
        },
        {
          "id": "i9ehla9",
          "text": "It’s true. The biggest group of believers in satan are known as Christian’s",
          "timestamp": "2022-05-21 01:45:46",
          "score": 1,
          "num_children": 0,
          "author": 303394,
          "replies": []
        },
        {
          "id": "i9dbsmo",
          "text": "Some people think all atheist are Satanist. I personally don't understand why any atheist would identify with any deity. Kind of makes one not really an atheist does it not?",
          "timestamp": "2022-05-20 20:02:18",
          "score": -2,
          "num_children": 3,
          "author": 172359,
          "replies": [
            {
              "id": "i9dl2dl",
              "text": "I think you're missing the point lol.",
              "timestamp": "2022-05-20 21:12:33",
              "score": 6,
              "num_children": 1,
              "author": 71304,
              "replies": [
                {
                  "id": "i9dz0t3",
                  "text": "Guess I am. Care to explain it to me? Words do have meaning.",
                  "timestamp": "2022-05-20 23:03:26",
                  "score": -2,
                  "num_children": 1,
                  "author": 172359,
                  "replies": [
                    {
                      "id": "i9e6o63",
                      "text": "I'm genuinely surprised this needs explaining.\n\nThey're not identifying with a deity, they don't actively believe in Satan or its existence. Satan's used as a point of irony. Religion is, for some reason, heavily valued, and therefore seeks special benefits. TST values and beliefs have little to do with religion, aside from opposing it's over reach, and it's more of a tool to even out that over reach.",
                      "timestamp": "2022-05-21 00:08:54",
                      "score": 3,
                      "num_children": 1,
                      "author": 71304,
                      "replies": [
                        {
                          "id": "i9eax7s",
                          "text": "What a load of crap!",
                          "timestamp": "2022-05-21 00:46:41",
                          "score": 0,
                          "num_children": 1,
                          "author": 172359,
                          "replies": [
                            {
                              "id": "i9egiis",
                              "text": "Yeah? Care to explain it to me? Words do have meaning.",
                              "timestamp": "2022-05-21 01:36:33",
                              "score": 2,
                              "num_children": 0,
                              "author": 71304,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9ditr6",
              "text": "They do it so they get the rights of being a religion and equal treatment under the law.",
              "timestamp": "2022-05-20 20:55:23",
              "score": 3,
              "num_children": 0,
              "author": 308382,
              "replies": []
            },
            {
              "id": "i9do3pg",
              "text": "TST doesn't believe in any deity, they use Satan as a metaphor for rebellion against tyranny (and also as a way to piss off the theocrats).",
              "timestamp": "2022-05-20 21:36:05",
              "score": 3,
              "num_children": 1,
              "author": 223149,
              "replies": [
                {
                  "id": "i9dytql",
                  "text": "So it's just edginess? If some one is a Christian they do believe in a god and Jesus. I don't think I have ever met one that didn't believe in god. So is it not logical that if you say you are a Satanist that I shouldn't think you actually believe in a literal Satan?\n\nWhat's the point other than just being an alt-Christian? So it's just to make people mad or piss them off? Seems juvenile.\n\nI always regret opining on this issue because it is always the same answers that really don't make sense to me. Why even bother calling yourself anything more than a rebel then?\n\nEdit: added an apostrophe",
                  "timestamp": "2022-05-20 23:01:49",
                  "score": -1,
                  "num_children": 2,
                  "author": 172359,
                  "replies": [
                    {
                      "id": "i9e4n1o",
                      "text": "The idea is to draw attention. Saying you're a rebel garners nearly no attention, while saying you worship the opposite of what one of the most popular religions does gets you tons, apparently. \n\nIt's also a retort against how theists feel we need God on everything that was bought with tax money, or even money itself. \n\nYou cannot have separation of church in state if you have god plastered on everything.",
                      "timestamp": "2022-05-20 23:51:08",
                      "score": 3,
                      "num_children": 1,
                      "author": 273869,
                      "replies": [
                        {
                          "id": "i9e8s9c",
                          "text": "So attention seeking. Sure. Wonder why atheist are so often confused with being Satanist in society? It is because of this obfuscation and strange alliance with the flip side of Christianity of which it would not exist otherwise. Satanism whether it is metaphorical or literal in belief is still a belief. Sorry I thought I was on an atheist sub. \n\nAnd yes I agree with you. Separation of church and state is very much a concern for a democratic society to stay that way, and that includes any and all forms of cults. Why is Satanism such an exception here?",
                          "timestamp": "2022-05-21 00:27:41",
                          "score": 1,
                          "num_children": 2,
                          "author": 172359,
                          "replies": [
                            {
                              "id": "i9ea8b9",
                              "text": "Meh, I think it's obvious you're taking this a way they did not intend. I don't mind seeking attention when it's for a good cause. If it furthers the goal of separation of church and state, getting religious organizations to pay taxes, and discarding toxic religious practices, absolutely, seek all the attentions. \n\nIt's not, this goes back to what it's supposed to be, not actual satanism. If they actually believed in Satan it would be one thing, it's not metaphorically believing in Satan, it's using a popular religions key words against it for the greater good. Atheists aren't against having beliefs. You can believe in the human race, believe in taxes, wtf ever. Beliefs aren't just religious. So yes, there is a difference between literal and metaphorical satanism.",
                              "timestamp": "2022-05-21 00:40:34",
                              "score": 2,
                              "num_children": 1,
                              "author": 273869,
                              "replies": [
                                {
                                  "id": "i9ed3j2",
                                  "text": "Thanks for the banter.",
                                  "timestamp": "2022-05-21 01:06:14",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 172359,
                                  "replies": [
                                    {
                                      "id": "i9en44i",
                                      "text": "<3",
                                      "timestamp": "2022-05-21 02:34:25",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 273869,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "i9eanx2",
                              "text": "Many theists think atheists are any or all of: baby-eaters, dog-eaters, psychopaths, pedophiles, nihilists, part of whatever political faction they hate, vegans, part of a GMO conspiracy, part of any or all conspiracies... etc.\n\nI don't think Satanism is a relevant concern, as people would naturally generate such misunderstandings regardless. If its existence is politically useful, I'd rather it exist for now, as others have mentioned real examples of Christian-biased religious benefits revoked as soon as Satanists apply. As a mostly reactionary, incredibly niche \"religion,\" it would almost certainly evaporate on its own in a world without Judeo-Christian religions.",
                              "timestamp": "2022-05-21 00:44:23",
                              "score": 1,
                              "num_children": 1,
                              "author": 307729,
                              "replies": [
                                {
                                  "id": "i9ecuit",
                                  "text": "I am tired now. Wish I would've just not bothered. Maybe I am being thick headed and I am wrong? I can concede that. It may not bother you to be assumed a Satanist because some in society view atheist as that, but I don't like it. I think I need to exit stage left now.",
                                  "timestamp": "2022-05-21 01:04:01",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 172359,
                                  "replies": [
                                    {
                                      "id": "i9ed8c5",
                                      "text": "It only bothers me in that it displays how powerful preconceived notions are. To be frank, I think if somebody blindly associates Satanism to atheism, and doesn't even bother to read the Wikipedia page on TST, I don't think they can really be reasoned with either way.",
                                      "timestamp": "2022-05-21 01:07:26",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 307729,
                                      "replies": [
                                        {
                                          "id": "i9edn90",
                                          "text": "This thread made my bad day worse... I stepped into it though. Thanks for the replies. Take care.",
                                          "timestamp": "2022-05-21 01:11:12",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 172359,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i9ed4zq",
                      "text": ">So it's just edginess?\n\nNo, it's marketing. They manage to make the theocrats outraged, an when they're outraged they are so much easier to expose for their hypocrisy. Also, think about the headline \"Satanists are more moral than the church\". \n\n>So is it not logical that if you say you are a Satanist that I shouldn't think you actually believe in a literal Satan?\n\nIt's not logical, because you'd be completely incorrect with your assumption. \n\n>So it's just to make people mad or piss them off?\n\nIt's to make the theocrats mad, which is inherently a worthy goal, but it's also a marketing ploy. It gets attention on them, which allows them to spread their message with ease. They also hold true to their 7 satanic tenets, which are honestly better than the 10 commandments. \n\n>Why even bother calling yourself anything more than a rebel then?\n\nBecause calling yourself a rebel doesn't get you on the news to show the hypocrisy of theocrats.",
                      "timestamp": "2022-05-21 01:06:36",
                      "score": 3,
                      "num_children": 1,
                      "author": 223149,
                      "replies": [
                        {
                          "id": "i9eda48",
                          "text": "have an upvote!",
                          "timestamp": "2022-05-21 01:07:53",
                          "score": 1,
                          "num_children": 0,
                          "author": 172359,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i9f6n06",
          "text": "You can't be atheist and satanist at the same. That's like calling yourself an atheist, but you pray to god every night.",
          "timestamp": "2022-05-21 05:59:39",
          "score": 0,
          "num_children": 0,
          "author": 172990,
          "replies": []
        }
      ]
    },
    {
      "id": "i9bvawy",
      "text": "I want one. I have family that follows mormonism, this will horrify them 🤣",
      "timestamp": "2022-05-20 13:54:58",
      "score": 281,
      "num_children": 5,
      "author": 401763,
      "replies": [
        {
          "id": "i9dat2w",
          "text": "I wonder what would horrify them more - satan stickers or muslim stickers.",
          "timestamp": "2022-05-20 19:54:59",
          "score": 17,
          "num_children": 1,
          "author": 36493,
          "replies": [
            {
              "id": "i9dqxqi",
              "text": "Would they even know the difference? xD",
              "timestamp": "2022-05-20 21:58:02",
              "score": 11,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i9djcs5",
          "text": "I’ve been reading 1 and 2 Nephi lately thanks to that one show. How the fuck did it ever convince anyone it’s even semi-legit? Mormons really do try as hard as possible to suspend all belief to believe what they do. It reads almost as bad a LRH.",
          "timestamp": "2022-05-20 20:59:27",
          "score": 7,
          "num_children": 1,
          "author": 330474,
          "replies": [
            {
              "id": "i9drdsq",
              "text": "LRH?",
              "timestamp": "2022-05-20 22:01:26",
              "score": 3,
              "num_children": 1,
              "author": 20264,
              "replies": [
                {
                  "id": "i9dschr",
                  "text": "L. Ron Hubbard, the creator of the “religion” Scientology",
                  "timestamp": "2022-05-20 22:09:05",
                  "score": 5,
                  "num_children": 1,
                  "author": 30394,
                  "replies": [
                    {
                      "id": "i9dt8za",
                      "text": "Duh...I've had a long week sorry.",
                      "timestamp": "2022-05-20 22:16:19",
                      "score": 1,
                      "num_children": 1,
                      "author": 20264,
                      "replies": [
                        {
                          "id": "i9dtonk",
                          "text": "You just need to clear your Thetans, bro.",
                          "timestamp": "2022-05-20 22:19:51",
                          "score": 2,
                          "num_children": 1,
                          "author": 330474,
                          "replies": [
                            {
                              "id": "i9dtyb4",
                              "text": "I will be clear one day",
                              "timestamp": "2022-05-20 22:21:55",
                              "score": 1,
                              "num_children": 1,
                              "author": 20264,
                              "replies": [
                                {
                                  "id": "i9du4du",
                                  "text": "Like Larry Bird! At least Bill Murray says he’s clear",
                                  "timestamp": "2022-05-20 22:23:19",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 330474,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i9e83pc",
          "text": "I'm the only exmormon in my family. Cheers for the black sheep in the family!",
          "timestamp": "2022-05-21 00:21:36",
          "score": 6,
          "num_children": 1,
          "author": 42070,
          "replies": [
            {
              "id": "i9e8bqt",
              "text": "Hear hear! 🍻",
              "timestamp": "2022-05-21 00:23:36",
              "score": 2,
              "num_children": 0,
              "author": 401763,
              "replies": []
            }
          ]
        },
        {
          "id": "i9cpve0",
          "text": "Same",
          "timestamp": "2022-05-20 17:18:26",
          "score": 10,
          "num_children": 0,
          "author": 49570,
          "replies": []
        },
        {
          "id": "i9cye6o",
          "text": "The great cult!",
          "timestamp": "2022-05-20 18:19:36",
          "score": 2,
          "num_children": 0,
          "author": 281429,
          "replies": []
        }
      ]
    },
    {
      "id": "i9cbaiq",
      "text": ">Schaffer said another point of contention was that he posted Psalm 46:1 on the department's Facebook page, which reads, \"God is our refuge and strength, a very present help in trouble.\" The Scripture quote, he explained, was in response to a local 12,000-acre brush fire in March that killed one person and destroyed 35 homes, 92 outbuildings and 110 vehicles.\n\nHoly fuck. Screw that! Public safety agents are supposed to be the present help in trouble. Get your asses moving and stop outsourcing your responsibility to a non-existent entity.",
      "timestamp": "2022-05-20 15:42:40",
      "score": 47,
      "num_children": 1,
      "author": 141426,
      "replies": [
        {
          "id": "i9d9ppp",
          "text": "This is just next level evil. Imagine losing a loved one, and officials respond by gloating and trying to make it into an ad for their cult.\n\nAlmost everywhere in the world, this man would be fired and possibly tried for this.",
          "timestamp": "2022-05-20 19:46:52",
          "score": 1,
          "num_children": 1,
          "author": 26788,
          "replies": [
            {
              "id": "i9eayje",
              "text": "You vastly underestimate the number of places in the world which effectively have a state-sponsored religion.",
              "timestamp": "2022-05-21 00:47:02",
              "score": 2,
              "num_children": 0,
              "author": 307729,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9c7qkq",
      "text": "\"You can't have In God We Trust on your police cars\"\n\n\"OK. We'll take it off. No, wait. We want it back on.\"\n\n\"Then you will have to allow other religions display a message\"\n\n\"OK. Cool.\"\n\n\"Please enjoy this \"Duty, Honor, Community, Hail Satan\" sticker.\"\n\n\"OK...Wait...What?\"",
      "timestamp": "2022-05-20 15:19:14",
      "score": 212,
      "num_children": 3,
      "author": 105112,
      "replies": [
        {
          "id": "i9cyle9",
          "text": "This is literally why TST exists and I am all for it.",
          "timestamp": "2022-05-20 18:21:06",
          "score": 82,
          "num_children": 0,
          "author": 305791,
          "replies": []
        },
        {
          "id": "i9cy986",
          "text": "> \"Please enjoy this \"Duty, Honor, Community, Hail Satan\" sticker.\"\n\nWith an upside-down star inside the police shield ....",
          "timestamp": "2022-05-20 18:18:33",
          "score": 40,
          "num_children": 0,
          "author": 357304,
          "replies": []
        },
        {
          "id": "i9dkehy",
          "text": "> \"Then you will have to allow other religions display a message\"\n\n> \"OK. Cool.\"\n\nYeah, I don't think so. You think some Christian cop in buttfuck nowhere would drive around with 'Allahu Akbar' on his car? They will only ever drive around with Christian phrases.",
          "timestamp": "2022-05-20 21:07:22",
          "score": 9,
          "num_children": 1,
          "author": 62469,
          "replies": [
            {
              "id": "i9drwht",
              "text": "And I bet they don't realise that if they said \"God is the greatest\" they are literally saying \"Allahu akbar\", just in a different language. And it's even the same guy both phrases are referring to",
              "timestamp": "2022-05-20 22:05:31",
              "score": 7,
              "num_children": 1,
              "author": 113586,
              "replies": [
                {
                  "id": "i9enl8p",
                  "text": "Try telling a Christian that they pray to the same good a Muslim does...they will straight up deny it.",
                  "timestamp": "2022-05-21 02:38:41",
                  "score": 1,
                  "num_children": 0,
                  "author": 219780,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9cgqmt",
      "text": "It seems certain groups can ignore the Constitution when it suits them but vigorously defend it's sacred text the next day.",
      "timestamp": "2022-05-20 16:18:26",
      "score": 40,
      "num_children": 2,
      "author": 2016,
      "replies": [
        {
          "id": "i9chqtq",
          "text": "Not sure if it's a memory problem, a stupidity problem, or just republicans.",
          "timestamp": "2022-05-20 16:24:59",
          "score": 15,
          "num_children": 2,
          "replies": [
            {
              "id": "i9ckleo",
              "text": "Yes",
              "timestamp": "2022-05-20 16:43:26",
              "score": 12,
              "num_children": 1,
              "replies": [
                {
                  "id": "i9clbjf",
                  "text": "And you sir or madam are correct!",
                  "timestamp": "2022-05-20 16:48:08",
                  "score": 5,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i9cp9nw",
                      "text": "Omg!! What do I win??",
                      "timestamp": "2022-05-20 17:14:21",
                      "score": 5,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i9cpyym",
                          "text": "An all expense paid vacation to the sunny dream land of Tallahassee Florida, where you'll be present at the next five De Satan press conferences. You'll be able to ask governor Ronnie ANY question you like, as long as it's \"how are you feeling today?\".\n\nSome vacation days are blacked out.",
                          "timestamp": "2022-05-20 17:19:07",
                          "score": 3,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i9cree5",
                              "text": "Oh….. great 0.o",
                              "timestamp": "2022-05-20 17:28:46",
                              "score": 3,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9d413p",
              "text": "All the above but also cherry picking as it suits them. Just like they do with the Bible.  It's always about focusing only on the things that get them what they want regardless of reality",
              "timestamp": "2022-05-20 19:03:43",
              "score": 2,
              "num_children": 1,
              "author": 82723,
              "replies": [
                {
                  "id": "i9dte7u",
                  "text": "Especially when the reality of the situation is there are no gods and all the dogmas based on those imaginary creatures is just that... fairy tales.",
                  "timestamp": "2022-05-20 22:17:30",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i9e54uc",
          "text": "One of the Twitter threads had some angry Christians and one guy replied “That’s not very love they neighbor of you.”  Love when they turn it around on them.",
          "timestamp": "2022-05-20 23:55:27",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i9bzot5",
      "text": "Soon as I read Satanic Temple I knew it was going to be hilarious",
      "timestamp": "2022-05-20 14:25:23",
      "score": 119,
      "num_children": 3,
      "author": 260832,
      "replies": [
        {
          "id": "i9cy34s",
          "text": "My favorite nuance in [some of the proposed designs](https://mobile.twitter.com/hemantmehta/status/1526620711363788802) is the [upside-down star in the police shield](https://pbs.twimg.com/media/FS-lEBoXwAALc3U?format=png&name=large), lmao!",
          "timestamp": "2022-05-20 18:17:15",
          "score": 31,
          "num_children": 1,
          "author": 357304,
          "replies": [
            {
              "id": "i9d1yf9",
              "text": "\"One Nation Hail Satan\" has such a nice ring to it",
              "timestamp": "2022-05-20 18:47:20",
              "score": 20,
              "num_children": 2,
              "author": 47346,
              "replies": [
                {
                  "id": "i9d60rx",
                  "text": "I was just thinking that. Those stickers are badass.",
                  "timestamp": "2022-05-20 19:19:23",
                  "score": 4,
                  "num_children": 0,
                  "author": 61563,
                  "replies": []
                },
                {
                  "id": "i9dyvg0",
                  "text": "There's an extremely racist political party in Australia led by one Pauline \"pants down\" Hanson. Memorable quotes include \"we will be swamped with Asians\", later updated to \"we will be swamped with Muslims\" when the target changed.\n\nOne nation hail Satan was hilarious for slightly different reasons to me.",
                  "timestamp": "2022-05-20 23:02:12",
                  "score": 1,
                  "num_children": 0,
                  "author": 369179,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i9e1ea7",
          "text": "If feels like Satanic Temple is synonymous with Checkmate when it relates to news stories",
          "timestamp": "2022-05-20 23:23:23",
          "score": 3,
          "num_children": 0,
          "author": 376895,
          "replies": []
        },
        {
          "id": "i9cydby",
          "text": "“Hilarious”",
          "timestamp": "2022-05-20 18:19:25",
          "score": -2,
          "num_children": 1,
          "author": 373347,
          "replies": [
            {
              "id": "i9e7q80",
              "text": "I dunno, I think it's pretty fuckin funny.",
              "timestamp": "2022-05-21 00:18:16",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9c3msy",
      "text": "The article has multiple instances of \"The TST...\". Does the author not know what the first T stands for?",
      "timestamp": "2022-05-20 14:51:47",
      "score": 59,
      "num_children": 3,
      "author": 98784,
      "replies": [
        {
          "id": "i9c6yq7",
          "text": "PIN number. ATM machine :)",
          "timestamp": "2022-05-20 15:14:05",
          "score": 43,
          "num_children": 6,
          "author": 322515,
          "replies": [
            {
              "id": "i9cfloh",
              "text": "RIP in Peace",
              "timestamp": "2022-05-20 16:10:56",
              "score": 21,
              "num_children": 1,
              "author": 249058,
              "replies": [
                {
                  "id": "i9d7fv1",
                  "text": "The Los Angeles Angels",
                  "timestamp": "2022-05-20 19:30:06",
                  "score": 5,
                  "num_children": 1,
                  "author": 53468,
                  "replies": [
                    {
                      "id": "i9e620x",
                      "text": "Lol that's a good one",
                      "timestamp": "2022-05-21 00:03:34",
                      "score": 1,
                      "num_children": 0,
                      "author": 260634,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9cn9m2",
              "text": "DC Comics",
              "timestamp": "2022-05-20 17:00:59",
              "score": 9,
              "num_children": 1,
              "author": 121846,
              "replies": [
                {
                  "id": "i9cskgr",
                  "text": "Wait, what does the D in DC stand for?\n\nedit: for anyone curious about this\n> DC Comics made a name for themselves in 1939 as they were then founded by Malcolm Wheeler-Nicholson. During that time its company was known as National Allied Publications. The initials for the DC Comic books were from taken from the Detective Comic series.\n\nDC Comics Inc. however is the name of the publisher.",
                  "timestamp": "2022-05-20 17:36:42",
                  "score": 3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i9ct84r",
                      "text": "Detective Comics",
                      "timestamp": "2022-05-20 17:41:12",
                      "score": 1,
                      "num_children": 1,
                      "author": 378745,
                      "replies": [
                        {
                          "id": "i9dtlvd",
                          "text": "Man of Steel",
                          "timestamp": "2022-05-20 22:19:13",
                          "score": 1,
                          "num_children": 0,
                          "author": 10242,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9clpvq",
              "text": "CAC card\n(Not as commonly known)",
              "timestamp": "2022-05-20 16:50:44",
              "score": 4,
              "num_children": 1,
              "author": 214119,
              "replies": [
                {
                  "id": "i9cyco4",
                  "text": ".... I'm waiting for my CAC card. No one told me what it stood for. Said CAC card to my boss a bunch of times. Swear I heard them say it too. Oops.",
                  "timestamp": "2022-05-20 18:19:17",
                  "score": 1,
                  "num_children": 0,
                  "author": 363995,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9drnqt",
              "text": "VIN number",
              "timestamp": "2022-05-20 22:03:37",
              "score": 1,
              "num_children": 0,
              "author": 20264,
              "replies": []
            },
            {
              "id": "i9ebb5w",
              "text": "At least in the case of PIN number, PIN is always pronounced as the actual word \"pin,\" which could be moderately confusing.",
              "timestamp": "2022-05-21 00:50:12",
              "score": 1,
              "num_children": 0,
              "author": 307729,
              "replies": []
            },
            {
              "id": "i9f082o",
              "text": "LCD display, LED diode...\nMilitary intelligence, wait no that is something else...",
              "timestamp": "2022-05-21 04:42:03",
              "score": 1,
              "num_children": 0,
              "author": 138411,
              "replies": []
            }
          ]
        },
        {
          "id": "i9cgw7u",
          "text": "Classics case of [RAS syndrome](https://en.wikipedia.org/wiki/RAS_syndrome).",
          "timestamp": "2022-05-20 16:19:27",
          "score": 12,
          "num_children": 0,
          "author": 185590,
          "replies": []
        },
        {
          "id": "i9cppvi",
          "text": "The Satanic TST Temple",
          "timestamp": "2022-05-20 17:17:23",
          "score": 4,
          "num_children": 0,
          "author": 25680,
          "replies": []
        }
      ]
    },
    {
      "id": "i9bx0im",
      "text": "Hail satin",
      "timestamp": "2022-05-20 14:07:01",
      "score": 18,
      "num_children": 2,
      "author": 399168,
      "replies": [
        {
          "id": "i9cf6o8",
          "text": "Bow before Rayon!",
          "timestamp": "2022-05-20 16:08:14",
          "score": 5,
          "num_children": 0,
          "author": 380125,
          "replies": []
        },
        {
          "id": "i9cyvdq",
          "text": "Lord of the linens",
          "timestamp": "2022-05-20 18:23:16",
          "score": 2,
          "num_children": 0,
          "author": 283113,
          "replies": []
        }
      ]
    },
    {
      "id": "i9borh4",
      "text": "That's hilarious. I love it.",
      "timestamp": "2022-05-20 13:07:00",
      "score": 60,
      "num_children": 1,
      "author": 286151,
      "replies": [
        {
          "id": "i9czatt",
          "text": "I wanted freedom but not like this =\\",
          "timestamp": "2022-05-20 18:26:35",
          "score": 2,
          "num_children": 0,
          "author": 401521,
          "replies": []
        }
      ]
    },
    {
      "id": "i9c45p6",
      "text": "[removed]",
      "timestamp": "2022-05-20 14:55:19",
      "score": 87,
      "num_children": 4,
      "replies": [
        {
          "id": "i9e8f8v",
          "text": "Eh Jesus was a socialist progressive who supported separation of church and state and generally disapproved of organized religion as well. His dad was a right cunt though.",
          "timestamp": "2022-05-21 00:24:29",
          "score": 7,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i9ca2fr",
          "text": "Thank God for Satan!",
          "timestamp": "2022-05-20 15:34:35",
          "score": 25,
          "num_children": 1,
          "author": 31189,
          "replies": [
            {
              "id": "i9cdumb",
              "text": "[removed]",
              "timestamp": "2022-05-20 15:59:30",
              "score": -7,
              "num_children": 2,
              "replies": [
                {
                  "id": "i9cljmw",
                  "text": "Umm... Are you ok?",
                  "timestamp": "2022-05-20 16:49:37",
                  "score": 14,
                  "num_children": 2,
                  "author": 379903,
                  "replies": [
                    {
                      "id": "i9d1zro",
                      "text": "No he/she isn't , I just checked his/her profile. Is there anyway to send help or alert someone ?",
                      "timestamp": "2022-05-20 18:47:37",
                      "score": 6,
                      "num_children": 2,
                      "author": 165687,
                      "replies": [
                        {
                          "id": "i9dp4al",
                          "text": "Ho lee fuck you weren't kidding, this person needs some serious help",
                          "timestamp": "2022-05-20 21:43:56",
                          "score": 2,
                          "num_children": 0,
                          "author": 381320,
                          "replies": []
                        },
                        {
                          "id": "i9dcbel",
                          "text": "Yes. Top right on their profile there's a link for support.",
                          "timestamp": "2022-05-20 20:06:05",
                          "score": 1,
                          "num_children": 1,
                          "author": 243499,
                          "replies": [
                            {
                              "id": "i9dg7xk",
                              "text": "Done , thank you",
                              "timestamp": "2022-05-20 20:35:41",
                              "score": -1,
                              "num_children": 0,
                              "author": 165687,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i9cmduf",
                      "text": "[removed]",
                      "timestamp": "2022-05-20 16:55:08",
                      "score": -3,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i9cq9sa",
                          "text": "Bro TST doesn't actually really believe satan and jesus exist..",
                          "timestamp": "2022-05-20 17:21:08",
                          "score": 15,
                          "num_children": 0,
                          "author": 140614,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i9e0y3s",
                  "text": "https://i.kym-cdn.com/photos/images/original/000/216/874/1299530681729.gif",
                  "timestamp": "2022-05-20 23:19:36",
                  "score": 2,
                  "num_children": 0,
                  "author": 97036,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i9ercvn",
          "text": "Not really, but ok. Jesus was a Jew who abhorred the wealthy and fought against tyranny and oppression but sure.",
          "timestamp": "2022-05-21 03:12:37",
          "score": 5,
          "num_children": 0,
          "author": 64066,
          "replies": []
        },
        {
          "id": "i9dko0w",
          "text": "I'm not christian, but Jesus is one of the few decent people in the bible, give him some slack.",
          "timestamp": "2022-05-20 21:09:27",
          "score": 5,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i9bwttk",
      "text": "Satanists are the best trolls. Love reading about what they do",
      "timestamp": "2022-05-20 14:05:42",
      "score": 103,
      "num_children": 3,
      "author": 306115,
      "replies": [
        {
          "id": "i9cnr36",
          "text": "TST isnt rustling jimmies for laughs. there's an urgent issue which they're challenging. it's creative, sure, but not trolling.",
          "timestamp": "2022-05-20 17:04:16",
          "score": 101,
          "num_children": 2,
          "author": 310392,
          "replies": [
            {
              "id": "i9cv35c",
              "text": "As Lucien himself said, \"it can be both.\"",
              "timestamp": "2022-05-20 17:54:33",
              "score": 31,
              "num_children": 1,
              "author": 13203,
              "replies": [
                {
                  "id": "i9cwqyu",
                  "text": "And I like it. I like it a lot.",
                  "timestamp": "2022-05-20 18:06:59",
                  "score": 6,
                  "num_children": 0,
                  "author": 159244,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9cpdz5",
              "text": "No fun allowed!",
              "timestamp": "2022-05-20 17:15:08",
              "score": 3,
              "num_children": 2,
              "author": 219352,
              "replies": [
                {
                  "id": "i9cusau",
                  "text": "Campaigning for equal rights and separation of church and state can be serious *and* fun!",
                  "timestamp": "2022-05-20 17:52:16",
                  "score": 9,
                  "num_children": 0,
                  "author": 339873,
                  "replies": []
                },
                {
                  "id": "i9cq3zx",
                  "text": "Hey, HEY, cut it out! Zero laughs",
                  "timestamp": "2022-05-20 17:20:03",
                  "score": 3,
                  "num_children": 0,
                  "author": 184393,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i9cw1ry",
          "text": "It’s not a joke. It’s the best way to push back against church and state. It’s a legally “real” religion because it’s rooted in Christianity. It’s gaudy and “evil symbology” so Christians would rather no religious symbols than 2 “more appropriate” ones",
          "timestamp": "2022-05-20 18:01:45",
          "score": 15,
          "num_children": 1,
          "author": 261537,
          "replies": [
            {
              "id": "i9drftq",
              "text": "Never said it was a joke, seems like the only religion actively pursuing separation of church and state",
              "timestamp": "2022-05-20 22:01:53",
              "score": 5,
              "num_children": 0,
              "author": 306115,
              "replies": []
            }
          ]
        },
        {
          "id": "i9dru6u",
          "text": "They're not actually Satanists though, are they?",
          "timestamp": "2022-05-20 22:05:02",
          "score": 2,
          "num_children": 1,
          "author": 73904,
          "replies": [
            {
              "id": "i9e8yrc",
              "text": "TST is a non-theistic organization. Typically members are atheist or anti-theist, but anyone who supports the separation of church and state is welcome.",
              "timestamp": "2022-05-21 00:29:20",
              "score": 5,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9c7jm8",
      "text": "Thank you for using Archive.org for Fox News.",
      "timestamp": "2022-05-20 15:17:58",
      "score": 11,
      "num_children": 0,
      "author": 25999,
      "replies": []
    },
    {
      "id": "i9bqoe4",
      "text": "Hail Satan!",
      "timestamp": "2022-05-20 13:21:24",
      "score": 33,
      "num_children": 0,
      "author": 124206,
      "replies": []
    },
    {
      "id": "i9cx9v9",
      "text": "Thanks for linking the Wayback Machine version so I don't have to give Fox a click.",
      "timestamp": "2022-05-20 18:10:59",
      "score": 6,
      "num_children": 0,
      "author": 379193,
      "replies": []
    },
    {
      "id": "i9d59hz",
      "text": "\"I'm a Catholic whore, currently enjoying congress out of wedlock with my black Jewish boyfriend who works at a military abortion clinic. So, hail Satan, and have a lovely   \nafternoon, madam.\" - Colin Firth (Kingsman 2014)",
      "timestamp": "2022-05-20 19:13:29",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9carci",
      "text": "Can they add \"stop shooting people\" to the police force instrucitons as well?",
      "timestamp": "2022-05-20 15:39:10",
      "score": 21,
      "num_children": 1,
      "author": 171215,
      "replies": [
        {
          "id": "i9cyf57",
          "text": "Im sure the police force will be REALLY good at stopped armed criminals without the ability to fire their service weapons.",
          "timestamp": "2022-05-20 18:19:48",
          "score": -10,
          "num_children": 3,
          "author": 160701,
          "replies": [
            {
              "id": "i9d1qzq",
              "text": "It's not like they can get any worse at their jobs.",
              "timestamp": "2022-05-20 18:45:39",
              "score": 7,
              "num_children": 0,
              "author": 381039,
              "replies": []
            },
            {
              "id": "i9czhiy",
              "text": "Send a crook to catch a crook",
              "timestamp": "2022-05-20 18:28:02",
              "score": 4,
              "num_children": 0,
              "author": 171215,
              "replies": []
            },
            {
              "id": "i9erj64",
              "text": "Man police don’t do shit. I got robbed twice and one time when the police came the motherfuckers were still in my apartment. They watched them walk out and told them to stop and then left. They don’t even do their jobs when it’s easy.",
              "timestamp": "2022-05-21 03:14:16",
              "score": 5,
              "num_children": 1,
              "author": 64066,
              "replies": [
                {
                  "id": "i9jwcjt",
                  "text": "Round here you just get a reference number for your thieving insurers.",
                  "timestamp": "2022-05-22 11:31:10",
                  "score": 1,
                  "num_children": 0,
                  "author": 171215,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9cp7mu",
      "text": "You would think people would be more up in arms after they removed \"To Protect and Serve\" from most police vehicles.",
      "timestamp": "2022-05-20 17:13:59",
      "score": 5,
      "num_children": 0,
      "author": 192011,
      "replies": []
    },
    {
      "id": "i9d4zeq",
      "text": "God bless the Satanic Temple",
      "timestamp": "2022-05-20 19:11:13",
      "score": 7,
      "num_children": 0,
      "author": 185967,
      "replies": []
    },
    {
      "id": "i9d8vel",
      "text": "I want the decal for my car",
      "timestamp": "2022-05-20 19:40:43",
      "score": 6,
      "num_children": 0,
      "author": 331420,
      "replies": []
    },
    {
      "id": "i9djfvw",
      "text": ">*Noting how \"In God We Trust\" is the national motto, he said he thought nothing of it when one of his officers approached him last year, asking to place the phrase on one of the cruisers.*\n\nUm...  Noooooo.  The national \"motto\" is “E Pluribus Unum” (from many, one).  \"In God We Trust\" came along during the religious fervor of the Civil War, and was added to coins.  Then, in 1955, Eisenhower made it into law. \n\nWe are also NOT a Christian nation.",
      "timestamp": "2022-05-20 21:00:05",
      "score": 6,
      "num_children": 0,
      "author": 228074,
      "replies": []
    },
    {
      "id": "i9c4tgz",
      "text": "I love them. Always forcing these people to show their hypocrisy.",
      "timestamp": "2022-05-20 14:59:45",
      "score": 11,
      "num_children": 0,
      "author": 374250,
      "replies": []
    },
    {
      "id": "i9c6e52",
      "text": "I was really hoping for \"Do as thou wilt\".",
      "timestamp": "2022-05-20 15:10:15",
      "score": 3,
      "num_children": 1,
      "author": 191346,
      "replies": [
        {
          "id": "i9ccn8z",
          "text": "Personally I was hoping for hood sized baphomet decals!\n\nMaybe some of our pagan brethren can demand \"lest ye harm none, do what ye will\"",
          "timestamp": "2022-05-20 15:51:33",
          "score": 6,
          "num_children": 1,
          "author": 221452,
          "replies": [
            {
              "id": "i9ejbfg",
              "text": "Imagine that in your rear view mirror when you’re getting pulled over",
              "timestamp": "2022-05-21 02:00:17",
              "score": 3,
              "num_children": 1,
              "author": 382922,
              "replies": [
                {
                  "id": "i9f4rag",
                  "text": "Sorry officer, I didn't notice the lights. I was busy staring at your goat's tits.",
                  "timestamp": "2022-05-21 05:35:27",
                  "score": 1,
                  "num_children": 0,
                  "author": 221452,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9c8wp9",
      "text": "They should insist on equal placement on the vehicles. Otherwise their decals will be hidden on the cars.",
      "timestamp": "2022-05-20 15:26:58",
      "score": 5,
      "num_children": 0,
      "author": 336045,
      "replies": []
    },
    {
      "id": "i9cduql",
      "text": "Hail satan!",
      "timestamp": "2022-05-20 15:59:31",
      "score": 5,
      "num_children": 0,
      "author": 291191,
      "replies": []
    },
    {
      "id": "i9d1gc5",
      "text": "I bought a membership to TST yesterday. Happy to support them with women’s rights and now this other fundamentalist bullshit.",
      "timestamp": "2022-05-20 18:43:20",
      "score": 4,
      "num_children": 0,
      "author": 234738,
      "replies": []
    },
    {
      "id": "i9d6xbu",
      "text": "Just a reminder you can support the satanic temple any time you use Amazon by going to smile.amazon.com and listing them as your nonprofit. A percentage of every purchase goes to the temple.",
      "timestamp": "2022-05-20 19:26:12",
      "score": 5,
      "num_children": 1,
      "author": 158630,
      "replies": [
        {
          "id": "i9dei7n",
          "text": "I would, but I send my money to the LGBTQAI+ Center in Los Angeles.",
          "timestamp": "2022-05-20 20:22:42",
          "score": 2,
          "num_children": 0,
          "author": 194087,
          "replies": []
        }
      ]
    },
    {
      "id": "i9cr7oy",
      "text": "For all the people saying this country was founded on Christianity Satan is a part of Christianity",
      "timestamp": "2022-05-20 17:27:31",
      "score": 3,
      "num_children": 0,
      "author": 356519,
      "replies": []
    },
    {
      "id": "i9d27ux",
      "text": "The GOAT trolls. Respect.",
      "timestamp": "2022-05-20 18:49:25",
      "score": 3,
      "num_children": 0,
      "author": 247785,
      "replies": []
    },
    {
      "id": "i9d7reu",
      "text": "Sooo......where can I get one of these decals?",
      "timestamp": "2022-05-20 19:32:31",
      "score": 3,
      "num_children": 0,
      "author": 314961,
      "replies": []
    },
    {
      "id": "i9dg6bt",
      "text": "While fox is generally pretty shit, this article seems to be almost all just facts without a spin.\n\nGood job fox. It's important to recognize regular reporting when it happens, otherwise improvement will never happen",
      "timestamp": "2022-05-20 20:35:20",
      "score": 3,
      "num_children": 0,
      "author": 121406,
      "replies": []
    },
    {
      "id": "i9dnzed",
      "text": "Ah, I love TST lol",
      "timestamp": "2022-05-20 21:35:11",
      "score": 3,
      "num_children": 0,
      "author": 283878,
      "replies": []
    },
    {
      "id": "i9eo74z",
      "text": "God is DEAD! ^hail ^satan Satan LIVES!",
      "timestamp": "2022-05-21 02:44:08",
      "score": 3,
      "num_children": 0,
      "author": 137292,
      "replies": []
    },
    {
      "id": "i9c8s8f",
      "text": "Be a damn shame if some malcontents did something illegal like slap decals on parked police cars.",
      "timestamp": "2022-05-20 15:26:08",
      "score": 2,
      "num_children": 0,
      "author": 132003,
      "replies": []
    },
    {
      "id": "i9caoxg",
      "text": "This is hilarious. I can’t wait to see the town folk Lose. Their $hit",
      "timestamp": "2022-05-20 15:38:42",
      "score": 2,
      "num_children": 0,
      "author": 75787,
      "replies": []
    },
    {
      "id": "i9ctin1",
      "text": "Can I get one of those decals ?",
      "timestamp": "2022-05-20 17:43:11",
      "score": 2,
      "num_children": 0,
      "author": 372321,
      "replies": []
    },
    {
      "id": "i9ctn1e",
      "text": "Can they send some stickers to Bakersfield CA the city councils decided to put “in god we trust” on our cop cars.",
      "timestamp": "2022-05-20 17:44:02",
      "score": 2,
      "num_children": 0,
      "author": 276292,
      "replies": []
    },
    {
      "id": "i9cz4q5",
      "text": "lol we already know they will purposefully not be using those stickers and probably overturn their little ban again. Ether that or only exclusively put the \"in god\" ones... which should be fun to see a legal battle over",
      "timestamp": "2022-05-20 18:25:17",
      "score": 2,
      "num_children": 0,
      "author": 238912,
      "replies": []
    },
    {
      "id": "i9d0gas",
      "text": "OMG I want one or 12",
      "timestamp": "2022-05-20 18:35:36",
      "score": 2,
      "num_children": 0,
      "author": 55291,
      "replies": []
    },
    {
      "id": "i9d3u7p",
      "text": "Can I get me of those stickers?",
      "timestamp": "2022-05-20 19:02:12",
      "score": 2,
      "num_children": 0,
      "author": 112193,
      "replies": []
    },
    {
      "id": "i9d6ath",
      "text": "I want to support them AND I definitely want one of those stickers.",
      "timestamp": "2022-05-20 19:21:26",
      "score": 2,
      "num_children": 0,
      "author": 129658,
      "replies": []
    },
    {
      "id": "i9d6xrd",
      "text": "Really hoping the big lie of religion is solved in my lifetime. It won't be, but it'd be pretty cool to see. \"yeah, we all realized that all \"magic\" can be explained and anyone can write a book.\"",
      "timestamp": "2022-05-20 19:26:17",
      "score": 2,
      "num_children": 0,
      "author": 367517,
      "replies": []
    },
    {
      "id": "i9dbncd",
      "text": "I would legit move to a city that put hail Satan on cop cars.",
      "timestamp": "2022-05-20 20:01:13",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9dkspz",
      "text": "Be gay, do drugs, hail Satan\n\nhttps://m.youtube.com/watch?v=s6rkmPEXPCw",
      "timestamp": "2022-05-20 21:10:28",
      "score": 2,
      "num_children": 0,
      "author": 349323,
      "replies": []
    },
    {
      "id": "i9dobnj",
      "text": "Hail Satan!",
      "timestamp": "2022-05-20 21:37:47",
      "score": 2,
      "num_children": 0,
      "author": 50494,
      "replies": []
    },
    {
      "id": "i9dosoz",
      "text": "I’ll take one while they’re at it.",
      "timestamp": "2022-05-20 21:41:26",
      "score": 2,
      "num_children": 0,
      "author": 129987,
      "replies": []
    },
    {
      "id": "i9ebn5u",
      "text": "Holy shit, can I get a sticker?",
      "timestamp": "2022-05-21 00:53:07",
      "score": 2,
      "num_children": 0,
      "author": 346615,
      "replies": []
    },
    {
      "id": "i9ehis2",
      "text": "The Satanic Temple continues to do God's work (as ironic as that is to say), and I love them for it.",
      "timestamp": "2022-05-21 01:45:12",
      "score": 2,
      "num_children": 0,
      "author": 226776,
      "replies": []
    },
    {
      "id": "i9esc79",
      "text": "I can definitely see some quitting the force over this, and I for one couldn't give less of a fuck.",
      "timestamp": "2022-05-21 03:21:53",
      "score": 2,
      "num_children": 0,
      "author": 243886,
      "replies": []
    },
    {
      "id": "i9eud36",
      "text": "Even according to Paradise Lost, Christians think of Satan as Prometheus. The greatest crime against God is giving humans the knowledge of good and evil, because then, they'll recognize that God is holding them back.",
      "timestamp": "2022-05-21 03:40:41",
      "score": 2,
      "num_children": 0,
      "author": 100152,
      "replies": []
    },
    {
      "id": "i9ewu81",
      "text": "can I have one please?",
      "timestamp": "2022-05-21 04:05:23",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9fbekk",
      "text": "Hell yeah! Haaaiil Satan!",
      "timestamp": "2022-05-21 07:05:51",
      "score": 2,
      "num_children": 0,
      "author": 252656,
      "replies": []
    },
    {
      "id": "i9gl35w",
      "text": "The Bible really makes Satan out to be the good guy",
      "timestamp": "2022-05-21 15:41:59",
      "score": 2,
      "num_children": 0,
      "author": 238663,
      "replies": []
    },
    {
      "id": "i9d5z78",
      "text": "I fi@king LOVE my church! I am an atheist, but I believe in and proud of. what my church does to force inclusion, etc…even when it’s nothing more than irritating the living shite outta Christian’s",
      "timestamp": "2022-05-20 19:19:03",
      "score": 3,
      "num_children": 0,
      "author": 17758,
      "replies": []
    },
    {
      "id": "i9c7sdr",
      "text": "Considering how the police acts like scumbags, hail satan might not be too far off the mark. although god is a bigger scumbag than satan.",
      "timestamp": "2022-05-20 15:19:35",
      "score": 4,
      "num_children": 0,
      "author": 201527,
      "replies": []
    },
    {
      "id": "i9dxsgr",
      "text": "The way he reluctantly come to the correct conclusion. I guess I won't post my relgion stuff on my gov job, poor me.",
      "timestamp": "2022-05-20 22:53:17",
      "score": 3,
      "num_children": 0,
      "author": 292179,
      "replies": []
    },
    {
      "id": "i9d39v0",
      "text": "Satan is cool, he invented the users.",
      "timestamp": "2022-05-20 18:57:43",
      "score": 1,
      "num_children": 0,
      "author": 8959,
      "replies": []
    },
    {
      "id": "i9cfmva",
      "text": "It will be a cold day at home before the PD put them on police cars, but it opens the door to a potentially expensive court action. \n\nMaybe that will help the community leaders understand that *Jesus!* might *not* be the be-all and end-all that will get them Bonus Points for Admission....",
      "timestamp": "2022-05-20 16:11:09",
      "score": 1,
      "num_children": 0,
      "author": 174957,
      "replies": []
    },
    {
      "id": "i9chxbm",
      "text": "The Boss will be most pleased.",
      "timestamp": "2022-05-20 16:26:09",
      "score": 1,
      "num_children": 0,
      "author": 33970,
      "replies": []
    },
    {
      "id": "i9coyny",
      "text": "It's a Woodland Critter Christmas! https://www.youtube.com/watch?v=IKzZKDo3aNc",
      "timestamp": "2022-05-20 17:12:18",
      "score": 1,
      "num_children": 0,
      "author": 196267,
      "replies": []
    },
    {
      "id": "i9cslmc",
      "text": "Hail",
      "timestamp": "2022-05-20 17:36:55",
      "score": 1,
      "num_children": 0,
      "author": 174056,
      "replies": []
    },
    {
      "id": "i9cveu9",
      "text": "Awesome.  Hail Satan!",
      "timestamp": "2022-05-20 17:56:58",
      "score": 1,
      "num_children": 0,
      "author": 387228,
      "replies": []
    },
    {
      "id": "i9cx234",
      "text": "Now let's get some [Isis](https://en.m.wikipedia.org/wiki/Isis) stickers on there.",
      "timestamp": "2022-05-20 18:09:21",
      "score": 1,
      "num_children": 0,
      "author": 182536,
      "replies": []
    },
    {
      "id": "i9cxhy5",
      "text": "So.. Americans.. How's that 'separation of church and state' going?",
      "timestamp": "2022-05-20 18:12:42",
      "score": 1,
      "num_children": 1,
      "author": 236378,
      "replies": [
        {
          "id": "i9dsdd2",
          "text": "I live in the south...that shit is a myth around here. If you run for office no matter the party, you better not be anything but Christian. I'm sure there are a few that have succeeded, but it ain't many I can tell you that.",
          "timestamp": "2022-05-20 22:09:17",
          "score": 2,
          "num_children": 0,
          "author": 20264,
          "replies": []
        }
      ]
    },
    {
      "id": "i9cy56z",
      "text": "I don't live in this town but one close to it... there were a ton of angry comments on the local news articles about them removing it.",
      "timestamp": "2022-05-20 18:17:42",
      "score": 1,
      "num_children": 0,
      "author": 283242,
      "replies": []
    },
    {
      "id": "i9cycu4",
      "text": "Who are they running in the next election because they're sounding more appealing to me every day.",
      "timestamp": "2022-05-20 18:19:19",
      "score": 1,
      "num_children": 0,
      "author": 356842,
      "replies": []
    },
    {
      "id": "i9cyw6z",
      "text": "Cool. Can they give people back the money that snake oiled away claiming that they were going to challenge the Texas abortion ban? I'll even accept giving it to a group like the ACLU that will actually do something.",
      "timestamp": "2022-05-20 18:23:27",
      "score": 1,
      "num_children": 0,
      "author": 163316,
      "replies": []
    },
    {
      "id": "i9d22fk",
      "text": "I wanted, \"to sever and profane\"",
      "timestamp": "2022-05-20 18:48:12",
      "score": 1,
      "num_children": 0,
      "author": 214587,
      "replies": []
    },
    {
      "id": "i9d4v94",
      "text": "That's what I've told people at my church.  You can't have it both ways. Freedom to worship God, but refuse to let others worship whatever they want (flying spaghetti monster). I'm the same way with other issue too.",
      "timestamp": "2022-05-20 19:10:18",
      "score": 1,
      "num_children": 0,
      "author": 208178,
      "replies": []
    },
    {
      "id": "i9d51qo",
      "text": "Hail Self!",
      "timestamp": "2022-05-20 19:11:46",
      "score": 1,
      "num_children": 0,
      "author": 82264,
      "replies": []
    },
    {
      "id": "i9d5fic",
      "text": "When I asked the Knox County Sheriff why they don't say \"In FSM we trust\" on the cars as well, he said, \"if that's what god is to you, then it already says it.\"",
      "timestamp": "2022-05-20 19:14:49",
      "score": 1,
      "num_children": 0,
      "author": 234918,
      "replies": []
    },
    {
      "id": "i9dgzst",
      "text": "How do I get one?",
      "timestamp": "2022-05-20 20:41:29",
      "score": 1,
      "num_children": 0,
      "author": 341784,
      "replies": []
    },
    {
      "id": "i9dh4r0",
      "text": "Can I snag a couple of those?",
      "timestamp": "2022-05-20 20:42:31",
      "score": 1,
      "num_children": 0,
      "author": 409057,
      "replies": []
    },
    {
      "id": "i9dhnef",
      "text": "Hail Satan",
      "timestamp": "2022-05-20 20:46:28",
      "score": 1,
      "num_children": 0,
      "author": 185003,
      "replies": []
    },
    {
      "id": "i9dj5pl",
      "text": "It does feel a little insulting to Satan.",
      "timestamp": "2022-05-20 20:57:55",
      "score": 1,
      "num_children": 0,
      "author": 276005,
      "replies": []
    },
    {
      "id": "i9dkr8z",
      "text": "Hell yeah",
      "timestamp": "2022-05-20 21:10:08",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9dl8r2",
      "text": "Can I buy these!?",
      "timestamp": "2022-05-20 21:13:56",
      "score": 1,
      "num_children": 1,
      "author": 28106,
      "replies": [
        {
          "id": "i9dsh6g",
          "text": "Check their website?",
          "timestamp": "2022-05-20 22:10:08",
          "score": 1,
          "num_children": 0,
          "author": 20264,
          "replies": []
        }
      ]
    },
    {
      "id": "i9dlsnv",
      "text": "I wish the Satanic Temple had this much of a presence in the Southeast",
      "timestamp": "2022-05-20 21:18:15",
      "score": 1,
      "num_children": 0,
      "author": 14264,
      "replies": []
    },
    {
      "id": "i9dmqez",
      "text": "They keep writing \"the TST\" and i hate it",
      "timestamp": "2022-05-20 21:25:27",
      "score": 1,
      "num_children": 0,
      "author": 161534,
      "replies": []
    },
    {
      "id": "i9dnyhe",
      "text": "Religion will always exist, I'm sure. But do we not have an unprecedented amount of eyes on the general harm organized religion is doing to civilization?\n\nI feel like the attitude toward at least christianity turning sour is a pretty big deal, at least compared to the past 20 years. Maybe it's wishful thinking, idk.",
      "timestamp": "2022-05-20 21:34:59",
      "score": 1,
      "num_children": 0,
      "author": 157343,
      "replies": []
    },
    {
      "id": "i9dvtfc",
      "text": "Police cars and uniforms already have a pentagram, they’re halfway there!",
      "timestamp": "2022-05-20 22:37:05",
      "score": 1,
      "num_children": 0,
      "author": 162352,
      "replies": []
    },
    {
      "id": "i9dxuc5",
      "text": "Guarantee they fuck it up and it'll say 'jail stan'",
      "timestamp": "2022-05-20 22:53:42",
      "score": 1,
      "num_children": 0,
      "author": 154197,
      "replies": []
    },
    {
      "id": "i9dzc8n",
      "text": "I want one!",
      "timestamp": "2022-05-20 23:06:03",
      "score": 1,
      "num_children": 0,
      "author": 287041,
      "replies": []
    },
    {
      "id": "i9e293m",
      "text": "Satanic Temple…doing the Lords work, as always",
      "timestamp": "2022-05-20 23:30:37",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9e2t1g",
      "text": "https://www.kwch.com/2022/05/03/haven-votes-remove-god-we-trust-police-vehicles/ hello just a bit of a update but they already removed the in god we trust from the police cars.",
      "timestamp": "2022-05-20 23:35:25",
      "score": 1,
      "num_children": 0,
      "author": 328403,
      "replies": []
    },
    {
      "id": "i9e3gel",
      "text": "So where's the design I want to see that cool shit",
      "timestamp": "2022-05-20 23:40:58",
      "score": 1,
      "num_children": 0,
      "author": 49853,
      "replies": []
    },
    {
      "id": "i9e3ohq",
      "text": "How does one get these decals if not a cop nor in Kansas?",
      "timestamp": "2022-05-20 23:42:54",
      "score": 1,
      "num_children": 0,
      "author": 204104,
      "replies": []
    },
    {
      "id": "i9e5jur",
      "text": "This is so crazy because the past few times I’ve been at work, I saw police cars across the street at the Masonic Temple. My dad even saw them there once when he came to visit me.",
      "timestamp": "2022-05-20 23:59:07",
      "score": 1,
      "num_children": 0,
      "author": 412189,
      "replies": []
    },
    {
      "id": "i9e5mug",
      "text": "Can we get some of those in Tennessee? I'll put it on my current plate.",
      "timestamp": "2022-05-20 23:59:52",
      "score": 1,
      "num_children": 0,
      "author": 228721,
      "replies": []
    },
    {
      "id": "i9e74u7",
      "text": "No way.",
      "timestamp": "2022-05-21 00:13:02",
      "score": 1,
      "num_children": 0,
      "author": 58135,
      "replies": []
    },
    {
      "id": "i9ec4jb",
      "text": "Sell these and I bet they'll find their way onto cop cars in other states too",
      "timestamp": "2022-05-21 00:57:31",
      "score": 1,
      "num_children": 0,
      "author": 412396,
      "replies": []
    },
    {
      "id": "i9eekhq",
      "text": "Is there a way I can get them to do something like this? I work local government and our city vehicles have “In God We Trust” on them. It was a vanity project that was thousands of dollars and yet… they got rid of recycling services for our city due to budget issues.",
      "timestamp": "2022-05-21 01:19:31",
      "score": 1,
      "num_children": 0,
      "author": 12811,
      "replies": []
    },
    {
      "id": "i9eev0v",
      "text": "Hail yourselves!",
      "timestamp": "2022-05-21 01:22:01",
      "score": 1,
      "num_children": 0,
      "author": 223210,
      "replies": []
    },
    {
      "id": "i9ehavt",
      "text": "The Satanic Temple is problematic in its own way.",
      "timestamp": "2022-05-21 01:43:18",
      "score": 1,
      "num_children": 0,
      "author": 322636,
      "replies": []
    },
    {
      "id": "i9em137",
      "text": "Can I order one?",
      "timestamp": "2022-05-21 02:24:23",
      "score": 1,
      "num_children": 0,
      "author": 31682,
      "replies": []
    },
    {
      "id": "i9epr9o",
      "text": "Lol these people are such trolls",
      "timestamp": "2022-05-21 02:58:14",
      "score": 1,
      "num_children": 0,
      "author": 165155,
      "replies": []
    },
    {
      "id": "i9escam",
      "text": "This is the best thing I’ve read all day.",
      "timestamp": "2022-05-21 03:21:55",
      "score": 1,
      "num_children": 0,
      "author": 159027,
      "replies": []
    },
    {
      "id": "i9f68r8",
      "text": "Hail Satan!!",
      "timestamp": "2022-05-21 05:54:16",
      "score": 1,
      "num_children": 0,
      "author": 252499,
      "replies": []
    },
    {
      "id": "i9c9j0v",
      "text": "As much as I want to support this, the leader of the Satanic temple is wildly anti-Semitic and hangs with neo-Nazis ☹️\n\n[Examples](https://groups.io/g/psnews/topic/doug_mesner_lucien_greaves/79030986?p=%2C%2C%2C20%2C0%2C0%2C0%3A%3Arecentpostdate%2Fsticky%2C%2C%2C20%2C2%2C0%2C79030986&fbclid=IwAR2Pproxierbd0SH8x5-739JEFIKjPuO83q2L_-XqyWSb-dXg_gqQnh7crQ)",
      "timestamp": "2022-05-20 15:31:02",
      "score": -40,
      "num_children": 4,
      "author": 193186,
      "replies": [
        {
          "id": "i9cis9b",
          "text": "Anti-theistic, not anti-semitic, and he's since stated that those comments don't reflect his current views. [See article with official statement from TST here.](https://stephenbradfordlong.com/2020/05/21/why-i-havent-left-the-satanic-temple/)\n\nThat was about 20 years ago. People can change a lot in 20 years.",
          "timestamp": "2022-05-20 16:31:41",
          "score": 22,
          "num_children": 1,
          "author": 345655,
          "replies": [
            {
              "id": "i9cmrof",
              "text": "When the podcast got republished in 2013, Greaves actually provided the illustrations for it. So he still seem to be ok with what was said in the interview 9 years ago. Greaves has/had a eugenics blog (renamed it but still ideologically eugenics). Not to mention, they hired Marc Randazza as their lawyer only 4 years ago. a known neo-Nazi. A few TST chapters have actually left and chapter heads resigning because of more of these things coming to light. I do think that TST is doing great stuff. But all this other bs is problematic. I think we should be critiquing this stuff if we intend to support it.\n[This article](https://medium.com/@queersatanic/why-you-havent-left-the-satanic-temple-4ad5c79a15e8) is a really good (albeit lengthy) critique on the TST public statement.",
              "timestamp": "2022-05-20 16:57:41",
              "score": -10,
              "num_children": 2,
              "author": 193186,
              "replies": [
                {
                  "id": "i9cp0sy",
                  "text": "> When the podcast got republished in 2013, Greaves actually provided the illustrations for it.\n\nYou don't illustrate a podcast. You're talking about the book *Might is Right*, which is note-worthy to Satanism since parts of it were included in The Satanic Bible.\n\nThis was still prior to the founding of TST, which represents a sea change in his views on religion.\n\n>  Greaves has/had a eugenics blog (renamed it but still ideologically eugenics).\n\nDo you have any samples of the writing from that blog?\n\n> Not to mention, they hired Marc Randazza as their lawyer only 4 years ago. a known neo-Nazi.\n\nKnown by whom? What's the evidence?\n\nAlso, he wasn't hired. He offered to work pro bono (in other words, for free).",
                  "timestamp": "2022-05-20 17:12:42",
                  "score": 16,
                  "num_children": 1,
                  "author": 345655,
                  "replies": [
                    {
                      "id": "i9e29f8",
                      "text": "So, look at my post history, and please don't mistake me. I don't think any of what the user you're responding to is anti semitism - I think any anti-theist will eventually say something that can be misconstrued for true anti semitism.\n\nI think what a lot of ignorant people focus on is how Rendazza has undeniably defended a lot of [right wing extremists.](https://en.m.wikipedia.org/wiki/Marc_Randazza)\n\n>Randazza represents multiple far-right figures, including conspiracy theorists Alex Jones, Mike Cernovich, and Chuck Johnson; and neo-Nazi, white supremacist, antisemitic conspiracy theorist Andrew Anglin.[11][12][13] Randazza defended a participant in the planning of the violent Unite the Right rally who used the pseudonym \"Kristall.night\" (cf. Kristallnacht). Kristall.night claimed that a federal subpoena against the app Discord following the deadly rally would reveal her identity and expose her to potential harm through doxing.[14]\n\n>Randazza has defended Anglin in a lawsuit filed by a Jewish realtor in Whitefish, Montana, whom Anglin had published the name and address of on his neo-Nazi website The Daily Stormer. Randazza had argued that Anglin was not responsible for the subsequent harassment and death threats the woman received, as the personal information was protected as free speech. This claim was rejected by U.S. District Court Judge Dana L. Christensen, who noted that Anglin was actively encouraging and participating in the plaintiff's harassment, and that calls to violence against a private individual are not protected speech.[15][16]\n\nI'm not saying that constitutes him as an antisemite, everyone has a right to a lawyer and free speech is extremely difficult to talk about much less defend. Stochastic terrorism also has a very fine understanding and isn't illegal, but we all know the right wing extremists do it in their main stream media.\n\nEven the ACLU has \"protected\" Nazis in free speech cases.\n\nHowever, that being said, I could never defend Alex Jones or other extremists who hate that different people have the same freedoms.\n\nFree speech is tough, because it's IMPERATIVE that any impositions on free speech can't be used against people who aren't hateful extremists that just want better for all people. I honestly do think that the stereotypical free speech lawyer recognizes that potential spiral, and genuinely thinks they're stopping that.\n\nAlas, the right wing extremists always hide behind plausible deniability, though.",
                      "timestamp": "2022-05-20 23:30:42",
                      "score": 2,
                      "num_children": 0,
                      "author": 35328,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i9dzlu9",
                  "text": "If you're anti-religion wouldn't you also say things that could be misperceived as antisemitic? I absolutely think the two are different but have a nebulous overlap. I mean, an antisemite would not say\n\n>it’s not okay to hate somebody [‘born of Jewish blood’] just because their parents were stupid fuckin’ Jews and wore stupid frisbies on their head and thought the Jews were God’s chosen people\n\nNothing in your io link read as \"exterminate all Jews\" or had the actual Nazi rhetoric like, \"blood and soil\" or conspiracy rhetoric. In fact, Christianity - [especially evangelical](https://www.ushmm.org/collections/bibliography/christianity-and-the-holocaust) - made up the majority of Nazism. A sentiment which parallels today where there's a few neo-nazi groups that [even put \"Jesus\" or \"church\" in their group today.](https://www.splcenter.org/fighting-hate/extremist-files/ideology/neo-nazi)\n\nI mean, do you really put Lucian's words in the same camp as [these people](https://www.adl.org/resources/backgrounders/christian-identity)?\n\nI would say it's mostly ignorant, but I don't think it qualifies as the same hate/antisemitism you see from *Christian* Nazis, and I think you're crusade to paint this as such more enables the literal Nazis than it makes me skeptical of someone fighting for freedom FROM religion as a part of the first amendment.\n\nYour intentions are dubious to me at this time.",
                  "timestamp": "2022-05-20 23:08:15",
                  "score": 3,
                  "num_children": 0,
                  "author": 35328,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i9dkohv",
          "text": "Aren't essentially all religions anti-otherreligion? Let's face it, almost every religion wants the money you're donating to any other religion.",
          "timestamp": "2022-05-20 21:09:33",
          "score": 5,
          "num_children": 0,
          "author": 62498,
          "replies": []
        },
        {
          "id": "i9cfbm3",
          "text": "Shout  out to those downvoting me for pointing out these guys aren’t as great as we thought! 🤷🏻\nIdk, I was glad when someone pointed this out to me after I was sharing stuff in support.",
          "timestamp": "2022-05-20 16:09:08",
          "score": -21,
          "num_children": 1,
          "author": 193186,
          "replies": [
            {
              "id": "i9cj0v4",
              "text": "Did you bother to read TST's official statement on this? I'm sure that if you reached out to them, they would've sent it to you.",
              "timestamp": "2022-05-20 16:33:14",
              "score": 13,
              "num_children": 1,
              "author": 345655,
              "replies": [
                {
                  "id": "i9cnwou",
                  "text": "I have read it. I’ve also read critiques of the official statement. But honestly, if I wanted to get away from accusations of anti Semitism and neonazism, I wouldn’t be hiring neonazi lawyers, publicly defending neonazi journalists on altright news sites like Brietbart, and leaving conferences because a neonazi speaker was disinvited.",
                  "timestamp": "2022-05-20 17:05:16",
                  "score": -13,
                  "num_children": 1,
                  "author": 193186,
                  "replies": [
                    {
                      "id": "i9crevx",
                      "text": "Wow, you really have an axe to grind. I honestly thought that you were arguing in good faith, but I guess I was wrong.\n\nCalling people neo-Nazis without evidence is not convincing.",
                      "timestamp": "2022-05-20 17:28:52",
                      "score": 14,
                      "num_children": 0,
                      "author": 345655,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "i9cd6js",
          "text": "Oh shit. Now that's a buzzkill.",
          "timestamp": "2022-05-20 15:55:05",
          "score": -12,
          "num_children": 1,
          "author": 45651,
          "replies": [
            {
              "id": "i9cewul",
              "text": "I know :( we just can’t have nice things.",
              "timestamp": "2022-05-20 16:06:26",
              "score": -8,
              "num_children": 0,
              "author": 193186,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9cg7lu",
      "text": "I’m torn. \n\nYes there should definitely be a separation of church and state, but the article says their was backlash from the locals when the motto was removed. \n\nThere was a 3-2 vote to have it restored, but does that reflect the feelings of the community overall? Isn’t this something they should put in a ballot?",
      "timestamp": "2022-05-20 16:14:59",
      "score": -21,
      "num_children": 2,
      "replies": [
        {
          "id": "i9chyya",
          "text": "> but the article says their was backlash from the locals when the motto was removed. \n\nThe separation of church and state is not when it's convenient or popular; it's the law. When the police and local governments ignore the law then what chance do we \"mere citizens\" who rely on the law to survive have in this country?",
          "timestamp": "2022-05-20 16:26:27",
          "score": 34,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i9cycqt",
          "text": "Well, they got what they wanted and they are now able to put religious symbols and phrases on the car. So then what's the problem? If you support the people's will, here it is. Don't know what's to be on the fence about. 3-2 voted for it to be brought back.",
          "timestamp": "2022-05-20 18:19:18",
          "score": 5,
          "num_children": 1,
          "author": 405442,
          "replies": [
            {
              "id": "i9dk3fd",
              "text": "All Hail Satan! When one religion gets to be promoted through public advertisement then all are eligible for the same benefit. Allah Akbar!",
              "timestamp": "2022-05-20 21:05:01",
              "score": 5,
              "num_children": 0,
              "author": 62498,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9d7rn6",
      "text": "[deleted]",
      "timestamp": "2022-05-20 19:32:34",
      "score": -13,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9dtgs7",
      "text": "I love how a small town is getting bullied because of a decal they have on cop cars……..you did it guys! You beat a disappearing town!",
      "timestamp": "2022-05-20 22:18:04",
      "score": -13,
      "num_children": 0,
      "author": 305751,
      "replies": []
    },
    {
      "id": "i9cy606",
      "text": "As a Baptist, I like that TST(Still jarring) is known for good stuff, but I don't think I'll ever be ok with the whole Hail Satan thing or any of the satanic stuff even, 🤷🏾‍♂️",
      "timestamp": "2022-05-20 18:17:53",
      "score": -15,
      "num_children": 3,
      "replies": [
        {
          "id": "i9dfto9",
          "text": "the point is to be jarring to people who write laws that give preference to Christianity. And to make them feel like removing religion from laws or government funded places is the best solution since the satanic temple will fight in court over this sort of stuff.",
          "timestamp": "2022-05-20 20:32:41",
          "score": 7,
          "num_children": 1,
          "author": 121406,
          "replies": [
            {
              "id": "i9dh6vx",
              "text": "I was talking about me mostly....but fair and true. It jarring for me just cause since I was a kid I had this instilled idea that anything Satan is evil and those  who worship him are probably trying to sacrifice me to a goat. It's jarring to figure out that's not the case actually...mostly.",
              "timestamp": "2022-05-20 20:42:57",
              "score": -2,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i9dka8m",
          "text": "> I don't think I'll ever be ok with the whole Hail Satan thing or any of the satanic stuff even, 🤷🏾‍♂️\n\nAnd that's OK. But when public dollars are spent advertising one religion/dogma then all are eligible for the same benefit. Hail Satan! Allah Akbar!",
          "timestamp": "2022-05-20 21:06:28",
          "score": 5,
          "num_children": 0,
          "author": 62498,
          "replies": []
        },
        {
          "id": "i9d45tl",
          "text": "Hail Satan, friend. \n\nCan I interest you in the Glory of Eternal Damnation? Have you ever wondered where your  eternal soul will go? Who you will spend eternity with? Do you want to spend eternity with Bigots and Hitler, or would you rather spend a life in Hell with Rock Music, and Party People? \n\n&#x200B;\n\nThe Choice is yours of course. \n\n&#x200B;\n\n;p \n\n&#x200B;\n\nHere is some Church Music: https://youtu.be/mklMSwlapzk",
          "timestamp": "2022-05-20 19:04:45",
          "score": 12,
          "num_children": 1,
          "author": 194087,
          "replies": [
            {
              "id": "i9da8mk",
              "text": "You know I didn't say I actually have a problem with yall, also not religious enough to be trigger at...this display of hospitality. My up bringing is why I feel uncomfortable with the whole Satan thing or imagery, but I'm not gonna be like you, I'm not gonna get rude and such. \n\nTST does good work, but seems even they have people like yourself. Stay blessed",
              "timestamp": "2022-05-20 19:50:44",
              "score": -6,
              "num_children": 1,
              "replies": [
                {
                  "id": "i9ddlad",
                  "text": "Oh I'm purely an Atheist, and a Goth. I was just doing what Xtians, esp Baptists do to me every time they see me. As you can't go 5 feet in public without someone saying \"Well As a Christian...\" this, \"Well Jesus...\" that. If you're not religious, then don't lead with \"As a Baptist...\" because you open yourself to the same treatment everyone else receives for not being a Christian. Equal Treatment for equal acts. \n\n&#x200B;\n\nAlso, FYI I did not down vote you, as I refuse to down vote others unless it's  a block worthy event. As long as you see me, you get no down votes from me.",
                  "timestamp": "2022-05-20 20:15:49",
                  "score": 9,
                  "num_children": 1,
                  "author": 194087,
                  "replies": [
                    {
                      "id": "i9dghdd",
                      "text": "My bad, I just wanted people to know off rip that I know next to nothing about this or TST *Also haven't been a church in 6years*, but I still like what they do and the overall message, just the imagery and stuff is unsettling for me. Also wrong people do what they do to you, but IMO you shouldn't feel obligated to do it right back. Just my opinion.\n\nI generally just believe there monsters and evil people in every walk of life and generalizing groups is detrimental to the idea of acceptance and understanding.",
                      "timestamp": "2022-05-20 20:37:38",
                      "score": -5,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i9e9ddb",
                          "text": "So, something that I try and instill in most people around me is the misperception of characteristics and the stigma of \"evil.\" My mom uses \"evil\" to describe her political \"enemies\" way too often, and my mom is emotionally abusive to my dad. It's extremely frustrating.\n\nTypically we all identify with all types of characteristics. I'm ADHD, and I always see people saying, \"I do that! I didn't know I was ADHD!\" Well, the difference is that I do that dozens of times a day while they do it once in a while.\n\nThe same exists for the [dark triad](https://en.m.wikipedia.org/wiki/Dark_triad) characteristics. The extent in which they do shitty things is just more often than the rest of us. The problem with the stigma of \"evil\" is that people are more likely to fall into their stigma than to fight out of it.\n\nAlso, if I say, for example, \"Trump is evil,\" I've just effectively made 28% of the population roll their eyes and ignore me.",
                          "timestamp": "2022-05-21 00:32:59",
                          "score": 1,
                          "num_children": 0,
                          "author": 35328,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9d8i18",
      "text": "[removed]",
      "timestamp": "2022-05-20 19:38:01",
      "score": -25,
      "num_children": 2,
      "replies": [
        {
          "id": "i9dbb01",
          "text": "They don't actually believe in or worship Satan. The Satanic church is all about logical explanation for stuff and has zero to do with worshipping any imagery deity.",
          "timestamp": "2022-05-20 19:58:45",
          "score": 15,
          "num_children": 1,
          "author": 317263,
          "replies": [
            {
              "id": "i9dvqkm",
              "text": "[removed]",
              "timestamp": "2022-05-20 22:36:27",
              "score": -8,
              "num_children": 2,
              "replies": [
                {
                  "id": "i9dxmo1",
                  "text": "Well the name is intended to be shocking and get people interested. Had they called it the church of logical and informed critical thinking it would be less popular by far.\n \nAlso, theologically speaking in the Bible Satan isn't the bad guy. God has either commanded or allowed, in his name, multitudes of innocent people to be murdered. \nSatan simply questions gods plan and is banished? \n Hmm, sounds like the omniscient one has a bit of an ego problem.",
                  "timestamp": "2022-05-20 22:51:57",
                  "score": 6,
                  "num_children": 0,
                  "author": 317263,
                  "replies": []
                },
                {
                  "id": "i9fchvf",
                  "text": "Wow really proving right here that not all atheists are smart lmao.",
                  "timestamp": "2022-05-21 07:21:38",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i9faba8",
          "text": "The entire point is to be antithetical to Christianity, because that's how you ensure that all religions are treated equally, not just the ones that Christians find to be relatively inoffensive.\n\nThat's how they protect the First Amendment in this country.",
          "timestamp": "2022-05-21 06:50:28",
          "score": 4,
          "num_children": 1,
          "author": 78164,
          "replies": [
            {
              "id": "i9pg0r5",
              "text": "[removed]",
              "timestamp": "2022-05-23 17:28:55",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "i9ph0ey",
                  "text": "Are you just not understanding the point of what they do? It's not just trolling. It's ensuring that a religion that Christians find offensive is still given the same treatment by the government that Christianity is given. \n\nIf they were just some sweet and fluffy religion that Christians didn't find offensive, then they wouldn't be effective at ensuring equal treatment for all.",
                  "timestamp": "2022-05-23 17:35:56",
                  "score": 1,
                  "num_children": 1,
                  "author": 78164,
                  "replies": [
                    {
                      "id": "i9pp1gw",
                      "text": "[removed]",
                      "timestamp": "2022-05-23 18:32:44",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i9ppg79",
                          "text": "The only way people's legitimate beliefs can be protected is if the government is held accountable for treating all religions equally. It's the same argument as free speech. If you only protect speech that you don't find offensive, then you're not really protecting free speech.\n\n>It's harmful to people that are honestly and genuinely trying to worship an unusual religion\n\nNo, it's not harmful to them, it's ensuring that they are also treated equally.",
                          "timestamp": "2022-05-23 18:35:39",
                          "score": 1,
                          "num_children": 1,
                          "author": 78164,
                          "replies": [
                            {
                              "id": "i9pqrlk",
                              "text": "[removed]",
                              "timestamp": "2022-05-23 18:45:08",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "i9pr6c8",
                                  "text": ">One can't just say they need to torture puppies in front of everyone or make human sacrifices or cook and eat human fetuses, there's a lot of scenarios where 1st Amendment isn't what where talking about anymore.\n\nLol, what the hell are you talking about? That's not even remotely like what TST does. Maybe you should educate yourself a little, since you seem to have some bizarre ideas about them.\n\nYou're essentially illustrating the reason they are needed for this purpose.\n\nhttps://thesatanictemple.com/blogs/the-satanic-temple-tenets/there-are-seven-fundamental-tenets",
                                  "timestamp": "2022-05-23 18:48:06",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 78164,
                                  "replies": [
                                    {
                                      "id": "i9psnzb",
                                      "text": "[removed]",
                                      "timestamp": "2022-05-23 18:58:51",
                                      "score": 0,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "i9pvlwg",
                                          "text": ">You Satanists are responsible for people having the wrong idea then. You've given them the wrong idea on purpose, to troll them. You can't have it both ways. Worshipping \"the devil\" is the same as worshipping \"evil\", plain and simple.\n\nYou're a walking example of why it's needed. You're ok with them being treated differently, not because of anything they've actually done, but because you disagree with their beliefs. You think \"the devil\" is \"evil\". You don't bother to learn what they believe and just act on your own biases.\n\nThat's why they are effective and needed.",
                                          "timestamp": "2022-05-23 19:19:49",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 78164,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9bw4yr",
      "text": "These idiots never miss an opportunity to quit while they are ahead.",
      "timestamp": "2022-05-20 14:00:52",
      "score": -65,
      "num_children": 1,
      "author": 261515,
      "replies": [
        {
          "id": "i9c12dw",
          "text": "Evangelicals, right?... Right?",
          "timestamp": "2022-05-20 14:34:45",
          "score": 42,
          "num_children": 1,
          "author": 136418,
          "replies": [
            {
              "id": "i9cktmo",
              "text": "I'm an atheist, this is an atheist forum. I don't understand why atheists would embrace satanism -- one stupid pile of shit gets replaced by an even dumber pile of shit. So, no, I am not a cheerleader for any of them.",
              "timestamp": "2022-05-20 16:44:54",
              "score": -32,
              "num_children": 1,
              "author": 261515,
              "replies": [
                {
                  "id": "i9cnfxz",
                  "text": "I think you would do yourself a great service by looking up The Satanic Temple, what their mission statement and purpose is and why so many agnostics/atheists support them.\n\nThey don't actually support Satan, or even believe in his existence. It's simply a counterpoint to theists overreach with their own deity.",
                  "timestamp": "2022-05-20 17:02:10",
                  "score": 17,
                  "num_children": 1,
                  "author": 28596,
                  "replies": [
                    {
                      "id": "i9cnyw8",
                      "text": "I've seen it, also personally know Satanists. Biggest bunch of GD liars anyone can come up with. When you confront them, it's like the little girl saving the snake.",
                      "timestamp": "2022-05-20 17:05:39",
                      "score": -31,
                      "num_children": 2,
                      "author": 261515,
                      "replies": [
                        {
                          "id": "i9cohb2",
                          "text": "What are you even talking about? \n\nAgain, do some research because you're embarrassing yourself here.\n\nThere are people who believe in the actual Devil, who is named in the Bible. Those people are as confused and deluded as theists.\n\n The Satanic Church however, is not the same thing.",
                          "timestamp": "2022-05-20 17:09:04",
                          "score": 19,
                          "num_children": 1,
                          "author": 28596,
                          "replies": [
                            {
                              "id": "i9cq4of",
                              "text": "A fool is a fool, no matter what they claim to be otherwise. You're free to be a cheerleader for them. Just not my cup of tea.",
                              "timestamp": "2022-05-20 17:20:11",
                              "score": -8,
                              "num_children": 1,
                              "author": 261515,
                              "replies": [
                                {
                                  "id": "i9d28uh",
                                  "text": "[removed]",
                                  "timestamp": "2022-05-20 18:49:38",
                                  "score": 4,
                                  "num_children": 2,
                                  "replies": [
                                    {
                                      "id": "i9da1lm",
                                      "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for using abusive language, personal attacks, being a dick, or fighting with other users. These activities are against the [rules](https://www.reddit.com/r/atheism/wiki/guidelines).   \r\nConnected comments may also be removed for the same reason, though editing out the direct attack may merit your comment being restored.  Users who don't cease this behavior may get banned temporarily or permanently.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                                      "timestamp": "2022-05-20 19:49:16",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 122319,
                                      "replies": []
                                    },
                                    {
                                      "id": "i9d2ze2",
                                      "text": "[removed]",
                                      "timestamp": "2022-05-20 18:55:25",
                                      "score": 0,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "i9d72i3",
                                          "text": "[removed]",
                                          "timestamp": "2022-05-20 19:27:16",
                                          "score": 2,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "i9da3yo",
                                              "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for using abusive language, personal attacks, being a dick, or fighting with other users. These activities are against the [rules](https://www.reddit.com/r/atheism/wiki/guidelines).   \r\nConnected comments may also be removed for the same reason, though editing out the direct attack may merit your comment being restored.  Users who don't cease this behavior may get banned temporarily or permanently.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                                              "timestamp": "2022-05-20 19:49:45",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 122319,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i9dagog",
                          "text": "No you don't.",
                          "timestamp": "2022-05-20 19:52:23",
                          "score": 6,
                          "num_children": 0,
                          "author": 269419,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9davbc",
      "text": "[removed]",
      "timestamp": "2022-05-20 19:55:27",
      "score": -21,
      "num_children": 2,
      "replies": [
        {
          "id": "i9dgbw3",
          "text": "Neo didn't dodge bullets in the first Matrix as well as you're dodging the point of the article.",
          "timestamp": "2022-05-20 20:36:30",
          "score": 13,
          "num_children": 0,
          "author": 73615,
          "replies": []
        },
        {
          "id": "i9dl7ut",
          "text": "If the authorities can promote YOUR god on their police cars  they damn well better promote MY god on there as well.  Hail Satan! Allah Akbar!",
          "timestamp": "2022-05-20 21:13:45",
          "score": 8,
          "num_children": 1,
          "author": 62498,
          "replies": [
            {
              "id": "iabznqf",
              "text": "[removed]",
              "timestamp": "2022-05-28 17:16:46",
              "score": 1,
              "num_children": 2,
              "replies": [
                {
                  "id": "iac010j",
                  "text": "[removed]",
                  "timestamp": "2022-05-28 17:19:39",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iac08bx",
                      "text": "[removed]",
                      "timestamp": "2022-05-28 17:21:12",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iac0u1i",
                          "text": "Have you ever heard of the concept of sarcasm? I don't want my government promoting any religion in any way; no evangelicals, no christians, no jews, no muslims, no hindus, no buddists , no satanists, no druids, etc, etc, etc.... none.",
                          "timestamp": "2022-05-28 17:25:59",
                          "score": 1,
                          "num_children": 0,
                          "author": 62498,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iac95db",
                  "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                  "timestamp": "2022-05-28 18:32:40",
                  "score": 1,
                  "num_children": 0,
                  "author": 136356,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9dux8y",
      "text": "Honestly pretty cringe",
      "timestamp": "2022-05-20 22:29:49",
      "score": -13,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9czjvy",
      "text": "Wtf is this headline Jesus Christ",
      "timestamp": "2022-05-20 18:28:32",
      "score": -11,
      "num_children": 0,
      "author": 283082,
      "replies": []
    },
    {
      "id": "i9dmhby",
      "text": "It's weird how people on reddit claim to hate religion, but always exclude judism and satanism. \n\nReddit almost seems to cheer for satanism.",
      "timestamp": "2022-05-20 21:23:30",
      "score": -10,
      "num_children": 1,
      "replies": [
        {
          "id": "i9do0nq",
          "text": "Reddits population is largely American. Compared to Christianity, Jewish people aren’t nearly as prevalent in the USA, hence why you don’t hear about it as much. \n\nAlso these satanists are actually atheist. They’re just trying to highlight how absurd it is to include one religion(Christianity) in government.\n\nA lot of people aren’t Christian and think your god should have nothing to do with govt. much the same way you think satan should have nothing to do with the govt. \n\nThe obvious solution is to keep ALL religion out of govt, but you Christian snowflakes won’t let that happen 😂",
          "timestamp": "2022-05-20 21:35:27",
          "score": 9,
          "num_children": 1,
          "replies": [
            {
              "id": "i9dsl50",
              "text": "Except I'm not religious, I just find the hypocrisy horrid",
              "timestamp": "2022-05-20 22:11:02",
              "score": -8,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9dmjqs",
      "text": "The satanic temple is such a joke, they aren’t even real satanists",
      "timestamp": "2022-05-20 21:24:01",
      "score": -9,
      "num_children": 1,
      "author": 41781,
      "replies": [
        {
          "id": "i9dwk4w",
          "text": "Do they have to believe in the Christian satan to be satanists?\n\nWouldn't that just make them Christians?",
          "timestamp": "2022-05-20 22:43:08",
          "score": 5,
          "num_children": 1,
          "author": 35328,
          "replies": [
            {
              "id": "i9eo0dg",
              "text": "True satanists don’t believe in satan",
              "timestamp": "2022-05-21 02:42:24",
              "score": 2,
              "num_children": 1,
              "author": 41781,
              "replies": [
                {
                  "id": "i9eq73b",
                  "text": "Yeah, that's Christians. Pretty much always has been.",
                  "timestamp": "2022-05-21 03:02:06",
                  "score": 2,
                  "num_children": 0,
                  "author": 35328,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9dubxf",
      "text": "TST, destroying satanism one publicity stunt after the other.",
      "timestamp": "2022-05-20 22:25:01",
      "score": -9,
      "num_children": 0,
      "author": 245125,
      "replies": []
    },
    {
      "id": "i9d01ir",
      "text": "[removed]",
      "timestamp": "2022-05-20 18:32:25",
      "score": -7,
      "num_children": 4,
      "replies": [
        {
          "id": "i9d3r6d",
          "text": "Burning where?",
          "timestamp": "2022-05-20 19:01:32",
          "score": 9,
          "num_children": 1,
          "author": 53259,
          "replies": [
            {
              "id": "i9d4xhn",
              "text": "In this freaking heatwave...",
              "timestamp": "2022-05-20 19:10:48",
              "score": 4,
              "num_children": 0,
              "author": 208178,
              "replies": []
            }
          ]
        },
        {
          "id": "i9d3u67",
          "text": "I can't believe that you would purposely go to an atheist subreddit and spout off empty pro- religious threats to people that don't believe like you do.",
          "timestamp": "2022-05-20 19:02:12",
          "score": 5,
          "num_children": 0,
          "author": 20557,
          "replies": []
        },
        {
          "id": "i9dad9o",
          "text": "See you down there 😎",
          "timestamp": "2022-05-20 19:51:40",
          "score": 3,
          "num_children": 0,
          "author": 269419,
          "replies": []
        },
        {
          "id": "i9daj23",
          "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
          "timestamp": "2022-05-20 19:52:52",
          "score": 1,
          "num_children": 0,
          "author": 122319,
          "replies": []
        }
      ]
    },
    {
      "id": "i9es09a",
      "text": "How are you an atheist if you celebrate this? No, you all are not atheists, you’re anti-christians. Just call it like it is.",
      "timestamp": "2022-05-21 03:18:48",
      "score": -8,
      "num_children": 1,
      "author": 43732,
      "replies": [
        {
          "id": "i9fcbcu",
          "text": "You clearly don't understand what the Satanic temple is or the reasons they do what they do if that's your take.",
          "timestamp": "2022-05-21 07:19:04",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i9cnwoy",
      "text": "Zero chance they will get onto the cruisers. ~~Given~~ Giving 10/1 odds. Any takers? I thought not.",
      "timestamp": "2022-05-20 17:05:16",
      "score": -5,
      "num_children": 1,
      "author": 48091,
      "replies": [
        {
          "id": "i9dkyap",
          "text": "It may take a lawsuit but if the local administration insists on free advertising for their preferred religion being displayed a lawsuit will enforce that the same benefit be provided to any religion.",
          "timestamp": "2022-05-20 21:11:40",
          "score": 8,
          "num_children": 1,
          "author": 62498,
          "replies": [
            {
              "id": "i9fhsak",
              "text": "10 to one odds...",
              "timestamp": "2022-05-21 08:41:41",
              "score": 1,
              "num_children": 1,
              "author": 48091,
              "replies": [
                {
                  "id": "i9ftnpv",
                  "text": "What typically happens is that the local administration removes the free advertising for their preferred religion so they don't have to display free advertisements for the religions they like to discriminate against.",
                  "timestamp": "2022-05-21 11:35:58",
                  "score": 2,
                  "num_children": 0,
                  "author": 62498,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9d8hnt",
      "text": "If I say it, will they cash app me $10 for a pizza, because I'm homeless and hungry.",
      "timestamp": "2022-05-20 19:37:57",
      "score": -6,
      "num_children": 0,
      "author": 98225,
      "replies": []
    },
    {
      "id": "i9de7hu",
      "text": "That'll show em.",
      "timestamp": "2022-05-20 20:20:31",
      "score": -7,
      "num_children": 0,
      "author": 2321,
      "replies": []
    },
    {
      "id": "i9exmqz",
      "text": "You're all mentally 14 forever",
      "timestamp": "2022-05-21 04:13:47",
      "score": -6,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9f4e00",
      "text": "ew",
      "timestamp": "2022-05-21 05:30:57",
      "score": -6,
      "num_children": 1,
      "author": 84941,
      "replies": [
        {
          "id": "i9fc8y0",
          "text": "cope",
          "timestamp": "2022-05-21 07:18:07",
          "score": 4,
          "num_children": 1,
          "replies": [
            {
              "id": "i9fcafg",
              "text": "eh not my thing",
              "timestamp": "2022-05-21 07:18:42",
              "score": 0,
              "num_children": 0,
              "author": 84941,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9dlr8x",
      "text": "To be fair... wait, is this referring to \"In God We Trust\"?",
      "timestamp": "2022-05-20 21:17:57",
      "score": -5,
      "num_children": 0,
      "author": 102312,
      "replies": []
    },
    {
      "id": "i9dr1c2",
      "text": "[removed]",
      "timestamp": "2022-05-20 21:58:48",
      "score": -4,
      "num_children": 1,
      "replies": [
        {
          "id": "i9dx511",
          "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
          "timestamp": "2022-05-20 22:47:56",
          "score": 1,
          "num_children": 0,
          "author": 122319,
          "replies": []
        }
      ]
    },
    {
      "id": "i9eeto3",
      "text": "What a waste. So stupid",
      "timestamp": "2022-05-21 01:21:41",
      "score": -4,
      "num_children": 0,
      "author": 144485,
      "replies": []
    }
  ]
}