{
  "id": "uvwlwt",
  "text": "But I guess men are the evil ones\n",
  "timestamp": "2022-05-23 09:51:23",
  "score": 612,
  "subreddit": "t5_2zaj2",
  "num_children": 16,
  "author": 400790,
  "replies": [
    {
      "id": "i9ouivh",
      "text": "I love that reddit allows reposting to other subreddits. I would have never heard of NoahGetTheDeathStar otherwise. What a cool sub!",
      "timestamp": "2022-05-23 14:57:37",
      "score": 35,
      "num_children": 0,
      "author": 256140,
      "replies": []
    },
    {
      "id": "i9pwl3k",
      "text": "This is what Feminists want our society to become. Kill men and children (especially boys) while they get a pat on the back.",
      "timestamp": "2022-05-23 19:26:41",
      "score": 15,
      "num_children": 1,
      "author": 332264,
      "replies": [
        {
          "id": "ia3flwg",
          "text": "...What?",
          "timestamp": "2022-05-26 18:13:17",
          "score": -1,
          "num_children": 0,
          "author": 129020,
          "replies": []
        }
      ]
    },
    {
      "id": "i9o2wm0",
      "text": "I despise this clown world. Even jurists are snowflakes now?",
      "timestamp": "2022-05-23 10:42:36",
      "score": 71,
      "num_children": 1,
      "replies": [
        {
          "id": "i9o5nce",
          "text": "[deleted]",
          "timestamp": "2022-05-23 11:16:56",
          "score": 18,
          "num_children": 1,
          "replies": [
            {
              "id": "i9pp4fm",
              "text": "Jurist- An expert in or writer of law, a lawyer or judge.",
              "timestamp": "2022-05-23 18:33:19",
              "score": 3,
              "num_children": 0,
              "author": 186636,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9omak3",
      "text": "Criticize the British noble that gave her custody? How dare you!",
      "timestamp": "2022-05-23 13:55:21",
      "score": 23,
      "num_children": 0,
      "author": 402485,
      "replies": []
    },
    {
      "id": "i9opkgf",
      "text": "Family Law courts host the most rediculous, evil, peice of shit judges you will ever find on this planet.",
      "timestamp": "2022-05-23 14:20:50",
      "score": 25,
      "num_children": 1,
      "author": 4980,
      "replies": [
        {
          "id": "i9q7sap",
          "text": "What about the female judge who was caught on recording saying shed lock as many people up as she could to compete with her dad who was a judge. She was forced out, then became a juvenile court judge.",
          "timestamp": "2022-05-23 20:47:03",
          "score": 6,
          "num_children": 0,
          "author": 377461,
          "replies": []
        }
      ]
    },
    {
      "id": "i9pfk2l",
      "text": "Look, this is a pretty old example, and not really a good one. A much better one is where the mom was given custody despite social worker’s concerns that were registered in court, and then she murdered her son. \n\nThis is not really as clearcut, and doesn’t really give the message the title of the article says. It’s misleading, and it does us no good to mislead anyone",
      "timestamp": "2022-05-23 17:25:42",
      "score": 9,
      "num_children": 0,
      "author": 312684,
      "replies": []
    },
    {
      "id": "i9o6706",
      "text": "[deleted]",
      "timestamp": "2022-05-23 11:23:18",
      "score": 16,
      "num_children": 1,
      "replies": [
        {
          "id": "i9odau7",
          "text": "Yeah the only way I could see the mother being a murderer is if there was some kind of child endangerment/neglect going on.   And/or if she exhibited reckless indifference while the child was in her care.  Not knowing all the facts of the case makes it difficult, though.",
          "timestamp": "2022-05-23 12:38:08",
          "score": 5,
          "num_children": 1,
          "author": 250768,
          "replies": [
            {
              "id": "i9oez40",
              "text": "[deleted]",
              "timestamp": "2022-05-23 12:53:38",
              "score": 13,
              "num_children": 1,
              "replies": [
                {
                  "id": "i9p2bry",
                  "text": "Take note, if you will.\n\nThis line of comments goes against the narrative that the article's title was trying to represent. However, these commenters are neither banned nor silenced. The discussion is allowed to continue.\n\nNow compare the same situation in some other subreddit; you know the ones I'm talking about. You can't even word a modicum of disagreement before the ban hammer is dropped.\n\nI am proud of all of you; this is how the free world must be.",
                  "timestamp": "2022-05-23 15:53:27",
                  "score": 10,
                  "num_children": 1,
                  "author": 29780,
                  "replies": [
                    {
                      "id": "i9przp2",
                      "text": "Excellent take on dissenting opinions, you may get hammered for it, but it’s allowed",
                      "timestamp": "2022-05-23 18:54:01",
                      "score": 2,
                      "num_children": 1,
                      "author": 219005,
                      "replies": [
                        {
                          "id": "i9q5cj1",
                          "text": "The way I see it, the power to silence a person's words, no matter how stupid or offensive, is a power no one should have. Once you start to sensor people, the game is over.",
                          "timestamp": "2022-05-23 20:29:21",
                          "score": 4,
                          "num_children": 1,
                          "author": 29780,
                          "replies": [
                            {
                              "id": "i9qc0oy",
                              "text": "Even better",
                              "timestamp": "2022-05-23 21:18:23",
                              "score": 2,
                              "num_children": 0,
                              "author": 219005,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9o5e19",
      "text": "According to the comments from that cross post there, he was actually arrested for sending thinly-veiled death threats to the judge and her family. I'm all for equal representation and rights, but this ain't it.",
      "timestamp": "2022-05-23 11:13:48",
      "score": 4,
      "num_children": 0,
      "author": 292047,
      "replies": []
    },
    {
      "id": "i9pdkft",
      "text": "At least the prosecutor had enough sense not to charge the dad, so that’s a plus. What sane person would press charges? I’m not saying the father was right in threatening the judges life, what I am trying ask though, is why should he go to jail because he’s angry at the system that failed him this bad?",
      "timestamp": "2022-05-23 17:11:48",
      "score": 1,
      "num_children": 0,
      "author": 406881,
      "replies": []
    },
    {
      "id": "i9o3orx",
      "text": "What does this have to do with feminism? This kind of behavior from the judge is a direct symptom of traditional patriarchal views on women, that women are inherently better caregivers and are naturally disposed to child-rearing etc.",
      "timestamp": "2022-05-23 10:52:46",
      "score": -10,
      "num_children": 1,
      "author": 123487,
      "replies": [
        {
          "id": "i9ocdpi",
          "text": "That’s a fascinating take champ, do you know which woman in the 1800’s instigated the Tender Years Doctrine? And do you know which organisations fight against the presumption of equally shared parenting/custody even today? \n\nLol",
          "timestamp": "2022-05-23 12:29:17",
          "score": 9,
          "num_children": 1,
          "replies": [
            {
              "id": "i9ohtht",
              "text": "Just keep punching yourself in the face and blaming women, it's gotta work out eventually.",
              "timestamp": "2022-05-23 13:18:32",
              "score": -7,
              "num_children": 1,
              "author": 123487,
              "replies": [
                {
                  "id": "i9oi3y1",
                  "text": "Oh honey, are you conflating women with feminism? \n\nRookie error",
                  "timestamp": "2022-05-23 13:20:54",
                  "score": 9,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "i9olcxv",
                      "text": "Nope, but \"movements\" like this one absolutely do. You'd make a lot more progress if you actually acknowledged the underlying problems instead of blaming women for trying to reach equal social status.",
                      "timestamp": "2022-05-23 13:47:53",
                      "score": -5,
                      "num_children": 1,
                      "author": 123487,
                      "replies": [
                        {
                          "id": "i9omljb",
                          "text": "“Equal social status”.\n\nAs in held equally accountable? Or recognised as equally powerful? Lol",
                          "timestamp": "2022-05-23 13:57:48",
                          "score": 8,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i9oo8dj",
                              "text": "Both, social equality is social equality. That's feminism. What you're fighting for currently is to conserve the very systems and cultural artefacts that produce the problems you claim to want to address.\n\nYou're destined to keep chasing your tail until you can come to terms with misogyny, the legacy of patriarchy and the toxic gender concepts it has embedded in our culture.",
                              "timestamp": "2022-05-23 14:10:28",
                              "score": 2,
                              "num_children": 2,
                              "author": 123487,
                              "replies": [
                                {
                                  "id": "i9opqpa",
                                  "text": "What is patriarchy?",
                                  "timestamp": "2022-05-23 14:22:07",
                                  "score": 5,
                                  "num_children": 0,
                                  "replies": []
                                },
                                {
                                  "id": "i9ordho",
                                  "text": "We know you're dumb enough to actually believe femtard rhetoric but why do your types insist on coming here to spew your lies?",
                                  "timestamp": "2022-05-23 14:34:27",
                                  "score": 4,
                                  "num_children": 2,
                                  "author": 363560,
                                  "replies": [
                                    {
                                      "id": "i9orpfo",
                                      "text": "Shhh let him talk his way into a corner, he’ll stop responding soon enough, just wait",
                                      "timestamp": "2022-05-23 14:36:53",
                                      "score": 3,
                                      "num_children": 0,
                                      "replies": []
                                    },
                                    {
                                      "id": "i9osnds",
                                      "text": "Never mind, he gave up early, lol",
                                      "timestamp": "2022-05-23 14:43:50",
                                      "score": 3,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "i9p6esb",
                      "text": "What do you think feminism is? This sub cherrypicks the worst of humanity and says \"see! Feminism is bad!\" \n\nYou might get more traction if you stop treating it as a monolithic evil source of all your woes. Unless you truly believe that women shouldn't vote, be taught to read, or be allowed out if the house, then you are a feminist of some kind. \n\nIf you are mad about the behavior of trash, then you aren't alone. Call out the trash and we will support you. Call people \"honey\" as a way to dismiss someone and we will assume you are an incel troglodyte and treat you accordingly.",
                      "timestamp": "2022-05-23 16:22:02",
                      "score": -1,
                      "num_children": 1,
                      "author": 91298,
                      "replies": [
                        {
                          "id": "i9p8loi",
                          "text": "Oh I know what feminism is babe. In all likelihood, *you don’t.*\n\nYou might actually have a meaningful conversation with an anti-feminist if you didn’t assume anti-feminism is an ideology unto itself; where feminists cry “patriarchy”, anti-feminists don’t cry “matriarchy” — we just call out feminist patriarchy as bullshit, lol.\n\nI’ve tried having civil conversations with feminists for years but you folks never come to the table with anything resembling intellectual honesty. So I’m tired of it, I’m tired of you, and I’m tired of all your comrades.\n\nPeople and society were here first; and feminism second. If you want any of us to take your rhetoric seriously then you better be prepared to back it up. “Patriarchy” is not some basic truth that feminism pretends, and until you substantiate and prove it nothing else born of feminist ideology matters.",
                          "timestamp": "2022-05-23 16:37:14",
                          "score": 3,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9qirls",
      "text": "She looks like my mother... I guess psychopaths have similar facial features or similar expressions.",
      "timestamp": "2022-05-23 22:10:03",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9ydth3",
      "text": "what the actual hell, this is the second post ive seen that legit pisses me off, i cant even imagine how this is even a thing, was the judge atleast fired",
      "timestamp": "2022-05-25 16:44:13",
      "score": 1,
      "num_children": 0,
      "author": 184863,
      "replies": []
    },
    {
      "id": "iac3mey",
      "text": "As a man careful being in that court they will accuse you instead of any of the participants if they run out of men to blame.",
      "timestamp": "2022-05-28 17:48:07",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iam17t3",
      "text": "Fuck the Justice system. Can you imagine how bad this guy feels",
      "timestamp": "2022-05-31 01:25:25",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ic85hnt",
      "text": "Human society needs to  be reset(except basic living beings laws and rights not human rights living being rights)",
      "timestamp": "2022-06-13 17:26:12",
      "score": 1,
      "num_children": 0,
      "author": 305824,
      "replies": []
    },
    {
      "id": "i9oxsi2",
      "text": "I Despise this counterfeit World. \n\nFucking Shithole \n\nInfinite TSUKUYOMI was much Better Madara and obito were right if only That was true!",
      "timestamp": "2022-05-23 15:21:27",
      "score": -1,
      "num_children": 0,
      "author": 38126,
      "replies": []
    }
  ]
}