{
  "id": "uw4qed",
  "text": "Feminism is a mental disorder.\n",
  "timestamp": "2022-05-23 16:53:54",
  "score": 774,
  "subreddit": "t5_2zaj2",
  "num_children": 36,
  "replies": [
    {
      "id": "i9pfa17",
      "text": "Rules for thee but not for me. If those fuckers didn't have double standards, they wouldn't have any standards at all.",
      "timestamp": "2022-05-23 17:23:45",
      "score": 155,
      "num_children": 1,
      "author": 294229,
      "replies": [
        {
          "id": "i9s5imx",
          "text": "How dare you attack the only personality trait they have?!",
          "timestamp": "2022-05-24 07:24:11",
          "score": 26,
          "num_children": 1,
          "author": 287753,
          "replies": [
            {
              "id": "iaqb9k8",
              "text": "Jesus lol killed feminism in one insult",
              "timestamp": "2022-06-01 00:53:09",
              "score": 3,
              "num_children": 0,
              "author": 220159,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9pzy1c",
      "text": "the only thing she knock out is the buffet",
      "timestamp": "2022-05-23 19:50:32",
      "score": 115,
      "num_children": 1,
      "author": 44682,
      "replies": [
        {
          "id": "i9r6l9a",
          "text": "MY MAN.",
          "timestamp": "2022-05-24 01:23:44",
          "score": 38,
          "num_children": 1,
          "author": 264296,
          "replies": [
            {
              "id": "i9rmzy3",
              "text": "Looking good!",
              "timestamp": "2022-05-24 03:41:22",
              "score": 11,
              "num_children": 0,
              "author": 18159,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9pmnly",
      "text": "What's Mediocrity for males is exceptional for females",
      "timestamp": "2022-05-23 18:15:45",
      "score": 99,
      "num_children": 2,
      "author": 187251,
      "replies": [
        {
          "id": "i9puaoy",
          "text": "Yep.  This is why the \"strong, independent woman\" is someone with nothing more than a job, car and place... like a normal adult.\n\nThe more I hear shit like that, feminism starts to really look like women are so unhappy with their choices and benefits they just want to be men.  They can't stop talking about men and their standards for being a great woman is basically being a normal, lower middle class man.  It's really starting to look like a movement of envy on top of just raw hate.\n\nThey love to say how strong they are, detailing they are just a normal man\n\nThey love to say they can do anything a man can\n\nThey love to even pretend they can compete with men in sports\n\nThey call men aggressive, but holy shit they are top level aggressive\n\nThey LOVE to say men and women are not different, but we all see plain as day they will claim differences when it suits them.  So they wanna be like men when they can gain, be line women when they can gain.  \n\nThrow on top of that in the dating world of the unreal amount of projection they toss out there.\n\nThis is why they obsess over eliminating men and doing all this shit without men (like the whole we don't need men to reproduce shit), they want to eliminate competition from men more than they want to promote women.  \n\nFeminists just wanna be men, and naturally don't know how because biology is well, biology and testosterone is a hell of a hormone, so they imitate what they think men are at their worst and covet what they want that men obtain (tech jobs, sports, childfree etc.). \n\nIMO, this is why you rarely see an overly attractive, feminine feminist.  Those women are happy being women, they don't wanna be a man, they are feminine.  I think this is why most feminists we see are so unhappy in general, they are jealous of what men have and what feminine women have (hence the \"pick me\" shit).",
          "timestamp": "2022-05-23 19:10:28",
          "score": 53,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i9ptmd1",
          "text": "Perfectly said",
          "timestamp": "2022-05-23 19:05:33",
          "score": 14,
          "num_children": 0,
          "author": 209471,
          "replies": []
        }
      ]
    },
    {
      "id": "i9polic",
      "text": "Build women up; tear men down. \nThey're so pissed he can and does bang hot 22 year olds. She couldn't land George Costanza.",
      "timestamp": "2022-05-23 18:29:33",
      "score": 72,
      "num_children": 1,
      "replies": [
        {
          "id": "i9q3a3q",
          "text": "I googled [\"Jason Alexander wife\"](https://biographymask.com/wp-content/uploads/2021/01/Daena-E-Title-smile.jpg).   \n\nMr. Alexander might have more money than his character, but it must be said Mrs. Alexander is *way* hotter than Amy Schumer",
          "timestamp": "2022-05-23 20:14:22",
          "score": 11,
          "num_children": 1,
          "author": 73494,
          "replies": [
            {
              "id": "i9sl6ah",
              "text": "Well done. \n\nYep, way hotter.",
              "timestamp": "2022-05-24 11:13:12",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9q8xh0",
      "text": "Why would anyone support Amy Schumer. She's so unfunny she started the stereotype of women not being funny",
      "timestamp": "2022-05-23 20:55:20",
      "score": 44,
      "num_children": 1,
      "author": 252521,
      "replies": [
        {
          "id": "i9qalwd",
          "text": "Women were never funny.",
          "timestamp": "2022-05-23 21:07:40",
          "score": 11,
          "num_children": 4,
          "replies": [
            {
              "id": "i9rtaks",
              "text": "Women *who become famous* are generally not funny.\n\nMet plenty who are, though. Don't base reality on Hollywood.",
              "timestamp": "2022-05-24 04:45:59",
              "score": 11,
              "num_children": 2,
              "author": 136516,
              "replies": [
                {
                  "id": "i9s896x",
                  "text": "True",
                  "timestamp": "2022-05-24 08:05:33",
                  "score": 5,
                  "num_children": 0,
                  "author": 397284,
                  "replies": []
                },
                {
                  "id": "i9y4acs",
                  "text": "Best way to put it IMO, vocal minority effect at work there like a lot of stereotypes",
                  "timestamp": "2022-05-25 15:42:10",
                  "score": 1,
                  "num_children": 0,
                  "author": 252521,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9tzu3g",
              "text": "do you like, speak to other human beings?",
              "timestamp": "2022-05-24 17:48:03",
              "score": 3,
              "num_children": 0,
              "author": 129020,
              "replies": []
            },
            {
              "id": "i9qwbwv",
              "text": "Geez, careful what you say.",
              "timestamp": "2022-05-24 00:00:07",
              "score": 7,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i9rqof4",
              "text": "If you are anything in life op, be kind.",
              "timestamp": "2022-05-24 04:18:13",
              "score": -3,
              "num_children": 1,
              "author": 82757,
              "replies": [
                {
                  "id": "i9s7drc",
                  "text": "I hope you can become a flourishing feminine  butterfly once you drop the feminist ideology.",
                  "timestamp": "2022-05-24 07:52:18",
                  "score": 5,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i9s7kr0",
                      "text": "I'd rather dig out my own eyeballs with my acrylic nails before I become your idea of how a woman should be.",
                      "timestamp": "2022-05-24 07:55:20",
                      "score": -3,
                      "num_children": 2,
                      "author": 82757,
                      "replies": [
                        {
                          "id": "i9s80ty",
                          "text": "Self harm is synonymous with feminism, be it excessive weight gain, dyeing your hair blue, gouging  ones own eyeballs and temper tantrums that end in violence. I'm seeing an unwarranted hatred/violence pattern  amongst your posts.\n\nCognitive  dissonance  is a real thing when it comes to feminism and I would  never wish harm on you. Hence hoping you break those feministic shackles and fly away.",
                          "timestamp": "2022-05-24 08:02:04",
                          "score": 7,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i9s8oel",
                              "text": "Unwarranted hatred? With everything you've posted, nothing that I've replied back has been unwarranted.\n\nStick with your generalizations, they are pretty hilarious considering I look nothing like what you consider a feminist. You clearly have no idea what sort of women you are really talking to. You jump to conclusions about self harm when you really understand nothing of what I previously said. I'd rather die then become your disgusting childlike view of what a woman should be. That's not me wishing harm on myself, that's me throwing up in my mouth about your disgusting comments.\n\nI think you need to do some deep thinking, ask yourself why you hate women so much and why you like to create false phrases and glorify virginity (pedophile behavior) and why you view women as some dainty little precious butterfly (again, pedophile behavior) and learn how to not be a weirdo in this little fantasy world you made up. I think it would really do u some good to come back down to reality.\n\nAnd you do wish harm on me. Pushing false narratives is harmful to women. Wishing I would be something other than I am is harmful to me. Let me be me and u fuck off about it.",
                              "timestamp": "2022-05-24 08:12:12",
                              "score": -4,
                              "num_children": 2,
                              "author": 82757,
                              "replies": [
                                {
                                  "id": "i9s8vne",
                                  "text": "That'll  do pig, that'll  do.",
                                  "timestamp": "2022-05-24 08:15:22",
                                  "score": 6,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "i9s950n",
                                      "text": "Aw, what an easy response to tell me you have very little brain cells left",
                                      "timestamp": "2022-05-24 08:19:22",
                                      "score": -1,
                                      "num_children": 1,
                                      "author": 82757,
                                      "replies": [
                                        {
                                          "id": "i9s96m4",
                                          "text": "Just enough to expose Phantom Rape.",
                                          "timestamp": "2022-05-24 08:20:04",
                                          "score": 5,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "i9s9au7",
                                              "text": "Ya, you used your last remaining braincell to make up some trigger phrase. And it shriveled up and died as soon as u said it out loud.",
                                              "timestamp": "2022-05-24 08:21:47",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 82757,
                                              "replies": [
                                                {
                                                  "id": "i9s9goa",
                                                  "text": "Oh boy did it trigger!",
                                                  "timestamp": "2022-05-24 08:24:22",
                                                  "score": 4,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "i9s9lbn",
                                                      "text": "Ya, you and yr boyfriends on this subreddit. We can speak again when u decide not to use your own made up words as facts.",
                                                      "timestamp": "2022-05-24 08:26:25",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 82757,
                                                      "replies": [
                                                        {
                                                          "id": "i9s9o8t",
                                                          "text": "I hope you stay in touch, I'll be doing a monthly thread of documented examples of Phantom Rape.",
                                                          "timestamp": "2022-05-24 08:27:41",
                                                          "score": 6,
                                                          "num_children": 1,
                                                          "replies": [
                                                            {
                                                              "id": "i9s9qve",
                                                              "text": "See, I won't if u use the phrase phantom rape, because you made it up.",
                                                              "timestamp": "2022-05-24 08:28:49",
                                                              "score": 1,
                                                              "num_children": 0,
                                                              "author": 82757,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "i9y64r4",
                                  "text": "Ok, seriously, I was about to defend you since his initial comment was indeed pretty bad and ***your*** initial comment was actually really reasonable.\n\nBut what in the actual fuck is this? What’s wrong with you?\n\nShit like this is why such an important movement is not taken with a shred of seriousness anymore.\n\nFeminism started as one of the most important movements of the last few centuries.\n\nAnd nowadays, all we get is shit like whatever the fuck you are talking about here.\n\n*”Pedophile behaviour?”*  \n\nWith duo politeness, go fuck yourself with a brick.\n\nWhich is horrifically rude of me to say, but not nearly as rude as the terrible accusation you just trowed here.",
                                  "timestamp": "2022-05-25 15:54:16",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 333106,
                                  "replies": [
                                    {
                                      "id": "i9y6n4b",
                                      "text": "Thanks for the offer, but I'll decline. \n\nGlorifying virginity is pedophile behavior. Maybe you haven't seen previous comments of his, but he has a very messed up view of women.",
                                      "timestamp": "2022-05-25 15:57:37",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 82757,
                                      "replies": [
                                        {
                                          "id": "i9y9xdu",
                                          "text": "Glorifying virginity is literally just the standard mindset of about three decades ago. \n\nIt’s old-school, but that’s just it. It’s not anything overly abnormal like you seem to think.\n\nJust a normal conservative guy speaking his apparently repressed mind.\n\nLike, seriously, I’m not someone who thinks we live in a world of equality or whatever. We do not.\n\nBut for feminism to gain any actual credibility beyond people pretending to agree out of fear while shitting on it from the sides…\n\nYou guys really need to say at least some ***slightly reasonable stuff*** and acknowledge the double standards. Men suffer too, and just as much, if not more than woman, in some areas.\n\nWhile woman also do indeed suffer more with stuff like the job market and safety. \n\nFor anyone to change their views and take you seriously, you need to stop being overly aggressive and annoying.\n\nThis kind of claim is ***precisely*** what turned modern feminism into the joke it is.\n\nIf you guys want support for the cause, then most men are all for it.\n\nYou guys just need to come up with something that even remotely looks like equality instead of whatever the hell is happening nowadays. \n\nThere’s a damn reason why a SUB like this even exists in the first place. It would be outlandish for anyone to ever admit they follow this in real life, and you know why:\n\nAnd it’s because a fuck lot of men live in a reality of fear, since they are absolutely oppressed into shutting their damn mouthes all the time.\n\nOnce freedom of expression actually comes online and both men and woman become able to sit down and talk live civilised adults, I’m pretty sure feminism will actually become relevant again.\n\nThen we could solve shit like safety and the lack of representation in the formal market.\n\nWhile also allowing man to speak about ***their*** problems, which became just as important nowadays.\n\nAnd of course, please stop trying to make the two genders 100% equal in the grammatical sense of it lol.\n\nMen and women are biologically different.\n\nFor us to live in a just society, those differences need to be acknowledged.\n\nIsn’t being weaker the whole reason why safety is such an important matter for woman, after all?\n\nFor this reason, “standards” for both genders will never die. They will, at best, change with time.\n\nAnd that’s fine.\n\nWe don’t need to live in a society without standards.\n\nIn an utopia, we could live in a place were both the standard and the “different” would be respected. \n\nAnyways, just don’t go around saying shit that discredits your own movement just because you’re pissed with a random dude saying rude stuff.\n\nThis is a disservice to everyone.",
                                          "timestamp": "2022-05-25 16:19:07",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 333106,
                                          "replies": [
                                            {
                                              "id": "i9yc50l",
                                              "text": "Glorifying virginity because it makes a woman a 'flourishing feminine butterfly' and 'graceful and beautiful ' is disgustingly childlike. \n\nIf you have a preference for your partner to be a virgin, that is fine. You seek shared values. To glorify it the way this man does (maybe look at previous comments of his and you'll understand my conclusion better. The way he describes his own wife is horrifying.) Is truly to objectify a woman and seek purity in a very infantilized way.\n\nI'm not reading your whole comment, you're going off about stuff that has nothing to do with what I've said. I don't disagree with your points. But, this man is gross and I will comment against him.",
                                              "timestamp": "2022-05-25 16:33:19",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 82757,
                                              "replies": [
                                                {
                                                  "id": "i9yeaxo",
                                                  "text": "Didn’t check the man himself. Not keen on stalking people online.\n\nWe need to evaluate arguments for themselves, not for the person behind them.\n\nAnd anyways, I would appreciate if you actually read my comment. I don’t see how that’s ***not*** related to the issue in question.\n\nAnd again, the butterfly comment is still just something you can reasonably imagine a random man saying 30 years ago. The cult of femininity was normal at that time. Nothing he said ***here*** went particularly out of the *”just really old-fashioned”* line.\n\nWhich is fine. People have every right in the world to be more conservative and old-fashioned.\n\nActually, it wouldn’t surprise me if OP was plainly just old lol.",
                                                  "timestamp": "2022-05-25 16:47:19",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 333106,
                                                  "replies": [
                                                    {
                                                      "id": "i9ynp1p",
                                                      "text": "Ya, I'm not gonna accept his gross opinions because it used to be normal. It used to be normal woman were property, obviously they didn't have good judgement then so I'm not going to forgive 'old fashioned' opinions because op might be old. Everyone has a right to their opinions, and I have a right to be disgusted by them. Thats like saying it's okay for an old person to be racist because they're old fashioned. It's not okay in modern times.\n\nAlso, not stalking. It's informing yourself after you interjected your opinions in a comment thread you have no part in. Our discussion has been more extensive then what you see here. And he has some truly disturbing views on women, not just the ones I've already discussed. \n\nTruly idk why you decided to rant at me.",
                                                      "timestamp": "2022-05-25 17:48:07",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 82757,
                                                      "replies": [
                                                        {
                                                          "id": "i9yovy7",
                                                          "text": "I’m not saying you need to accept it.\n\nYou do need to respect it if he isn’t directly imposing his taste on anyone, though.\n\nWhich he kinda is, so never mind that.\n\nJust saying your accusation is entirely unfounded and also not any less *”gross”*, in your own words.\n\nI decided to rant precisely because you answered a bad comment with an even worse statement.\n\nWhich is precisely what lead most activist movements to be what they are today.\n\nWhich is kinda why this SUB even exists in the first place. Why to be here if you don’t wanna discuss?\n\nLike, I do not even remotely agree with everything I read here.\n\nI’m still willing to discuss and respect others, tho.",
                                                          "timestamp": "2022-05-25 17:55:55",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 333106,
                                                          "replies": [
                                                            {
                                                              "id": "i9ysgpd",
                                                              "text": "My statement is not worse lol because you haven't seen his other comments. \n\nYou are truly ranting for no reason. I agree with you. \n\nAnd yes, he is imposing his opinions directly on people. I'm glad you can see that. This is why I dislike him. He's also called me a pig multiple times. He made up something called 'phantom rape' which is not only dangerous but entirely created by him. He's not a good person, so u really don't understand what you're ranting about if you won't take the time to look through his history.",
                                                              "timestamp": "2022-05-25 18:19:24",
                                                              "score": 1,
                                                              "num_children": 1,
                                                              "author": 82757,
                                                              "replies": [
                                                                {
                                                                  "id": "i9yt0mi",
                                                                  "text": "I’m talking about ***THIS*** thread.\n\nHis other comments have nothing to do with it. Arguments need to be analysed separately.\n\nAnyways, we agree too much to keep going on with this…\n\nAnyways, bye.\n\nHave a nice week.",
                                                                  "timestamp": "2022-05-25 18:22:58",
                                                                  "score": 1,
                                                                  "num_children": 2,
                                                                  "author": 333106,
                                                                  "replies": [
                                                                    {
                                                                      "id": "i9yue16",
                                                                      "text": "Okay, but my comment has to do with his entire account. So if you don't like my comment based on this thread, you may understand better outside of it. That is all I'm saying.",
                                                                      "timestamp": "2022-05-25 18:31:56",
                                                                      "score": 1,
                                                                      "num_children": 1,
                                                                      "author": 82757,
                                                                      "replies": [
                                                                        {
                                                                          "id": "i9ywnb0",
                                                                          "text": "Fair enough.\n\nOk, guess that’s it lol.\n\nThank you for the respectful discussion with me. Didn’t expect that at all, so my first comment was indeed much worse than the bar I’ve arbitrarily set right after.\n\nMy bad, and thanks.\n\nDiscovered this SUB today, and honestly, I expected much worse.",
                                                                          "timestamp": "2022-05-25 18:46:38",
                                                                          "score": 1,
                                                                          "num_children": 0,
                                                                          "author": 333106,
                                                                          "replies": []
                                                                        }
                                                                      ]
                                                                    },
                                                                    {
                                                                      "id": "i9yulhp",
                                                                      "text": "You also told me to fuck myself with a brick when u don't understand what's happening lol. Which was a little extreme I think.",
                                                                      "timestamp": "2022-05-25 18:33:17",
                                                                      "score": 1,
                                                                      "num_children": 1,
                                                                      "author": 82757,
                                                                      "replies": [
                                                                        {
                                                                          "id": "i9yvi2n",
                                                                          "text": "Indeed.\n\nAnd I do apologise for that lol.\n\nEven edited right after to clarify that I was being intentionally rude instead of actually wanting to offend you. The point was to show how rudeness only brings more rudeness.\n\nStill, gotta agree that if I want tolerance, I can’t lack any of it myself just for the sake of making a point.\n\nSo yeah, I’m truly sorry for that one.",
                                                                          "timestamp": "2022-05-25 18:39:08",
                                                                          "score": 1,
                                                                          "num_children": 0,
                                                                          "author": 333106,
                                                                          "replies": []
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i9s8a52",
                          "text": "Then do it! Nobody likes you.",
                          "timestamp": "2022-05-24 08:05:58",
                          "score": 1,
                          "num_children": 1,
                          "author": 29212,
                          "replies": [
                            {
                              "id": "i9s8xgl",
                              "text": "Actually, 5,200 people like me and agree with my opinions. I'm sure you wouldn't be missed tho 😕",
                              "timestamp": "2022-05-24 08:16:09",
                              "score": -1,
                              "num_children": 2,
                              "author": 82757,
                              "replies": [
                                {
                                  "id": "i9s95a0",
                                  "text": "Who are those 5200 people? Pretty sure some keyboard warriors.",
                                  "timestamp": "2022-05-24 08:19:29",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 29212,
                                  "replies": [
                                    {
                                      "id": "i9s975t",
                                      "text": "Oh I'm sure 😂 and what are you?",
                                      "timestamp": "2022-05-24 08:20:17",
                                      "score": 0,
                                      "num_children": 1,
                                      "author": 82757,
                                      "replies": [
                                        {
                                          "id": "i9sffzq",
                                          "text": "An anti-keyboard warrior 😎",
                                          "timestamp": "2022-05-24 09:57:24",
                                          "score": 3,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "i9ta2ly",
                                  "text": "🤣🤣🤣🤣 bro your OF subscribers??",
                                  "timestamp": "2022-05-24 14:50:53",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 263808,
                                  "replies": [
                                    {
                                      "id": "i9tjhpx",
                                      "text": "Is that supposed to offend me? That would make me both hot and rich lmao",
                                      "timestamp": "2022-05-24 15:56:36",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 82757,
                                      "replies": [
                                        {
                                          "id": "i9tlnfu",
                                          "text": "you're right, but these 5200 people wouldn't like you nor agree with your opinions in this case",
                                          "timestamp": "2022-05-24 16:11:24",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 263808,
                                          "replies": [
                                            {
                                              "id": "i9tsacs",
                                              "text": "So then I must not be talking about OF subscribers huh?",
                                              "timestamp": "2022-05-24 16:56:20",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 82757,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9pvt4m",
      "text": "Feminists are the human version of period cramps 😬.",
      "timestamp": "2022-05-23 19:21:11",
      "score": 47,
      "num_children": 1,
      "author": 332264,
      "replies": [
        {
          "id": "i9q83fq",
          "text": "Lol, you said it!",
          "timestamp": "2022-05-23 20:49:17",
          "score": 9,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i9q7xzb",
      "text": "For his age, his body is more than acceptable, I would say he's done well and if my partner has his body at his age, I would still be happy. Shame on reporters for negatively talking down his image! \n\nI can't negatively say anything about Amy Schumer's body as I know its pretty normal for some women her age to be a little chubby, its her personality that really annoys me and she's not funny, she's gross and awful. I can't stand her!",
      "timestamp": "2022-05-23 20:48:13",
      "score": 26,
      "num_children": 1,
      "replies": [
        {
          "id": "i9qvujr",
          "text": "^^",
          "timestamp": "2022-05-23 23:56:06",
          "score": 2,
          "num_children": 0,
          "author": 164469,
          "replies": []
        }
      ]
    },
    {
      "id": "i9qj288",
      "text": "Fuck those misandrist pigs",
      "timestamp": "2022-05-23 22:12:25",
      "score": 15,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9tdgp8",
      "text": "horrible. amy schumer is a nasty rapist. she should be fully cancelled and serve jail time.",
      "timestamp": "2022-05-24 15:14:47",
      "score": 5,
      "num_children": 0,
      "author": 131490,
      "replies": []
    },
    {
      "id": "i9pe00n",
      "text": "She is disgusting",
      "timestamp": "2022-05-23 17:14:52",
      "score": 28,
      "num_children": 1,
      "author": 132801,
      "replies": [
        {
          "id": "i9s8c3a",
          "text": "But hey, expressing how you feel is disgusting because you're a man and need to get your dick hard for any woman. But man, don't dare ever say you fell sexually atracted to a topless woman, a woman with nice ass or similar as you are a disgusting pig. The right to look down and criticise the other sex, as well as talking about how sexy w body is (hunk's abbs, plumber's ass) is a woman's right =))))))) make absolut sens, if you're a feminist of course",
          "timestamp": "2022-05-24 08:06:47",
          "score": 4,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i9rng4b",
      "text": "Feminism is an euphemism for femcel",
      "timestamp": "2022-05-24 03:45:48",
      "score": 10,
      "num_children": 1,
      "author": 384842,
      "replies": [
        {
          "id": "i9w59o6",
          "text": "Yeh, or they banged some guy and he didn't stick around / ghosted her and now these women have a major complex about it. Great.",
          "timestamp": "2022-05-25 03:29:03",
          "score": 2,
          "num_children": 0,
          "author": 105843,
          "replies": []
        }
      ]
    },
    {
      "id": "i9qhjka",
      "text": "Absolutely, over qualitied psychiatrists are still scratching their heads over that disorder.",
      "timestamp": "2022-05-23 22:00:32",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9r14nc",
      "text": "When you let the SPED kids decide the ideology of hundreds of thousands",
      "timestamp": "2022-05-24 00:39:58",
      "score": 3,
      "num_children": 0,
      "author": 381796,
      "replies": []
    },
    {
      "id": "i9tbv4u",
      "text": "Feminist ☕",
      "timestamp": "2022-05-24 15:03:30",
      "score": 3,
      "num_children": 0,
      "author": 16464,
      "replies": []
    },
    {
      "id": "i9te6wf",
      "text": "Leo could still have any woman on that beach in a heartbeat if he wanted. Amy couldn't give it away.",
      "timestamp": "2022-05-24 15:19:52",
      "score": 3,
      "num_children": 0,
      "author": 348014,
      "replies": []
    },
    {
      "id": "i9rhooo",
      "text": "This blatant hypocrisy is so idiotic. If I even accidentally comment on how my female friends look/dress I get tagged as a sexist, but they have a full pass to comment on each and every thing of mine in the most hurtful way.",
      "timestamp": "2022-05-24 02:53:49",
      "score": 5,
      "num_children": 1,
      "author": 28615,
      "replies": [
        {
          "id": "i9ri63x",
          "text": "Nearly all feminists  are fat, ugly and represent the opposite  of feminine  beauty. God forbid you present these facts, be an uproar.",
          "timestamp": "2022-05-24 02:57:54",
          "score": 7,
          "num_children": 1,
          "replies": [
            {
              "id": "i9u00ur",
              "text": "lol wut? \n\ndoes your exposure to feminists extend beyond the \"triggered\" meme and that one person with purple hair from the viral video?",
              "timestamp": "2022-05-24 17:49:21",
              "score": 0,
              "num_children": 0,
              "author": 129020,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9rf5zo",
      "text": "Yep. Women get praised for everything because they have such fragile egos but men get the cold hard truth and disdain of reality.",
      "timestamp": "2022-05-24 02:32:29",
      "score": 6,
      "num_children": 1,
      "replies": [
        {
          "id": "i9rfhaj",
          "text": "Impossible standards for men and no standards for themselves.",
          "timestamp": "2022-05-24 02:35:04",
          "score": 6,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i9s3u85",
      "text": "DiCaprio is in better shape than Schumer in these pictures too.",
      "timestamp": "2022-05-24 06:59:55",
      "score": 6,
      "num_children": 0,
      "author": 258630,
      "replies": []
    },
    {
      "id": "i9t4fr0",
      "text": "I just ignore this garbage and keep living my life...what do I care what other people's bodies look like? I worry about MY body....and I'm doin okay.  LOL",
      "timestamp": "2022-05-24 14:09:58",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9u6j8d",
      "text": "Man without belly in the first pic, man with boobs in the second ;-P. I am being sarcastic obviously, but I fail to see where are the sexy pics at all. On both photos.",
      "timestamp": "2022-05-24 18:34:37",
      "score": 2,
      "num_children": 0,
      "author": 349781,
      "replies": []
    },
    {
      "id": "i9r6a84",
      "text": "Cue the people who say “she looks amazing!”",
      "timestamp": "2022-05-24 01:21:18",
      "score": 4,
      "num_children": 0,
      "author": 52779,
      "replies": []
    },
    {
      "id": "i9qn4fv",
      "text": "And AMY SCHUMER, no less.",
      "timestamp": "2022-05-23 22:44:42",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "i9r5zmi",
          "text": "They needed to associate something funny with her so that she seemed more funny.",
          "timestamp": "2022-05-24 01:19:00",
          "score": 0,
          "num_children": 0,
          "author": 266807,
          "replies": []
        }
      ]
    },
    {
      "id": "i9rg90f",
      "text": "If that’s a knockout figure, I must be mike Tyson/ Mayweather cause my ass just ain’t going down over that lolol",
      "timestamp": "2022-05-24 02:41:28",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "i9w5llx",
          "text": "Such a knockout figure, you'll literally get knocked out, in a coma, forever. Rip",
          "timestamp": "2022-05-25 03:31:51",
          "score": 1,
          "num_children": 0,
          "author": 105843,
          "replies": []
        }
      ]
    },
    {
      "id": "i9sa9qy",
      "text": "Written by women for women.\nToxic is and understatement.",
      "timestamp": "2022-05-24 08:37:12",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9sehjn",
      "text": "Amy. Fat, yet lipless, assless and titless 😷",
      "timestamp": "2022-05-24 09:42:45",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9sk092",
      "text": "The point is that amy schumer lost weigth, leonardo gained weigth. The headline is really about the contrast, not the gender",
      "timestamp": "2022-05-24 10:59:12",
      "score": 2,
      "num_children": 0,
      "author": 129273,
      "replies": []
    },
    {
      "id": "i9t255x",
      "text": "Body positivity is for women, and only women. God forbid 47 yo man in his vacation shows anything less than a flawless body.",
      "timestamp": "2022-05-24 13:52:19",
      "score": 2,
      "num_children": 0,
      "author": 131368,
      "replies": []
    },
    {
      "id": "i9t2c2i",
      "text": "Same exact body",
      "timestamp": "2022-05-24 13:53:48",
      "score": 2,
      "num_children": 0,
      "author": 172353,
      "replies": []
    },
    {
      "id": "i9rwacc",
      "text": "Thankfully men still get to judge how sexy a woman is, they don't need to be lectured by a newspaper.",
      "timestamp": "2022-05-24 05:20:38",
      "score": 2,
      "num_children": 0,
      "author": 65777,
      "replies": []
    },
    {
      "id": "i9smbwf",
      "text": "The same exact figure",
      "timestamp": "2022-05-24 11:26:22",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9tzl0h",
      "text": "Would you kindly explain to me in what way these garbo tabloid pieces are feminism?",
      "timestamp": "2022-05-24 17:46:18",
      "score": 1,
      "num_children": 0,
      "author": 129020,
      "replies": []
    },
    {
      "id": "i9x0smn",
      "text": "Lol this is one example.",
      "timestamp": "2022-05-25 09:58:47",
      "score": 1,
      "num_children": 0,
      "author": 187582,
      "replies": []
    },
    {
      "id": "iac38t3",
      "text": "Women have a dad bod as early as in their mid twenties nowadays.",
      "timestamp": "2022-05-28 17:45:08",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iac3g0j",
      "text": "Amy's body is considered amazing compared to feminists no doubt.",
      "timestamp": "2022-05-28 17:46:43",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ic99rgj",
      "text": "Nobody should be taking photos of people, famous or otherwise, and commenting on their body’s. Don’t perpetuate this shit.",
      "timestamp": "2022-06-13 22:12:19",
      "score": 1,
      "num_children": 0,
      "author": 125422,
      "replies": []
    },
    {
      "id": "i9tix93",
      "text": "This isn't feminism though, it's a shitty news article and Daily mail! In society, women are much more judged for their bodies than men",
      "timestamp": "2022-05-24 15:52:44",
      "score": -1,
      "num_children": 2,
      "author": 136958,
      "replies": [
        {
          "id": "i9w5nz6",
          "text": "Get fucked",
          "timestamp": "2022-05-25 03:32:27",
          "score": 2,
          "num_children": 1,
          "author": 105843,
          "replies": [
            {
              "id": "i9wmjee",
              "text": "This pretty much sums up the type of people in this sub",
              "timestamp": "2022-05-25 06:31:43",
              "score": 0,
              "num_children": 1,
              "author": 136958,
              "replies": [
                {
                  "id": "i9wp6s1",
                  "text": "Right back at you",
                  "timestamp": "2022-05-25 07:06:45",
                  "score": 2,
                  "num_children": 0,
                  "author": 105843,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "i9y4q08",
          "text": "Society ≠ a different newspaper",
          "timestamp": "2022-05-25 15:45:02",
          "score": 1,
          "num_children": 0,
          "author": 252521,
          "replies": []
        }
      ]
    }
  ]
}