{
  "id": "ux3u0v",
  "text": "#Neverforget #UValde\n",
  "timestamp": "2022-05-24 23:19:21",
  "score": 5640,
  "subreddit": "t5_3fdcn",
  "num_children": 40,
  "author": 92232,
  "replies": [
    {
      "id": "i9v9x9p",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-05-24 23:19:22",
      "score": 1,
      "num_children": 1,
      "author": 184140,
      "replies": [
        {
          "id": "ibnjuvz",
          "text": "Smash the fash",
          "timestamp": "2022-06-08 20:49:39",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i9vj6dy",
      "text": "If only Republicans could read. Or care about actual life.",
      "timestamp": "2022-05-25 00:32:52",
      "score": 359,
      "num_children": 4,
      "author": 212341,
      "replies": [
        {
          "id": "i9w3owi",
          "text": "These children are already born, they're not fetuses so they didn't make the  cut.",
          "timestamp": "2022-05-25 03:15:57",
          "score": 151,
          "num_children": 1,
          "author": 330390,
          "replies": [
            {
              "id": "i9zyq45",
              "text": "If you pre-born, you're fine. If you're preschool, you're fucked. -George Carlin\n\n- RedditorRick",
              "timestamp": "2022-05-25 23:15:24",
              "score": 7,
              "num_children": 0,
              "author": 212341,
              "replies": []
            }
          ]
        },
        {
          "id": "i9x0mqu",
          "text": "Oh but they do - their motto is’Life before Birth.’ /s\n\nAssholes.",
          "timestamp": "2022-05-25 09:56:23",
          "score": 27,
          "num_children": 0,
          "author": 398010,
          "replies": []
        },
        {
          "id": "i9x4hge",
          "text": "To them, the only life that matters is the afterlife.  To them, this life is merely an entry exam to get into heaven.  To pass, you must vote republican and attend the douchiest churches available where you learn to be judgmental.",
          "timestamp": "2022-05-25 10:47:54",
          "score": 26,
          "num_children": 2,
          "author": 386109,
          "replies": [
            {
              "id": "i9ycdm5",
              "text": "From a fellow Mikey, this is very well said.",
              "timestamp": "2022-05-25 16:34:51",
              "score": 5,
              "num_children": 1,
              "author": 272258,
              "replies": [
                {
                  "id": "i9z7xdj",
                  "text": "He likes it!  Hey Mikey!",
                  "timestamp": "2022-05-25 20:02:04",
                  "score": 4,
                  "num_children": 0,
                  "author": 291656,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9zyesn",
              "text": "I don't think there's a god or anything at all, but i was raised Catholic and we used the same Bible. If there's a god, there is no way these clowns are getting in.",
              "timestamp": "2022-05-25 23:12:57",
              "score": 2,
              "num_children": 0,
              "author": 212341,
              "replies": []
            }
          ]
        },
        {
          "id": "i9vlhg6",
          "text": "[removed]",
          "timestamp": "2022-05-25 00:51:03",
          "score": -136,
          "num_children": 13,
          "replies": [
            {
              "id": "i9voogi",
              "text": "Imagine seeing the news today and then reacting like \"tee-hee! Time to own teh libz on Reddit!\"",
              "timestamp": "2022-05-25 01:16:20",
              "score": 106,
              "num_children": 1,
              "author": 201097,
              "replies": [
                {
                  "id": "i9vqivm",
                  "text": "Is disgusting, innit",
                  "timestamp": "2022-05-25 01:30:57",
                  "score": 40,
                  "num_children": 0,
                  "author": 188133,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9vmcsz",
              "text": "When was the last time gangbangers broke into a school and killed 18 kids?",
              "timestamp": "2022-05-25 00:58:00",
              "score": 118,
              "num_children": 2,
              "author": 172996,
              "replies": [
                {
                  "id": "i9vojqu",
                  "text": "Don't make the mistake of thinking they give a fuck about children's lives though - many thousands of children have died in the crossfire of gang violence, and many thousands more have died after being recruited into it by their older peers.  In fact, the peak age of death for a banger is probably under the age of majority in the US (21) and probably even under the age of majority in the rest of the world.",
                  "timestamp": "2022-05-25 01:15:19",
                  "score": 19,
                  "num_children": 1,
                  "author": 339843,
                  "replies": [
                    {
                      "id": "i9xp69x",
                      "text": "I completely agree with everything you said, I also think there is a difference between stray bullets hitting innocent kids and innocent kids being the target. \n\nGangs are usually settling scores between each other, in specific places that you don’t normally go. They opt into the violence the same way people get drafted into war. They might not want to be there but they know what’s coming and have some small amount of agency over their health and well-being. \n\nPsychos with gun fetishes that walk into a school and slaughter innocent people are on another level. \n\nI think the vast majority of deaths due to gun violence are preventable, if they’re in the hood or in school, churches, grocery stores, it doesn’t matter, we can do a lot to prevent a lot of them. \n\nBut pro-life doesn’t mean pro-life to the vast majority of people who could do something but are sitting on their hands.",
                      "timestamp": "2022-05-25 13:58:15",
                      "score": 3,
                      "num_children": 0,
                      "author": 330703,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "i9vpu6k",
                  "text": "[removed]",
                  "timestamp": "2022-05-25 01:25:26",
                  "score": -81,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "i9w0s9h",
                      "text": "Oh, sort of like all the accidental shootings of family members in households that have guns. Yeah, it’s fuckin tragic. Too bad republicans refuse to do anything about this major fucking problem.",
                      "timestamp": "2022-05-25 02:51:44",
                      "score": 26,
                      "num_children": 0,
                      "author": 357402,
                      "replies": []
                    },
                    {
                      "id": "i9vz03c",
                      "text": "I know you are being ignorant on purpose but have you ever tried to rub those two brain cells together and consider that you have more crime in cities like NY or LA because the majority of the US population lives there? Of course you can’t compare a city like LA with the 5th largest economy in the world, larger than the UK in fact, to bumfucknowhereville, Mississippi. Now shut the fuck up and realize this is the 27th school shooting in the US this year and it’s only May. There are actual problems that are killing our kids. Pro life party my ass. You are just a party of of racist incels at this point.",
                      "timestamp": "2022-05-25 02:37:23",
                      "score": 20,
                      "num_children": 0,
                      "author": 246132,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9vnlo6",
              "text": "And apparently you lack the courage of your convictions \n\nWay to instantly delete your \"witty\" retort.\n\nPathetic, even for a troll like you",
              "timestamp": "2022-05-25 01:07:43",
              "score": 50,
              "num_children": 0,
              "author": 166867,
              "replies": []
            },
            {
              "id": "i9w0u51",
              "text": "Fuck off, fascist.",
              "timestamp": "2022-05-25 02:52:09",
              "score": 12,
              "num_children": 0,
              "author": 357402,
              "replies": []
            },
            {
              "id": "i9vt640",
              "text": "Every sane human in the world hates your guts, you fascist scumbag. Can't imagine how it feels.",
              "timestamp": "2022-05-25 01:51:38",
              "score": 33,
              "num_children": 0,
              "author": 224599,
              "replies": []
            },
            {
              "id": "i9vvdv3",
              "text": "If you’re comparing gun violence in large cities to a mass shooting of 18 children you’re just retarded. Most large cities are also surrounded by states where you can easily go and buy a gun. Until there’s federal gun control gun laws mean absolutely nothing!",
              "timestamp": "2022-05-25 02:08:51",
              "score": 9,
              "num_children": 2,
              "author": 120848,
              "replies": [
                {
                  "id": "i9xq4tq",
                  "text": "Red states are more than happy to supply guns to anyone with cash, legal or otherwise. Especially if it goes on to kill people in blue states.\n\nWhich is why they fight hard to keep the Bureau of Alcohol Tobacco, Firearms and Explosives under funded and toothless. We need a new branch of the military to deal with space but one underfunded and hobbled Bureau to deal with all that random shit.",
                  "timestamp": "2022-05-25 14:05:17",
                  "score": 3,
                  "num_children": 0,
                  "author": 330703,
                  "replies": []
                },
                {
                  "id": "i9yctcm",
                  "text": "> If you’re comparing gun violence in large cities to a mass shooting of 18 children you’re just retarded.\n\nYep, mass shootings are flashy and attention-grabbing, but are statistically insignificant as far as murders are concerned.",
                  "timestamp": "2022-05-25 16:37:41",
                  "score": 0,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9w1gtp",
              "text": "Right? It's terrible! Maybe we should legislate some gun control and then it'll be harder for people like that to get guns.",
              "timestamp": "2022-05-25 02:57:17",
              "score": 9,
              "num_children": 0,
              "author": 149244,
              "replies": []
            },
            {
              "id": "i9voxpr",
              "text": "uhh….still don’t like it. Sounds like you agree that there are reasons to crack down on gun violence. Thanks for agreeing!",
              "timestamp": "2022-05-25 01:18:23",
              "score": 25,
              "num_children": 0,
              "author": 316355,
              "replies": []
            },
            {
              "id": "i9vph2y",
              "text": "Get cold feet and delete you're response? You're a very sick person and I hope you spend the rest of your sad life as miserable and pathetic as you are now.",
              "timestamp": "2022-05-25 01:22:33",
              "score": 24,
              "num_children": 0,
              "author": 201097,
              "replies": []
            },
            {
              "id": "i9w0arz",
              "text": "You say that like you give a shit stfu",
              "timestamp": "2022-05-25 02:47:49",
              "score": 8,
              "num_children": 0,
              "author": 356057,
              "replies": []
            },
            {
              "id": "i9vn5xa",
              "text": "Obvious troll is Obvious",
              "timestamp": "2022-05-25 01:04:17",
              "score": 20,
              "num_children": 0,
              "author": 166867,
              "replies": []
            },
            {
              "id": "i9w1o53",
              "text": "Weaponized stupidity right here.",
              "timestamp": "2022-05-25 02:58:59",
              "score": 5,
              "num_children": 0,
              "author": 35763,
              "replies": []
            },
            {
              "id": "i9w2mvj",
              "text": "You wouldn't do shit about that either, fuck off.",
              "timestamp": "2022-05-25 03:06:57",
              "score": 5,
              "num_children": 0,
              "author": 387203,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9vg6r5",
      "text": "The United States is broken",
      "timestamp": "2022-05-25 00:08:47",
      "score": 232,
      "num_children": 4,
      "author": 254474,
      "replies": [
        {
          "id": "i9wadjy",
          "text": "Tonight my mom and I took a shot of tequila and the toast was \"to survive living in the US\".",
          "timestamp": "2022-05-25 04:15:31",
          "score": 44,
          "num_children": 0,
          "author": 230768,
          "replies": []
        },
        {
          "id": "i9wnq7k",
          "text": "It just blows my mind, how many dead children is it going to take?",
          "timestamp": "2022-05-25 06:47:15",
          "score": 18,
          "num_children": 0,
          "author": 60942,
          "replies": []
        },
        {
          "id": "i9waoa0",
          "text": "I'm not American so can you (or anyone really) explain why so many Americans are in love with guns when mass shootings are so common?",
          "timestamp": "2022-05-25 04:18:25",
          "score": 60,
          "num_children": 9,
          "author": 128856,
          "replies": [
            {
              "id": "i9wsgfb",
              "text": "i saw it explained somewhere that we had a push over the decades for individualism. you see it in a lot of our movies, where it's some One person who does the grand scheme. in a movie, that's fine because bigger casts are harder to keep track of, but... america values \"individuality\" over everything else.\n\nuniversal healthcare can't happen when there's no \"we\". gun limitations can't happen when \"my\" rights will be squashed for an \"us\" we were taught not to believe in.\n\ntbh i was kinda told all this because someone had pointed out how a lot of american cartoons are about fitting in and about making friends or finding a family or learning your family and friends, while a lot of japanese anime is about individualism or people who stand out from the crowd (for better or worse)- and how it's totally opposite to our cultures, and what it says about us. your mileage may vary, but i do think the bit about america feels pretty accurate.",
              "timestamp": "2022-05-25 07:53:40",
              "score": 65,
              "num_children": 0,
              "author": 64541,
              "replies": []
            },
            {
              "id": "i9wy6f6",
              "text": "Quick answer: Fox “News” owned by the menace to society known as Rupert Murdoch has brainwashed the simplest Americans with abysmally low levels of empathy so they believe their privilege to own a gun is more important than everyone else’s right to life. It’s just fear mongering the stupidest Americans with no critical thinking skills so the NRA can make billions to pay their crooked politicians.",
              "timestamp": "2022-05-25 09:20:26",
              "score": 38,
              "num_children": 0,
              "author": 52848,
              "replies": []
            },
            {
              "id": "i9wayh9",
              "text": "Americans are sick. They need help. Send help.",
              "timestamp": "2022-05-25 04:21:05",
              "score": 51,
              "num_children": 1,
              "author": 264785,
              "replies": [
                {
                  "id": "i9wmzkh",
                  "text": "The name of the disease is radical conservatism.",
                  "timestamp": "2022-05-25 06:37:33",
                  "score": 48,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "i9y429u",
                      "text": "And limp-wristed neoliberalism paving the way for it to flourish.",
                      "timestamp": "2022-05-25 15:40:43",
                      "score": 9,
                      "num_children": 1,
                      "author": 279821,
                      "replies": [
                        {
                          "id": "i9yd380",
                          "text": "Strangely, it's the libs who want to take away people's guns.\n\nActual lefties recognize that the last time Nazis took power (1930s Germany) shooting them in the head was the only way to stop them.",
                          "timestamp": "2022-05-25 16:39:30",
                          "score": -2,
                          "num_children": 3,
                          "replies": [
                            {
                              "id": "i9ygo0q",
                              "text": "\"Actual lefties\" the last time Nazis took power were systematically slaughtered as enemies of the state.  The last \"actual lefties\" lost that fight horribly..",
                              "timestamp": "2022-05-25 17:02:31",
                              "score": 9,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "i9yh2r6",
                                  "text": "So would you rather :\n\n* Give up and die horribly, or:\n* At least try to defend everyone else?",
                                  "timestamp": "2022-05-25 17:05:08",
                                  "score": 0,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "i9ynhlo",
                                      "text": "Try to defend everyone else, obviously.  Except that's not what happened in Nazi Germany.  They just slowly gained control until they had the power and authority to just throw anyone they didn't like into an encampment or taken away to be presumably shot and killed by the Gestapo.  \n\nJust pointing out your analogy is a bit flawed.",
                                      "timestamp": "2022-05-25 17:46:45",
                                      "score": 4,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "i9zh45u",
                                          "text": "> Except that's not what happened in Nazi Germany.\n\nPartisans and the railroad disagree with you there.",
                                          "timestamp": "2022-05-25 21:04:53",
                                          "score": 1,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "ia1cy9n",
                                              "text": "I doubt very much that anyone you would consider to be \"actual lefties\", partisans and the railroad included, would consider anything that happened in Nazi Germany to have been a success..\n\nEven minor \"victories\" were overshadowed by the Nazis having complete control over who lives and who dies.  \n\nI get that you're trying to make a pedantic win by saying there was resistance, but even then I strongly disagree with you that.  If we're measuring success by outcomes, they were *enormously* unsuccessful..",
                                              "timestamp": "2022-05-26 06:56:51",
                                              "score": 1,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "ia1g8d2",
                                                  "text": "True, the success was when everyone else rolled tanks in.\n\nI'd still rather try to defend against fascism than give up and let them win though.",
                                                  "timestamp": "2022-05-26 07:43:28",
                                                  "score": 2,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "ia1hksu",
                                                      "text": "> I'd still rather try to defend against fascism than give up and let them win though. \n\nI think that's precisely the issue.   Most people in Nazi Germany just went along with it.  But good on you that you would take action.   I'd like to think I would too if it came down to it.",
                                                      "timestamp": "2022-05-26 08:03:20",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "ia1k7tq",
                                                          "text": "> I think that's precisely the issue. Most people in Nazi Germany just went along with it.\n\nMilgram's results are really depressing.",
                                                          "timestamp": "2022-05-26 08:43:01",
                                                          "score": 1,
                                                          "num_children": 0,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "i9yje5t",
                              "text": "Trust me homie I’m very pro gun, also very pro regulation. Democracy can never stop fascism. Only vast physical efforts. Even the forefathers with their hypocritical asses understood this.",
                              "timestamp": "2022-05-25 17:20:17",
                              "score": 3,
                              "num_children": 1,
                              "author": 279821,
                              "replies": [
                                {
                                  "id": "i9zhg9u",
                                  "text": "> Democracy can never stop fascism. Only vast physical efforts.\n\nSo when the state gets taken over by the fascists you want them to know exactly who's house they need to raid?",
                                  "timestamp": "2022-05-25 21:07:13",
                                  "score": 1,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "i9yn7yp",
                              "text": "Hitler greatly eased gun restrictions for most Germans.",
                              "timestamp": "2022-05-25 17:45:02",
                              "score": 1,
                              "num_children": 1,
                              "author": 158212,
                              "replies": [
                                {
                                  "id": "i9zh9mz",
                                  "text": "Are you using Hitler's definition of \"germans\" here, or the actual one?\n\nAnd he also tightened them up for all his scapegoats.",
                                  "timestamp": "2022-05-25 21:05:55",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "i9zm1dl",
                                      "text": "The actual one. “Most Germans” = Everyone but the Jews\n\nThat’s still the majority of the German population.\n\nJust last weekend I shot down a post by some gun-licker who seemed to think that the Nazis took literally everyone’s guns away when they came to power so that they could “control the population.”",
                                      "timestamp": "2022-05-25 21:40:05",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 158212,
                                      "replies": [
                                        {
                                          "id": "i9zo0op",
                                          "text": "I thought he tightened them up for Leftists, Romani (? gypsies (I don't know what the preferred term is here)), black people, and LGBT folks as well?",
                                          "timestamp": "2022-05-25 21:54:19",
                                          "score": 1,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "i9zpqir",
                                              "text": "Even if that’s correct, it still fits the definition of “most Germans.”",
                                              "timestamp": "2022-05-25 22:06:47",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 158212,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9wdvzp",
              "text": "It’s how this country ends.  We did it to ourselves.",
              "timestamp": "2022-05-25 04:50:57",
              "score": 6,
              "num_children": 0,
              "author": 263443,
              "replies": []
            },
            {
              "id": "i9wdfsa",
              "text": "I have a theory that masochism and self destruction are deeply rooted in our culture.",
              "timestamp": "2022-05-25 04:46:16",
              "score": 16,
              "num_children": 1,
              "replies": [
                {
                  "id": "i9xuzqa",
                  "text": "It came over on the Mayflower. It's the ethic that says you don't deserve to eat if you can't work for it. It's what keeps us slavishly devoted to the lack of a social safety net and disregards the value of any common good.",
                  "timestamp": "2022-05-25 14:39:40",
                  "score": 10,
                  "num_children": 0,
                  "author": 389128,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9yrlu1",
              "text": "In addition to what has already been said, there’s a few other things at play here:\n\n1. Incels and permanently-scared older Republicans need to feel “manly,” and guns help with that a lot.\n\n2. Fantasies, often racist, about protecting their families from almost-mythical home invasions.\n\n3. A long-standing fantasy about “keeping the government in check” where they say they could overthrow the government if it ever got tyrannical, but only if they still had their guns. Whether or not the 2nd Amendment was actually even made with this in mind is up for debate at best. Washington himself put down several rebellions while president.\n\nIf you ask how they’d defeat the largest military the world has ever known, their answers are about as varied, contradictory, and not in line with the facts as they are on what’s “really going on” with climate change: The military would be on our side because there’s no ambiguity to their enlistment oath or anything, it happened in the American Revolution (not really), so it could happen now (LOL), there’s technically more guns in the hands of civilians than the military.\n\nI’ve realized recently that this is just a power fantasy related to #1.\n\n4. A paranoid “black helicopter mentality” of people who “don’t trust government” that ties into #3.\n\n5. Seeing guns as especially patriotic or something, thanks to circular logic.",
              "timestamp": "2022-05-25 18:13:45",
              "score": 4,
              "num_children": 0,
              "author": 158212,
              "replies": []
            },
            {
              "id": "i9ytdxo",
              "text": "For the same reason we voted in Trump, we have an inordinate amount of dumbasses who vote. \n\nThey are narcissistic knuckle dragging idiots who's entire world view centers around what is convenient for themselves and no one else. \n\nMass shootings are common because we dont have adequate health care and mental illness goes untreated. That said, if you are of age to purchase a weapon, there is not one thing stopping you in places like Texas. There is no test, training or background check for someone over 21. There is literally no regulation on the private sale of weapons in Texas. \n\nWe have, to use a hazardous materials metaphor, stored the blasting caps next to the explosives. The matches next to the gasoline. The question is not why are there mass killings. The question is why has the amount of them not caused change?\n\nFor that, I take you back to my first sentence.",
              "timestamp": "2022-05-25 18:25:21",
              "score": 4,
              "num_children": 0,
              "author": 31888,
              "replies": []
            },
            {
              "id": "i9yr3pk",
              "text": "As an American, through my experiences, those that are so adamant about guns, is for protection reasons primarily. This is backed up with their distrust in \"the government\" and want to be able to control and defend, if need be, their property and family.  There are those that also enjoy the hobby of collecting and shooting guns for sport. You would find, for the most part, that these points of view would be found in more rural areas, where the properties are more vast, where your closest neighbor might be a 5-10 walk down the road. The access to police usually entails a town of maybe 4 police cars where the response time might be a little critical. For them, having a tool like a gun is an important item to have accessible. \n\nThen you have those that want to make sure that they are protected when they go out in more crowded areas. To them, having a gun is not looked at through the lens of becoming a danger to the public, but being prepared of the unknown. And for the most part, I do think that most fit in that group of people. \n\nFor the two groups I've mentioned, it boils down to being prepared. They want to have the ability, to react to a situation where if danger arrives they can respond to it quickly. Where response time is critical in these sort of settings, like the mass shootings, waiting for the police to arrive vs responding to said shooter immediately, could be the matter of losing a small amount of lives vs a large amount of lives. It's a very reactive sort of way to handle a situation. But there are those in these groups that believe that the knowledge of the public having guns will deter people from following through, as they are fed inaccurate information because the media that supports their side, tells them that the shooter targeted the area BECAUSE it's a gun-free zone. \n\nThen there is the gun-reform control crowd that is looking at these sort of situations in a proactive sort of way, where they don't want to give people the sort of tools necessary to enact the type of violence we see. They want to deal with the steps that lead up to the person physically getting the gun to shoot people. They don't want the person that is not mentally stable to have the access to a gun because they believe if you don't have access to a tool, you can't harm people. Which is ridiculous, because there are more impactful \"tools\" one can use to harm others. \n\nThen insert the political parties in this country, as well as the media that benefit from the divide of Americans on the topic. It's next to impossible to come to a compromised solution because of the fear mongering going on. You have those that don't want anything to regulate guns, and you have the other loud voice that are placing blame on the guns. When you have such polar opposites, with the media pushing fear at people, you're not going to get anywhere\n\nFrom my perspective, I would love to see some push from the pro-gun crowd to push for something other than \"make sure you have your gun\" type of solutions, and I think we can get there if the gun-reform crowd would stop pushing the \"guns are the problem\" narrative. \n\nI think if we can tackle the systematic issues that lead to the motivation to turn to using guns on fellow citizens, that we can turn down the violence that we witness in this country. It would benefit both groups in this country. If Systemic Racism would be agreed to exist and were worked out to be eradicated, if Income Inequality gaps were shrunk, if Social Media and MSM outlets were held accountable, and benefitted from being truthful and responsible with their reporting and what they allowed on their platforms instead of profiting off of outrage and pushing fear mongering under the guise \"free speech\", we might just be able to lower the tensions citizens have towards one another, and maybe we would just be able to have confidence in our communities that compromising, and working on coping through problems in a non-violent manner, might help. Hell, the pro-gun crowd might just get their wish of being able to open-carry so they can be prepared, without fear of their guns being targeted by those on the left. \n\nIn short, America needs to change their culture and systems within, and in doing so, may be able to accomplish their wishes of more freedoms.",
              "timestamp": "2022-05-25 18:10:23",
              "score": 1,
              "num_children": 0,
              "author": 378613,
              "replies": []
            },
            {
              "id": "i9z8eo0",
              "text": "I'm in Australia and I just don't get it.\n\nWe recently had Kari Lake visit our country, and as she walked out on a 60 Minutes interview after being quizzed about Trump, she pointed at the reporter and said \"You sir, need more guns in Australia.\"\n\nSeriously?",
              "timestamp": "2022-05-25 20:05:17",
              "score": 1,
              "num_children": 0,
              "author": 306151,
              "replies": []
            }
          ]
        },
        {
          "id": "i9wbofd",
          "text": "Been broken",
          "timestamp": "2022-05-25 04:28:16",
          "score": 6,
          "num_children": 0,
          "author": 147081,
          "replies": []
        }
      ]
    },
    {
      "id": "i9vlbke",
      "text": "That’s perfect. These Republicans care more about their guns than our living children. But if they are in the womb, arrest the mother if she gets an abortion after her uncle raped her at 15.",
      "timestamp": "2022-05-25 00:49:46",
      "score": 168,
      "num_children": 2,
      "author": 266463,
      "replies": [
        {
          "id": "i9wuqhs",
          "text": "There is no such thing as love or compassion - or even mercy - in the GOP handbook. They are swimming in the blood of children and their mothers.",
          "timestamp": "2022-05-25 08:27:52",
          "score": 23,
          "num_children": 0,
          "author": 181879,
          "replies": []
        },
        {
          "id": "i9vylyu",
          "text": "If only those 18 children were fetuses...",
          "timestamp": "2022-05-25 02:34:17",
          "score": 63,
          "num_children": 3,
          "author": 33147,
          "replies": [
            {
              "id": "i9w29fw",
              "text": "Came here to read that. Thank you 🙏",
              "timestamp": "2022-05-25 03:03:53",
              "score": 10,
              "num_children": 0,
              "author": 365686,
              "replies": []
            },
            {
              "id": "i9w0tmm",
              "text": "🫡 excellent retort! Spot on",
              "timestamp": "2022-05-25 02:52:03",
              "score": 10,
              "num_children": 0,
              "author": 20155,
              "replies": []
            },
            {
              "id": "i9w3ri1",
              "text": "I said the exact same thing",
              "timestamp": "2022-05-25 03:16:34",
              "score": 4,
              "num_children": 0,
              "author": 330390,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9wjt19",
      "text": "“No way to fix this” says only country with this issue",
      "timestamp": "2022-05-25 05:57:19",
      "score": 31,
      "num_children": 0,
      "author": 142010,
      "replies": []
    },
    {
      "id": "i9vzc1i",
      "text": "I feel literally sick. The whole school was on lockdown after hearing the gunfire before the shooter entered the school premises. This sick twisted teenager searched for 7-10yos to murder. He shot them with assault rifles he bought on his 18th birthday. No one questioned him, he didn't need a license nor a background check. No one batted an eye. These children are dead because of the negligence of adults. The negligence of the gun store owners, the negligence of the shooter's parents/guardians, and the negligence of the Texas and Federal Gov't. The blood of the thousands of shooting victims are on their fucking hands. They were 1st-3rd graders, man. They don't deserve this, no one does.\nEdit: After reading the comments about the gun laws, it seems I was wrong. His parents probably bought the guns for him. If you see on the shooters instagram page he posted two heavy assault rifles. Apparently he took a handgun and an assault rifle into the school. He could have very easily lied on the \"psychological background check\" (questionaire). Guns are so easily accessible to murderers. I ask all the pro-gun people that argue that; \"There's always a good guy with a gun.\" Where is your good guy now?",
      "timestamp": "2022-05-25 02:40:07",
      "score": 113,
      "num_children": 5,
      "author": 33147,
      "replies": [
        {
          "id": "i9wdpts",
          "text": "What about the negligence of all the morons in this country who vote Republican?",
          "timestamp": "2022-05-25 04:49:11",
          "score": 51,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i9wb620",
          "text": "We need to go vandalize some shit with tiny bloody handprints. Every single republican is responsible for this atrocity.",
          "timestamp": "2022-05-25 04:23:06",
          "score": 55,
          "num_children": 1,
          "author": 264785,
          "replies": [
            {
              "id": "i9yoa9e",
              "text": "Sounds like a good, effective protest strategy. We should do it!",
              "timestamp": "2022-05-25 17:51:57",
              "score": 3,
              "num_children": 0,
              "author": 158212,
              "replies": []
            }
          ]
        },
        {
          "id": "i9xzgf1",
          "text": "I really hate people sometimes",
          "timestamp": "2022-05-25 15:09:56",
          "score": 4,
          "num_children": 0,
          "author": 12786,
          "replies": []
        },
        {
          "id": "i9ydefp",
          "text": "Who radicalized him into wanting to shoot up a school?",
          "timestamp": "2022-05-25 16:41:30",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i9w6sqw",
          "text": "[removed]",
          "timestamp": "2022-05-25 03:42:18",
          "score": -3,
          "num_children": 4,
          "replies": [
            {
              "id": "i9w7so6",
              "text": "Most of the people who are anti gun have never purchased one, so they might not know about the background check. However, the background check form is _extremely_ easy to lie on. It's mostly checkboxes, with a few things to verify your identity (citizenship and felony status, etc). \n\nHere in Wisconsin you just check one box \"yes\" and the rest of them \"no\" and put your name, date of birth, ssn, etc. and it goes through a mostly automated system. Sometimes there's a phone verification needed but I've only had that once and I think that was because I was buying a gun on Sunday. It's like, ridiculously easy to pass the background checks. I'm surprised Wisconsin hasn't had more shootings to be honest, but I guess most kids go through hunters safety and they're used to being around guns. Idk.\n\nSorry, my reply got a bit longer than I anricipated\n\nEdit: I'm not a conservative, I'm a liberal gun owner. I think there is a lot of room for improvement in our gun laws bot at the state and federal level. And we need to start properly funding mental health support and research to help the people who feel like committing these tragedies.",
              "timestamp": "2022-05-25 03:51:22",
              "score": 38,
              "num_children": 1,
              "author": 5853,
              "replies": [
                {
                  "id": "i9w9c6q",
                  "text": "So that's the federal background check we currently have which basically says you can't be a felon or convicted of specific violent misdemeanors. It's automated and relies on states to send conviction data to the feds. Edit: it also says you can't be an addict or have a mental health issue, but you can lie about that because no one checks because there's no way to check. So, the common advice is \"just answer yes here, and no to the rest\" -- most FFLs will not have you read the single page you fill out some info and check a couple of boxes on and then sign. Seriously one page with 9 questions and some basic info that gets scanned and run though an automated DB, a form on which you can lie about two of the questions, that is all that stands in the way of basically anyone reading this and so many other people from owning a gun in the next hour.\n\nMost people don't get how easy it is. If there's a 24h pawn shop near you, you can own an AR-15, an AA12, a couple of Glocks, and a nice bolt action .308 with a heavy magnification scope for around $2000 (depending on location and actual model of the stock) within the hour, this hour right now, it takes the amount of time to drive there plus like 5 minutes of filling out a page of basic info and checking some boxes. \n\n\nHere's the thing though. That's a crazy lax standard for background checks. Even the laws for a CHL in fucking Texas are more restrictive. Well were more restrictive. You don't need a CHL in Texas anymore, if you can own the gun you can carry it concealed. \n\nThere may be a background check, but it's not checking for so fucking many things it should be. And if it weren't federally mandated, most states wouldn't have one. \n\nAlso, if you buy a gun from a private citizen who's not a FFL then there's no background check. So, Tom who isn't a felon can buy a gun on Monday, decide he doesn't want it and sell it to Bob, who is a felon, on craigslist on Tuesday and that's a legal sale. Bob is breaking the law by possessing the gun, but it wasn't a regulated or illegal sale. The sale having the same effect as selling a felon a firearm. \n\nThese sales are not regulated so no receipt or transfer of ownership paperwork or anything like that exists. There is no paper trail linking Bob to the gun unless Tom goes out of his way and goes through the hassle of creating one. Nevermind the fact that Tom has no power to verify any information Bob gives him. \n\nSource: FFL holder and outspoken far left Marxist",
                  "timestamp": "2022-05-25 04:05:43",
                  "score": 22,
                  "num_children": 1,
                  "author": 186875,
                  "replies": [
                    {
                      "id": "i9xnyma",
                      "text": "> Also, if you buy a gun from a private citizen who's not a FFL then there's no background check\n\nThis one bothers me a lot. Just last week my dad had a rummage sale and one of his customers was talking to him about guns and asked if dad had any for sale. My dad sold this total stranger a 12 gauge shotgun for $60 at a rummage sale. And that sale was perfectly legal. No laws were broken, there is no way to track the sale, no background checks were performed, and if the gun is used in a crime there's no way to track it down to anyone because my dad got it from a different private party in a similar fashion. It's stupid how easy it is to get a gun in this country. I'm pro 2A but something has to change because this is absurd.",
                      "timestamp": "2022-05-25 13:49:07",
                      "score": 4,
                      "num_children": 0,
                      "author": 5853,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "i9w7mzj",
              "text": "Except that the shooter could have and most likely did just take a gun that an adult purchased",
              "timestamp": "2022-05-25 03:49:54",
              "score": 5,
              "num_children": 1,
              "author": 172996,
              "replies": [
                {
                  "id": "i9wkcg3",
                  "text": "Purchased them on their 18th birthday per the hate filled rag that is the daily mail",
                  "timestamp": "2022-05-25 06:03:57",
                  "score": 6,
                  "num_children": 0,
                  "author": 283716,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9w7g88",
              "text": "https://www.texasgunlaws.org",
              "timestamp": "2022-05-25 03:48:11",
              "score": 3,
              "num_children": 0,
              "author": 33147,
              "replies": []
            },
            {
              "id": "i9w9com",
              "text": "Thank goodness. Wow.... This must have prevented the tragedy.",
              "timestamp": "2022-05-25 04:05:51",
              "score": 1,
              "num_children": 0,
              "author": 39809,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9vf3uh",
      "text": "'freedom holes'",
      "timestamp": "2022-05-25 00:00:05",
      "score": 51,
      "num_children": 0,
      "author": 97738,
      "replies": []
    },
    {
      "id": "i9wfa2b",
      "text": "Technically the Bible says nothing about murdering children with firearms, so I think they’re in the clear here.",
      "timestamp": "2022-05-25 05:05:48",
      "score": 16,
      "num_children": 0,
      "author": 193080,
      "replies": []
    },
    {
      "id": "i9vtv46",
      "text": "No one can make a argument that something like this is a necessary evil.",
      "timestamp": "2022-05-25 01:57:04",
      "score": 46,
      "num_children": 1,
      "replies": [
        {
          "id": "i9vzcg8",
          "text": "It's not that. I'm going to put on my conspiracy hat for a moment and say I don't think the Republicans want it to stop. They want these shootings to keep happening, to increase. They want it to reach a tipping point where everyone else will really, actually try to do something. \"Something,\" of course, means real actual restrictions on guns. That will give them the excuse they want to kick off their civil war and ethnically cleanse everyone they don't agree with. The Republican grunts think that then they will live in a paradise with all the freedumbs they want but none for anyone else, while the Republican politicians think they will rule this new Confederacy like plantation owners of the old South. That is their dream, that is what all of their excusing and thoughts and prayersing are for.",
          "timestamp": "2022-05-25 02:40:12",
          "score": 25,
          "num_children": 2,
          "author": 172996,
          "replies": [
            {
              "id": "i9wdya5",
              "text": "Muh freedumbs!",
              "timestamp": "2022-05-25 04:51:37",
              "score": 5,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "i9w39td",
              "text": ">That will give them the excuse they want to kick off their civil war and ethnically cleanse everyone they don't agree with. The Republican grunts think that then they will live in a paradise with all the freedumbs they want but none for anyone else, while the Republican politicians think they will rule this new Confederacy like plantation owners of the old South. That is their dream, that is what all of their excusing and thoughts and prayersing are for.\n\nWe're already IN the midst of a civil war.  This CW won't be like the \"old\" one, with two armies rolling up and fighting pitched battles.  It will be conducted more like 'insurgencies,' with individual \"lone wolves\" coming into 'hoods and committing mass violence for their \"cause.\"",
              "timestamp": "2022-05-25 03:12:20",
              "score": 20,
              "num_children": 2,
              "author": 246718,
              "replies": [
                {
                  "id": "i9we7ja",
                  "text": "For reference, see- Northern Ireland.",
                  "timestamp": "2022-05-25 04:54:22",
                  "score": 10,
                  "num_children": 0,
                  "author": 263443,
                  "replies": []
                },
                {
                  "id": "i9w72wz",
                  "text": "So just regular gang warfare?",
                  "timestamp": "2022-05-25 03:44:50",
                  "score": -20,
                  "num_children": 2,
                  "author": 287746,
                  "replies": [
                    {
                      "id": "i9ydjg5",
                      "text": "If one of the gangs is \"The GQP\" and the other is \"Everyone else\" then sure.",
                      "timestamp": "2022-05-25 16:42:24",
                      "score": 4,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "i9weibq",
                      "text": ">So just regular gang warfare?\n\nNope.  Try again.\\*\n\n\\*(unless you equate daily mass shootings perpetrated by social media deluded incels; armed insurrections and attempted kidnappings of Governors as \"regular gang warfare.\" Then, err...yeah)",
                      "timestamp": "2022-05-25 04:57:39",
                      "score": 3,
                      "num_children": 0,
                      "author": 246718,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9vrkis",
      "text": "Conservatives would sacrifice more children to keep their precious guns",
      "timestamp": "2022-05-25 01:39:11",
      "score": 66,
      "num_children": 2,
      "author": 346281,
      "replies": [
        {
          "id": "i9w13a6",
          "text": "Only if they’re already born though.",
          "timestamp": "2022-05-25 02:54:15",
          "score": 22,
          "num_children": 0,
          "author": 357402,
          "replies": []
        },
        {
          "id": "i9wawcl",
          "text": "Guns that they don't fucking do anything with bug keep locked away for 364 days out of the year and brag about them to their friends.",
          "timestamp": "2022-05-25 04:20:32",
          "score": 9,
          "num_children": 0,
          "author": 340119,
          "replies": []
        }
      ]
    },
    {
      "id": "i9xgipd",
      "text": "Nothing kills American children like republikkkans do.",
      "timestamp": "2022-05-25 12:49:44",
      "score": 12,
      "num_children": 0,
      "author": 229333,
      "replies": []
    },
    {
      "id": "i9vp3o4",
      "text": "I'm tired of seeing stories like this and then the right complaining about their gun rights being encroached. I'd rather not have a mass shooting 2x a week (or more). Everytime I see their \"tots and pears\" lines, it just tells me they do not care about people's lives.",
      "timestamp": "2022-05-25 01:19:43",
      "score": 52,
      "num_children": 1,
      "replies": [
        {
          "id": "i9w18he",
          "text": "Wait, they do something that makes you think they care about people’s lives? Do tell.",
          "timestamp": "2022-05-25 02:55:26",
          "score": 10,
          "num_children": 1,
          "author": 357402,
          "replies": [
            {
              "id": "i9w4c28",
              "text": "They only care about the *unborn* lives, not the little ones in school, fucking disgusting.",
              "timestamp": "2022-05-25 03:21:18",
              "score": 14,
              "num_children": 2,
              "author": 336068,
              "replies": [
                {
                  "id": "i9wcjjm",
                  "text": "They only care about votes and power, not the disgusting stuff they have to do to get them.",
                  "timestamp": "2022-05-25 04:37:08",
                  "score": 10,
                  "num_children": 0,
                  "author": 357402,
                  "replies": []
                },
                {
                  "id": "i9xwbr1",
                  "text": "Yes, thank goodness these kids got to be born before they were slaughtered. ::hard eyeroll:::",
                  "timestamp": "2022-05-25 14:48:43",
                  "score": 6,
                  "num_children": 0,
                  "author": 389128,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9w4bdf",
      "text": "This school is in a rural Texas town. It’s close to the border which means there’s a mixture of political ideologies but overall the county is Republican.\n\nThere’s a very good chance that those innocent children were murdered while their own community at the very least, and possibly own family, continue to vote for the party that facilitates these mass shootings. This community will have lost 18 (at the time I write this) children to this shooter but they will still vote red not matter what. Their guns are more important to them than the children in their community.",
      "timestamp": "2022-05-25 03:21:09",
      "score": 41,
      "num_children": 1,
      "author": 235685,
      "replies": [
        {
          "id": "i9w710i",
          "text": "[removed]",
          "timestamp": "2022-05-25 03:44:22",
          "score": -5,
          "num_children": 1,
          "replies": [
            {
              "id": "i9w82bx",
              "text": "Literally everyone who voted for Texas's two Republican senators voted for this. The extreme overrepresentation of Republicans in the US Senate is the single largest reason nothing can be fixed.",
              "timestamp": "2022-05-25 03:53:55",
              "score": 32,
              "num_children": 0,
              "author": 172996,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9wsh69",
      "text": "If your response to this is more “Thoughts and Prayers” please sit down and STFU, your words ring hollow, and you're not even slightly interested in doing anything about addressing this problem.  Also, yes this is a problem Conservatives, I DO NOT see this happening in ANY other country on Earth.  So the adults in the room need to talk Conservatives, so please go back to kiddie table and colour or something, we do not want to see any more children dying.",
      "timestamp": "2022-05-25 07:53:59",
      "score": 8,
      "num_children": 0,
      "author": 143995,
      "replies": []
    },
    {
      "id": "i9xt3h7",
      "text": "r/guns in damage control mode with a singular “containment thread”. Such a loud echo chamber. They care so little about what happened that they stickied a thread to try to prevent dialogue and discourse.\n\nhttps://www.reddit.com/r/guns/comments/uxdt0b/official_politics_thread_may_25_2022/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nr/conservative quiet on queue with two posts that each have 4 comments with shit like teachers should have been armed.",
      "timestamp": "2022-05-25 14:26:24",
      "score": 7,
      "num_children": 1,
      "author": 142508,
      "replies": [
        {
          "id": "i9ye0mo",
          "text": "Try the SRA.",
          "timestamp": "2022-05-25 16:45:29",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "i9w8hya",
      "text": "[removed]",
      "timestamp": "2022-05-25 03:58:00",
      "score": 28,
      "num_children": 1,
      "replies": [
        {
          "id": "i9wfefc",
          "text": "Wasn’t the shooter Latino and a member of the community?",
          "timestamp": "2022-05-25 05:07:08",
          "score": -4,
          "num_children": 1,
          "author": 305726,
          "replies": [
            {
              "id": "i9wibc0",
              "text": "[removed]",
              "timestamp": "2022-05-25 05:39:44",
              "score": 15,
              "num_children": 2,
              "replies": [
                {
                  "id": "i9wooh8",
                  "text": "I think they were referring to the school shooter?",
                  "timestamp": "2022-05-25 07:00:03",
                  "score": 6,
                  "num_children": 2,
                  "author": 389150,
                  "replies": [
                    {
                      "id": "i9x2ifx",
                      "text": "They were",
                      "timestamp": "2022-05-25 10:22:18",
                      "score": 5,
                      "num_children": 0,
                      "author": 246430,
                      "replies": []
                    },
                    {
                      "id": "i9yoqjs",
                      "text": "[removed]",
                      "timestamp": "2022-05-25 17:54:56",
                      "score": 2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "i9yvwjo",
                          "text": "Sorry if I’m getting incorrect information somehow… but the school shooter, Salvador Ramos, was Hispanic too? No? And I read that he lived a few meters from the school.. So he didn’t drive miles out of his way to do it. Can you tell me where you read that he went to that school specifically to target Hispanics?\nYour earlier post only references facts related to the Buffalo shooter.",
                          "timestamp": "2022-05-25 18:41:46",
                          "score": 1,
                          "num_children": 1,
                          "author": 389150,
                          "replies": [
                            {
                              "id": "i9z3uok",
                              "text": "[removed]",
                              "timestamp": "2022-05-25 19:34:55",
                              "score": 0,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "i9z7sqg",
                                  "text": "Right. So someone comments saying\n>\tWasn’t the shooter Latino and a member of the community?\n\nYou respond with\n>\tNo. White male.\n\n>But nice try attempting to blame brown people.\n\nYour responses haven’t been clear and honestly it seems like you’re just saying shit without really knowing the facts yourself.\n\nI don’t believe that the person asking about the shooter being Latino was blaming “MUH BROWN PEOPLE” and you seem far too eager to jump to that conclusion.\n\nBy attributing this tragedy to Tucker Carlson’s despicable ‘replacement theory’, when there is currently no evidence to support it being the shooter’s motive, you’re acting just as irresponsible and dangerous as the people on the far-right who constantly spread bullshit claims without bothering to check any facts.",
                                  "timestamp": "2022-05-25 20:01:13",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 389150,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i9xzwvd",
                  "text": "That’s the Buffalo shooter he meant the one in Texas",
                  "timestamp": "2022-05-25 15:13:04",
                  "score": 2,
                  "num_children": 0,
                  "author": 12786,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9vwtd4",
      "text": "They are against abortions but pro sacrifice of their children for their precious guns. Sick mother fuckers.",
      "timestamp": "2022-05-25 02:20:17",
      "score": 24,
      "num_children": 0,
      "author": 208388,
      "replies": []
    },
    {
      "id": "i9x0kov",
      "text": "My heart goes out to these children, the teacher and their loved one. I hope the shooter rots in hell for this.",
      "timestamp": "2022-05-25 09:55:34",
      "score": 5,
      "num_children": 0,
      "author": 398010,
      "replies": []
    },
    {
      "id": "i9x3ypr",
      "text": "How are you planning on never forgetting tho? Can you remember the other 288 school shootings in the USA since 2009 (vs 2 in uk/canada/australia/nz combined)?",
      "timestamp": "2022-05-25 10:41:19",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9xixy7",
      "text": "Vote these fuckers out .. disgusting that these 50 senators smirk about this shit, or try to spin it into something else.  Power hungry, insecure white GOP male senators that literally laugh and smirk when this happens.",
      "timestamp": "2022-05-25 13:09:54",
      "score": 6,
      "num_children": 0,
      "author": 123179,
      "replies": []
    },
    {
      "id": "i9x5o1z",
      "text": "Time for your to to grow up and get rid of all the guns",
      "timestamp": "2022-05-25 11:02:19",
      "score": 4,
      "num_children": 0,
      "author": 353224,
      "replies": []
    },
    {
      "id": "i9xkx8k",
      "text": "I don't remember reading about AR15's in the Constitution...they are not specifically defined, much like women's rights.",
      "timestamp": "2022-05-25 13:25:33",
      "score": 4,
      "num_children": 0,
      "author": 235607,
      "replies": []
    },
    {
      "id": "i9x0gdb",
      "text": "As a US Army combat veteran OEF 2012-2013, kids these days are doing more to protect the right to bear arms than I ever did.",
      "timestamp": "2022-05-25 09:53:47",
      "score": 9,
      "num_children": 0,
      "author": 393685,
      "replies": []
    },
    {
      "id": "i9wjbtu",
      "text": "There are libertarian subs here that sincerely believe this.",
      "timestamp": "2022-05-25 05:51:27",
      "score": 6,
      "num_children": 0,
      "author": 79017,
      "replies": []
    },
    {
      "id": "i9wb92g",
      "text": "Unbelievable",
      "timestamp": "2022-05-25 04:23:56",
      "score": 2,
      "num_children": 0,
      "author": 263895,
      "replies": []
    },
    {
      "id": "i9wehl3",
      "text": "This makes me sad.",
      "timestamp": "2022-05-25 04:57:25",
      "score": 2,
      "num_children": 0,
      "author": 187907,
      "replies": []
    },
    {
      "id": "i9x1mx5",
      "text": "💔💔💔",
      "timestamp": "2022-05-25 10:10:31",
      "score": 2,
      "num_children": 0,
      "author": 366577,
      "replies": []
    },
    {
      "id": "i9x7148",
      "text": "Was the sign made in irony or is it a republican?",
      "timestamp": "2022-05-25 11:17:55",
      "score": 2,
      "num_children": 0,
      "author": 81557,
      "replies": []
    },
    {
      "id": "i9y458l",
      "text": "Damn. That hurt to see",
      "timestamp": "2022-05-25 15:41:14",
      "score": 2,
      "num_children": 0,
      "author": 373525,
      "replies": []
    },
    {
      "id": "i9vqfts",
      "text": "REPEAL THE SECOND AMMENDMENT",
      "timestamp": "2022-05-25 01:30:17",
      "score": 16,
      "num_children": 2,
      "author": 105022,
      "replies": [
        {
          "id": "i9w140g",
          "text": "Or have the well maintained militia part actually, um.. like apply and stuff?!? 🧐",
          "timestamp": "2022-05-25 02:54:25",
          "score": 13,
          "num_children": 0,
          "author": 20155,
          "replies": []
        },
        {
          "id": "i9vti3e",
          "text": "*amend the second amendment",
          "timestamp": "2022-05-25 01:54:12",
          "score": 20,
          "num_children": 2,
          "author": 21945,
          "replies": [
            {
              "id": "i9w7ujj",
              "text": "How about apply the Second Amendment as it's written: which is to say, doesn't apply to anything anymore ever since the National Guard was established. It's literally meaningless now.",
              "timestamp": "2022-05-25 03:51:50",
              "score": 16,
              "num_children": 0,
              "author": 172996,
              "replies": []
            },
            {
              "id": "i9vytiq",
              "text": "Please just make it so 18 year olds can't buy guns... And AT LEAST make background checks mandatory... Kid walked into a gun shop and got 2 assault rifles on his 18th birthday. Fucking hell man. Nothing will come of these kids' deaths.",
              "timestamp": "2022-05-25 02:35:54",
              "score": 19,
              "num_children": 2,
              "author": 33147,
              "replies": [
                {
                  "id": "i9vyz9b",
                  "text": "You're absolutely right. I think psychological evaluation should be a requisite.",
                  "timestamp": "2022-05-25 02:37:12",
                  "score": 18,
                  "num_children": 1,
                  "author": 21945,
                  "replies": [
                    {
                      "id": "i9w1hl2",
                      "text": "Annual psych exams. Jeff may be okay one year and unhinged the next.",
                      "timestamp": "2022-05-25 02:57:28",
                      "score": 14,
                      "num_children": 2,
                      "author": 393181,
                      "replies": [
                        {
                          "id": "i9ye60n",
                          "text": "Nope.\n\nBecause then \"being gay\" will become a reason to be denied a gun.\n\nMaybe \"hysterical\" will come back as a mental disorder for women as well?",
                          "timestamp": "2022-05-25 16:46:26",
                          "score": 4,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "i9yhieu",
                              "text": "Atheist? Denied  \nDidn’t vote Republican? Denied  \n\nThis is what would actually happen.",
                              "timestamp": "2022-05-25 17:08:00",
                              "score": 4,
                              "num_children": 1,
                              "author": 405424,
                              "replies": [
                                {
                                  "id": "i9yi09q",
                                  "text": "Yeap.\n\nAlso, Trans? Denied.  Gay? Denied.  Skin too dark? Denied.  Not their brand of Christian? Denied.\n\nIf that's (somehow, with this SC) found unconstitutional then they'll just bring back the Louisiana Literacy Test.",
                                  "timestamp": "2022-05-25 17:11:16",
                                  "score": 5,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "i9w2ibb",
                          "text": "Anyone named Jeff is always unhinged.",
                          "timestamp": "2022-05-25 03:05:53",
                          "score": 4,
                          "num_children": 0,
                          "author": 33147,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "i9we6jo",
                  "text": "It’s absolutely insane that it is simple as that to get an assault rifle in Texas.",
                  "timestamp": "2022-05-25 04:54:04",
                  "score": 6,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "i9xjm31",
      "text": "[Thoughts and Prayers](https://youtu.be/4DQ-2tDzJxw)",
      "timestamp": "2022-05-25 13:15:21",
      "score": 1,
      "num_children": 0,
      "author": 248773,
      "replies": []
    },
    {
      "id": "i9ybm5i",
      "text": "Sad but that MURiCa for you",
      "timestamp": "2022-05-25 16:29:55",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "i9z4qvw",
      "text": "This is disgusting. \n\nI really think we shouldn’t allow rifles outside of private property unless they’re dismantled in a case. I get carrying handguns for self defense but no one should have a rifle outside of their house, hunting grounds or shooting range.\n\nI say this as a transfem who’s pro second amendment.",
      "timestamp": "2022-05-25 19:40:54",
      "score": 1,
      "num_children": 0,
      "author": 186485,
      "replies": []
    },
    {
      "id": "ia0qvws",
      "text": "Maybe they SHOULD be remembered on Memorial day when we honor those who gave their lives or protect ours🤬",
      "timestamp": "2022-05-26 02:55:20",
      "score": 1,
      "num_children": 0,
      "author": 125878,
      "replies": []
    },
    {
      "id": "i9ybrox",
      "text": "[removed]",
      "timestamp": "2022-05-25 16:30:55",
      "score": -2,
      "num_children": 1,
      "replies": [
        {
          "id": "i9zh74w",
          "text": "I think it’s fair to also blame the laws that allowed a teenager to purchase a weapon capable of killing lots of people quickly.   That doesn’t mean the shooter isn’t a dick, but let’s not ignore the system that allowed this to happen. \n\nIn 6 months we’ll be ten years from Sandy hook. People such as yourself said the same thing back then too. So when are we allowed to talk about this?\n\nHow many more dead kids?",
          "timestamp": "2022-05-25 21:05:26",
          "score": 2,
          "num_children": 0,
          "author": 230788,
          "replies": []
        }
      ]
    },
    {
      "id": "i9vs4w2",
      "text": "[deleted]",
      "timestamp": "2022-05-25 01:43:33",
      "score": -24,
      "num_children": 2,
      "replies": [
        {
          "id": "i9vyjfs",
          "text": "sir what subreddit do you think you’re on, get the fuck out of here with your white victim complex",
          "timestamp": "2022-05-25 02:33:43",
          "score": 11,
          "num_children": 1,
          "author": 146294,
          "replies": [
            {
              "id": "i9w0t11",
              "text": "I was relaying what I was seeing on conservative forums. I guess people missed the /s",
              "timestamp": "2022-05-25 02:51:54",
              "score": 2,
              "num_children": 0,
              "author": 163056,
              "replies": []
            }
          ]
        },
        {
          "id": "i9w1fxj",
          "text": "You’re not smart enough to pull of sarcasm.",
          "timestamp": "2022-05-25 02:57:05",
          "score": 4,
          "num_children": 1,
          "author": 357402,
          "replies": [
            {
              "id": "i9w1lwf",
              "text": "I reckon so",
              "timestamp": "2022-05-25 02:58:28",
              "score": 4,
              "num_children": 0,
              "author": 163056,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9w83ib",
      "text": "we dont have a gun problem, we have a mental health problem in this country.",
      "timestamp": "2022-05-25 03:54:14",
      "score": -34,
      "num_children": 3,
      "author": 3414,
      "replies": [
        {
          "id": "i9wmos7",
          "text": "Don’t you fucking dare try to pin this on us. Mental illness doesn’t cause most people to go on a murderous rampage. The ability for people to buy guns unhindered when they ARE the very small majority to murder us the problem. Fuck you and fuck your guns.",
          "timestamp": "2022-05-25 06:33:38",
          "score": 18,
          "num_children": 1,
          "author": 393993,
          "replies": [
            {
              "id": "i9yegsi",
              "text": "Agreed, you have a Nazi problem in the USA.\n\nThey do the overwhelming majority of these shootings, after all.\n\nDon't ban the tool, do what Germany did after WW2 and ban the ideology.",
              "timestamp": "2022-05-25 16:48:22",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "i9y3a0o",
          "text": "And Republicans don't want to do anything about that either.",
          "timestamp": "2022-05-25 15:35:33",
          "score": 3,
          "num_children": 1,
          "author": 37091,
          "replies": [
            {
              "id": "i9y4jz9",
              "text": "fuck both partys. fuck the two party system that gets nothing done. republicans have been in power plenty of times in the past decade to actually get more gun laws passed that are pro2a but instead have squandered it. likewise the dems have been in power PLENTY of times since the roe v wade decision and have done nothing to actually codify it or protect women since. i blame both partys for americas decline.",
              "timestamp": "2022-05-25 15:43:56",
              "score": -1,
              "num_children": 0,
              "author": 3414,
              "replies": []
            }
          ]
        },
        {
          "id": "i9ysobg",
          "text": "We have a hatred and coping problem in this country. \n\nSaying it's a mental health problem leads to people think it's a rare issue and that to themselves that they are stable and don't need to seek help. Most of the motivations behind these people believe there's something not right about this country, and they all came to the conclusion that it was \"others\" that are the problem. And you have outlets that promote those thoughts which further fans the flame to a point where these people feel they need to do something.",
          "timestamp": "2022-05-25 18:20:46",
          "score": 2,
          "num_children": 0,
          "author": 378613,
          "replies": []
        }
      ]
    },
    {
      "id": "i9wav9q",
      "text": "[deleted]",
      "timestamp": "2022-05-25 04:20:15",
      "score": -24,
      "num_children": 1,
      "replies": [
        {
          "id": "i9y90r7",
          "text": "The way you know you’re using whataboutism in an argument is you start with “what about”. \n\nFor example, “what about the children who die of neglect or abuse because they are born in situations no child should ever be in?”\n\nAlso, what about the fully-formed and actually living children who were massacred yesterday because the second amendment is far too broadly interpreted and the gun lobby has no soul?\n\nThat’s another example.",
          "timestamp": "2022-05-25 16:13:07",
          "score": 2,
          "num_children": 1,
          "author": 230788,
          "replies": [
            {
              "id": "i9yem4x",
              "text": "> Also, what about the fully-formed and actually living children who were massacred yesterday because the second amendment is far too broadly interpreted and the gun lobby has no soul?\n\nAlso, what about the conservative demagogues who encourage this behaviour?",
              "timestamp": "2022-05-25 16:49:19",
              "score": 5,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9wgp5w",
      "text": "[deleted]",
      "timestamp": "2022-05-25 05:21:25",
      "score": -19,
      "num_children": 2,
      "replies": [
        {
          "id": "i9x2sh4",
          "text": "For wanting to protect our actual living and breathing children?",
          "timestamp": "2022-05-25 10:26:00",
          "score": 6,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "i9y9y9z",
          "text": "I mean, a bunch of kids were murdered yesterday. It’s a sad day. \n\nThough I’d say anger is more what’s actually going on here. Anger that this happened 10 years ago in Sandy hook and fucking nothing has changed. \n\nI don’t know your politics and I don’t really care, but if you’re not pissed, if you’re not sick of “thoughts and prayers”, if you can’t see the right wing gun lobby for what they are, (absolutely soulless), well than you’re doing it wrong.",
          "timestamp": "2022-05-25 16:19:16",
          "score": 3,
          "num_children": 2,
          "author": 230788,
          "replies": [
            {
              "id": "i9zh8w8",
              "text": "Ummm.  I went to Columbine H.S.   This has been a problem much longer then Sandy Hook.   \n\nAlso I’m ready to punch in the face anybody who gives me the thoughts and prays bullshit.   Fuck that noise.",
              "timestamp": "2022-05-25 21:05:46",
              "score": 2,
              "num_children": 1,
              "author": 143222,
              "replies": [
                {
                  "id": "ia07ijf",
                  "text": "I remember columbine well, partly cause I was the same age as most of the victims. I remember where I was when I heard the news. I used Sandy hook just as an example of how bad it gets when little kids are involved and also that that was ten years ago and nothing has changed. \n\nI agree though, thoughts and prayers can go right back in the asshole who farts them out.",
                  "timestamp": "2022-05-26 00:24:40",
                  "score": 1,
                  "num_children": 0,
                  "author": 230788,
                  "replies": []
                }
              ]
            },
            {
              "id": "i9yf9vu",
              "text": "People are wierd.\n\nYou care more about ~20 people dying in a flashy way in a day than ~40,000 dying in a boring way in one day.\n\nBoth are the Republican's fault, btw.",
              "timestamp": "2022-05-25 16:53:34",
              "score": 0,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "i9wdbgu",
      "text": "Based",
      "timestamp": "2022-05-25 04:45:02",
      "score": -1,
      "num_children": 0,
      "replies": []
    }
  ]
}