{
  "id": "v0c35o",
  "text": "The Ever-Increasing Normalization Of Absolute Lunacy\n",
  "timestamp": "2022-05-29 14:15:58",
  "score": 4056,
  "subreddit": "t5_3fdcn",
  "num_children": 26,
  "author": 156679,
  "replies": [
    {
      "id": "iafgk0h",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-05-29 14:15:59",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "iafowui",
      "text": "The most unrealistic thing about Dale is that he isn't racist",
      "timestamp": "2022-05-29 15:20:53",
      "score": 522,
      "num_children": 4,
      "author": 392437,
      "replies": [
        {
          "id": "iag9wpy",
          "text": "And loves his gay dad :)\n\nI actually don’t think any of Rainey street would vote Republican in 2022, despite being ‘Bush Country’ at the time",
          "timestamp": "2022-05-29 17:58:22",
          "score": 298,
          "num_children": 4,
          "author": 235605,
          "replies": [
            {
              "id": "iagii4p",
              "text": "They'd do as they're told after receiving the propaganda. Every currently frothing double Trump voter was like \"get this clown off my TV\" the first night of the Republican debates.",
              "timestamp": "2022-05-29 19:05:08",
              "score": 157,
              "num_children": 3,
              "author": 150427,
              "replies": [
                {
                  "id": "iaguepy",
                  "text": "I don’t think Hank would ever vote for Trump, even if he wasn’t a New Yorker… \n\nJust seems to actively respect women (takes in a sex worker), abhor racism etc. So I feel this entirely fictional character would be a Dem but depressed about it\n\nEdit- the mocking of the disabled person would’ve been it for Hank I think",
                  "timestamp": "2022-05-29 20:39:18",
                  "score": 106,
                  "num_children": 5,
                  "author": 235605,
                  "replies": [
                    {
                      "id": "iagzxx4",
                      "text": "I think that would be the outcome. Hank had always been a Republican but would be depressed to see Joe Biden being closer to his values than the Republican President. The episode would be about him and the guys all reluctantly voting for Biden but not telling each other.",
                      "timestamp": "2022-05-29 21:24:32",
                      "score": 100,
                      "num_children": 1,
                      "author": 68813,
                      "replies": [
                        {
                          "id": "iah40iy",
                          "text": "Agreed! That would be a good episode. \n\nI could also weirdly see Hank going for Bernie over Hilary (and taking it to his grave) but that’s deeply speculative head canon based on the fact i think he generally comes to progressive conclusions, eventually",
                          "timestamp": "2022-05-29 21:58:03",
                          "score": 54,
                          "num_children": 1,
                          "author": 235605,
                          "replies": [
                            {
                              "id": "iahdwi5",
                              "text": "Hank would absolutely never vote for Bernie. \n\nFirst, Hank despises socialists. He comes to accepting solutions, he accepts Bobby, he accepts Dale's gay dad etc. but that doesn't make him ever acknowledge a positive about socialism.\n\nSecond, Bernie wasn't in the general election and Hank wouldn't be voting in the Democratic primary. Hank would have voted in the Republican Primary. Probably for John Kasich or someone like that.",
                              "timestamp": "2022-05-29 23:22:53",
                              "score": 26,
                              "num_children": 1,
                              "author": 68813,
                              "replies": [
                                {
                                  "id": "iahhhlm",
                                  "text": "Oh I don’t think he’d *vote* for Hilary or Bernie- I just think he’d begrudgingly like Bernie as a comparatively non-cosmopolitan man of the people.\n\nI certainly think Mike Judge gave him the depth to respect and even like people with whom he strongly disagreed.\n\nI don’t know why this speculation is fun, and whether if the reboot does happen we’ll see how the showrunners treat character development \n\nAlso RIP Luanne if there is a reboot, she was just the best character IMO and such a tragedy.",
                                  "timestamp": "2022-05-29 23:54:25",
                                  "score": 20,
                                  "num_children": 0,
                                  "author": 235605,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iahtyt4",
                      "text": "I suddenly want to watch hank and ron swanson build a chair together only to get in a fight over propane and charcoal.",
                      "timestamp": "2022-05-30 01:43:32",
                      "score": 9,
                      "num_children": 0,
                      "author": 161712,
                      "replies": []
                    },
                    {
                      "id": "iaiqyfv",
                      "text": "As soon as Hank learned how trump ate his steaks he wouldn't vote for him",
                      "timestamp": "2022-05-30 07:23:02",
                      "score": 4,
                      "num_children": 0,
                      "author": 164159,
                      "replies": []
                    },
                    {
                      "id": "iaibpgg",
                      "text": "My dad's a real Hank. Voted for Trump twice, even though \"conflicted\" because the alternative was unthinkable and \"at least the stuff I believe in has a snowball's chance in hell of passing,\" and \"democrats will pass taxes\"",
                      "timestamp": "2022-05-30 04:18:32",
                      "score": 3,
                      "num_children": 0,
                      "author": 137642,
                      "replies": []
                    },
                    {
                      "id": "iaisk42",
                      "text": "[Someone actually did a dive into his thoughts on this](https://www.youtube.com/watch?v=EjnZIacEWFI)",
                      "timestamp": "2022-05-30 07:46:26",
                      "score": 0,
                      "num_children": 0,
                      "author": 138007,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iagmzlx",
                  "text": "I can see an entire episode about this. They initially hear the idea of world-class millionaire Donald Trump being president in 2016, and be all for it. Then over time, they'd see what he's actually advocating for, how that would harm their friends and loved ones, and ultimately decide against it come election day. The side-story would be Peggy getting swept-up in the MAGA merchandising craze, and eventually drop it after seeing how far it goes.\n\nThey're conservatives, but they're the centrist, open-minded kind, who can be swayed away through sympathy and learning experiences.",
                  "timestamp": "2022-05-29 19:40:05",
                  "score": 57,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iagoa00",
                      "text": "Every conservative I know who seemed like that voted for Trump on some pragmatic basis and has since gone full redhat. Any credible plotline couldn't really be based on some fantasy of our friends and relatives seeing reason. It would just be progressive wishful thinking.",
                      "timestamp": "2022-05-29 19:50:07",
                      "score": 58,
                      "num_children": 2,
                      "author": 150427,
                      "replies": [
                        {
                          "id": "iagznym",
                          "text": "The fact that white men were the biggest demographic swing away from Trump between 2016 and 2020 indicates that there are indeed a lot of suburban people like them who are conservative but open-minded enough to have dropped Trump the more they heard from him.",
                          "timestamp": "2022-05-29 21:22:13",
                          "score": 20,
                          "num_children": 0,
                          "author": 68813,
                          "replies": []
                        },
                        {
                          "id": "iaj6xi8",
                          "text": "I can say I actually was one of those people, except I got swept up in the crazy for a while before realizing how fucked everything was",
                          "timestamp": "2022-05-30 11:17:38",
                          "score": 2,
                          "num_children": 0,
                          "author": 64947,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "idoa708",
                  "text": "Hank was an amazing allegory for how the texan that never thinks he's wrong will ultimately never be right",
                  "timestamp": "2022-06-25 10:51:28",
                  "score": 1,
                  "num_children": 0,
                  "author": 366687,
                  "replies": []
                }
              ]
            },
            {
              "id": "iagzgkw",
              "text": "Bill and Khan would. Bill's greatest need is to feel like he's a valued part of something, that's exactly the sort of loser that gets suckered into MAGA. Khan loves feeling better than everyone else and he'd be the type of guy to brag about immigrating \"the right way\" and vote for an anti-immigration platform. Hank would hate voting because he believes it's his civic duty, but would struggle to feel like there was a political party that represents him since he's a conservative but not insane. Dale wouldn't vote. Boomhauer would vote Democratic because chicks hate Republicans now.",
              "timestamp": "2022-05-29 21:20:31",
              "score": 60,
              "num_children": 1,
              "author": 68813,
              "replies": [
                {
                  "id": "iaiei6t",
                  "text": "I feel like Hank would end up writing in Bill Weld or something, being upset that the GOP wouldn't allow Primary challenges. The value of a primary seems like something that would concern Hank, far more than Weld being from New England of all places.",
                  "timestamp": "2022-05-30 04:47:39",
                  "score": 7,
                  "num_children": 0,
                  "author": 61055,
                  "replies": []
                }
              ]
            },
            {
              "id": "iahqong",
              "text": "Dale doesn't vote. They can lift your DNA from the pencil, and then they got ya.",
              "timestamp": "2022-05-30 01:15:17",
              "score": 17,
              "num_children": 1,
              "author": 292906,
              "replies": [
                {
                  "id": "iahsjnv",
                  "text": "This is the only right answer. \n\nDale is closest to a sovcit than anything else. All government are bastards.",
                  "timestamp": "2022-05-30 01:31:21",
                  "score": 10,
                  "num_children": 1,
                  "author": 321367,
                  "replies": [
                    {
                      "id": "iahwaz9",
                      "text": "There's even an episode where he's in a courtroom, and calls out the flag for having a yellow fringe, saying something about \"maritime law\".",
                      "timestamp": "2022-05-30 02:03:12",
                      "score": 9,
                      "num_children": 0,
                      "author": 62956,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iahtvgj",
              "text": "Not after that limp handshake from Bush, I tell you what.",
              "timestamp": "2022-05-30 01:42:45",
              "score": 9,
              "num_children": 0,
              "author": 176492,
              "replies": []
            }
          ]
        },
        {
          "id": "iag1b4r",
          "text": "Dale and Octavio had so many wacky adventures",
          "timestamp": "2022-05-29 16:53:04",
          "score": 20,
          "num_children": 0,
          "author": 375539,
          "replies": []
        },
        {
          "id": "iag7gh5",
          "text": "[deleted]",
          "timestamp": "2022-05-29 17:39:35",
          "score": 59,
          "num_children": 2,
          "replies": [
            {
              "id": "iagzsq8",
              "text": "Dale wouldn't trust Fox News, he'd only trust Weekly World News. Dale actively does anti-racist work. He was the #1 supporter who helped John Redcorn's attempts to get his land back.",
              "timestamp": "2022-05-29 21:23:20",
              "score": 50,
              "num_children": 1,
              "author": 68813,
              "replies": [
                {
                  "id": "iaiei62",
                  "text": "Dale would be a huge Alex Jones fan.",
                  "timestamp": "2022-05-30 04:47:39",
                  "score": 3,
                  "num_children": 0,
                  "author": 356624,
                  "replies": []
                }
              ]
            },
            {
              "id": "iahg7z9",
              "text": "Dale would claim fox news is a government controlled stooge and ignore it",
              "timestamp": "2022-05-29 23:43:15",
              "score": 10,
              "num_children": 0,
              "author": 17317,
              "replies": []
            }
          ]
        },
        {
          "id": "iaj60lc",
          "text": "Exactly!",
          "timestamp": "2022-05-30 11:05:38",
          "score": 1,
          "num_children": 0,
          "author": 332645,
          "replies": []
        }
      ]
    },
    {
      "id": "iagc3yh",
      "text": "Dale Gribble is much more sane than an Alt-Right conspiracy theorist.",
      "timestamp": "2022-05-29 18:15:21",
      "score": 120,
      "num_children": 1,
      "author": 359897,
      "replies": [
        {
          "id": "iah06aq",
          "text": "Pretty much! The big conspiracy theories that Dale believes are various JFK assassination theories and that aliens are hidden by the government, both of which are more plausible than the QAnon theories.",
          "timestamp": "2022-05-29 21:26:26",
          "score": 70,
          "num_children": 1,
          "author": 68813,
          "replies": [
            {
              "id": "iaiel0o",
              "text": "Dale would consider Q to be child's play.",
              "timestamp": "2022-05-30 04:48:30",
              "score": 4,
              "num_children": 1,
              "author": 61055,
              "replies": [
                {
                  "id": "iaipw45",
                  "text": "Or consider them plants by the government to make legitimate conspiritists look insane.",
                  "timestamp": "2022-05-30 07:08:07",
                  "score": 13,
                  "num_children": 0,
                  "author": 118916,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iagdaox",
      "text": "One minor point: in the 90s, we didn't have the fig leaf of *alt-right.*\n\nIt was just *right-wing* or *far right* or *wingnut.*\n\nAh, the good 'ol days.",
      "timestamp": "2022-05-29 18:24:31",
      "score": 78,
      "num_children": 1,
      "author": 10796,
      "replies": [
        {
          "id": "iah0322",
          "text": "And Dale was the better kind of conspiracy theorist, he hated ALL government factions he didn't think that the Democrats were evil while the Republicans were valiant heroes. He thought the government as a whole was evil.",
          "timestamp": "2022-05-29 21:25:42",
          "score": 51,
          "num_children": 2,
          "author": 68813,
          "replies": [
            {
              "id": "iah5vyo",
              "text": "Honestly, I entirely get that kind of conspiracy theorist. I think it's entirely reasonable to come to that conclusion.",
              "timestamp": "2022-05-29 22:13:50",
              "score": 24,
              "num_children": 0,
              "author": 281375,
              "replies": []
            },
            {
              "id": "iai4ckr",
              "text": "Respect for dale\n\nHe equally hates all governments",
              "timestamp": "2022-05-30 03:11:54",
              "score": 6,
              "num_children": 0,
              "author": 58141,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iafmwn9",
      "text": "Hank Hill, 1997 - Average Republican\n\nHank Hill, 2022 - Republican in name only..",
      "timestamp": "2022-05-29 15:05:51",
      "score": 142,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iafvw7k",
      "text": "I feel like Dale wouldn’t be Alt Right when it goes mainstream, like seeing Q on a shirt would make him skepticle it’s a CIA Op. \n\nBut Mike Judge would make a great episode about coming to terms with your beliefs and putting the greater well being of your friends and family before finding the truth.",
      "timestamp": "2022-05-29 16:12:53",
      "score": 116,
      "num_children": 0,
      "author": 406318,
      "replies": []
    },
    {
      "id": "iafhdgo",
      "text": "Thanks Fox News and the fucked up conservative mega media network.",
      "timestamp": "2022-05-29 14:22:48",
      "score": 61,
      "num_children": 1,
      "author": 249542,
      "replies": [
        {
          "id": "iaha8qo",
          "text": "Don't forget Limbaugh!\n\nAlthough Republicans seem to have done so.  Poor, poor Rush.",
          "timestamp": "2022-05-29 22:50:56",
          "score": 5,
          "num_children": 0,
          "author": 10796,
          "replies": []
        }
      ]
    },
    {
      "id": "iah1dnv",
      "text": "I was trying to explain this to my dad the other day and he just thought I was full of Shit\n\nThe candidates who have the most extreme views as republicans tend to win elections\n\nThe candidates who have the most “moderate” views among democrats tend to win elections\n\nSo we get the “ratchet effect” where both political parties get pulled to the right as time goes on.",
      "timestamp": "2022-05-29 21:36:21",
      "score": 17,
      "num_children": 1,
      "replies": [
        {
          "id": "iah8xjq",
          "text": "*The national DNC, aided hard by most media outlets, pushes hard for the candidates who have the most pro-corporate positions among democrats to be seen as \"electable moderates,\" so they tend to win elections*\n\nFIFY",
          "timestamp": "2022-05-29 22:39:39",
          "score": 1,
          "num_children": 1,
          "author": 10796,
          "replies": [
            {
              "id": "iahwpy2",
              "text": "They're using the bullshit myth that there's a bunch of swing voters out there that can go either way so they need moderates to sway them.  \n\n\nReally, it's just people voting for the lesser of two evils to keep Republicans out of office and desperately wishing there was an actual progressive candidate to vote for.",
              "timestamp": "2022-05-30 02:06:41",
              "score": 11,
              "num_children": 0,
              "author": 62956,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iah1evo",
      "text": "Dale is too far left for them",
      "timestamp": "2022-05-29 21:36:37",
      "score": 18,
      "num_children": 0,
      "author": 331786,
      "replies": []
    },
    {
      "id": "iafyabd",
      "text": "The same thing is happening in France.\n\n20 years ago, Jean-Marie Le Pen is rightfully seen as a far right loony.\n\n20 years later, his daughter Marine Le Pen, spouting the same anti-immigrant policies as her dad, is now the \"mainstream right wing\" candidate in last month's presidential election, squeezing out the \"traditional\" right wing parties. Because there's another loony in Zemmour in her right.",
      "timestamp": "2022-05-29 16:30:25",
      "score": 49,
      "num_children": 1,
      "replies": [
        {
          "id": "iahg0du",
          "text": "You tell this to liberals and they act like you're crazy. They think the world has only gotten more progressive over time, when it's been an equal and opposite backlash that has made the right crazier.",
          "timestamp": "2022-05-29 23:41:26",
          "score": 7,
          "num_children": 0,
          "author": 259310,
          "replies": []
        }
      ]
    },
    {
      "id": "iahb21x",
      "text": "Dale doesn’t deserve to be insulted like this, he has *some* morals",
      "timestamp": "2022-05-29 22:58:03",
      "score": 13,
      "num_children": 0,
      "author": 335176,
      "replies": []
    },
    {
      "id": "iagigyj",
      "text": "He was right about the NSA though.",
      "timestamp": "2022-05-29 19:04:54",
      "score": 11,
      "num_children": 0,
      "author": 382541,
      "replies": []
    },
    {
      "id": "iagr5j8",
      "text": "Maybe I need to watch more KotH but I thought Dale Gribble was more like a Libertarian",
      "timestamp": "2022-05-29 20:12:54",
      "score": 9,
      "num_children": 2,
      "author": 412396,
      "replies": [
        {
          "id": "iagu3n3",
          "text": "I got total SovCit vibes off Dale. Shi-shishaaaaaa!",
          "timestamp": "2022-05-29 20:36:46",
          "score": 10,
          "num_children": 0,
          "author": 301757,
          "replies": []
        },
        {
          "id": "iaiesbn",
          "text": "\"The only candidate I would trust is Vermin Supreme.\"",
          "timestamp": "2022-05-30 04:50:40",
          "score": 3,
          "num_children": 0,
          "author": 61055,
          "replies": []
        }
      ]
    },
    {
      "id": "iah0nt9",
      "text": "I think one of the major things which sets Dale apart from them has to be the fact he has empathy",
      "timestamp": "2022-05-29 21:30:28",
      "score": 9,
      "num_children": 0,
      "author": 39797,
      "replies": []
    },
    {
      "id": "iafw8n6",
      "text": "It’s Always Sunny already did this joke but I hope if they talk about the 2020 election in the revival it comes out that Dale voted for Kanye",
      "timestamp": "2022-05-29 16:15:24",
      "score": 32,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iahfu8d",
      "text": "I don't think Dale was alt right. His conspiracy was never politically motivated to my knowledge.",
      "timestamp": "2022-05-29 23:39:58",
      "score": 10,
      "num_children": 0,
      "author": 259310,
      "replies": []
    },
    {
      "id": "iagsayi",
      "text": "Dale has been a RINO for a while now, he hasn't made death threats to health teachers since season 1.",
      "timestamp": "2022-05-29 20:22:05",
      "score": 8,
      "num_children": 0,
      "author": 76785,
      "replies": []
    },
    {
      "id": "iaha183",
      "text": "The Republican party today is the inevitable conclusion of letting people entertain too much many stupid questions (a la Tucker Carlson style).",
      "timestamp": "2022-05-29 22:49:10",
      "score": 7,
      "num_children": 0,
      "author": 154171,
      "replies": []
    },
    {
      "id": "iafy0zo",
      "text": "Hard pill to swallow for some white people but kkkonservatives have never been normal, reasonable people",
      "timestamp": "2022-05-29 16:28:28",
      "score": 20,
      "num_children": 1,
      "replies": [
        {
          "id": "iaglv3f",
          "text": "Honestly, this. The modern GOP has just learned that it can barrel forward with no consequences, political or otherwise, and still win on insane issues.",
          "timestamp": "2022-05-29 19:31:19",
          "score": 13,
          "num_children": 0,
          "author": 201097,
          "replies": []
        }
      ]
    },
    {
      "id": "iafk82q",
      "text": "Hahahahaa awww",
      "timestamp": "2022-05-29 14:45:52",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iai602v",
      "text": "Gribble would be too anti establishment for them",
      "timestamp": "2022-05-30 03:25:26",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iahcgm9",
      "text": "\"Guns don't kill people,  the government does.\" \n-",
      "timestamp": "2022-05-29 23:10:17",
      "score": 3,
      "num_children": 0,
      "author": 61535,
      "replies": []
    },
    {
      "id": "iahe8b9",
      "text": "He's now a RINO globalist",
      "timestamp": "2022-05-29 23:25:48",
      "score": 3,
      "num_children": 0,
      "author": 45404,
      "replies": []
    },
    {
      "id": "iahi0dr",
      "text": "This is who they've been trying to emulate all these years.",
      "timestamp": "2022-05-29 23:59:06",
      "score": 3,
      "num_children": 0,
      "author": 91284,
      "replies": []
    },
    {
      "id": "iai1xmw",
      "text": "When has dale been racist ?",
      "timestamp": "2022-05-30 02:51:13",
      "score": 1,
      "num_children": 0,
      "author": 51309,
      "replies": []
    },
    {
      "id": "iajoeg3",
      "text": "Since we are on the subject about Dale Gribble. I share with you SiR - John Redcorn.\n\nhttps://youtu.be/ZmSORFI2XzU",
      "timestamp": "2022-05-30 14:12:06",
      "score": 1,
      "num_children": 0,
      "author": 210366,
      "replies": []
    }
  ]
}