{
  "id": "v1os45",
  "text": "Domestic terrorist\n",
  "timestamp": "2022-05-31 12:08:10",
  "score": 5027,
  "subreddit": "t5_3fdcn",
  "num_children": 25,
  "author": 133955,
  "replies": [
    {
      "id": "ianjm1f",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-05-31 12:08:11",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "iank6ee",
      "text": "I mean wasn't there 19 of there \"good guys with guns\" there and they were cowards? I remember that correctly right?",
      "timestamp": "2022-05-31 12:13:56",
      "score": 207,
      "num_children": 2,
      "author": 282740,
      "replies": [
        {
          "id": "ianrlxu",
          "text": ">19, but generally yes.",
          "timestamp": "2022-05-31 13:22:16",
          "score": 55,
          "num_children": 0,
          "author": 196730,
          "replies": []
        },
        {
          "id": "iaqvklx",
          "text": "School had security force as well if im remembering right... Like this was full on shitshow for gun lovers narratives  but there ignoring the fact..",
          "timestamp": "2022-06-01 03:40:18",
          "score": 10,
          "num_children": 1,
          "author": 61271,
          "replies": [
            {
              "id": "iaruz9a",
              "text": "Pssh like the GOP is going to be swayed by something silly like facts.",
              "timestamp": "2022-06-01 11:17:04",
              "score": 1,
              "num_children": 0,
              "author": 282740,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ianrbc7",
      "text": "This is the best republicans offer Americans. \nNotice how they offer no solutions to any issues we face today. \nJust mentioning guns. Race, abortion or religions and you can keep the attention of the uneducated republican. \nThat’s almost the entire party. \nJust give tax breaks to the 1% and that’s all of them..",
      "timestamp": "2022-05-31 13:19:51",
      "score": 132,
      "num_children": 5,
      "author": 413154,
      "replies": [
        {
          "id": "iaod9lm",
          "text": "Fucking sad",
          "timestamp": "2022-05-31 16:05:18",
          "score": 29,
          "num_children": 1,
          "author": 330390,
          "replies": [
            {
              "id": "iap2trt",
              "text": "It's fucking pathetic!",
              "timestamp": "2022-05-31 19:04:18",
              "score": 19,
              "num_children": 0,
              "author": 84440,
              "replies": []
            }
          ]
        },
        {
          "id": "iapoktv",
          "text": "Bingo. Republican policies overwhelmingly benefit the wealthy. If you are a working class person voting Republican, you are pretty much saying \"my life has no value. I am a cog in the machine\".\n\nOf course most people won't do that so they need to find other things to get people on board. They appeal to the racists and religious people who have pretty low cognitive ability and can be convinced of almost anything.",
          "timestamp": "2022-05-31 21:53:24",
          "score": 16,
          "num_children": 0,
          "author": 410685,
          "replies": []
        },
        {
          "id": "iap9wm6",
          "text": "Would it be bad if I wished that they experience the same terror?",
          "timestamp": "2022-05-31 20:06:10",
          "score": 14,
          "num_children": 1,
          "author": 56685,
          "replies": [
            {
              "id": "iapgi2b",
              "text": "OnIy slightly, I say it’s karmic retribution or karmic justice.\n\nBut that’s me being VERY generous in that definition.",
              "timestamp": "2022-05-31 20:53:23",
              "score": 9,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "iap4vi6",
          "text": "Their only solution seems to be to undo all the solutions we’ve come up with since we signed the constitution.  It literally has mechanisms built into it that help it change with the times, that’s the entire point of having a congress. The constitution was meant to be a living document but they act like it’s a religious text that should never have been tampered with and they want to drag us kicking and screaming back into an even more conservative version of the 1700’s.",
          "timestamp": "2022-05-31 19:29:30",
          "score": 19,
          "num_children": 1,
          "author": 251521,
          "replies": [
            {
              "id": "iaqj12h",
              "text": ">The constitution was meant to be a living document\n\nWhy would they need to change it? It's not like guns have changed drastically in power, capacity, and lethality in the past 3 centuries...",
              "timestamp": "2022-06-01 01:53:55",
              "score": 6,
              "num_children": 1,
              "author": 183029,
              "replies": [
                {
                  "id": "ib6c7ov",
                  "text": "It’s like using road laws for horses and carriages in 2022.",
                  "timestamp": "2022-06-04 19:39:20",
                  "score": 2,
                  "num_children": 0,
                  "author": 251521,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ias2lu9",
          "text": ">uneducated republican\n\nunempathetic republican \n\nYes there are tons of People who are Nazis because they are uneducated but it goes deeper than that. I am from Austria where it isn't as bad as the states but we still have more than enough Nazis who are not uneducated at all. Education isn't enough, people need to be raised to respect the democratic process and empathy. There is a lot more to it of course but if we keep the myth alive of only uneducated people being nazis we miss the core of the problem.",
          "timestamp": "2022-06-01 12:36:21",
          "score": 1,
          "num_children": 0,
          "author": 157417,
          "replies": []
        }
      ]
    },
    {
      "id": "iao3c7s",
      "text": "Trump *danced*? Wtf. Why.",
      "timestamp": "2022-05-31 14:54:10",
      "score": 62,
      "num_children": 3,
      "author": 140243,
      "replies": [
        {
          "id": "iao410e",
          "text": "Narcissistic sociopath.",
          "timestamp": "2022-05-31 14:59:15",
          "score": 59,
          "num_children": 0,
          "author": 225718,
          "replies": []
        },
        {
          "id": "iaokp4d",
          "text": "Not ABOUT the dead kids.  Still tasteless as fuck though (which is totally on brand).",
          "timestamp": "2022-05-31 16:57:39",
          "score": 21,
          "num_children": 1,
          "author": 323267,
          "replies": [
            {
              "id": "iaonxz9",
              "text": ">Not ABOUT the dead kids.\n\nWell I sure as fuck hope not. Then again, I feel like I wouldn't have been *that* shocked to learn that he had...\n\nI'm gonna have to look it up on YouTube or something. I need to know in what kind of surreal context could anyone (even him) go from mispronouncing the names of literal murder victims to \"hell yea let's boogie!\"",
              "timestamp": "2022-05-31 17:20:15",
              "score": 23,
              "num_children": 2,
              "author": 140243,
              "replies": [
                {
                  "id": "iaowyz5",
                  "text": "His supporters would still love him.",
                  "timestamp": "2022-05-31 18:23:13",
                  "score": 13,
                  "num_children": 2,
                  "author": 292238,
                  "replies": [
                    {
                      "id": "iapgk5v",
                      "text": "I’m pretty sure that if he said “Fuck dem kids”, his supporters would be lining up in droves just to suck his dick. *THAT’S* how delusional they are.",
                      "timestamp": "2022-05-31 20:53:47",
                      "score": 10,
                      "num_children": 0,
                      "author": 242452,
                      "replies": []
                    },
                    {
                      "id": "iapgaaq",
                      "text": "They would cheer if he shot them himself and danced on the warm bodies.",
                      "timestamp": "2022-05-31 20:51:49",
                      "score": 4,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iapy9fe",
                  "text": "> Then again, I feel like I wouldn't have been that shocked to learn that he had...\n\nI would not have been shocked *at all*.\n\nAnd Qult45 would've *loved* it. 😒",
                  "timestamp": "2022-05-31 23:08:26",
                  "score": 3,
                  "num_children": 0,
                  "author": 354546,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ias458i",
          "text": "I watched the speech and am not sure what she’s talking about when she said he danced.  That didn’t happen after he read the names.",
          "timestamp": "2022-06-01 12:50:24",
          "score": 1,
          "num_children": 0,
          "author": 229567,
          "replies": []
        }
      ]
    },
    {
      "id": "iao4pxy",
      "text": "Americans are too stupid to have untethered gun rights. Any discerning rational person can drive across town to reach this conclusion. 5' soccer moms driving 6,000 lbs SUVs can't be bothered to even use the turn signal before crossing three lanes of traffic to make the exit...and they want to arm these stupid motherfuckers? Holy shitballs. \n\nAnd as for arming teachers?! Are you fucking kidding me? I don't know about you but I had teachers who lacked the physical abilities to clap chalk out of erasers. They want to give these fuckers guns?! Around children? LOL Okay. Give all the black teachers' guns, that won't end tragically when the SWAT teams show up to an \"active shooter\" situation and they see a black guy wielding a firearm. \n\nAnyone falling for these \"arguments\" is an idiot. An idiot with an emotional gun fetish.",
      "timestamp": "2022-05-31 15:04:12",
      "score": 86,
      "num_children": 2,
      "author": 76031,
      "replies": [
        {
          "id": "iaodfog",
          "text": "People keep voting for these assclowns, why ???",
          "timestamp": "2022-05-31 16:06:30",
          "score": 32,
          "num_children": 3,
          "author": 330390,
          "replies": [
            {
              "id": "iaoha0k",
              "text": "Gerrymandering.",
              "timestamp": "2022-05-31 16:33:43",
              "score": 46,
              "num_children": 2,
              "author": 306721,
              "replies": [
                {
                  "id": "iaojblp",
                  "text": "Sad but true",
                  "timestamp": "2022-05-31 16:48:02",
                  "score": 5,
                  "num_children": 0,
                  "author": 158920,
                  "replies": []
                },
                {
                  "id": "iapy6o1",
                  "text": "This.  It's a total shitshow here in Ohio.",
                  "timestamp": "2022-05-31 23:07:49",
                  "score": 5,
                  "num_children": 1,
                  "author": 354546,
                  "replies": [
                    {
                      "id": "iaq09o2",
                      "text": "As someone who is also damned to be in Ohio, yep.",
                      "timestamp": "2022-05-31 23:24:15",
                      "score": 3,
                      "num_children": 1,
                      "author": 306721,
                      "replies": [
                        {
                          "id": "iaq0mkl",
                          "text": "LOL",
                          "timestamp": "2022-05-31 23:27:06",
                          "score": 2,
                          "num_children": 0,
                          "author": 354546,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "iaojdhs",
              "text": "Daily diet of fear of 'Them'. It's all about how people can vote to keep others out of government. As a party of \"small government\", their voters don't expect the GOP to actually do any governing, so no solutions as an expectation is accepted. So as a member of the GOP, all you have to do is scare your voters with rhetoric, and rake in the cash in your backdoor agreements without fear of accountability.",
              "timestamp": "2022-05-31 16:48:24",
              "score": 14,
              "num_children": 0,
              "author": 378613,
              "replies": []
            },
            {
              "id": "iaoqw5k",
              "text": "They're also assclowns. They vote for politicians who care about gun rights more than dead children because they care more about their gun rights than dead children. They vote for racists because they are racist. They vote for politicians who are against womens' rights because they are against womens' rights. Yes, even the women who vote for them, are against *other* women having rights. They think rules being put in place won't be applied to them as stringently, thus giving them an advantage. They can rail against abortion all their lives because they know if they or their daughter ever need one they can jet over to a blue state, get one, and tell everyone they were on a ski trip or something, then go right back to demonizing other women as a show of superiority. They claim they need their guns 'to defend from a tyrannical government' but really they're champing at the bit to BE the tyrannical government. They love nothing more than to be deputized by the state or God to go around inflicting harm on others. They barely even care what the group they're oppressing is, as long as they get to be the oppressors, they're happy. Whether that's roving gangs lynching people of certain races, or having to be satisfied with just voting to make their lives worse with a smug smile on their faces and claiming its because 'they just like small government' when trying to maintain social status in polite company, they just want to hurt others. They view life as a competition and that means making sure others lose.",
              "timestamp": "2022-05-31 17:40:47",
              "score": 10,
              "num_children": 0,
              "author": 43477,
              "replies": []
            }
          ]
        },
        {
          "id": "iap5gce",
          "text": "Yep. It starts with “But guns are fun to shoot and make me feel powerful” and they build their logic from there.",
          "timestamp": "2022-05-31 19:33:58",
          "score": 4,
          "num_children": 0,
          "author": 251521,
          "replies": []
        }
      ]
    },
    {
      "id": "iaornyw",
      "text": "It doesn't occur to them that *\"failed socialist states\"* have the lowest violence rates, while only *\"shithole countries\"* arm their teachers...",
      "timestamp": "2022-05-31 17:46:11",
      "score": 20,
      "num_children": 1,
      "author": 206956,
      "replies": [
        {
          "id": "iapg0vy",
          "text": "Or try to arm the fucking kids!",
          "timestamp": "2022-05-31 20:49:59",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iant9hb",
      "text": "The NRA is a Russian front organization.  It's America's enemies pumping money to Republican candidates, because Republicans hurt America.  \n\n&#x200B;\n\nTrumpets, think about why Russia supports your team.  It's not because Putin thinks your strong and make a better America.",
      "timestamp": "2022-05-31 13:36:08",
      "score": 90,
      "num_children": 1,
      "replies": [
        {
          "id": "iaonier",
          "text": "I was just wondering how much longer the NRA will have their power over Republicans since Russia is going super broke super quickly.\n\nMaybe the fact that they're willing to talk about gun control in congress now is the first crack.",
          "timestamp": "2022-05-31 17:17:15",
          "score": 14,
          "num_children": 1,
          "author": 193551,
          "replies": [
            {
              "id": "iaoroqu",
              "text": "The NRA fell out of favor with actual citizens at least a decade ago. Even more so after they started getting reports on how they were using money that was coming in, but being as the majority of it was coming from corporations and non membership dues, their leadership didn't care.",
              "timestamp": "2022-05-31 17:46:19",
              "score": 18,
              "num_children": 0,
              "author": 191346,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iaod2h1",
      "text": "Self-confessed 'gun nut' here...\n\nI'm starting to come around to the conclusion that Americans are simply not responsible enough to have guns anymore...& we have nobody but ourselves to blame.",
      "timestamp": "2022-05-31 16:03:53",
      "score": 43,
      "num_children": 2,
      "author": 251490,
      "replies": [
        {
          "id": "iaodwub",
          "text": "Selfishness as a virtue was a big part of it. This from the “party of personal responsibility and family values.”",
          "timestamp": "2022-05-31 16:09:56",
          "score": 19,
          "num_children": 1,
          "author": 395070,
          "replies": [
            {
              "id": "iaofjdv",
              "text": "Don’t forget “law and order.”",
              "timestamp": "2022-05-31 16:21:28",
              "score": 13,
              "num_children": 0,
              "author": 350775,
              "replies": []
            }
          ]
        },
        {
          "id": "iaonahn",
          "text": "As a fellow American citizen, I don't want to take guns away from the population, but we're being left with no other option because the other gun-nuts and lobbyists don't come to the table to bring about any sort of solutions outside \"best be prepared\" which has never shown to be effective solution to stopping the gun violence. Hell, I hold the opinion it's strictly a cultural problem in this country. It's the people, not the guns. \n\nWhether it's a member of a gang, or someone that is at the breaking point of doing a mass shooting, someone being on site with a gun is not going to stop them from attempting their actions.   All it does it force them to bring about more powerful weapons than someone may carry. Someone that is accepting of violence as a solution is not scared of someone else having a gun. \n\nIf they came with solutions on their end, the toxicity towards guns in this country, especially for those gun owners that are responsible, wouldn't be so tense. Instead the rhetoric comes down to \"don't move an inch because they'll take a mile\" in terms of guns, despite reality showing otherwise. Now they want to say it's a mental illness problem, yet they won't, and don't want to fund any programs that may address these issues.",
          "timestamp": "2022-05-31 17:15:42",
          "score": 12,
          "num_children": 3,
          "author": 378613,
          "replies": [
            {
              "id": "iap5q4s",
              "text": "I’m fairly sure most mass shooters assume they will be coming against opponents with guns as a natural course of their actions. You’re correct- they prepare for the people with guns and it probably even gets them excited. It doesn’t deter them because it ends in suicide/death most of the time anyway. They ASSUME they’re going to get shot.",
              "timestamp": "2022-05-31 19:36:01",
              "score": 6,
              "num_children": 0,
              "author": 251521,
              "replies": []
            },
            {
              "id": "iapcn98",
              "text": "> I don't want to take guns away from the population\n\nThere isn't a single population on Earth that needs guns anyway.\n\nIf you're an active serviceperson in a military, you get a gun that's handed out when on patrol during combat.\n\nIf you're not? Fuck off, no gun for you, psycho.",
              "timestamp": "2022-05-31 20:25:35",
              "score": 8,
              "num_children": 2,
              "author": 404389,
              "replies": [
                {
                  "id": "iapengy",
                  "text": "Speaking as an American, with a diverse environments, and and living situations, I feel there are instances where having a gun would be a good tool to have depending on where you live and what you need to contend with on a daily basis. \n\nThe big issue is the American culture and how they handle having access to guns. That's where the main problem is at.",
                  "timestamp": "2022-05-31 20:40:03",
                  "score": 3,
                  "num_children": 0,
                  "author": 378613,
                  "replies": []
                },
                {
                  "id": "iapjpvy",
                  "text": "Youre right, pests and hunters no longer exist. Get real",
                  "timestamp": "2022-05-31 21:16:59",
                  "score": 3,
                  "num_children": 0,
                  "author": 77812,
                  "replies": []
                }
              ]
            },
            {
              "id": "iapyfpx",
              "text": "> As a fellow American citizen, I don't want to take guns away from the population, \n\nI do. 😒",
              "timestamp": "2022-05-31 23:09:50",
              "score": 3,
              "num_children": 0,
              "author": 354546,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iaop9my",
      "text": "As a European I remain baffled about these recurring mass shootings and the only answer they (conservatives) have is to arm everybody in a school (teachers, guards), so that they can react when they next shooter appears, like in some kind of wild-west movie. \n\nAnd in the meantime the schools get secured like prisons, which still doesn’t help - and all that for the only reason that no one is able to solve or even touch the real problem, which is that every maniac can easily get automatic military rifles and deadly ammunition as much as he wants. \n\nAfter the Uvalde shooting some guy at the NRA convention said to an European TV team: *“that’s a cultural thing, you’ll never understand.”*\n\nAnd he’s right, we won’t.",
      "timestamp": "2022-05-31 17:29:27",
      "score": 24,
      "num_children": 0,
      "author": 74274,
      "replies": []
    },
    {
      "id": "iao4imp",
      "text": "If only more was being done besides calling them names lol",
      "timestamp": "2022-05-31 15:02:45",
      "score": 6,
      "num_children": 0,
      "author": 286897,
      "replies": []
    },
    {
      "id": "iapg7ri",
      "text": "I really suggest, that everyone start doing physical training to get ready for the shit storm that is coming. When these man babies try turning America into a Christian Nationalist hellscape.",
      "timestamp": "2022-05-31 20:51:19",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaphp0u",
      "text": "I love this because this is basically the very best Republicans can do. They can't read, they have no respect/morals, they can't think critically not quickly so just regurgitate the same old tired arguments that have long been or literally days ago been disproven, and provide NOTHING even close to being called a solution much less an idea.",
      "timestamp": "2022-05-31 21:02:04",
      "score": 3,
      "num_children": 0,
      "author": 212341,
      "replies": []
    },
    {
      "id": "iao0hlk",
      "text": "I agree",
      "timestamp": "2022-05-31 14:33:00",
      "score": 2,
      "num_children": 0,
      "author": 171687,
      "replies": []
    },
    {
      "id": "iapu8il",
      "text": "Their all practically arms dealers.",
      "timestamp": "2022-05-31 22:36:34",
      "score": 2,
      "num_children": 0,
      "author": 179598,
      "replies": []
    },
    {
      "id": "iaowtqi",
      "text": "If I owned a gun, I'd end up shooting my damn self with it. I'm not comfortable having one, and resent being pressured to think I should have not one,but many.",
      "timestamp": "2022-05-31 18:22:12",
      "score": 2,
      "num_children": 0,
      "author": 324164,
      "replies": []
    },
    {
      "id": "iapctak",
      "text": "I've always thought that all conventions we're full of the type of salesmen like at state fairs that want to sell you expensive ginsu knives, sonic jewelry cleaner machines, or chop-o-matics. My mama told me to never listen to that type because you were buying the spiel and not the product. And what they were selling always cost more than what we were willing to pay. And because the product was always garbage.",
      "timestamp": "2022-05-31 20:26:46",
      "score": 1,
      "num_children": 0,
      "author": 236289,
      "replies": []
    },
    {
      "id": "iaqgyt5",
      "text": "Why did I just search for and watch a 7 minute video of that trumpy pos talking just to witness this dance that never happened??????",
      "timestamp": "2022-06-01 01:37:28",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaql71q",
      "text": "Please explain “Trump danced after mispronouncing names”….\n\nI don’t need more reasons to hate this guy, but this sounds like something I can’t forgive",
      "timestamp": "2022-06-01 02:11:29",
      "score": 1,
      "num_children": 0,
      "author": 36586,
      "replies": []
    },
    {
      "id": "iaqmhje",
      "text": "There was like 20 good guys with guns there and they let kids get massacred uninterrupted for over an hour. Ted Cruz can eat a dick",
      "timestamp": "2022-06-01 02:22:01",
      "score": 1,
      "num_children": 0,
      "author": 358353,
      "replies": []
    },
    {
      "id": "iaqt25j",
      "text": "Ammosexuals are the weirdest tribe in this country",
      "timestamp": "2022-06-01 03:17:22",
      "score": 1,
      "num_children": 0,
      "author": 81281,
      "replies": []
    },
    {
      "id": "iar6gmp",
      "text": "You don't say...",
      "timestamp": "2022-06-01 05:36:41",
      "score": 1,
      "num_children": 0,
      "author": 188474,
      "replies": []
    },
    {
      "id": "iar7i9m",
      "text": "Has been, will be",
      "timestamp": "2022-06-01 05:49:16",
      "score": 1,
      "num_children": 0,
      "author": 132813,
      "replies": []
    },
    {
      "id": "iasxvvc",
      "text": "It was stopped by a good guy with a gun, the guy who killed the shooter was an off duty police officer who borrowed a man's shotgun keep in mind OFF DUTY",
      "timestamp": "2022-06-01 16:34:45",
      "score": 1,
      "num_children": 0,
      "author": 101552,
      "replies": []
    },
    {
      "id": "iaowd0n",
      "text": "So yea we’ll just let cops have guns",
      "timestamp": "2022-05-31 18:18:59",
      "score": -2,
      "num_children": 1,
      "author": 151308,
      "replies": [
        {
          "id": "iapfzez",
          "text": "In a functional society, no one would have them. In that regard gun proliferation has made the US borderline beyond salvation.\n\nSwitzerland has gun proliferation but has nowhere near the culture the societal rejects have, they also fund mental health, not takeaway from it.\n\nThe UK had minimal gun control up until the dunblane shooting, then we clamped down hard but are still able to Own guns (we just aren’t lazy about it and can jump through a few hoops to get it), nowadays even criminals rarely have guns; they carry knives, which is easier to fend off than a speeding bullet, there are also only 141 armed officers at any one time on our streets (other than the armed response service, which is equivalent to a SWAT or FBI team).\n\nThis is a real man, a good officer, didn’t need no gun:\n\nhttps://amp.theguardian.com/uk-news/2017/jun/28/policeman-fought-london-bridge-attackers-baton-wayne-marques",
          "timestamp": "2022-05-31 20:49:41",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ianrroi",
      "text": "[removed]",
      "timestamp": "2022-05-31 13:23:36",
      "score": -42,
      "num_children": 2,
      "replies": [
        {
          "id": "ianti33",
          "text": "Yes, this is a post about standard Republican evil.\n\nDid you think the alt-right traitors came up with something new to talk about?  It's the same hypocrisy and anti-American ideology they have had for decades.",
          "timestamp": "2022-05-31 13:38:09",
          "score": 21,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iao4y0k",
          "text": "For a person going on about bitching and a lack of insight or clever phrasing, you lack insight or clever phrasing and are, in fact, bitching. Nailed it with the unintentional irony.",
          "timestamp": "2022-05-31 15:05:48",
          "score": 15,
          "num_children": 1,
          "author": 225718,
          "replies": [
            {
              "id": "iao55wo",
              "text": "If this represents the quality of content you wanna see, I'm happy for you.",
              "timestamp": "2022-05-31 15:07:25",
              "score": -5,
              "num_children": 1,
              "author": 400371,
              "replies": [
                {
                  "id": "iaow60r",
                  "text": "Thanks!",
                  "timestamp": "2022-05-31 18:17:37",
                  "score": 4,
                  "num_children": 0,
                  "author": 225718,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}