{
  "id": "v1sw2l",
  "text": "Google got sued for discrimination.\n",
  "timestamp": "2022-05-31 15:29:42",
  "score": 1188,
  "subreddit": "t5_2zaj2",
  "num_children": 13,
  "author": 62043,
  "replies": [
    {
      "id": "iaoa796",
      "text": "so what if the men sued?",
      "timestamp": "2022-05-31 15:43:39",
      "score": 164,
      "num_children": 2,
      "author": 151606,
      "replies": [
        {
          "id": "iaokwpd",
          "text": "Theyd call you an incel sadly oof",
          "timestamp": "2022-05-31 16:59:06",
          "score": 154,
          "num_children": 0,
          "author": 364871,
          "replies": []
        },
        {
          "id": "iaofzh0",
          "text": "The Duluth Model is here to tell you to shut the fuck up and suffer, scrote.",
          "timestamp": "2022-05-31 16:24:35",
          "score": 69,
          "num_children": 1,
          "replies": [
            {
              "id": "iaq4coy",
              "text": "I'm glad it's being recognized as outdated psuedoscience",
              "timestamp": "2022-05-31 23:57:07",
              "score": 26,
              "num_children": 0,
              "author": 45188,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iaoexnb",
      "text": "I think this is old news.\n\nStill very relevant, mind you, but I don't want anyone to get the impression that it just happened recently.",
      "timestamp": "2022-05-31 16:17:14",
      "score": 99,
      "num_children": 1,
      "author": 250768,
      "replies": [
        {
          "id": "iaohsf1",
          "text": "Old news, perhaps; but since nothing has changed, or possibly, it has even gotten worse...",
          "timestamp": "2022-05-31 16:37:19",
          "score": 54,
          "num_children": 0,
          "author": 196342,
          "replies": []
        }
      ]
    },
    {
      "id": "iaocyyf",
      "text": "Didn't this happen years ago?",
      "timestamp": "2022-05-31 16:03:12",
      "score": 32,
      "num_children": 0,
      "author": 312440,
      "replies": []
    },
    {
      "id": "iaopige",
      "text": "Can you provide a link please?",
      "timestamp": "2022-05-31 17:31:10",
      "score": 8,
      "num_children": 1,
      "author": 375986,
      "replies": [
        {
          "id": "iap1rnk",
          "text": "It's an old article. I got this image from another subreddit. But I'm sure you can find something if you Google the title or something. \n\nGoogling something in quotes \"\" shows the exact wording you typed.",
          "timestamp": "2022-05-31 18:56:52",
          "score": 10,
          "num_children": 1,
          "author": 62043,
          "replies": [
            {
              "id": "iap9uy5",
              "text": "Thank you",
              "timestamp": "2022-05-31 20:05:50",
              "score": 4,
              "num_children": 1,
              "author": 375986,
              "replies": [
                {
                  "id": "iapaub7",
                  "text": "Welcome.",
                  "timestamp": "2022-05-31 20:12:49",
                  "score": 2,
                  "num_children": 0,
                  "author": 62043,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iap7b6m",
      "text": "These group of women don’t even know how to budget. And even if they did, they’ll say that it’s “misogynistic” and “chauvinistic”.\n\nNo wonder they recruited a public defender to represent them…",
      "timestamp": "2022-05-31 19:47:43",
      "score": 24,
      "num_children": 0,
      "author": 130643,
      "replies": []
    },
    {
      "id": "iaok7fn",
      "text": "Bottom line, hiring and pay discrimination against white male applicants is absolutely pervasive at all the tech giants, and that's just the tip of the iceberg, and it affects more than just white men. After we threw open the floodgates to discrimination against white applicants, many other forms of discrimination became even more common. \n\nI'd tell any young person training for a tech career that they have to factor in pervasive discrimination into their plans. It won't exclude a young person from every job. But say, if you're African American, there will be certain jobs openings that you will encounter that you will or be eligible for, because they have an East Indian only policy. Or if you are Latino or Asian or another race. For American Indians, you'll face all the same discrimination whites face, despite being in this country since the ice age. So the white liberal's magnanimous gesture, in permitting discrimination against working white men, has not helped your career prospects, but hurt them, quite a bit. Even if you are East Indian, and get hired that way, you can be forced into inferior conditions than those of American born applicants, because employers can control your right to live in the country where you work, and that will inevitably result in pay discrimination that affects you adversely (now you see why the magnanimous liberal was so quick to allow discrimination in the East Indian's favor).",
      "timestamp": "2022-05-31 16:54:12",
      "score": 18,
      "num_children": 1,
      "author": 196342,
      "replies": [
        {
          "id": "iap94br",
          "text": "[deleted]",
          "timestamp": "2022-05-31 20:00:38",
          "score": 15,
          "num_children": 1,
          "replies": [
            {
              "id": "iapas8k",
              "text": "Haha, SoCal, bro.",
              "timestamp": "2022-05-31 20:12:26",
              "score": 6,
              "num_children": 1,
              "author": 196342,
              "replies": [
                {
                  "id": "iapb43b",
                  "text": "Dude I have never heard of policies favoring south asians or East Asians lol. Especially the men. I'm applying to med school and on the mcat I literally need to score 3 points above the average white guy to have the same shot.",
                  "timestamp": "2022-05-31 20:14:44",
                  "score": 4,
                  "num_children": 2,
                  "author": 170112,
                  "replies": [
                    {
                      "id": "iaq46qg",
                      "text": "[Have you tried being black yet?](https://nypost.com/2015/04/12/mindy-kalings-brother-explains-why-he-pretended-to-be-black/)",
                      "timestamp": "2022-05-31 23:55:47",
                      "score": 5,
                      "num_children": 0,
                      "author": 91711,
                      "replies": []
                    },
                    {
                      "id": "iaqcjbq",
                      "text": "This is such cap. You have absolutely no idea  of what it feels to be blk…",
                      "timestamp": "2022-06-01 01:02:51",
                      "score": 4,
                      "num_children": 1,
                      "author": 90932,
                      "replies": [
                        {
                          "id": "iaqh6bk",
                          "text": "[deleted]",
                          "timestamp": "2022-06-01 01:39:08",
                          "score": 4,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "iaqhx7p",
                              "text": "Not true at all, but of course it means nothing if I don’t back it up facts, so let’s get into it. First off,  listen to yourself, because of the negative stereotypes it’s actually harder for blks to get job applications, we’re already ingrained in a loophole where we much show we are not “thugs” or “criminals” or “uneducated” which forces blks to infact have to work harder to match-up with peers. In fact just having a black name makes it harder. Two decades ago, a landmark study showed job applicants with “Black-sounding” names were less likely to hear back from employers. In 18 years, despite a boom in unconscious bias training and diversity initiatives, that largely hasn’t changed. Researchers from the University of California, Berkeley and the University of Chicago sent 83,000 fictitious applications for entry-level job postings to 108 Fortune 500 employers, using randomly assigned and racially distinctive names. They found that distinctively Black names on applications with reduced the likelihood of hearing back from an employer by 2.1 percentage points relative to distinctively White names. - source Bloomberg.com \nI’m Also not dismissing the struggles Asians may go through because I also found this study, but to say Asians and yt men have more hardships is laughable.https://hbswk.hbs.edu/item/minorities-who-whiten-job-resumes-get-more-interviews",
                              "timestamp": "2022-06-01 01:45:04",
                              "score": 0,
                              "num_children": 1,
                              "author": 90932,
                              "replies": [
                                {
                                  "id": "iaqi9cc",
                                  "text": "[deleted]",
                                  "timestamp": "2022-06-01 01:47:45",
                                  "score": 3,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "iaqjm2g",
                                      "text": "You sound very envious and jealous almost. Let that hate out your heart, it’s not good to keep comparing yourself to others because you will succumb in a long lasting battle where you won’t find happiness. I listed facts and statistics, you have not. At this points it’s very much your own feelings and disdain towards blks. I knew the direction you were going when you insinuated how maybe Asians should start joining gangs and more. You’re starting to sound just like the feminists, you both have the same premise.",
                                      "timestamp": "2022-06-01 01:58:37",
                                      "score": -1,
                                      "num_children": 0,
                                      "author": 90932,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iaoqwjx",
      "text": "*UNO reverse*",
      "timestamp": "2022-05-31 17:40:52",
      "score": 12,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iapiudm",
      "text": "This is old news, but I never heard about what happened after they discoreved women are priviledged. Did they raise male salaries?",
      "timestamp": "2022-05-31 21:10:27",
      "score": 3,
      "num_children": 1,
      "author": 131368,
      "replies": [
        {
          "id": "ics3pmm",
          "text": "Hell nah they didnt 😂 the women just stopped complaining",
          "timestamp": "2022-06-18 00:42:04",
          "score": 2,
          "num_children": 1,
          "author": 372607,
          "replies": [
            {
              "id": "icti7qj",
              "text": "But what about equality?",
              "timestamp": "2022-06-18 10:45:00",
              "score": 1,
              "num_children": 0,
              "author": 131368,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iaq6fqz",
      "text": "I wonder how many of these companies are in the same predicament, of which women make these unproven pay gap claims",
      "timestamp": "2022-06-01 00:14:07",
      "score": 3,
      "num_children": 0,
      "author": 177748,
      "replies": []
    },
    {
      "id": "iaoouvw",
      "text": "So they really have the craze to sue Google? Wage gap is a myth, and even if they were paid less, they should deal with it. They won't get homeless from slightly lower wage.\n\nExcept that, once I read an article in the internet how you as a female employee should not try to sue your male employer who you claim to be sexist or chauvinist because it will only turn against you.\n\nhttps://ms-jd.org/blog/article/top-ten-myths-and-facts-about-suing-your-employer-sex-discrimination",
      "timestamp": "2022-05-31 17:26:36",
      "score": 17,
      "num_children": 1,
      "replies": [
        {
          "id": "iap0d1z",
          "text": "I love the sexism of that page in and of itself. As if women can never be the perpetrator and men are never a victim. 🙄",
          "timestamp": "2022-05-31 18:47:07",
          "score": 14,
          "num_children": 1,
          "replies": [
            {
              "id": "iap14z6",
              "text": "At least it's discouraging women to sue their bosses because they are easily triggered.",
              "timestamp": "2022-05-31 18:52:28",
              "score": 4,
              "num_children": 1,
              "replies": [
                {
                  "id": "iaqtf46",
                  "text": "they are very easily triggered. in all of my years i have the best experiences working with men. women always wanna act like they're better than you. they act like we're outside and i have to be nice to them and sweet-talk them. no. i dont do that with men so in the name of equality, they can go fuck themselves, just like i tell the men who underperform and piss me off",
                  "timestamp": "2022-06-01 03:20:28",
                  "score": 0,
                  "num_children": 1,
                  "author": 351054,
                  "replies": [
                    {
                      "id": "iargnld",
                      "text": "I say to anyone who underperforms that failure is okay, don't give up, we gonna make it. But in my uni, people behave themselves and nobody acts like they are better than the other. I personally always act like an amateur.",
                      "timestamp": "2022-06-01 07:54:54",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iatrgvw",
                          "text": "Oh i agree. i act like a complete amateur. now the work products that i produce are far from amateur level but it is what it is. i def embrace failures as learning opportunities but in particular i'm talking about Boomers who are 60+yo and act like babies who need there bottle and to be spoon-fed. they can def go fuck themselves",
                          "timestamp": "2022-06-01 19:59:11",
                          "score": 1,
                          "num_children": 1,
                          "author": 351054,
                          "replies": [
                            {
                              "id": "iaufg7f",
                              "text": "Sometimes a person can age so much that their mental maturity has reversal effect. I have also seen people who are my grandparents age being immature.",
                              "timestamp": "2022-06-01 22:52:57",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iapci9i",
      "text": "Note to mods: Here's an idea. How about we ban all screenshots claiming to be informational -- ie, not just some asshole at fourthwavewomen shitting on men -- unless they come with an accompanying link? I do NOT appreciate having to waste my time Googling shit to find out if it's true and/or when it happened. And, yes, i know i can block these meatheads -- which i do -- but what if the meathead later posts something worth reading?",
      "timestamp": "2022-05-31 20:24:35",
      "score": 4,
      "num_children": 1,
      "replies": [
        {
          "id": "ias4odp",
          "text": "this",
          "timestamp": "2022-06-01 12:55:12",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iapwkl5",
      "text": "This happens in my field as well (social work), since the entire field is majority women and the wage gap narrative is so widely accepted. They compensate for the imaginary wage gap and then complain about the wage gap.",
      "timestamp": "2022-05-31 22:54:59",
      "score": 3,
      "num_children": 1,
      "author": 186636,
      "replies": [
        {
          "id": "iaqg9u5",
          "text": "Mass psychosis.",
          "timestamp": "2022-06-01 01:32:04",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ias3oe2",
      "text": "Not really surprising. Every company does this.",
      "timestamp": "2022-06-01 12:46:13",
      "score": 1,
      "num_children": 0,
      "author": 387862,
      "replies": []
    }
  ]
}