{
  "id": "v32ycv",
  "text": "cool for Johnny that he won.\n",
  "timestamp": "2022-06-02 07:02:22",
  "score": 12337,
  "subreddit": "t5_2qh4w",
  "num_children": 116,
  "author": 94711,
  "replies": [
    {
      "id": "iaw0k8k",
      "text": "While this whole thing was going on, I was fighting my ex who took my kid and strong armed me into letting her new boy toy adopt her so I lost all legal rights to time with her. She continued taking child support and leaving me extremely stressed with money struggles. \n\nLast month I took her to court and got those payments fully cancelled, and can now go after her for three years of illegal payments taken from me for 12,000 dollars. \n\nI'm not gonna take the money on the hope that that money will help my daughter, but it's hard to describe the relief when the judge declared my victory in the case and my freedom from basically being bled dry by a cheating witch. \n\nWatching her face when she realized she wasn't gonna be taking hundreds from me a month and the further horror on her face when she realized the turns had tabled... That was bliss. \n\nThere's hope for us yet, gentlemen. We're finally getting heard.... No pun intended.",
      "timestamp": "2022-06-02 08:10:37",
      "score": 1758,
      "num_children": 34,
      "author": 116863,
      "replies": [
        {
          "id": "iaw4dvr",
          "text": "[deleted]",
          "timestamp": "2022-06-02 09:09:37",
          "score": 184,
          "num_children": 1,
          "replies": [
            {
              "id": "iaw6qms",
              "text": "Yeah just invest them into something safe and then when the daughter is 18 give the money to her",
              "timestamp": "2022-06-02 09:45:20",
              "score": 49,
              "num_children": 2,
              "author": 24998,
              "replies": [
                {
                  "id": "iaykp7d",
                  "text": "Be a little careful though, dont give it to her right away, or only in installments at first. See what happens to the money, if her mom suddenly takes it away from her threatening to kick her out otherwise or some other manipulative shit. Don't want the cash to go right back to the mom.",
                  "timestamp": "2022-06-02 21:22:03",
                  "score": 1,
                  "num_children": 0,
                  "author": 31701,
                  "replies": []
                },
                {
                  "id": "iay6icw",
                  "text": "Investing in something safe at this time is pretty much like playing roulette.",
                  "timestamp": "2022-06-02 19:38:02",
                  "score": 0,
                  "num_children": 1,
                  "author": 284161,
                  "replies": [
                    {
                      "id": "iay9e7u",
                      "text": "It really is not. Also I’m not talking about dumping all the money right now. Pay the amount he would oay to child support (or whatever he can afford) monthly to an index fund or some safe stocks",
                      "timestamp": "2022-06-02 19:58:43",
                      "score": 2,
                      "num_children": 0,
                      "author": 24998,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iaw1wb9",
          "text": "Take the money and look to support your daughter with it personally in some way, even if she took the legal rights away from you there must be things you can do for her with the money. Even if you can't do anything right now, she won't be forbidden to interact with her father when she becomes an adult.\n\nDon't let her keep what she owes you, chances are your daughter will see none or very little of that money invested back into her. 100% you'll manage it better.",
          "timestamp": "2022-06-02 08:31:16",
          "score": 976,
          "num_children": 7,
          "author": 213107,
          "replies": [
            {
              "id": "iaw28m1",
              "text": "This. At least with the money in your possession you know what it's going to be spent on and can be assured it won't go to mommy's clothing shopping spree. You can save it for a car when they're older, education, school supplies, whatever they need. But at least it will be in a responsible parent's hands.",
              "timestamp": "2022-06-02 08:36:35",
              "score": 306,
              "num_children": 1,
              "replies": [
                {
                  "id": "iax25u1",
                  "text": "My thoughts exactly, put it into a college fund or something",
                  "timestamp": "2022-06-02 14:51:35",
                  "score": 48,
                  "num_children": 1,
                  "author": 225443,
                  "replies": [
                    {
                      "id": "iaxf3ik",
                      "text": "Yesss.\n\n\nMy mom took my dads money happily, and also happily used the excuse that it was “all” going to putting a roof over our head…. \n\n\nShe had a 3 million dollar house, we had holes in our shoes.",
                      "timestamp": "2022-06-02 16:24:27",
                      "score": 12,
                      "num_children": 0,
                      "author": 144894,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iax39kq",
              "text": "Yes, 100% this. I have a friend in a similar situation that also had a judge turn the table and he refused the payments out of a sense of pride and \"not having a woman pay\". We all told him he was a dumbass and he still occasionally sends his ex cash even though she makes double what he makes and they have 50/50 custody. Appalling",
              "timestamp": "2022-06-02 14:59:45",
              "score": 27,
              "num_children": 1,
              "author": 208554,
              "replies": [
                {
                  "id": "iazdhj5",
                  "text": "#AHAHAHAHAHAHAHAHA CUCK",
                  "timestamp": "2022-06-03 01:08:05",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "iaxoaxh",
              "text": "100% this. As a child of split parents, don't let the mother spit lies to your child about \"how hard your father tried to get out of supporting you\" and other nasty lies.",
              "timestamp": "2022-06-02 17:28:47",
              "score": 4,
              "num_children": 0,
              "author": 223524,
              "replies": []
            },
            {
              "id": "iaw9haw",
              "text": "That's what he would've done if he didn't make it up",
              "timestamp": "2022-06-02 10:24:07",
              "score": 59,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "iax8vmf",
              "text": "Start an UTMA account",
              "timestamp": "2022-06-02 15:40:11",
              "score": 2,
              "num_children": 0,
              "author": 63019,
              "replies": []
            },
            {
              "id": "iaxbm74",
              "text": "He may want nothing to do with her. He did let another guy become her legal parent.",
              "timestamp": "2022-06-02 15:59:42",
              "score": -2,
              "num_children": 0,
              "author": 167297,
              "replies": []
            },
            {
              "id": "iayc7ip",
              "text": "Or here’s an idea, move far away and start over fresh. Leave your daughter behind and let her resent the mother.",
              "timestamp": "2022-06-02 20:19:14",
              "score": 0,
              "num_children": 0,
              "author": 33428,
              "replies": []
            }
          ]
        },
        {
          "id": "iaw615m",
          "text": "> adopt her so I lost all legal rights to time with her. She continued taking child support\n\nhow does this even make sense ? you can adopt or get child support.",
          "timestamp": "2022-06-02 09:34:52",
          "score": 37,
          "num_children": 0,
          "author": 379947,
          "replies": []
        },
        {
          "id": "iaw5btz",
          "text": "Take the money, seriously. Don't spent it on yourself, either put it into a fund - 12k can grow into a fair bit more over a decade, depending on the fund, or just keep it liquid in case she has immediate needs like clothing or medicine or whatever else which her mother and adopted father are unable to pay for, but either way, give it to her when she's an adult, perhaps for college or whatever. \n\nIf you let them keep the money, you can bet most of it won't be spent on her.",
          "timestamp": "2022-06-02 09:24:04",
          "score": 95,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iaw3tk9",
          "text": "Bro take every cent of what she owes u, from ur description of ur ex wife, ur daughter won't see anything of the money, all of it will go on makeup and clothes and handbags. Better just take it bro.",
          "timestamp": "2022-06-02 09:01:07",
          "score": 213,
          "num_children": 3,
          "author": 335138,
          "replies": [
            {
              "id": "iaw83kz",
              "text": "They really need to itemize child support spending.",
              "timestamp": "2022-06-02 10:04:56",
              "score": 85,
              "num_children": 2,
              "replies": [
                {
                  "id": "iaxribt",
                  "text": "They barely itemize billions of dollars of federal spending/aid",
                  "timestamp": "2022-06-02 17:50:50",
                  "score": 4,
                  "num_children": 0,
                  "author": 271612,
                  "replies": []
                },
                {
                  "id": "iaxa29o",
                  "text": "Most people spend all their money on rent and bills.",
                  "timestamp": "2022-06-02 15:48:36",
                  "score": -6,
                  "num_children": 0,
                  "author": 13162,
                  "replies": []
                }
              ]
            },
            {
              "id": "iax5q9s",
              "text": "And after you take it, you can give it to your daughter, that way there is no guessing.",
              "timestamp": "2022-06-02 15:17:40",
              "score": 4,
              "num_children": 0,
              "author": 94245,
              "replies": []
            },
            {
              "id": "iawydaf",
              "text": "Separate bank account for when she goes living on her own.",
              "timestamp": "2022-06-02 14:23:04",
              "score": 3,
              "num_children": 0,
              "author": 316407,
              "replies": []
            }
          ]
        },
        {
          "id": "iaw5qu8",
          "text": "Strong armed to giving up all parental rights? What's wrong with you",
          "timestamp": "2022-06-02 09:30:31",
          "score": 89,
          "num_children": 2,
          "author": 199011,
          "replies": [
            {
              "id": "iawdtno",
              "text": "You have to remember, you only ever get one side of the story on Reddit. And they aren’t under oath. My wife did divorces and child custody law for a number of years. No one can “strong arm” you to give up custody, especially if they also keep making you pay child support. I have little doubt the above story is glossing over major details if not made up entirely.",
              "timestamp": "2022-06-02 11:18:04",
              "score": 72,
              "num_children": 3,
              "author": 379387,
              "replies": [
                {
                  "id": "iawkx3h",
                  "text": "> No one can “strong arm” you to give up custody\n\n\"Give up custody or I'll tell everyone you raped / beat / molested me and/or your daughter\"",
                  "timestamp": "2022-06-02 12:31:44",
                  "score": 60,
                  "num_children": 1,
                  "author": 136206,
                  "replies": [
                    {
                      "id": "iawt1mz",
                      "text": "Prove it whore the kid lives with the mom and new boyfriend so it was obviously him.",
                      "timestamp": "2022-06-02 13:41:29",
                      "score": 5,
                      "num_children": 1,
                      "author": 209903,
                      "replies": [
                        {
                          "id": "iawy5tn",
                          "text": "Gaslight the kid into believing it and now the dude has a child rape claim forever haunting him. It doesnt even matter if his innocence is proven, everyone will just see him as a pedo who lucked out cause of lack of evidence. Its truly fucked.",
                          "timestamp": "2022-06-02 14:21:30",
                          "score": 26,
                          "num_children": 1,
                          "author": 156326,
                          "replies": [
                            {
                              "id": "iax1j0s",
                              "text": "I agree with you but your only course of action is to fight for your life and do your best to ruin the womans life in revenge. I actually know a guy this happened to and he fought tooth and nail like anyone innocent should.",
                              "timestamp": "2022-06-02 14:46:54",
                              "score": 9,
                              "num_children": 2,
                              "author": 209903,
                              "replies": [
                                {
                                  "id": "iax2did",
                                  "text": "I agree with tbh, I would fight for my kids as well. But frankly, if some b-word tried to pull that, and I couldnt get revenge from the courts, Im taking it in my own hands.",
                                  "timestamp": "2022-06-02 14:53:11",
                                  "score": 11,
                                  "num_children": 1,
                                  "author": 156326,
                                  "replies": [
                                    {
                                      "id": "iax2onl",
                                      "text": "Best of luck citizen, some people truly deserve what they get.",
                                      "timestamp": "2022-06-02 14:55:28",
                                      "score": 8,
                                      "num_children": 1,
                                      "author": 209903,
                                      "replies": [
                                        {
                                          "id": "iax3pqv",
                                          "text": "best of luck to you too man",
                                          "timestamp": "2022-06-02 15:03:01",
                                          "score": 5,
                                          "num_children": 0,
                                          "author": 156326,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "iax29hp",
                                  "text": "[removed]",
                                  "timestamp": "2022-06-02 14:52:21",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "iax29kq",
                                      "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```bitch```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
                                      "timestamp": "2022-06-02 14:52:22",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 184140,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iawjc7d",
                  "text": "bro its definitely genuine.! it s reddit.",
                  "timestamp": "2022-06-02 12:16:30",
                  "score": 6,
                  "num_children": 0,
                  "author": 358458,
                  "replies": []
                },
                {
                  "id": "iaxab7n",
                  "text": "> No one can “strong arm” you to give up custody\n\nwtf not?  Anyone can strong arm anyone to do anything if they have the leverage.\n\n(Not to say OP is being truthful to call it that.)",
                  "timestamp": "2022-06-02 15:50:24",
                  "score": 1,
                  "num_children": 0,
                  "author": 13162,
                  "replies": []
                }
              ]
            },
            {
              "id": "iaxj9wx",
              "text": "You underestimate how manipulative women can be, I think.",
              "timestamp": "2022-06-02 16:53:49",
              "score": 2,
              "num_children": 0,
              "author": 266518,
              "replies": []
            }
          ]
        },
        {
          "id": "iawn41y",
          "text": "If someone adopts a child, then that child’s biological father is legally not mandated to pay child support, in every jurisdiction.\n\nThese made up stories used to be more fun.\n\nYou’re alleging that a she asked you for money, and you gave it to her, and we’re supposed to believe that a judge ruled she had to give it back? \n\nWhat legal basis was given for this? Why would you be entitled to receive back monies that you freely paid her? If someone else had adopted the child, then you were no longer legally obliged to pay child support.",
          "timestamp": "2022-06-02 12:51:41",
          "score": 14,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iawdeg1",
          "text": "There's more to this story.  Unless you're a POS you don't just give up your rights and let the new boyfriend adopt your daughter.  And OP paid 12 whole thousand dollars for 3 fucking years of child support??  Sounds like a real trailer trash drama.",
          "timestamp": "2022-06-02 11:13:05",
          "score": 29,
          "num_children": 1,
          "author": 335109,
          "replies": [
            {
              "id": "iawdy1q",
              "text": "$300 a month child support and gave up custody? Yeah, Reddit is gonna eat that up despite this guys best version of the story painting him as an idiot at best.",
              "timestamp": "2022-06-02 11:19:29",
              "score": 24,
              "num_children": 0,
              "author": 379387,
              "replies": []
            }
          ]
        },
        {
          "id": "iawew9x",
          "text": "Take the money are you kidding  guarantee it helps your daughter not hope lmao",
          "timestamp": "2022-06-02 11:29:55",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iawjfhz",
          "text": "Don't lie to yourself. You're really gonna depend on someone who stole from you to do the right thing? Take back the money you're owed and be sure that it goes where you want it to, that's the only way to do right by your daughter. \n\nMen giving up what they're entitled to in these settlements is far too common and helps contribute to setting precedent for the future. Stop getting cucked",
          "timestamp": "2022-06-02 12:17:24",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iawgv5n",
          "text": "I also love it when turns table!",
          "timestamp": "2022-06-02 11:51:06",
          "score": 2,
          "num_children": 0,
          "author": 78121,
          "replies": []
        },
        {
          "id": "iaxmx71",
          "text": "Take the money",
          "timestamp": "2022-06-02 17:19:15",
          "score": 2,
          "num_children": 0,
          "author": 177361,
          "replies": []
        },
        {
          "id": "iaw7au5",
          "text": "Congrats on beating family court, OP. Not many men can make that claim.",
          "timestamp": "2022-06-02 09:53:44",
          "score": 5,
          "num_children": 0,
          "author": 1978,
          "replies": []
        },
        {
          "id": "iawh6yl",
          "text": "kids are a scam",
          "timestamp": "2022-06-02 11:54:36",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iawd3n9",
          "text": "are gonna take your daughter's custody?",
          "timestamp": "2022-06-02 11:09:29",
          "score": 1,
          "num_children": 0,
          "author": 109706,
          "replies": []
        },
        {
          "id": "iaweopf",
          "text": "take the money, and setup an education fund. preferably through bonds or something the mother cannot access, and set it up so only your kid can access it after shes 18.",
          "timestamp": "2022-06-02 11:27:35",
          "score": 1,
          "num_children": 0,
          "author": 336221,
          "replies": []
        },
        {
          "id": "iawf95i",
          "text": "Take the money and spend it on your kid. Please",
          "timestamp": "2022-06-02 11:33:51",
          "score": 1,
          "num_children": 0,
          "author": 367876,
          "replies": []
        },
        {
          "id": "iawkmbj",
          "text": "Take the money and set it aside for college funds.",
          "timestamp": "2022-06-02 12:28:48",
          "score": 1,
          "num_children": 0,
          "author": 274983,
          "replies": []
        },
        {
          "id": "iawon1c",
          "text": "Depending on the state she leaves the adopted father she can probably sue that dumb fuck for child support.",
          "timestamp": "2022-06-02 13:04:55",
          "score": 1,
          "num_children": 0,
          "author": 150696,
          "replies": []
        },
        {
          "id": "iawoti8",
          "text": "Take that money and put it in a trust that only your daughter or you have legal access to.",
          "timestamp": "2022-06-02 13:06:25",
          "score": 1,
          "num_children": 0,
          "author": 150696,
          "replies": []
        },
        {
          "id": "iawplqv",
          "text": ">hope that that money will help my daughter, \n\nIt 100% wont. Take the money. Keep it for her when she grows up. Unless she gets brainwashed into another feminazi by her mom and despises you in the future.",
          "timestamp": "2022-06-02 13:13:08",
          "score": 1,
          "num_children": 0,
          "author": 362644,
          "replies": []
        },
        {
          "id": "iawra1d",
          "text": "Take back the $12k, put it in a some kind of fund, and give it to her when she turns 18.",
          "timestamp": "2022-06-02 13:27:05",
          "score": 1,
          "num_children": 0,
          "author": 231220,
          "replies": []
        },
        {
          "id": "iawrke0",
          "text": "Take the money, put it in a custodial investment account for your daughter. Hand it over when she's 25.",
          "timestamp": "2022-06-02 13:29:27",
          "score": 1,
          "num_children": 0,
          "author": 20509,
          "replies": []
        },
        {
          "id": "iaxf36v",
          "text": "Nice pun lol\n\nIn all seriousness, if there were a legal fund to help every male victim of these kinds false accusations or other kinds of injustices (such as yours) that would be great\n\nAn example needs to be made of every single false accuser and all other liars",
          "timestamp": "2022-06-02 16:24:23",
          "score": 1,
          "num_children": 0,
          "author": 341351,
          "replies": []
        },
        {
          "id": "iaxj60b",
          "text": "Take the money back and create a college fund for your daughter. Women like that are fucking trash. I had an ex who was insanely manipulative, ended up stealing $900 in cash and a ton of my belongings totaling around $1500",
          "timestamp": "2022-06-02 16:53:03",
          "score": 1,
          "num_children": 0,
          "author": 266518,
          "replies": []
        },
        {
          "id": "iaxjoie",
          "text": "Fuck that take the money and put it in a savings account for your kid. Her mom doesn't sound like the type to set her up for success.",
          "timestamp": "2022-06-02 16:56:37",
          "score": 1,
          "num_children": 0,
          "author": 239679,
          "replies": []
        },
        {
          "id": "iaxr8bd",
          "text": "Definitely take the money and hand it to your daughter personally, so you KNOW it ends up getting used for her",
          "timestamp": "2022-06-02 17:48:53",
          "score": 1,
          "num_children": 0,
          "author": 199907,
          "replies": []
        },
        {
          "id": "iaxw302",
          "text": "> and strong armed me into letting her new boy toy adopt her so I lost all legal rights to time with her.\n\n> I'm not gonna take the money on the hope that that money will help my daughter\n\nJesus Christ I haven’t seen this much soy in ages.",
          "timestamp": "2022-06-02 18:23:15",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iaxwdck",
          "text": "[removed]",
          "timestamp": "2022-06-02 18:25:16",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "iaxwdf5",
              "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```bitch```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
              "timestamp": "2022-06-02 18:25:17",
              "score": 1,
              "num_children": 0,
              "author": 184140,
              "replies": []
            }
          ]
        },
        {
          "id": "iaxwkmz",
          "text": "My dude, take the money. \n\nIf you really want to help your daughter, take it all, put it in some safe fund, and gave it to her when she is an adult and has full control of her money. \n\nThat way you know she is getting that money and more than if your ex have your daughter everything, which is **highly unlikely **. And that way your ex also take a hit.",
          "timestamp": "2022-06-02 18:26:45",
          "score": 1,
          "num_children": 0,
          "author": 198073,
          "replies": []
        },
        {
          "id": "iay4fpk",
          "text": "Should take the money and put it in a trust or account for your daughter or something if you want her to benefit from the money \n\nDef better then whatever the mom plans to do with it",
          "timestamp": "2022-06-02 19:23:02",
          "score": 1,
          "num_children": 0,
          "author": 119771,
          "replies": []
        },
        {
          "id": "iayk1n4",
          "text": "Take the money",
          "timestamp": "2022-06-02 21:17:11",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iaymq25",
          "text": "Take money and make memories with daughter. Maybe bank something for her for later.",
          "timestamp": "2022-06-02 21:37:06",
          "score": 1,
          "num_children": 0,
          "author": 199548,
          "replies": []
        },
        {
          "id": "iawh7jc",
          "text": "kids are a scam",
          "timestamp": "2022-06-02 11:54:47",
          "score": 0,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iaw4f5l",
      "text": "Who the fuck are the „experts“ the article mentions? What are they experts in? Being abused?",
      "timestamp": "2022-06-02 09:10:11",
      "score": 271,
      "num_children": 6,
      "replies": [
        {
          "id": "iawh2aj",
          "text": "Professional victims, Twitter certified.",
          "timestamp": "2022-06-02 11:53:14",
          "score": 71,
          "num_children": 0,
          "author": 81072,
          "replies": []
        },
        {
          "id": "iaw9ldt",
          "text": "Experts in misandrism",
          "timestamp": "2022-06-02 10:25:40",
          "score": 93,
          "num_children": 1,
          "author": 65039,
          "replies": [
            {
              "id": "iaxyuwz",
              "text": "You mean mods from Deuxmoi?",
              "timestamp": "2022-06-02 18:42:51",
              "score": 4,
              "num_children": 2,
              "author": 290597,
              "replies": [
                {
                  "id": "iaynb1q",
                  "text": "No. least misandrist deuxmoi-poster.",
                  "timestamp": "2022-06-02 21:41:32",
                  "score": 1,
                  "num_children": 0,
                  "author": 199548,
                  "replies": []
                },
                {
                  "id": "ib1mq4t",
                  "text": "Can anyone tell me what is this sub? I have seen it mentioned before also.",
                  "timestamp": "2022-06-03 15:12:01",
                  "score": 1,
                  "num_children": 1,
                  "author": 175450,
                  "replies": [
                    {
                      "id": "ib1ofnl",
                      "text": "Deuxmoi is like a Gossip account on Twitter and the subreddit is like a place where you can talk about it.  \n\nHowever, it seem that the sub is full of angry woman ready to blame any man out there. So during the Amber trial, they ban anyone defending Depp and keep saying that Amber was setup. It's really amazing how lunatic they are. People were saying that the jury didn't understand the questions and got manipulated...",
                      "timestamp": "2022-06-03 15:24:17",
                      "score": 1,
                      "num_children": 0,
                      "author": 290597,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iawccwm",
          "text": "Expert vicitms",
          "timestamp": "2022-06-02 11:00:47",
          "score": 63,
          "num_children": 0,
          "author": 328063,
          "replies": []
        },
        {
          "id": "iax3hud",
          "text": "Memes aside, I am genuinely interested in who these “experts” are leftists seem to pull out of their asses every time they need a talking point",
          "timestamp": "2022-06-02 15:01:26",
          "score": 18,
          "num_children": 1,
          "author": 329419,
          "replies": [
            {
              "id": "iaxqppi",
              "text": "They were able to find over 50 \"experts\" that said the Hunter Biden laptop was fake right before the election",
              "timestamp": "2022-06-02 17:45:15",
              "score": 4,
              "num_children": 0,
              "author": 260116,
              "replies": []
            }
          ]
        },
        {
          "id": "iaxkntc",
          "text": "i for one am an expert at being an expert. my expertise is is literally being an expert on being an expert.\n\ni fill my role expertly. as one would expect from an expert in this field.",
          "timestamp": "2022-06-02 17:03:28",
          "score": 11,
          "num_children": 1,
          "author": 309216,
          "replies": [
            {
              "id": "iayny3e",
              "text": "I bow to your expertise.",
              "timestamp": "2022-06-02 21:46:20",
              "score": 3,
              "num_children": 1,
              "author": 9789,
              "replies": [
                {
                  "id": "iaza6om",
                  "text": "when you know, you just know.",
                  "timestamp": "2022-06-03 00:41:31",
                  "score": 2,
                  "num_children": 0,
                  "author": 309216,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iax4m02",
          "text": "In unrelated fields.",
          "timestamp": "2022-06-02 15:09:37",
          "score": 1,
          "num_children": 1,
          "author": 277734,
          "replies": [
            {
              "id": "iaybzor",
              "text": "Oh no, it was a directly relevant field, just not a reliable one:\n\nGender Studies.",
              "timestamp": "2022-06-02 20:17:38",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iaw0xmu",
      "text": "\"men always win\"\n\nThere is a mountain of evidence that shows men are generally disadvantaged in domestic violence situations. Heard literally said on tape.",
      "timestamp": "2022-06-02 08:16:26",
      "score": 1083,
      "num_children": 3,
      "author": 377054,
      "replies": [
        {
          "id": "iawb86e",
          "text": "Men are always disadvantaged in court. They get higher sentences.",
          "timestamp": "2022-06-02 10:46:44",
          "score": 375,
          "num_children": 2,
          "replies": [
            {
              "id": "iawjrw8",
              "text": "Women be like:\" there is no sexism towards men\" \nAlso men: get consctipted all over the world, get up to 2-3 times as heavy punishment and higher chance of punishment, are at a huge disadvantage in school (depending where you are), get fucked in every case at court that is about abuse or about taking care of the kids. Hell, if a woman claims you're her childrens dad you can't even legally force her to do a test.",
              "timestamp": "2022-06-02 12:20:41",
              "score": 241,
              "num_children": 6,
              "author": 198607,
              "replies": [
                {
                  "id": "iawlq0c",
                  "text": "Don't forget even if a man gets raped and a woman becomes pregnant through that, she can still cash in on child support, even when the \"man\" is a 13 year old kid.",
                  "timestamp": "2022-06-02 12:39:23",
                  "score": 176,
                  "num_children": 5,
                  "author": 295864,
                  "replies": [
                    {
                      "id": "iawo8tv",
                      "text": "It sounded so retarded that it had to be true. Holy fuck.",
                      "timestamp": "2022-06-02 13:01:34",
                      "score": 90,
                      "num_children": 1,
                      "author": 261317,
                      "replies": [
                        {
                          "id": "iaxx7se",
                          "text": "Life has long surpassed whatever was satire ten years ago.",
                          "timestamp": "2022-06-02 18:31:21",
                          "score": 26,
                          "num_children": 1,
                          "author": 295864,
                          "replies": [
                            {
                              "id": "iayn3f5",
                              "text": "Honk honk.",
                              "timestamp": "2022-06-02 21:39:57",
                              "score": 4,
                              "num_children": 0,
                              "author": 199548,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iaycnfy",
                      "text": "no no no no you cant rape a man bigot \n\nall men want to sex rabid frothing feminist pussy\n\nmy sagging popped balloon tits and matted leg hair are beautiful \n\nif you say no or yes i will accuse you of rape on twitter",
                      "timestamp": "2022-06-02 20:22:24",
                      "score": 4,
                      "num_children": 0,
                      "author": 182798,
                      "replies": []
                    },
                    {
                      "id": "iaww956",
                      "text": "*thunderous applause from progressives*",
                      "timestamp": "2022-06-02 14:06:52",
                      "score": 33,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iawxink",
                          "text": "Don't lump all progressives in with those fucking wackos, raping a child is still raping a child, I don't care what side of the fence you're on.",
                          "timestamp": "2022-06-02 14:16:40",
                          "score": 23,
                          "num_children": 1,
                          "author": 271777,
                          "replies": [
                            {
                              "id": "iax4zwb",
                              "text": "And what if they're both legal? Guy gets wasted at a party, a bunch of girls ride him for giggles. One of them gets pregnant, and is now getting child support from him.",
                              "timestamp": "2022-06-02 15:12:26",
                              "score": 12,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iax67f4",
                                  "text": "That's still rape, dude wasn't in the right state of mind to be able to consent.",
                                  "timestamp": "2022-06-02 15:20:57",
                                  "score": 14,
                                  "num_children": 2,
                                  "author": 167974,
                                  "replies": [
                                    {
                                      "id": "iaxhyam",
                                      "text": "Good luck convincing a judge of that.",
                                      "timestamp": "2022-06-02 16:44:33",
                                      "score": 16,
                                      "num_children": 0,
                                      "replies": []
                                    },
                                    {
                                      "id": "iaxwg19",
                                      "text": "Yes.\n\nThere is no way to make your peers agree that men can be raped.\n\nThat fight is lost.",
                                      "timestamp": "2022-06-02 18:25:49",
                                      "score": 9,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iaxknmz",
                      "text": "[deleted]",
                      "timestamp": "2022-06-02 17:03:26",
                      "score": 6,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "ib0ehrb",
                          "text": "Thats one of the biggest injustices",
                          "timestamp": "2022-06-03 07:06:19",
                          "score": 3,
                          "num_children": 0,
                          "author": 226645,
                          "replies": []
                        },
                        {
                          "id": "ib1zppd",
                          "text": "I hate that this was done to me. It’s barbaric and you definitely do lose sensitivity. Everyone’s been conditioned to think it’s normal here, it’s nuts.",
                          "timestamp": "2022-06-03 16:43:45",
                          "score": 3,
                          "num_children": 0,
                          "author": 29402,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iawy67l",
                      "text": "You mean like [this case](https://en.m.wikipedia.org/wiki/Hermesmann_v._Seyer) where it was men who decided that he had to pay child support?",
                      "timestamp": "2022-06-02 14:21:35",
                      "score": -3,
                      "num_children": 0,
                      "author": 15109,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iaxpxlt",
                  "text": "You can just wait until the baby is born,at that point you don't need her consent",
                  "timestamp": "2022-06-02 17:39:59",
                  "score": 3,
                  "num_children": 0,
                  "author": 52237,
                  "replies": []
                },
                {
                  "id": "ibtcytx",
                  "text": "Let's not leave out that while, yes, men do pretty much all of the violent crime/murderin', we have the overwhelming majority of it inflicted upon ourselves too... And speaking of self-inflicted: no list describing male 'privileges' is ever complete unless it's noted how fortunate we are to almost exclusively be the paradigm for  suicides (where suicide obv.=Do or do not, there is no try)",
                  "timestamp": "2022-06-10 03:41:22",
                  "score": 2,
                  "num_children": 0,
                  "author": 46608,
                  "replies": []
                },
                {
                  "id": "ic3h3wl",
                  "text": "> just be a man johnny",
                  "timestamp": "2022-06-12 15:26:38",
                  "score": 2,
                  "num_children": 0,
                  "author": 105047,
                  "replies": []
                },
                {
                  "id": "iay669c",
                  "text": "Men: portrayed as worthless with insane amounts of gorey violence forced upon them. No one bat's an eye\n\nWomen:robot lady (fake cgi character) in love death and robots gets faced stomped, entire internet loses its mind about \"violence towards women in media\"\n\nJfc",
                  "timestamp": "2022-06-02 19:35:37",
                  "score": 3,
                  "num_children": 0,
                  "author": 273426,
                  "replies": []
                },
                {
                  "id": "iawxu50",
                  "text": "Also men: hold the majority of power within the court system",
                  "timestamp": "2022-06-02 14:19:06",
                  "score": -5,
                  "num_children": 0,
                  "author": 15109,
                  "replies": []
                }
              ]
            },
            {
              "id": "iazvrar",
              "text": "I wonder why...\n\nWait until you hear 13% of the population gets higher sentences too.",
              "timestamp": "2022-06-03 03:33:50",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "iazvtpj",
          "text": "She did not say that.",
          "timestamp": "2022-06-03 03:34:24",
          "score": 2,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iawzv0p",
          "text": "Alternative perspective: only women who are 100% certain they can win actually take their cast to court, and probably still don’t feel that confident.\n\n\nMany women don’t report abuse and assault out of fear for their health and safety, because they are afraid of legal repercussions because they may have also been abusive, because of social repercussions when misinformation being spread, being afraid of always being labeled as a victim, or the fact that you have to retell your trauma over and over and try to defend yourself about a thing your brain wants to protect you from even thinking about. \n\nI won’t pretend to defend that tape of Heard’s. But I will say, abuse usually goes both ways, and men are usually to come out alive. So don’t just everyone by this case.\n\n\nEdit: lol I should have expected this result in the Reddit comments. This place is pretty famously known for its misogyny",
          "timestamp": "2022-06-02 14:34:26",
          "score": -8,
          "num_children": 1,
          "author": 386082,
          "replies": [
            {
              "id": "iaxid3y",
              "text": "Might be the most braindead take I've seen in a month. Hope your wranglers catch you soon, Special Ed.",
              "timestamp": "2022-06-02 16:47:27",
              "score": 6,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iavx6i1",
      "text": "Women realise they may not get away with bullshit spurious claims. Gold rush is over ladies.",
      "timestamp": "2022-06-02 07:20:20",
      "score": 3568,
      "num_children": 9,
      "replies": [
        {
          "id": "iaw64mn",
          "text": "If only.\n\nJD managed to clean his name after 6 years and spending an enormous amount of ressources on top lawyers and publicity campaigns.\n\n\nThe average dude defending against a psychopathic ex-wife still has no chance whatsoever.",
          "timestamp": "2022-06-02 09:36:19",
          "score": 2447,
          "num_children": 17,
          "author": 355259,
          "replies": [
            {
              "id": "iawlh8u",
              "text": "Yeah my uncle got completely rat-fucked by his sociopath ex-wife. And she turned their daughter against him, too. She got everything, including the house and his money, even though she is like publically elected to the city council and makes way more money than he does. She systematically ruined this man, took out credit cards in his name, purchased vehicles in his name, didn't pay any bills on time and ruined his credit.",
              "timestamp": "2022-06-02 12:37:05",
              "score": 103,
              "num_children": 2,
              "author": 186995,
              "replies": [
                {
                  "id": "iawnajf",
                  "text": "OJ would’ve had a field day with her",
                  "timestamp": "2022-06-02 12:53:16",
                  "score": 51,
                  "num_children": 0,
                  "author": 142473,
                  "replies": []
                },
                {
                  "id": "iaxmp4x",
                  "text": "Time to do a political crime",
                  "timestamp": "2022-06-02 17:17:42",
                  "score": 25,
                  "num_children": 0,
                  "author": 24567,
                  "replies": []
                }
              ]
            },
            {
              "id": "iawowze",
              "text": "Yeah, I came here to say; \"Oh, good! Now all we have to do as men to overcome an attractive woman trying to ruin our lives is become a beloved international movie star for 20+ years and have legendary charisma. No problem.\"",
              "timestamp": "2022-06-02 13:07:15",
              "score": 68,
              "num_children": 1,
              "author": 130683,
              "replies": [
                {
                  "id": "iazt8xf",
                  "text": "\"Attractive\" woman",
                  "timestamp": "2022-06-03 03:13:20",
                  "score": 3,
                  "num_children": 1,
                  "author": 61019,
                  "replies": [
                    {
                      "id": "ib0kikm",
                      "text": "Based.",
                      "timestamp": "2022-06-03 08:37:58",
                      "score": 2,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iaw6l2b",
              "text": "Don't get married, don't live with women, don't even talk to them.",
              "timestamp": "2022-06-02 09:43:05",
              "score": 858,
              "num_children": 28,
              "replies": [
                {
                  "id": "iawy96f",
                  "text": "Fuck MGTOW it’s time for MDTWEE (men in denial that women even exist)",
                  "timestamp": "2022-06-02 14:22:13",
                  "score": 16,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "iaw8sz5",
                  "text": "One guy got sued because a women had a nightmare were she got raped by that guy and I think she even won that case. The guy didn't even know her so even if a woman is aware you exist you won't be safe.",
                  "timestamp": "2022-06-02 10:14:55",
                  "score": 180,
                  "num_children": 4,
                  "replies": [
                    {
                      "id": "iawb2wg",
                      "text": "Clarence Moses-EL spent 28 years of a 48 year sentence locked up because his [name came to her in a dream](https://www.reuters.com/article/us-colorado-crime-acquittal-idUSKBN13A02Z)",
                      "timestamp": "2022-06-02 10:44:52",
                      "score": 243,
                      "num_children": 6,
                      "author": 105270,
                      "replies": [
                        {
                          "id": "iawbsfb",
                          "text": "\\> When you get raped and beaten by a person and literally cannot tell what they look like so you just blame your neighbor because he's somewhat similar.\n\n\n😬\n\n[Hot damn she still wants to blame him](https://www.denverpost.com/2019/02/16/clarence-moses-el-case-victim-statement/amp/)",
                          "timestamp": "2022-06-02 10:53:50",
                          "score": 200,
                          "num_children": 1,
                          "author": 272607,
                          "replies": [
                            {
                              "id": "iawe7nk",
                              "text": "[removed]",
                              "timestamp": "2022-06-02 11:22:20",
                              "score": 36,
                              "num_children": 3,
                              "replies": [
                                {
                                  "id": "iawenzu",
                                  "text": "i don’t think anybody has the right to commit a mass shooting\n\n\nbut",
                                  "timestamp": "2022-06-02 11:27:22",
                                  "score": 37,
                                  "num_children": 0,
                                  "replies": []
                                },
                                {
                                  "id": "iawk5ad",
                                  "text": "I mean, that's $71,500/yr. More than what a lot of people get. \n\nDefinitely still unjustly imprisoned and his life is forever fucked. But some people accept those same sort of terms for nearly half that pay\n\nFucking bonkers that the $2mil comes from the taxpayers though instead of the asshole who started the whole charade. I wonder how much the lawyers got",
                                  "timestamp": "2022-06-02 12:24:12",
                                  "score": 18,
                                  "num_children": 2,
                                  "replies": [
                                    {
                                      "id": "iax1pvd",
                                      "text": "You can't put a price on freedom.",
                                      "timestamp": "2022-06-02 14:48:20",
                                      "score": 12,
                                      "num_children": 0,
                                      "replies": []
                                    },
                                    {
                                      "id": "it5fqjx",
                                      "text": "taxpayers are the ones that convicted him based on a dream",
                                      "timestamp": "2022-10-21 01:46:13",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 31169,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "iawevqr",
                                  "text": "Whoa there radical terrorist, is this a call to action? A crime against the law?",
                                  "timestamp": "2022-06-02 11:29:45",
                                  "score": 11,
                                  "num_children": 1,
                                  "author": 315268,
                                  "replies": [
                                    {
                                      "id": "iawjzdt",
                                      "text": "[deleted]",
                                      "timestamp": "2022-06-02 12:22:38",
                                      "score": 7,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "iawxvjg",
                                          "text": "Gotteem",
                                          "timestamp": "2022-06-02 14:19:23",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 315268,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "iawpfed",
                          "text": ">In addition, DNA evidence that might have cleared Moses-EL was mistakenly destroyed by Denver Police, the defense said.\n\nWhy they do be like that",
                          "timestamp": "2022-06-02 13:11:38",
                          "score": 60,
                          "num_children": 4,
                          "author": 388741,
                          "replies": [
                            {
                              "id": "iax2q23",
                              "text": "\"Mistakenly\"",
                              "timestamp": "2022-06-02 14:55:45",
                              "score": 33,
                              "num_children": 0,
                              "author": 45188,
                              "replies": []
                            },
                            {
                              "id": "iax4f38",
                              "text": "Denver is/was corrupt as hell man.",
                              "timestamp": "2022-06-02 15:08:14",
                              "score": 16,
                              "num_children": 0,
                              "author": 340856,
                              "replies": []
                            },
                            {
                              "id": "iaxazw5",
                              "text": "Yup 'mistakenly'. Totally believable",
                              "timestamp": "2022-06-02 15:55:14",
                              "score": 5,
                              "num_children": 0,
                              "author": 335138,
                              "replies": []
                            },
                            {
                              "id": "iaz70s4",
                              "text": "The moisture destroyed the evidence.",
                              "timestamp": "2022-06-03 00:15:29",
                              "score": 1,
                              "num_children": 0,
                              "author": 315946,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "iawe4xh",
                          "text": "“What’s your source?” “It came to me in a dream.”",
                          "timestamp": "2022-06-02 11:21:31",
                          "score": 69,
                          "num_children": 1,
                          "author": 350234,
                          "replies": [
                            {
                              "id": "iawt24s",
                              "text": ">it was real in my head",
                              "timestamp": "2022-06-02 13:41:36",
                              "score": 20,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iax3gsl",
                                  "text": "\"My source is that I made it the fuck up.\"",
                                  "timestamp": "2022-06-02 15:01:14",
                                  "score": 17,
                                  "num_children": 0,
                                  "author": 346458,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "iawcedy",
                          "text": "I somehow knew the poor dude is gonna be  black before clicking on the link.",
                          "timestamp": "2022-06-02 11:01:16",
                          "score": 86,
                          "num_children": 1,
                          "author": 259996,
                          "replies": [
                            {
                              "id": "iawdx37",
                              "text": "The raping gave it away.",
                              "timestamp": "2022-06-02 11:19:10",
                              "score": 59,
                              "num_children": 0,
                              "author": 24030,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "iaxi9nv",
                          "text": "What the fuck...",
                          "timestamp": "2022-06-02 16:46:47",
                          "score": 2,
                          "num_children": 0,
                          "author": 266518,
                          "replies": []
                        },
                        {
                          "id": "ib1229v",
                          "text": "LOL. Easy, cruisin",
                          "timestamp": "2022-06-03 12:25:41",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iawa10r",
                      "text": "Never leave your house and hide behind usernames. Problem solved.",
                      "timestamp": "2022-06-02 10:31:28",
                      "score": 39,
                      "num_children": 1,
                      "author": 140326,
                      "replies": [
                        {
                          "id": "iawczf5",
                          "text": "can confirm, highly effective life strategy.",
                          "timestamp": "2022-06-02 11:08:04",
                          "score": 16,
                          "num_children": 0,
                          "author": 141448,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iawaree",
                      "text": "There is no fucking way this is real.",
                      "timestamp": "2022-06-02 10:40:59",
                      "score": 30,
                      "num_children": 3,
                      "replies": [
                        {
                          "id": "iawc9mq",
                          "text": "The clown emojy is banned from a 4chan subreddit ... okee mods.",
                          "timestamp": "2022-06-02 10:59:45",
                          "score": 36,
                          "num_children": 2,
                          "author": 312344,
                          "replies": [
                            {
                              "id": "iawccj3",
                              "text": "The 4chan submods are the real clowns...",
                              "timestamp": "2022-06-02 11:00:40",
                              "score": 20,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iax3syi",
                                  "text": "They even do it for free",
                                  "timestamp": "2022-06-02 15:03:41",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 17289,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "iaxdtg4",
                              "text": "Banning Clown emoji is based.  you can use words to express yourself if you just put in a little effort and it’s likely to be funnier (at least can’t be worse). \n\nEvery time I see the clown emoji I can’t help but see the 14-16 year old aspiring edgelord behind the keyboard smirking like he’s the cleverest motherfucker alive",
                              "timestamp": "2022-06-02 16:15:25",
                              "score": 0,
                              "num_children": 1,
                              "author": 193080,
                              "replies": [
                                {
                                  "id": "iaxg54c",
                                  "text": "Yah youre right using words does actually come across as more mature.\n\nIn that sense...\n\n*clown emoji",
                                  "timestamp": "2022-06-02 16:31:52",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 312344,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "iawd6la",
                          "text": "Real",
                          "timestamp": "2022-06-02 11:10:28",
                          "score": 10,
                          "num_children": 0,
                          "author": 260735,
                          "replies": []
                        },
                        {
                          "id": "iawc6dz",
                          "text": "[removed]",
                          "timestamp": "2022-06-02 10:58:36",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "iawc6f7",
                              "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```🤡```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
                              "timestamp": "2022-06-02 10:58:37",
                              "score": -3,
                              "num_children": 1,
                              "author": 184140,
                              "replies": [
                                {
                                  "id": "iawd5e5",
                                  "text": "Clown emojis are banned on Reddit. This is the funniest thing ever.",
                                  "timestamp": "2022-06-02 11:10:04",
                                  "score": 15,
                                  "num_children": 1,
                                  "author": 260735,
                                  "replies": [
                                    {
                                      "id": "iaxggt1",
                                      "text": "Not Reddit. This sub.",
                                      "timestamp": "2022-06-02 16:34:10",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 47154,
                                      "replies": [
                                        {
                                          "id": "iaxgjz3",
                                          "text": "As requested by Reddit admins",
                                          "timestamp": "2022-06-02 16:34:47",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 260735,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iawk92t",
                      "text": "That dude was black though, if any white person accused you of anything back then you were going to jail if you're black.",
                      "timestamp": "2022-06-02 12:25:14",
                      "score": 0,
                      "num_children": 1,
                      "author": 242940,
                      "replies": [
                        {
                          "id": "iayfxw2",
                          "text": "Oh, so that's why it was called the \"good old days\".",
                          "timestamp": "2022-06-02 20:46:24",
                          "score": 2,
                          "num_children": 0,
                          "author": 154458,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iawcxd2",
                  "text": "You have to find the right girl, but unfortunately it’s Russian roulette. I got lucky, but I have to say, it’s not worth the risk.",
                  "timestamp": "2022-06-02 11:07:23",
                  "score": 21,
                  "num_children": 1,
                  "author": 260735,
                  "replies": [
                    {
                      "id": "iaykrd1",
                      "text": "You're lucky until you're not.",
                      "timestamp": "2022-06-02 21:22:30",
                      "score": 3,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iayl5v4",
                          "text": "Thank you Mr\\_Prolapsed\\_Anus.",
                          "timestamp": "2022-06-02 21:25:32",
                          "score": 5,
                          "num_children": 0,
                          "author": 260735,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iaw6z2i",
                  "text": "Based and ultra-loser pilled",
                  "timestamp": "2022-06-02 09:48:51",
                  "score": 520,
                  "num_children": 5,
                  "author": 96550,
                  "replies": [
                    {
                      "id": "iawjp7g",
                      "text": "   \\> flair mentions he posts on /fit/\n   \\> criticizes someone for being homosexual\n\nWhatever you say, buddy.",
                      "timestamp": "2022-06-02 12:20:01",
                      "score": 48,
                      "num_children": 1,
                      "author": 196222,
                      "replies": [
                        {
                          "id": "iax75l2",
                          "text": "Yeah, but /fit/izens are only gay to mog on other dudes and maximize compliments on thier physique.",
                          "timestamp": "2022-06-02 15:27:44",
                          "score": 1,
                          "num_children": 0,
                          "author": 248276,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iaw8s1w",
                      "text": "Loser pilled? More like chad pilled. Anon would rather download Grindr and get topped than be with a w*man.",
                      "timestamp": "2022-06-02 10:14:34",
                      "score": 460,
                      "num_children": 6,
                      "author": 175752,
                      "replies": [
                        {
                          "id": "iawcla6",
                          "text": "Imagine being so masculine you’ll suck a dick just to avoid femininity",
                          "timestamp": "2022-06-02 11:03:27",
                          "score": 349,
                          "num_children": 10,
                          "author": 383453,
                          "replies": [
                            {
                              "id": "iawdvo7",
                              "text": "Greekpilled",
                              "timestamp": "2022-06-02 11:18:43",
                              "score": 371,
                              "num_children": 2,
                              "author": 85517,
                              "replies": [
                                {
                                  "id": "iax284d",
                                  "text": "man that just means in the butt pilled",
                                  "timestamp": "2022-06-02 14:52:04",
                                  "score": 23,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "iax7b3e",
                                      "text": "No, it's not gay if you're a top.",
                                      "timestamp": "2022-06-02 15:28:51",
                                      "score": 25,
                                      "num_children": 2,
                                      "replies": [
                                        {
                                          "id": "iaxo828",
                                          "text": "[deleted]",
                                          "timestamp": "2022-06-02 17:28:13",
                                          "score": 2,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "iaxqqww",
                                              "text": "Gay but probably still more interesting than a conversation with a woman.",
                                              "timestamp": "2022-06-02 17:45:29",
                                              "score": 2,
                                              "num_children": 0,
                                              "replies": []
                                            }
                                          ]
                                        },
                                        {
                                          "id": "ib0b1me",
                                          "text": "Keep telling yourself that, buddy",
                                          "timestamp": "2022-06-03 06:18:52",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "iax5goq",
                                  "text": "Sparta or Athens is the question now",
                                  "timestamp": "2022-06-02 15:15:48",
                                  "score": 4,
                                  "num_children": 1,
                                  "author": 397611,
                                  "replies": [
                                    {
                                      "id": "iaxkkbw",
                                      "text": "Lesbos.",
                                      "timestamp": "2022-06-02 17:02:46",
                                      "score": 3,
                                      "num_children": 0,
                                      "author": 109634,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "iawlph3",
                              "text": "Fucking with chicks is gay af.",
                              "timestamp": "2022-06-02 12:39:15",
                              "score": 60,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "iawszlu",
                                  "text": "You might be onto something. The guys who hung out with girls in high school always end up being gay",
                                  "timestamp": "2022-06-02 13:41:02",
                                  "score": 40,
                                  "num_children": 0,
                                  "replies": []
                                },
                                {
                                  "id": "iawvb8n",
                                  "text": "[removed]",
                                  "timestamp": "2022-06-02 13:59:32",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "iawvbac",
                                      "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```faggots```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
                                      "timestamp": "2022-06-02 13:59:33",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 184140,
                                      "replies": [
                                        {
                                          "id": "iawvovo",
                                          "text": "Its a quote from a film, dur! and in context to the conversation.",
                                          "timestamp": "2022-06-02 14:02:29",
                                          "score": 2,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "iawjzi1",
                              "text": "Don't just imagine.",
                              "timestamp": "2022-06-02 12:22:40",
                              "score": 64,
                              "num_children": 0,
                              "author": 309127,
                              "replies": []
                            },
                            {
                              "id": "iawq4pb",
                              "text": "Take the plunge, brother",
                              "timestamp": "2022-06-02 13:17:35",
                              "score": 8,
                              "num_children": 0,
                              "author": 322889,
                              "replies": []
                            },
                            {
                              "id": "iax1uql",
                              "text": "I don't have to imagine",
                              "timestamp": "2022-06-02 14:49:19",
                              "score": 2,
                              "num_children": 0,
                              "replies": []
                            },
                            {
                              "id": "iax33rm",
                              "text": "Based and hellenistpilled. That's the only way, brother.",
                              "timestamp": "2022-06-02 14:58:34",
                              "score": 2,
                              "num_children": 0,
                              "author": 152904,
                              "replies": []
                            },
                            {
                              "id": "iaxcoj0",
                              "text": "Don't hate cause you're afraid of the taste of Hateraide.",
                              "timestamp": "2022-06-02 16:07:19",
                              "score": 2,
                              "num_children": 0,
                              "author": 325022,
                              "replies": []
                            },
                            {
                              "id": "iaykyxc",
                              "text": "Based and Hellenes-Pilled",
                              "timestamp": "2022-06-02 21:24:05",
                              "score": 2,
                              "num_children": 0,
                              "author": 72410,
                              "replies": []
                            },
                            {
                              "id": "iayqzfd",
                              "text": "Bronze age mindset literally",
                              "timestamp": "2022-06-02 22:09:22",
                              "score": 2,
                              "num_children": 0,
                              "author": 339249,
                              "replies": []
                            },
                            {
                              "id": "ib0muvh",
                              "text": "Imagine?!? I'm already on it 😎😎😎",
                              "timestamp": "2022-06-03 09:14:38",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "iawjmw2",
                          "text": "Maybe Anon is the one doing the topping? Not so loser pilled now",
                          "timestamp": "2022-06-02 12:19:25",
                          "score": 33,
                          "num_children": 1,
                          "author": 404615,
                          "replies": [
                            {
                              "id": "iawl5k5",
                              "text": "Topping is gay as fuck, you're basically putting your dick in other peoples pooper. Straight people only get topped.",
                              "timestamp": "2022-06-02 12:34:00",
                              "score": 27,
                              "num_children": 1,
                              "author": 175752,
                              "replies": [
                                {
                                  "id": "iawlbyu",
                                  "text": "There’s nothing gay about sticking your dick in a hole",
                                  "timestamp": "2022-06-02 12:35:42",
                                  "score": 26,
                                  "num_children": 0,
                                  "author": 404615,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "iax0vat",
                          "text": "You can take dick in the butt and still be a loser, just ask your dad.",
                          "timestamp": "2022-06-02 14:41:58",
                          "score": 1,
                          "num_children": 1,
                          "author": 134756,
                          "replies": [
                            {
                              "id": "iaxc8m9",
                              "text": "XDDDDDDDDDDDDDDDDDDDDDD xDDDDDDDddddddDDD WHAT A JOKE! xDDDDDDDDDDDDDDD WHAT A JOKE xDDDDDDDDdDDDDDDDDDDDDDDDDD \nxDDDDDD WHAT A xDDDDDDDDDDDD JOKE Xddddddd WHAT A JOKE XDdddddddddDDDDDDDDDDDD",
                              "timestamp": "2022-06-02 16:04:11",
                              "score": 1,
                              "num_children": 0,
                              "author": 175752,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "iax5tn4",
                          "text": "Bad news, blanco nino, gay men can sue each other for divorce and domestic abuse, too.",
                          "timestamp": "2022-06-02 15:18:19",
                          "score": 1,
                          "num_children": 0,
                          "author": 150237,
                          "replies": []
                        },
                        {
                          "id": "ib2187e",
                          "text": "Just become celibate instead of degenerate and ascend",
                          "timestamp": "2022-06-03 16:54:33",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        },
                        {
                          "id": "iaxsb8m",
                          "text": "Absolutely love that you people always start and stop at gay sex. Never considering that maybe, just maybe men have the same capacity to commit evil",
                          "timestamp": "2022-06-02 17:56:29",
                          "score": -1,
                          "num_children": 0,
                          "author": 345198,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iawsnun",
                      "text": "Nah. Just get a femboy. EZ",
                      "timestamp": "2022-06-02 13:38:27",
                      "score": 11,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iaypwji",
                          "text": "What is it with /k/ommunists and femboys?\n\nSrs. I'm about to marry a former operatorchan mod, and he has a thing for femboys. I'm a hairy bear and do not fit at all for this.\n\nAll the /k/ommandos I've met are bi for fembois XD",
                          "timestamp": "2022-06-02 22:01:13",
                          "score": 1,
                          "num_children": 1,
                          "author": 103874,
                          "replies": [
                            {
                              "id": "iba37kh",
                              "text": "Something about rifles representing the phallus, I guess? But you're not gay-gay (eww) so you want some attributes of femininity? And transistors are too crazy even for men to deal with?\n\nAnyway, grats on your upcoming marriage, fraggot. Don't call us /k/ommunists though. The fuck is wrong with you, boy?",
                              "timestamp": "2022-06-05 18:41:26",
                              "score": 2,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "ibcdby3",
                                  "text": "Lol, sorry. I know you prefer /k/ommando but let's face it, every board has a less flattering shorthand utilizing the board name. I kinda had to.\n\nIf you're a really really old opchan/k/ nerd, I'm getting hitched with bucky, and you'll know how weird he is. We've been besties since we were 18 and dating for 10 years XD\n\nThanks fargit. A whole fuck of a lot is wrong with me.",
                                  "timestamp": "2022-06-06 07:43:01",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 103874,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iawesxp",
                      "text": "That's projection buddy",
                      "timestamp": "2022-06-02 11:28:54",
                      "score": 20,
                      "num_children": 1,
                      "author": 315268,
                      "replies": [
                        {
                          "id": "iawjqs4",
                          "text": "Takes a projector to know a projector",
                          "timestamp": "2022-06-02 12:20:25",
                          "score": 13,
                          "num_children": 1,
                          "author": 15470,
                          "replies": [
                            {
                              "id": "iawxxux",
                              "text": "Defensiveness? That's new",
                              "timestamp": "2022-06-02 14:19:52",
                              "score": -1,
                              "num_children": 1,
                              "author": 315268,
                              "replies": [
                                {
                                  "id": "iax7dzc",
                                  "text": "It’s a truthful joke senor, do better",
                                  "timestamp": "2022-06-02 15:29:26",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 15470,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iayoshl",
                      "text": "Should be, just don't get married. Hire a prostitute or two, way cheaper. \n\nIf you want a kid, just hire a thot to carry your seed for a fee. Lawyer up with paper works so it'll go smoothly.",
                      "timestamp": "2022-06-02 21:52:43",
                      "score": 1,
                      "num_children": 0,
                      "author": 189236,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iawc6hd",
                  "text": "Seriously don't get married. Stupid archaic system. Pointless. Just fucking live together fuck that extra bullshit",
                  "timestamp": "2022-06-02 10:58:38",
                  "score": 28,
                  "num_children": 1,
                  "author": 195056,
                  "replies": [
                    {
                      "id": "iawjwhd",
                      "text": "In SOME states, living together long enough will make you legally married. It’s called a common law marriage",
                      "timestamp": "2022-06-02 12:21:52",
                      "score": 32,
                      "num_children": 1,
                      "author": 404615,
                      "replies": [
                        {
                          "id": "iaya5qa",
                          "text": "That makes me curious, how does that work with homosexuality? How does that work at all? What if I'm gay and banging my dude roommate, are we forced to get married? What if he's really just a roommate and there's no relationship?\n\nNow what if I'm living with a chick but we aren't dating? Are we forced into marriage? Genuine questions cause I'm not seeing how this could work like, at all.",
                          "timestamp": "2022-06-02 20:04:12",
                          "score": 3,
                          "num_children": 1,
                          "author": 195056,
                          "replies": [
                            {
                              "id": "iayga0p",
                              "text": "Here you go, bud! Not the most informative article, but a starting point\n\nhttps://www.npr.org/2016/09/04/487825901/no-you-re-not-in-a-common-law-marriage-after-7-years-of-dating",
                              "timestamp": "2022-06-02 20:48:55",
                              "score": 3,
                              "num_children": 0,
                              "author": 404615,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iax5bm1",
                  "text": "Cucked by the government",
                  "timestamp": "2022-06-02 15:14:47",
                  "score": 4,
                  "num_children": 0,
                  "author": 249100,
                  "replies": []
                },
                {
                  "id": "iawfy9m",
                  "text": "Women giving me another reason to switch to femboys again smh",
                  "timestamp": "2022-06-02 11:41:25",
                  "score": 14,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "iaw777t",
                  "text": "Sir this is Reddit.",
                  "timestamp": "2022-06-02 09:52:15",
                  "score": 16,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iaw8tzx",
                      "text": "\"You don't need to tell that to anyone here.\"",
                      "timestamp": "2022-06-02 10:15:20",
                      "score": 13,
                      "num_children": 0,
                      "author": 128317,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iawl0ia",
                  "text": "So switch teams?",
                  "timestamp": "2022-06-02 12:32:40",
                  "score": 3,
                  "num_children": 0,
                  "author": 184103,
                  "replies": []
                },
                {
                  "id": "iax0pwb",
                  "text": "Like I had a choice to begin with?",
                  "timestamp": "2022-06-02 14:40:51",
                  "score": 3,
                  "num_children": 0,
                  "author": 345976,
                  "replies": []
                },
                {
                  "id": "iawb1pf",
                  "text": "And up the tren?",
                  "timestamp": "2022-06-02 10:44:27",
                  "score": 4,
                  "num_children": 1,
                  "author": 402516,
                  "replies": [
                    {
                      "id": "iawboi8",
                      "text": "Tren cough activates",
                      "timestamp": "2022-06-02 10:52:28",
                      "score": 3,
                      "num_children": 0,
                      "author": 18095,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iaxlmey",
                  "text": "I'd be gay if not for the sex with men thing.",
                  "timestamp": "2022-06-02 17:10:16",
                  "score": 2,
                  "num_children": 0,
                  "author": 356947,
                  "replies": []
                },
                {
                  "id": "iaxz7br",
                  "text": "Women. You can't live with 'em, and yet they're everywhere. - Harry Solomon",
                  "timestamp": "2022-06-02 18:45:17",
                  "score": 2,
                  "num_children": 0,
                  "author": 57971,
                  "replies": []
                },
                {
                  "id": "iaw7bbd",
                  "text": "Just avoid the hollywood type celebs and those with purple hair and you'll probably be fine.",
                  "timestamp": "2022-06-02 09:53:55",
                  "score": 13,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "iawf888",
                  "text": "You forgot the last step: go down on men exclusively",
                  "timestamp": "2022-06-02 11:33:34",
                  "score": 6,
                  "num_children": 1,
                  "author": 86548,
                  "replies": [
                    {
                      "id": "ib09r79",
                      "text": "Brother in Christ, this is gay",
                      "timestamp": "2022-06-03 06:02:06",
                      "score": 1,
                      "num_children": 0,
                      "author": 360104,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iaw8p6p",
                  "text": "Well, with your username I would. Most women aren't Amber Heard.",
                  "timestamp": "2022-06-02 10:13:26",
                  "score": 2,
                  "num_children": 1,
                  "author": 194176,
                  "replies": [
                    {
                      "id": "iawdgch",
                      "text": "It’s just not worth the gamble you will find a good one when your life can be destroyed like this. I dated a heardesque woman for 3 years, and I’m pretty sure it has taken at least a decade off my life due to stress.",
                      "timestamp": "2022-06-02 11:13:44",
                      "score": 12,
                      "num_children": 0,
                      "author": 260735,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iawhp4m",
                  "text": "Based",
                  "timestamp": "2022-06-02 11:59:59",
                  "score": 2,
                  "num_children": 0,
                  "author": 239554,
                  "replies": []
                },
                {
                  "id": "iax7v1g",
                  "text": "Take the ten minutes to generate a prenup, get it notarized, and never worry again. It's insanely easy to protect yourself.\n\nGetting married and raising a family correctly is based. MGTOW is cucked as hell. You are falling for the psyop\n\nEdit: Shoutout to \"Big Chungus\" who blocked me after replying, like a coward.",
                  "timestamp": "2022-06-02 15:32:53",
                  "score": 1,
                  "num_children": 1,
                  "author": 165719,
                  "replies": [
                    {
                      "id": "iaxh0ej",
                      "text": "*You* are cucked as hell you little twat. Look up the fucking thousands of cases where judges (usually female) have tossed out prenups on the premise that they were \"coerced\", and you'll realize just how much of a fucking Mongoloid you are.",
                      "timestamp": "2022-06-02 16:38:03",
                      "score": 4,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iawrkq5",
                  "text": "This guy -boack pill",
                  "timestamp": "2022-06-02 13:29:31",
                  "score": 1,
                  "num_children": 0,
                  "author": 385161,
                  "replies": []
                },
                {
                  "id": "iawtfe9",
                  "text": "So..be gay...got it",
                  "timestamp": "2022-06-02 13:44:30",
                  "score": 1,
                  "num_children": 0,
                  "author": 384146,
                  "replies": []
                },
                {
                  "id": "iaxitbf",
                  "text": "I mean to be fair any guy who's been through a shit relationship I think learns that being single isn't that bad.",
                  "timestamp": "2022-06-02 16:50:35",
                  "score": 1,
                  "num_children": 0,
                  "author": 266518,
                  "replies": []
                },
                {
                  "id": "iayqkl6",
                  "text": "easy if you're gay.",
                  "timestamp": "2022-06-02 22:06:12",
                  "score": 1,
                  "num_children": 0,
                  "author": 169417,
                  "replies": []
                },
                {
                  "id": "iayzjtd",
                  "text": "I'm better for having married my wife. If you look for a good woman and not just an (only) attractive one, you will become a better man for it. My wife is my rider and I'd be decidedly worse off without her as my teammate. Bad women exist and should be avoided, all women are not bad women, though.",
                  "timestamp": "2022-06-02 23:14:28",
                  "score": 1,
                  "num_children": 0,
                  "author": 125437,
                  "replies": []
                },
                {
                  "id": "ib1go79",
                  "text": "Don't let looks and/or good sex blind you is my advice. That's where most men go wrong. \n\nA solid person is worth 10 super sexy thots.",
                  "timestamp": "2022-06-03 14:27:31",
                  "score": 1,
                  "num_children": 0,
                  "author": 4220,
                  "replies": []
                },
                {
                  "id": "ic3gdmc",
                  "text": "Yeah, your gymbros can help with any pesky *urges*",
                  "timestamp": "2022-06-12 15:20:51",
                  "score": 1,
                  "num_children": 0,
                  "author": 105047,
                  "replies": []
                },
                {
                  "id": "iaw81n4",
                  "text": "[deleted]",
                  "timestamp": "2022-06-02 10:04:13",
                  "score": 0,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iaw91hn",
                      "text": "The guy you’re replying to is talking about false accusations of DV.",
                      "timestamp": "2022-06-02 10:18:16",
                      "score": 2,
                      "num_children": 0,
                      "author": 235353,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iawrbw8",
                  "text": "It's easy to find a right wing woman who hates feminists",
                  "timestamp": "2022-06-02 13:27:30",
                  "score": 0,
                  "num_children": 1,
                  "author": 162372,
                  "replies": [
                    {
                      "id": "iaxgpif",
                      "text": "Women adopt the beliefs of their current owner, and will always revert into amoral, sociopathic apathy the instant they feel their current owner has failed them in some way (whether real or imagined).",
                      "timestamp": "2022-06-02 16:35:53",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iax752y",
                  "text": "Just record them in private convos assuming that's legal where you are. Have them sign consent forms before sex. Yes it kills the mood a little but they all do it because 1. They want to fuck and 2. \"Consent is sexy\". It's not rocket science bros.",
                  "timestamp": "2022-06-02 15:27:38",
                  "score": 0,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "iawnvak",
              "text": "Average dudes don't really have access to legal defense in the first place, but anyone else is undeniably gonna benefit from a jury ruling positively on this type of case. It sets precedent and makes male victims real in the public consciousness. Might be a cope but that has to count for something",
              "timestamp": "2022-06-02 12:58:22",
              "score": 41,
              "num_children": 1,
              "author": 377058,
              "replies": [
                {
                  "id": "ib04sev",
                  "text": "It does, but doomers gonna doom",
                  "timestamp": "2022-06-03 05:03:25",
                  "score": 2,
                  "num_children": 0,
                  "author": 88678,
                  "replies": []
                }
              ]
            },
            {
              "id": "iawqo5g",
              "text": "But don't kid yourself. This win came with a 15 million penalty, and he will likely also sue for costs after, and if not at least paid for his defense. This tells women that lying about men and trying to ruin their life now comes with a consequence, not just \"losing\".\n\nThe big news is that the pendulum is finally starting to swing back the other way on crazy shit like this, and absurd gender politics. What we have to worry about is that because it swung SO far to one side, that it does NOT swing that far back the other way now and we lose actual progress and equality. Fuck equity, that is just robbery, but equality is something we should all be concerned about.\n\nIn the end, perhaps men will finally be judged on their actions and reality, not just white man bad... and maybe, JUST MAYBE we can finally start speaking out and fighting against abusive females and toxic femininity with some #HeToo",
              "timestamp": "2022-06-02 13:22:03",
              "score": 45,
              "num_children": 2,
              "author": 354049,
              "replies": [
                {
                  "id": "iaxqwd7",
                  "text": "> Fuck equity, that is just robbery, but equality is something we should all be concerned about.\n\nAgree. The fact that some people use those two terms interchangeably just highlights their ignorance.\n\nEquality = blind justice. \n\nEquity = redistribution of wealth and privilege, according to the mandates of the few and powerful.",
                  "timestamp": "2022-06-02 17:46:33",
                  "score": 12,
                  "num_children": 0,
                  "author": 119703,
                  "replies": []
                },
                {
                  "id": "iayvbje",
                  "text": "nah, whats happening is that some grifters are getting cold feet, and its only temporary",
                  "timestamp": "2022-06-02 22:41:51",
                  "score": 3,
                  "num_children": 0,
                  "author": 400298,
                  "replies": []
                }
              ]
            },
            {
              "id": "iawpx6u",
              "text": "Yeah really, what are tens of the thousands of people out there just all of a sudden you gonna start using this case as legal precedent? No, not how it works. They have a hill to climb. For everyone case like this, there is 1000 out there where a judge will blindly still side with baseless claims",
              "timestamp": "2022-06-02 13:15:47",
              "score": 19,
              "num_children": 0,
              "author": 384582,
              "replies": []
            },
            {
              "id": "iax7k4i",
              "text": "38 snub nose is cheap, just saying.",
              "timestamp": "2022-06-02 15:30:40",
              "score": 5,
              "num_children": 0,
              "author": 43755,
              "replies": []
            },
            {
              "id": "iaxrx7p",
              "text": "Nah dude there is a thing called \"precedent\" which depps case has set. Lawyers now can use Depps case as an example to why they need specific evidence/witnesses and the judge will allow it since it has helped win a case before. It set precedent towards relativity.",
              "timestamp": "2022-06-02 17:53:44",
              "score": 5,
              "num_children": 0,
              "author": 309834,
              "replies": []
            },
            {
              "id": "iax1s9g",
              "text": "He's paving the way though",
              "timestamp": "2022-06-02 14:48:49",
              "score": 3,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "iaxdqqg",
              "text": "What, y'all never heard of a ditch on the side of the road?",
              "timestamp": "2022-06-02 16:14:53",
              "score": 3,
              "num_children": 0,
              "author": 163089,
              "replies": []
            },
            {
              "id": "iax7ras",
              "text": "the difference is that now there is a very high profile precedent",
              "timestamp": "2022-06-02 15:32:07",
              "score": 2,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ib21f30",
              "text": "That’s the truth. And even despite technically being innocent of the charges and accusations, they still cost him a ton of money (and reputation, for a time). Most others would be completely screwed without the same level of money and recognition as Depp.\n\nTo think, one mistake choosing a relationship with the wrong person (which you likely don’t know in advance like for Depp) can potentially alter your life for the worse if they decide to get “revenge” for a perceived slight or want something out.",
              "timestamp": "2022-06-03 16:55:55",
              "score": 2,
              "num_children": 0,
              "author": 83869,
              "replies": []
            },
            {
              "id": "ib49u9d",
              "text": "I had a very similar event happen to me in my life like JD, but I wasn’t dumb and bought spy cameras and recorded everything. Took 1 hour and it was over for her, 10 years in jail, no joke. She was horrible.",
              "timestamp": "2022-06-04 05:05:10",
              "score": 2,
              "num_children": 0,
              "author": 28820,
              "replies": []
            },
            {
              "id": "iax7x68",
              "text": "who's JD?",
              "timestamp": "2022-06-02 15:33:19",
              "score": 1,
              "num_children": 0,
              "author": 121140,
              "replies": []
            },
            {
              "id": "iayotj7",
              "text": "It maaay be the case that his win could demarcate a general trend of courts abandoning hysterical practices, the hard-fought first big public victory that pave the way for others to follow. It may be the case that others could have somewhat easier times battling defamation if this is seen as the dogshit bullet in the head of metoo.\n\nThat being said you may still be right about us regular peons with no acumen pitted against actual psychopaths.",
              "timestamp": "2022-06-02 21:52:56",
              "score": 1,
              "num_children": 0,
              "author": 112278,
              "replies": []
            },
            {
              "id": "iayuioh",
              "text": "that and all the laws passed around to world to favor women over men in these cases will stay there even if you have another 100 high profile cases like this",
              "timestamp": "2022-06-02 22:35:59",
              "score": 1,
              "num_children": 0,
              "author": 400298,
              "replies": []
            },
            {
              "id": "iax8scp",
              "text": "This. It's ironic because the \"metoo\" fad was the same thing; celebrity women complained about Weinstein, and every normie thot believed it was a sea change and that \"believe all women\" was actually going to be a thing moving forward, when it really only applied to a handful of cultural elites with immense social clout.",
              "timestamp": "2022-06-02 15:39:33",
              "score": 0,
              "num_children": 0,
              "author": 112806,
              "replies": []
            }
          ]
        },
        {
          "id": "iawgcwc",
          "text": "The #MeToo movement pushed the idea of “believe all women” when it should have pushed “investigate all claims of women.” \n\nIncorrectly assuming all women tell the truth raises all sorts of problems because bad actors don’t always tell the truth (pun intended). \n\nHowever, if you take every claim seriously and investigate it without assuming one side is speaking the truth while the other side is automatically guilty, then justice remains fair and impartial and more likely to discover the actual truth of the situation. The women get what they really want. And, all of society benefits.",
          "timestamp": "2022-06-02 11:45:42",
          "score": 154,
          "num_children": 8,
          "replies": [
            {
              "id": "iawhylr",
              "text": "As an almost victim of a woman's bullshit, I would have loved a proper investigation. As it stood, in was at the mercy of a jury facing down up to 80 years.\n\nLuckily in court it came out to be lies and showed her shittiness. Police even tried to falsify evidence that was miraculously \"lost\" when my side challenged them on it.",
              "timestamp": "2022-06-02 12:02:28",
              "score": 90,
              "num_children": 0,
              "author": 223300,
              "replies": []
            },
            {
              "id": "iawr0np",
              "text": "That shit is dangerous. Military justice in particular is usually way faster and looser than the civilian court system, for example. When I was at training over the course of 8 or so months there was a woman that ended up accusing her \"boyfriends\" of rape whenever they got tired of her shit or didn't do what she wanted. About a half dozen dudes got the boot on rape charges before they finally realized it was a little suspicious and did an investigation showing that she was lying. She ended up getting kicked out on charges and I think the charges against the dudes got dropped but they still got kicked out to be homeless.\n\nSome other dude asked during one of our sensitivity/sexual assault prevention classes what to do if someone makes a false accusation and the instructor flatly said that never happens and he got escorted out to get his ass chewed over just asking.\n\n\nI'm married and I have zero issues with women in general but fuck if women's privilege isn't rampant in the military. Like 90% of the places I've been only dudes ever have to do the cleaning or manual labor bullshit, women can call out for any reason especially if they have kids, shit I've even seen women get out of doing night shifts or any other mildly inconvenient job by literally just crying about it.\n\n\nShit, technically the military says the women CANNOT consent if they've had any drinks at all. Not even \"drank until drunk or comatose\" explicitly if you share a drink or two with a girl and have sex the man can be accused of rape in those circumstances. No one cares if the man drank though, always his fault.",
              "timestamp": "2022-06-02 13:24:57",
              "score": 50,
              "num_children": 0,
              "author": 336894,
              "replies": []
            },
            {
              "id": "iaww8sr",
              "text": "> Incorrectly assuming all women tell the truth raises all sorts of problems because bad actors don’t always tell the truth (pun intended). \n\nAnd even good actors might be mistaken, or what they see as abuse isn't what the law defines as abuse, or they don't have a strong enough case to prove he deserves to be punished.\n\nI totally agree with you here. My biggest beef with #MeToo is it turned into \"If a woman says she was abused, the guy is definitely an abuser and deserves to have his life ruined.\"",
              "timestamp": "2022-06-02 14:06:48",
              "score": 17,
              "num_children": 0,
              "author": 233608,
              "replies": []
            },
            {
              "id": "iawod5v",
              "text": "I’m leftist as fuck and progressive but the cancel culture from that movement was absolute horse shit. Just straight ignoring who the woman is just bc she said something and anyone who questions it is victim blaming. \n\nMeToo movement did a lot of good but also a lot of bad bc it had no real organization. It was a straight up witch hunt.",
              "timestamp": "2022-06-02 13:02:34",
              "score": 39,
              "num_children": 0,
              "author": 171421,
              "replies": []
            },
            {
              "id": "iawvs58",
              "text": "Remember when Asia Argento stat raped that kid after being vocal about banging Harvey Weinstein and had Anthony Bordain pay the kid hush money and contributed to his suicide?",
              "timestamp": "2022-06-02 14:03:12",
              "score": 4,
              "num_children": 0,
              "author": 216502,
              "replies": []
            },
            {
              "id": "iax7qr9",
              "text": "It evaporated the moment a woman accused Joe Biden",
              "timestamp": "2022-06-02 15:32:00",
              "score": 3,
              "num_children": 1,
              "author": 284662,
              "replies": [
                {
                  "id": "iaxwgnf",
                  "text": "The false accusations against Biden were a perfect example of why we need to actually investigate claims made by women instead of simply accepting their statements as the absolute truth.",
                  "timestamp": "2022-06-02 18:25:56",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "iawn3aj",
              "text": "> The #MeToo movement pushed the idea of “believe all women” when it should have pushed “investigate all claims of women.”\n\nThat is exactly what the movement WAS pushing for. I swtg good movements are shit at picking phrases. Same was 'defund the police' doesn't mean 'get rid of police' it meant 'reallocate funding into new, better suited systems'",
              "timestamp": "2022-06-02 12:51:31",
              "score": -6,
              "num_children": 4,
              "author": 294628,
              "replies": [
                {
                  "id": "iawo9t4",
                  "text": "> I swtg good movements are shit at picking phrases. \n\nI'm pretty sure they use an AI bot that is fed nothing but Reddit posts sorted by controversial, uses the most controversial comments to learn how to speak, and then it generates the new catchphrase for the next progressive movement.\n\nThat or the Russians.",
                  "timestamp": "2022-06-02 13:01:48",
                  "score": 10,
                  "num_children": 0,
                  "author": 310893,
                  "replies": []
                },
                {
                  "id": "iawvgkz",
                  "text": "Branding movements has failed for millenia because the choice of branding is always done by cretins.\n\n\"Kill the bill!\" Holy shit that was retarded. It obviously failed. Protesting is now illegal in UK, with 10 years of jail as potential punishment.",
                  "timestamp": "2022-06-02 14:00:42",
                  "score": 4,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "iax923b",
                  "text": "This is what reasonable commentators assume people must have meant.\n\nHaving talked to people in the movement, and seen the many “abolish the police” signs, I assure you that is not what everyone meant.",
                  "timestamp": "2022-06-02 15:41:26",
                  "score": 3,
                  "num_children": 0,
                  "author": 276676,
                  "replies": []
                },
                {
                  "id": "iawr0ga",
                  "text": "It’s mostly motte and bailey tbqh",
                  "timestamp": "2022-06-02 13:24:54",
                  "score": 2,
                  "num_children": 1,
                  "author": 231220,
                  "replies": [
                    {
                      "id": "iawsc08",
                      "text": "Who?",
                      "timestamp": "2022-06-02 13:35:46",
                      "score": 3,
                      "num_children": 1,
                      "author": 188384,
                      "replies": [
                        {
                          "id": "iawuzc6",
                          "text": "The wording of those phrases is intentionally inflammatory.\n\nIt’s not that they’re “shit at picking phrases”, it’s a motte-and-bailey tactic.",
                          "timestamp": "2022-06-02 13:56:54",
                          "score": 6,
                          "num_children": 1,
                          "author": 231220,
                          "replies": [
                            {
                              "id": "iawwz8z",
                              "text": "Thank you. TIL about motte-and-bail\n\nWiki link for others like me: https://en.wikipedia.org/wiki/Motte-and-bailey\\_fallacy",
                              "timestamp": "2022-06-02 14:12:30",
                              "score": 3,
                              "num_children": 0,
                              "author": 188384,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "iaxgl8e",
              "text": "Classic reddit moment, pushing the \"most claims are faked\" narrative when actually less than 5% of accusations are false.",
              "timestamp": "2022-06-02 16:35:02",
              "score": -1,
              "num_children": 1,
              "author": 349316,
              "replies": [
                {
                  "id": "iaxwyuf",
                  "text": "Classic reddit moment of pushing a strawman argument.\n\nOne, that's not a claim I made.\n\nTwo, even if it was, you have no basis to actually assign a numeric percentage to the claim.",
                  "timestamp": "2022-06-02 18:29:35",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iawcs05",
          "text": "Defence attorney here:\n\nThe problem usually isn’t one of “bullshit claim”. 99% of the time, the women truly and genuinely believe they were abused. They’re not lying. It’s not that clear-cut. \n\nThe problem much more usually is, “is what she thinks was abuse actually abuse under the law”, and you have to take context into account, because it’s almost always a case of gradually declining norms over time. Like the frog in water being brought up to a boil, they don’t see how bad it is until it’s way too late. \n\nFor example, if your gf takes your phone away for an hour and won’t give it back, that’s annoying. It isn’t abuse. On its own. And if she slaps you on the arm in play, it’s not assault. On its own. \n\nBut if you’re in a 5-year toxic relationship where you fight 5-10 times a day, and she frequently calls you a manipulative asshole and you frequently call her a useless whore and it’s gotten so loud that the neighbors have called the police out a couple of times…those maybe start to look like abuse to third parties. So when she goes and talks to her friends and they all tell her you’re abusive and she needs to call the police and leave you…she starts to genuinely believe she’s being abused, and to frame all of your actions in that lens. \n\nSo then one day you get home after an insanely long shift, and she meets you right at the door with a long laundry list of petty chores she wants done, and you’re tired and just want to sit and clear your head for 30 fucking minutes, and she won’t back off, and after 5 minutes of arguing on the doorstep you shove past her to get in, and you accidentally shove a bit harder than you mean and she falls and gets a bruise and calls the police…and now you’re defending assault charges in a domestic abuse context. \n\nLooked at in isolation, it’s bullshit. Looked at in the context of the relationship, it might STILL be bullshit. But looked at from the court’s perspective, where maybe 10% of all cases they see are domestic violence…it might not look like bullshit. The court might see a very familiar story of gradual escalation, that’s going to lead to someone beating the shit out of someone else soon. So now you have an assault charge. And you’re *convinced* it was bullshit, and she’s *convinced* it was abuse…and you’re both kind of right and kind of wrong. \n\nWas Amber Heard abused? Probably. At a minimum, he was a towering asshole. It depends on how you define abuse. Was he also abused? Yes. Clearly. No question. The court got this one right, imho. \n\nBut if you’re only looking at a case like this to reinforce things you already believed, you’ll miss that complexity and only see injustice as a result.",
          "timestamp": "2022-06-02 11:05:34",
          "score": 657,
          "num_children": 17,
          "author": 41717,
          "replies": [
            {
              "id": "iawf4ul",
              "text": "[deleted]",
              "timestamp": "2022-06-02 11:32:32",
              "score": 124,
              "num_children": 3,
              "replies": [
                {
                  "id": "iawswqy",
                  "text": "Abusive relationships are a recipe you can find in a book man. \n\nYeah, some here or there may change an ingredient or be vegan or whatever but they're all mostly the same.",
                  "timestamp": "2022-06-02 13:40:25",
                  "score": 18,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iawuurl",
                      "text": "Gotta be careful with vegans they bruise really easily.",
                      "timestamp": "2022-06-02 13:55:52",
                      "score": 18,
                      "num_children": 1,
                      "author": 411313,
                      "replies": [
                        {
                          "id": "iax3ati",
                          "text": "an old bag of moldy tangerines",
                          "timestamp": "2022-06-02 15:00:01",
                          "score": 3,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iawpc68",
                  "text": "If you're fighting 5-10 times a day, leave them. It's just not worth it. The stress will literally shorten your life.",
                  "timestamp": "2022-06-02 13:10:52",
                  "score": 40,
                  "num_children": 1,
                  "author": 17647,
                  "replies": [
                    {
                      "id": "iaxjgrr",
                      "text": "Sunken cost fallacy etc. I can fix her/him. What if I do this differently, things will be okay? Etc. Down the hole.\n\nSo yeah leave. Set that personal boundary and adhere to it. Don't let your mind trick you into what ifs.",
                      "timestamp": "2022-06-02 16:55:08",
                      "score": 16,
                      "num_children": 0,
                      "author": 41911,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iawn67u",
                  "text": "Lawyers don't have the luxury of ignoring life's complexity the way internet commenters do",
                  "timestamp": "2022-06-02 12:52:13",
                  "score": 91,
                  "num_children": 0,
                  "author": 296432,
                  "replies": []
                }
              ]
            },
            {
              "id": "iawih8m",
              "text": "Law student here. Many thanks for writing this up. \n\nIn England and Wales, we call it coercive control - it is a relatively new phenomenon. Where years of abuse may lead to abnormal functioning of the mind. \n\nHow do courts in America look at cases on an individual basis? We use the reasonable man, where objectively, would the reasonable person, of similar intelligence, age, etc do it? In that example, you mentioned shoving her a bit harder and her getting bruised, the courts might be sympathetic as the reasonable person may act in a similar manner if they were tired.",
              "timestamp": "2022-06-02 12:07:41",
              "score": 65,
              "num_children": 1,
              "replies": [
                {
                  "id": "iawq4nj",
                  "text": "US courts work the same way. And use pretty much the same standards. There can be some changes imposed by legislation but that’s it for differences. \n\nI think the bigger issue is, this was a civil defamation case and not a criminal assault case. So what was relevant greatly expanded, and the burden of proof was preponderance of evidence (balance of probabilities to you, I believe), and not beyond a reasonable doubt. Also, there were no concerns about prejudicial similar fact evidence or the like. So a LOOOT more dirty laundry got dragged out than you might have seen in a criminal case.",
                  "timestamp": "2022-06-02 13:17:34",
                  "score": 33,
                  "num_children": 0,
                  "author": 41717,
                  "replies": []
                }
              ]
            },
            {
              "id": "iawf8p6",
              "text": "Good explanation. Thank you for taking the time to write it up.",
              "timestamp": "2022-06-02 11:33:43",
              "score": 45,
              "num_children": 0,
              "author": 260674,
              "replies": []
            },
            {
              "id": "iawf2ez",
              "text": "Sir this is r/4chan we don't say rational things here",
              "timestamp": "2022-06-02 11:31:48",
              "score": 279,
              "num_children": 1,
              "author": 247798,
              "replies": [
                {
                  "id": "ic3gv4d",
                  "text": "Yeah fuck this guy and his normie \"sense\". GTFO or tits if you're femanon then GTFO anyway",
                  "timestamp": "2022-06-12 15:24:42",
                  "score": 1,
                  "num_children": 0,
                  "author": 105047,
                  "replies": []
                }
              ]
            },
            {
              "id": "iawjdfj",
              "text": "Ngl I had to scroll to the bottom real quick to make sure this wasn’t a shittymorph comment",
              "timestamp": "2022-06-02 12:16:50",
              "score": 29,
              "num_children": 1,
              "author": 187290,
              "replies": [
                {
                  "id": "iawv66f",
                  "text": "Those are the best. Missed opportunity, IMO.",
                  "timestamp": "2022-06-02 13:58:25",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "iawxs6m",
              "text": ">The problem usually isn’t one of “bullshit claim”. 99% of the time, the women truly and genuinely believe they were abused. They’re not lying. It’s not that clear-cut.\n\nEh, anecdotes and all ... but 100% of the sexual assault claims made by/against people I actually knew were total bullshit.    \n\nEven more specifically:   \nThey were drug addicts who fucked up their lives, terrorized and stole from their friends/family, and then tried to use false accusations to escape consequences.",
              "timestamp": "2022-06-02 14:18:42",
              "score": 21,
              "num_children": 1,
              "author": 243304,
              "replies": [
                {
                  "id": "iawz068",
                  "text": "“Total bullshit” is a subjective term. What matters isn’t what you, or I, or the victim thinks about it, but what a court thinks about it. \n\nIt’s *incredibly* common - probably more common than not, in my experience - for people who are objectively abused to think nothing of the sort happens. It’s also very common for people who aren’t objectively abused to think they are. Knowingly false accusations aren’t unknown, but they’re also nowhere near as common as Reddit or 4chan thinks. Not least because, police and courts who deal with dozens of DV claims per day are extremely experienced at detecting bullshit quickly. \n\nI’d bet a fair amount of money that if I or any other criminal lawyer got the full facts on one of those cases you describe as BS, there would almost certainly be live potential legal issues there that you’re missing.",
                  "timestamp": "2022-06-02 14:27:56",
                  "score": 16,
                  "num_children": 1,
                  "author": 41717,
                  "replies": [
                    {
                      "id": "iayzd09",
                      "text": "Other issue in a lot of DV cases is the Duluth model of policing where if there is a mark then someone is going to be at the very least arrested. I had a friend with his wife at a party once, both drunk and the wife tried to steal friend's wallet because she maxed out her card on something. He naturally tried to grab it back before she stole his card but was drunkenly aggressive which lead to him being taken away in cuffs. Whenever something is domestic rather than between two strangers is where police follow a lot of protocols of \"arrest first, investigate later\".",
                      "timestamp": "2022-06-02 23:12:56",
                      "score": 3,
                      "num_children": 0,
                      "author": 220759,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iaxm749",
              "text": "> Was Amber Heard abused? Probably. At a minimum, he was a towering asshole.\n\nyou should watch the trial- at least some of her testimonies. that woman couldn't say an ounce of truth. I too thought that they both started abusing each other under the context of drugs and alchohol and crazy fucking and we should just mind our damn business. But she went above and beyond with the slander.",
              "timestamp": "2022-06-02 17:14:14",
              "score": 2,
              "num_children": 1,
              "author": 63590,
              "replies": [
                {
                  "id": "iay0aa2",
                  "text": "A few thoughts, in response:\n\n1.\tTruth is a word for Sunday school. Courts deal in facts and likelihoods of probability. At least some percentage of what she said was supported by the facts of the case, and much of what she said that seemed untruthful still wasn’t irrational - it was true in some sense to HER, even if it wasn’t very likely or based in fact to the rest of us. This is why we avoid words like truth. \n\n2.\tSlander is a term of art, meaning spoken falsehoods that are known to the speaker to be false, that are damaging to the reputation of the person being spoke about. At issue in this case was the truthfulness of an op-ed Heard wrote. That’s libel, the printed form of defamation, not slander. And what she said on the stand [couldn’t be treated as slander, because it was said under oath, and is privileged as a result](https://www.alllaw.com/articles/nolo/civil-litigation/privilege-defense-defamation.html#:~:text=Witnesses%20in%20court%20are%20under,how%20malicious%20it%20may%20be.).",
                  "timestamp": "2022-06-02 18:53:03",
                  "score": 0,
                  "num_children": 1,
                  "author": 41717,
                  "replies": [
                    {
                      "id": "iaydhtp",
                      "text": "So you missed the part where she lied with malice. Again and again.",
                      "timestamp": "2022-06-02 20:28:34",
                      "score": 2,
                      "num_children": 0,
                      "author": 63590,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iawkqzl",
              "text": "Why is this the only place on reddit where I’ve seen someone freely call him an asshole.\n\nI don’t get why everyone is sucking him off so much when he came off as such a douche both through the evidence in court and how he acted during the whole thing.",
              "timestamp": "2022-06-02 12:30:04",
              "score": 18,
              "num_children": 4,
              "author": 311263,
              "replies": [
                {
                  "id": "iawlf8e",
                  "text": "What makes you say that? He largely acknowledged he was wrong in sending the texts that he did and him looling down the whole time goes back to him promising AH that she will never see his eyes again after she filed a TRO against him.",
                  "timestamp": "2022-06-02 12:36:34",
                  "score": 47,
                  "num_children": 1,
                  "author": 295864,
                  "replies": [
                    {
                      "id": "iawn87p",
                      "text": "I was talking more about him laughing, joking, eating candy, being rude if anyone was questioning him and generally seeming like he was either never paying attention or having a great time\n\nAmber just looked devastated 99% of the time.\n\nAlso he claimed he hadn’t sent most of the texts that were really bad, which is a pretty weak excuse.\nI think like one of them he admitted to and it never really went anywhere beyond being bought up as being kinda gross during the close.",
                      "timestamp": "2022-06-02 12:52:42",
                      "score": -23,
                      "num_children": 4,
                      "author": 311263,
                      "replies": [
                        {
                          "id": "iawtsjt",
                          "text": "Well if I see my ex who have ruined my career in the process of losing her shit I will be having a great time too. \n\nOn the other hand amber turd is in the process getting her career ruined so obviously she will look devastated.",
                          "timestamp": "2022-06-02 13:47:26",
                          "score": 32,
                          "num_children": 0,
                          "author": 57208,
                          "replies": []
                        },
                        {
                          "id": "iawrcmy",
                          "text": "Imagine falling for her shitty acting.",
                          "timestamp": "2022-06-02 13:27:40",
                          "score": 38,
                          "num_children": 1,
                          "author": 56573,
                          "replies": [
                            {
                              "id": "iawrs8d",
                              "text": "Looking slightly upset all the time isn’t really acting\n\nEven from a guilty perspective she knew she would lose.\n\nShe even talked about seeing how people were talking about online\n\nActing happy would have been better acting.",
                              "timestamp": "2022-06-02 13:31:16",
                              "score": -16,
                              "num_children": 0,
                              "author": 311263,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "iaxc28e",
                          "text": "There is some evidence to suggest that he didn't send some of the texts, compare the screenshots. I watched his cross and direct, Amber came across ruder to me in hers. His last testimony before Amber trestified again as well, was where he lost a few points but overall I don't think he did anything super rude. Him joking around with his lawyers just showed that they had good chemistry.",
                          "timestamp": "2022-06-02 16:02:54",
                          "score": 9,
                          "num_children": 0,
                          "author": 295864,
                          "replies": []
                        },
                        {
                          "id": "iaxg9s3",
                          "text": "Watch AH. After her atrocious 'acting' with a comically extended frown, she realized JD was getting media attention by staying relaxed and calm.  After his hug with Camille, all of a sudden she was hugging Elaine.  After seeing his positive chemistry with his team -- laughing, smiling -- lo and behold!, she starts sending forced smiles to her legal team.\n\n\r  \nAnd check out her fake writing, or how Rottenborn casually dismissed her 'notes' passed to him.  She saw JD passing notes, etc. to his team and just imitated (aka tried to gaslight). I think she was at close to a 90% fake level.",
                          "timestamp": "2022-06-02 16:32:46",
                          "score": 6,
                          "num_children": 1,
                          "author": 34983,
                          "replies": [
                            {
                              "id": "iayqwpq",
                              "text": "Idk why everyone thinks her looking sad was acting, it’s literally that expected emotion she would be showing no matter if she was guilty or not, she was being sued for like 8x her net worth. She just looked like a normal upset person.\n\nThe streams all being in 720p made it hard to distinguish anything perfectly.\n\nThat’s not even what gaslighting is.\n\nShe also only started passing notes when they began working on the specific part of the case that required building an arguement, and again when they started building rebuttals and during the defence phase.\n\nBeing friendly with your team is probably something she picked up from Johnny when she heard how it was being perceived by the public, it’s not exactly good court practice.",
                              "timestamp": "2022-06-02 22:08:48",
                              "score": 2,
                              "num_children": 1,
                              "author": 311263,
                              "replies": [
                                {
                                  "id": "ibb0qku",
                                  "text": "I didn't express my previous post very well.  Thanks for calling me out.\n\n\r  \nAt this point, things are settled.  From what I've understood from analysis and commentary, AH's credibility is/was considered a key factor for the jury.  We could find out in time what the jury's mindset was, but the consensus I've seen online is that AH's testimony largely compromised her credibility.\n\n\r  \nThere's a fair amount of commentary on her behavior and demeanor in court, obviously speculative but not necessarily uninformed speculation. See the Behavioral Arts guy, or Psychology in Seattle for example.",
                                  "timestamp": "2022-06-05 23:14:53",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 34983,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iax4990",
                  "text": "Sending your friends texts about Amber being a whore is not domestic abuse. He was clearly pissed off about how things had gone in his relationship. Hence the lawsuit.",
                  "timestamp": "2022-06-02 15:07:01",
                  "score": 23,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iax5h4g",
                      "text": "I didn’t say it was domestic abuse, just that it was gross and makes him look like a douche.\n\nSaying he wanted to ruin her, that he wants her to die, threats, saying he’ll fuck her burnt corpse etc.",
                      "timestamp": "2022-06-02 15:15:53",
                      "score": -3,
                      "num_children": 1,
                      "author": 311263,
                      "replies": [
                        {
                          "id": "iax6ezb",
                          "text": "She ruined his life and career. What do you expect?",
                          "timestamp": "2022-06-02 15:22:25",
                          "score": 12,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "iax7503",
                              "text": "Did she? He’s been in ~13 movies since 2016.\n\nAnd he also ruined her life and career? public support is like 95% with him, Only one person is coming out of this case still being employabile, and it was clear from day 1. Or even before then, the public has been on his side for years.",
                              "timestamp": "2022-06-02 15:27:37",
                              "score": -6,
                              "num_children": 2,
                              "author": 311263,
                              "replies": [
                                {
                                  "id": "iax93m7",
                                  "text": "She is literally still in Aquaman. Depp meanwhile got replaced in Fantastic Beasts because of the accusations. He literally had to do this court case just to clear his name.",
                                  "timestamp": "2022-06-02 15:41:44",
                                  "score": 16,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "iaxdd1u",
                                      "text": "Depp still got his full salary for fantastic beats. Ambers role was heavily reduced for Aquaman.\n\nHe lost the Fantastic beasts role because he lost his libel case in the UK (they found him guilty of 12 counts of domestic abuse including sexual assault there)",
                                      "timestamp": "2022-06-02 16:12:12",
                                      "score": 0,
                                      "num_children": 3,
                                      "author": 311263,
                                      "replies": [
                                        {
                                          "id": "iaxf5wl",
                                          "text": "The UK will also find you guilty of a hatecrime because of a screenshot, they literally have 0 standard of evidence in the UK or EU, its all guilty until proven innocent.",
                                          "timestamp": "2022-06-02 16:24:55",
                                          "score": 9,
                                          "num_children": 0,
                                          "replies": []
                                        },
                                        {
                                          "id": "iaxjh6k",
                                          "text": "He got his full salary for that one movie he got bounced from. How much did he lose by not getting a chance at the sequels?",
                                          "timestamp": "2022-06-02 16:55:13",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 192560,
                                          "replies": []
                                        },
                                        {
                                          "id": "iaxj712",
                                          "text": "His career was still dead in the water. He would never get another acting job with Heard's accusations out there.\n\nHeard's domestic abuse and sexual assault allegations were all re-visited in this trial and found to be phony.",
                                          "timestamp": "2022-06-02 16:53:16",
                                          "score": 3,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "iaypou5",
                                              "text": "He was in 13 movies since her accusation.\n\nHe only got fired from his big jobs after losing the domestic abuse case in the UK after he sued the sun for libel.",
                                              "timestamp": "2022-06-02 21:59:38",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 311263,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "iaxez5w",
                                  "text": "“She tried- and failed to ruin his career.” So its fine because she failed? She lied about absolutely everything, you have about as much standing to call Depp an asshole as I do you, just from your comments here. If you had to live with someone who literally mutilated you, and repeatedly gaslit and coerced you, you’d also be a “towering asshole” in court. She should get 0 slack.",
                                  "timestamp": "2022-06-02 16:23:35",
                                  "score": 5,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iawpxle",
                  "text": "Yeah, this whole thing is an absolute PR win for the guy, as if he wasn’t a thoroughly awful partner with a bad drug and alcohol problem.\n\nWhat Amber did was absolutely awful. She’s a lie and an abuser and is absolute trash. That doesn’t mean Depp is a saint. It doesn’t mean he did no wrong.\n\nEdit: Something to think about from an article I read:\n\n*In the end, perhaps that’s what’s most damning about the larger conversation around this trial: the inability to handle the ambiguities. Faced with a portrait of a relationship in which there’s compelling evidence of violence and toxic behavior on both sides, our culture seems unable to accept that we may simply be looking at a story without heroes. Instead, we demand a tidy narrative with a heroic redemption arc.*",
                  "timestamp": "2022-06-02 13:15:53",
                  "score": 2,
                  "num_children": 1,
                  "author": 122343,
                  "replies": [
                    {
                      "id": "iawz0fs",
                      "text": "[deleted]",
                      "timestamp": "2022-06-02 14:28:00",
                      "score": 16,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iax1wyc",
                          "text": "Yes, but it appears to me that the average opinion of Depp is more favorable than it should be. He did some pretty psycho things if the witness accounts are to be believed at all. No, he didn’t physically abuse her. She lied and tried to ruin him to her own benefit. Amber was awful. But at the same time, he was still pretty crappy.",
                          "timestamp": "2022-06-02 14:49:46",
                          "score": -3,
                          "num_children": 1,
                          "author": 122343,
                          "replies": [
                            {
                              "id": "iaxf9cb",
                              "text": "Mutilating someone vs doing drugs and drinking hmmm I wonder which one is obviously 1000x fucking worse.",
                              "timestamp": "2022-06-02 16:25:36",
                              "score": 4,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iaxgmx3",
                                  "text": "I never said there’s any question about which is obviously worse, but Depp is no saint. She can be an absolute human dumpster, and yet his behavior remains problematic. Everyone has eaten up all the PR and thinks he never did anything wrong at all. It’s absurd.",
                                  "timestamp": "2022-06-02 16:35:22",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 122343,
                                  "replies": [
                                    {
                                      "id": "iaxgyyv",
                                      "text": "If literally anyone was involved in a trial and had to go thru “discovery” then had an opposing team of lawyers + the entire media trying to vilify them, yeah literally anyone can look bad, literally anyone.",
                                      "timestamp": "2022-06-02 16:37:46",
                                      "score": 1,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iazmj1v",
                  "text": "bro which subs you go to? all the normie and fem-oriented ones are having a fit, saying this will result on more women being abused, etc etc",
                  "timestamp": "2022-06-03 02:19:05",
                  "score": 1,
                  "num_children": 1,
                  "author": 400298,
                  "replies": [
                    {
                      "id": "iazrtxx",
                      "text": "Only really the front page subs and meme subs.\n\nObviously places like twoX will be against this because it undoubtedly will make every future domestic case (in the US) harder by creating a precedent.",
                      "timestamp": "2022-06-03 03:01:44",
                      "score": 1,
                      "num_children": 1,
                      "author": 311263,
                      "replies": [
                        {
                          "id": "iazs51k",
                          "text": "lmao it wont change shit unless you're a millionaire like depp and can afford that kind of legal defense",
                          "timestamp": "2022-06-03 03:04:12",
                          "score": 1,
                          "num_children": 1,
                          "author": 400298,
                          "replies": [
                            {
                              "id": "ib0jrol",
                              "text": "Previous cases can and are used to form precidents in civil cases. They were looking up cases from 50+ years during this case during the post court sessions.\n\nFrom what I’ve seen, the people who’ve dropped their domestic abuse claims are under the assumption now that the only evidence that will work is being able to physically record someone beating them.\n\n[Article about it](https://www.rollingstone.com/culture/culture-news/amber-heard-johnny-depp-verdict-metoo-trial-1361356/)\n\n[and another one](https://www.npr.org/2022/06/02/1102621479/the-depp-verdict-could-bring-a-chilling-effect-for-domestic-abuse-survivors)\n\nThere doesn’t need to be another barrier stopping people who’ve suffered domestic violence from getting justice.",
                              "timestamp": "2022-06-03 08:26:10",
                              "score": 2,
                              "num_children": 0,
                              "author": 311263,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "iawx3md",
              "text": "20 words or less please. I cant read good",
              "timestamp": "2022-06-02 14:13:27",
              "score": 3,
              "num_children": 1,
              "author": 31499,
              "replies": [
                {
                  "id": "iawztzy",
                  "text": "Pirate man bad, poo lady worse",
                  "timestamp": "2022-06-02 14:34:14",
                  "score": 12,
                  "num_children": 2,
                  "author": 145308,
                  "replies": [
                    {
                      "id": "iax0i3k",
                      "text": "This…is the best summary of the case I have seen. You’d be a natural for law school. 10/10, A+, would read again.",
                      "timestamp": "2022-06-02 14:39:15",
                      "score": 8,
                      "num_children": 0,
                      "author": 41717,
                      "replies": []
                    },
                    {
                      "id": "iax235o",
                      "text": "Under budget and ahead of schedule",
                      "timestamp": "2022-06-02 14:51:03",
                      "score": 5,
                      "num_children": 0,
                      "author": 31499,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iaxjpef",
              "text": "Great post, just wanted to note that the boiling frog thing has been dispelled. Yet I get the idea of it applies here. Sunken cost fallacy etc. But then in the way of sunken emotional cost.",
              "timestamp": "2022-06-02 16:56:47",
              "score": 1,
              "num_children": 1,
              "author": 41911,
              "replies": [
                {
                  "id": "iaxz50p",
                  "text": "Disproven in fact and science, yes. \n\nStill universally recognized as a metaphor…no :p\n\nBut I do take your point.",
                  "timestamp": "2022-06-02 18:44:49",
                  "score": 3,
                  "num_children": 0,
                  "author": 41717,
                  "replies": []
                }
              ]
            },
            {
              "id": "iaxc9y4",
              "text": "This shit was so well written i forgot I was on r/4chan",
              "timestamp": "2022-06-02 16:04:26",
              "score": 1,
              "num_children": 0,
              "author": 111762,
              "replies": []
            },
            {
              "id": "iaxmr9z",
              "text": "How much are you going to bill me for this comment",
              "timestamp": "2022-06-02 17:18:07",
              "score": 2,
              "num_children": 1,
              "author": 261911,
              "replies": [
                {
                  "id": "iaxzesp",
                  "text": "That’s the nice thing about public defense: I don’t charge you. That’s for civil litigators.",
                  "timestamp": "2022-06-02 18:46:47",
                  "score": 1,
                  "num_children": 0,
                  "author": 41717,
                  "replies": []
                }
              ]
            },
            {
              "id": "iaxo8ye",
              "text": "Hey thanks for posting this. I’ve been struggling with the outcome, and a male friend who has watched every second and 100% assumed Amber’s full of shit before even listening and like, I tried to watch it as unbiasedly as possible and it has become difficult to talk with him about it. So when it inevitably comes up, I’m just gonna refer him to your comment.",
              "timestamp": "2022-06-02 17:28:24",
              "score": 1,
              "num_children": 0,
              "author": 293114,
              "replies": []
            },
            {
              "id": "iayvyzh",
              "text": "Excellent reply, thank you for this.",
              "timestamp": "2022-06-02 22:46:43",
              "score": 1,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ib132hy",
              "text": "How many times after the initial \"abuse\" does one have to say theyre being put into pain and the perpetrators continue, for the \"abuse\" to become abuse?",
              "timestamp": "2022-06-03 12:35:26",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ib1f360",
                  "text": "That’s a finding of fact, that will vary from case to case and will be dependent on the totality of the circumstances. \n\nIt’s unfortunately also jurisdictional. Courts are going to be MUCH prompter to bring charges on something like this in a state like Vermont or in Canada than they are in a state like TX or LA. :/",
                  "timestamp": "2022-06-03 14:15:31",
                  "score": 1,
                  "num_children": 0,
                  "author": 41717,
                  "replies": []
                }
              ]
            },
            {
              "id": "iayeu24",
              "text": ">you shove past her to get in, and you accidentally shove a bit harder than you mean and she falls and gets a bruise\n\nMaybe don't do something that would result in your SO getting hurt and it won't be an issue. \n\nOr maybe...maybe not be such a fucking loser that you can't leave a toxic relationship because you feel you won't find another girl to get your dick wet.",
              "timestamp": "2022-06-02 20:38:19",
              "score": -2,
              "num_children": 0,
              "author": 316581,
              "replies": []
            },
            {
              "id": "iax6gj5",
              "text": "Shut up, nerd",
              "timestamp": "2022-06-02 15:22:45",
              "score": -1,
              "num_children": 0,
              "author": 195609,
              "replies": []
            }
          ]
        },
        {
          "id": "iawer6d",
          "text": "Don't worry, they'll find a way to weasel into another avenue of a man's life and try to bleed them for money like they've done for thousands of years. They will do anything to make money and not work unlike hard working check-earning people.",
          "timestamp": "2022-06-02 11:28:21",
          "score": 16,
          "num_children": 0,
          "author": 315268,
          "replies": []
        },
        {
          "id": "iawlth6",
          "text": "Equality",
          "timestamp": "2022-06-02 12:40:16",
          "score": 1,
          "num_children": 0,
          "author": 276803,
          "replies": []
        },
        {
          "id": "iawtvh3",
          "text": "My takeaway is that there are men and women in actual, real, abusive and dangerous relationships (this trial has shown that women can be super abusive). Often people that they tell don’t believe - men and women who make false abuse claims are absolute scum and make it that much worse for men and women who are actually being abused because it casts doubt on their credibility. \n\nLiars and manipulators have necessitated week long court trials to unravel their false allegations like a web of lies or cesspool of bullshit. It’s sad that it took all of this to clear his name - and that would be just as sad if it had come out that he was a piece of shit.\n\nHer commuting perjury to defend her outright lies is testimony to the scorched earth strategy false accusers will go through to “win.” Fuck her.\n\nI also hope this will discourage more false accusers from making it worse but I have no more faith in humanity.",
          "timestamp": "2022-06-02 13:48:03",
          "score": 1,
          "num_children": 0,
          "author": 28494,
          "replies": []
        },
        {
          "id": "iaxrmlj",
          "text": "[removed]",
          "timestamp": "2022-06-02 17:51:39",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "iaxrmn5",
              "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```cunts```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
              "timestamp": "2022-06-02 17:51:39",
              "score": 1,
              "num_children": 0,
              "author": 184140,
              "replies": []
            }
          ]
        },
        {
          "id": "iaxsn6v",
          "text": "They should be happy that there is accountability for false claims if they actually cared about the movement. It’s not like Weinstein or Cosby are winning lawsuits against their accusers despite Weinstein particularly being one of the most influential figures in Hollywood.",
          "timestamp": "2022-06-02 17:58:49",
          "score": 1,
          "num_children": 0,
          "author": 51483,
          "replies": []
        },
        {
          "id": "iay5bw1",
          "text": "[removed]",
          "timestamp": "2022-06-02 19:29:29",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "iay5by7",
              "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```bitch```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
              "timestamp": "2022-06-02 19:29:30",
              "score": 1,
              "num_children": 0,
              "author": 184140,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iaw0jyt",
      "text": "Amber did more for Men’s Rights than anyone else I can think of. Thanks, queen!",
      "timestamp": "2022-06-02 08:10:29",
      "score": 651,
      "num_children": 5,
      "author": 388845,
      "replies": [
        {
          "id": "iaw9nep",
          "text": "She went full code geass for all of us",
          "timestamp": "2022-06-02 10:26:26",
          "score": 69,
          "num_children": 1,
          "author": 142333,
          "replies": [
            {
              "id": "iawa1q7",
              "text": "LePussy of the Rebellion",
              "timestamp": "2022-06-02 10:31:45",
              "score": 49,
              "num_children": 1,
              "author": 24397,
              "replies": [
                {
                  "id": "iawaeb9",
                  "text": "The Pussy Requiem",
                  "timestamp": "2022-06-02 10:36:17",
                  "score": 21,
                  "num_children": 0,
                  "author": 142333,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iaw6etx",
          "text": "She took a huge shit on the MeToo movement, Yasssssss Queeeeeennn!!",
          "timestamp": "2022-06-02 09:40:37",
          "score": 251,
          "num_children": 2,
          "author": 107183,
          "replies": [
            {
              "id": "iaw84h9",
              "text": "you could say she shit the bed huh 😎",
              "timestamp": "2022-06-02 10:05:16",
              "score": 91,
              "num_children": 0,
              "author": 172930,
              "replies": []
            },
            {
              "id": "ic3hrt1",
              "text": "I do feel bad for the women of the me too movement beginnings who were legit just getting the courage to speak up about actual rape.\n\nThen it was hijacked by crazy attention whores and the term rape devolved into meaning \"the guy didn't pay for dinner\" or \"looked at me suggestively from across the room\", which completely diminished all of courage of their saner peers who were actually raped and just now speaking out.",
              "timestamp": "2022-06-12 15:31:54",
              "score": 5,
              "num_children": 0,
              "author": 105047,
              "replies": []
            }
          ]
        },
        {
          "id": "iaxhicn",
          "text": "The real hero is their relationship counselor who advised them to record these arguments to watch later and reflect on them. Without that recommendation I'm not sure the evidence that proved Depp right would even exist.",
          "timestamp": "2022-06-02 16:41:27",
          "score": 5,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iawofbg",
          "text": "What did she do for men rights?",
          "timestamp": "2022-06-02 13:03:05",
          "score": 10,
          "num_children": 2,
          "author": 164351,
          "replies": [
            {
              "id": "iawqoaq",
              "text": "Prove definitively that women can and do use their female privilege to falsely accuse men.",
              "timestamp": "2022-06-02 13:22:05",
              "score": 67,
              "num_children": 1,
              "author": 388845,
              "replies": [
                {
                  "id": "iaxhu0i",
                  "text": "Specifically that they think they can get away with it because nobody will believe a little ol' woman could intimidate a big strappin' man. That one quote is so bad:\n\n> Tell the world, Johnny, tell them, 'Johnny Depp, I, a man, I'm a victim too of domestic violence'. And see how many people believe or side with you.",
                  "timestamp": "2022-06-02 16:43:43",
                  "score": 24,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "iaybhh5",
              "text": "[deleted]",
              "timestamp": "2022-06-02 20:13:52",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "iaygg0n",
                  "text": "That's great for Johnny Depp's case but I don't see how her statement about him will help other men.",
                  "timestamp": "2022-06-02 20:50:08",
                  "score": 1,
                  "num_children": 0,
                  "author": 164351,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iawpbzo",
          "text": "i doubt it. Feminists will double down now and demand harsher laws against men and more support for women. It will only get worse as long as certain small hat people benefit from a broken society",
          "timestamp": "2022-06-02 13:10:50",
          "score": 21,
          "num_children": 3,
          "replies": [
            {
              "id": "iaxcrof",
              "text": "I’m pretty sure feminists will have their hands full with the overturning of Roe v Wade.  It’s not 2016 where top issues are representation in text based mental illness simulators",
              "timestamp": "2022-06-02 16:07:57",
              "score": 10,
              "num_children": 0,
              "author": 144113,
              "replies": []
            },
            {
              "id": "iax9j7r",
              "text": "Small hat? What, like Moroccan fezes?",
              "timestamp": "2022-06-02 15:44:48",
              "score": 3,
              "num_children": 1,
              "author": 358717,
              "replies": [
                {
                  "id": "iaxjpg1",
                  "text": "I think he was being a bit more racist than that...",
                  "timestamp": "2022-06-02 16:56:47",
                  "score": 2,
                  "num_children": 1,
                  "author": 145308,
                  "replies": [
                    {
                      "id": "iay7oa8",
                      "text": "😂😂😂😂😂😂",
                      "timestamp": "2022-06-02 19:46:27",
                      "score": -1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iaybl4f",
              "text": "We're chipping away at their power slowly. The contradictions in their ideology are piling up",
              "timestamp": "2022-06-02 20:14:37",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ibnsufc",
                  "text": "No, you are simply delusional morons who spend too much time listening to alt-right internet echo chambers.",
                  "timestamp": "2022-06-08 21:58:56",
                  "score": 0,
                  "num_children": 0,
                  "author": 192586,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iaw9uf6",
      "text": "Rolling Stone is so out of touch. From the article:\n\n\"millions of stans and even brands and celebrities have excoriated Heard and accused her of fabricating the allegations against Depp, causing hashtags like #AmberTurd...\"\n\nwhen I'm pretty sure that particular hashtag was caused by her actually shitting in the bed. \n\nBetween that and the Taylor Hawkins article that later was disreputed by the two famous drummers mentioned in it I just don't get what's going through their editors' heads.",
      "timestamp": "2022-06-02 10:29:03",
      "score": 23,
      "num_children": 2,
      "author": 224488,
      "replies": [
        {
          "id": "iawuc8q",
          "text": "They also published that article a few years ago where some woman claimed she was gang raped at a college party, which, surprise surprise, turned out to be wholly fabricated.",
          "timestamp": "2022-06-02 13:51:44",
          "score": 14,
          "num_children": 1,
          "author": 231220,
          "replies": [
            {
              "id": "iax7gae",
              "text": "Yeah the UVA story was fake. Just like the Duke Lacrosse story years before that",
              "timestamp": "2022-06-02 15:29:54",
              "score": 4,
              "num_children": 0,
              "author": 66556,
              "replies": []
            }
          ]
        },
        {
          "id": "iay1sld",
          "text": "What did they publish about Taylor? I know he passed recently but didn't hear anything about a rolling stones article",
          "timestamp": "2022-06-02 19:03:58",
          "score": 2,
          "num_children": 1,
          "author": 360478,
          "replies": [
            {
              "id": "iaza98b",
              "text": "Basically that his friends said that he had told them that he couldn't do it any more and was tired of it and that he and Dave had a heart to heart where they came to some kind of agreement but that it wasn't kept. But most of the info came from Matt Cameron (pearl jam drummer) and Chad Smith (rhcp drummer) who both came out publicly after the article came out saying that what they said was taken out of context and that they both didn't really think it was true.",
              "timestamp": "2022-06-03 00:42:06",
              "score": 3,
              "num_children": 0,
              "author": 224488,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iavxmd6",
      "text": "[deleted]",
      "timestamp": "2022-06-02 07:26:35",
      "score": 1096,
      "num_children": 6,
      "replies": [
        {
          "id": "iaw0c5t",
          "text": "Anon is a m*slim",
          "timestamp": "2022-06-02 08:07:02",
          "score": 357,
          "num_children": 5,
          "replies": [
            {
              "id": "iaw3mm7",
              "text": "Alhamdullilah habibi",
              "timestamp": "2022-06-02 08:58:12",
              "score": 146,
              "num_children": 0,
              "author": 122210,
              "replies": []
            },
            {
              "id": "iay95rc",
              "text": "Or from the UK, but this isn't football ig",
              "timestamp": "2022-06-02 19:57:03",
              "score": 3,
              "num_children": 0,
              "author": 100671,
              "replies": []
            },
            {
              "id": "iaw4qpt",
              "text": "Anon needs to take his schizophrenia meds.",
              "timestamp": "2022-06-02 09:15:15",
              "score": 22,
              "num_children": 0,
              "author": 388742,
              "replies": []
            },
            {
              "id": "iaw7ilk",
              "text": "rent free",
              "timestamp": "2022-06-02 09:56:55",
              "score": -4,
              "num_children": 2,
              "replies": [
                {
                  "id": "iawdr1g",
                  "text": "But not drone free lmao",
                  "timestamp": "2022-06-02 11:17:12",
                  "score": 25,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iawrol1",
                      "text": "jej",
                      "timestamp": "2022-06-02 13:30:24",
                      "score": 3,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iax5l48",
                  "text": "Average pedoworshipper",
                  "timestamp": "2022-06-02 15:16:40",
                  "score": 3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iaxa8ij",
                      "text": "Says the p*gan who donates to pedos on the regular",
                      "timestamp": "2022-06-02 15:49:52",
                      "score": 0,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iaws49p",
              "text": "Are you saying M*slims beat their women like American teenage boys beat their dicks?",
              "timestamp": "2022-06-02 13:34:02",
              "score": 0,
              "num_children": 1,
              "author": 21111,
              "replies": [
                {
                  "id": "iaymwpm",
                  "text": "Nah they need stones and belts and whips. Muslims use their backhand.",
                  "timestamp": "2022-06-02 21:38:31",
                  "score": 2,
                  "num_children": 0,
                  "author": 199548,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iaw5r18",
          "text": "Domestic abuse is back on the menu boys",
          "timestamp": "2022-06-02 09:30:36",
          "score": 89,
          "num_children": 0,
          "author": 306738,
          "replies": []
        },
        {
          "id": "iaw81yu",
          "text": "You shouldn’t hit your sister.",
          "timestamp": "2022-06-02 10:04:20",
          "score": 43,
          "num_children": 0,
          "author": 233539,
          "replies": []
        },
        {
          "id": "iawbu69",
          "text": "Fake. Like anyone on this site has a wife",
          "timestamp": "2022-06-02 10:54:26",
          "score": 23,
          "num_children": 0,
          "author": 230265,
          "replies": []
        },
        {
          "id": "iay5z1o",
          "text": "I'm going to celebrate by beating your wife every night.",
          "timestamp": "2022-06-02 19:34:11",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iayktyl",
          "text": "Based",
          "timestamp": "2022-06-02 21:23:02",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iavz8nq",
      "text": "women realize that lying to ruin someone’s life doesn’t work every time",
      "timestamp": "2022-06-02 07:50:34",
      "score": 451,
      "num_children": 2,
      "replies": [
        {
          "id": "iawwu13",
          "text": "It works enough, they'll be fine 👍",
          "timestamp": "2022-06-02 14:11:21",
          "score": 88,
          "num_children": 1,
          "replies": [
            {
              "id": "iax5kqn",
              "text": "That’s a fucking scary, yet true statement.",
              "timestamp": "2022-06-02 15:16:36",
              "score": 39,
              "num_children": 0,
              "author": 126225,
              "replies": []
            }
          ]
        },
        {
          "id": "iawygar",
          "text": "And that is unfair",
          "timestamp": "2022-06-02 14:23:42",
          "score": 9,
          "num_children": 0,
          "author": 15289,
          "replies": []
        }
      ]
    },
    {
      "id": "iaw22yc",
      "text": "Always love the latest hot take from the most honest and morally correct journalist, Taylor Lorenz.",
      "timestamp": "2022-06-02 08:34:08",
      "score": 118,
      "num_children": 1,
      "author": 217399,
      "replies": [
        {
          "id": "iaw90jl",
          "text": "Took me a minute to remember who she is. She’s the one who doxxed Libsoftiktok, right?",
          "timestamp": "2022-06-02 10:17:55",
          "score": 56,
          "num_children": 1,
          "author": 109733,
          "replies": [
            {
              "id": "iawbm18",
              "text": "Based",
              "timestamp": "2022-06-02 10:51:36",
              "score": -9,
              "num_children": 0,
              "author": 304958,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iaw5jz6",
      "text": "Taylor Lorenz makes women look awful.\n\nJoke of a “journalist.”",
      "timestamp": "2022-06-02 09:27:35",
      "score": 43,
      "num_children": 1,
      "author": 316209,
      "replies": [
        {
          "id": "iawyzqp",
          "text": "Isn't she the one who doxxed the twitter user LibsOfTikTok by showing up to their parents ' house and asking them questions?",
          "timestamp": "2022-06-02 14:27:50",
          "score": 4,
          "num_children": 2,
          "author": 135677,
          "replies": [
            {
              "id": "iazrzwd",
              "text": "Yes.",
              "timestamp": "2022-06-03 03:03:03",
              "score": 2,
              "num_children": 0,
              "author": 316209,
              "replies": []
            },
            {
              "id": "iaymn5k",
              "text": "[removed]",
              "timestamp": "2022-06-02 21:36:30",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "iaymn79",
                  "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```bitch```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
                  "timestamp": "2022-06-02 21:36:30",
                  "score": 1,
                  "num_children": 0,
                  "author": 184140,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iawbv7l",
      "text": "They’re going to fact check and investigate my claims? Fuck that.",
      "timestamp": "2022-06-02 10:54:48",
      "score": 10,
      "num_children": 0,
      "author": 169007,
      "replies": []
    },
    {
      "id": "iaxofc9",
      "text": "Isn't \"men\" a social construct? They spew all this trans stuff and then differentiate men and women when it benefits them",
      "timestamp": "2022-06-02 17:29:37",
      "score": 10,
      "num_children": 1,
      "author": 134977,
      "replies": [
        {
          "id": "iayo1ns",
          "text": "Stop noticing things",
          "timestamp": "2022-06-02 21:47:05",
          "score": 8,
          "num_children": 0,
          "author": 299395,
          "replies": []
        }
      ]
    },
    {
      "id": "iaw3q7w",
      "text": "A victory for bed and sheats all over the world !",
      "timestamp": "2022-06-02 08:59:47",
      "score": 24,
      "num_children": 1,
      "author": 179455,
      "replies": [
        {
          "id": "ib4lpq4",
          "text": "Mega based",
          "timestamp": "2022-06-04 08:04:55",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iawekcn",
      "text": "So now they fear that they may not be able to get away with fake accusations and retract their claims? Good.\n\nThough I wonder how many will think if a man with resources & influence of Depp needed 6 years to get justice, how much more difficult it will be for an average guy?",
      "timestamp": "2022-06-02 11:26:17",
      "score": 23,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iawdenq",
      "text": "We would be upset too if the gravy trained was suddenly derailed.",
      "timestamp": "2022-06-02 11:13:10",
      "score": 6,
      "num_children": 0,
      "author": 193023,
      "replies": []
    },
    {
      "id": "iavwyb4",
      "text": "if it were true, it would be even more hilarious that this bedshitter whore lost",
      "timestamp": "2022-06-02 07:17:08",
      "score": 87,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaw3tuw",
      "text": "inb4 feminists claim that what Turd did to Depp is incomparable to billions of years of patriarchical oppression men have imposed upon women and hence we should still #BelieveAllWomen and they can't ever be at fault.",
      "timestamp": "2022-06-02 09:01:15",
      "score": 177,
      "num_children": 5,
      "author": 122210,
      "replies": [
        {
          "id": "iaw8d45",
          "text": "> \\> billions of years\n\nBased and patriarchy-since-the-big-bang pilled.",
          "timestamp": "2022-06-02 10:08:41",
          "score": 141,
          "num_children": 3,
          "replies": [
            {
              "id": "iax4kkr",
              "text": "God created the universe.\n\nGod knocked up some teen chick.\n\nGod is the *Father* and the *Son*.\n\nThe whole universe is a patriarchy, the feminists never stood a chance.",
              "timestamp": "2022-06-02 15:09:20",
              "score": 29,
              "num_children": 1,
              "replies": [
                {
                  "id": "iaynnyj",
                  "text": ">Meanwhile \"mother earth\" is dying.\n\nWe keep on winning. YES.",
                  "timestamp": "2022-06-02 21:44:14",
                  "score": 3,
                  "num_children": 0,
                  "author": 199548,
                  "replies": []
                }
              ]
            },
            {
              "id": "iax55yc",
              "text": "The big bang was misogynistic. We should cancel it.",
              "timestamp": "2022-06-02 15:13:37",
              "score": 3,
              "num_children": 0,
              "author": 152904,
              "replies": []
            },
            {
              "id": "iax4c6b",
              "text": "[removed]",
              "timestamp": "2022-06-02 15:07:38",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "iax4c7e",
                  "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```bitch```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
                  "timestamp": "2022-06-02 15:07:38",
                  "score": 1,
                  "num_children": 0,
                  "author": 184140,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iawa4ym",
          "text": "This is actually a big win for feminism because it affirms the fact that women have power and agency. The idea that a woman can't be guilty of abuse is deeply misogynistic  and basically reduces women to perpetual victims.",
          "timestamp": "2022-06-02 10:32:56",
          "score": 85,
          "num_children": 5,
          "author": 98757,
          "replies": [
            {
              "id": "iax4e8s",
              "text": "Try telling twitter that. The hot takes on there with hundreds of thousands of likes about the case are baffling.",
              "timestamp": "2022-06-02 15:08:04",
              "score": 7,
              "num_children": 0,
              "author": 99745,
              "replies": []
            },
            {
              "id": "iawdtdp",
              "text": "Being reduced to a perpetual victim is the goal of feminism. In our bizarro world, being a victim is actually empowering.",
              "timestamp": "2022-06-02 11:17:58",
              "score": 60,
              "num_children": 3,
              "author": 260735,
              "replies": [
                {
                  "id": "iay1n2q",
                  "text": "Guess only 3rd and 4th wave feminism count as the old guard have loong since been cancelled over their disdain for troons invading women spaces.",
                  "timestamp": "2022-06-02 19:02:51",
                  "score": 6,
                  "num_children": 1,
                  "author": 321981,
                  "replies": [
                    {
                      "id": "iay3gty",
                      "text": "I like JK Rowling’s new term “the penised”.",
                      "timestamp": "2022-06-02 19:16:06",
                      "score": 5,
                      "num_children": 0,
                      "author": 260735,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iaxy3si",
                  "text": "The best is when people fabricate their own victimhood, or blow things out of proportion just to get the elusive title of 'victim'.",
                  "timestamp": "2022-06-02 18:37:41",
                  "score": 7,
                  "num_children": 1,
                  "author": 94545,
                  "replies": [
                    {
                      "id": "iaxypn6",
                      "text": "“This is MAGA country”",
                      "timestamp": "2022-06-02 18:41:50",
                      "score": 1,
                      "num_children": 0,
                      "author": 260735,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iax9mbr",
                  "text": ">Being reduced to a perpetual victim is the goal of feminism\n\nlmfao, guess I shouldn't expect any different from this sub",
                  "timestamp": "2022-06-02 15:45:26",
                  "score": -9,
                  "num_children": 3,
                  "replies": [
                    {
                      "id": "iaxeprl",
                      "text": "Show me a single time the feminist movement has shown they have achieved greater equality and sought to rebalance the need for affirmative action and programs targeted at women. There are more women programs than ever before, and there is certainly no sign of slowing. They exist to prove they are victims, and thus increase resources. More women attend college than men, yet they still have exclusive access to more than 92% of scholarship money.",
                      "timestamp": "2022-06-02 16:21:43",
                      "score": 11,
                      "num_children": 1,
                      "author": 260735,
                      "replies": [
                        {
                          "id": "iaye89i",
                          "text": ">yet they still have exclusive access to more than 92% of scholarship money.\n\nIs this about gender-specific scholarships?",
                          "timestamp": "2022-06-02 20:33:53",
                          "score": 2,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iaye4vk",
                      "text": "You should probably do more research dip shit. They're bullshit propaganda on DV, history, men's issues and their blank slatism has infected so much of media, academia, the judicial system, law, policies, NGOs, counselling etc.\n\nAs much as humanly possible, they dedicate all their attention to how women are oppressed by the patriarchy and how men who have problems have them because of their toxic masculinity.",
                      "timestamp": "2022-06-02 20:33:13",
                      "score": 3,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ib18umo",
                          "text": "Ah yes, \"just do more research\" and I'll be here with cheeto-dusted fingers seething like the rest of you... lmfao",
                          "timestamp": "2022-06-03 13:26:17",
                          "score": 0,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iay2ptc",
                      "text": "These dudes are unironically r-worded.",
                      "timestamp": "2022-06-02 19:10:40",
                      "score": 0,
                      "num_children": 0,
                      "author": 107061,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iawcbp0",
              "text": "it also means taking responsibility and  believing in things like actions have consequences which is a big no-no for them",
              "timestamp": "2022-06-02 11:00:26",
              "score": 27,
              "num_children": 0,
              "author": 122210,
              "replies": []
            },
            {
              "id": "iawcecb",
              "text": "4chan doesn't care about nuance my man.  Women bad.",
              "timestamp": "2022-06-02 11:01:15",
              "score": -1,
              "num_children": 1,
              "author": 292066,
              "replies": [
                {
                  "id": "iawifsp",
                  "text": "Cope.",
                  "timestamp": "2022-06-02 12:07:16",
                  "score": 8,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "iaykqix",
              "text": "You gonna tell that to all the high standing feminist trying to slander the court’s decision?",
              "timestamp": "2022-06-02 21:22:19",
              "score": 1,
              "num_children": 0,
              "author": 177039,
              "replies": []
            }
          ]
        },
        {
          "id": "iaw9o2n",
          "text": "Oh they've skipped that: He's still guilty of everything she accused him of, and the jury, the legal system, and everything else is just wrong, Herd's own words don't matter, the testimony of dozens of witnesses is all false, and we have to double down on all the feminist rhetoric from here on out.",
          "timestamp": "2022-06-02 10:26:41",
          "score": 17,
          "num_children": 1,
          "replies": [
            {
              "id": "iaxh6hu",
              "text": "Bro feminists are literally pro-Depp and anti-Heard, don't fall for incel ragebait telling you otherwise.",
              "timestamp": "2022-06-02 16:39:14",
              "score": 0,
              "num_children": 0,
              "author": 349316,
              "replies": []
            }
          ]
        },
        {
          "id": "iaxzn3x",
          "text": "that's literally what the article is saying lol",
          "timestamp": "2022-06-02 18:48:26",
          "score": 1,
          "num_children": 0,
          "author": 356045,
          "replies": []
        },
        {
          "id": "iax0cgh",
          "text": "Some fucked up women using feminism*\n\nYou can similarly apply nuance to men's rights groups.",
          "timestamp": "2022-06-02 14:38:03",
          "score": -4,
          "num_children": 1,
          "author": 100710,
          "replies": [
            {
              "id": "iax53zu",
              "text": "I would prefer not to",
              "timestamp": "2022-06-02 15:13:15",
              "score": 1,
              "num_children": 1,
              "author": 122210,
              "replies": [
                {
                  "id": "iax5yok",
                  "text": "Why?",
                  "timestamp": "2022-06-02 15:19:17",
                  "score": 0,
                  "num_children": 0,
                  "author": 100710,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iawoj5q",
      "text": "In the comment sections of every story I read about this trial, almost every women who was a victim of abuse \\*who watched the trial\\* was disgusted by Amber Heard and was glad she was taken down.\n\nIt astonished me to see the New York Times continue with the narrative that Amber Heard was the victim, despite the trial showing she was an abuser.\n\nIt’s this disconnect between the narrative and reality that is going to negatively affect victims of abuse.",
      "timestamp": "2022-06-02 13:03:59",
      "score": 6,
      "num_children": 0,
      "author": 219873,
      "replies": []
    },
    {
      "id": "iaxphjm",
      "text": "I really looked up to Johnny at first, then I found out he didn't beat the shit out of Amber Heard on a regular basis, but he's still alright.",
      "timestamp": "2022-06-02 17:36:51",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaw93yl",
      "text": "\"Man always win\"\n\nYou've got to be delusional to think this. Men usually lose legal cases.",
      "timestamp": "2022-06-02 10:19:16",
      "score": 54,
      "num_children": 1,
      "author": 67868,
      "replies": [
        {
          "id": "iazwdvd",
          "text": "This is like saying... erm, African Americans usually lose cases. They're much more likely to be genuinely guilty.",
          "timestamp": "2022-06-03 03:39:17",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "ib0mcjv",
              "text": "For custody rights? Lmao",
              "timestamp": "2022-06-03 09:06:33",
              "score": 1,
              "num_children": 1,
              "author": 67868,
              "replies": [
                {
                  "id": "ib296bm",
                  "text": "If men got pregnant, they'd get the baby every single time. Women are slightly more likely to get the children she have birth to because men often don't show up to court. There's no bias.",
                  "timestamp": "2022-06-03 17:52:43",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ib2f64j",
                      "text": "It takes two to tangle so your first argument is invalid, especially in the court of law. That right there was just your opinion. \n\nAs for your second argument, I'm talking about when both are present fighting for custody. Neither parent needs to show up if the child is a teenager. I know from experience because my niece's mother was manipulative and psychotic.",
                      "timestamp": "2022-06-03 18:39:05",
                      "score": 1,
                      "num_children": 1,
                      "author": 67868,
                      "replies": [
                        {
                          "id": "ib2g05q",
                          "text": "Men don't get pregnant.\n\nWhen both parents are fighting for custody, the father is more likely to get the children. We rip away children a mother made with her own body because a man's word is worth more than a woman's. It's insane that fathers ever get the children unless the mother is really horrible. If men got pregnant this wouldn't even be a question. Men are significantly less likely to be stay at home dads, and since children need a parent at home, it's even more ridiculous that fathers are usually getting the children.",
                          "timestamp": "2022-06-03 18:45:32",
                          "score": 0,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ib2g8ny",
                              "text": "That explains all the motherless children. /sarcasm.",
                              "timestamp": "2022-06-03 18:47:22",
                              "score": 3,
                              "num_children": 1,
                              "author": 67868,
                              "replies": [
                                {
                                  "id": "ib2h2d9",
                                  "text": "There are a lot of motherless children. Men win the children 35% of the time, which is so close to half you wonder what all these anti-women political hacks are even complaining about. With the way they talk, you'd think it was 5%. \n\nMen are likely to get the children, even though they are much less likely to even ask for the children. And they were not the ones pregnant. We need to stop this extreme bias towards men in family courts.",
                                  "timestamp": "2022-06-03 18:53:48",
                                  "score": 1,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iaw46ra",
      "text": "Imagine trying to play defense for a domestic abuser because she's female. What a bunch of scumbags. I cannot imagine supporting someone abusing someone else because tits.",
      "timestamp": "2022-06-02 09:06:30",
      "score": 69,
      "num_children": 0,
      "author": 273567,
      "replies": []
    },
    {
      "id": "iawccr9",
      "text": "\"millions\" have guzzled \"hundreds\" of \"thousands\" of gallons of litres of jizz as a result of watching the trial.",
      "timestamp": "2022-06-02 11:00:44",
      "score": 6,
      "num_children": 0,
      "author": 277855,
      "replies": []
    },
    {
      "id": "iawkju6",
      "text": "If anything, this case if a win for all *actual* abuse victims. Fuck her. This is not a \"loss for women\" or a \"win for men\". This is a loss for fucking liars. Fuck yeah.",
      "timestamp": "2022-06-02 12:28:07",
      "score": 5,
      "num_children": 1,
      "author": 207483,
      "replies": [
        {
          "id": "ib4m1jp",
          "text": "Mega based. Godspeed",
          "timestamp": "2022-06-04 08:10:36",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iawohca",
      "text": "Oh fuck off, the moral of this story is don’t be a lying cunt cause you are destroying any chance for women who are truly abused or getting justice. That said this trial has also highlighted the fact that men(to a lesser extent) are also subject to abuse",
      "timestamp": "2022-06-02 13:03:34",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iawvrvd",
      "text": "Taylor Lorenz always has the worst takes.",
      "timestamp": "2022-06-02 14:03:09",
      "score": 4,
      "num_children": 0,
      "author": 123854,
      "replies": []
    },
    {
      "id": "iawbyl5",
      "text": "Hundred of *false* domestic violence “survivors” have already retracted *false* victim statements and pulled out from court cases as a result of *watching a liar lose in court*.\n\nThere ya go, fixed it.",
      "timestamp": "2022-06-02 10:55:57",
      "score": 25,
      "num_children": 1,
      "author": 409354,
      "replies": [
        {
          "id": "iaxyrg9",
          "text": "I love it, they don't see 'a victim who was abused won' and see it as empowering, they see 'a liar lost a court case' and pull out. Very telling.",
          "timestamp": "2022-06-02 18:42:11",
          "score": 4,
          "num_children": 0,
          "author": 94545,
          "replies": []
        }
      ]
    },
    {
      "id": "iaw53z2",
      "text": "That’s a relief, I’ve been so afraid of being metoo’d I haven’t left my house in 3 years",
      "timestamp": "2022-06-02 09:20:50",
      "score": 52,
      "num_children": 2,
      "replies": [
        {
          "id": "iaw76px",
          "text": "Yet you existed in the same universe with women which makes you a filthy rapist. You could be serving women those 3 years, you're selfish.",
          "timestamp": "2022-06-02 09:52:02",
          "score": 60,
          "num_children": 1,
          "author": 5104,
          "replies": [
            {
              "id": "iaw7h5e",
              "text": "It’s over when you’re a kissless virgin and a rapist",
              "timestamp": "2022-06-02 09:56:21",
              "score": 33,
              "num_children": 2,
              "replies": [
                {
                  "id": "iaw7roc",
                  "text": "Im just living to see when thoughtcrime will become a thing",
                  "timestamp": "2022-06-02 10:00:35",
                  "score": 18,
                  "num_children": 1,
                  "author": 5104,
                  "replies": [
                    {
                      "id": "iax3hhq",
                      "text": "What do you mean \"will become\"? It's already a thing.",
                      "timestamp": "2022-06-02 15:01:22",
                      "score": 5,
                      "num_children": 0,
                      "author": 387573,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iax04n6",
                  "text": "Eye rape is a serious crime",
                  "timestamp": "2022-06-02 14:36:24",
                  "score": 3,
                  "num_children": 0,
                  "author": 100710,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iayxbts",
          "text": "That's a lie and you know it, you don't go outside because you don't want to.",
          "timestamp": "2022-06-02 22:57:11",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "iayxiav",
              "text": "That is true but the fear of being metoo’d also keeps me inside",
              "timestamp": "2022-06-02 22:58:35",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iavyoox",
      "text": "All the normie women I know/the common consensus we’re all supporting Johny surprisingly. I guess all the feminists grew up and got to the age where they realise they hate other women more than men.",
      "timestamp": "2022-06-02 07:42:18",
      "score": 236,
      "num_children": 11,
      "author": 251015,
      "replies": [
        {
          "id": "iaw1o0f",
          "text": "She \"needed\" his mansions and yachts and Hollywood connections for her career for several years, then it was over, and [she couldn't resist](https://i.gifer.com/dnO.mp4) throwing a live grenade at his life on her way out the door - because why not if there are no consequences?",
          "timestamp": "2022-06-02 08:27:38",
          "score": 186,
          "num_children": 1,
          "author": 73494,
          "replies": [
            {
              "id": "iawi7np",
              "text": "A brown grenade",
              "timestamp": "2022-06-02 12:04:59",
              "score": 43,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "iawokub",
          "text": "> All the normie women I know/the common consensus we’re all supporting Johny surprisingly.\n\nSame.  It was really weird watching my mother, who refuses to watch HBO's Rome because \"it's too sexist\", who complains about decades of sexism she experienced from men growing up in the 20th century, cheering on Depp and scolding \"that evil witch\" Heard when they read the verdict.",
          "timestamp": "2022-06-02 13:04:23",
          "score": 17,
          "num_children": 1,
          "author": 310893,
          "replies": [
            {
              "id": "iax71il",
              "text": "Plus when they showed Depp's \"fans\" congregated inside/outside the courthouse they were always overwhelmingly women. It's really not accurate for anyone to suggest that all, or even most, women support or identify with Heard",
              "timestamp": "2022-06-02 15:26:55",
              "score": 4,
              "num_children": 1,
              "author": 66556,
              "replies": [
                {
                  "id": "iaymf0r",
                  "text": "The people who are fanatic about this case on both sides seem to be mostly women.\n\n>He disliked nearly all women, and especially the young and pretty ones. It was always the women, and above all the young ones, who were the most bigoted adherents of the Party, the swallowers of slogans, the amateur spies and nosers−out of unorthodoxy.",
                  "timestamp": "2022-06-02 21:34:50",
                  "score": 3,
                  "num_children": 1,
                  "author": 227831,
                  "replies": [
                    {
                      "id": "iaz3ny8",
                      "text": "Literally 1984",
                      "timestamp": "2022-06-02 23:47:53",
                      "score": 1,
                      "num_children": 0,
                      "author": 66556,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iaxgyyw",
          "text": "Or maybe they can actually tell the difference between feminism and ragebait fake feminism propagated by misogynists (i.e. satire headlines such as \"woman sues her lifesaver for sexual assault after CPR\").",
          "timestamp": "2022-06-02 16:37:46",
          "score": 3,
          "num_children": 0,
          "author": 349316,
          "replies": []
        },
        {
          "id": "iawccpg",
          "text": "Gosh I just wish people would understand that you can hate Amber Heard and still be a fucking feminist.",
          "timestamp": "2022-06-02 11:00:43",
          "score": 73,
          "num_children": 7,
          "author": 292066,
          "replies": [
            {
              "id": "iawdzff",
              "text": "Feminism is just another buzzword for some people that means “men are from Jupiter to get more stupider”. I don’t know anybody personally, man or woman, who defended Heard through this once the facts became clear and that includes self-described feminists. I think public opinion largely fits this as well, seeing the responses online and to their post-court letters.",
              "timestamp": "2022-06-02 11:19:55",
              "score": 58,
              "num_children": 2,
              "author": 355986,
              "replies": [
                {
                  "id": "iawwx3j",
                  "text": "Amongst the women I know the by far most common opinion I've encountered has been along the lines of: \"I know you're supposed to support women, but I felt a little bad for him\".\n\nIt's not so much defending Heard as it is pushing for female-centric interests in society. Which is one of the basic tenets of philosophical feminism, so I think it's perfectly consistent.",
                  "timestamp": "2022-06-02 14:12:02",
                  "score": 21,
                  "num_children": 0,
                  "author": 279901,
                  "replies": []
                },
                {
                  "id": "iawoxg7",
                  "text": "no joke, in Canada our tax funded National \"Canadian Broadcasting Corporation\" aka CBC, is taking a hard position on \"memes made a mockery of DV issue / has real influence\".\n\nwasn't even a DV case; was a case about defamation; which if \"proven\" implicitly means the DV claimed was false.\n\nAmber Heard has NEVER sued JD for abuse, nor has she or police filed charges of DV on JD. there is literally no physical evidence of physical abuse.\n\nbasically saying peeps \"online\" (whatever that means) are mocking someone speaking out about being a victim of domestic violence.\n\nAs someone who watched way too much of the trial; that is such horseshit. It's peeps mocking a VERY narcissistic person with HPD (all but diagnosed) clearly lie (supported via evidence, overwhelmingly).\n\nimo this is a HUGE win; highlighting personality types / disorders that are inclined to take advantage of bias; such as men are always the perpetrator of DV.",
                  "timestamp": "2022-06-02 13:07:22",
                  "score": 42,
                  "num_children": 0,
                  "author": 3701,
                  "replies": []
                }
              ]
            },
            {
              "id": "iawq65t",
              "text": "This is my biggest fucking issue with this whole case. What a great opportunity for us to finally have discussion about male victims of abuse and men's mental health! But no, let's take this time to bash women and call all of them liars, that will definitely make more people sympathetic to men in crisis. Every woman I know who identifies as a feminist has been supportive of male victims of abuse and advocated for men's mental health, and they were doing so long before this case came around.",
              "timestamp": "2022-06-02 13:17:56",
              "score": 27,
              "num_children": 0,
              "author": 385227,
              "replies": []
            },
            {
              "id": "iaxicqk",
              "text": "That's just the social political posturing angle. There were gonna be the crazy extremist feminists who literally think #BelieveAllWomen, and even though all the evidence says Heard was the aggressor they're still hanging onto \"you can't discount her lived experience\" bullshit.",
              "timestamp": "2022-06-02 16:47:23",
              "score": 2,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "iawe34c",
              "text": "You can think amber heard lied and still understand that 95% of abuse/rape allegations are true. There is a far bigger problem with these things being pushed under the rug than fabricated.",
              "timestamp": "2022-06-02 11:20:59",
              "score": 9,
              "num_children": 2,
              "author": 379387,
              "replies": [
                {
                  "id": "iawjej8",
                  "text": ">it's just this one time, every time\n\nAnd when Pamber Pheard accuses Bonny Blepp of DV and SA tomorrow, you would #believeallwomen, I'd bet.",
                  "timestamp": "2022-06-02 12:17:08",
                  "score": 20,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iawk5o2",
                      "text": "False accusations happen. But they are not the majority. My wife is a former divorce attorney, I am a former public defender. We both have experience dealing with both real and fabricated domestic violence/sexual assault. Yes, I have defended men wrongfully accused of domestic violence/rape. One was particularly awful. But we have both seen significantly more cases where we believed the accusations but knew it wouldn’t stick.",
                      "timestamp": "2022-06-02 12:24:18",
                      "score": -4,
                      "num_children": 2,
                      "author": 379387,
                      "replies": [
                        {
                          "id": "iawlwkf",
                          "text": "How are muh statistics relevant if you're going to be verifying claims either way, then? Just fear porn and a whip for browbeating people?",
                          "timestamp": "2022-06-02 12:40:59",
                          "score": 12,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "iaxb2sh",
                              "text": "How are you going to dispute genuine bona fide anecdata from a real life IRL lawyer",
                              "timestamp": "2022-06-02 15:55:49",
                              "score": -1,
                              "num_children": 0,
                              "author": 13162,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "iaz1gy9",
                          "text": "That's just bad statistical reasoning.",
                          "timestamp": "2022-06-02 23:29:57",
                          "score": 2,
                          "num_children": 0,
                          "author": 13162,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iazw3dp",
                  "text": "It's way more than 95% for rape. I'm not sure about abuse. Lying about rape is so insanely rare it's like it practically doesn't happen. Recounting your rape in court is such a traumatizing and humiliating experience that a lot of victims give up. This is used as ammunition to say they \"lied.\"",
                  "timestamp": "2022-06-03 03:36:42",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "iawiatt",
              "text": "> still be a fucking feminist\n\nBut…why? Also lol at feminists always have to try and assert their aggression by cussing as if that’s still edgy.",
              "timestamp": "2022-06-02 12:05:52",
              "score": 8,
              "num_children": 3,
              "replies": [
                {
                  "id": "iawyvkc",
                  "text": "Dude I just care about equal rights. Mens rights are part of that.",
                  "timestamp": "2022-06-02 14:26:57",
                  "score": 4,
                  "num_children": 2,
                  "author": 292066,
                  "replies": [
                    {
                      "id": "iaxp7wa",
                      "text": "Then use a different label lmbo (laughing my balls off)",
                      "timestamp": "2022-06-02 17:35:04",
                      "score": 1,
                      "num_children": 0,
                      "author": 309793,
                      "replies": []
                    },
                    {
                      "id": "iayhvx6",
                      "text": "Change the name then. This one is tainted.",
                      "timestamp": "2022-06-02 21:00:54",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iawn4i1",
                  "text": "[deleted]",
                  "timestamp": "2022-06-02 12:51:48",
                  "score": 0,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "iawpwzy",
                      "text": "> here let me play the word definitions game\n\nNo.",
                      "timestamp": "2022-06-02 13:15:45",
                      "score": 13,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iawqiwa",
                          "text": "[deleted]",
                          "timestamp": "2022-06-02 13:20:51",
                          "score": -5,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "iawwj8n",
                              "text": "> dude just read the biased definition by a dictionary company that changes definitions to win political arguments\n\nWaste of my time. Cope and seethe.",
                              "timestamp": "2022-06-02 14:09:03",
                              "score": 9,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iawygin",
                                  "text": "[deleted]",
                                  "timestamp": "2022-06-02 14:23:44",
                                  "score": -7,
                                  "num_children": 2,
                                  "replies": [
                                    {
                                      "id": "iaxhup3",
                                      "text": "Only an r-slur would think feminism has nothing to do with politics. It’s literally just socialism with panties",
                                      "timestamp": "2022-06-02 16:43:51",
                                      "score": 3,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "iaxmhbp",
                                          "text": "[deleted]",
                                          "timestamp": "2022-06-02 17:16:10",
                                          "score": 0,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "iayec3u",
                                              "text": "> seething",
                                              "timestamp": "2022-06-02 20:34:39",
                                              "score": 0,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "iaygqr6",
                                                  "text": "[deleted]",
                                                  "timestamp": "2022-06-02 20:52:22",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "iayhshm",
                                                      "text": "> seething",
                                                      "timestamp": "2022-06-02 21:00:12",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "iax6p7v",
                                      "text": "Yeah and Christianity is supposed to be about radically helping the poor. Yet most US Christians don't seem to actually behave that way.\n\nFeminism is supposed to be about gender equality, but that doesn't prevent tons of supposed \"feminists\" from acting in ways that are blatantly contrary to that.\n\nThere's no test to be a feminist, anyone can identify as one. Even if they have deeply prejudicial views on gender and don't actually want equality and liberation",
                                      "timestamp": "2022-06-02 15:24:28",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 66556,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iax7r0s",
                      "text": "To want equality specifically for women.\n\nPro tip feminism has nothing to do with improving areas where men are disadvantaged towards women and as such is not for all forms of equality.",
                      "timestamp": "2022-06-02 15:32:04",
                      "score": 4,
                      "num_children": 1,
                      "author": 368,
                      "replies": [
                        {
                          "id": "iaxco2c",
                          "text": "Actually it does but you're too tilted to realise it.\n\nThings feminists talk ablut such as toxic masculinity have negative impacts on men themselves, the idea men are stronger and less emotional factors into them getting higher sentancing and the general lack of empathy towards men.\n\nIt's all connected. Just treat people nice for god's sake. We are all human.",
                          "timestamp": "2022-06-02 16:07:14",
                          "score": -5,
                          "num_children": 4,
                          "author": 292066,
                          "replies": [
                            {
                              "id": "iaxuygn",
                              "text": "Sorry they wanted the definition only. Feel free to share the source of your definition that doesn't say women only. The meaning of feminism has nothing to do with men. You can try to claim it is whatever your personal brand of feminism is, but that just leads to you claiming no true Scotsman any time another feminist screams kill all men.\n\nI don't find any group that will judge people based on a physical characteristics to be a group I want anything to do with, and the treatment by most feminists towards men is abhorrent.",
                              "timestamp": "2022-06-02 18:15:16",
                              "score": 3,
                              "num_children": 0,
                              "author": 368,
                              "replies": []
                            },
                            {
                              "id": "iayhzin",
                              "text": "I don’t hear them talk about toxic femininity. Again, it’s pure distilled bias.",
                              "timestamp": "2022-06-02 21:01:39",
                              "score": 3,
                              "num_children": 0,
                              "replies": []
                            },
                            {
                              "id": "iaykema",
                              "text": "Feminism is an advocacy group for women, by women they couldn’t give less of a fuck about men’s issues, the only time you will see a feminist mention men’s issues is if solving them ends up helping women in the end. They have no problem making men’s issues worst as long as it can benefits the tiniest amount of women, and that’s only when they don’t actively go out of their way to make men’s life worse.",
                              "timestamp": "2022-06-02 21:19:53",
                              "score": 2,
                              "num_children": 0,
                              "author": 177039,
                              "replies": []
                            },
                            {
                              "id": "iaykbqa",
                              "text": "[removed]",
                              "timestamp": "2022-06-02 21:19:17",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iaykbs3",
                                  "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```cunts```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
                                  "timestamp": "2022-06-02 21:19:17",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 184140,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iawmpu0",
                  "text": "What? What are you talking about bro?",
                  "timestamp": "2022-06-02 12:48:11",
                  "score": -2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iawpv0o",
                      "text": "> google: how do i read a reddit thread?",
                      "timestamp": "2022-06-02 13:15:15",
                      "score": 4,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iax63bf",
              "text": "No you can't. Feminism is so strongly associated with a particular ideology now. Claiming it and saying it is something else is like saying I'm a environmentalist but hate grass. It doesn't line up.",
              "timestamp": "2022-06-02 15:20:10",
              "score": 1,
              "num_children": 2,
              "replies": [
                {
                  "id": "iaxcc70",
                  "text": "Yes you fucking can you dumbass. What ideology is it you're fucking talking about? Whatever it is doesn't change the definition of the word feminism. \n\nFuck me. Feminism is about equal rights for women. That's it.",
                  "timestamp": "2022-06-02 16:04:53",
                  "score": -3,
                  "num_children": 1,
                  "author": 292066,
                  "replies": [
                    {
                      "id": "iaxdbh0",
                      "text": "Feminism in practice is about advocating for women no matter what. More rights, more benefits, more privileges. There is no attempt by feminism to hold women accountable for their wrongdoings. Instead feminists try the opposite and do everything they can to justify and excuse women's actions.\n\nTry not to bleed into your panties.",
                      "timestamp": "2022-06-02 16:11:53",
                      "score": 7,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iaxfi41",
                          "text": "You have a weird way of looking at the world mate. You've been brainwashed by something clearly.\n\nIt's really sad how people can be so easily tricked into believing shit. Have a nice day and learn to be a nicer person maybe.",
                          "timestamp": "2022-06-02 16:27:20",
                          "score": -2,
                          "num_children": 1,
                          "author": 292066,
                          "replies": [
                            {
                              "id": "iaxhzfr",
                              "text": "You are exactly the type of freak that would be a feminist. Telling others to be a nicer person. Didn't you start your reply to me calling me a dumbass? Or did your single digit IQ not register that? \n\nI said exactly what feminism actually is. Cry about it.",
                              "timestamp": "2022-06-02 16:44:46",
                              "score": 4,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iaxldb6",
                                  "text": "I called you a dumbass cause you seem to hate women for being feminists. Like you heard of feminazis and assumed it's all like that.\n\nIt's such a childish way to look at the world, grow up.",
                                  "timestamp": "2022-06-02 17:08:29",
                                  "score": 0,
                                  "num_children": 1,
                                  "author": 292066,
                                  "replies": [
                                    {
                                      "id": "iaxlkhv",
                                      "text": "Assuming things about people is childish. You're a fangirl for an ideology. Embarrassing. Have a nice day and learn to be a nicer person maybe.",
                                      "timestamp": "2022-06-02 17:09:53",
                                      "score": 7,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iayl5sn",
                  "text": "so why are most feminists supporting him",
                  "timestamp": "2022-06-02 21:25:31",
                  "score": 0,
                  "num_children": 1,
                  "author": 249807,
                  "replies": [
                    {
                      "id": "iaz1ish",
                      "text": "That's not what I've seen. I've seen more feminists writing articles complaining about the \"misogyny\" surrounding the case, and actually doubting the decision.",
                      "timestamp": "2022-06-02 23:30:22",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iayjp48",
              "text": "LOL feminist thought is directly responsible for the marginalization of male victims of sexual/domestic abuse. So many high standing feminists are exposing themselves right now trying to damage control",
              "timestamp": "2022-06-02 21:14:33",
              "score": 1,
              "num_children": 0,
              "author": 177039,
              "replies": []
            }
          ]
        },
        {
          "id": "iawp3s3",
          "text": "I saw like 0 support for heard. The most I would say I saw was people who said they’re both a bit shit.",
          "timestamp": "2022-06-02 13:08:53",
          "score": 3,
          "num_children": 0,
          "author": 355376,
          "replies": []
        },
        {
          "id": "iaxfo41",
          "text": "\n\nSurely It's not because Johnny Depp is attractive and rich",
          "timestamp": "2022-06-02 16:28:31",
          "score": 2,
          "num_children": 0,
          "author": 330241,
          "replies": []
        },
        {
          "id": "iawnbsg",
          "text": "You do see what is wrong with that second statement right?",
          "timestamp": "2022-06-02 12:53:34",
          "score": 1,
          "num_children": 0,
          "author": 54502,
          "replies": []
        },
        {
          "id": "iax5on8",
          "text": "Why would a feminist off the bat support heard? hearing someone out is different from accepting their words as truth. Wait a minute this is the 4chan subreddit nevermind I too hate women.",
          "timestamp": "2022-06-02 15:17:22",
          "score": 1,
          "num_children": 0,
          "author": 45619,
          "replies": []
        },
        {
          "id": "iaxsx7w",
          "text": "I literally didn’t know there were people supporting Heard since the main circlejerk was pro Depp until I saw a lotta people mad about the verdict saying women will never come forward again.",
          "timestamp": "2022-06-02 18:00:47",
          "score": 1,
          "num_children": 0,
          "author": 51483,
          "replies": []
        },
        {
          "id": "iay4g95",
          "text": "[deleted]",
          "timestamp": "2022-06-02 19:23:08",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "iaymqih",
              "text": "#",
              "timestamp": "2022-06-02 21:37:12",
              "score": 1,
              "num_children": 0,
              "author": 227831,
              "replies": []
            }
          ]
        },
        {
          "id": "iax5wyu",
          "text": "Feminism is about gender equality, not female dominance.",
          "timestamp": "2022-06-02 15:18:57",
          "score": 0,
          "num_children": 1,
          "author": 299846,
          "replies": [
            {
              "id": "iaymupo",
              "text": "Allegedly.",
              "timestamp": "2022-06-02 21:38:05",
              "score": 1,
              "num_children": 1,
              "author": 227831,
              "replies": [
                {
                  "id": "iayntvj",
                  "text": "No, not allegedly, that’s what it is by definition. Just reactionary shitheels try to change the definition by pretending radical extremists somehow represent “true” feminism.",
                  "timestamp": "2022-06-02 21:45:27",
                  "score": 1,
                  "num_children": 0,
                  "author": 299846,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iaw7zq6",
      "text": "Real title ‘women who knew there lies and bullshit wouldn’t work and couldn’t play the gender card pull out’",
      "timestamp": "2022-06-02 10:03:30",
      "score": 19,
      "num_children": 0,
      "author": 4147,
      "replies": []
    },
    {
      "id": "iaw283b",
      "text": "FPBP",
      "timestamp": "2022-06-02 08:36:22",
      "score": 4,
      "num_children": 0,
      "author": 121027,
      "replies": []
    },
    {
      "id": "iawh1e6",
      "text": "Thanks Amber Turd",
      "timestamp": "2022-06-02 11:52:58",
      "score": 3,
      "num_children": 0,
      "author": 402995,
      "replies": []
    },
    {
      "id": "iawhe8v",
      "text": "Amber Turd is a bad liar.  No one forced her to say she was donating her divorce $$ to the ACLU but she wanted to get on her fuxking high horse and have her cake and eat it too.",
      "timestamp": "2022-06-02 11:56:45",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iavznnj",
      "text": "I hope Johnny actually beat her up and lied the whole time\n\nCity Boys Up nonetheless",
      "timestamp": "2022-06-02 07:57:05",
      "score": 174,
      "num_children": 5,
      "author": 256277,
      "replies": [
        {
          "id": "iaw6sac",
          "text": "He shit in the bed but was too embarrassed to admit it",
          "timestamp": "2022-06-02 09:46:00",
          "score": 73,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iawbxxz",
          "text": "Unfathomably based",
          "timestamp": "2022-06-02 10:55:43",
          "score": 50,
          "num_children": 1,
          "author": 230265,
          "replies": [
            {
              "id": "iawfg0z",
              "text": "Based Department has a new Boss.",
              "timestamp": "2022-06-02 11:35:55",
              "score": 18,
              "num_children": 0,
              "author": 95294,
              "replies": []
            }
          ]
        },
        {
          "id": "iaxza3h",
          "text": "Yes sir",
          "timestamp": "2022-06-02 18:45:51",
          "score": 2,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iaw5xkt",
          "text": "Oh go away",
          "timestamp": "2022-06-02 09:33:25",
          "score": -26,
          "num_children": 2,
          "author": 340141,
          "replies": [
            {
              "id": "iawidxc",
              "text": "Seething",
              "timestamp": "2022-06-02 12:06:43",
              "score": 22,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "iaymoma",
              "text": "#",
              "timestamp": "2022-06-02 21:36:48",
              "score": 7,
              "num_children": 0,
              "author": 227831,
              "replies": []
            }
          ]
        },
        {
          "id": "ib4lmk0",
          "text": "Super based",
          "timestamp": "2022-06-04 08:03:29",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iavz56y",
      "text": "Whoreacaust \n\nBut what about the wooden door frames?",
      "timestamp": "2022-06-02 07:49:10",
      "score": 22,
      "num_children": 1,
      "replies": [
        {
          "id": "iax1lrz",
          "text": "Despite being at war with the rest of the continent, Germany decided to take on the logistical nightmare of detaining, killing and \"disposing of\" nearly 2 million people a year for 6 years",
          "timestamp": "2022-06-02 14:47:28",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "iax3i23",
              "text": "Yeah strange. Almost as if genocidal tendencies were a core part of nazi ideology.",
              "timestamp": "2022-06-02 15:01:29",
              "score": 3,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iawedly",
      "text": "Why would they..... the victim won.",
      "timestamp": "2022-06-02 11:24:10",
      "score": 10,
      "num_children": 1,
      "author": 346179,
      "replies": [
        {
          "id": "iaxz6kx",
          "text": "They don't see 'a victim who was abused won' and see it as empowering, they see 'a liar lost a court case' and pull out. It's very telling *who* actually retracted their cases.",
          "timestamp": "2022-06-02 18:45:08",
          "score": 2,
          "num_children": 0,
          "author": 94545,
          "replies": []
        }
      ]
    },
    {
      "id": "iaw95lz",
      "text": "Funny, as today is the official day of the whores (in english it's called national day of sex workers) but in german it's literally Day of the whores HAHAHHAHAHAHHA\n\n&#x200B;\n\n[https://www.google.com/search?q=tag+der+huren&oq=tag+der+huren&aqs=edge..69i57.1840j0j1&sourceid=chrome&ie=UTF-8](https://www.google.com/search?q=tag+der+huren&oq=tag+der+huren&aqs=edge..69i57.1840j0j1&sourceid=chrome&ie=UTF-8)\n\nEdit; it‘s also called Whores-Day",
      "timestamp": "2022-06-02 10:19:52",
      "score": 14,
      "num_children": 2,
      "author": 219930,
      "replies": [
        {
          "id": "iaxz108",
          "text": "The Germans are based once again.",
          "timestamp": "2022-06-02 18:44:01",
          "score": 4,
          "num_children": 0,
          "author": 94545,
          "replies": []
        },
        {
          "id": "iaypbuq",
          "text": "Yeah hitler had to die for this but ultimately we aimed for exactly this. Glad we could make it happen. You don't fuck with causality for a century without some german engineering.\n\nAnd they say we aren't entertainers.\n\nI'd also like to thank our russian bros. You played your part perfectly in our little experiment.\n\nNow excuse me. Its time that we clean up the entire mess we caused to set the stage for our next exciting show. Might take two or three centuries this time.",
          "timestamp": "2022-06-02 21:56:53",
          "score": 2,
          "num_children": 0,
          "author": 199548,
          "replies": []
        }
      ]
    },
    {
      "id": "iaw7vnq",
      "text": "sounds like they're not \"DV survivors\" then.",
      "timestamp": "2022-06-02 10:02:01",
      "score": 8,
      "num_children": 0,
      "author": 132221,
      "replies": []
    },
    {
      "id": "iawdk6g",
      "text": "\"survivors\"\n\nbless johnny for giving other fake abuse victims a scare",
      "timestamp": "2022-06-02 11:14:59",
      "score": 8,
      "num_children": 0,
      "author": 334713,
      "replies": []
    },
    {
      "id": "iawhrlt",
      "text": "[deleted]",
      "timestamp": "2022-06-02 12:00:37",
      "score": 11,
      "num_children": 1,
      "replies": [
        {
          "id": "iazwi62",
          "text": "There's no audio of that. Don't lie, dude. She said no one will believe him because she is saying she didn't abuse him. The photos were proven not edited. It was the same original photo that went through editing software.\n\nNo one is defending her because she's a woman. Women are notoriously not believed until there's a dead body to prove it. People believe her because the courts ruled that Depp abused her, and there's a mountain of evidence for it. That was that last court case. This case was not about abuse, it was about defamation and if she's allowed to speak about her abuse.",
          "timestamp": "2022-06-03 03:40:19",
          "score": 0,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iaw7agx",
      "text": "Just another woman getting caught out lying through her teeth & once again, news deflects from her own miserable & malicious failings to gaslight others into the lowest tier of made up faux morality; clause 1(2b). It is so tiring. So predictable. Extremely vacuous. Yet still no-one is prepared to confront this phenomenon of #believeallwomen\n\nMaybe, just maybe, these female predatory abusers should be held to account for the amount of destruction (mentally, physically & financially) that they so willingly sow, the seeds of violence bear many fruits which appeal towards the synaptic formulation of the psychosis which dictates within an era of metoo, more predominantly if you are female though. Until then, be prepared for more men to suffer on the daily, suffering in silence.\n\n#believeallmen?\n\n\nSpez; a vowel.",
      "timestamp": "2022-06-02 09:53:35",
      "score": 29,
      "num_children": 0,
      "author": 131326,
      "replies": []
    },
    {
      "id": "iawb6pg",
      "text": "Why do people regard this as a \"men vs women\" Thing all the time. It's about insane people (irrespective of Sex) who do insane things to their partners. A majority of the population just treats everyone around like it's supposed to be: in a normal non-violant manner. Simple as that. Fuck all the cunt women on this Planet.",
      "timestamp": "2022-06-02 10:46:14",
      "score": 14,
      "num_children": 2,
      "author": 142025,
      "replies": [
        {
          "id": "iayf7ls",
          "text": "Because men are at a tremendous disadvantage in legal cases, particularly regarding abuse.",
          "timestamp": "2022-06-02 20:41:03",
          "score": 3,
          "num_children": 0,
          "author": 373776,
          "replies": []
        },
        {
          "id": "iaynaxl",
          "text": "Because feminists have been on a campaign since the 70s to gender domestic and sexual abuse as much as possible. Men perpetrator, women victim no exception.",
          "timestamp": "2022-06-02 21:41:30",
          "score": 1,
          "num_children": 0,
          "author": 177039,
          "replies": []
        }
      ]
    },
    {
      "id": "iaw6s52",
      "text": "Pack your bags women. The era of false accusations and muh victimhood mentality are over.",
      "timestamp": "2022-06-02 09:45:56",
      "score": 29,
      "num_children": 1,
      "author": 323903,
      "replies": [
        {
          "id": "iawc6cd",
          "text": "One can hope, but the pendulum will likely keep on swinging.",
          "timestamp": "2022-06-02 10:58:35",
          "score": 19,
          "num_children": 0,
          "author": 409354,
          "replies": []
        }
      ]
    },
    {
      "id": "iawgfg7",
      "text": "False accusation is just as bad as domestic violence. If you look at all the evidence, it should be clear that Johnny is the victim here. And I doubt anyone would retract their accusation based on such a trial if their accusation wasn't shit.",
      "timestamp": "2022-06-02 11:46:29",
      "score": 6,
      "num_children": 0,
      "author": 133634,
      "replies": []
    },
    {
      "id": "iax2m4f",
      "text": "Good, false accusations hurt real victims",
      "timestamp": "2022-06-02 14:54:57",
      "score": 5,
      "num_children": 0,
      "author": 45188,
      "replies": []
    },
    {
      "id": "iaw88xa",
      "text": "“aLwAyS BEliEve wOMen”",
      "timestamp": "2022-06-02 10:07:00",
      "score": 15,
      "num_children": 0,
      "author": 327630,
      "replies": []
    },
    {
      "id": "iawhsgp",
      "text": "Watching somebody who lied get called out terrifies you? Maybe that’s indicative of your own guilt",
      "timestamp": "2022-06-02 12:00:51",
      "score": 8,
      "num_children": 1,
      "author": 253498,
      "replies": [
        {
          "id": "ib4lv1w",
          "text": "Based",
          "timestamp": "2022-06-04 08:07:26",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iawert9",
      "text": "The fact that people think metoo is going to die overnight because of this shows how much faith they had in it in the first place",
      "timestamp": "2022-06-02 11:28:34",
      "score": 4,
      "num_children": 0,
      "author": 330878,
      "replies": []
    },
    {
      "id": "iawmtdd",
      "text": "Its over for meetoocels",
      "timestamp": "2022-06-02 12:49:03",
      "score": 6,
      "num_children": 1,
      "author": 149848,
      "replies": [
        {
          "id": "ib4lyrr",
          "text": "Happy cake",
          "timestamp": "2022-06-04 08:09:16",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iawuwxs",
      "text": "This men vs women thing is stupid. I have a mother and a part of her lives in me. So when a feminist tells me that “you’ve had it good for thousands of years” I have to remind them that 1. I’m not a thousand years old, and 2. then half of my genetic heritage was oppressed also and I want justice for our mothers. Here’s an example of an evil person just so happens to be a violent woman. This really outs anybody that has outrage to her loss as “woman can’t be abusers” and now that turned into “why can’t women get away with abuse.” Just like I came from a line of woman, woman also have a line of “oppressive, terrible men” in their bloodline (just as they claim men to be.) They’re literally outing themselves as having a predisposition to abuse and violence when these arguments come up because both mothers AND fathers live in the sons and daughters.",
      "timestamp": "2022-06-02 13:56:21",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iawhzyc",
      "text": "But the abuse victim won",
      "timestamp": "2022-06-02 12:02:51",
      "score": 4,
      "num_children": 1,
      "author": 191330,
      "replies": [
        {
          "id": "iawj7fc",
          "text": "Check your privilege opressor",
          "timestamp": "2022-06-02 12:15:10",
          "score": 4,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iawmc9w",
      "text": "Wasn't this a defamation lawsuit? Didn't they already settle the domestic abuse lawsuit? Why would the verdict of a defamation suit affect women?",
      "timestamp": "2022-06-02 12:44:47",
      "score": 2,
      "num_children": 0,
      "author": 148974,
      "replies": []
    },
    {
      "id": "iawna63",
      "text": "The headline should read: Amber Beard's lies have hurt millions of women seeking justice ACTUALLY deserved.",
      "timestamp": "2022-06-02 12:53:11",
      "score": 2,
      "num_children": 0,
      "author": 73756,
      "replies": []
    },
    {
      "id": "iaxanqz",
      "text": "According to a picture of a random person tweeting. OK.",
      "timestamp": "2022-06-02 15:52:51",
      "score": 2,
      "num_children": 0,
      "author": 134853,
      "replies": []
    },
    {
      "id": "iaxh42e",
      "text": "Wait, can you actually retract statements made to police for these types of things?",
      "timestamp": "2022-06-02 16:38:43",
      "score": 2,
      "num_children": 0,
      "author": 159640,
      "replies": []
    },
    {
      "id": "iaxjsal",
      "text": ">victim wins case\n\n>victims complain that the abuser lost\n\nWhat",
      "timestamp": "2022-06-02 16:57:20",
      "score": 2,
      "num_children": 0,
      "author": 163284,
      "replies": []
    },
    {
      "id": "iaxneyy",
      "text": "Taylor Lorenz is a joke",
      "timestamp": "2022-06-02 17:22:40",
      "score": 2,
      "num_children": 0,
      "author": 96399,
      "replies": []
    },
    {
      "id": "iaydndp",
      "text": "The pair of these morons living their dipshit screwball celebrity lives can both jump off a cliff.",
      "timestamp": "2022-06-02 20:29:42",
      "score": 2,
      "num_children": 0,
      "author": 179597,
      "replies": []
    },
    {
      "id": "iazagjg",
      "text": "gold miners getting btfod",
      "timestamp": "2022-06-03 00:43:41",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ib0gomk",
      "text": "\"Men always win\"? Absolutely not in abuse cases. Imagine how fucked you have to be to whine over that depp won when it was 100% clear what had happened.",
      "timestamp": "2022-06-03 07:38:37",
      "score": 2,
      "num_children": 0,
      "author": 379968,
      "replies": []
    },
    {
      "id": "iaw6iwb",
      "text": "I don't hate women, but I absolutely do despise them bros.",
      "timestamp": "2022-06-02 09:42:13",
      "score": 10,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaw5rsw",
      "text": "I’ve only settled an eviction in court before and that’s because you’re not allowed to just shoot squatters, who came up with that rule I’ll never know.\n\nCivil court seems dumb.",
      "timestamp": "2022-06-02 09:30:55",
      "score": 6,
      "num_children": 1,
      "author": 150615,
      "replies": [
        {
          "id": "iawi1gz",
          "text": "The amount of protections that exist to prevent evictees is absurd. If you haven't paid rent for six months and have been destroying the property just because you can the owner should be allowed to hang you from a tree in the front lawn. Like in medieval times when they'd string up executed corpses in front of the castle walls.",
          "timestamp": "2022-06-02 12:03:15",
          "score": 3,
          "num_children": 0,
          "author": 222270,
          "replies": []
        }
      ]
    },
    {
      "id": "iaw9t2d",
      "text": ">Men Always Win\n\nNo shit, we did everything.",
      "timestamp": "2022-06-02 10:28:33",
      "score": 5,
      "num_children": 0,
      "author": 170758,
      "replies": []
    },
    {
      "id": "iaw9kr3",
      "text": "Sadly an and to an age, when women had an easy way to make money out of false claims :(",
      "timestamp": "2022-06-02 10:25:25",
      "score": 3,
      "num_children": 0,
      "author": 142333,
      "replies": []
    },
    {
      "id": "iawgjsj",
      "text": "“Ahhhhh. My life is so hard and sheeeit.” -Modern “Domestic Abuse victims.”",
      "timestamp": "2022-06-02 11:47:47",
      "score": 3,
      "num_children": 0,
      "author": 177771,
      "replies": []
    },
    {
      "id": "iaw9uj3",
      "text": "The time of Woman is over. The age of Man begins.",
      "timestamp": "2022-06-02 10:29:06",
      "score": 6,
      "num_children": 0,
      "author": 168609,
      "replies": []
    },
    {
      "id": "iawpmvq",
      "text": "Tell me why I should give a single shit about misogyny if women are going to lie about domestic abuse for personal gain, then get upset when their lies are called out?",
      "timestamp": "2022-06-02 13:13:23",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iawu8i1",
      "text": "Now he can go back to being a violent, drug addicted alcoholic and live in peace.",
      "timestamp": "2022-06-02 13:50:55",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaww1hv",
      "text": "Hoe-locaust",
      "timestamp": "2022-06-02 14:05:13",
      "score": 2,
      "num_children": 0,
      "author": 204269,
      "replies": []
    },
    {
      "id": "iawwawf",
      "text": "Fuck Taylor Lorenz",
      "timestamp": "2022-06-02 14:07:15",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iax4hrz",
      "text": "Nobody who was actually raped or beaten would have a problem with police looking into their claims.",
      "timestamp": "2022-06-02 15:08:47",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iax62h5",
      "text": "“Ah shit, we can’t get away with our blatant lies,”",
      "timestamp": "2022-06-02 15:20:00",
      "score": 2,
      "num_children": 0,
      "author": 3501,
      "replies": []
    },
    {
      "id": "iawv44o",
      "text": "holy based",
      "timestamp": "2022-06-02 13:57:57",
      "score": 2,
      "num_children": 0,
      "author": 90781,
      "replies": []
    },
    {
      "id": "iax1ciu",
      "text": "People who are like Amber or side with Amber are always the biggest gaslighters.  Everyone and everything around them is the problem, they’re never the problem.",
      "timestamp": "2022-06-02 14:45:33",
      "score": 3,
      "num_children": 0,
      "author": 304370,
      "replies": []
    },
    {
      "id": "iax55jn",
      "text": "Women I follow on social media are still finding some dumbass faults in Depp, saying that he’s an abuser even though it’s been disproved, and that Heard is the real victim. They have literally 0 clue that no one is gonna buy their bs.",
      "timestamp": "2022-06-02 15:13:33",
      "score": 3,
      "num_children": 0,
      "author": 29024,
      "replies": []
    },
    {
      "id": "iawzfaf",
      "text": "Domestic violence victim here. In my experience if you don't lie and manufacture evidence like photoshopping pictures and having elective surgery to cause fake bruises, you'll be fine as far as defamation goes.",
      "timestamp": "2022-06-02 14:31:10",
      "score": 1,
      "num_children": 0,
      "author": 378462,
      "replies": []
    },
    {
      "id": "iax1gus",
      "text": "It's always about women isn't it",
      "timestamp": "2022-06-02 14:46:28",
      "score": 1,
      "num_children": 0,
      "author": 47152,
      "replies": []
    },
    {
      "id": "iaw6hcb",
      "text": "I want to believe this but where the proof?",
      "timestamp": "2022-06-02 09:41:38",
      "score": 1,
      "num_children": 0,
      "author": 112618,
      "replies": []
    },
    {
      "id": "iawmzk4",
      "text": "Rolling stone lost all credibility when they ran the fake story about the UVA fraternity years ago.",
      "timestamp": "2022-06-02 12:50:34",
      "score": 1,
      "num_children": 0,
      "author": 181841,
      "replies": []
    },
    {
      "id": "iawpbz8",
      "text": "\"Survivors\"",
      "timestamp": "2022-06-02 13:10:50",
      "score": 1,
      "num_children": 0,
      "author": 155405,
      "replies": []
    },
    {
      "id": "iawrhd2",
      "text": "It was a defamation trial. It was never about who did what to who. It was always only to prove that she torpedoed his career knowingly and with intent. Thats it. \n\nPeople are seriously so detached from reality, I honestly cant believe it sometimes.",
      "timestamp": "2022-06-02 13:28:44",
      "score": 1,
      "num_children": 0,
      "author": 336843,
      "replies": []
    },
    {
      "id": "iawwvpm",
      "text": "every single human alive: yeah i side with johnny\n\n4chan: feminists hate this!!!! lolol",
      "timestamp": "2022-06-02 14:11:43",
      "score": 1,
      "num_children": 0,
      "author": 397965,
      "replies": []
    },
    {
      "id": "iawxjih",
      "text": "everyone is a survivor now apparently",
      "timestamp": "2022-06-02 14:16:51",
      "score": 1,
      "num_children": 0,
      "author": 277297,
      "replies": []
    },
    {
      "id": "iawylwc",
      "text": "Well she didn’t hesitate to pull these imaginary numbers out of her ass.",
      "timestamp": "2022-06-02 14:24:52",
      "score": 1,
      "num_children": 0,
      "author": 37393,
      "replies": []
    },
    {
      "id": "iaxcii0",
      "text": "This is unfair, she's a woman so she must've won, this is literally sexism and patriarchy! /s",
      "timestamp": "2022-06-02 16:06:07",
      "score": 1,
      "num_children": 0,
      "author": 411380,
      "replies": []
    },
    {
      "id": "iaxfz3v",
      "text": "\"Survivors\"\n\nIdk why but this just pisses me off in general, If you got stranded on an island, or lost in the woods for weeks and you lived, you're a survivor\n\nIf you got sexually assaulted you're not a survivor, you're a victim",
      "timestamp": "2022-06-02 16:30:40",
      "score": 1,
      "num_children": 0,
      "author": 330241,
      "replies": []
    },
    {
      "id": "iawkuwj",
      "text": "Women shouldn’t be discouraged by this, since most ( upwards of 99%) women are not abusive liars trying to pin abuse on their own abuse victim. My feeling is that a victim of abuse won.",
      "timestamp": "2022-06-02 12:31:09",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iawnppd",
      "text": "“Men always win”",
      "timestamp": "2022-06-02 12:57:00",
      "score": 1,
      "num_children": 0,
      "author": 335450,
      "replies": []
    },
    {
      "id": "iax5d9w",
      "text": "It went through the courts, both sides were able to make their case, this is as fair as it can get. IMO in cases like this you need real proof otherwise you can just frame any person way way to easy. I'm totally satisfied with this process and if she was able to prove her case more, then so be it, but she couldn't. It's just.\n\nYou simply can't just trust a persons words. The end.",
      "timestamp": "2022-06-02 15:15:07",
      "score": 1,
      "num_children": 0,
      "author": 94245,
      "replies": []
    },
    {
      "id": "iaxg7yf",
      "text": "Hey men, Legal insurence is a thing.",
      "timestamp": "2022-06-02 16:32:25",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaxjck7",
      "text": "[removed]",
      "timestamp": "2022-06-02 16:54:19",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "iaxjclk",
          "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```bitch```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
          "timestamp": "2022-06-02 16:54:20",
          "score": 1,
          "num_children": 0,
          "author": 184140,
          "replies": []
        }
      ]
    },
    {
      "id": "iaxjp3w",
      "text": "[removed]",
      "timestamp": "2022-06-02 16:56:44",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "iaxjp8d",
          "text": "Your comment has been removed because it contained a word that the admins do not allow on reddit. The word was ```bitch```. If you intend to use this word in a purely demonstrative manner, please use the first letter of the word followed by '-word' or '-slur'. Thank you for helping us keep reddit safe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4chan) if you have any questions or concerns.*",
          "timestamp": "2022-06-02 16:56:45",
          "score": 1,
          "num_children": 0,
          "author": 184140,
          "replies": []
        }
      ]
    },
    {
      "id": "iaxskut",
      "text": "Gee wonder why 4chan was so obsessed with entertainment tonight level celebrity news this time.",
      "timestamp": "2022-06-02 17:58:21",
      "score": 1,
      "num_children": 0,
      "author": 61066,
      "replies": []
    },
    {
      "id": "iaxsm1c",
      "text": "Hundreds of 'domestic violence survivors'  ftfy",
      "timestamp": "2022-06-02 17:58:35",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaxu57p",
      "text": " >Hundreds of liars retract unfounded allegations for fear of consequences\n\n\nFTFY",
      "timestamp": "2022-06-02 18:09:31",
      "score": 1,
      "num_children": 0,
      "author": 10508,
      "replies": []
    },
    {
      "id": "iaxxm3b",
      "text": "It's the end of \"MeTwo\" says woman across the world as Depp speak out about is domestic abuse case from crazy whore.",
      "timestamp": "2022-06-02 18:34:13",
      "score": 1,
      "num_children": 0,
      "author": 290597,
      "replies": []
    },
    {
      "id": "iaxyw1y",
      "text": "Total Victory. Me too was a weapon that destroyed so many peoples lives unjustly.",
      "timestamp": "2022-06-02 18:43:05",
      "score": 1,
      "num_children": 0,
      "author": 171068,
      "replies": []
    },
    {
      "id": "iay106q",
      "text": "Maybe they should blame Heard for poisoning the well with her bullshit instead of balling men. Oh that’s right women are never in the wrong 😂",
      "timestamp": "2022-06-02 18:58:16",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iay161g",
      "text": "The holes are in full retreat, now they'll attempt to think twice before putting forward their ridiculous false allegations of spousal abuse.",
      "timestamp": "2022-06-02 18:59:26",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iay17iu",
      "text": "Amber Turd",
      "timestamp": "2022-06-02 18:59:44",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iay1ynm",
      "text": "I'd that true then that's an absolute win. Make the lying bitches afraid as they should be.",
      "timestamp": "2022-06-02 19:05:10",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iay2so7",
      "text": "MeToo was killed when people came forward about Biden assaulting women and people told them to shut up and Vote Blue No Matter Who.",
      "timestamp": "2022-06-02 19:11:16",
      "score": 1,
      "num_children": 0,
      "author": 387999,
      "replies": []
    },
    {
      "id": "iayc5eg",
      "text": "\"Men always win\"?\n\nIn what fucking universe?!",
      "timestamp": "2022-06-02 20:18:48",
      "score": 1,
      "num_children": 0,
      "author": 69203,
      "replies": []
    },
    {
      "id": "iayqh2k",
      "text": "You're probably not going to get away with it. It's got nothing to do with whatever bullshit these \"survivors\" are trying to peddle. If you got a case, you got a case.",
      "timestamp": "2022-06-02 22:05:26",
      "score": 1,
      "num_children": 0,
      "author": 169417,
      "replies": []
    },
    {
      "id": "iayzkfj",
      "text": "What it *should* mean to survivors of abuse is that they have a chance at justice, even if it seems like the whole world is against them, and even if they're a man.\n\nEdit: After all, Harvey Weinstein just had *his* conviction *upheld*!",
      "timestamp": "2022-06-02 23:14:35",
      "score": 1,
      "num_children": 0,
      "author": 152122,
      "replies": []
    },
    {
      "id": "iaz1a2h",
      "text": ">Men always win\n\nThis statement is contemptuous against the judicial system of the United States, as it implies the judge and jury ruled against Ms Heard purely because of her gender. Subversive statements like these can carry a prison sentence. Online or offline. Just saying.",
      "timestamp": "2022-06-02 23:28:22",
      "score": 1,
      "num_children": 0,
      "author": 381740,
      "replies": []
    },
    {
      "id": "iaz217h",
      "text": "Don’t marry a woman unless she’s the one folks",
      "timestamp": "2022-06-02 23:34:35",
      "score": 1,
      "num_children": 0,
      "author": 114825,
      "replies": []
    },
    {
      "id": "ib08gj4",
      "text": "That's the message that SHE's giving out. That dennouncing is pointless because she lost and that obviously means the game is completely rigged. When the truth is she deserved it.",
      "timestamp": "2022-06-03 05:45:56",
      "score": 1,
      "num_children": 0,
      "author": 352772,
      "replies": []
    },
    {
      "id": "ib0c9gy",
      "text": "this proves that uk lawyers are not worth appointing",
      "timestamp": "2022-06-03 06:35:14",
      "score": 1,
      "num_children": 0,
      "author": 63357,
      "replies": []
    },
    {
      "id": "ib0cof9",
      "text": "Move the quotation marks two words to the right",
      "timestamp": "2022-06-03 06:40:49",
      "score": 1,
      "num_children": 0,
      "author": 169156,
      "replies": []
    },
    {
      "id": "iaxcyov",
      "text": "Yeah it's fucked up she lied but he also is an abuser. They abused each other. \n\nIt's wild you guys ignore all the things that were admitted to have happened by both parties. \n\nHopefully this is like OJ where he releases a fucking book about it. \n\nIt's so crazy so many people were willing to judge how \"authentic\" one of the world's greatest actors was in court. In a case he specifically set up so it would be televised.\n\nThey're both bad and it's insane more people don't see it.",
      "timestamp": "2022-06-02 16:09:21",
      "score": -5,
      "num_children": 1,
      "replies": [
        {
          "id": "iay9ocs",
          "text": "Mutual abuse isn't a thing. \n\nhttps://www.thehotline.org/resources/the-myth-of-mutual-abuse/",
          "timestamp": "2022-06-02 20:00:43",
          "score": 1,
          "num_children": 0,
          "author": 100671,
          "replies": []
        }
      ]
    },
    {
      "id": "iax2d8k",
      "text": "not suprising a professional victim would be shilling for a professional victim",
      "timestamp": "2022-06-02 14:53:07",
      "score": 0,
      "num_children": 0,
      "author": 47761,
      "replies": []
    },
    {
      "id": "iax2t3f",
      "text": "Good",
      "timestamp": "2022-06-02 14:56:23",
      "score": 0,
      "num_children": 0,
      "author": 329419,
      "replies": []
    },
    {
      "id": "iax8w9h",
      "text": "Based. And Nord FC pilled",
      "timestamp": "2022-06-02 15:40:18",
      "score": 0,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaxagge",
      "text": "They spelled Turd wrong",
      "timestamp": "2022-06-02 15:51:27",
      "score": 0,
      "num_children": 0,
      "author": 287312,
      "replies": []
    },
    {
      "id": "iayksrj",
      "text": "Just so funny to see that nothing really will change for men. \n\nOJ is still guilty in the court of public opinion\n\nAbortion is still contested despite roe v Wade in many states\n\nMichael Jackson will always be the pedophile instead of a gullible idiot who got taken advantage of by some very shrewd parents knowing he had diminished mental health. \n\nKyle Rittenhouse will be guilty for one side and innocent for the other side. \n\nIn the same way this case will do nothing but serve as another divider for us. \n\nMen are unequivocally messed up and lose more to juries and judges in any case. Being a man in a divorce is just terrible and the laws that support it are evil but sadly this case will join the others mentioned above.\n\nNothing really will change and people will still find reasons to be upset with each other.",
      "timestamp": "2022-06-02 21:22:47",
      "score": 0,
      "num_children": 0,
      "author": 185933,
      "replies": []
    },
    {
      "id": "iaz3493",
      "text": "Why don't people understand that this wasn't a criminal trial. Johnny depp wasn't on trial for being abusive. This was defamation. This has nothing to do with other domestic abuse.",
      "timestamp": "2022-06-02 23:43:24",
      "score": 0,
      "num_children": 0,
      "author": 244086,
      "replies": []
    }
  ]
}