{
  "id": "v333q6",
  "text": "Smh\n",
  "timestamp": "2022-06-02 07:13:06",
  "score": 736,
  "subreddit": "t5_2zaj2",
  "num_children": 58,
  "author": 216413,
  "replies": [
    {
      "id": "iavytid",
      "text": "Yeah I know right? How DARE the legal system let a man exercise his right to justice against a \"wOmYn\" who abused the fuck out of him? /s",
      "timestamp": "2022-06-02 07:44:14",
      "score": 186,
      "num_children": 0,
      "author": 354634,
      "replies": []
    },
    {
      "id": "iaw2vsw",
      "text": "What are they being so delusional about? The evidence is there showing that Amber Heard lied.",
      "timestamp": "2022-06-02 08:46:24",
      "score": 100,
      "num_children": 5,
      "author": 206359,
      "replies": [
        {
          "id": "iaw3mqc",
          "text": "Does it matter to them? All that matters is that if a woman says so then it must be right.",
          "timestamp": "2022-06-02 08:58:16",
          "score": 88,
          "num_children": 1,
          "replies": [
            {
              "id": "iawko2x",
              "text": "Because she feeels of being right.",
              "timestamp": "2022-06-02 12:29:17",
              "score": 27,
              "num_children": 1,
              "author": 311489,
              "replies": [
                {
                  "id": "iays4m4",
                  "text": "Truthiness",
                  "timestamp": "2022-06-02 22:17:51",
                  "score": 7,
                  "num_children": 0,
                  "author": 143784,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iawblqg",
          "text": "Evidence means nothing to people like that. You could have a video showing a guy minding his own business only to be stabbed by some random woman multiple times and people like these will still find a way to make all the fault be on the guy no matter what. I see these as a group of people that were raised to truly believe that women are seen as these precious princess angel like beings that can never do any harm, even if they do they just write it off as \"self defense\". Anyone is capable of being rude, crazy, vile, twisted or just downright despicable, gender has zero play when it comes to being a terrible person.",
          "timestamp": "2022-06-02 10:51:30",
          "score": 28,
          "num_children": 0,
          "author": 134252,
          "replies": []
        },
        {
          "id": "iaw454k",
          "text": "They’re angry that a woman was held accountable for her actions. Accountability is women’s Kryptonite.",
          "timestamp": "2022-06-02 09:05:47",
          "score": 79,
          "num_children": 3,
          "author": 304888,
          "replies": [
            {
              "id": "iaw5cxb",
              "text": "this needs to be a meme",
              "timestamp": "2022-06-02 09:24:31",
              "score": 29,
              "num_children": 1,
              "author": 157495,
              "replies": [
                {
                  "id": "iay1g2t",
                  "text": "That would for sure be posted on r/terriblefacebookmemes but it’d be worth it",
                  "timestamp": "2022-06-02 19:01:27",
                  "score": 5,
                  "num_children": 0,
                  "author": 165570,
                  "replies": []
                }
              ]
            },
            {
              "id": "iaxp89b",
              "text": "“How do you write a woman so well?”\n\n“I think of a man: then I remove reason, and accountability”\n\nQuoted from *As Good as it Gets*",
              "timestamp": "2022-06-02 17:35:08",
              "score": 13,
              "num_children": 0,
              "author": 316157,
              "replies": []
            },
            {
              "id": "iaz4f3c",
              "text": "This shit right here! ☝🏻💯",
              "timestamp": "2022-06-02 23:54:03",
              "score": 2,
              "num_children": 0,
              "author": 77256,
              "replies": []
            }
          ]
        },
        {
          "id": "iawbo0m",
          "text": "A woman lost to a man. Therefore the patriarchy won and women are oppressed. Man bad. Woman good.",
          "timestamp": "2022-06-02 10:52:18",
          "score": 46,
          "num_children": 0,
          "author": 274659,
          "replies": []
        },
        {
          "id": "iaw5s29",
          "text": "nobody's that brainwashed\n\n\nthe only people who still support amber heard and actually watched the trial or at least listened to any of the recordings are the people who agree with women being able to abuse men and get away with it. \n\n\ni do not use the word evil lightly, but if you seriously disregard a person getting beaten and their fingers cut off and made fun of for it by their abuser and turned around on them- just bc the abuser is someone you think can help your demographic personally- you're an evil person with zero morals.",
          "timestamp": "2022-06-02 09:31:02",
          "score": 23,
          "num_children": 2,
          "author": 157495,
          "replies": [
            {
              "id": "iawt8n9",
              "text": "You would need them to have a brain to wash it.",
              "timestamp": "2022-06-02 13:43:02",
              "score": 10,
              "num_children": 1,
              "author": 188455,
              "replies": [
                {
                  "id": "iay3qar",
                  "text": "Holy shit that's a funny fact lol.",
                  "timestamp": "2022-06-02 19:18:00",
                  "score": 4,
                  "num_children": 0,
                  "author": 46960,
                  "replies": []
                }
              ]
            },
            {
              "id": "iawi3hw",
              "text": "Its very widespread among women to side with asshole women who abuse or manipulate men, unfortunately even other men will often side with a woman when there is a conflict between a man and a woman regardless of who is at fault or who is perpetrating violence or abuse. If a man ever openly supports another abusive man he is rightfully considered a piece of trash and socially shunned, there are no such consequences for women however.",
              "timestamp": "2022-06-02 12:03:48",
              "score": 10,
              "num_children": 0,
              "author": 196510,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iavwyi7",
      "text": "She's right. The legal system should not be designed to protect women. It should be designed to protect men and women.",
      "timestamp": "2022-06-02 07:17:13",
      "score": 203,
      "num_children": 2,
      "author": 211143,
      "replies": [
        {
          "id": "iavy6v2",
          "text": "Time to burn shit down. No justice no peace.",
          "timestamp": "2022-06-02 07:35:01",
          "score": 69,
          "num_children": 1,
          "replies": [
            {
              "id": "iawphw8",
              "text": "Bet its nerf or nothin",
              "timestamp": "2022-06-02 13:12:13",
              "score": 17,
              "num_children": 0,
              "author": 70948,
              "replies": []
            }
          ]
        },
        {
          "id": "iay1n0q",
          "text": "But if it protects men than that’s the only group it protects. It’s like feminist views on rape but backwards. They focus on what proves their point.",
          "timestamp": "2022-06-02 19:02:50",
          "score": 3,
          "num_children": 0,
          "author": 165570,
          "replies": []
        }
      ]
    },
    {
      "id": "iaw42z3",
      "text": "So the feminists are now admitting they advocate war bloodshed and violence, but still refuse the draft.",
      "timestamp": "2022-06-02 09:04:54",
      "score": 61,
      "num_children": 1,
      "author": 227190,
      "replies": [
        {
          "id": "iayeznh",
          "text": "Yup",
          "timestamp": "2022-06-02 20:39:27",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iaw2elm",
      "text": "They want wars and would be the first to whine if they get hurt. Men used to be killed to protect them. It will be strange for them to lose this privilege.",
      "timestamp": "2022-06-02 08:39:13",
      "score": 126,
      "num_children": 3,
      "author": 363332,
      "replies": [
        {
          "id": "iaw5bzx",
          "text": "i know what you mean but men still do die protecting women everyday, let's not devalue the sacrifice of our military and the men who keep the streets safe from animals, fires, rapists and killers- and no i don't mean leo's , i mean any good man who stops bad men. \n\n\njust bc things seem safe doesn't mean unsung heroes don't die everyday and go unappreciated by spoiled women and some men who have gotten so used to peacetime that they say ungrateful things like this post.",
          "timestamp": "2022-06-02 09:24:08",
          "score": 33,
          "num_children": 0,
          "author": 157495,
          "replies": []
        },
        {
          "id": "iaw6yae",
          "text": "They turn on their would be protectors.  Surprised at the result.\n\nEven a dog will bite back if it's kicked enough",
          "timestamp": "2022-06-02 09:48:32",
          "score": 50,
          "num_children": 0,
          "author": 5933,
          "replies": []
        },
        {
          "id": "iawklvb",
          "text": "> They want wars\n\nNihil novi sub sole. Our ancestors made legends about it:\n\nhttps://en.wikipedia.org/wiki/The_Maidens%27_War",
          "timestamp": "2022-06-02 12:28:40",
          "score": 11,
          "num_children": 0,
          "author": 311489,
          "replies": []
        }
      ]
    },
    {
      "id": "iaw2vks",
      "text": "Ah yes because riots, vandalism and tyranny are gonna magically make people give you “justice”",
      "timestamp": "2022-06-02 08:46:18",
      "score": 31,
      "num_children": 0,
      "author": 378415,
      "replies": []
    },
    {
      "id": "iaw0zu8",
      "text": "~~justice~~  \nget out of jail free cards",
      "timestamp": "2022-06-02 08:17:22",
      "score": 30,
      "num_children": 0,
      "author": 354631,
      "replies": []
    },
    {
      "id": "iavx9rt",
      "text": "[this is what popped in my head after reading this shit...](https://youtu.be/Nc5v8r0rNk0)",
      "timestamp": "2022-06-02 07:21:32",
      "score": 23,
      "num_children": 0,
      "author": 333940,
      "replies": []
    },
    {
      "id": "iaw8pbg",
      "text": "Then how comes Amber was able to put Johnny through six years of absolute unjustified hell, if Johnny was so powerful and Amber so powerless? They never want to answer that question.",
      "timestamp": "2022-06-02 10:13:29",
      "score": 23,
      "num_children": 1,
      "replies": [
        {
          "id": "iaycme3",
          "text": "money and fame can’t protect you from domestic violence. which this case proved. i don’t understand how people can really not understand this shit.",
          "timestamp": "2022-06-02 20:22:11",
          "score": 5,
          "num_children": 0,
          "author": 131490,
          "replies": []
        }
      ]
    },
    {
      "id": "iavy4uk",
      "text": "Start uncontrolled fires in 80° temperatures? Smart.",
      "timestamp": "2022-06-02 07:34:12",
      "score": 17,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaw76fc",
      "text": "If a woman saw some of that trial and comes away with this mindset during the verdict it just tells you one thing, that she wants to act like Amber Heard did and get away with it within her own relationship, so I look at that as a giant red flag, fortunately like I said the majority of people including the majority of women seemed to be on Johnny side during all of this.\n\n\n\n\n\n\nAs far as this young lady here, whatever just keep your \" mostly peaceful protests\" away from my block",
      "timestamp": "2022-06-02 09:51:55",
      "score": 18,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaw6jdl",
      "text": "She is right, you know? How is it possible that a justice system almost completely perverted by the feminist theories to actually use its old normal tools and decide against a female abuser? I totally understand why feminists feel that the system failed them because it didn't completely bend to their will. But let's not get ourselves fooled, the jury still admitted that Depp had defamed his abusive wife...\n\nSo please, do not see this as a victory in any way. It will remain probably one of the last stands against a biased system while activists will ramp up their attacks in order to completely destroy men. Considering our political leaders... In about 15-20 years they will succeed.",
      "timestamp": "2022-06-02 09:42:24",
      "score": 15,
      "num_children": 1,
      "author": 67617,
      "replies": [
        {
          "id": "iaw8sw8",
          "text": "The jury admitted that Depp's ex lawyer difamed Heard.",
          "timestamp": "2022-06-02 10:14:53",
          "score": 4,
          "num_children": 2,
          "author": 276939,
          "replies": [
            {
              "id": "iaw94qg",
              "text": "Indeed. But somehow they blamed him. Funny, isn't it?",
              "timestamp": "2022-06-02 10:19:33",
              "score": 8,
              "num_children": 0,
              "author": 67617,
              "replies": []
            },
            {
              "id": "iawymo3",
              "text": "If the jury agreed that Amber lied, lied with malice to harm Johnny's career and character, then essentially what Adam Waldman  said was true. I hope he appeals that decision.",
              "timestamp": "2022-06-02 14:25:02",
              "score": 4,
              "num_children": 1,
              "replies": [
                {
                  "id": "iaxh21x",
                  "text": "The way it looks, I don't think they agreed on that. They only thought she defamed Depp, and still blamed him for what his lawyer said.   \n\n\nI am afraid he would never win a criminal trial, where the burden of evidence is a lot higher and they tend to avoid sentencing women.",
                  "timestamp": "2022-06-02 16:38:22",
                  "score": 0,
                  "num_children": 1,
                  "author": 67617,
                  "replies": [
                    {
                      "id": "iaylbxm",
                      "text": "What the hell are you talking about? They adjudicated that she was lying with malice about being a victim of domestic abuse. That means all the evidence that she presented and so called witnesses, backing her up are lying. But this is not a criminal trial. The only criminal trails should come about the perjury she's committed in three countries now. She lied in Australia and suborned perjury about covering up her  sneaking her dogs into Australia. \nShe lied in the British trail of The Sun newspaper, where she was a witness, not the defendant about donating all her alimony money to charity. The judge in that case even mentioned her donation as evidence of her honesty when ruling in the Sun's favour.\n\nNow here's the trail in the US where she now denies statements she made under oath in her 2016 deposition, and constantly contradicts her own earlier statements in this trial, while insisting that everybody else us lying. \n\nThree countries, potentially three perjury trials. I do hope Virginia does takes action against her obvious and disgraceful lying under oath.",
                      "timestamp": "2022-06-02 21:26:45",
                      "score": 0,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ib1xt24",
                          "text": "That is exactly what I was talking about: since it wasn't a criminal trial, the burden of proof wasn't too rigorous. Now I can totally understand that you already sentenced her, but in a real court I'm afraid it won't be so easy. Not to mention that even though the jury admitted she defamed Depp, they still gave her 2 millions. That's quite a harsh punishment her lies, don't you think? 🤔",
                          "timestamp": "2022-06-03 16:30:20",
                          "score": 1,
                          "num_children": 0,
                          "author": 67617,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iaw8hxq",
      "text": "Ahh yes burn shit down and then blame everyone else for their problems. \n\nStupid\n\nIf you want to burn shit down and think you support the community you're the problem. It doesn't help anyone it hurts everyone.",
      "timestamp": "2022-06-02 10:10:35",
      "score": 13,
      "num_children": 0,
      "author": 340182,
      "replies": []
    },
    {
      "id": "iawf2zn",
      "text": "2022 dating strategy:\n1. \"what did you think about the amber Heard v Jonny Depp trial?\"\n2. \"What do you think about the wage gap?\"\n3. \"What are your thoughts on women being drafted?\"",
      "timestamp": "2022-06-02 11:31:57",
      "score": 12,
      "num_children": 1,
      "author": 74439,
      "replies": [
        {
          "id": "iayctrf",
          "text": "yes.",
          "timestamp": "2022-06-02 20:23:41",
          "score": 4,
          "num_children": 0,
          "author": 131490,
          "replies": []
        }
      ]
    },
    {
      "id": "iawckks",
      "text": "\"the legal system in this country is not meant to protect women\"\n\n[meanwhile](https://www.cnn.com/2020/08/28/us/ronnie-long-nc-wrongful-conviction-trnd/index.html)",
      "timestamp": "2022-06-02 11:03:13",
      "score": 9,
      "num_children": 0,
      "author": 400790,
      "replies": []
    },
    {
      "id": "iaw978p",
      "text": "Says the 200lb woman",
      "timestamp": "2022-06-02 10:20:28",
      "score": 8,
      "num_children": 0,
      "author": 102285,
      "replies": []
    },
    {
      "id": "iawgyco",
      "text": "*sigh* Many of us who are survivors of abuse,female abuse in particular, had visceral reactions to her. The system worked how it is supposed to. This was a civil trial not a criminal one. I’ll give them they are entitled to their opinion but this lot has either not watched any of the trial or are deliberately lying (a little of column A, a little of column B).",
      "timestamp": "2022-06-02 11:52:03",
      "score": 9,
      "num_children": 2,
      "author": 150767,
      "replies": [
        {
          "id": "iayd788",
          "text": " i asked the people i’ve seen defending amber if they watched the trial. they all say no. and then give their dumbass opinion. when they realize they have no ground to stand on they throw in a “they were both abusive” or “ehh i don’t even care about celebrities”. \ninfuriating. why do they want to defend abusers so fucking bad.",
          "timestamp": "2022-06-02 20:26:25",
          "score": 3,
          "num_children": 1,
          "author": 131490,
          "replies": [
            {
              "id": "iayxpbn",
              "text": "True. The jury was mainly male so I’m surprised I haven’t heard about “old white men”. Despite the fact the jury was mostly under 40 and Asian.\n\n\nI’ve heard he yelled and took it out on inanimate objects. I would be yelling too with her BS,not to mention one of the symptoms of ADHD can be mood swings,and I will also do the trashing stuff to release tension.",
              "timestamp": "2022-06-02 23:00:04",
              "score": 2,
              "num_children": 0,
              "author": 150767,
              "replies": []
            }
          ]
        },
        {
          "id": "iawu836",
          "text": "The system worked only after JD showed overwhelming evidence that he, in fact, was abused, not the abuser. Before this trial people just believed AH was abused. She profited from it and he was canceled for it. \n\n&#x200B;\n\n>I’ll give them they are entitled to their opinion but this lot has either not watched any of the trial or are deliberately lying (a little of column A, a little of column B).\n\nAgreed. Personally I think they are blatantly lying to try and get more priviledges.",
          "timestamp": "2022-06-02 13:50:49",
          "score": 3,
          "num_children": 0,
          "author": 131368,
          "replies": []
        }
      ]
    },
    {
      "id": "iawbzqm",
      "text": "Its true, the justice system is designed to objectively weigh up evidence for an against a particular case and allow a jury to make up their mind about the guilt or innocense of an accused based on that evidence. I can't imagine a better basis for a legal system. Imagine being such a despot that you'd want to destroy the foundations of a just system of trial by jury because you aren't able to convince a jury of the validity of your claims. This is the scariest part of the feminist movement because it wants to eradicate one of the pillars of modern democracies and replace it with something completely despotic. If given the opportunity they'd have Stalinist show trials against \"male abusers\" in place of what we have now and the bar for getting a male convicted of domestic violence is already pretty low (at least in my country), if you so much as put a woman in fear that you are going to do something to them without actually doing anything to them you can be convicted of having committed domestic vioence, that can be something as little as raising your voice or saying something bad to a woman. Funny enough I never see these feminists ever say anything about the justice system in places like Iran where the entire system is ACTUALLY explicitely anti-woman, its almost like they don't actually care about oppression of women.  \n\n\nAlso \"justicenopeace\"? Are they really using that hashtag? Like what are they gonna do? Stage a violent inssurection because Amber Heard didn't get her way in court? These people are really mad.",
      "timestamp": "2022-06-02 10:56:21",
      "score": 6,
      "num_children": 0,
      "author": 196510,
      "replies": []
    },
    {
      "id": "iaw8nmf",
      "text": "I thought Incels were the violent ones when they didn't got what they want",
      "timestamp": "2022-06-02 10:12:49",
      "score": 17,
      "num_children": 3,
      "author": 82248,
      "replies": [
        {
          "id": "iaw9us4",
          "text": "These ugly feminists that no one wants to fuck are incels.",
          "timestamp": "2022-06-02 10:29:11",
          "score": 17,
          "num_children": 2,
          "replies": [
            {
              "id": "iawad2y",
              "text": "I believe that too!\n\nI don't see the point for the word femcels.",
              "timestamp": "2022-06-02 10:35:48",
              "score": 8,
              "num_children": 0,
              "author": 82248,
              "replies": []
            },
            {
              "id": "iax4do1",
              "text": "Just tits, no piece",
              "timestamp": "2022-06-02 15:07:57",
              "score": 5,
              "num_children": 0,
              "author": 72416,
              "replies": []
            }
          ]
        },
        {
          "id": "iax98jr",
          "text": "It's always projection with these types.",
          "timestamp": "2022-06-02 15:42:42",
          "score": 3,
          "num_children": 0,
          "author": 213390,
          "replies": []
        },
        {
          "id": "iawyrdd",
          "text": "Incels are not violent. That's just a feminist lie.",
          "timestamp": "2022-06-02 14:26:03",
          "score": 3,
          "num_children": 1,
          "replies": [
            {
              "id": "iax446b",
              "text": "I know 😏 that was sarcasm.",
              "timestamp": "2022-06-02 15:06:00",
              "score": 2,
              "num_children": 1,
              "author": 82248,
              "replies": [
                {
                  "id": "iax4sms",
                  "text": "Didn't sound like it. Only you know what was going on in your head. We can't hear the inflection in your voice as you're writing text in a app. The convention when your are being sarcastic and want to clearly indicate it is to \\s.",
                  "timestamp": "2022-06-02 15:10:58",
                  "score": 4,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iax5ucl",
                      "text": "Thanks for the feedback, I have a long way to go in learning all the reddit nuances",
                      "timestamp": "2022-06-02 15:18:27",
                      "score": 2,
                      "num_children": 0,
                      "author": 82248,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iawhwwn",
      "text": "It’s always the ignorant who are the most violent.",
      "timestamp": "2022-06-02 12:02:01",
      "score": 6,
      "num_children": 0,
      "author": 57877,
      "replies": []
    },
    {
      "id": "iaw6h8z",
      "text": "Good luck with that.",
      "timestamp": "2022-06-02 09:41:36",
      "score": 4,
      "num_children": 0,
      "author": 53714,
      "replies": []
    },
    {
      "id": "iax1whg",
      "text": "What fucks me up about this whole thing is that they are supporting Amber Heard solely on the fact that she is a woman... really? WTF!!\n\nThat is like if I was to \"support\" fucking Jared Fogle or Bill Cosby because they are men, and solely because they are men... regardless of the piece of shit human they are...",
      "timestamp": "2022-06-02 14:49:41",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iax5ary",
      "text": "Damn...poor woman..., the outcome it's most likely because the judge was a man....wait a second! /s",
      "timestamp": "2022-06-02 15:14:36",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaxc0vv",
      "text": "Big surprise. They’ll see a women shoot a man  and justify it. Nothing you can do about brainwashed people.",
      "timestamp": "2022-06-02 16:02:38",
      "score": 3,
      "num_children": 0,
      "author": 281204,
      "replies": []
    },
    {
      "id": "iay0w9x",
      "text": "r/justlearnedthefword energy on the last sentence. But that aside, what the fucking shit?",
      "timestamp": "2022-06-02 18:57:28",
      "score": 4,
      "num_children": 0,
      "author": 165570,
      "replies": []
    },
    {
      "id": "iawip27",
      "text": "Good luck to them. I hope they double down and commit more crimes against men, further driving most men away from interactions with women, let alone relationships. I hope more lying women are destroyed in court.",
      "timestamp": "2022-06-02 12:09:58",
      "score": 8,
      "num_children": 0,
      "author": 65777,
      "replies": []
    },
    {
      "id": "iawtmr9",
      "text": "The Irony because every law & crime statistic, and I mean, EVERY law & crime statistic without exageration, favours women.",
      "timestamp": "2022-06-02 13:46:08",
      "score": 3,
      "num_children": 0,
      "author": 373131,
      "replies": []
    },
    {
      "id": "iax1ndy",
      "text": "\"We wish the legal system ignored evidence of her wrongdoing for the sake of our movement. Even if a man suffers for things he hadn't done that doesn't matter- he's a man.\"",
      "timestamp": "2022-06-02 14:47:49",
      "score": 3,
      "num_children": 0,
      "author": 170208,
      "replies": []
    },
    {
      "id": "iax6656",
      "text": ">Time to burn shit the fuck down.\n\nEasier said than done. Can't wait to see hords of blue hair amazons torching places.....",
      "timestamp": "2022-06-02 15:20:42",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iawk62q",
      "text": "Amber Heard is not only a liar but a bad liar. I don’t understand how anyone can look at her and not get an instant creepy sensation of a psychopath that can behave without remorse in ways a normal person never could.\n\nMore monster than human. Uncanny.\n\nThe fact people can look past that and believe Amber is, well, it’s terrifying.",
      "timestamp": "2022-06-02 12:24:24",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iawmnuz",
      "text": "Report the account on IG for spreading false information/threats of violence hehe",
      "timestamp": "2022-06-02 12:47:40",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaxaa0q",
      "text": "\"Time to burn shit the fuck down.\"\n\nIdk why, but this was the funniest thing about this post,  like a cherry on top of a joke cake.",
      "timestamp": "2022-06-02 15:50:10",
      "score": 4,
      "num_children": 1,
      "author": 124758,
      "replies": [
        {
          "id": "iayhuwo",
          "text": "Lmao ikr, what are they going to do? Complain more on social media, is that \"burning shit the fuck down\"?",
          "timestamp": "2022-06-02 21:00:41",
          "score": 2,
          "num_children": 0,
          "author": 266584,
          "replies": []
        }
      ]
    },
    {
      "id": "iaxw8xf",
      "text": "Lol look up women’s shelters near you on google maps and then look up men’s shelters. That’s telling.",
      "timestamp": "2022-06-02 18:24:24",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iawo6u3",
      "text": "\"time to burn shit down\"\n\nProbably means posting the same crap on Twitter aswell",
      "timestamp": "2022-06-02 13:01:07",
      "score": 2,
      "num_children": 0,
      "author": 284611,
      "replies": []
    },
    {
      "id": "iawqh90",
      "text": "WTF? What stupidity.",
      "timestamp": "2022-06-02 13:20:29",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iawrupd",
      "text": "This made me laugh so hard...",
      "timestamp": "2022-06-02 13:31:50",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iawtjjn",
      "text": "One Starbucks trip later and things are all good",
      "timestamp": "2022-06-02 13:45:25",
      "score": 2,
      "num_children": 0,
      "author": 157551,
      "replies": []
    },
    {
      "id": "iawwjak",
      "text": "All talk. \n\n\nAnd if shit does go down, they'll start whimpering and being the victim at the first sign of resistance to their BS.",
      "timestamp": "2022-06-02 14:09:03",
      "score": 2,
      "num_children": 0,
      "author": 372613,
      "replies": []
    },
    {
      "id": "iax42t9",
      "text": "No simpin’ no piece",
      "timestamp": "2022-06-02 15:05:44",
      "score": 2,
      "num_children": 0,
      "author": 72416,
      "replies": []
    },
    {
      "id": "iaxcr7z",
      "text": "I want to say I'm shocked, but I am not, with how how many \"women's rights\" people have openly flipped back to this \"only women can be victims\" shit.  So surreal to see...",
      "timestamp": "2022-06-02 16:07:51",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaxjqgs",
      "text": "100% BS…This original post is made for people who are entirely propaganda driven and who have no experience with the court system.",
      "timestamp": "2022-06-02 16:56:59",
      "score": 2,
      "num_children": 0,
      "author": 80317,
      "replies": []
    },
    {
      "id": "iaxkei5",
      "text": "They don't even understand who is on trial lol",
      "timestamp": "2022-06-02 17:01:39",
      "score": 2,
      "num_children": 0,
      "author": 186636,
      "replies": []
    },
    {
      "id": "iaxrgyq",
      "text": "Abuse according to Amber Heard supporters;\n\nMan is abusive = he's the abuser.\n\nMan is the victim of abuse = he's the abuser\n\nWoman is the victim of abuse = she's the victim\n\nWoman is the abuser = she's an imperfect victim of abuse",
      "timestamp": "2022-06-02 17:50:34",
      "score": 2,
      "num_children": 0,
      "author": 14714,
      "replies": []
    },
    {
      "id": "iay6lcp",
      "text": "Feminists: We have already made up our minds so do not confuse us with facts and reality.",
      "timestamp": "2022-06-02 19:38:38",
      "score": 2,
      "num_children": 0,
      "author": 350249,
      "replies": []
    },
    {
      "id": "iaycg76",
      "text": "These types of feminist, are literally a disease on society.",
      "timestamp": "2022-06-02 20:20:58",
      "score": 2,
      "num_children": 0,
      "author": 350115,
      "replies": []
    },
    {
      "id": "iayolv6",
      "text": "They don't seem to understand that it was proved that Amber Heard was lying.",
      "timestamp": "2022-06-02 21:51:20",
      "score": 2,
      "num_children": 0,
      "author": 159003,
      "replies": []
    },
    {
      "id": "iayz20e",
      "text": "For years the divorce and child custody cases have been so heavily biased against men it's absurd, but when the same thing happens to them, all of a sudden it's time for civil war 2?\n*Facepalm*",
      "timestamp": "2022-06-02 23:10:28",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iazqkon",
      "text": "Literally 1 in a million case that a man wins in court and they be like \"tHiS pRoVeS the PaTrIaRcHy\"",
      "timestamp": "2022-06-03 02:51:32",
      "score": 2,
      "num_children": 0,
      "author": 250799,
      "replies": []
    },
    {
      "id": "ib064x0",
      "text": "Without lies they have no legitimacy and without violence and abuse no other way of acting. \n\nThis is why I point out that these are some of the main features of anything that uses romanticism (Russeau in particular) as a base assumption.",
      "timestamp": "2022-06-03 05:18:35",
      "score": 2,
      "num_children": 0,
      "author": 73047,
      "replies": []
    },
    {
      "id": "ib8mui1",
      "text": "14 billion years ago women became aware of sexism.  Before the first stars formed.",
      "timestamp": "2022-06-05 10:39:19",
      "score": 2,
      "num_children": 0,
      "author": 227146,
      "replies": []
    },
    {
      "id": "iawijas",
      "text": "If anything this mentality exposes the idiocy of essentialism in feminist perspectives.\n\n\"That man is a rapist, therefore all men are potential rapists.\"\n\n\"Men saw Amber Heard lie about abuse, therefore all women are potential liars about abuse\"\n\nExcept that's not true. Amber Heard is a liar and most women, like most men, are decent people who aren't out to cause harm in the lives of others. Amber didn't do a disservice to women, she did a disservice to herself. The fact that she was an advocate for abused women didn't help her cause. She's not much different from anti-gay Republicans who get caught fucking male prostitutes in that regard. That feminist women are jumping to this train of thought just shows how they evaluate the world they live in by projecting their neurotic fascination with victimhood onto half the population while trying to maintain their crumbling narrative.",
      "timestamp": "2022-06-02 12:08:18",
      "score": 4,
      "num_children": 0,
      "author": 78156,
      "replies": []
    },
    {
      "id": "iawkskm",
      "text": "I'm going to bet that Amber was the hot popular chick in high school that 90% of the woke crowd HATED, but now that they can identify with her crazy and use her to advance their narrative they love her.",
      "timestamp": "2022-06-02 12:30:30",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iaxprim",
      "text": "I agree, there was no justice for Amber.\nThat crazy bitch should have been put in prison.",
      "timestamp": "2022-06-02 17:38:48",
      "score": 2,
      "num_children": 0,
      "author": 141425,
      "replies": []
    },
    {
      "id": "iaxu19b",
      "text": "Ok so now they actually want to fight!!? Well a bunch of women stepped into the ring with men in the army, wrestling, boxing etc and majority of those fights didn’t go well for them..also plenty of women were trying to pass basic training in the army and they had to lower the standards so ridiculously low for just a handful to pass..most just washed out completely and could not pass. Furthermore they are still defending one of the most trash human beings on the planet when the evidence was so heavily stacked against her on just how “shitty” she actually is(pun intended) But now they want to burn shit down and physically start fighting in the streets? Well good luck with that",
      "timestamp": "2022-06-02 18:08:43",
      "score": 2,
      "num_children": 0,
      "author": 310265,
      "replies": []
    },
    {
      "id": "ib00yqu",
      "text": "She literally shitted on his bed and laughed about it. Not to mention the audio of her admitting to hitting him, the finger that sliced off, the FAKE makeup kit. And so on and so on.",
      "timestamp": "2022-06-03 04:22:50",
      "score": 2,
      "num_children": 0,
      "author": 209309,
      "replies": []
    },
    {
      "id": "iawf19r",
      "text": "Correction: “Time to burn shit on the bed”",
      "timestamp": "2022-06-02 11:31:27",
      "score": 1,
      "num_children": 0,
      "author": 193006,
      "replies": []
    },
    {
      "id": "iayp689",
      "text": "Show me some evidence and I'll believe you.",
      "timestamp": "2022-06-02 21:55:39",
      "score": 1,
      "num_children": 0,
      "author": 127684,
      "replies": []
    },
    {
      "id": "ib8d3bh",
      "text": "Bro I don't want kids anymore. 😭",
      "timestamp": "2022-06-05 08:07:40",
      "score": 1,
      "num_children": 0,
      "author": 253059,
      "replies": []
    }
  ]
}