{
  "id": "v620ly",
  "text": "wonder what the difference between our country's are.\n",
  "timestamp": "2022-06-06 12:07:14",
  "score": 4808,
  "subreddit": "t5_3fdcn",
  "num_children": 44,
  "author": 356533,
  "replies": [
    {
      "id": "ibcw8ly",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-06-06 12:07:15",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "ibdf9aj",
      "text": "I mean, Canadians have healthcare.\n\nedit: at least compared to the US",
      "timestamp": "2022-06-06 14:55:21",
      "score": 124,
      "num_children": 4,
      "author": 352348,
      "replies": [
        {
          "id": "ibejf1a",
          "text": "Corrupt cops, guns everywhere, and no health care.  So you get shot due to police incompetence, you suffer the pain, and then are driven to bankruptcy.  Nice country ya got there.",
          "timestamp": "2022-06-06 19:44:24",
          "score": 65,
          "num_children": 0,
          "author": 95338,
          "replies": []
        },
        {
          "id": "ibeohh6",
          "text": "Ehhh, kind of. Canada should not be used as an example for what a good functioning healthcare system looks like. There's lots of problems with healthcare here right now... and housing and like being alive in general.\n\nMental health isn't actually handled very well here at all and recently the most populous province in the country had a general election that resulted in the party that will do absolutely nothing to improve that to be re-elected, so yeah, there's that.",
          "timestamp": "2022-06-06 20:21:36",
          "score": 39,
          "num_children": 2,
          "author": 46258,
          "replies": [
            {
              "id": "ibfod92",
              "text": "Fair, but when compared to healthcare in the US Canada is in a different league.\n\n-An American living in Canada",
              "timestamp": "2022-06-07 01:07:01",
              "score": 29,
              "num_children": 2,
              "author": 400054,
              "replies": [
                {
                  "id": "ibh6z8t",
                  "text": "I can agree.. I am also an American living in Canada, and while it is not perfect, it is nice to know I can go to the hospital without going into debt. This does relieve some of the stress.",
                  "timestamp": "2022-06-07 11:50:51",
                  "score": 3,
                  "num_children": 0,
                  "author": 140892,
                  "replies": []
                },
                {
                  "id": "ibh1dp6",
                  "text": "Being better than the worst in the world isn't exactly something we cheer about. The bare minimum isn't fucking UNIVERSAL.",
                  "timestamp": "2022-06-07 10:42:26",
                  "score": 1,
                  "num_children": 0,
                  "author": 392461,
                  "replies": []
                }
              ]
            },
            {
              "id": "ibg21cn",
              "text": "So just light years ahead. \n\nThe funny part is our complete and utter disaster is desirable when compared to the shit show that is our southern neighbors",
              "timestamp": "2022-06-07 03:04:10",
              "score": 8,
              "num_children": 1,
              "author": 347682,
              "replies": [
                {
                  "id": "ibh1jwy",
                  "text": "No\n\nNot anymore. You live in the WORST in the fucking world. Everything is better than that. \n\nI am sick to death of being told that just because it's better than the shittiest system imaginable that it's good. Get fucking cancer here as a non millionaire, and then tell me that. The ignorant myopia of Americans telling Canadians how great we have it is really fucking old and boring at this point.",
                  "timestamp": "2022-06-07 10:44:51",
                  "score": 1,
                  "num_children": 2,
                  "author": 392461,
                  "replies": [
                    {
                      "id": "ibjt26g",
                      "text": "You're not from around here are you?\n\nAlaska lol?",
                      "timestamp": "2022-06-08 00:05:42",
                      "score": 1,
                      "num_children": 0,
                      "author": 347682,
                      "replies": []
                    },
                    {
                      "id": "icb95p3",
                      "text": "Hate to break it to you but even if you live in say the Central African Republic, if you get terminal cancer, you’re still going to die no matter how much money you have. \n\nYour comment smacks of first world wealthy person problems and you should take a good look at the world as a whole and your thoughts on it young lady.",
                      "timestamp": "2022-06-14 10:09:19",
                      "score": 1,
                      "num_children": 0,
                      "author": 409726,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ibgxm09",
          "text": "Isn’t a mass shooting considered like two or more deaths. So if one person dies it’s not a mass shooting if another person dies it’s a mass shooting. And two hundred murders outside of schools in thirty years isn’t bad so what is the reason to value tens of thousands of murders every couple of years outside of school soooooo much more than a couple hundred in thirty years? Those murders outside of schools also include kids btw, most likely in higher numbers then these school shootings. So if kids are dying in higher numbers but just because they aren’t happening at schools nobody knows about it. I’m led to believe that in general people aren’t aware of how to begin to think about this.",
          "timestamp": "2022-06-07 09:47:33",
          "score": 1,
          "num_children": 1,
          "author": 219708,
          "replies": [
            {
              "id": "ibkbh41",
              "text": "U sure you got the right comment?",
              "timestamp": "2022-06-08 02:42:20",
              "score": 1,
              "num_children": 0,
              "author": 352348,
              "replies": []
            }
          ]
        },
        {
          "id": "ibh1ajh",
          "text": "For now. Dougie and rhe rest of the Cons are selling it off as we speak. You now have to pay $85 out of pocket to get a cancer test. To get a fucking test. Stop thinking Canada has Universal Healthcare anymore. \n\nWe're marginally better than the worst system in the world. Nothing to crow about.",
          "timestamp": "2022-06-07 10:41:16",
          "score": 1,
          "num_children": 1,
          "author": 392461,
          "replies": [
            {
              "id": "ibi38xd",
              "text": "Yeah no ur right. It's just what having SOMETHING looks like. The uk is also dismantling its NHA. Capitalism is a fucking cancer that will end up killing us all and dismantling any sort of successful program that's not profitable,",
              "timestamp": "2022-06-07 16:16:23",
              "score": 1,
              "num_children": 0,
              "author": 352348,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ibd1tfv",
      "text": "I find this person's statistics suspect.\n\nAmerican school shootings [are *far* above 200](https://www.washingtonpost.com/graphics/2018/local/school-shootings-database/).",
      "timestamp": "2022-06-06 13:03:31",
      "score": 285,
      "num_children": 1,
      "author": 177179,
      "replies": [
        {
          "id": "ibdit60",
          "text": "Yeah, we’ve already had 27 this year alone.\n\nhttps://www.npr.org/2022/05/24/1101050970/2022-school-shootings-so-far",
          "timestamp": "2022-06-06 15:22:14",
          "score": 96,
          "num_children": 2,
          "author": 362834,
          "replies": [
            {
              "id": "ibdsgpz",
              "text": "There were a couple years we had a shooting almost everyday. Nearly 360 shootings in one year. I think one year had over 1 a day on average but I can't recall if that's accurate or not.",
              "timestamp": "2022-06-06 16:31:48",
              "score": 26,
              "num_children": 0,
              "author": 326243,
              "replies": []
            },
            {
              "id": "ibdolhi",
              "text": "And yet mass shootings in America barely make a dent on the general murder rate in the USA.",
              "timestamp": "2022-06-06 16:04:08",
              "score": -39,
              "num_children": 1,
              "replies": [
                {
                  "id": "ibduhst",
                  "text": "Your point?",
                  "timestamp": "2022-06-06 16:46:12",
                  "score": 35,
                  "num_children": 3,
                  "author": 379558,
                  "replies": [
                    {
                      "id": "ibdv4nx",
                      "text": "\"Some of you may die, but it's a sacrifice I am willing to make\"",
                      "timestamp": "2022-06-06 16:50:40",
                      "score": 66,
                      "num_children": 0,
                      "author": 303197,
                      "replies": []
                    },
                    {
                      "id": "ibdv8dy",
                      "text": "The NRA and its supporters believe the value of childrens' lives are a distant 2nd to the unfettered right to own assault weapons perhaps?",
                      "timestamp": "2022-06-06 16:51:24",
                      "score": 39,
                      "num_children": 2,
                      "author": 59219,
                      "replies": [
                        {
                          "id": "ibdwtwi",
                          "text": "Bro I'm on your side, this other guy saying \"mass shootings barely make a dent in the national homicide rate\" SOUNDS like he's saying we shouldn't do shit about mass shootings. Maybe I'm reading their comment wrong but that's what I see.",
                          "timestamp": "2022-06-06 17:02:39",
                          "score": 20,
                          "num_children": 1,
                          "author": 379558,
                          "replies": [
                            {
                              "id": "ibe4sku",
                              "text": "I could be wrong but I read it as it’s only a portion of gun violence and the problem is even worse then just school shootings. But I could be wrong.",
                              "timestamp": "2022-06-06 17:59:31",
                              "score": 9,
                              "num_children": 0,
                              "author": 110943,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ibgaidt",
                          "text": "Nope.\n\nI'm saying that mass shootings kill very few people in America compared to other means of murder, let alone other means of death.\n\nIf you put down your emotions for a second and look at the scale of the problem, you will see that they aren't where you should focus.\n\n---\n\nI'm basing this off the stats of ~50 murders **per day** in America, which is about 10 times as many as the amount of people killed in an average school shooting.\n\nSo the 22 school shootings so far this year have killed about as many people as die in **two** average days in the USA.\n\nFeel free to provide better stats.",
                          "timestamp": "2022-06-07 04:26:09",
                          "score": 0,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "idz6iuk",
                              "text": "You’re simplifying things too much. The fact that school shootings only affect children means that those children grow up doing active shooter drills and thinking about getting shot even if nothing ever happens. Every time it’s somewhere else, they’re left with “there is no reason why it’s them and not me. I could be shot to death at school any day.” So in addition to the fact that it’s children being murdered (which is a bigger deal than adults being murdered, sorry it just is), they’re *also* living under threat of death. That alone can cause PTSD and other mental health issues in a more sensitive child. So then that child gets older, and who do you think is at risk for being a perpetrator? If we fix our schools, maybe less children will grow up violent and terrified? Just a thought.",
                              "timestamp": "2022-06-27 20:57:39",
                              "score": 1,
                              "num_children": 1,
                              "author": 15203,
                              "replies": [
                                {
                                  "id": "ie131af",
                                  "text": "> Every time it’s somewhere else, they’re left with “there is no reason why it’s them and not me. I could be shot to death at school any day.\n\nThat's the new's fault for dramatizing them so fucking much.\n\nIts an irrational fear.  Kids are far more likely to die in a car crash or swimming pool, yet we don't see people \"for the children\"-ing them.",
                                  "timestamp": "2022-06-28 07:48:09",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "ieo03zc",
                                      "text": "Do you hear yourself? Children are only upset about other children being targeted for murder because the news told them to be??? In a shooter drill, they’re supposed to put themselves in the mental space that their life is in danger, to figure out what to do. As a child. Then they hear that other children exactly like them have been killed in the same circumstance. If you are a child with empathy, that’s hard to swallow and just be totally fine.",
                                      "timestamp": "2022-07-03 05:39:22",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 15203,
                                      "replies": [
                                        {
                                          "id": "ieojaqb",
                                          "text": "> to figure out what to do.\n\nThat's bad training.\n\n> Then they hear that other children exactly like them have been killed in the same circumstance.\n\nSee how that's the news?\n\nSee how you're using emotional attacks to make something stupidly rare into a big deal?",
                                          "timestamp": "2022-07-03 10:06:38",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ibg9sjj",
                      "text": "Mass shootings are a statistically small problem.\n\nThey grab headlines, which gets people's attention, but if you actually care about the general murder rate, they aren't where you should focus the majority of your time and energy.",
                      "timestamp": "2022-06-07 04:18:41",
                      "score": -7,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ibgmh1w",
                          "text": "people and children are being murdered en masse in schools, parks and grocery stores and because other people are also being killed, it some how negates the importance of mass shootings?\n\n\nam i understanding that correctly.",
                          "timestamp": "2022-06-07 06:54:01",
                          "score": 7,
                          "num_children": 1,
                          "author": 194692,
                          "replies": [
                            {
                              "id": "ibgtql5",
                              "text": "Depends on your priorities.\n\nDo you want less murders in the news, or less murders?",
                              "timestamp": "2022-06-07 08:45:53",
                              "score": -5,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "ibhbpw1",
                                  "text": "Less murders overall. Which you'd think that less access to murder sticks would help with, as well as more access to mental health services and health services in general.",
                                  "timestamp": "2022-06-07 12:39:40",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 2499,
                                  "replies": [
                                    {
                                      "id": "ibhw02v",
                                      "text": "> Less murders overall\n\nMass shootings are a tiny fraction of overall murders, even in the USA.\n\nSo far this year, school shootings have killed about as many people overall as are murdered on average in two days in the USA.\n\nThat's something like 1% of total murder victims are killed in school shootings.  Less if you restrict it to mass shootings (officially reported as >6 deaths, most school shootings don't kill that many people (lots of wounded though))\n\n> Which you'd think that less access to murder sticks would help with\n\nThis is somewhere where intuition is misleading you, because the stats just don't agree with you there.\n\nFinland has just as many people with firearms as America (~50% of households), and nowhere near the murder rate.\n\nAnd Russia has apparently no private gun ownership, and a very high murder rate.\n\nIt's not the guns.\n\nIt's the culture.\n\nThe lack of safety nets.\n\nThe massive inequality.\n\nAnd the fascists.",
                                      "timestamp": "2022-06-07 15:24:00",
                                      "score": 1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "ibi8nk8",
                                          "text": "It's a lot of things, but access to guns is important as well. Finland is an interesting comparison due to their comparatively restrictive gun laws, examples are that it doesn't allow guns with capacities of over 10 bullets in the chamber, only giving guns when there's valid reason (hunting, sports, etc.), licenses can only be issued on a per-gun basis, etc.\n\nDue to these restrictions it makes it very hard to get the type of weaponry needed to make something like what has been happening in the US a consistent issue. After they had problems with school shooters (two comparatively minor cases, but still large news) in 2008 & 2008 they made regulations making it much tougher to acquire the types of weapons used in those shootings as well. Again, in comparison the US has... Stuck to it's guns (for the pun, haha) in terms of ease of access to these sorts of firearms. There's also the comparison of open and concealed carry, which in the US is legal depending on the state, while in Finland it's absolutely not legal, and if you do have a firearm, it must be unloaded.\n\nNow I'm not saying that we face the same issues as Finland, Finland is surrounded by restrictive gun control, and so it's even harder to get illegal weapons in and out of the country. On the other hand, the US has Mexico on the border, which could potentially be bringing more weapons in and out of the country than we know about. I'm not saying immigrants, but illegal shit happens at that border all the time due to government corruption and lack of oversight, guns would absolutely not surprise me.",
                                          "timestamp": "2022-06-07 16:54:23",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 2499,
                                          "replies": [
                                            {
                                              "id": "ibk1akz",
                                              "text": "> It's a lot of things, but access to guns is important as well.\n\nThat's why I included an example of a no-guns, high murder country.\n\nFinland also has conscription, which takes all the magic out of guns, and ensures that everyone is trained to use them safely.  Same with Switzerland, another high guns, low murder country.  And Norway, next on the list after Switzerland for high gun ownership.\n\nThe thing I consistently notice is that the countries with high gun ownership and no problem with it are all much more \"communist\" places to live than America.  Better social security, less inequality, better job security and workers rights, etc...\n\nAnd similar countries to them that don't have guns also have that same low murder rate.\n\nBut countries that are more like America (capitalist hellholes) tend to have a higher murder rate whether or not they have a high number of gun owners.\n\nAll I can conclude from that is that gun access really doesn't effect murder rate all that much, compared to things like social security, inequality, education quality, job security, workers rights, etc...",
                                              "timestamp": "2022-06-08 01:15:50",
                                              "score": 1,
                                              "num_children": 0,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ibdsfpm",
      "text": "I agree with the sentiment, but it's regulation, access to social services and propaganda that differentiates the 2. Canadians have guns, but they require a permit and a background check, and they are viewed as hunting tools or sport gear, very rarely do canadians ever see their firearms primarily as a mean to harm \"criminals\", \"illegal aliens\" and \"the libs\".",
      "timestamp": "2022-06-06 16:31:36",
      "score": 43,
      "num_children": 2,
      "author": 256496,
      "replies": [
        {
          "id": "ibe90by",
          "text": "If you want to legally conceal carry a firearm in the US (outside of Texas and I believe Ohio), you also need a permit, background check, and mandatory training course on the basics of handling a gun and the laws surrounding them.\n\nMuch like in Canada, people that legally conceal carry firearms have a crime rate that is effectively 0",
          "timestamp": "2022-06-06 18:29:40",
          "score": 4,
          "num_children": 1,
          "replies": [
            {
              "id": "iben6eo",
              "text": "Except getting the gun in the first place simply requires to be 18yo, and concealed carry does not require special equipment, just a well-placed and big enough pocket. In Canada, the purchase itself requires 2 permits (one for handling, one for ownership).",
              "timestamp": "2022-06-06 20:12:04",
              "score": 11,
              "num_children": 1,
              "author": 256496,
              "replies": [
                {
                  "id": "ibepqbf",
                  "text": "[deleted]",
                  "timestamp": "2022-06-06 20:30:34",
                  "score": -2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ibflmx2",
                      "text": "I think his point is that you can fairly easily but a gun legally, then hide it it (illegally, but that's not going to stop any school shooters)",
                      "timestamp": "2022-06-07 00:44:11",
                      "score": 5,
                      "num_children": 0,
                      "author": 162738,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "idz6zwh",
          "text": "To be fair, I’ve never met one of the people who view their firearms that way. My whole family shoots for fun and hunts, and they’re primarily scared the government will take ALL their guns and they’ll be bored and also helpless in case of a bear when they go hunting. I’ve tried to explain that it’s not about the hunting guns and they will not listen lol",
          "timestamp": "2022-06-27 21:00:54",
          "score": 1,
          "num_children": 0,
          "author": 15203,
          "replies": []
        }
      ]
    },
    {
      "id": "ibcws9q",
      "text": "Canada doesn't have a gun lobby or a religious worship of guns. Neither do other countries with low crime rates and gun violence stats.",
      "timestamp": "2022-06-06 12:13:09",
      "score": 171,
      "num_children": 5,
      "author": 130813,
      "replies": [
        {
          "id": "ibd919x",
          "text": "[deleted]",
          "timestamp": "2022-06-06 14:06:03",
          "score": 93,
          "num_children": 3,
          "replies": [
            {
              "id": "ibdkodn",
              "text": "That is the people guys. Many of this Christian wish they were as extreme and armed as the Taliban. Theocracy or death is their real motto.",
              "timestamp": "2022-06-06 15:35:51",
              "score": 5,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ibdp4sq",
              "text": "First I like to have a more optimistic outcome.  While I don't believe either party is going to make a change I feel humans may.  But I just like to try and keep thatvin my head and u can def call me crazy cu I probably am.\n\nI do want to say the problem of gun crimes is way worse than justbthe school shootings.  I hear about shootings all the time and people getting killed.  Gang shootings or even isolated city shootings have gone crazy.  This has nothing to do with crazy religion (although it is a very valid point u make) just isn't the only problem.\n\nOn top of stricter gun laws that are actually giving proper funding.  We need to get some sort of task force that will go out and start getting and destroying all the illegally opened weapons.  Qe can't just look at the assault rifles but also handguns.",
              "timestamp": "2022-06-06 16:08:00",
              "score": 8,
              "num_children": 1,
              "author": 406486,
              "replies": [
                {
                  "id": "ibdqt02",
                  "text": "[deleted]",
                  "timestamp": "2022-06-06 16:20:07",
                  "score": 10,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ibe7iye",
                      "text": "No I agree with you this is why it's a shame that all of our politicians keep getting voted in even though they accomplish so little.  But I mean even what we have passed would help with better funding, a better federal database.  Idk just thought.",
                      "timestamp": "2022-06-06 18:19:07",
                      "score": 3,
                      "num_children": 0,
                      "author": 173935,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ibekyvc",
              "text": "Those extremist christians aren't going to give up their guns.\n\nMany of them are cops or cop adjacent.\n\nGun control will only serve to disarm the people they want to kill. They aren't even quiet about it, they've been signaling openly for decades at this point.",
              "timestamp": "2022-06-06 19:55:41",
              "score": -3,
              "num_children": 1,
              "author": 392607,
              "replies": [
                {
                  "id": "ibeyqd9",
                  "text": "[deleted]",
                  "timestamp": "2022-06-06 21:36:46",
                  "score": 9,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "ibf2jh1",
                      "text": "I talked with a Somali before that believed female circumcision was not immoral . It was so ingrained into  her by her culture that it was simply  not removable or at least I couldn’t convince after trying forever . For many in the US that’s how gun culture is . They lack perspective and many don’t know anything but what their culture instilled in them to value. That realization is why I like to hear other perspectives from people that weren’t encased in our culture  like Trevor Noah. \n\nhttps://www.youtube.com/watch?v=DPP0slp3Zkg",
                      "timestamp": "2022-06-06 22:06:16",
                      "score": 1,
                      "num_children": 1,
                      "author": 19321,
                      "replies": [
                        {
                          "id": "ibf2ltg",
                          "text": "Hi, __aijoe__. Your comment contains the word ~~Somalian~~.\n\nThe correct nationality/ethnic demonym(s) for Somalis is __Somali__.\n\nIt's a common mistake so don't feel bad.\n\nFor other nationality demonym(s) check out this website [Here](https://www.nationmaster.com/country-info/stats/People/Nationality/Adjective)\n\n___This action was performed automatically by a bot.___",
                          "timestamp": "2022-06-06 22:06:46",
                          "score": 4,
                          "num_children": 1,
                          "author": 164761,
                          "replies": [
                            {
                              "id": "ibfe8yp",
                              "text": "Haha what an oddly specific niche bot",
                              "timestamp": "2022-06-06 23:41:57",
                              "score": 3,
                              "num_children": 1,
                              "author": 169392,
                              "replies": [
                                {
                                  "id": "ibgdo5q",
                                  "text": "I believe they meant circumcision too. Not circumstance lol.",
                                  "timestamp": "2022-06-07 05:01:34",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 225085,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ibf0q7a",
                      "text": "When you give the police a law to enforce at their discretion, as they do all laws. Cops are overwhelmingly right wing, and have used that discretion consistently over the years to enforce laws more on \"unpopular\" people, like racial and sexual minorities. The same racial and sexual minorities that right wing America has been priming itself to fucking murder by the millions for the last 60 years at least.\n\nSee you say that, but my solution would actually stop this shit. Ensuring access to healthcare, education, food, and housing would so drastically improve the socioeconomic conditions that foster gun violence. Admittedly it's harder to tackle the white supremacy, misogyny, and toxic masculinity that have been showing in all the mass shootings with policy, but the socioeconomic conditions alone would vastly lower gun violence across the board.\n\nBecause people are products of their environment, and people in health environments where they have options don't fucking do this shit.\n\nAnd for the record, background checks would be totally fine once you tackle the systemic racism policing has fostered and given proper oversight. You'd also need to reconcile the many people who are swept up in over policing that would otherwise have gotten a pass if they were a suburban white kid but now have to carry a record around for the rest of their life.",
                      "timestamp": "2022-06-06 21:52:15",
                      "score": 1,
                      "num_children": 1,
                      "author": 392607,
                      "replies": [
                        {
                          "id": "ibf57e7",
                          "text": "[deleted]",
                          "timestamp": "2022-06-06 22:27:19",
                          "score": 0,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ibf5z8z",
                              "text": "Yes, resources will be much better spent on social programs than it will confiscating or buying back even a fraction of the 400 million guns in civilian hands. The basic universal stuff we should have won't be enough to curb this, and the bigger more intrusive gun control measures won't help either.\n\nI'm not sure if you realize this, but the violence of today is mostly happening because everything is broken. We haven't truly addressed any of the major problems of the last century from race issues, economic inequality (which is only getting worse) or even the rampant white supremacy of our society.",
                              "timestamp": "2022-06-06 22:33:28",
                              "score": 3,
                              "num_children": 1,
                              "author": 392607,
                              "replies": [
                                {
                                  "id": "ibfhqge",
                                  "text": "But see if they can keep marginalized folks from buying guns in the face of overwhelming state-sanctioned vigilantism, then the liberals won't have to fix anything!",
                                  "timestamp": "2022-06-07 00:11:26",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 164023,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ibeirnb",
          "text": "We do now, that shit down south is spreading",
          "timestamp": "2022-06-06 19:39:46",
          "score": 5,
          "num_children": 1,
          "author": 95338,
          "replies": [
            {
              "id": "ibf7ure",
              "text": "Word.  Right-wing propaganda in Canada has had an astonishing increase in the last 25 years.",
              "timestamp": "2022-06-06 22:48:43",
              "score": 3,
              "num_children": 1,
              "author": 273302,
              "replies": [
                {
                  "id": "ibfr02t",
                  "text": "Just look at PP with the CPC leadership race",
                  "timestamp": "2022-06-07 01:29:16",
                  "score": 2,
                  "num_children": 0,
                  "author": 151593,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ibe1o1j",
          "text": ">Canada doesn't have a gun lobby\n\n[Yes we do](https://firearmrights.ca)\n\n\n>or a religious worship of guns\n\n[Yes we do.](https://globalnews.ca/news/6964855/canada-gun-ban-details/)\n\n\nIts the fact that guns aren't codified into our basic rights as Canadians.",
          "timestamp": "2022-06-06 17:37:08",
          "score": 10,
          "num_children": 0,
          "author": 311472,
          "replies": []
        },
        {
          "id": "ibh1o9k",
          "text": "We are starting to. Importing it from the South along with literal Trump supporters.",
          "timestamp": "2022-06-07 10:46:24",
          "score": 1,
          "num_children": 0,
          "author": 392461,
          "replies": []
        },
        {
          "id": "ibgap0b",
          "text": "Piggybacking on your comment in that I agree Canada has much saner gun laws. But I do want to note that all these comments with Canadians talking like their shit doesn’t stink is BS. A Canadian extinguished an entire South Asian family running them over. They’re still digging up the bodies of First Nations children. \n\nThank god they don’t have as easy access to guns as we do because the same hate that inspires mass murderers here in the US exists on Canada.",
          "timestamp": "2022-06-07 04:28:10",
          "score": 0,
          "num_children": 0,
          "author": 206556,
          "replies": []
        }
      ]
    },
    {
      "id": "ibe7nk8",
      "text": "As a retired firefighter, I can assure ANY of these idiots suggesting a school ( or any large complex for that matter) have ONE door, are fucking idiots. Might also say as a retired firefighter IF a chemical was annihilating school kids, and I stood outside helpless to do something, I would be the first to protest said chemical. Common sense is NOT common when it comes to the same old crap and the same old deep pocketed NRA.",
      "timestamp": "2022-06-06 18:20:03",
      "score": 15,
      "num_children": 0,
      "author": 295948,
      "replies": []
    },
    {
      "id": "ibd3m0b",
      "text": "[deleted]",
      "timestamp": "2022-06-06 13:19:59",
      "score": 58,
      "num_children": 6,
      "replies": [
        {
          "id": "ibdh7z6",
          "text": "Yeah I get that it’s just that we have 42% of all civilian owned guns worldwide. And many shootings happen the same day as a gun purchase. So even though the problem is complex and the core of the problem is NOT guns, the guns are definitely not helping the problem. I might even argue that guns are the core to the exacerbation of the problem.",
          "timestamp": "2022-06-06 15:10:24",
          "score": 28,
          "num_children": 1,
          "author": 165440,
          "replies": [
            {
              "id": "ibdotmp",
              "text": "Interesting fact:\n\nAmerica has about as many gun **owners** as many other countries.\n\nStats like that are just because gun owners in the USA tend to own more guns that gun owners elsewhere.",
              "timestamp": "2022-06-06 16:05:46",
              "score": 15,
              "num_children": 3,
              "replies": [
                {
                  "id": "ibdtncs",
                  "text": "America also has universal health care, quality mental health services, treats its workers like humans, a sane work-life balance, and functional social safety nets.\n\nWait.",
                  "timestamp": "2022-06-06 16:40:14",
                  "score": 19,
                  "num_children": 0,
                  "author": 360547,
                  "replies": []
                },
                {
                  "id": "ibe8iwn",
                  "text": "In the US, there is approximately 400 million guns or approximately 6 guns per every 5 people in the US, however the average gun owner in the US has 4 or 5 guns. There is only around 80 million gun owners in the US which is significantly higher than many other countries but (I forget the exact stats) per capita the US has roughly the same number of gun owners as other countries.",
                  "timestamp": "2022-06-06 18:26:13",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ibg92dp",
                      "text": "[According to wikipedia ](https://en.wikipedia.org/wiki/Percent_of_households_with_guns_by_country)  America does also have the highest number of gun owners per capita.\n\nBut the second on the list is **Finland** (with almost as many).  Fourth is Switzerland at 75% of America, then Norway and Iceland.\n\nSo the availability of guns doesn't seem to be the issue.",
                      "timestamp": "2022-06-07 04:11:08",
                      "score": 2,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ibff8ov",
                  "text": "Very interesting thanks. I’ll definitely have to be sure to consider that when I’m looking into stats like what I presented. \n\nGotta wonder though is the reason that people have so many guns because we have high accessibility and low to no common sense gun regulations like even a simple waiting period? \n\nI still know that it is more nuanced of an issue because imo the problem is the fetishization of guns and violence along with the alienation of men due to toxic masculinity and other similar factors.",
                  "timestamp": "2022-06-06 23:50:25",
                  "score": 2,
                  "num_children": 1,
                  "author": 165440,
                  "replies": [
                    {
                      "id": "ibg8jwb",
                      "text": "It's certainly a cultural issue.\n\nAnd I can absolutely get behind a reasonable waiting period to discourage impulse-purchasing of firearms.\n\nI can believe that would have a significant impact on the suicide rate.",
                      "timestamp": "2022-06-07 04:05:46",
                      "score": 2,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ibe7t0s",
          "text": "What are you talking about though?\n\nThe retort by right wing media in America is \"It's not the guns\" they literally say that word for word.  This guy tweeted his reasoning and then answered that response with his own that says \"it's the guns\".  How is this a solution? It's an answer to people giving the same answer every time when they're asked \"what can be done\".  The simplest answer is \"no it is bc this:\" which is what the author of the tweet did.  \n\n\nOf course having functioning social services that are paid for by the government and a society who respects social services, is required before social services can make a diff in the life of a populace.  That's logical.",
          "timestamp": "2022-06-06 18:21:07",
          "score": 2,
          "num_children": 0,
          "author": 280163,
          "replies": []
        },
        {
          "id": "ibdxmfq",
          "text": "Yeah. There's a long wait, but you can still buy what the media calls \"assault rifles\" there too",
          "timestamp": "2022-06-06 17:08:17",
          "score": 5,
          "num_children": 1,
          "author": 104318,
          "replies": [
            {
              "id": "ibe21og",
              "text": "Like yeah; but not specifically any inspired by the AR, at least, if it still tries to maintain it's AR 'history' (fun fact for anyone who doesn't know, AR doesn't stand for Assault Rifle, but it stands for ArmaLite Rifle; the company that first made it)",
              "timestamp": "2022-06-06 17:39:49",
              "score": 0,
              "num_children": 0,
              "author": 311472,
              "replies": []
            }
          ]
        },
        {
          "id": "iben6mr",
          "text": "And they value education. And they fund the arts. They have a culture that is more generous and humble. They also like to say they’re sorry from what I hear, while many Americans seem to have a real problem admitting fault.",
          "timestamp": "2022-06-06 20:12:07",
          "score": 2,
          "num_children": 0,
          "author": 251521,
          "replies": []
        },
        {
          "id": "ibed4hi",
          "text": "there is a lot to it. \n\nit's not as if illegal guns are unobtainable here. it's that we view that escalation as, well, an escalation. not a god given right. nor do we typically worry about _someone else_ having a gun and then needing to defend against that. \n\ni view it similarly to how cars have gradually increased in size because of \"safety\" over the years. small cars are plenty fucking safe until you get t-boned by some 5 ton SUV land-yacht. now everyone needs a massive car to feel safe.",
          "timestamp": "2022-06-06 18:59:20",
          "score": 1,
          "num_children": 0,
          "author": 234202,
          "replies": []
        },
        {
          "id": "ibe6e6i",
          "text": "With regards to rifles, canada actually has *looser* gun laws than significant portions of the US. If anything, Canada is a counterargument.",
          "timestamp": "2022-06-06 18:10:56",
          "score": -4,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ibelhz2",
      "text": "It's the guns... and the vehemently oppressive and powerful white Christian nationalists who have been steadily growing in power since the Nixon administration's Southern Strategy, which was the brainchild of Lee Atwater, a piece of shit grifter who shape-shifted and grifted right up until his stupid fucking death. They created a \"culture war\" in America that has stark parallels to the decades leading up to the American Civil War. They are anti-human fascists, and all of this is exactly what they want, the sick fucks.",
      "timestamp": "2022-06-06 19:59:36",
      "score": 8,
      "num_children": 0,
      "author": 10785,
      "replies": []
    },
    {
      "id": "ibf30lq",
      "text": "It's not just the guns, it's the gun culture. Canada has plenty of guns. What Canada doesn't have is a society that's encouraged people to solve their problems with violence for 20+ years so one party could win elections w/o providing solutions to those problems.",
      "timestamp": "2022-06-06 22:10:00",
      "score": 5,
      "num_children": 0,
      "author": 20553,
      "replies": []
    },
    {
      "id": "ibfi542",
      "text": "Canada just has fewer rightwing idiots",
      "timestamp": "2022-06-07 00:14:50",
      "score": 7,
      "num_children": 1,
      "author": 292716,
      "replies": [
        {
          "id": "ibfq64y",
          "text": "We still have our share per capita. If the trucker convoy didn’t make that clear, nothing will. \n\nBut access to guns is the big difference.",
          "timestamp": "2022-06-07 01:22:11",
          "score": 6,
          "num_children": 1,
          "author": 147442,
          "replies": [
            {
              "id": "ibg8mhs",
              "text": "nah i know, one of my best friends is canadian and we talk politics all the time. unfortunately y’all do have a lot of those types, obviously we just have more.",
              "timestamp": "2022-06-07 04:06:31",
              "score": 2,
              "num_children": 0,
              "author": 292716,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ibe72z1",
      "text": "We know it's the guns. \n\nThe problem is the politicians that don't care about dead children as long as they can line their pockets with that sweet gun lobby money.",
      "timestamp": "2022-06-06 18:15:54",
      "score": 5,
      "num_children": 0,
      "author": 407247,
      "replies": []
    },
    {
      "id": "ibfhvzn",
      "text": "a lot of it is also cultural; everyone seems to think that north america is a monoculture, but there are actually huge differences in values and the minutiae of everyday interactions that do influence society as a whole. we are still individualists to a degree, but there *is* a stronger sense of collectivism pervading the canadian idea of what a society should look like, and it affects how we interact with others.\n\ngranted, american right wing influence has been eroding that in the past few decades, but it's still there. \n\nPS: we also have to apply to get a **federal** license to even purchase a gun, and that is a two week course. if you want to buy most handguns and \"ar-style\" weapons, it's another two week course for a \"restricted\" license.",
      "timestamp": "2022-06-07 00:12:42",
      "score": 4,
      "num_children": 0,
      "author": 32066,
      "replies": []
    },
    {
      "id": "ibdl6mf",
      "text": "ButButBut if you adjust for population…\n\nCanada STILL has only a small fraction of the number of school shootings that the US does.\n\n(just heading off the inevitable attempt at refuting this fact)",
      "timestamp": "2022-06-06 15:39:32",
      "score": 11,
      "num_children": 0,
      "author": 408011,
      "replies": []
    },
    {
      "id": "ibduln0",
      "text": "Health care plays a bigger part than people realize",
      "timestamp": "2022-06-06 16:46:58",
      "score": 6,
      "num_children": 1,
      "author": 381979,
      "replies": [
        {
          "id": "ibh1qr0",
          "text": "It really doesn't. If that was the case, Ontario should be seeing a massive uptick in shootings.",
          "timestamp": "2022-06-07 10:47:19",
          "score": 0,
          "num_children": 0,
          "author": 392461,
          "replies": []
        }
      ]
    },
    {
      "id": "ibdt0n1",
      "text": "The important differences here: less guns, better mental care, better schools with better help systems for struggling kids, and anyone that does own a gun for whatever reason is more responsible with it then most of their American counter parts. If we changed even one of those things we could drastically reduce the number of dead kids, instead we wallow arround over \"muh freedoms to a well regulated millitia\", like I can see your gut Dave everyone can, you're not a well regulated militia by any means, and continue to gut investment into public education.",
      "timestamp": "2022-06-06 16:35:46",
      "score": 3,
      "num_children": 1,
      "author": 326243,
      "replies": [
        {
          "id": "ibfldlx",
          "text": "It's real cool that liberals are so eager to prevent the targets of right-wing violence from attaining the tools of self-defense. Do they think the cops are going to protect any of us?",
          "timestamp": "2022-06-07 00:42:01",
          "score": 0,
          "num_children": 1,
          "author": 164023,
          "replies": [
            {
              "id": "ibfosrk",
              "text": "Not a liberal. I provided several options. At this point I don't care which one the bootlickers settle on just as long as there's less dead kids.",
              "timestamp": "2022-06-07 01:10:35",
              "score": 2,
              "num_children": 0,
              "author": 326243,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iberbje",
      "text": "But muh freedumbs.",
      "timestamp": "2022-06-06 20:42:06",
      "score": 3,
      "num_children": 0,
      "author": 245593,
      "replies": []
    },
    {
      "id": "ibg89gd",
      "text": "Canada has similar rates of gun ownership. it's right wing fear mongering/ a general culture of white supremacy",
      "timestamp": "2022-06-07 04:02:48",
      "score": 3,
      "num_children": 0,
      "author": 37084,
      "replies": []
    },
    {
      "id": "ibd7u1j",
      "text": "Michael Moore's \"Bowling for Columbine\" had this same take in 2002.",
      "timestamp": "2022-06-06 13:56:22",
      "score": 5,
      "num_children": 0,
      "author": 45404,
      "replies": []
    },
    {
      "id": "ibd1kbw",
      "text": "Hey Buddeh,\n\nIt's not a competition!\n\nSincerely, Ameritards/s",
      "timestamp": "2022-06-06 13:01:09",
      "score": 3,
      "num_children": 0,
      "author": 309190,
      "replies": []
    },
    {
      "id": "ibegtqg",
      "text": "Canada has universal healthcare.... Just saying",
      "timestamp": "2022-06-06 19:25:44",
      "score": 2,
      "num_children": 0,
      "author": 248081,
      "replies": []
    },
    {
      "id": "ibg1wcm",
      "text": "Its a weird argument because everyone knows its true just that they are locked into some weird war set up by larger forces.",
      "timestamp": "2022-06-07 03:02:54",
      "score": 2,
      "num_children": 0,
      "author": 347682,
      "replies": []
    },
    {
      "id": "ibg8rgw",
      "text": "god i wish i were canadian",
      "timestamp": "2022-06-07 04:07:56",
      "score": 2,
      "num_children": 0,
      "author": 34264,
      "replies": []
    },
    {
      "id": "ibdktkv",
      "text": "Oh come on. Canada has easy access to healthcare and mental health care. \n\nDude is leaving out *extremely relevant information* here to try to make a point. \n\nPretty sure access to mental healthcare is a pretty critical component in addressing mental health issues.",
      "timestamp": "2022-06-06 15:36:53",
      "score": 9,
      "num_children": 4,
      "author": 362986,
      "replies": [
        {
          "id": "ibdqmch",
          "text": "Another thing that seems to make a big difference is proper training.\n\nI like the examples of Finland and Switzerland here, because they both have a similar proportion of civilian gun ownership, much lower crime and homicide rates, and they both have conscription.  Which means that the vast majority of their population is trained with firearms to a basic military grade.\n\nTaking the magic and sparkle away from guns and turning them into just another tool in the box probably goes a long way.\n\nThey also both have damned good public healthcare, and much lower inequality than elsewhere.  (I think Finland even has a law about the maximum pay difference between employees within a company?)",
          "timestamp": "2022-06-06 16:18:47",
          "score": 5,
          "num_children": 2,
          "replies": [
            {
              "id": "ibe04o8",
              "text": "Finland also has the highest ranked education system in the world. Their teachers are way more trained than anywhere else, only the best are accepted into teachers college, and they're paid like prestigious position that they are.",
              "timestamp": "2022-06-06 17:26:11",
              "score": 7,
              "num_children": 1,
              "replies": [
                {
                  "id": "ibg9n6m",
                  "text": "Yeap.\n\nI'd move to Finland if the language wasn't so damned hard.",
                  "timestamp": "2022-06-07 04:17:07",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ibenjpl",
              "text": "It’s not just the training. \n\nIt’s cultural. But accepting that America has a cultural issue with anger and violence means introspection on a national scale. It means everyone (yes even people without guns) needs to consider that they may have contributed to a societal problem. \n\nBut nobody will do that. So the problems persist. \n\nThink about how many Karen videos you see these days. Road rage. People yelling at drive thru workers. \n\nAmerica’s problems are not caused by guns.",
              "timestamp": "2022-06-06 20:14:45",
              "score": 3,
              "num_children": 0,
              "author": 362986,
              "replies": []
            }
          ]
        },
        {
          "id": "ibds7sy",
          "text": "Not every mass shooter is mentally ill.",
          "timestamp": "2022-06-06 16:30:02",
          "score": 2,
          "num_children": 1,
          "author": 140501,
          "replies": [
            {
              "id": "ibe9lv2",
              "text": "Not all of them, but almost all of them are mentally ill",
              "timestamp": "2022-06-06 18:33:55",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ibebbsw",
                  "text": "[citation needed]",
                  "timestamp": "2022-06-06 18:46:17",
                  "score": 1,
                  "num_children": 0,
                  "author": 140501,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ibe2df9",
          "text": ">Canada has easy access to healthcare and mental health care\n\nSpotted the non Canadian :P\n\n\nWhile yes, we have *free* access to these services, they are not easy to get (dependent on province) \n\n\nLike for example; to get a therapist, is a 8-16 week wait in my area, unless I'm admitted to a mental health institution. \n\nAn ambulance is a 24 hour wait. I'm not even kidding. \n\n\nGo to emergency? You're waiting for 10-15 hours. \n\n\nAnd good luck finding a doctor, when all the clinics are full and aren't taking new patients. \n\n\n\nIn theory, we've got access to those services. But we don't. Heck; I've even had to pay out of pocket for medical imaging because I forgot to 'reactivate' my health card after I turned 18. Our system is streets ahead of the US one; but it still has it's massive flaws, and access to some services isn't easy, nor quick. Heck, I've been visiting family in small towns, and gotten injured, and I didn't go to the hospital for almost a week since it was a 3 hour drive away, and the doctor for the town only came once a month on his rotation of the small towns in the area.",
          "timestamp": "2022-06-06 17:42:06",
          "score": 0,
          "num_children": 4,
          "author": 311472,
          "replies": [
            {
              "id": "ibecj5w",
              "text": "I've never experienced any of the stuff you listed. Could just be a rural area thing? I live in Toronto and have never waited longer than an hour for an ambulance. Got a therapist session booked within a week. Went to a walk in for some stomach issues the other day because my family doctor wasn't open. Was about 10 min wait, did a physical and wrote me a script. All free.",
              "timestamp": "2022-06-06 18:55:03",
              "score": 4,
              "num_children": 1,
              "author": 296732,
              "replies": [
                {
                  "id": "ibecmgz",
                  "text": "Probably more of a western province thing; I live in Alberta for reference, but me waiting almost a week for the hospital 100% was a rural thing, combined with Saskatchewans lacklustre ambulance responses. I know they have a ton of the same issues we do; albeit a bit better. We sure do love our conservative governments who ruin our healthcare out here.",
                  "timestamp": "2022-06-06 18:55:44",
                  "score": 1,
                  "num_children": 1,
                  "author": 311472,
                  "replies": [
                    {
                      "id": "ibed58v",
                      "text": "Well doug Ford wants to add private health care to Ontario so we might join you soon.",
                      "timestamp": "2022-06-06 18:59:30",
                      "score": 3,
                      "num_children": 1,
                      "author": 296732,
                      "replies": [
                        {
                          "id": "ibedgwk",
                          "text": "My condolences. I hope that doesn't happen, I sincerely do. Privatization of our healthcare services here has absolutely ruined it, and are the direct causes of the problems I listed in my original comment.\n\nSure; we still don't pay for it. But the services provided are just.... shitty. Profit over help here.",
                          "timestamp": "2022-06-06 19:01:51",
                          "score": 1,
                          "num_children": 0,
                          "author": 311472,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ibg9dti",
              "text": "Are these Alberta specific because healthcare is at a provincial level and isn’t the same country wide right.\n\nEdit: I see you live in rural Alberta that makes sense then. It’s similar in very rural areas in BC especially the further north you go.",
              "timestamp": "2022-06-07 04:14:25",
              "score": 3,
              "num_children": 1,
              "author": 393885,
              "replies": [
                {
                  "id": "ibg9ld6",
                  "text": "Yeah, as i said, literally first paragraph, dependant on province. And I live in Edmonton..... definitely not rural alberta lmao. If it was rural alberta, we wouldn't even have a clinic, and getting an ambulance would literally be a pipe dream like winning the lottery.",
                  "timestamp": "2022-06-07 04:16:36",
                  "score": 1,
                  "num_children": 1,
                  "author": 311472,
                  "replies": [
                    {
                      "id": "ibgbhtw",
                      "text": "Wow",
                      "timestamp": "2022-06-07 04:36:58",
                      "score": 1,
                      "num_children": 1,
                      "author": 393885,
                      "replies": [
                        {
                          "id": "ibifvp1",
                          "text": "It frigging sucks here in alberta. I hear Saskatchewan has a few of the same issues too.",
                          "timestamp": "2022-06-07 17:44:55",
                          "score": 1,
                          "num_children": 0,
                          "author": 311472,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "iben2n9",
              "text": "That’s nice. \n\nBreaking your arm in America could bankrupt you. Waiting time or not. \n\nTell me again about stress.",
              "timestamp": "2022-06-06 20:11:18",
              "score": 2,
              "num_children": 0,
              "author": 362986,
              "replies": []
            },
            {
              "id": "ibeba3w",
              "text": ">An ambulance is a 24 hour wait. I'm not even kidding.\n\nI have to be honest here... This sounds made up. There is absolutely no way that is an average, a mode, or a median. If anyone has ever had to wait that long for an ambulance it's an extreme outlier.\n\nThis really sounds like it was written by an American who watches too much Fox news and wanted to pretend to show what happens in countries with free health care.",
              "timestamp": "2022-06-06 18:45:56",
              "score": 2,
              "num_children": 1,
              "author": 365515,
              "replies": [
                {
                  "id": "ibebuwp",
                  "text": "you can literally just google \"Alberta ambulance\" and read the news about how our EMS system is failing. I can guarantee you I'm not bullshitting lmao. And I don't watch fox. I'm actually a liberal as fuck Albertan dude....\n\nOur healthcare isn't actually a failing of Canada tbh, while the situation is the same in other provinces, it's actually a provincial issue. Our current conservative government has absolutely incapacitated our healthcare system, and it's been happening for ~40 years. \n\nI love our healthcare system, when it works. But it doesn't work when provincial governments do everything in their power to make it not work. I know  my original comment is disparaging, and it may be hard to believe, but I do support having publicly funded healthcare. It just sucks on a provincial basis.",
                  "timestamp": "2022-06-06 18:50:10",
                  "score": 3,
                  "num_children": 0,
                  "author": 311472,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ibejvxn",
          "text": "We don’t. It is very difficult to get access to mental health resources without paying. \n\nBut I also don’t think it’s about guns. It’s a cultural thing. Guns play a part in it but idk about the cause and effect. Like if Canada got American gun laws I don’t think we’d see your level of violence especially wrt school shootings.",
          "timestamp": "2022-06-06 19:47:47",
          "score": 1,
          "num_children": 1,
          "author": 259208,
          "replies": [
            {
              "id": "ibemxgy",
              "text": "How much do you pay to go to the doctor?\n\nIs it zero? \n\nBecause I’m pretty sure it’s zero. Pay for parking, maybe.",
              "timestamp": "2022-06-06 20:10:14",
              "score": 2,
              "num_children": 1,
              "author": 362986,
              "replies": [
                {
                  "id": "ibenhni",
                  "text": "Depends what you go for. I also don’t think that 18 year old men are shooting up schools because when they get cancer in 60 years they will have to pay.",
                  "timestamp": "2022-06-06 20:14:20",
                  "score": 2,
                  "num_children": 0,
                  "author": 259208,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ibd8xm9",
      "text": "If you look at the bigger picture, this claim doesn't make much sense.\n\nOf the top-10 countries for gun ownership (per capita rate), only 2 countries (US and Canada) have any school shootings at all. (Falkand Islands, Yemen, New Caledonia, Montenegro, Serbia, Uruguay, Cyprus, Finland have a combined total of 0 as far as I can find)\n\nCountry ranked #2 for school shootings is Mexico, which is ranked #60 for gun ownership\n\n\\#3 is South Africa, ranked #89 for gun ownership.\n\n\\#4 is India, ranked #120 for gun ownership\n\n\\#5 is Nigeria, ranked #150 for gun ownership\n\n\\#6 is Pakistan, ranked #24 for gun ownership\n\n\\#7 is Afghanistan, ranked #63 for gun ownership\n\n\\#8 is Canada, ranked #7 for gun ownership.\n\nIf gun ownership was the major factor, we'd expect to see at least some sort of relation between the two rates, instead of this random mix.",
      "timestamp": "2022-06-06 14:05:15",
      "score": 11,
      "num_children": 8,
      "author": 101341,
      "replies": [
        {
          "id": "ibdae94",
          "text": "Or maybe this just shows literally everyone else besides Americans have more responsible gun owners.",
          "timestamp": "2022-06-06 14:17:04",
          "score": 25,
          "num_children": 2,
          "author": 233094,
          "replies": [
            {
              "id": "ibdgv4e",
              "text": "Yeah, the problem is Americans.",
              "timestamp": "2022-06-06 15:07:38",
              "score": 20,
              "num_children": 1,
              "author": 71406,
              "replies": [
                {
                  "id": "ibdqdvp",
                  "text": "We should start killing Americans. Wait a second...",
                  "timestamp": "2022-06-06 16:17:04",
                  "score": 8,
                  "num_children": 2,
                  "author": 384379,
                  "replies": [
                    {
                      "id": "ibduy7e",
                      "text": "Don't worry, we're clearly taking care of that ourselves.  We'll keep you on standby in case we need help.",
                      "timestamp": "2022-06-06 16:49:24",
                      "score": 1,
                      "num_children": 0,
                      "author": 106688,
                      "replies": []
                    },
                    {
                      "id": "ibdyivt",
                      "text": "They're working on it better than anyone else ever could hope.",
                      "timestamp": "2022-06-06 17:14:44",
                      "score": 2,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ibdbk8h",
              "text": "Mexico has some of the most restrictive gun laws in the entire world. There's only 2 gun stores in the entire country, the permit process is onerous (and requires the gov't to deem you responsible enough to own a gun), all must be registered, and there's severe restrictions on what can be owned.\n\nIf all that regulation and responsibility made a difference, they wouldn't be #2, would they?",
              "timestamp": "2022-06-06 14:26:25",
              "score": -13,
              "num_children": 2,
              "author": 101341,
              "replies": [
                {
                  "id": "ibdc7dz",
                  "text": "Mexican cops and their justice system are notoriously corrupt, laws without proper enforcement render even the most stringent prohibitions irrelevant if nothing done about how guns are sourced by criminals.  But unlike Mexico, in America it's never about gun control because Godforbid we stop selling guns, it's gun access.  Just go to a gun show.",
                  "timestamp": "2022-06-06 14:31:36",
                  "score": 16,
                  "num_children": 1,
                  "author": 233094,
                  "replies": [
                    {
                      "id": "ibdp3n6",
                      "text": "Yup. It's unregulated access and the number of available weapons. \n\nBut lets face facts here. Every time one of these things happen in Texas, they LOOSEN gun restrictions. \n\nThis problem isnt solvable right now. Everyone, even the gun worshipers, knows how to solve it effectively. \n\nWhat isnt solvable is that it's a political football and neither side is going to budge. Its about profits and not letting the other side win. And dead children dont move the needle. \n\nThere is no sense of shame for people defending the right to continue along this path without severe restrictions at a minimum. And because there is no sense of shame, there will be nothing done.",
                      "timestamp": "2022-06-06 16:07:47",
                      "score": 2,
                      "num_children": 0,
                      "author": 31888,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ibdxk7j",
                  "text": ">If all that regulation and responsibility ***were the only factors that*** made a difference, they wouldn't be #2, would they?\n\nFixed it.",
                  "timestamp": "2022-06-06 17:07:50",
                  "score": 4,
                  "num_children": 0,
                  "author": 246718,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ibdxezm",
          "text": ">If gun ownership was the major factor, we'd expect to see at least some sort of relation between the two rates, instead of this random mix.\n\nIt's not the major factor.  The US has 25x the fatality rate for guns as other countries.  The thing that makes us different--we're the only nation in the WORLD which doesn't mandate gun reform on a nationwide (or Federal) level.",
          "timestamp": "2022-06-06 17:06:49",
          "score": 8,
          "num_children": 0,
          "author": 246718,
          "replies": []
        },
        {
          "id": "ibdrekc",
          "text": "To talk about either of these ranking lists without acknowledging the huge disparity between the US and the nearest other countries is disingenuous at best. In terms of gun ownership the US is about 200% ahead of its next closest country. For school shootings they are about 3600% ahead. Please do feel free to check my maths on this, but trying to equate these statistics really seems like deliberate misinformation.",
          "timestamp": "2022-06-06 16:24:13",
          "score": 4,
          "num_children": 1,
          "author": 180508,
          "replies": [
            {
              "id": "ibe69gc",
              "text": "They probably shouldn't be equated for a lot of reasons. You would have to look at the not just shootings per capita, but shootings per student if ratio to student/nonstudent is very different or number of students per school is wildly different. Then you have to make sure your sources use the same criteria.  There's a large \"school shooting\" list out there (not saying this is were you got yours necessarily) that includes things like two people getting into fight on the sidewalk out front and gun going off while the school is closed with no deaths. Does the other countries list also includes those types of incidents? Etc etc.",
              "timestamp": "2022-06-06 18:09:58",
              "score": 1,
              "num_children": 0,
              "author": 176993,
              "replies": []
            }
          ]
        },
        {
          "id": "ibe90um",
          "text": "There’s obviously other factors that influence shootings beyond gun ownership, but this framing is deceptive. Mexico has had 8 school shootings since 2009 while the US has had 288. Despite being #2 the numbers aren’t even close.",
          "timestamp": "2022-06-06 18:29:46",
          "score": 4,
          "num_children": 0,
          "author": 318945,
          "replies": []
        },
        {
          "id": "ibdsknm",
          "text": "But what is the difference between #1 in school shootings and #3-10? \n\nAnd it isn’t just “gun ownership”, it is ease of access to guns and guns in circulation. The US outstrips any developed country in those two categories by a wide margin.",
          "timestamp": "2022-06-06 16:32:36",
          "score": 11,
          "num_children": 0,
          "author": 140501,
          "replies": []
        },
        {
          "id": "ibdbspx",
          "text": "> Yemen\n\nNo school shootings, but America exports bus bombs there.",
          "timestamp": "2022-06-06 14:28:20",
          "score": 3,
          "num_children": 0,
          "author": 54201,
          "replies": []
        },
        {
          "id": "ibepusx",
          "text": "Lol Mexico? We had one school shooting in 2017, that's it.",
          "timestamp": "2022-06-06 20:31:29",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ibd9nh9",
          "text": "But these stats don't fit the narrative...",
          "timestamp": "2022-06-06 14:11:03",
          "score": -19,
          "num_children": 1,
          "author": 181224,
          "replies": [
            {
              "id": "ibdeqmg",
              "text": "[deleted]",
              "timestamp": "2022-06-06 14:51:21",
              "score": 3,
              "num_children": 1,
              "replies": [
                {
                  "id": "ibdp8sc",
                  "text": "Finland and Switzerland have just as high a rate of civillian gun ownership as the USA.\n\nPlus about half of Swiss households have a military-grade combat rifle in their cupboard.",
                  "timestamp": "2022-06-06 16:08:49",
                  "score": -6,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "ibdxpio",
                      "text": "...as well as a ton of regulations and training courses before you can have that rifle in your cupboard.",
                      "timestamp": "2022-06-06 17:08:54",
                      "score": 6,
                      "num_children": 1,
                      "author": 246718,
                      "replies": [
                        {
                          "id": "ibg9eq1",
                          "text": "But those training courses are part of your regular education, not something special.",
                          "timestamp": "2022-06-07 04:14:40",
                          "score": 0,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ibgfabx",
                              "text": "Exactly.  Which is why comparing them to the US is apples & oranges.",
                              "timestamp": "2022-06-07 05:20:17",
                              "score": 2,
                              "num_children": 1,
                              "author": 246718,
                              "replies": [
                                {
                                  "id": "ibghmez",
                                  "text": "Yeah, very difference cultures.\n\nSame rate of gun ownership.",
                                  "timestamp": "2022-06-07 05:49:07",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "ibgoxgt",
                                      "text": "Cats and horses also have the same # of legs.",
                                      "timestamp": "2022-06-07 07:30:25",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 246718,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ibe2f0f",
                      "text": "They absolutely do not. 'Rate of gun ownership' is an easily found and easily measured statistic. You are referring to the percentage of households with at least a single firearm. \n\nYou are repeating this statistic in a deliberately misleading way. \n\nIn terms of rate of civilian gun ownership, straight numbers of guns and ratio of registered to unregistered guns,  America are massively ahead of any other country in the world. There are way, way more civilian- owned guns in America than anywhere else. How is this even up for debate?",
                      "timestamp": "2022-06-06 17:42:24",
                      "score": 2,
                      "num_children": 1,
                      "author": 180508,
                      "replies": [
                        {
                          "id": "ibg9at8",
                          "text": "Because it's not a good metric for how easy it is to get hold of a gun.\n\nPercentage of households with at least a single firearm is a better measure for how many gun *owners* there are.\n\nI don't think it matters much if someone has 1 or 5 firearms.  Why do you?",
                          "timestamp": "2022-06-07 04:13:32",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ibdxzsm",
      "text": "It's definitely the guns, but it's not only that, it's 's the culture. American culture is rotten to the core and the nation is in it's dying stages.",
      "timestamp": "2022-06-06 17:10:56",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ibfhr7e",
      "text": "The number of shootings per capita would be a much more honest and representative statistic.",
      "timestamp": "2022-06-07 00:11:36",
      "score": 2,
      "num_children": 1,
      "author": 334253,
      "replies": [
        {
          "id": "ibfzkjc",
          "text": "In 2020 the United States had a firearm related homicide rate of [6.1 per 100,000 people](https://www.aljazeera.com/amp/news/2022/5/10/us-firearm-homicides-hit-highest-rate-in-decades-in-2020-cdc)\n\nIn 2020 Canada had a firearm related homicide rate of [0.73 per 100,000 population.](https://www150.statcan.gc.ca/n1/pub/85-002-x/2021001/article/00017-eng.htm) (this is higher than usual due to[ Canada’s deadliest ever mass shooting](https://en.wikipedia.org/wiki/2020_Nova_Scotia_attacks) happening in early 2020)",
          "timestamp": "2022-06-07 02:42:16",
          "score": 4,
          "num_children": 1,
          "author": 354490,
          "replies": [
            {
              "id": "ibfzll9",
              "text": "It looks like you shared an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.aljazeera.com/news/2022/5/10/us-firearm-homicides-hit-highest-rate-in-decades-in-2020-cdc](https://www.aljazeera.com/news/2022/5/10/us-firearm-homicides-hit-highest-rate-in-decades-in-2020-cdc)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
              "timestamp": "2022-06-07 02:42:30",
              "score": 1,
              "num_children": 0,
              "author": 301704,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ibe8eae",
      "text": "*countries\n\nYou don't use an apostrophe to make a word plural.",
      "timestamp": "2022-06-06 18:25:19",
      "score": 0,
      "num_children": 0,
      "author": 37248,
      "replies": []
    },
    {
      "id": "ibd1ux6",
      "text": "[deleted]",
      "timestamp": "2022-06-06 13:03:53",
      "score": -15,
      "num_children": 2,
      "replies": [
        {
          "id": "ibd4bw5",
          "text": "[deleted]",
          "timestamp": "2022-06-06 13:26:21",
          "score": 5,
          "num_children": 2,
          "replies": [
            {
              "id": "ibdpavm",
              "text": "> he right to self defense.\n\nRight to **effective** self defence.",
              "timestamp": "2022-06-06 16:09:14",
              "score": 3,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ibdk6zn",
              "text": "Here's the thing about self defense for a vast majority of people: \n\nWhat kind of neighborhood are you living in? If you're in some suburb where the only crime is kids breaking stuff are you really in fear for your life? \n\nOk, say you live in meth alley and some tweaker breaking in is a real concern...\n\nIf you are is your door some crap you can kick in? Are your windows shatterproof? Because both of those are way better for self defense than a gun, and if you haven't done either of those first I kind of think your self defense claims are suspect.\n\nOk, say you rent, or say you don't have $15k to replace all your windows and you think bars are ugly...\n\nGroggy as hell just woken up at 4am you are never getting in the first shot but whatever, that's not my business.\n\nAll that being said an AR-15 is a terrible weapon for home defense. It's big, it's unwieldy, it's probably in another room somewhere, and if you miss, which you will at least a few times there's a not zero chance it goes through the bedroom wall and hits little Timmy.\n\nIf you want a shotgun for home defense I still think you're being paranoid, but no one's talking about shotgun regulation. If you want a pistol in your purse for self defense I'm going to tell you it's a bad idea but hey, we aren't banning pistols any time soon. If you tell me you absolutely need an AR-15 for home defense I'm calling bullshit.",
              "timestamp": "2022-06-06 15:32:22",
              "score": 5,
              "num_children": 1,
              "author": 311138,
              "replies": [
                {
                  "id": "ibeb6ik",
                  "text": "The argument of what neighborhood you live in is irrelevant when it comes to \"should you be prepared to defend yourself\". Criminals will drive considerable distances to commit crimes in easygoing rich neighborhoods because they think they will find easy targets. This isn't the 1800s when traveling 50 miles was a multiple day trip on horseback.\n\nIt doesn't matter if your windows are shatterproof, if you can kick in the doors, etc. If a criminal has a car or a sledgehammer, all of that is irrelevant. Even if you live in a brick fortress with very tough doors and windows, youtube channels like lockpicking lawyer have demonstrated how the majority of locks out there can be easily bypassed with minor effort.\n\nWith the comment about \"you don't need an AR-15 for home defense\", it's true that you don't really need that and AR-15s are mostly for recreational shooting or competitions. A shotgun is significantly better than an AR-15 for home defense, however something like a slug in a shotgun hits way harder than you could ever hope to do with a 5.56mm bullet out of an AR-15, even something like buckshot hits with pretty brutal results. If we're not going to ban shotguns that are more dangerous than AR-15s, then why would it make sense to ban an AR-15?",
                  "timestamp": "2022-06-06 18:45:13",
                  "score": 1,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "ibev2lj",
                      "text": ">If we're not going to ban shotguns that are more dangerous than AR-15s, then why would it make sense to ban an AR-15?\n\nMy Browning Auto-5 is a beauty than can put 1/3 a pound of lead in the air in under four seconds. \n\nIt also has like a 28 inch barrel and is 50 inches in length. \n\nA Daniel Defense Ar-15 is 32 inches total and would be much better suited for moving from room to room. And apparently scaring the cops into not moving.",
                      "timestamp": "2022-06-06 21:09:20",
                      "score": 1,
                      "num_children": 0,
                      "author": 82625,
                      "replies": []
                    },
                    {
                      "id": "ibewp8u",
                      "text": "> Criminals will drive considerable distances to commit crimes in easygoing rich neighborhoods because they think they will find easy targets. \n\nI bet they won't, but again, I conceded that argument so I don't know why you are revisiting it.\n\n> If a criminal has a car or a sledgehammer, all of that is irrelevant.\n\nYou honestly think someone is going to take a sledgehammer to your house _while you are in it_ to rob you? Remember, that gun doesn't do any good if you aren't home, so do you really think someone is going to be doing all that, or picking your locks, while you are home?\n\nThat's the thing about the ZOMG home defense crowd: You imagine these impossible scenarios that are so astronomically unlikely to happen. Like someone is going to drive 45 minutes to your house, break down the siding with a sledgehammer, all while you are home, to kill you while stealing your TV... Does that seem like a reasonable fear to you?\n\nBut again, I conceded that point, so I don't know why you are arguing it.\n\n> If we're not going to ban shotguns that are more dangerous than AR-15s, then why would it make sense to ban an AR-15?\n\nBecause shotguns aren't the weapon of choice for gunning down grade school kids. If prove to be an effective option for shooting lots of third graders we can revisit the issue.\n\nLook, just for the record I almost certainly own more guns than you do. I know what they are, I know what they do, and it's not like I'm some knee jerk reactive anti-gun zealot. \n\nBut that's because I like shooting at the range. Not because I think I'm going to get in a life or death shootout. They are a hobby. No more. If they outlaw guns I'll build birdhouses or something.",
                      "timestamp": "2022-06-06 21:21:28",
                      "score": 0,
                      "num_children": 0,
                      "author": 311138,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ibd6qqt",
          "text": "Why are yall down voting him, he's not wrong.",
          "timestamp": "2022-06-06 13:47:11",
          "score": 0,
          "num_children": 1,
          "author": 726,
          "replies": [
            {
              "id": "ibdches",
              "text": "Because the fascist pigs shouldn't have guns either.",
              "timestamp": "2022-06-06 14:33:49",
              "score": 2,
              "num_children": 0,
              "author": 283503,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ibdt5p1",
      "text": "The issue is less about the number of guns and more about a society where people look to the future and see shooting people as the best option. In the US, the future looks hopeless.",
      "timestamp": "2022-06-06 16:36:44",
      "score": 0,
      "num_children": 0,
      "author": 31672,
      "replies": []
    },
    {
      "id": "ibdou8w",
      "text": "If it was because of guns, why aren't there as many and as deadly school shootings in 19th and 20th century USA",
      "timestamp": "2022-06-06 16:05:53",
      "score": -4,
      "num_children": 1,
      "author": 386684,
      "replies": [
        {
          "id": "ibdpcyk",
          "text": "I'm not going to do any research yet but my guess would be that's there were lots less guns and the guns then were not as efficient, seems obvious?",
          "timestamp": "2022-06-06 16:09:40",
          "score": 5,
          "num_children": 1,
          "author": 180508,
          "replies": [
            {
              "id": "ibe7a1r",
              "text": "In the 1920s you could buy fully automatic Thompson submachine guns with 100 round drum magazines in US hardware stores.  They were plenty efficient.",
              "timestamp": "2022-06-06 18:17:20",
              "score": 3,
              "num_children": 0,
              "author": 302731,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ibdo0q7",
      "text": "Finland and Switzerland have roughly as many gun-owners as the USA.\n\nThey both have conscription, incidentally.",
      "timestamp": "2022-06-06 16:00:03",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "ibdq76t",
          "text": "Not true. The US has by far the highest rate of gun ownership in the world. Finland and Switzerland have a [gun ownership rate](https://worldpopulationreview.com/country-rankings/gun-ownership-by-country) about 1/3 that of the US",
          "timestamp": "2022-06-06 16:15:43",
          "score": 2,
          "num_children": 1,
          "author": 180508,
          "replies": [
            {
              "id": "ibdr6lr",
              "text": "That's guns per person, not gun owners per capita.\n\nBest estimate for gun owners per capita that I can find numbers on is [Percent of households with guns](https://en.wikipedia.org/wiki/Percent_of_households_with_guns_by_country) which gives Finland a basically identical rate of gun ownership to the USA, and Switzerland the 4th highest, at ~3/4 of the USA or Finland.\n\nThe difference between these two stats is that your number is effected by how many guns each gun owner has, and mine isn't.",
              "timestamp": "2022-06-06 16:22:40",
              "score": 4,
              "num_children": 1,
              "replies": [
                {
                  "id": "ibdt2hm",
                  "text": "I'm afraid you are straight wrong here, my statistics are per capita \"guns owned per 100 people\". Your statistics are 'percentage of households owning a firearm'. Yours is the source that doesn't account for population and its clearly misleading.\n\nThe percentage of households that own a gun isn't really the issue is it?",
                  "timestamp": "2022-06-06 16:36:07",
                  "score": 1,
                  "num_children": 1,
                  "author": 180508,
                  "replies": [
                    {
                      "id": "ibeg6td",
                      "text": "You missed what that guy is saying. 50 guns owned per 100 people could be 5 guys with 10 guns each. But it doesn't matter if someone has one or 50 guns. They're both just as capable of killing. Your statistic is like saying Americans are rich because in 2019 the average net worth of American families was $746,820. But it's not really accurate because it's skewed upwards because of the 1%. A more accurate representation is median wealth of American families, which was $121,760. It's a huge difference.\n\nUnfortunately, median doesn't really work well for gun ownership for two reasons (The median number of guns owned in America per person is 0). Not everyone owns a gun, and it's effectively a binary since again, we don't care how many guns people own. The best statistic is either % of people owning guns, or % of households that own a gun, which in my opinion, is the most relevant statistic.\n\nI think it's the most relevant because while it doesn't go into numbers and households can be all different sizes, it gives you a decent idea of how many people have potential access to a gun. John Doe could have a gun registered to himself, but that doesn't stop his son Dave from finding the keys and taking the gun to shoot up a school. I think using both % of Americans who own guns and % of households that have guns gives us the best idea. It gives us a good idea of how many people own guns, and how many people have access to guns. But your statistic of guns per capita is next to useless.",
                      "timestamp": "2022-06-06 19:21:16",
                      "score": 3,
                      "num_children": 0,
                      "author": 144462,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ibdzd94",
      "text": "Yup and we are also nicer lol",
      "timestamp": "2022-06-06 17:20:46",
      "score": 1,
      "num_children": 0,
      "author": 353224,
      "replies": []
    },
    {
      "id": "ibe9w3t",
      "text": "They also have mental health available when needed.",
      "timestamp": "2022-06-06 18:35:58",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "ibg0zj5",
          "text": "Canada actually has long-standing and significant issues when it comes to access to mental health care. There are gaps and weak points in our single-payer healthcare system, and mental health care is one of them.",
          "timestamp": "2022-06-07 02:54:43",
          "score": 1,
          "num_children": 1,
          "author": 354490,
          "replies": [
            {
              "id": "ibgf01m",
              "text": "Makes me sad to hear, I think it's more than just a mental issue also. Definitely having access to powerful weapons so easily is a major issue and a lot of the redneck Americans or trump supporters are naturally violent they get raised by angry people who yell and scream constantly creating a tense living situation.",
              "timestamp": "2022-06-07 05:16:56",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ibeassb",
      "text": "This is unrelated but I have a friend in Canada who said that their education (mainly math being many years behind) was even worse than that of theirs in America (not that good relative to comparable countries) … could some Canadians explain? Maybe it is regional or school specific or something else? I know Canada has some fascist numbnuts too, is it related to that?",
      "timestamp": "2022-06-06 18:42:29",
      "score": 1,
      "num_children": 1,
      "author": 141140,
      "replies": [
        {
          "id": "ibfha1b",
          "text": "The tale of your one friend does not mean all of Canada's education sucks worse than ours.",
          "timestamp": "2022-06-07 00:07:39",
          "score": 3,
          "num_children": 1,
          "author": 165422,
          "replies": [
            {
              "id": "ibfqis4",
              "text": "I 100% agree, I just wanted to know what it may be with his school",
              "timestamp": "2022-06-07 01:25:11",
              "score": 1,
              "num_children": 0,
              "author": 141140,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ibedvog",
      "text": "Amen",
      "timestamp": "2022-06-06 19:04:48",
      "score": 1,
      "num_children": 0,
      "author": 383779,
      "replies": []
    },
    {
      "id": "ibevadh",
      "text": "But I don't see where Canadians have to deal with Republicans...",
      "timestamp": "2022-06-06 21:10:57",
      "score": 1,
      "num_children": 0,
      "author": 236289,
      "replies": []
    },
    {
      "id": "ibfglrv",
      "text": "Per capita would be a better measure as the US has almost ten times the population of Canada but I get their point.",
      "timestamp": "2022-06-07 00:02:03",
      "score": 1,
      "num_children": 0,
      "author": 303158,
      "replies": []
    },
    {
      "id": "ibfqprr",
      "text": "They want to limit the doors? Isn’t that a fire hazard?",
      "timestamp": "2022-06-07 01:26:50",
      "score": 1,
      "num_children": 0,
      "author": 151593,
      "replies": []
    },
    {
      "id": "ibgpwjt",
      "text": "Bowling for Columbine made this point loud and clear.",
      "timestamp": "2022-06-07 07:45:31",
      "score": 1,
      "num_children": 0,
      "author": 123432,
      "replies": []
    },
    {
      "id": "ibdp6dq",
      "text": "Blaming guns for school shootings is like blaming penises for rapes and recommending castration as the solution.",
      "timestamp": "2022-06-06 16:08:20",
      "score": -10,
      "num_children": 0,
      "author": 386684,
      "replies": []
    },
    {
      "id": "ibe20mp",
      "text": "Thanks captain obvious.",
      "timestamp": "2022-06-06 17:39:37",
      "score": -4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ibeuesv",
      "text": "I agree with this. For the most part. I agree that rifles should be illegal but I do support the right to own a handgun. What we should be doing is cracking down on the illegal sales of firearms as well as restricting access to rifles.",
      "timestamp": "2022-06-06 21:04:29",
      "score": -5,
      "num_children": 1,
      "author": 49173,
      "replies": [
        {
          "id": "ibfggik",
          "text": "When the 2A was created, it was meant for veterans of the War for Independence and their rifles. Like, \"if they come back and we can't manufacture enough new guns to fight them, come back with your weapon to help us out\".\n\nSo no, you don't have the right to own a handgun, since that was never a thing when the 2A was written up.\n\nIf you own a gun, or advocate for a \"right\" to own one, you're just as stupid as the Republicans.",
          "timestamp": "2022-06-07 00:00:51",
          "score": 2,
          "num_children": 1,
          "author": 404389,
          "replies": [
            {
              "id": "ibfgwzl",
              "text": "I advocate for gun rights because left leaning people, like myself, should be able to defend themselves when a bigot shows up on their doorstep with a rifle. Since we can't trust the police to defend us anymore we should defend ourselves. Taking legal guns away from Republicans will make them just illegally buy more powerful firearms (like they already do).",
              "timestamp": "2022-06-07 00:04:38",
              "score": 1,
              "num_children": 0,
              "author": 49173,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ibep8ff",
      "text": "3 is still pretty high though…",
      "timestamp": "2022-06-06 20:26:59",
      "score": 0,
      "num_children": 0,
      "author": 379056,
      "replies": []
    },
    {
      "id": "ibgw2xf",
      "text": "Blaming guns for shootings is like blaming cars for drunk driving kills.",
      "timestamp": "2022-06-07 09:23:25",
      "score": 0,
      "num_children": 0,
      "author": 386684,
      "replies": []
    }
  ]
}