{
  "id": "v70tw8",
  "text": "Don't you just love questions that answer themselves\n",
  "timestamp": "2022-06-07 16:40:32",
  "score": 542,
  "subreddit": "t5_2zaj2",
  "num_children": 18,
  "author": 304941,
  "replies": [
    {
      "id": "ibidkye",
      "text": "Wait....how many of thoes awards are obtained for free?",
      "timestamp": "2022-06-07 17:28:48",
      "score": 60,
      "num_children": 1,
      "replies": [
        {
          "id": "ibivcao",
          "text": "I've been trying to work that one out, lol. I swear, those people must've spent real money on reddit coins to be able to reward that person. What a waste. 😅",
          "timestamp": "2022-06-07 19:35:45",
          "score": 39,
          "num_children": 2,
          "replies": [
            {
              "id": "ibj9a1k",
              "text": "Spent ? Or do you mean got donations from the guy living in his mother's basement ?!",
              "timestamp": "2022-06-07 21:20:20",
              "score": 16,
              "num_children": 2,
              "author": 397262,
              "replies": [
                {
                  "id": "ibjd667",
                  "text": "Lol, probably.",
                  "timestamp": "2022-06-07 21:52:15",
                  "score": 9,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "ibjwhwy",
                  "text": "The guy they say they hate but is supporting them through their OF account",
                  "timestamp": "2022-06-08 00:34:46",
                  "score": 6,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ibjyo7k",
              "text": "We can be certain that they aren't the most economical intelligent.",
              "timestamp": "2022-06-08 00:53:13",
              "score": 5,
              "num_children": 0,
              "author": 29780,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ibj1n5z",
      "text": "Well we don’t like you either",
      "timestamp": "2022-06-07 20:21:27",
      "score": 19,
      "num_children": 1,
      "author": 139759,
      "replies": [
        {
          "id": "ibkit66",
          "text": "Right wing marshmallow king doesn't like women",
          "timestamp": "2022-06-08 03:51:21",
          "score": 1,
          "num_children": 1,
          "author": 18200,
          "replies": [
            {
              "id": "ibkmbro",
              "text": "no i like women i just hate toxic feminity",
              "timestamp": "2022-06-08 04:28:33",
              "score": 4,
              "num_children": 0,
              "author": 139759,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ibj4ur2",
      "text": "I'm always confused as to why libertarians are lumped in with conservatives like this.\n\nI mean, no political group is a monolith, but libertarians especially can be all across the board.",
      "timestamp": "2022-06-07 20:45:31",
      "score": 14,
      "num_children": 2,
      "author": 251300,
      "replies": [
        {
          "id": "ibjhzx1",
          "text": "As a Libertarian, it's a complicated thing, we believe (the libertarian sub I follow most, NOT r/Libertarian but r/GoldAndBlack) that we are right wing but not right wing, we simply want freedom and whatever will get us to NO government intervention whatsoever, (also means no free anything from the government so leftists hate us) and if you're an AnCap (I consider myself one) abolishing the State, meaning the \"government\" is not a \"government\" but a bunch of private institutions that have to follow what the people want, which would probably closely align with the NAP (basically if there's a victim, there's a crime, no victim, no crime), and if they didn't, they simply wouldn't get business, because it would work like a company instead of taxing, you could donate to a company you like best, like private police (more like guards for hire) the views may seem radical, but that's an AnCap point of view anyways, there are also Minarchists, meaning minimum government, which want some type of government but them not to hold any real power\n\nSorry about the ramble, wanted to explain Libertarianism from my perspective",
          "timestamp": "2022-06-07 22:32:02",
          "score": 8,
          "num_children": 0,
          "author": 102794,
          "replies": []
        },
        {
          "id": "ibjow16",
          "text": "They’re children incapable of thinking rationally and when they try it ends in being false dichotomies.",
          "timestamp": "2022-06-07 23:30:02",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ibiiap8",
      "text": "Every post I see there have like hundreds of rewards. Is there an option of free rewards there or is this sub for ultra rich women who just want to blow their husband's hard earned money away for getting validation on their screwed thoughts. \n\nIn any case I feel pitty for people who think they are genuine people who are actually talking about something necessary",
      "timestamp": "2022-06-07 18:02:04",
      "score": 31,
      "num_children": 2,
      "author": 396763,
      "replies": [
        {
          "id": "ibiyh5z",
          "text": ">In any case I feel pitty for people who think they are genuine people who are actually talking about something necessary\n\nthis sub in a nutshell",
          "timestamp": "2022-06-07 19:58:20",
          "score": -1,
          "num_children": 1,
          "author": 129020,
          "replies": [
            {
              "id": "ibjgef9",
              "text": "And here comes the simp that is probably actually dating one of these women",
              "timestamp": "2022-06-07 22:18:48",
              "score": 10,
              "num_children": 1,
              "author": 102794,
              "replies": [
                {
                  "id": "ibjkbn4",
                  "text": "nah",
                  "timestamp": "2022-06-07 22:51:33",
                  "score": -4,
                  "num_children": 0,
                  "author": 129020,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ibjjuv1",
          "text": "Could be rich feminists, not necessarily women, and self made rich feminists as well",
          "timestamp": "2022-06-07 22:47:39",
          "score": 0,
          "num_children": 0,
          "author": 261290,
          "replies": []
        }
      ]
    },
    {
      "id": "ibii00u",
      "text": "So wait... You have to lie to get with feminists because they won't want to be with you if they know what your true beliefs are?\n\nWhy would this make any sense?",
      "timestamp": "2022-06-07 17:59:58",
      "score": 16,
      "num_children": 1,
      "replies": [
        {
          "id": "ibj0cgv",
          "text": "Why would someone date a feminist?",
          "timestamp": "2022-06-07 20:11:51",
          "score": 19,
          "num_children": 2,
          "author": 376740,
          "replies": [
            {
              "id": "ibj330k",
              "text": "No idea, but some men do. Probably because there isn't many other options available and the chances of finding a woman who isn't a feminist and understands the idiocy behind it - is very slim. I hope I'm wrong about that. Even women who don't understand feminism much, still do feminists acts and feed themselves into it without realizing it.",
              "timestamp": "2022-06-07 20:32:12",
              "score": 10,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ictzoeh",
              "text": "Im dating a feminist, she's the best submissive ive ever met. Just not infront of friends lol.",
              "timestamp": "2022-06-18 13:59:17",
              "score": 1,
              "num_children": 0,
              "author": 181845,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ibii5ko",
      "text": "It's not hypocrisy. If you don't want to date a transgender person, you are free to complain about transgender people on dating apps who lie about not transgender.",
      "timestamp": "2022-06-07 18:01:04",
      "score": 24,
      "num_children": 1,
      "author": 388821,
      "replies": [
        {
          "id": "ibizxl0",
          "text": "Yeah, that should seem logical enough to them. If I found out my date was a trans man, I would be pretty pissed off as I'm straight and I'm looking for someone that's a biological male with a penis. I'm not into vaginas or fake penis.",
          "timestamp": "2022-06-07 20:08:49",
          "score": 10,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ibio75c",
      "text": "Breaking news: women hate over 75% of men for… *roles dice* having opinions!",
      "timestamp": "2022-06-07 18:44:13",
      "score": 29,
      "num_children": 1,
      "author": 348859,
      "replies": [
        {
          "id": "ibir4kh",
          "text": "😂😂😂",
          "timestamp": "2022-06-07 19:05:24",
          "score": 9,
          "num_children": 0,
          "author": 304941,
          "replies": []
        }
      ]
    },
    {
      "id": "ibityyc",
      "text": "They want a rich man but also want high taxes.",
      "timestamp": "2022-06-07 19:25:50",
      "score": 5,
      "num_children": 0,
      "author": 256005,
      "replies": []
    },
    {
      "id": "ibjcnz1",
      "text": "Yes; I also like Answers that Question themselves; checkmate Liberals",
      "timestamp": "2022-06-07 21:48:12",
      "score": 2,
      "num_children": 0,
      "author": 356085,
      "replies": []
    },
    {
      "id": "ibkde5c",
      "text": "[deleted]",
      "timestamp": "2022-06-08 02:59:09",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "ibke4ri",
          "text": ">incel is such a misnomer.  \n>  \n>there's nothing involuntary about your condition, dude, you choose to be a fucking asshole.\n\nWhat a hot take. These harpies don't understand incels *at all*.\n\nMost incels I've met are some of the nicest guys I know, and that's the problem. They never had any success with women because they were too nice.\n\nI spent most of my teens and twenties acting out the nice guy programming most of us were raised with. It wasn't until I began emulating my successful friends by altering my behavior to be more of a callous, selfish, asshole type that I realized what I had been doing wrong the entire time, and started getting access to easy sex.\n\nThese Feminists truly have no idea what they are on about.",
          "timestamp": "2022-06-08 03:05:49",
          "score": 0,
          "num_children": 0,
          "author": 304941,
          "replies": []
        }
      ]
    },
    {
      "id": "ibikmrv",
      "text": "Why do women wear make up,push up and heels on dates?",
      "timestamp": "2022-06-07 18:18:58",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ibijgu6",
      "text": "I don't think you understand what hypocrisy is.",
      "timestamp": "2022-06-07 18:10:34",
      "score": 5,
      "num_children": 1,
      "replies": [
        {
          "id": "ibijrti",
          "text": "Don't I?",
          "timestamp": "2022-06-07 18:12:46",
          "score": 4,
          "num_children": 1,
          "author": 304941,
          "replies": [
            {
              "id": "ibily9m",
              "text": "Hypocrisy would be them saying they love Republican/libertarian men and then refusing to date them, or them saying they hate repub/libertarian men and then dating them anyway.\n\nSo, no, you don't understand hypocrisy.",
              "timestamp": "2022-06-07 18:28:07",
              "score": 4,
              "num_children": 2,
              "replies": [
                {
                  "id": "ibiraun",
                  "text": "Seems like hypocrisy to me.\n\nYou can't openly hate and disparage a group of men and then expect them to treat you well or return your open hostility with model behavior.",
                  "timestamp": "2022-06-07 19:06:40",
                  "score": 5,
                  "num_children": 2,
                  "author": 304941,
                  "replies": [
                    {
                      "id": "ibisxjp",
                      "text": "it’s irony i believe but the fuck do i know",
                      "timestamp": "2022-06-07 19:18:29",
                      "score": 10,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ibixmbx",
                          "text": "More than him.",
                          "timestamp": "2022-06-07 19:52:08",
                          "score": 0,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ibizvz5",
                      "text": "Okay but that's not hypocrisy. \n\nLying about yourself in order to get attention from women however, absolutely is hypocrisy.\n\nI mean holy shit the level of projection is pathetic.\n\n\nhy·poc·ri·sy\n\n/həˈpäkrəsē/\n\nnoun\n\nthe practice of claiming to have moral standards or beliefs to which one's own behavior does not conform; pretense.",
                      "timestamp": "2022-06-07 20:08:29",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ibiswzp",
                  "text": "I think the only one who doesn't is you. Hypocrisy fits here.",
                  "timestamp": "2022-06-07 19:18:22",
                  "score": -1,
                  "num_children": 1,
                  "author": 99650,
                  "replies": [
                    {
                      "id": "ibiypx0",
                      "text": "hy·poc·ri·sy\n\n/həˈpäkrəsē/\n\nnoun\n\nthe practice of claiming to have moral standards or beliefs to which one's own behavior does not conform; pretense.\n\n\nNowhere in either of those posts does that person claim to be something they're not, or contradict their own beliefs. \n\nJesus tapdancing christ, who educated you?",
                      "timestamp": "2022-06-07 20:00:05",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ibj2bj6",
                          "text": "What you have explained in your comments about the definition of hypocrisy is absolutely correct. Bloody hell, it does pay to look up words properly before using them.",
                          "timestamp": "2022-06-07 20:26:27",
                          "score": 2,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ibij09i",
      "text": "If your politics is that the state should have control over women's bodies, then maybe women won't like you? I don't see the hypocrisy.",
      "timestamp": "2022-06-07 18:07:11",
      "score": -6,
      "num_children": 4,
      "author": 137273,
      "replies": [
        {
          "id": "ibjbhr3",
          "text": "This is a manufactured issue\n\nGenerally rightwing men do not want leftwing women  for long term. Short term looks is basically the only thing that matters lol",
          "timestamp": "2022-06-07 21:38:32",
          "score": 7,
          "num_children": 0,
          "author": 149848,
          "replies": []
        },
        {
          "id": "ibiwbx8",
          "text": "I think perhaps portraying the position of conservatives is to \"control women's bodies\" is more than a little facetious or disingenuous. Roughly 50% of women in the US are pro-life, perhaps they care about the unborn female's bodies more than the inconvenienced mother?\n\nThere's many different perspectives, and portraying conservatives as only interested in controlling women's bodies, especially when many conservatives are women, is one of the reasons progressives don't get much respect.",
          "timestamp": "2022-06-07 19:42:53",
          "score": 7,
          "num_children": 2,
          "author": 304941,
          "replies": [
            {
              "id": "ibj0ko4",
              "text": "Pro-life is crucial to American conservatism. It's a major rallying point - perfect example of a Single Issue that gets people voting.\n\nThe sex of the unborn is entirely irrelevant to the morality of abortion; I don't think you'd find many people on either side who'd argue otherwise. On the other hand, abortion restrictions do control women's bodies. By definition. You may argue that it's justified, but that's what it literally is.\n\nI agree with you to this extent: I do think that most pro-life people operate from the sincere belief that abortion is wrong. It's where they go from that belief that I take issue with it.",
              "timestamp": "2022-06-07 20:13:34",
              "score": 3,
              "num_children": 0,
              "author": 129020,
              "replies": []
            },
            {
              "id": "ibiywlr",
              "text": "I'd be *extremely* surprised if it was that high.\n\nBut it absolutely *is* about having the government control women's bodies. That's what is happening at the ground level. It's a theocratic ideology; the belief that the state needs to enforce morality on a population instead of letting the population be free to live their own morality.\n\nThis is especially apparent when children that mothers were forced to give birth to are then abandoned by the state and those who used the state to control women.",
              "timestamp": "2022-06-07 20:01:22",
              "score": 0,
              "num_children": 1,
              "author": 137273,
              "replies": [
                {
                  "id": "ibj0zk8",
                  "text": "Again, I'm pro-choice. I've always considered myself a liberal. But I don't think strawmanning conservatives is really an effective way to move the needle politically for your cause.\n\nA lot of conservative people, including conservative women, care about the plight and lives of the unborn. From *their* perspective, the progressives are concerned with the mass murder of innocent children. And if you think that's a strawman, then maybe you should stop doing it to them.",
                  "timestamp": "2022-06-07 20:16:37",
                  "score": 2,
                  "num_children": 1,
                  "author": 304941,
                  "replies": [
                    {
                      "id": "ibj23sy",
                      "text": "This isn't a strawman, it's just the reality. They use the state to force women to give birth, even if they can't afford children, even if they don't like children, and even if it will cause them harm in the process. The \"pro-life\" people want to take away the reproductive rights of a now existing human being to protect the rights of a future existing human being.\n\nI would be sympathetic if the same people were for free childcare, maternity leave, welfare, universal healthcare, public housing, or any number of other assistance programs that would ensure that the resulting baby can grow into a functional adult. As it stands, though, unwanted children are far more likely to live in poverty, turn to crime, or become drug addicts.\n\nThe combination of forced births plus no assistance seems calibrated specifically to maximize human suffering. As a result, I don't buy into this idea that these people are doing this out of kindness. I think it's more punitive.",
                      "timestamp": "2022-06-07 20:24:51",
                      "score": -1,
                      "num_children": 1,
                      "author": 137273,
                      "replies": [
                        {
                          "id": "ibj63gb",
                          "text": "I think the problem you're facing here is that you're conflating your average conservative on the street with powerful politicians.\n\nI don't at all doubt that there's conservative politicians that genuinely want to do some terrible shit. That want to control women and children, that want to enforce their moral will on others. That's utterly unsurprising, politicians are normally all scum to begin with, and of course they'd hide their actual goals behind ideas like saving children. There's a reason why \"think of the children!\" is such a catchall. \n\nBut your average American conservative? They've been told that the issue is babies dying. And oh my goodness, that sounds terrible! They wanna kill babies? I need to do something about this! Most of them hold their beliefs honestly. If those beliefs result in bad outcomes obviously that's terrible, but usually people don't know. That or they've been whipped up into so much emotion they can't think straight.\n\nIt happens on the left too, people get told what the cause is, they gotta do something! Look at all this bad stuff!\n\nThe most important thing right now is the ability to understand others. You're not gonna change anyone's mind if you think they're truly evil. Just think of Daryl Davis, a black man that's brought down whole chapters of the KKK just by being friendly and willing to hear the real life problems that are the root of such ideology.",
                          "timestamp": "2022-06-07 20:55:00",
                          "score": 3,
                          "num_children": 1,
                          "author": 251300,
                          "replies": [
                            {
                              "id": "ibjbreh",
                              "text": "I pretty much agree with your sentiment wholeheartedly. Like essentially everything you wrote.\n\nThere are some fucking evil politicians and conservatives with power who really are like Disney cartoon villains, but as you said, the average American conservative really does believe (in their mind) that abortion mass murders millions of defenseless unborn children every year.\n\nI don't think this poster understands that he's preaching to the choir. I'm pro-choice, I think the pro-life position is just as outrageous and emotionally-driven as the idea that we should get rid of test scores altogether to help underperforming black children. \n\nThese are irrational, tribalistic, bleeding-heart responses to complex problems. But yes, you don't curry much favor with those who have opposing views by portraying them all as evil and extracting the worst possible interpretation of their actions.",
                              "timestamp": "2022-06-07 21:40:43",
                              "score": 1,
                              "num_children": 1,
                              "author": 304941,
                              "replies": [
                                {
                                  "id": "ibjc9m5",
                                  "text": "Okay, and now apply that same empathy to the women you posted above (as hypocrites) who are obviously complaining about men who want the state to control their reproductive functions.\n\nWhat I was initially commenting on is how this sentiment makes total sense.",
                                  "timestamp": "2022-06-07 21:44:54",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 137273,
                                  "replies": [
                                    {
                                      "id": "ibje379",
                                      "text": "Okay first of all, Libertarians are pro-choice, as the whole concept around the fucking insane idea of Libertarianism, is to create as much \"freedom\" as humanly possible, going so far as abolishing the government and police force completely in some circles.\n\nSo how are, in your mind, Libertarians attempting to take away women's rights exactly? Your argument doesn't track.",
                                      "timestamp": "2022-06-07 21:59:46",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 304941,
                                      "replies": [
                                        {
                                          "id": "ibjfr5f",
                                          "text": "Libertarians are, overwhelmingly, in support of conservative politicians who do want to control women's reproduction. One of the threads you linked was specifically about this phenomenon. Generally, libertarians (in the US) are conservatives who are for legalization of pot, but are otherwise really right wing (right wing, in the 21st century, largely refers to pro-capitalism).\n\nThere are certainly libertarians who are very much pro-choice, but they tend to not have anyone to vote for, so outside of activism, it doesn't really matter (and libertarians generally focus on electoral politics over activism).\n\nAt the end of the day, forcing women to give birth is pro-capitalist, as it makes the pool of impoverished and desperate workers larger.",
                                          "timestamp": "2022-06-07 22:13:26",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 137273,
                                          "replies": [
                                            {
                                              "id": "ibjh35c",
                                              "text": "Again, you're preaching to the choir. I think Libertarians are fucking insane and I generally disagree with American conservatives policies for the reasons you've already stated. I didn't know that Libertarians typically vote conservative but I guess in a two party system, the Republicans align more with their values than the Dems. It makes sense why they'd be lumped together with them.",
                                              "timestamp": "2022-06-07 22:24:28",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 304941,
                                              "replies": [
                                                {
                                                  "id": "ibji5h6",
                                                  "text": "Democrats and Republicans, by and large, are about equally pro-corporation and big government as each other. The fact that Libertarians vote Republican more often than not betrays the other values Libertarians tend to hold.\n\nAnti-feminism is one of those, and it's a far right ideology. Libertarians in the US tend to overlap a lot politically with the far right, and that's largely because \"far right\" generally means \"extremely in support of capitalism\", which is what Libertarians have centered their ideology completely around. They want capitalism to completely (or almost completely) replace the state.\n\nIt's funny, because in the rest of the world, \"Libertarian\" refers to libertarian socialism, which wants to abolish capitalism. Any ideology, outside of the United States, that wants capitalism as government is just referred to as \"fascism\", because that's ultimately all that word means.\n\nAnd now we've come full circle as to why Libertarians tend to want to control women's bodies.",
                                                  "timestamp": "2022-06-07 22:33:21",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "author": 137273,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ibizt5r",
          "text": "It's called being held accountable for your actions. I would be okay allowing women to physically abort children only if non consenting men could financially abort or leave children's mothers. Because if women don't want accountability then why should men? \n\nOr we can close our fucking legs for people we don't want children with. Why is that such a hard concept.",
          "timestamp": "2022-06-07 20:07:55",
          "score": 2,
          "num_children": 1,
          "author": 340182,
          "replies": [
            {
              "id": "ibj05y6",
              "text": "\"You should pay for what you've done by raising a child.\"\n\nSeems like a good philosophy for a stable society full of responsible well adjusted people who were raised by caring parents. I sure wish my mother had to raise me as a punishment for having sex or being raped.",
              "timestamp": "2022-06-07 20:10:31",
              "score": 3,
              "num_children": 1,
              "author": 137273,
              "replies": [
                {
                  "id": "ibj4u2s",
                  "text": "Raising a kid isn't punishment. I know plenty of people who were vary happy they didn't get aborted as kids because they were the product of a rape. Sure it's not a good thing by any means but don't discipline your child for what a man did to you. \n\nYour also talking about less than 1% of childbirth and abortion and in no way should that influence the law. And like I said up top, I'm okay with abortion for things like that. But that doesn't mean let every woman who wants an abortion should have one because 99% of abortions were with 2 consenting adults.",
                  "timestamp": "2022-06-07 20:45:22",
                  "score": 1,
                  "num_children": 1,
                  "author": 340182,
                  "replies": [
                    {
                      "id": "ibj5ch1",
                      "text": "Would you be supportive of free childcare, free education, free housing, and other forms of assistance so that women who are forced to give birth can reasonably expect to do so?\n\nOne of the largest reasons, throughout human history, that women terminate pregnancies, is because they know they can't afford it and that they'd just be bringing someone into life who would have to suffer and die in poverty.",
                      "timestamp": "2022-06-07 20:49:17",
                      "score": 0,
                      "num_children": 1,
                      "author": 137273,
                      "replies": [
                        {
                          "id": "ibj8w9w",
                          "text": "So you want everyone else to work hard and pay for your needs instead of holding yourself accountable? Handouts come at the expense of tax payers. And for things like childcare are expensive because that should be something parents do. That's why we have so many messed up kids growing up because parents don't even want to parent anymore. So no I don believe you deserve handouts I think women could pick better more stable partners instead of having kids with deadbeat losers. Hold yourself accountable instead of making everyone else in the world pay for you. That's called being an adult.",
                          "timestamp": "2022-06-07 21:17:15",
                          "score": 3,
                          "num_children": 1,
                          "author": 340182,
                          "replies": [
                            {
                              "id": "ibj9eav",
                              "text": "Supplying society with a steady stream of homeless people, drug addicts, criminals, and other desperate people ignored and forgotten by our system also comes with costs - and they tend to be higher costs than people in other developed countries pay in taxes.\n\nIf you want to hold women accountable for... having sex when poor (really???), then maybe find some other way to do it that's not forcing into existence a child that the mother is either unable or unwilling to care for. That's already adding a huge burden on society, and it's only being compounded by the lack of social safety nets that always accompany forced births in countries.",
                              "timestamp": "2022-06-07 21:21:17",
                              "score": 2,
                              "num_children": 0,
                              "author": 137273,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ibiti2b",
          "text": "[deleted]",
          "timestamp": "2022-06-07 19:22:30",
          "score": 0,
          "num_children": 2,
          "replies": [
            {
              "id": "ibj23v3",
              "text": "Soon all feminists will go extinct when can’t have anymore children",
              "timestamp": "2022-06-07 20:24:51",
              "score": 2,
              "num_children": 0,
              "author": 139759,
              "replies": []
            },
            {
              "id": "ibj58fo",
              "text": "This proves absolutely nothing.",
              "timestamp": "2022-06-07 20:48:26",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ibkeoca",
                  "text": "[deleted]",
                  "timestamp": "2022-06-08 03:10:56",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ibkfuwj",
                      "text": "No.",
                      "timestamp": "2022-06-08 03:22:13",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ibkfzc4",
                          "text": "[deleted]",
                          "timestamp": "2022-06-08 03:23:26",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ibkhp4i",
                              "text": "Only the sith deal in absolutes.",
                              "timestamp": "2022-06-08 03:40:14",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ibip7a4",
      "text": "How many other guys out there have converted a few feminists to our side, this way? It seems like it's so easy. I actually have a thing for those feminist phase college girls with a rockin' bod, and even the ones with short hair, especially if they look good downstairs. Call me crazy. There's a kind I always go for. A lot of times, they're used to soy boys at school, they've been to gender politics class, but just wrote down whatever the teacher said, and all they need is a man to come along and show 'em the way. \n\nAll you gotta do is keep the subject of gender politics on the DL, at first, of course. Dazzle them your knowledge of their beloved postmodern authors, various subjects, music, culture, whatever. They always read a cliff note Foucault, or some shit like that. But you know all the meaning behind it. Then a couple hours in, you're rounding third base, heading home. They've been around the block, sure, but they've never had a guy really laying pipe. After you open up those new worlds of experience to them, they are suddenly open minded about all the real knowledge out there. Pretty soon, they forget all about the paltry knowledge they learned in gender politics class, and their feminist friends are questioning where they stand.",
      "timestamp": "2022-06-07 18:51:28",
      "score": -2,
      "num_children": 3,
      "author": 196342,
      "replies": [
        {
          "id": "ibizidp",
          "text": "*Sure,* Casanova. Highly believable.\n\nTell you what - why don't you do this a couple of times and report back to us.",
          "timestamp": "2022-06-07 20:05:42",
          "score": 4,
          "num_children": 1,
          "author": 129020,
          "replies": [
            {
              "id": "ibj3nra",
              "text": "That's what I was doing, sorry if that wasn't clear",
              "timestamp": "2022-06-07 20:36:33",
              "score": 2,
              "num_children": 1,
              "author": 196342,
              "replies": [
                {
                  "id": "ibj4b3z",
                  "text": "And what, your dick was so good it totally brought them out of the cave?\n\nLike I said - suure.",
                  "timestamp": "2022-06-07 20:41:24",
                  "score": 1,
                  "num_children": 1,
                  "author": 129020,
                  "replies": [
                    {
                      "id": "ibj6747",
                      "text": "It's not just the D. Women have different physiological processes involved in arousal. There's a psychological component of arousal that is more important for them. The timing is different, too. A lot of guys don't realize they don't have the instant-on light switch arousal guys have. Also, I haven't tried this with super militant feminists, just the college phase type, so I can't say it would change the super militant ones.",
                      "timestamp": "2022-06-07 20:55:47",
                      "score": 2,
                      "num_children": 1,
                      "author": 196342,
                      "replies": [
                        {
                          "id": "ibj8fh0",
                          "text": "That all matches my experience, honestly. It was this idea that you somehow blew their minds that raised a flag for me. And the idea that sex could \"convert\" a feminist.",
                          "timestamp": "2022-06-07 21:13:26",
                          "score": 1,
                          "num_children": 0,
                          "author": 129020,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ibiq1qe",
          "text": "Yeah I've seen this happen before too. It seems that many women are just waiting for the right man to put them in their place and give them a worldview.\n\nOne might even say that Feminism is the product of a society without enough strong men to give women a proper lesson on how to interact with the world. Though in fairness, that's the society Feminism pushed for.",
          "timestamp": "2022-06-07 18:57:37",
          "score": 1,
          "num_children": 1,
          "author": 304941,
          "replies": [
            {
              "id": "ibj5wkf",
              "text": "Hahahahahahaha wow that's comedy gold. \n\nYou.\n\nA strong man.\n\n🤣 \n\nThe only person that believes that is you.",
              "timestamp": "2022-06-07 20:53:31",
              "score": 0,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "ibj5gom",
          "text": "r/thathappened",
          "timestamp": "2022-06-07 20:50:11",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ibkf3t8",
      "text": "How can you possibly hate a libertarian? Libertarians just want everyone to be able to be left to their own devices so long as they aren’t murdering each other with the machetes they stole from Walmart, or some dumb crap like that! Plus, what if I told you, there was a way to help women without government? It’s name is Capitalism, and it has been the tried and true way of economic prosperity for last 400 years or so.",
      "timestamp": "2022-06-08 03:14:59",
      "score": 1,
      "num_children": 0,
      "author": 406881,
      "replies": []
    },
    {
      "id": "ibr43vf",
      "text": "I don’t understand what’s there problem with libertarians.",
      "timestamp": "2022-06-09 17:09:57",
      "score": 1,
      "num_children": 0,
      "author": 140132,
      "replies": []
    },
    {
      "id": "icxa20j",
      "text": "Who would want to date a female average redditor?",
      "timestamp": "2022-06-19 08:21:26",
      "score": 1,
      "num_children": 0,
      "author": 71529,
      "replies": []
    },
    {
      "id": "if9gnsc",
      "text": "Lol imagine carrying this much about a persons views irl, I get the internet shit cause you don’t know or see the person directly, but having this much hate about some other views that you act wacky irl always gets me.",
      "timestamp": "2022-07-07 21:42:46",
      "score": 1,
      "num_children": 0,
      "author": 69429,
      "replies": []
    }
  ]
}