{
  "id": "va84qh",
  "text": "TIFU by coming home early to surprise my wife, who was having a surprise birthday party for me\nIm still chuckling at this even though it’s kinda fucked up. Long story short, I forgot my own birthday. \n\nYeah yeah I know it’s weird, had a little bit of a ruff childhood and my birthday was either never celebrated or forgotten well….both. So as I grew older I forgot about it myself, I mean we never did anything and what not so who cared. \n\nNow I’m married with a wonderful women who’s very thoughtful *but* she always does some kind of party or date on my birthday. But sometimes I still forget, so today I came home early from work to surprise my wife….who was surprising me. \n\nI walked in quietly, and I saw her in the kitchen, with flour and cake mix on her forehead and tapestries, birthday cups flowers and gifts around the table. She was making a cake, for a surprise party. *my* surprise birthday. \n\nMy mouth dropped and I quietly walked backwards to the door, exiting quietly and waiting till 7:30 to come back home. My wife would be so sad and she was workin so hard😅.\n\nSo within to time frame of about 3 and a half hours, I practiced my “oh my god I’m so suprised face” \n\nWhen I came home she yelled “surprise!!” And I did a very crappy surprise face hugged her and we had a movie marathon. \n\nThis secret will never come out. But I think this was the best birthday ever. I find this kinda funny😂. I will be taking this secret to my grave. \n\nTL;DR i forgot my own birthday, came home from work early to surprise my wife and my wife was making a cake, for *my* surprise birthday. Whoops!",
  "timestamp": "2022-06-11 22:26:33",
  "score": 36487,
  "subreddit": "t5_2to41",
  "num_children": 216,
  "replies": [
    {
      "id": "ic101fe",
      "text": "How to show someone you love them, and how to return the favor. That was sweet.",
      "timestamp": "2022-06-11 23:17:26",
      "score": 5791,
      "num_children": 1,
      "replies": [
        {
          "id": "ic1c2wt",
          "text": "Ugh, I just got sucked down a Reddit rabbit hole where men were talking about how there is no value in marriage. OP, thank you for this wholesome post. I wish you many more well-celebrated birthdays!",
          "timestamp": "2022-06-12 01:05:41",
          "score": 1518,
          "num_children": 8,
          "author": 107149,
          "replies": [
            {
              "id": "ic2m9fj",
              "text": "This guy gets cake. My wife rubs her underboob sweat on me.",
              "timestamp": "2022-06-12 10:06:24",
              "score": 305,
              "num_children": 6,
              "author": 172156,
              "replies": [
                {
                  "id": "ic30q72",
                  "text": "She does that to me too.",
                  "timestamp": "2022-06-12 13:03:36",
                  "score": 159,
                  "num_children": 1,
                  "author": 181316,
                  "replies": [
                    {
                      "id": "ic31ae0",
                      "text": "I also chose this guy's wife's underboob sweat!",
                      "timestamp": "2022-06-12 13:09:06",
                      "score": 139,
                      "num_children": 1,
                      "author": 299512,
                      "replies": [
                        {
                          "id": "ic37cf6",
                          "text": "I love reddit",
                          "timestamp": "2022-06-12 14:05:31",
                          "score": 38,
                          "num_children": 1,
                          "author": 380345,
                          "replies": [
                            {
                              "id": "ic3bchp",
                              "text": "And we love underboob sweat. No kink shaming here.",
                              "timestamp": "2022-06-12 14:39:51",
                              "score": 36,
                              "num_children": 1,
                              "author": 181316,
                              "replies": [
                                {
                                  "id": "ic3dv50",
                                  "text": "We won't yuck your yum.",
                                  "timestamp": "2022-06-12 15:00:40",
                                  "score": 34,
                                  "num_children": 1,
                                  "author": 322714,
                                  "replies": [
                                    {
                                      "id": "ic4owce",
                                      "text": "I'm trying to yuck some yums",
                                      "timestamp": "2022-06-12 21:04:39",
                                      "score": 4,
                                      "num_children": 0,
                                      "author": 158034,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ic3hcon",
                  "text": "My husband twists his balls over his dong in the shower, creating a sort of fly face with a penis proboscis, which he then proceeds to suction onto my leg while I scream. I hate it. I love him.",
                  "timestamp": "2022-06-12 15:28:35",
                  "score": 90,
                  "num_children": 3,
                  "author": 230354,
                  "replies": [
                    {
                      "id": "ic4bbin",
                      "text": "Brilliant... my husband and I just recreated this. 10/10 recommend for a good laugh.",
                      "timestamp": "2022-06-12 19:19:02",
                      "score": 14,
                      "num_children": 1,
                      "author": 405650,
                      "replies": [
                        {
                          "id": "ic4n24o",
                          "text": "Does he do the sucking/milking sound upon making contact? Because that was my line, hahaha",
                          "timestamp": "2022-06-12 20:50:07",
                          "score": 4,
                          "num_children": 1,
                          "author": 230354,
                          "replies": [
                            {
                              "id": "ic590le",
                              "text": "Nah, he was figuring out the mechanics of it first. So freaky looking lol",
                              "timestamp": "2022-06-12 23:50:49",
                              "score": 2,
                              "num_children": 0,
                              "author": 405650,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ic47hxi",
                      "text": "Good old fly’s eyes. A true classic",
                      "timestamp": "2022-06-12 18:49:51",
                      "score": 5,
                      "num_children": 1,
                      "author": 202560,
                      "replies": [
                        {
                          "id": "ic4n6wy",
                          "text": "Perfect name, telling him when he gets home\n\n... Even though it will trigger itself to happen lol",
                          "timestamp": "2022-06-12 20:51:09",
                          "score": 3,
                          "num_children": 1,
                          "author": 230354,
                          "replies": [
                            {
                              "id": "ic4nvz6",
                              "text": "A good gift for him good he the book Puppetry of the Penis by Simon Morley and David Friend. It would hello expand his repertoire…",
                              "timestamp": "2022-06-12 20:56:39",
                              "score": 2,
                              "num_children": 0,
                              "author": 202560,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ic3oikv",
                      "text": "Wtf....\n\nReddit is a treasure at times, this is not one of them lol",
                      "timestamp": "2022-06-12 16:24:11",
                      "score": 10,
                      "num_children": 1,
                      "author": 170365,
                      "replies": [
                        {
                          "id": "ic3ppbd",
                          "text": "Fuck that, this was the best thing I've consumed all week. Absolutely classic and I'll be trying this ASAP with my wife.",
                          "timestamp": "2022-06-12 16:33:19",
                          "score": 22,
                          "num_children": 1,
                          "author": 101089,
                          "replies": [
                            {
                              "id": "ic3q9l1",
                              "text": "Don't consume dicks",
                              "timestamp": "2022-06-12 16:37:38",
                              "score": 6,
                              "num_children": 2,
                              "author": 321754,
                              "replies": [
                                {
                                  "id": "ic3qfmh",
                                  "text": "Pretty sure I'm allowed to if I want/get consent from all parties involved...",
                                  "timestamp": "2022-06-12 16:38:55",
                                  "score": 6,
                                  "num_children": 0,
                                  "author": 101089,
                                  "replies": []
                                },
                                {
                                  "id": "ic4qapr",
                                  "text": "Unless you're from Seattle, where \"eat a bag of Dicks\" has a totally different meaning.\n\nIt's a great cheap burger place.",
                                  "timestamp": "2022-06-12 21:15:49",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 287286,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ic3w2xy",
                  "text": "We are all blessed in different ways",
                  "timestamp": "2022-06-12 17:22:20",
                  "score": 8,
                  "num_children": 0,
                  "author": 241991,
                  "replies": []
                },
                {
                  "id": "ic3yq52",
                  "text": "Every year? What an odd way to celebrate one's birthday. But it's the little things that say \"I love you\" without having to utter a single word.",
                  "timestamp": "2022-06-12 17:42:47",
                  "score": 5,
                  "num_children": 0,
                  "author": 140880,
                  "replies": []
                },
                {
                  "id": "ic4l9ru",
                  "text": "I’m curious as to why. I too have under boob sweat but I find it gross",
                  "timestamp": "2022-06-12 20:36:09",
                  "score": 1,
                  "num_children": 0,
                  "author": 329845,
                  "replies": []
                },
                {
                  "id": "ic5j5yu",
                  "text": "Nah thats love right there 😅",
                  "timestamp": "2022-06-13 01:21:39",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ic1ovkl",
              "text": "lol the value in marriage is what you make of it\n\nthose sad sacks of shit are deeply lonely",
              "timestamp": "2022-06-12 03:02:29",
              "score": 327,
              "num_children": 2,
              "author": 252036,
              "replies": [
                {
                  "id": "ic22tcv",
                  "text": "You can be in a long term relationship without getting married, not sure why you think disagreeing with marriage means one is lonely. Tons of people disagree with marriage and are perfectly happy in the relationship they have.",
                  "timestamp": "2022-06-12 05:26:06",
                  "score": 65,
                  "num_children": 4,
                  "author": 206815,
                  "replies": [
                    {
                      "id": "ic2o6zv",
                      "text": "I think what they mean was all the posts by men that go on about how you'll inevitably hate your wife, no one actually loves eachother after 20 years etc. Etc. Etc. Which is all building nonsense and the same thing as couples who don't get married.",
                      "timestamp": "2022-06-12 10:35:27",
                      "score": 155,
                      "num_children": 2,
                      "author": 398792,
                      "replies": [
                        {
                          "id": "ic32knf",
                          "text": "I totally agree. There tends to be a lot of bitterness about marriages and long term relationships throughout reddit. There's too many nihilistic posts about the inevitable end with a lot of classic boomerhumorTM sprinkled in. I really thought we were past that stuff.",
                          "timestamp": "2022-06-12 13:21:32",
                          "score": 23,
                          "num_children": 0,
                          "author": 115242,
                          "replies": []
                        },
                        {
                          "id": "ic3h2eq",
                          "text": "Those posts are 14 year old boys, or incels.",
                          "timestamp": "2022-06-12 15:26:18",
                          "score": 7,
                          "num_children": 0,
                          "author": 153586,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ic2wcv3",
                      "text": "Funny enough, this reply doesn't even counter the idea that the only value in a marriage is what you make of it. Because the idea that marriage only has the value you give it, doesn't bring down long-term relationships that don't end in marriage. \n\n\nJust an odd observation.",
                      "timestamp": "2022-06-12 12:18:37",
                      "score": 20,
                      "num_children": 1,
                      "author": 15617,
                      "replies": [
                        {
                          "id": "ic63qax",
                          "text": "What I replied to is claiming that people who do not see the value in marriage are \"deeply lonely\"\n\nI never tried to counter the idea that marriage is what you make of it; I countered the idea that people who don't see the value in marriage are deeply lonely.\n\nJust an odd reply.",
                          "timestamp": "2022-06-13 04:39:05",
                          "score": 1,
                          "num_children": 0,
                          "author": 206815,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ic2lmv6",
                      "text": "Agreed!! 15 years of ups and downs here with periods of addiction thrown in but still very happy together. \nI must say sobriety rocks in love! X",
                      "timestamp": "2022-06-12 09:56:56",
                      "score": 30,
                      "num_children": 2,
                      "author": 386730,
                      "replies": [
                        {
                          "id": "ic31ixi",
                          "text": "Congratulations on your sobriety! My partner and I got sober together a few years ago, and our love has never been stronger! I hope you enjoy your sobriety, much love to you and your special person! xo",
                          "timestamp": "2022-06-12 13:11:26",
                          "score": 13,
                          "num_children": 1,
                          "author": 177010,
                          "replies": [
                            {
                              "id": "ic37ng0",
                              "text": "It’s a special feeling when you know the trappings of addiction but found a way out x",
                              "timestamp": "2022-06-12 14:08:11",
                              "score": 8,
                              "num_children": 0,
                              "author": 386730,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ic2oqxs",
                          "text": "Haha I really love how you put that.\n\nIs a sober sex addict not getting any?",
                          "timestamp": "2022-06-12 10:43:42",
                          "score": -8,
                          "num_children": 0,
                          "author": 181655,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ic27b1f",
                      "text": "Sure but you’re both just waiting for something better to come along aren’t you? That sounds pretty lonely to me.",
                      "timestamp": "2022-06-12 06:23:31",
                      "score": -33,
                      "num_children": 5,
                      "author": 67326,
                      "replies": [
                        {
                          "id": "ic2bw7z",
                          "text": "You don’t have to be married to be committed to someone for life. Some people view marriage as nothing more than a piece of paper and choose not to.",
                          "timestamp": "2022-06-12 07:28:18",
                          "score": 19,
                          "num_children": 1,
                          "author": 301306,
                          "replies": [
                            {
                              "id": "ic3td6s",
                              "text": "Most don't really see the difference until one of you is in the hospital or dies and then the legal document that would have established you as next of kin really changes things up (in the US). \n\nThere were unmarried people who got severe covid and the hospital legally had to go to their mother rather than their partner for who gets to receive information, make medical decisions and visit. \n\nThere are also unmarried people (especially on the personalfinance sub) whose partner dies and suddenly find they now legally co-own their home with their partner's parent or sibling, whoever was the legal default next of kin to inherit.\n\nThe couple in the Supreme Court case that recognized the right to gay marriage was fighting for it because one of them was terminally ill and they wanted the same end of life rights and inheritance rights as straight married couples. \n\nThere's ways to get around marriage by making sure your will, advance directive, deed, car title, power of attorney, etc. documents are all individually up to date and filed with the correct authority, but most people don't have the time or access to legal help to keep up with all this.",
                              "timestamp": "2022-06-12 17:01:20",
                              "score": 2,
                              "num_children": 0,
                              "author": 132310,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ic2gfom",
                          "text": "I have been with my partner for nearly 8 years,  I love her and I am fully committed to her. \n\nWe have no burning desire to get married right now - there are so many other things we want to do & spend our money on! We've spoken about it and marriage is something we want eventually, but it's far from priority number one and that doesn't mean we aren't committed. \n\nNot everyone has the same priorities as you & that's OK.",
                          "timestamp": "2022-06-12 08:36:34",
                          "score": 12,
                          "num_children": 1,
                          "author": 179908,
                          "replies": [
                            {
                              "id": "ic2l5ne",
                              "text": "Have been with my SO for 23 years, have 2 kids (4 and 7), have travelled the world together and own our home.\n\nNot married. Well probably elope at some point, but right now we're living life to the full.\n\nEdit: we live in Australia",
                              "timestamp": "2022-06-12 09:49:33",
                              "score": 10,
                              "num_children": 2,
                              "author": 350539,
                              "replies": [
                                {
                                  "id": "ic2tjd8",
                                  "text": "But why not just go to the court and sign the paper just for the sake of better tax rate or easier benefit and beneficiary. I don't see what is the downside of just signing the paper?",
                                  "timestamp": "2022-06-12 11:46:24",
                                  "score": 8,
                                  "num_children": 1,
                                  "author": 179707,
                                  "replies": [
                                    {
                                      "id": "ic2xbj6",
                                      "text": "They have been together long enough that they are classed as defacto so signing the bitof paper makes no difference in regards to benefits etc. And after having a quick look at their profile they are in Australia so the tax rate doesn't apply as far as I am aware. Pretty much the same as here in NZ",
                                      "timestamp": "2022-06-12 12:29:03",
                                      "score": 8,
                                      "num_children": 2,
                                      "author": 140145,
                                      "replies": [
                                        {
                                          "id": "ic30j97",
                                          "text": "Ding ding ding! We have a winner.\n\nPretty much makes no difference.",
                                          "timestamp": "2022-06-12 13:01:43",
                                          "score": 3,
                                          "num_children": 2,
                                          "author": 350539,
                                          "replies": [
                                            {
                                              "id": "ic36c71",
                                              "text": "Obviously it depends on country, but in the US, marriage grants important benefits that are difficult or impossible to get otherwise.",
                                              "timestamp": "2022-06-12 13:56:37",
                                              "score": 4,
                                              "num_children": 0,
                                              "author": 359291,
                                              "replies": []
                                            },
                                            {
                                              "id": "ic6cy6z",
                                              "text": "That is not accurate in the United States.",
                                              "timestamp": "2022-06-13 06:39:02",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 67326,
                                              "replies": [
                                                {
                                                  "id": "ic6hdme",
                                                  "text": "Indeed. Just one of the many reasons I'd never live there.",
                                                  "timestamp": "2022-06-13 07:42:13",
                                                  "score": 2,
                                                  "num_children": 1,
                                                  "author": 350539,
                                                  "replies": [
                                                    {
                                                      "id": "ic8f3z5",
                                                      "text": "Very reasonable. It’s just frustrating because Americans are definitely reading this stuff and thinking it applies to them. \n\nThey leave their widows and children holding all of their debts with no access to any of their benefits. It’s a despicable thing to do to someone you claim to love.",
                                                      "timestamp": "2022-06-13 18:34:58",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "author": 67326,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "ic3vdxk",
                                          "text": "The US states have been going the opposite direction and removing common law marriage from the books. The argument is that, in the event of severe illness/death/break up, the state and institutions shouldn't have to try to guess at how serious you intended your relationship to be. That you should file the paperwork to obtain that legal status if it's what you want. (And you don't have to throw a party to get married.)\n\nSome people may have a relationship that petered out to become more of a roommate situation where it didn't make financial sense to move out or are otherwise not very committed or in a gray area. I know I dated a guy for seven years whom I would be horrified if the state decided he had de facto spousal rights to medical and financial decisions and inheritance of my estate.",
                                          "timestamp": "2022-06-12 17:17:03",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 132310,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "ic6cvvb",
                                  "text": "You and your kids are unlikely to qualify for SSI if something happens to him, do you understand that? If you live in the right state, you can fill out a mountain of paperwork and cross your fingers, but the frail safetynet the country has built for widows will be extremely difficult for you to access. Why is ‘living life to the full’ more important than taking a quick trip to the courthouse to ensure your children are legally protected?",
                                  "timestamp": "2022-06-13 06:38:10",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 67326,
                                  "replies": [
                                    {
                                      "id": "ic6gyd8",
                                      "text": "A) we live in Aus, not a shithole country.\n\nB) am the dad, we have life insurance that pays all our debts in case anything happens, healthcare is not a problem in Australia. It's literally free for most stuff.\n\nC) as a defacto relationship, we have literally exactly the same protections as someone with a piece of paper.",
                                      "timestamp": "2022-06-13 07:35:59",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 350539,
                                      "replies": [
                                        {
                                          "id": "ic8dt0b",
                                          "text": "I wish we had flags or something that said where everyone was from. I assure you Americans are reading your words and applying them to *their* families like they live in a country that gives a shit about them.\n\nI have sobbing widows* in my office daily because they believed their bf that ‘it’s just a piece of paper’. They and their children are left impoverished and there’s nothing to be done to help them. \n\nThat piece of paper is essential here. Maybe not elsewhere, but America was founded by puritans and our laws still reflect that. A lawyer cannot craft a marital equivalent for you here, hence the aggressive push for gay marriage.",
                                          "timestamp": "2022-06-13 18:25:37",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 67326,
                                          "replies": [
                                            {
                                              "id": "ic90y8u",
                                              "text": "I added an edit, I'll remember to mention that in future. Thanks.",
                                              "timestamp": "2022-06-13 21:08:06",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 350539,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ic2lfj7",
                          "text": "Married people do the same thing, it doesn’t mean you’ll definitely stay together.",
                          "timestamp": "2022-06-12 09:53:46",
                          "score": 4,
                          "num_children": 0,
                          "author": 413125,
                          "replies": []
                        },
                        {
                          "id": "ic2lnzb",
                          "text": "My first gf was aboriginal, we dated long enough where we talked about marriage, and her thought was that it was just another way for the gov’t to mess with her people. The idea of signing a contract with someone to say you love them was weird to her.  Just pointing out there are many perspectives on marriage",
                          "timestamp": "2022-06-12 09:57:26",
                          "score": 3,
                          "num_children": 0,
                          "author": 263862,
                          "replies": []
                        },
                        {
                          "id": "ic2o7jq",
                          "text": "Been together 8yrs, engaged for 6.  Was postponed for a multitude of financial and tax reasons.  Both of us work full time, and my job lets you share benefits with a domestic partnership, so she gets her choice of insurance, etc...",
                          "timestamp": "2022-06-12 10:35:40",
                          "score": 2,
                          "num_children": 1,
                          "author": 246341,
                          "replies": [
                            {
                              "id": "ic6d3wm",
                              "text": "I understand delaying your wedding. That’s a different decision than delaying your marriage.",
                              "timestamp": "2022-06-13 06:41:11",
                              "score": 1,
                              "num_children": 0,
                              "author": 67326,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ic26oxn",
                  "text": "Uhm what makes them sacks of shit lol",
                  "timestamp": "2022-06-12 06:15:13",
                  "score": -9,
                  "num_children": 1,
                  "author": 267497,
                  "replies": [
                    {
                      "id": "ic2y18e",
                      "text": "Seriously! It's understandable and okay to have reservations about marriage. Sure some people just get bored, stop growing, become resentful, etc. That absolutely happens, but my ex-wife would get blackout drunk and occasionally use meth (oddly alcohol was the far bigger problem) and sucker punch me in the eye or throw things or stomp on my face. If I hadn't been married I could have just washed my hands of it and walked away. You're not a sack of shit for doubting the whole concept.",
                      "timestamp": "2022-06-12 12:36:31",
                      "score": -4,
                      "num_children": 1,
                      "author": 2283,
                      "replies": [
                        {
                          "id": "ic35aw3",
                          "text": "And she didn't start abusing you until after you got married?   \n\nAlso 'you shouldn't get married because you may need to cut and run at a moments notice one day' is pretty damn sad.  Maybe it doesn't make them a 'sack of shit' but the sad part is dead on.",
                          "timestamp": "2022-06-12 13:47:17",
                          "score": 5,
                          "num_children": 2,
                          "replies": [
                            {
                              "id": "ic36360",
                              "text": "Cut and run? Fucker, you don't know me or what I had to suffer through. It wasn't a decision made on a whim and for years I felt absolutely trapped. People can be very good at hiding who they are until it's too late.\n\nAlso, marriage absolutely *can* be for some people but acting like anyone who doesn't want it, many of whom have good reasons, are \"sad\" is a shit take that rejects all nuance.",
                              "timestamp": "2022-06-12 13:54:23",
                              "score": -1,
                              "num_children": 1,
                              "author": 2283,
                              "replies": [
                                {
                                  "id": "ic3cc73",
                                  "text": ">It wasn't a decision made on a whim and for years I felt absolutely trapped.\n\nYeah I know.  You specifically said this was because you were married.  That means that you believe if you weren't married then you could've cut and run a lot sooner.  What part did I miss here?   You seem to be taking offense to things I never said.  Calm down there bud.",
                                  "timestamp": "2022-06-12 14:48:05",
                                  "score": 4,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "ic3d239",
                                      "text": "Because the phrase \"cut and run\" has only negative connotations. It implies that instead of just taking whatever she threw at me, I ran at the first sign of trouble. How would that not be offensive? I tried to make it work for years and she refused to change.  And yes, had I not been married it would have been a lot easier to just leave and save myself a lot of grief, pain and therapy. What could possibly be wrong with that?",
                                      "timestamp": "2022-06-12 14:54:03",
                                      "score": -1,
                                      "num_children": 1,
                                      "author": 2283,
                                      "replies": [
                                        {
                                          "id": "ic3jsba",
                                          "text": "That is not what cut and run means. Also being married doesn't make you a slave...",
                                          "timestamp": "2022-06-12 15:47:40",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 286972,
                                          "replies": [
                                            {
                                              "id": "ic3kh9c",
                                              "text": "That's absolutely what cut and run means. The first google result is \"make a speedy or sudden departure from an awkward or hazardous situation rather than deal with it\".",
                                              "timestamp": "2022-06-12 15:52:58",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 2283,
                                              "replies": [
                                                {
                                                  "id": "ic3mlfq",
                                                  "text": "Why would you \"deal with\" something harmful? Would you not cut and run from someone trying to kill you? I certainly would.\n\nBut maybe your pride is more important to you than your life.",
                                                  "timestamp": "2022-06-12 16:09:22",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 286972,
                                                  "replies": [
                                                    {
                                                      "id": "ic3om2w",
                                                      "text": "Dude... \"Cut and run\" is usually applied to situations where the expectation is to tough it out and be dependable. As in being there for friends or loved ones through a difficult time instead of running away the moment it becomes inconvenient for you. *Not* when you're running from literal life-threatening danger. That's just called not being a dumbass.\n\nNot only are you not using the phrase correctly, but you're arguing with *me* about it when I wasn't the one using it in the first place. \"Cut and run\" isn't the right phrase to use when leaving someone who is a danger to others and themselves after you've tried everything else. The person I was originally replying to used it wrong and so did you.",
                                                      "timestamp": "2022-06-12 16:24:55",
                                                      "score": 2,
                                                      "num_children": 1,
                                                      "author": 2283,
                                                      "replies": [
                                                        {
                                                          "id": "ic43iya",
                                                          "text": "> \"Cut and run\" is usually applied to situations where the expectation is to tough it out and be dependable. As in being there for friends or loved ones through a difficult time instead of running away the moment it becomes inconvenient for you. Not when you're running from literal life-threatening danger. That's just called not being a dumbass.\n\nNo, it's both. It's just dropping everything to GTFO of there, justified or not. Sometimes it's a bad thing. Sometimes it's  a necessary thing.\n\n>Not only are you not using the phrase correctly, but you're arguing with me about it when I wasn't the one using it in the first place. \"Cut and run\" isn't the right phrase to use when leaving someone who is a danger to others and themselves after you've tried everything else. The person I was originally replying to used it wrong and so did you.\n\nNo, your definition is just too narrow. The phrase in fact comes from sailing, and was originally *only the necessary definition*:\n\n>Cut and run or cut-and-run is an idiomatic verb phrase meaning to \"make off promptly\" or to \"hurry off\". The phrase was in use by the 1700s to describe an act allowing a ship to make sail quickly in an urgent situation, by cutting free an anchor.\n\nFrom Wikipedia. https://en.wikipedia.org/wiki/Cut_and_run\n\nThough it does also note its pejorative use, specifically in politics though, in reference to withdrawal from war.",
                                                          "timestamp": "2022-06-12 18:19:50",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 286972,
                                                          "replies": [
                                                            {
                                                              "id": "ic45kgx",
                                                              "text": "You're being deliberately obtuse. It doesn't matter how it was originally used if almost no one uses the phrase in a positive or even neutral way. \"Way to cut and run, bud! Good going!\" Even if it wasn't meant to be, it just sounds sarcastic because no one uses it to mean something good. I was making a legitimate point about victims of abuse having every right to be disdainful of marriage and this is what people seize on. Reddit's a real shit hole.",
                                                              "timestamp": "2022-06-12 18:35:29",
                                                              "score": 2,
                                                              "num_children": 1,
                                                              "author": 2283,
                                                              "replies": [
                                                                {
                                                                  "id": "ic466ri",
                                                                  "text": "> It doesn't matter how it was originally used if almost no one uses the phrase in a positive or even neutral way.\n\nYes they do. Whenever they're in a dangerous situation and have to leave.\n\n>\"Way to cut and run, bud! Good going!\"\n\nNo one uses that phrasing for *anything*, man. Have you never received praise before? How about this:\n\n>You did the only thing you could, man. You were brave. Not everyone has the courage to cut and run when they're in that deep.\n\nDon't even try and pretend this isn't possible.\n\n>Even if it wasn't meant to be, it just sounds sarcastic because no one uses it to mean something good.\n\nI'm not saying \"good\". It's not like it's a compliment. It's just a description of a desperate retreat. Killing isn't a good thing either, but you'd still be praised for doing it to rescue someone. Not everything's black and white.\n\n>I was making a legitimate point about victims of abuse having every right to be disdainful of marriage and this is what people seize on.\n\nUh, no, people are talking about other things, too. I just happen to be one of like... Two people... Who are disputing the semantics of this phrase. Sorry dude?",
                                                                  "timestamp": "2022-06-12 18:40:05",
                                                                  "score": 2,
                                                                  "num_children": 1,
                                                                  "author": 286972,
                                                                  "replies": [
                                                                    {
                                                                      "id": "ic483ra",
                                                                      "text": "Dude maybe you're right, I don't know. The only context I've *ever* heard anyone say it is when they obviously feel the person should have stuck around for whatever it is. I've only ever heard it as a negative. I read, watch television/movies, listen to podcasts, occasionally radio. I've never heard it any other way.\n\nIn that context I took pretty serious offense to the other guy's use of that phrase, again a phrase I've only ever heard in a negative light, because that particular topic is pretty charged for me. Because I was abused. I didn't need to make this all about me and suggest that Reddit was a shit hole because of your behavior. I'm sorry about that.",
                                                                      "timestamp": "2022-06-12 18:54:26",
                                                                      "score": 2,
                                                                      "num_children": 1,
                                                                      "author": 2283,
                                                                      "replies": [
                                                                        {
                                                                          "id": "ic4a723",
                                                                          "text": "No, it's fine. I could have shown more empathy, too. I promise that guy wasn't meaning to insult. But well done on eventually running, even if you didn't cut and made preparations first haha.",
                                                                          "timestamp": "2022-06-12 19:10:22",
                                                                          "score": 2,
                                                                          "num_children": 0,
                                                                          "author": 286972,
                                                                          "replies": []
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "ic3bijl",
                              "text": "And yes, she didn't start the abuse until we'd already been married for a year. No, I didn't deserve it or bring it on myself. My entire point is that marriage can work for a lot of people but for people who have been abused, getting married can sound like the worst idea in the world. You can become isolated and trapped with very little recourse. Are victims of abuse sad to you?",
                              "timestamp": "2022-06-12 14:41:13",
                              "score": 0,
                              "num_children": 1,
                              "author": 2283,
                              "replies": [
                                {
                                  "id": "ic3dexe",
                                  "text": ">My entire point is that marriage can work for a lot of people\n\nSo your entire point was to make a completely irrelevant observation to the conversation at hand?  No one is saying that every person who doesn't value marriage is a sad sack.  They saying that people who go online and try to convince everyone that marriage as a concept has absolutely no value are sad sacks.  It's one thing for a person to have a personal reason for not wanting to get married and another for that person to use their personal reason in a quest to convince the world that it's a horrible institution.  The latter are sad sacks, absolutely.",
                                  "timestamp": "2022-06-12 14:57:00",
                                  "score": 3,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "ic3e15d",
                                      "text": "I didn't see anyone else make that distinction in this entire thread but if that's where you're coming from, maybe we're arguing for no reason. I'm sorry I called you a fucker.",
                                      "timestamp": "2022-06-12 15:02:01",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 2283,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ic3s436",
              "text": "Those are incels and deeply hurt men, I can't blame the latter but incels are a big no",
              "timestamp": "2022-06-12 16:51:37",
              "score": 2,
              "num_children": 0,
              "author": 279957,
              "replies": []
            },
            {
              "id": "ic2lq0v",
              "text": "Yes, this would be impossible without being married?",
              "timestamp": "2022-06-12 09:58:19",
              "score": -1,
              "num_children": 0,
              "author": 2080,
              "replies": []
            },
            {
              "id": "ic1s0a1",
              "text": "hmm, I mean this is all wholesome, I dont wanna be that guy and start this again, but like, I wanna know why thats super negative to you?\n\nMy 2c is you can be totally in love and happy and not need a government certificate.\n\nI would agree, the institution as it exists today with our current social climate, yeah it has no value.\n\nIts not like the days of the church where keeping a marriage together was a prime concern, and you were effectively locking fates together. Today its basically just like, dating+\n\nA slight tax break and total financial ruin if you are one in the 70% of marriages that fail. Why is this a good idea, again? How does this improve our lives?\n\nWhy would you ever, for any reason, sign a legally binding contract that states that you loose half your shit if another human being gets bored ever. I dont understand why you would want to be married in this year of our lord 2022",
              "timestamp": "2022-06-12 03:32:27",
              "score": -30,
              "num_children": 3,
              "author": 377823,
              "replies": [
                {
                  "id": "ic1ta5h",
                  "text": "Where did you get the 70% figure?",
                  "timestamp": "2022-06-12 03:45:09",
                  "score": 27,
                  "num_children": 1,
                  "author": 402392,
                  "replies": [
                    {
                      "id": "ic1utf5",
                      "text": "Oh it looks like thats for 3rd marriages. For first its about 50%, which is still ridiculous.\n\nThe very fact that they count up to 3rd marriages like thats a totally normal thing... kinda sums up why this is a terrible idea.\n\nMarriage today is largely coasting on its old reputation. If you proposed the idea today, like we invented it today nobody had ever heard of it before, absolutely nobody would participate.\n\nGet a promise ring if want that feeling of commitment. Today, legally, its got just as much power to keep things together and its not the equivalent of going all in on red at the casino for minor payout and total loss, but the little roulette ball is someones emotions.\n\nActually, thats a pretty good summary of how terrible the idea is today. Its literally a better idea to take out half of absolutely everything you own, go to the casino and bet it all on black.\n\nThat, today, is a sounder decision for your future than marriage.",
                      "timestamp": "2022-06-12 04:00:54",
                      "score": -22,
                      "num_children": 2,
                      "author": 377823,
                      "replies": [
                        {
                          "id": "ic2o1jx",
                          "text": "The statistic of 50% is heavily misleading, as most marriages fail within the first 2 years and most that fail are 2nd, 3rd, 4th etc. That just counts no of marriages failing rather than number of people in committed relationships who end up divorcing, which is significantly smaller.",
                          "timestamp": "2022-06-12 10:33:16",
                          "score": 21,
                          "num_children": 0,
                          "author": 398792,
                          "replies": []
                        },
                        {
                          "id": "ic32y7d",
                          "text": "The 50% number is outdated. Divorce rates have been steadily falling since peaking in the 80's. I believe it's below 40% now.",
                          "timestamp": "2022-06-12 13:25:09",
                          "score": 8,
                          "num_children": 1,
                          "author": 234600,
                          "replies": [
                            {
                              "id": "ic36obm",
                              "text": "There’s never been an accurate number in the first place in the US as states don’t all report stuff or report the same things.",
                              "timestamp": "2022-06-12 13:59:37",
                              "score": 3,
                              "num_children": 1,
                              "author": 359291,
                              "replies": [
                                {
                                  "id": "ic3crr2",
                                  "text": "True, but I imagine that the state reporting isn't changing so much on an annual basis as to impact year-over-year data / trends. I'd love to check out any articles or resources on the topic though if you have some to share.",
                                  "timestamp": "2022-06-12 14:51:39",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 234600,
                                  "replies": [
                                    {
                                      "id": "ic3d5nc",
                                      "text": "I honestly can’t remember where I saw the thing about reporting being a factor, it’s been many years, but here’s an article about the myth of the 50% divorce rate. https://www.goldbergjones-or.com/divorce/50-divorce-rate-lie/",
                                      "timestamp": "2022-06-12 14:54:51",
                                      "score": 3,
                                      "num_children": 1,
                                      "author": 359291,
                                      "replies": [
                                        {
                                          "id": "ic5qxbu",
                                          "text": "Awesome, thanks for that! I did some digging myself, and found this research brief that discusses some of the difficulties in getting an accurate divorce rate, including details about the state by state issues you mentioned. Ultimately it seems that the most accurate assessment method still has the divorce rate at 50% at its peak, but it's an interesting read about the challenges involved. Thanks for that rabbit hole! https://www.healthymarriageinfo.org/wp-content/uploads/2017/12/Interpreting-Divorce-Rat.pdf",
                                          "timestamp": "2022-06-13 02:31:51",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 234600,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ic2x9v1",
                  "text": "Just because it’s of no value to you doesn’t mean it’s of no value to others. You don’t get to tell other people what they should or shouldn’t value. \n\nHow does it improve my life you ask? Because I believe it does. IMO, the risk makes it more valuable. Doing something with another despite the risk is a huge demonstration of love. Good luck to you friend if you think value of love needs to be quantified or completely rational.",
                  "timestamp": "2022-06-12 12:28:33",
                  "score": 14,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ic3l2yo",
                      "text": "Where in his comments are you getting \"love needs to be quantified\" from? I don't think that's his standpoint - in fact I think it's the opposite and I'd argue that marriage and the laws surrounding it are what attempt to quantify it if anything, not the lack thereof",
                      "timestamp": "2022-06-12 15:57:40",
                      "score": 1,
                      "num_children": 1,
                      "author": 35188,
                      "replies": [
                        {
                          "id": "ic4g9fq",
                          "text": "What!?",
                          "timestamp": "2022-06-12 19:57:21",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ic4hw91",
                              "text": "What what?",
                              "timestamp": "2022-06-12 20:09:58",
                              "score": 1,
                              "num_children": 0,
                              "author": 35188,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ic2hf2r",
                  "text": "Just get a prenup, if you're that worried about financial ruin.\n\nGet a prenup, regardless of if you're worried. Everyone should get a prenup. That should just be default, today.",
                  "timestamp": "2022-06-12 08:51:45",
                  "score": 8,
                  "num_children": 2,
                  "author": 11389,
                  "replies": [
                    {
                      "id": "ic2iuh1",
                      "text": "Pre-nups aren't always legally binding. And even if they were, I feel like having a opt-out one would cause more harm than good.",
                      "timestamp": "2022-06-12 09:13:52",
                      "score": -2,
                      "num_children": 1,
                      "author": 186223,
                      "replies": [
                        {
                          "id": "ic2u1xy",
                          "text": "A competent lawyer will make sure the prenup is binding. It might not be possible to put everything you want in it, though. \n\nThere are many different kinds of prenups. Obviously, having the strictest separation as default isn't good, but especially in the case of DINK marriages, things should be more separated than they currently are, by default. \n\nAnother good option would be the requirement to make an active choice, instead of just having a default. That would at least require people to think about it beforehand, rather than having a rude awakening when divorce happens.",
                          "timestamp": "2022-06-12 11:52:21",
                          "score": -1,
                          "num_children": 0,
                          "author": 11389,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ic2mzlp",
                      "text": "\"Everyone should get a prenup. That should just be default, today.\"\n\nOh, and why is that? Go ahead, say it out loud.\n\nThats why the value proposition of marriage is near zero today.",
                      "timestamp": "2022-06-12 10:17:24",
                      "score": -13,
                      "num_children": 2,
                      "author": 377823,
                      "replies": [
                        {
                          "id": "ic2vsgx",
                          "text": "I understand you feel this way about marriage, and you are entirely free to never get married. The fact that you try to depict someone else’s choice, though, as valueless is pretty terrible. It works for some, not for others, and in my opinion it’s best not to judge another’s decision as valueless when it comes to marriage.",
                          "timestamp": "2022-06-12 12:12:16",
                          "score": 11,
                          "num_children": 0,
                          "author": 347010,
                          "replies": []
                        },
                        {
                          "id": "ic40lch",
                          "text": ">Oh, and why is that? Go ahead, say it out loud.\n\nBecause marriage law is lagging behind the reality of most people's life by about 50-100 years. It's still assuming single income families with multiple kids and traditional gender roles. Prenups are a way to fix that. \n\n\n>Thats why the value proposition of marriage is near zero today.\n\nThe value proposition of a marriage is the tax and legal benefits you get while it lasts. It also offers financial safety for a spouse who takes a hit to their career for child rearing purposes.     \nThat's it, and it doesn't need any more value. In fact, I'd be all in favor of making the child rearing stuff independent from actual marriage.\n\nIf you don't want/need those values, don't get married.",
                          "timestamp": "2022-06-12 17:57:06",
                          "score": 2,
                          "num_children": 0,
                          "author": 11389,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ic2sy5j",
              "text": "This can happen without marriage, though?",
              "timestamp": "2022-06-12 11:39:54",
              "score": -4,
              "num_children": 0,
              "author": 324961,
              "replies": []
            },
            {
              "id": "ic31wuj",
              "text": "Link?",
              "timestamp": "2022-06-12 13:15:14",
              "score": 0,
              "num_children": 0,
              "author": 408806,
              "replies": []
            },
            {
              "id": "ic37wsi",
              "text": "So we have to be married to receive this treatment?",
              "timestamp": "2022-06-12 14:10:29",
              "score": -3,
              "num_children": 0,
              "author": 8678,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ic0w0r0",
      "text": "I appreciate that this is so wholesome. I'm glad you played along like you didn't know what was going on. It might be worth mentioning at some point that you occasionally forget about your birthday, just in case you aren't able to be as sneaky in the future.",
      "timestamp": "2022-06-11 22:42:08",
      "score": 6877,
      "num_children": 4,
      "author": 367593,
      "replies": [
        {
          "id": "ic0wmwj",
          "text": "Haha she knows! But she still tries so I just go with. And she was workin so hard I didn’t wanna tell her I knew 😂😂.",
          "timestamp": "2022-06-11 22:47:23",
          "score": 2966,
          "num_children": 11,
          "replies": [
            {
              "id": "ic1qrkc",
              "text": "I can definitely relate cuz I grew up this way. I forgot my bday this year and my folks were wondering why I wasn't so excited about this or that. When you don't celebrate it cuz of what happened growing up for many years, it's not easy getting excited after what happened. \n\nWe ended up doing a Bob Ross painting party. It was unexpected for me and we had fun.",
              "timestamp": "2022-06-12 03:20:24",
              "score": 190,
              "num_children": 5,
              "author": 354952,
              "replies": [
                {
                  "id": "ic1qzv3",
                  "text": "Totally get it, but I’m glad you had fun you deserve it !! 🙏🙏",
                  "timestamp": "2022-06-12 03:22:33",
                  "score": 97,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ic1r5jp",
                      "text": "Likewise to you. I think we all need people like whom we have in our lives to let people like us know we deserve it.",
                      "timestamp": "2022-06-12 03:24:05",
                      "score": 49,
                      "num_children": 1,
                      "author": 354952,
                      "replies": [
                        {
                          "id": "ic1rf98",
                          "text": "I totally agree everyone needs that reassurance at\nSome point.",
                          "timestamp": "2022-06-12 03:26:42",
                          "score": 41,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ic1rjin",
                              "text": "Happy birthday 🎂",
                              "timestamp": "2022-06-12 03:27:51",
                              "score": 12,
                              "num_children": 1,
                              "author": 354952,
                              "replies": [
                                {
                                  "id": "ic1rmcu",
                                  "text": "Thank you !! Birthday 🙏",
                                  "timestamp": "2022-06-12 03:28:37",
                                  "score": 18,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ic23mn4",
                  "text": "Bob Ross painting party ftw! But you gotta have that liquid white...",
                  "timestamp": "2022-06-12 05:35:43",
                  "score": 8,
                  "num_children": 1,
                  "author": 339089,
                  "replies": [
                    {
                      "id": "ic253ev",
                      "text": "I gotta have my painter's hairstyle *puts afro wig*",
                      "timestamp": "2022-06-12 05:53:56",
                      "score": 8,
                      "num_children": 0,
                      "author": 354952,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ic30vbz",
                  "text": "lol, you cant just drop the info of a bob ross painting party and not explain in excruciating detail what it is! Did you all get together and follow a tutorial? Was there Bob Ross decoration?   \nI know nothing of it yet it sounds like a blast lmao",
                  "timestamp": "2022-06-12 13:05:00",
                  "score": 8,
                  "num_children": 0,
                  "author": 145414,
                  "replies": []
                },
                {
                  "id": "ic2z343",
                  "text": "Grew up same way. It’s always an odd time of year with Father’s Day and my birthday so close.",
                  "timestamp": "2022-06-12 12:47:18",
                  "score": 2,
                  "num_children": 0,
                  "author": 17984,
                  "replies": []
                },
                {
                  "id": "ic3f9c8",
                  "text": "That sounds amazing!!",
                  "timestamp": "2022-06-12 15:11:56",
                  "score": 1,
                  "num_children": 1,
                  "author": 179596,
                  "replies": [
                    {
                      "id": "ic3rtda",
                      "text": "It was. We went to the beach and had liquid nitrogen made ice cream prior to painting. I've never painted with acrylics before, but it was fun to where I can see why Ross loves doing it.",
                      "timestamp": "2022-06-12 16:49:23",
                      "score": 4,
                      "num_children": 0,
                      "author": 354952,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ic1bagk",
              "text": "You got a great wife there. And you are a great husband by putting her feelings first. You deserve a great birthday. Happy birthday!",
              "timestamp": "2022-06-12 00:58:30",
              "score": 860,
              "num_children": 1,
              "author": 277906,
              "replies": [
                {
                  "id": "ic1q43w",
                  "text": "[removed]",
                  "timestamp": "2022-06-12 03:14:16",
                  "score": 119,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ic1rl3u",
                      "text": "[removed]",
                      "timestamp": "2022-06-12 03:28:17",
                      "score": 31,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ic2nv8q",
                          "text": "This comment was made by a bot, copy/pasted from the first line of the first comment in the chain. Bots use tactics like this to gain karma to look more \"legitimate\" and they're getting harder to tell from real comments. Check their acct history, clearly a bot. Report comment and account please!",
                          "timestamp": "2022-06-12 10:30:36",
                          "score": 1,
                          "num_children": 0,
                          "author": 3483,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ic1pej7",
              "text": "I wonder if, in a year or two, she might find this as funny as the rest of us. You might be able to share it one day.",
              "timestamp": "2022-06-12 03:07:21",
              "score": 26,
              "num_children": 1,
              "author": 18653,
              "replies": [
                {
                  "id": "ic1s9fp",
                  "text": "I wonder if she already knows lol\nWomen just know these things cause we are magical 😂",
                  "timestamp": "2022-06-12 03:35:01",
                  "score": 17,
                  "num_children": 1,
                  "author": 334553,
                  "replies": [
                    {
                      "id": "ic2iv6k",
                      "text": "Can confirm. Women’s intuition is just topnotch.",
                      "timestamp": "2022-06-12 09:14:11",
                      "score": 4,
                      "num_children": 0,
                      "author": 195269,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ic144im",
              "text": "[removed]",
              "timestamp": "2022-06-11 23:53:37",
              "score": 86,
              "num_children": 1,
              "replies": [
                {
                  "id": "ic1b968",
                  "text": "Thank you 🙏 haha",
                  "timestamp": "2022-06-12 00:58:09",
                  "score": 67,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ic1q46q",
                      "text": "np yw",
                      "timestamp": "2022-06-12 03:14:17",
                      "score": 1,
                      "num_children": 0,
                      "author": 354698,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ic1nq9y",
              "text": "Love to see a wholesome tifu and not sex ridden stories",
              "timestamp": "2022-06-12 02:51:45",
              "score": 37,
              "num_children": 0,
              "author": 325811,
              "replies": []
            },
            {
              "id": "ic1p8sr",
              "text": "Man thank you for this wholesome post you made my shitty day into a good day",
              "timestamp": "2022-06-12 03:05:53",
              "score": 33,
              "num_children": 1,
              "author": 33868,
              "replies": [
                {
                  "id": "ic1pbd9",
                  "text": "I’m glad. Hope you have a better day !! 🙏🙏",
                  "timestamp": "2022-06-12 03:06:32",
                  "score": 21,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ic1qy24",
                      "text": "And happy birthday I hope you have a wonderful weekend",
                      "timestamp": "2022-06-12 03:22:04",
                      "score": 12,
                      "num_children": 1,
                      "author": 33868,
                      "replies": [
                        {
                          "id": "ic1r4v4",
                          "text": "Thank you very much I hope you have a good weekend as well 🙏",
                          "timestamp": "2022-06-12 03:23:54",
                          "score": 10,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ic1r8gq",
                              "text": "I know my mom always says never ask someone age but how old are you now",
                              "timestamp": "2022-06-12 03:24:53",
                              "score": 6,
                              "num_children": 1,
                              "author": 33868,
                              "replies": [
                                {
                                  "id": "ic1rbir",
                                  "text": "I feel like I should ask why but who cares Im 28 😂",
                                  "timestamp": "2022-06-12 03:25:42",
                                  "score": 10,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ic1y4nz",
              "text": "Maybe jokingly say it's a good job I didn't come home early, guess I would have spoilt my own suprise.",
              "timestamp": "2022-06-12 04:34:35",
              "score": 1,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ic231cx",
              "text": "Honestly letting her know that you were so happy that you left to come back for your big surprise is cute in its own way. \n\nI am sure you were over the moon happy with her love for you and expressing that to her would fill her with joy.",
              "timestamp": "2022-06-12 05:28:42",
              "score": 1,
              "num_children": 0,
              "author": 398437,
              "replies": []
            },
            {
              "id": "ic2g91n",
              "text": "You lucky sod. Happy birthday and good on you for finding such a sweetheart.",
              "timestamp": "2022-06-12 08:33:43",
              "score": 1,
              "num_children": 0,
              "author": 192398,
              "replies": []
            },
            {
              "id": "ic2tnja",
              "text": "Could be worse. She could have been blowing your neighbor",
              "timestamp": "2022-06-12 11:47:43",
              "score": 1,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ic2wtvp",
              "text": "Well the surprise _did_ work! Just a little earlier than your wife expected. But she surprised you and you were hapoy, do that's a success in any case!",
              "timestamp": "2022-06-12 12:23:40",
              "score": 1,
              "num_children": 0,
              "author": 30861,
              "replies": []
            }
          ]
        },
        {
          "id": "ic1dvno",
          "text": "Heck, she probably thought the birthday itself was going to be a surprise to him.",
          "timestamp": "2022-06-12 01:21:56",
          "score": 31,
          "num_children": 1,
          "author": 159380,
          "replies": [
            {
              "id": "ic25g0q",
              "text": "Yep, this was definitely a case of ' He has no idea it's his b-day so he'll be at work like normal, he's going to be extra surprised!'",
              "timestamp": "2022-06-12 05:58:34",
              "score": 4,
              "num_children": 0,
              "author": 213643,
              "replies": []
            }
          ]
        },
        {
          "id": "ic1tjql",
          "text": "![gif](giphy|jUwpNzg9IcyrK)",
          "timestamp": "2022-06-12 03:47:55",
          "score": 55,
          "num_children": 0,
          "author": 384672,
          "replies": []
        },
        {
          "id": "ic2hn7y",
          "text": "Refreshing to see a TIFU that doesn’t involve shit or genetailia",
          "timestamp": "2022-06-12 08:55:19",
          "score": 16,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic10axa",
      "text": "Man that first half of the title made my heart drop. Thought you were gonna say you caught her cheating lol\n\nGlad it came out wholesome",
      "timestamp": "2022-06-11 23:19:47",
      "score": 4878,
      "num_children": 16,
      "author": 303718,
      "replies": [
        {
          "id": "ic131zu",
          "text": "That’s how it went for me 😅\n\nVery glad it was wholesome",
          "timestamp": "2022-06-11 23:44:02",
          "score": 734,
          "num_children": 3,
          "author": 1068,
          "replies": [
            {
              "id": "ic1k0ky",
              "text": "I can't believe your wife would cheat at your birthday party",
              "timestamp": "2022-06-12 02:18:24",
              "score": 85,
              "num_children": 2,
              "author": 177439,
              "replies": [
                {
                  "id": "ic1x069",
                  "text": "Scotty doesn't know",
                  "timestamp": "2022-06-12 04:22:51",
                  "score": 23,
                  "num_children": 1,
                  "author": 267936,
                  "replies": [
                    {
                      "id": "ic2g7tu",
                      "text": "That Fiona and me",
                      "timestamp": "2022-06-12 08:33:12",
                      "score": 4,
                      "num_children": 0,
                      "author": 90330,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ic2b9uj",
                  "text": "With the flour of all things",
                  "timestamp": "2022-06-12 07:19:17",
                  "score": 3,
                  "num_children": 1,
                  "author": 307585,
                  "replies": [
                    {
                      "id": "ic2futv",
                      "text": "She got that cake",
                      "timestamp": "2022-06-12 08:27:45",
                      "score": 3,
                      "num_children": 0,
                      "author": 150428,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ic1i06d",
              "text": "Technically in your case there was some hole, but not wholesome",
              "timestamp": "2022-06-12 01:59:45",
              "score": 161,
              "num_children": 4,
              "author": 368956,
              "replies": [
                {
                  "id": "ic1in1y",
                  "text": "L O L.\nThanks for that.",
                  "timestamp": "2022-06-12 02:05:37",
                  "score": 47,
                  "num_children": 1,
                  "author": 1068,
                  "replies": [
                    {
                      "id": "ic1my0k",
                      "text": "Don't worry, I still see you _as whole_",
                      "timestamp": "2022-06-12 02:44:44",
                      "score": 16,
                      "num_children": 0,
                      "author": 268140,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ic1orxn",
                  "text": "One of my great granduncles caught his wife cheating with a Catholic Priest on a train, and shot them both dead. He had a very holesome experience.",
                  "timestamp": "2022-06-12 03:01:33",
                  "score": 25,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ic1rpaa",
                      "text": "i would actually argue that **they** had a holesome experience",
                      "timestamp": "2022-06-12 03:29:26",
                      "score": 11,
                      "num_children": 0,
                      "author": 377951,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ic1nvnr",
                  "text": "Ahole?",
                  "timestamp": "2022-06-12 02:53:11",
                  "score": 3,
                  "num_children": 0,
                  "author": 29832,
                  "replies": []
                },
                {
                  "id": "ic35w6o",
                  "text": "Holesome",
                  "timestamp": "2022-06-12 13:52:38",
                  "score": 1,
                  "num_children": 0,
                  "author": 15507,
                  "replies": []
                }
              ]
            },
            {
              "id": "ic2g1mz",
              "text": "Reddit and cynicism go hand in hand 😅",
              "timestamp": "2022-06-12 08:30:35",
              "score": 5,
              "num_children": 0,
              "author": 300376,
              "replies": []
            }
          ]
        },
        {
          "id": "ic12ilc",
          "text": "Lmfao 😅",
          "timestamp": "2022-06-11 23:39:15",
          "score": 227,
          "num_children": 1,
          "replies": [
            {
              "id": "ic244cv",
              "text": "Man, you shouldn't come home early without informing your wife in advance if you want your marriage to last.",
              "timestamp": "2022-06-12 05:41:41",
              "score": -8,
              "num_children": 2,
              "replies": [
                {
                  "id": "ic2ubc4",
                  "text": "???",
                  "timestamp": "2022-06-12 11:55:28",
                  "score": 2,
                  "num_children": 0,
                  "author": 307387,
                  "replies": []
                },
                {
                  "id": "ic2vtn2",
                  "text": "Why?",
                  "timestamp": "2022-06-12 12:12:39",
                  "score": 2,
                  "num_children": 0,
                  "author": 43929,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ic1bvee",
          "text": "I'm in the same boat.",
          "timestamp": "2022-06-12 01:03:50",
          "score": 16,
          "num_children": 0,
          "author": 21950,
          "replies": []
        },
        {
          "id": "ic1mhcw",
          "text": "*Sometimes you think you have true love,\nAnd then you catch the early flight home from san diego,\nAnd a couple of nude people jump out of your bathroom\nBlindfolded like a goddamn magic show,\nReady to double-team your girlfriend and...*",
          "timestamp": "2022-06-12 02:40:28",
          "score": 34,
          "num_children": 2,
          "author": 116675,
          "replies": [
            {
              "id": "ic1ny3q",
              "text": "Great movie! You're my boy blue!",
              "timestamp": "2022-06-12 02:53:48",
              "score": 5,
              "num_children": 0,
              "author": 168999,
              "replies": []
            },
            {
              "id": "ic1quul",
              "text": "Sounds like your ex was getting ready for the gang bang!",
              "timestamp": "2022-06-12 03:21:13",
              "score": 3,
              "num_children": 0,
              "author": 160809,
              "replies": []
            }
          ]
        },
        {
          "id": "ic1gfoy",
          "text": "Imagine coming home to a creampie on your birthday.",
          "timestamp": "2022-06-12 01:45:15",
          "score": 21,
          "num_children": 2,
          "author": 304246,
          "replies": [
            {
              "id": "ic1le7i",
              "text": "they are delicious and children love to suck them down",
              "timestamp": "2022-06-12 02:30:47",
              "score": 11,
              "num_children": 1,
              "author": 297000,
              "replies": [
                {
                  "id": "ic1ulzb",
                  "text": "Wtf lol",
                  "timestamp": "2022-06-12 03:58:49",
                  "score": 2,
                  "num_children": 1,
                  "author": 387795,
                  "replies": [
                    {
                      "id": "ic26mp1",
                      "text": "I could be wrong but I believe they were referencing a silly joke from Sunny",
                      "timestamp": "2022-06-12 06:14:23",
                      "score": 1,
                      "num_children": 1,
                      "author": 267497,
                      "replies": [
                        {
                          "id": "ic3hvun",
                          "text": "Nice love that show need to watch it in its entirety.",
                          "timestamp": "2022-06-12 15:32:46",
                          "score": 2,
                          "num_children": 0,
                          "author": 387795,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ic1ye16",
              "text": "\"Want me to put a candle on it honey?\"",
              "timestamp": "2022-06-12 04:37:19",
              "score": 0,
              "num_children": 0,
              "author": 122917,
              "replies": []
            }
          ]
        },
        {
          "id": "ic1k33r",
          "text": "Cheating with a cake.",
          "timestamp": "2022-06-12 02:19:03",
          "score": 3,
          "num_children": 0,
          "author": 299011,
          "replies": []
        },
        {
          "id": "ic1jf14",
          "text": "It’s what I came here for! I was like uh oh, poor OP……this just got juicy 🍿",
          "timestamp": "2022-06-12 02:12:47",
          "score": 5,
          "num_children": 0,
          "author": 25378,
          "replies": []
        },
        {
          "id": "ic1n1rn",
          "text": "Haha same. I was so sad for him but thankfully that wasn't the case",
          "timestamp": "2022-06-12 02:45:43",
          "score": 2,
          "num_children": 0,
          "author": 269614,
          "replies": []
        },
        {
          "id": "ic1je7o",
          "text": "Fucking same",
          "timestamp": "2022-06-12 02:12:35",
          "score": 1,
          "num_children": 0,
          "author": 6759,
          "replies": []
        },
        {
          "id": "ic196zm",
          "text": "Poor guy didn't even get a ganger on his birthday",
          "timestamp": "2022-06-12 00:39:32",
          "score": -62,
          "num_children": 0,
          "author": 409369,
          "replies": []
        },
        {
          "id": "ic1ynxz",
          "text": "Same. But true glad is did came out well",
          "timestamp": "2022-06-12 04:40:19",
          "score": 1,
          "num_children": 0,
          "author": 105626,
          "replies": []
        },
        {
          "id": "ic1zlqd",
          "text": "I thought he was gonna walk in naked to surprise her and have a whole room of people just staring at him.",
          "timestamp": "2022-06-12 04:50:31",
          "score": 1,
          "num_children": 0,
          "author": 298000,
          "replies": []
        },
        {
          "id": "ic2c79y",
          "text": "i was totally expecting nekkidness in front of a dozen party guests.",
          "timestamp": "2022-06-12 07:32:51",
          "score": 1,
          "num_children": 0,
          "author": 125004,
          "replies": []
        },
        {
          "id": "ic2smwq",
          "text": "Yeah I went there too",
          "timestamp": "2022-06-12 11:36:02",
          "score": 1,
          "num_children": 0,
          "author": 192358,
          "replies": []
        },
        {
          "id": "ic2snxs",
          "text": "Yeah I went there too",
          "timestamp": "2022-06-12 11:36:22",
          "score": 1,
          "num_children": 0,
          "author": 192358,
          "replies": []
        },
        {
          "id": "ic2wksg",
          "text": "Haha, funny how most of us expected something bad to happen but we are instantly relieved when it’s wholesome. What’s wrong with our brains and expectations of society?!!",
          "timestamp": "2022-06-12 12:20:56",
          "score": 1,
          "num_children": 0,
          "author": 150524,
          "replies": []
        }
      ]
    },
    {
      "id": "ic0z1yt",
      "text": "Itd probably make for a good laugh for the two of you if you do tell her.",
      "timestamp": "2022-06-11 23:08:34",
      "score": 1772,
      "num_children": 2,
      "author": 316746,
      "replies": [
        {
          "id": "ic0z3co",
          "text": "I know I probably should 🤣🤣.",
          "timestamp": "2022-06-11 23:08:56",
          "score": 810,
          "num_children": 9,
          "replies": [
            {
              "id": "ic1658g",
              "text": "Noooo don't tell her!! At least not for a couple of years 😂",
              "timestamp": "2022-06-12 00:11:45",
              "score": 708,
              "num_children": 3,
              "author": 392419,
              "replies": [
                {
                  "id": "ic1m032",
                  "text": "It’s probably been 20 years\n\nNow everyone knows",
                  "timestamp": "2022-06-12 02:36:06",
                  "score": 188,
                  "num_children": 1,
                  "author": 32973,
                  "replies": [
                    {
                      "id": "ic1q30u",
                      "text": "Plot twist: She knew he knew and was playing along right on with him.",
                      "timestamp": "2022-06-12 03:13:58",
                      "score": 121,
                      "num_children": 2,
                      "author": 313641,
                      "replies": [
                        {
                          "id": "ic1y6mt",
                          "text": "That son of a bitch saw how exhausted I was but decided to sneak out on me. I called after him \"Mylo...Mylo...I saw you....get back here\" but nope, he pretended not to hear me.",
                          "timestamp": "2022-06-12 04:35:10",
                          "score": 69,
                          "num_children": 1,
                          "author": 122917,
                          "replies": [
                            {
                              "id": "ic215q8",
                              "text": "Lazy SOB didnt help me make the cake and made me do everything by myself. Incoming reddit post titled \"should i get a divorce\".",
                              "timestamp": "2022-06-12 05:07:44",
                              "score": 33,
                              "num_children": 1,
                              "author": 372472,
                              "replies": [
                                {
                                  "id": "ic27o8q",
                                  "text": "On r/relationships that sounds about right",
                                  "timestamp": "2022-06-12 06:28:33",
                                  "score": 4,
                                  "num_children": 0,
                                  "author": 311214,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ic20zmp",
                          "text": "But now he knows that I know that he knows. There is no backing down now!",
                          "timestamp": "2022-06-12 05:05:56",
                          "score": 8,
                          "num_children": 0,
                          "author": 320731,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ic1t4ui",
                  "text": "It's one of those \"renewing your vows\" stories.",
                  "timestamp": "2022-06-12 03:43:39",
                  "score": 26,
                  "num_children": 0,
                  "author": 53795,
                  "replies": []
                },
                {
                  "id": "ic29bsq",
                  "text": "Agree, lol",
                  "timestamp": "2022-06-12 06:51:37",
                  "score": 1,
                  "num_children": 0,
                  "author": 111195,
                  "replies": []
                }
              ]
            },
            {
              "id": "ic1c4hq",
              "text": "You tell her in a few years after one of you messes up and you are laughing about it.  you slip in a \"well its not as abad as when I ruined my own surprise party!\" and then explain.\n\nit will only bring more mirth.",
              "timestamp": "2022-06-12 01:06:04",
              "score": 59,
              "num_children": 2,
              "author": 280117,
              "replies": [
                {
                  "id": "ic213j3",
                  "text": "but never say \"ruined\", the words there gonna be key to have it go in a good mood ;)",
                  "timestamp": "2022-06-12 05:07:09",
                  "score": 8,
                  "num_children": 0,
                  "author": 78576,
                  "replies": []
                },
                {
                  "id": "ic27me9",
                  "text": "Nice word! I learned something new today, it's not often that I add to my vocabulary. Thanks!",
                  "timestamp": "2022-06-12 06:27:51",
                  "score": 1,
                  "num_children": 0,
                  "author": 340103,
                  "replies": []
                }
              ]
            },
            {
              "id": "ic1gust",
              "text": "Nahhhh.... It will change nothing but the piss. Let her have her surprise, you enjoy your innocent secret and let it be. Enjoy your day and surprise her on her next birthday.",
              "timestamp": "2022-06-12 01:49:04",
              "score": 16,
              "num_children": 0,
              "author": 276015,
              "replies": []
            },
            {
              "id": "ic13ijh",
              "text": "Maybe tell her after you did something special for *her* birthday..\n\nThen you can ask her if your  *“oh my god I’m so suprised face”*  face was convincing..",
              "timestamp": "2022-06-11 23:48:06",
              "score": 72,
              "num_children": 0,
              "author": 262716,
              "replies": []
            },
            {
              "id": "ic1rnid",
              "text": "Maybe get her a little surprise treat, like her favorite bakery cookies, it'll be funny for you to surprise her back.\n\nI'd do it sooner rather than later so that it acts to build trust that you'd tell her something promptly. All you need to do is make sure she doesn't feel foolish or embarrassed.",
              "timestamp": "2022-06-12 03:28:57",
              "score": 9,
              "num_children": 0,
              "author": 350052,
              "replies": []
            },
            {
              "id": "ic1so72",
              "text": "Tell her in 2-3 years",
              "timestamp": "2022-06-12 03:39:03",
              "score": 1,
              "num_children": 0,
              "author": 74751,
              "replies": []
            },
            {
              "id": "ic1wm9f",
              "text": "I think so,  share the laugh with her, but also let her know how much you care about her that you gave her the pleasure of surprising you.  If I was in her shoes I would totally want to know.  If you wait a couple of years, like other people are saying, then she might feel weird about how you held onto a deception for all that time. If you tell her now it's just wholesome and sweet.",
              "timestamp": "2022-06-12 04:19:05",
              "score": 1,
              "num_children": 0,
              "author": 287840,
              "replies": []
            },
            {
              "id": "ic27e83",
              "text": "In 10 years. Not before then",
              "timestamp": "2022-06-12 06:24:45",
              "score": 1,
              "num_children": 0,
              "author": 352006,
              "replies": []
            },
            {
              "id": "ic2w6r0",
              "text": "Give it some time first, maybe this time next year",
              "timestamp": "2022-06-12 12:16:47",
              "score": 1,
              "num_children": 0,
              "author": 80461,
              "replies": []
            }
          ]
        },
        {
          "id": "ic284ge",
          "text": "Honesty is what makes relationships work, that and cake.",
          "timestamp": "2022-06-12 06:34:45",
          "score": 1,
          "num_children": 0,
          "author": 300940,
          "replies": []
        }
      ]
    },
    {
      "id": "ic10vuc",
      "text": "Lol! This was so wholesome and *cute!!!* Didn’t know I needed to read something like this today, but I’m glad I did. \n\nI hope you thoroughly enjoyed your cake. It was definitely made with pure love.  :)",
      "timestamp": "2022-06-11 23:24:48",
      "score": 363,
      "num_children": 3,
      "author": 312599,
      "replies": [
        {
          "id": "ic12emw",
          "text": "It was a very good cake 🤣🤣",
          "timestamp": "2022-06-11 23:38:17",
          "score": 134,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ic16otw",
          "text": "Happy Cake Day!",
          "timestamp": "2022-06-12 00:16:40",
          "score": 29,
          "num_children": 1,
          "author": 384569,
          "replies": [
            {
              "id": "ic18533",
              "text": "Lol! Thank you.  :)",
              "timestamp": "2022-06-12 00:29:56",
              "score": 8,
              "num_children": 0,
              "author": 312599,
              "replies": []
            }
          ]
        },
        {
          "id": "ic1eitu",
          "text": "Happy Cake Day!",
          "timestamp": "2022-06-12 01:27:53",
          "score": 6,
          "num_children": 1,
          "author": 237698,
          "replies": [
            {
              "id": "ic1mdxw",
              "text": "Thank you!  :)",
              "timestamp": "2022-06-12 02:39:36",
              "score": 6,
              "num_children": 0,
              "author": 312599,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ic1nc2h",
      "text": "OP : \"I will be taking this secret to my grave\"\n\nAlso OP : \"Hey everybody on the entire Internet - here's my secret!\"",
      "timestamp": "2022-06-12 02:48:16",
      "score": 125,
      "num_children": 1,
      "author": 275398,
      "replies": [
        {
          "id": "ic1ng32",
          "text": "HAHAHA but at least *she* won’t know😂😂",
          "timestamp": "2022-06-12 02:49:15",
          "score": 55,
          "num_children": 1,
          "replies": [
            {
              "id": "ic36zr6",
              "text": ">HAHAHA but at least she won’t know😂😂\n\nBest way not to tell someone- tell total strangers. The urge to \"I've got a seeecrreeettttt!\" goes away.",
              "timestamp": "2022-06-12 14:02:27",
              "score": 7,
              "num_children": 0,
              "author": 253881,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ic1j6gy",
      "text": "Haha similar thing happened during 2020, my birthday was in August, so things were still pretty shut down/unknown with covid for the most part. \n\nI had a weird craving for a Blooming Onion from Outback Steakhouse, but couldn’t go to restaurants obviously. \n\nMy amazing wife decided at 9am to place an order for a blooming onion on DoorDash, to be delivered at 3:55pm (I’d be home from work around 4;00 that day). \n\nWell, at 9:01am, I got a notification from my DoorDash app, as she had used my account 😂\n\nSo I had to spend all day looking forward to my bloomin onion, not letting my wife know that I knew, and practicing my surprised face! Let’s just say, there’s a reason i’m not an actor lol. \n\nWe laugh about that every few months now (:",
      "timestamp": "2022-06-12 02:10:36",
      "score": 217,
      "num_children": 2,
      "author": 217045,
      "replies": [
        {
          "id": "ic1kxhn",
          "text": "This is so funny! How cool you didn’t let her know you knew about it. With technology, apps, shared plans it’s so hard to surprise people sometimes lol. And don’t get me started on Alexa blasting out reminders lol.",
          "timestamp": "2022-06-12 02:26:37",
          "score": 45,
          "num_children": 1,
          "author": 275030,
          "replies": [
            {
              "id": "ic34dap",
              "text": "Seriously, technology has thrown a wrench in a lot of plans, i’m sure lol. The other common one are the GPS location sharing apps, I know of a few people who have seen surprise parties ruined based on the Snapchat location maps 😂",
              "timestamp": "2022-06-12 13:38:35",
              "score": 6,
              "num_children": 1,
              "author": 217045,
              "replies": [
                {
                  "id": "ic41y3m",
                  "text": "Oh that’s another one I didn’t think about is the GPS location and sharing good call!\n\nI watched a true crime show where a man was being accused of murder because he couldn’t alibi himself (at home asleep with his young kids) but his lawyer came up with using his FitBit tracking to confirm where he was. They couldn’t say he left it there because it was tracking his sleep and heart rate! Brilliant.",
                  "timestamp": "2022-06-12 18:07:34",
                  "score": 1,
                  "num_children": 0,
                  "author": 275030,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ic2lqao",
          "text": "Bloomin onion is my birthday treat too! You can only have it like once a year, it's quite possibly the unhealthiest food available but I love them.",
          "timestamp": "2022-06-12 09:58:26",
          "score": 5,
          "num_children": 1,
          "author": 220991,
          "replies": [
            {
              "id": "ic3473b",
              "text": "Exactly! By no means could I eat it more than once a year, and I regret it afterwards nearly every time. But man, in the moment, it just hits the spot 😂\n\nApparently my parents were out on my first or second birthday with some of their friends and I just leaned over and grabbed some bloomin onion from the table, and that’s where it all started 😂",
              "timestamp": "2022-06-12 13:36:57",
              "score": 3,
              "num_children": 0,
              "author": 217045,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ic1mrcw",
      "text": "My dumbass wouldn't figure it out and just keep rolling in all \"oh cool, whose birthday is it?\"",
      "timestamp": "2022-06-12 02:42:59",
      "score": 64,
      "num_children": 0,
      "author": 207864,
      "replies": []
    },
    {
      "id": "ic12gkx",
      "text": "Most wholesome tifu ever",
      "timestamp": "2022-06-11 23:38:46",
      "score": 40,
      "num_children": 1,
      "author": 147369,
      "replies": [
        {
          "id": "ic2v3ro",
          "text": "I like the part where he face hugged her",
          "timestamp": "2022-06-12 12:04:34",
          "score": 1,
          "num_children": 0,
          "author": 210544,
          "replies": []
        }
      ]
    },
    {
      "id": "ic11c46",
      "text": "The fact you backed out and didn’t reveal you knew is just the greatest.",
      "timestamp": "2022-06-11 23:28:54",
      "score": 73,
      "num_children": 0,
      "author": 404968,
      "replies": []
    },
    {
      "id": "ic1f2tj",
      "text": ">So within to time frame of about 3 and a half hours, I practiced my “oh my god I’m so suprised face” \n\nFrom this sentence, it sounds like you're in a much better place than when you were a kid, and that makes me happy",
      "timestamp": "2022-06-12 01:32:55",
      "score": 71,
      "num_children": 0,
      "author": 195000,
      "replies": []
    },
    {
      "id": "ic1i2v7",
      "text": "This is something you should definitely tell her in a few years time. It will be enough time that she won't be hurt and she'll appreciate what you did for her and you can both have that as a fun memory to laugh at when you tell the story to friends.",
      "timestamp": "2022-06-12 02:00:25",
      "score": 18,
      "num_children": 0,
      "author": 301511,
      "replies": []
    },
    {
      "id": "ic1zzh2",
      "text": "God I love reading just happy cute stories.",
      "timestamp": "2022-06-12 04:54:52",
      "score": 15,
      "num_children": 0,
      "author": 313979,
      "replies": []
    },
    {
      "id": "ic1k1q8",
      "text": "Is this a fuck up?",
      "timestamp": "2022-06-12 02:18:41",
      "score": 28,
      "num_children": 1,
      "author": 287721,
      "replies": [
        {
          "id": "ic1lry0",
          "text": "More like he *almost* F'd up.",
          "timestamp": "2022-06-12 02:34:10",
          "score": 11,
          "num_children": 2,
          "author": 16329,
          "replies": [
            {
              "id": "ic2hoku",
              "text": "He spent several hours of his birthday sitting around in the car. I'd say that counts as a duck up.\n\nEdit: I finally got my first autocorrect duck, lol. I'm keeping it.",
              "timestamp": "2022-06-12 08:55:54",
              "score": 1,
              "num_children": 1,
              "author": 11389,
              "replies": [
                {
                  "id": "ic47hao",
                  "text": "LOL better a duck up than a duck down imo",
                  "timestamp": "2022-06-12 18:49:43",
                  "score": 1,
                  "num_children": 0,
                  "author": 16329,
                  "replies": []
                }
              ]
            },
            {
              "id": "ic39wne",
              "text": "r/tiafu",
              "timestamp": "2022-06-12 14:27:46",
              "score": 1,
              "num_children": 0,
              "author": 304371,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ic26gyt",
      "text": "[deleted]",
      "timestamp": "2022-06-12 06:12:14",
      "score": 9,
      "num_children": 1,
      "replies": [
        {
          "id": "ic274hy",
          "text": "This exactly. At first I hated it but then i stopped caring for a while, if they did cool I’d they didn’t t cool\n\nI feel ya. Thinking about it gets sad sometimes",
          "timestamp": "2022-06-12 06:21:03",
          "score": 7,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1b980",
      "text": "What movies?",
      "timestamp": "2022-06-12 00:58:10",
      "score": 6,
      "num_children": 2,
      "author": 241829,
      "replies": [
        {
          "id": "ic1kuov",
          "text": "Hustle movie on Netflix, free guys,central intelligence, Deadpool and murder mystery. I’m a sucker for comedies. \n\nEdit: Sorry the other guys response through me off. Are you not talking about the movies we watched. Now I’m confused 😂😂",
          "timestamp": "2022-06-12 02:25:57",
          "score": 10,
          "num_children": 3,
          "replies": [
            {
              "id": "ic1lu1n",
              "text": "Yup I was talking about what movies you binged on. I saw hustle yesterday with the family, wasn't really a fan. What's murder mystery? Happy belated birthday.",
              "timestamp": "2022-06-12 02:34:41",
              "score": 3,
              "num_children": 1,
              "author": 241829,
              "replies": [
                {
                  "id": "ic1m2n6",
                  "text": "Murder mystery is with Jennifer Aniston and Adam Sandler, and the title explains most of it haha 😂 here is the description of the movie though \n\n“A New York cop and his wife go on a European vacation to reinvigorate the spark in their marriage. A chance encounter leads to them being framed for the murder of an elderly billionaire.”",
                  "timestamp": "2022-06-12 02:36:43",
                  "score": 4,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ic1mlq8",
                      "text": "Oh yeah I saw that one when it came out, I guess it was forgettable to me lol. Check out the movie dirty work , now that's a stupid funny comedy.",
                      "timestamp": "2022-06-12 02:41:32",
                      "score": 3,
                      "num_children": 0,
                      "author": 241829,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ic1pfo1",
              "text": "You watched 5 movies in 1 night?",
              "timestamp": "2022-06-12 03:07:39",
              "score": 3,
              "num_children": 1,
              "author": 204710,
              "replies": [
                {
                  "id": "ic1ph2m",
                  "text": "Yup it’s a movie marathon 😂",
                  "timestamp": "2022-06-12 03:08:01",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "icscjjk",
              "text": "Threw* Tom Brady threw the ball through the air. \n\nAlso it's spelled woman. Women is plural.",
              "timestamp": "2022-06-18 02:01:24",
              "score": 1,
              "num_children": 0,
              "author": 46997,
              "replies": []
            }
          ]
        },
        {
          "id": "ic1jhua",
          "text": "I agree that this seems made up. It reads like the plot from an \"I Love Lucy\" episode. I don't buy it being real. The cake batter part especially.",
          "timestamp": "2022-06-12 02:13:30",
          "score": 0,
          "num_children": 1,
          "author": 217309,
          "replies": [
            {
              "id": "ic1kzxx",
              "text": "So this is why you were trying to interrogate me. Dude it’s a fun story of my day that I wanted to share  stop being a fun killer and move on please.",
              "timestamp": "2022-06-12 02:27:14",
              "score": -1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ic1lww5",
                  "text": "[removed]",
                  "timestamp": "2022-06-12 02:35:21",
                  "score": -3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ic1mmxb",
                      "text": "What the fuck are you crazy? No I’m not showing your psycho ass the inside of my house since clearly your some FBI agent th nor my drivers license. Believe wtf you want to but take a damn hike and leave me alone. Y’all redditors are some crazy asses.",
                      "timestamp": "2022-06-12 02:41:50",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ic17gd2",
      "text": "r/Surprisinglywholesome",
      "timestamp": "2022-06-12 00:23:34",
      "score": 26,
      "num_children": 0,
      "author": 153938,
      "replies": []
    },
    {
      "id": "ic1e251",
      "text": "I love this. Thanks for sharing. Happy birthday. 😊",
      "timestamp": "2022-06-12 01:23:37",
      "score": 6,
      "num_children": 0,
      "author": 219341,
      "replies": []
    },
    {
      "id": "ic1zsvu",
      "text": "She's the love and compassion you lived without. Bud, that's the best thing I've read all day!",
      "timestamp": "2022-06-12 04:52:48",
      "score": 7,
      "num_children": 0,
      "author": 92498,
      "replies": []
    },
    {
      "id": "ic2ubmg",
      "text": "Honestly, the sweetness of you both made me teary. Her obvious love and wanting to celebrate you and you for not wanting your bride to be disappointed. Wishing you both a lifetime of love and happiness.",
      "timestamp": "2022-06-12 11:55:34",
      "score": 6,
      "num_children": 0,
      "author": 319191,
      "replies": []
    },
    {
      "id": "ic1ih7v",
      "text": "I'm just glad you didn't come home to someone eating her cake.  Always nice to see happily married people here instead of people pretending they're in awful toxic relationships for a few karma points they could much easier get, in karma farming subreddits. \n\nHappy belated birthday friendo.",
      "timestamp": "2022-06-12 02:04:07",
      "score": 15,
      "num_children": 1,
      "author": 205608,
      "replies": [
        {
          "id": "ic1nm04",
          "text": "What's the most you ever lost on a coin toss?",
          "timestamp": "2022-06-12 02:50:41",
          "score": -2,
          "num_children": 0,
          "author": 249146,
          "replies": []
        }
      ]
    },
    {
      "id": "ic17e1a",
      "text": "This was not a fuck up. This was almost a fuck up. Had you not tip toed backwards it would have been a fuck up. This was you being a good sport. You and your wife picked good partners. Happy cake day.",
      "timestamp": "2022-06-12 00:22:59",
      "score": 27,
      "num_children": 0,
      "author": 96845,
      "replies": []
    },
    {
      "id": "ic1n8ec",
      "text": "I know that's already your wife, but you need to marry her again.",
      "timestamp": "2022-06-12 02:47:21",
      "score": 5,
      "num_children": 1,
      "author": 320469,
      "replies": [
        {
          "id": "ic1nchd",
          "text": "I agree !",
          "timestamp": "2022-06-12 02:48:22",
          "score": 6,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1t69c",
      "text": "This is adorable. I'm glad you had a good day! Your wife sounds so thoughtful and like she loves you very much.",
      "timestamp": "2022-06-12 03:44:04",
      "score": 4,
      "num_children": 1,
      "author": 26671,
      "replies": [
        {
          "id": "ic1tlih",
          "text": "She is very thoughtful and I sure hope so 😅 and thank you 🙏",
          "timestamp": "2022-06-12 03:48:25",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1te8q",
      "text": "That's an awesome story, very wholesome. I would say sometime in the future maybe 5 or 10 years you should let her in on the joke. Tell her about it and how appreciative you were and that you cared so much you snuck back out. I'm sure she would have been disappointed if she knew the day of but in the future I'm sure she would appreciate this beautiful story.",
      "timestamp": "2022-06-12 03:46:20",
      "score": 3,
      "num_children": 0,
      "author": 158970,
      "replies": []
    },
    {
      "id": "ic1ticw",
      "text": "THIS is making up for the shitty birthdays of the past. Awesome!",
      "timestamp": "2022-06-12 03:47:30",
      "score": 4,
      "num_children": 1,
      "author": 120178,
      "replies": [
        {
          "id": "ic1tjjy",
          "text": "I agree!!😅",
          "timestamp": "2022-06-12 03:47:52",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic2aqf8",
      "text": "this is so adorable omg",
      "timestamp": "2022-06-12 07:11:26",
      "score": 4,
      "num_children": 0,
      "author": 231779,
      "replies": []
    },
    {
      "id": "ic18l4u",
      "text": "As much as the first half had me feeling a bit suspicious, I'm glad I hung about and read the rest. I cracked up. My dude, your wife was so focused on your birthday, you got away with being sneaky. Respect.",
      "timestamp": "2022-06-12 00:33:57",
      "score": 7,
      "num_children": 0,
      "author": 270259,
      "replies": []
    },
    {
      "id": "ic1aybx",
      "text": "What did you fuck up, exactly?",
      "timestamp": "2022-06-12 00:55:21",
      "score": 8,
      "num_children": 1,
      "author": 65475,
      "replies": [
        {
          "id": "ic1b5oz",
          "text": "I think the title says it 😂😂",
          "timestamp": "2022-06-12 00:57:15",
          "score": -3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1aisq",
      "text": ">I forgot my own birthday\n\nI already did it sometimes and I'm not even old enough for this... I know your feeling.",
      "timestamp": "2022-06-12 00:51:27",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ic1hdkg",
      "text": "Happy Birthday! you're so kind to walk back and wait so you would ruin the surprise!",
      "timestamp": "2022-06-12 01:53:52",
      "score": 3,
      "num_children": 0,
      "author": 38459,
      "replies": []
    },
    {
      "id": "ic1jrxj",
      "text": "gj not fucking it up there mate",
      "timestamp": "2022-06-12 02:16:08",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ic1qjn9",
      "text": "God this is so adorable",
      "timestamp": "2022-06-12 03:18:25",
      "score": 3,
      "num_children": 0,
      "author": 21373,
      "replies": []
    },
    {
      "id": "ic25fgx",
      "text": "This might be the most wholesome thing I’ve ever read",
      "timestamp": "2022-06-12 05:58:22",
      "score": 3,
      "num_children": 0,
      "author": 136991,
      "replies": []
    },
    {
      "id": "ic2d80p",
      "text": "This is the content I come to Reddit for. Happy Birthday!",
      "timestamp": "2022-06-12 07:47:51",
      "score": 3,
      "num_children": 1,
      "author": 223277,
      "replies": [
        {
          "id": "ic2d9d4",
          "text": "Thank you !!🙏",
          "timestamp": "2022-06-12 07:48:24",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic2km6o",
      "text": ">I will be taking this secret to my grave\n\n***Proceeds to tell thousands of people on the internet*** lol.\n\nBut this is wholesome. I like reading stories like these.",
      "timestamp": "2022-06-12 09:41:15",
      "score": 3,
      "num_children": 1,
      "author": 377412,
      "replies": [
        {
          "id": "ic3q2ak",
          "text": "I’m not good at keeping secrets 😅😅",
          "timestamp": "2022-06-12 16:36:04",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic3a340",
      "text": "This is wholesome and sweet.  Usually the “came home early to surprise my wife” takes a turn for the worst.",
      "timestamp": "2022-06-12 14:29:18",
      "score": 3,
      "num_children": 0,
      "author": 393037,
      "replies": []
    },
    {
      "id": "ic3iyjy",
      "text": "This is. Just. So fucking cute. Thank you for pretending you were still surprised. You probably made her day and I’m sure she was so excited all day. This stuff gives me so much hope for my future with my partner :))",
      "timestamp": "2022-06-12 15:41:11",
      "score": 3,
      "num_children": 0,
      "author": 295878,
      "replies": []
    },
    {
      "id": "ic18tpn",
      "text": "Awwww there’s a group on Facebook called “this relationship sounds energizing” and this would fit perfectly! I’m so glad you have someone to celebrate your birthday with!!",
      "timestamp": "2022-06-12 00:36:08",
      "score": 11,
      "num_children": 0,
      "author": 141128,
      "replies": []
    },
    {
      "id": "ic1kiq9",
      "text": "Throwaway account to post about something that doesn't need a throwaway\n\nDude somehow forgets his birthday even though his wife always remembers and does something for him\n\nHe comes home, sees his wife's face because he can see stuff in her forehead...but somehow wife doesn't see him\n\nHe comes into the house without trying to sneak and also left the house undetected\n\nPress X to doubt.",
      "timestamp": "2022-06-12 02:22:57",
      "score": 17,
      "num_children": 2,
      "author": 192493,
      "replies": [
        {
          "id": "ic1lfy5",
          "text": "TA account because I have a lot of friends on my account. The first part of the story was relevant as to why I forgot my birthday and I don’t feel like having my friends know abt that yet or at all \n\nWife doesn’t see me because of the way my house is built, there is a table separating all counters against the wall and a bar like table where you can see in from the living room which is where the door is located. She was facing the other way, interested in baking music on. Went to grab a mixer that is in the right side of our house and you could see the sides of her face and forehead Can yall stop being such mood killers it’s a fun story of my bday now scram. God damn.",
          "timestamp": "2022-06-12 02:31:12",
          "score": 10,
          "num_children": 1,
          "replies": [
            {
              "id": "ic27yrs",
              "text": "Lol the most boring post no one cares",
              "timestamp": "2022-06-12 06:32:35",
              "score": -6,
              "num_children": 1,
              "replies": [
                {
                  "id": "ic280ni",
                  "text": "lol Then leave ?",
                  "timestamp": "2022-06-12 06:33:17",
                  "score": 2,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "ic28jax",
                      "text": "[removed]",
                      "timestamp": "2022-06-12 06:40:28",
                      "score": -1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ic28qsb",
                          "text": "I can’t tell who’s side your on and I didn’t make up anything but y’all can think what you want if you don’t like the post leave. No ones forcing you here.",
                          "timestamp": "2022-06-12 06:43:20",
                          "score": 2,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ic283ml",
                      "text": "Salty ass lmao",
                      "timestamp": "2022-06-12 06:34:26",
                      "score": -8,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ic284c0",
                          "text": "Says you",
                          "timestamp": "2022-06-12 06:34:42",
                          "score": 4,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ic285ba",
                              "text": "You responded bro",
                              "timestamp": "2022-06-12 06:35:05",
                              "score": -4,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "ic287gn",
                                  "text": "Dude you replied to *my* comment and *my* post saying no One cares. Make that make sense",
                                  "timestamp": "2022-06-12 06:35:52",
                                  "score": 2,
                                  "num_children": 0,
                                  "replies": []
                                },
                                {
                                  "id": "ic28eb2",
                                  "text": "I’m just saying what a shit ass story for this sub, I love how you responded in 0.2 seconds when I posted that just sad",
                                  "timestamp": "2022-06-12 06:38:32",
                                  "score": -3,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "ic28u33",
                                      "text": "I respond to half the people on here very fast not just you, but you got a lot of audacity calling *me* a salty ass 😅. But oh well, if you do you don’t like it leave.",
                                      "timestamp": "2022-06-12 06:44:39",
                                      "score": 4,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ic39e4w",
          "text": "Out of all of that, forgetting your birthday whilst your spouse remembers is the most relatable to me. I never remember it's my birthday until my other half says happy birthday. I simply never celebrated it or even really considered it until she came along.",
          "timestamp": "2022-06-12 14:23:19",
          "score": 0,
          "num_children": 0,
          "author": 343306,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1ewj1",
      "text": "That’s the type of partner I want someday",
      "timestamp": "2022-06-12 01:31:21",
      "score": 5,
      "num_children": 1,
      "author": 319644,
      "replies": [
        {
          "id": "ic2v99y",
          "text": "It's me, I did this twice just yesterday.",
          "timestamp": "2022-06-12 12:06:11",
          "score": 1,
          "num_children": 0,
          "author": 210544,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1b336",
      "text": "I think someday you should tell her what happened. She’s probably laugh about it.",
      "timestamp": "2022-06-12 00:56:35",
      "score": 2,
      "num_children": 0,
      "author": 300991,
      "replies": []
    },
    {
      "id": "ic1gtlj",
      "text": "I wouldn't be able to pull off the act, she would know i was pretending from my face... Wonder if she'd on reddit.",
      "timestamp": "2022-06-12 01:48:45",
      "score": 2,
      "num_children": 0,
      "author": 247212,
      "replies": []
    },
    {
      "id": "ic1hfmv",
      "text": "Coming home early never leads to good things.",
      "timestamp": "2022-06-12 01:54:25",
      "score": 2,
      "num_children": 0,
      "author": 298663,
      "replies": []
    },
    {
      "id": "ic1jzzt",
      "text": "I'm the same way with surprises. If I find out about a gift or something like that I pretend not to know so I can give them the joy of surprising me.",
      "timestamp": "2022-06-12 02:18:15",
      "score": 2,
      "num_children": 0,
      "author": 305542,
      "replies": []
    },
    {
      "id": "ic1k8su",
      "text": "One year we got my dad to buy a cake for his own birthday and he didn't realize it until we had pulled it out and sang happy birthday.",
      "timestamp": "2022-06-12 02:20:26",
      "score": 2,
      "num_children": 0,
      "author": 183914,
      "replies": []
    },
    {
      "id": "ic1lds7",
      "text": "So so sweet n cute. Happy Birthday, I’m glad you had one you’ll never forget!! God bless her heart.",
      "timestamp": "2022-06-12 02:30:41",
      "score": 2,
      "num_children": 0,
      "author": 18649,
      "replies": []
    },
    {
      "id": "ic1lujh",
      "text": "Congratulations on having found a great partner and for keeping wholesome secrets, also happy birthday.",
      "timestamp": "2022-06-12 02:34:48",
      "score": 2,
      "num_children": 0,
      "author": 55166,
      "replies": []
    },
    {
      "id": "ic1sb8c",
      "text": "Happy Birthday, it's mine too!",
      "timestamp": "2022-06-12 03:35:30",
      "score": 2,
      "num_children": 1,
      "author": 10714,
      "replies": [
        {
          "id": "ic1th4h",
          "text": "Happy birthday !! I hope it’s a good one.",
          "timestamp": "2022-06-12 03:47:09",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1snmy",
      "text": "I like your style and I agree you should take this with you to the grave. There is no benefit in her knowing.",
      "timestamp": "2022-06-12 03:38:54",
      "score": 2,
      "num_children": 0,
      "author": 178044,
      "replies": []
    },
    {
      "id": "ic1ui11",
      "text": "That's so sweet!\n\nI'm going up sign off of Reddit with a smile on my face thinking how awesome you two are to each other.",
      "timestamp": "2022-06-12 03:57:39",
      "score": 2,
      "num_children": 0,
      "author": 102728,
      "replies": []
    },
    {
      "id": "ic1wkpy",
      "text": "> I will be taking this secret to my grave. \n\nGoes on to tell tell the whole world...",
      "timestamp": "2022-06-12 04:18:40",
      "score": 2,
      "num_children": 1,
      "author": 29626,
      "replies": [
        {
          "id": "ic1wrcv",
          "text": "Lmfaooo I had to share it with someone I’m horrible at keeping secrets 😂😂",
          "timestamp": "2022-06-12 04:20:27",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1x2fc",
      "text": "This is incredibly wholesome, for the both of you✨",
      "timestamp": "2022-06-12 04:23:30",
      "score": 2,
      "num_children": 0,
      "author": 381451,
      "replies": []
    },
    {
      "id": "ic1xstl",
      "text": "Happy birthday. After many unsuccessful surprise birthday parties for my husband, he asked to never have one again. He hates his birthday, always has, so I was trying to make good memories for him, but he hates it still. I tried, but respect his decision. Hopefully you continue to enjoy your wife surprising you for years to come",
      "timestamp": "2022-06-12 04:31:08",
      "score": 2,
      "num_children": 0,
      "author": 386252,
      "replies": []
    },
    {
      "id": "ic2128s",
      "text": "[removed]",
      "timestamp": "2022-06-12 05:06:44",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "ic218yg",
          "text": "I definitely am no doubt. And thank you 🙏🙏",
          "timestamp": "2022-06-12 05:08:32",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic26yh1",
      "text": "I've something in my eye. birthdays were not a big deal growing up. My wife does the same.",
      "timestamp": "2022-06-12 06:18:52",
      "score": 2,
      "num_children": 0,
      "author": 191944,
      "replies": []
    },
    {
      "id": "ic2g3sp",
      "text": "I think you should tell her one day.\n\nIt'll add an extra layer to the story and I think she would appreciate that you appreciate her so much.\n\nI wish the both of you a long and happy life, full of wonder, passion and adventure!",
      "timestamp": "2022-06-12 08:31:31",
      "score": 2,
      "num_children": 0,
      "author": 298378,
      "replies": []
    },
    {
      "id": "ic2g69w",
      "text": "Why am I crying :')",
      "timestamp": "2022-06-12 08:32:34",
      "score": 2,
      "num_children": 0,
      "author": 356907,
      "replies": []
    },
    {
      "id": "ic2hypw",
      "text": "A wholesome TIFU that isn’t gross\n\nYay!",
      "timestamp": "2022-06-12 09:00:15",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ic2r93j",
      "text": "I want this thread deleted,\n\nReason: Too wholesome.",
      "timestamp": "2022-06-12 11:18:57",
      "score": 2,
      "num_children": 0,
      "author": 77457,
      "replies": []
    },
    {
      "id": "ic2sf76",
      "text": "We hear about so many terrible marriages on reddit. Whether it is couples not trusting each other, thoughtless towards one or the other, or or abusive (physically, emotionally, or psychologically) to the other. But your relationship gives me hope that maybe there are a few good ones out there.",
      "timestamp": "2022-06-12 11:33:29",
      "score": 2,
      "num_children": 0,
      "author": 256834,
      "replies": []
    },
    {
      "id": "ic2zko9",
      "text": "This might be the most wholesome tifu in the history or Reddit.",
      "timestamp": "2022-06-12 12:52:06",
      "score": 2,
      "num_children": 0,
      "author": 332626,
      "replies": []
    },
    {
      "id": "ic34al8",
      "text": "Glad this ended well and not with “then this dude in a towel walked into the room”\n\nHappy Birthday btw",
      "timestamp": "2022-06-12 13:37:52",
      "score": 2,
      "num_children": 0,
      "author": 70704,
      "replies": []
    },
    {
      "id": "ic36zkx",
      "text": "The title:\n\n![gif](giphy|y2i2oqWgzh5ioRp4Qa|downsized)\n\n*TIFU by coming home early to surprise my wife,…*\n\nMe: *Oh no, she cheated.*\n\n*who was having a surprise birthday party for me*\n\nOh thank fucking god.",
      "timestamp": "2022-06-12 14:02:24",
      "score": 2,
      "num_children": 0,
      "author": 269464,
      "replies": []
    },
    {
      "id": "ic37seo",
      "text": "Don’t take it to your grave, tell her in a few years she will love you even more!!!",
      "timestamp": "2022-06-12 14:09:24",
      "score": 2,
      "num_children": 0,
      "author": 397130,
      "replies": []
    },
    {
      "id": "ic37ygi",
      "text": "This is so pure, I loved it. And Happy Birthday!!",
      "timestamp": "2022-06-12 14:10:54",
      "score": 2,
      "num_children": 0,
      "author": 367880,
      "replies": []
    },
    {
      "id": "ic382h1",
      "text": "This is wholesome as hell! I love it. I love love! So happy you found yourself something wonderful.",
      "timestamp": "2022-06-12 14:11:52",
      "score": 2,
      "num_children": 0,
      "author": 386135,
      "replies": []
    },
    {
      "id": "ic3dbz1",
      "text": "My best friend of eight years forgot my name and ghosted me once she got herself a partner. I feel like I'm NEVER gonna get married at this rate if I can't even get the bare minimum of humanity from someone.\n\nSo I'm happy as hell that someone who's also had a rough time of things has someone in their life who's actively making the effort to help take care of them and do something amazing they'll remember for all of time.\n\nBless the both of you",
      "timestamp": "2022-06-12 14:56:18",
      "score": 2,
      "num_children": 0,
      "author": 161679,
      "replies": []
    },
    {
      "id": "ic3fe6w",
      "text": "That's pretty great! I like how you just back right out of there and practice your surprised face for the rest of the day! Funny! Also, I too think she'd like to hear the story and would probably think it's hilarious!",
      "timestamp": "2022-06-12 15:13:02",
      "score": 2,
      "num_children": 0,
      "author": 175670,
      "replies": []
    },
    {
      "id": "ic3fwwl",
      "text": "This should be in the wholesome section, not tifu!",
      "timestamp": "2022-06-12 15:17:12",
      "score": 2,
      "num_children": 0,
      "author": 301816,
      "replies": []
    },
    {
      "id": "ic3snjf",
      "text": "Honestly wait like a month and tell her it’ll be super funny lol",
      "timestamp": "2022-06-12 16:55:47",
      "score": 2,
      "num_children": 1,
      "author": 102271,
      "replies": [
        {
          "id": "ic45x62",
          "text": "This. If she knows about your family history [Im assuming she does] wait a little bit then tell her",
          "timestamp": "2022-06-12 18:38:08",
          "score": 1,
          "num_children": 0,
          "author": 285928,
          "replies": []
        }
      ]
    },
    {
      "id": "ic17gii",
      "text": "The fact you walked out and then acted surprised later and she had no clue is just so funny and sweet to me",
      "timestamp": "2022-06-12 00:23:36",
      "score": 5,
      "num_children": 0,
      "author": 13292,
      "replies": []
    },
    {
      "id": "ic183ju",
      "text": ">Yeah yeah I know it’s weird, had a little bit of a ruff childhood\n\nThe fact that you were a dog when you were a child *is* pretty weird, but kind of cool at the same time.",
      "timestamp": "2022-06-12 00:29:32",
      "score": 9,
      "num_children": 0,
      "author": 94773,
      "replies": []
    },
    {
      "id": "ic1bufe",
      "text": "Btw your wife's reddit account is u/love_tosurprise",
      "timestamp": "2022-06-12 01:03:37",
      "score": 4,
      "num_children": 0,
      "author": 108486,
      "replies": []
    },
    {
      "id": "ic1apmn",
      "text": "Absolutely brilliant. Happy birthday dude!",
      "timestamp": "2022-06-12 00:53:11",
      "score": 2,
      "num_children": 1,
      "author": 57422,
      "replies": [
        {
          "id": "ic1bbqc",
          "text": "Thank you Lmao 🤣🤣",
          "timestamp": "2022-06-12 00:58:50",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1q2p9",
      "text": "[deleted]",
      "timestamp": "2022-06-12 03:13:53",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "ic1sx62",
          "text": "OK, no more porn for you : )",
          "timestamp": "2022-06-12 03:41:30",
          "score": 0,
          "num_children": 0,
          "author": 83543,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1tklw",
      "text": "Saw the title and immediately thought of this:\nhttps://i.imgur.com/qXqsIlD.jpg",
      "timestamp": "2022-06-12 03:48:10",
      "score": 2,
      "num_children": 1,
      "author": 217422,
      "replies": [
        {
          "id": "ic1tnxr",
          "text": "Oh shit 😂",
          "timestamp": "2022-06-12 03:49:04",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "ic46462",
              "text": "It’s not everyone’s cup of tea, but I like the 50’s-70’s country music.  The song that goes with the album is classic for that period.  \n\nhttps://youtu.be/Ko0vugQ3bv0",
              "timestamp": "2022-06-12 18:39:33",
              "score": 1,
              "num_children": 0,
              "author": 217422,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ic1yjhf",
      "text": "One of the few wholesome TIFU that I've ever read",
      "timestamp": "2022-06-12 04:38:59",
      "score": 2,
      "num_children": 0,
      "author": 186601,
      "replies": []
    },
    {
      "id": "ic1iebx",
      "text": "Seems like I can’t even bake a cake without getting flower on my face.  Then the slow Mission Impossible walk backwards.. classic.  Your lucky; most of us would have made enough noise with the door opening and closing to alert most people in the house.",
      "timestamp": "2022-06-12 02:03:21",
      "score": 1,
      "num_children": 0,
      "author": 336266,
      "replies": []
    },
    {
      "id": "ic1vhdn",
      "text": "It would've been hilarious if you walked in the kitchen like, \"who's birthday is it?\"",
      "timestamp": "2022-06-12 04:07:44",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "ic1vrcn",
          "text": "That would have been funny 😂😂",
          "timestamp": "2022-06-12 04:10:35",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1lwa2",
      "text": "I have the same issue.\n\nPerson I thought was my best friend asked why I was in a bad mood on my birthday.\nSaid Gee, I wonder.\n...oh, oops, I forgot.\nOuch and a half.\n\nI don't celebrate my birthday, but man, we've been friends for a decade and it happens every year, you should know why I'm miserable that day.",
      "timestamp": "2022-06-12 02:35:13",
      "score": -3,
      "num_children": 0,
      "author": 109669,
      "replies": []
    },
    {
      "id": "ic2ixn5",
      "text": "Woman*\n\n\nGoddammit it's like no one can ever get this right.... It's like lose and loose. Is it the phones? Is it the brains? Do I need to focus on things that are actually important that don't enrage me for no reason?? Grrr!!",
      "timestamp": "2022-06-12 09:15:17",
      "score": 0,
      "num_children": 1,
      "author": 261101,
      "replies": [
        {
          "id": "ic2vx0w",
          "text": "I don't get it? Is this an attempt at a misogynistic joke or your opinion if women? If it's your opinion then that's not cool and if it's a joke then maybe reword it so it's funny",
          "timestamp": "2022-06-12 12:13:43",
          "score": 1,
          "num_children": 1,
          "author": 95378,
          "replies": [
            {
              "id": "icsc7kn",
              "text": "Do you know the difference between woman and women?",
              "timestamp": "2022-06-18 01:58:23",
              "score": 1,
              "num_children": 0,
              "author": 46997,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ic0yq0u",
      "text": "Why were you coming home early to surprise your wife? How long did you decide to wait before coming home?",
      "timestamp": "2022-06-11 23:05:34",
      "score": -9,
      "num_children": 1,
      "author": 217309,
      "replies": [
        {
          "id": "ic0yw7k",
          "text": "I didn’t realize I needed a reason😅 I work all week and my boss said it was okay so i brought some flowers and …..tried to surprise her. \n\nAnd the time I normally get off of work 7:30",
          "timestamp": "2022-06-11 23:07:06",
          "score": 21,
          "num_children": 1,
          "replies": [
            {
              "id": "ic11k2h",
              "text": "That's nice your boss said you could leave early. Hopefully your wife still enjoyed getting flowers, too.",
              "timestamp": "2022-06-11 23:30:54",
              "score": 4,
              "num_children": 2,
              "author": 217309,
              "replies": [
                {
                  "id": "ic1t1jq",
                  "text": "Probably let him go since...you know...*it was his birthday*",
                  "timestamp": "2022-06-12 03:42:43",
                  "score": 3,
                  "num_children": 1,
                  "author": 13392,
                  "replies": [
                    {
                      "id": "ic3fisd",
                      "text": "😄😄😄 I just realized you're right and dude probably just thought the boss was being nice for no reason! 😂😂 I love this whole wholesome post. Congrats on a good partner for life, OP. I hope you had a great birthday and weekend! ❤️",
                      "timestamp": "2022-06-12 15:14:03",
                      "score": 2,
                      "num_children": 0,
                      "author": 179596,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ic12dfd",
                  "text": "Haha she definitely did lol",
                  "timestamp": "2022-06-11 23:37:59",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ic215r5",
      "text": "Reddit doesn't like happy stories that doesn't involve cheating",
      "timestamp": "2022-06-12 05:07:44",
      "score": -3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ic13a8h",
      "text": "The thing I'm thankful for is other people knowing my age",
      "timestamp": "2022-06-11 23:46:00",
      "score": 1,
      "num_children": 1,
      "author": 376984,
      "replies": [
        {
          "id": "ic13e0d",
          "text": "Huh",
          "timestamp": "2022-06-11 23:46:56",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic15kow",
      "text": "This is wholesome",
      "timestamp": "2022-06-12 00:06:38",
      "score": 1,
      "num_children": 0,
      "author": 188008,
      "replies": []
    },
    {
      "id": "ic17jau",
      "text": "Oh my god this is so funny and cute at the same time skdkdk. Your wife is a sweetheart and you seem like a great guy yourself! I'm happy you found someone who values you and makes you feel special. Wishing you guys a loooong, happy, and loving marriage! 💛 \n\nAlso, happy birthday, OP! ✨",
      "timestamp": "2022-06-12 00:24:19",
      "score": 1,
      "num_children": 1,
      "author": 384810,
      "replies": [
        {
          "id": "ic1bdb0",
          "text": "Yup I got pretty lucky if I do say so myself and thank you 🙏🙏",
          "timestamp": "2022-06-12 00:59:15",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic18dae",
      "text": "So wholesome, glad you enjoyed your birthday :)",
      "timestamp": "2022-06-12 00:32:02",
      "score": 1,
      "num_children": 0,
      "author": 103980,
      "replies": []
    },
    {
      "id": "ic19xz2",
      "text": "Had me in the first half, not gonna lie",
      "timestamp": "2022-06-12 00:46:12",
      "score": 1,
      "num_children": 0,
      "author": 291383,
      "replies": []
    },
    {
      "id": "ic1g0w2",
      "text": "Totally thought this was going to go the \"Old School\" route.",
      "timestamp": "2022-06-12 01:41:26",
      "score": 1,
      "num_children": 0,
      "author": 27266,
      "replies": []
    },
    {
      "id": "ic1i4db",
      "text": "Welcome to adulthood.",
      "timestamp": "2022-06-12 02:00:47",
      "score": 1,
      "num_children": 0,
      "author": 74361,
      "replies": []
    },
    {
      "id": "ic1it9h",
      "text": "Hello. I'm here for the gangbang.",
      "timestamp": "2022-06-12 02:07:13",
      "score": 1,
      "num_children": 0,
      "author": 74811,
      "replies": []
    },
    {
      "id": "ic1j2cb",
      "text": "[deleted]",
      "timestamp": "2022-06-12 02:09:37",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "ic1ju3h",
          "text": "This confused me. There were tapestries birthday cups birthday hats and rlly everything you put up on a birthday party, and she was baking a cake……and it was my birthday 😂😂",
          "timestamp": "2022-06-12 02:16:43",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "ic2v01f",
              "text": "Hi, can you explain what you mean by \"tapestries\"? A tapestry is a woven/embroidered fabric decorative wall hanging.",
              "timestamp": "2022-06-12 12:03:25",
              "score": 1,
              "num_children": 0,
              "author": 353793,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ic1jcjb",
      "text": "You’re a good man and a better husband OP. Never tell her, always make her think she surprised her constant Rock and Keeper.",
      "timestamp": "2022-06-12 02:12:09",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ic1jliu",
      "text": "It’s very sweet you let her surprise you, but honestly with some time passing, it’ll be funny to tell her later on what actually went down that day. I’m sure she’ll have a laugh!\n\nBtw, happy bday! 🍰",
      "timestamp": "2022-06-12 02:14:28",
      "score": 1,
      "num_children": 0,
      "author": 25378,
      "replies": []
    },
    {
      "id": "ic1lp72",
      "text": "The fact that you snuck back out so she would be happy. Y’all were 100% made for each other. Happy birthday man!",
      "timestamp": "2022-06-12 02:33:29",
      "score": 1,
      "num_children": 0,
      "author": 389184,
      "replies": []
    },
    {
      "id": "ic1niem",
      "text": "I used to work with a guy who shit his pants in his car as he was racing home to try to make it to the toilet. When he ran inside with diahreea running down his pants he was surprised by the family and friends his wife has assembled for his 30th birthday. People are trying to hug him and all he wants to do is get his clothes off and a shower. I was practically crying at work when he told me the story.  This was over 20 years ago.",
      "timestamp": "2022-06-12 02:49:47",
      "score": 1,
      "num_children": 1,
      "author": 353349,
      "replies": [
        {
          "id": "ic1npyt",
          "text": "Ha! I bet it was a memorable birthday 😂😂",
          "timestamp": "2022-06-12 02:51:41",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1nk82",
      "text": "At the very least she did succeed in her surprise. Just not in the way she expected.",
      "timestamp": "2022-06-12 02:50:14",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "ic1ntcs",
          "text": "Very true 😂😂",
          "timestamp": "2022-06-12 02:52:35",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1noek",
      "text": "There’s a bright spot on Reddit 😀",
      "timestamp": "2022-06-12 02:51:17",
      "score": 1,
      "num_children": 0,
      "author": 49732,
      "replies": []
    },
    {
      "id": "ic1npvj",
      "text": "My dog would’ve sold me out within a second. I could never surprise my partner without him knowing I’m home lol",
      "timestamp": "2022-06-12 02:51:39",
      "score": 1,
      "num_children": 0,
      "author": 329804,
      "replies": []
    },
    {
      "id": "ic1nqlh",
      "text": "Could be worse surprises. Just saying",
      "timestamp": "2022-06-12 02:51:50",
      "score": 1,
      "num_children": 1,
      "author": 223629,
      "replies": [
        {
          "id": "ic1nrlq",
          "text": "Couldn’t agree more",
          "timestamp": "2022-06-12 02:52:06",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1o2tr",
      "text": "OP do not tell her, at least not right away. Let her have the moment thinking she did something nice and it was successful. Not telling her will encourage her to continue to want to surprise you and boost her up. My husband spoiled the surprise party I had for him by telling me right after the party and telling everyone else including my dad before and during the party. It was very embarrassing and discouraging for me. If she asks you, tell the truth, but let her know how much you appreciate her thoughtfulness and that you had a wonderful time.",
      "timestamp": "2022-06-12 02:55:01",
      "score": 1,
      "num_children": 0,
      "author": 218507,
      "replies": []
    },
    {
      "id": "ic1oav3",
      "text": "WHOLESOME",
      "timestamp": "2022-06-12 02:57:08",
      "score": 1,
      "num_children": 0,
      "author": 7607,
      "replies": []
    },
    {
      "id": "ic1os0b",
      "text": "What movie? Happy birthday",
      "timestamp": "2022-06-12 03:01:34",
      "score": 1,
      "num_children": 1,
      "author": 377704,
      "replies": [
        {
          "id": "ic1p1jj",
          "text": "\nFree guy, central intelligence, Deadpool, hustle and something else that i can’t remember. And thank you 🙏🙏",
          "timestamp": "2022-06-12 03:04:03",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "ic1r0ts",
              "text": "Murder mystery",
              "timestamp": "2022-06-12 03:22:48",
              "score": 1,
              "num_children": 1,
              "author": 241829,
              "replies": [
                {
                  "id": "ic1r325",
                  "text": "Yes!! thank you 😂😂",
                  "timestamp": "2022-06-12 03:23:24",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ic1rb55",
                      "text": "Told you it was forgettable:P",
                      "timestamp": "2022-06-12 03:25:36",
                      "score": 2,
                      "num_children": 1,
                      "author": 241829,
                      "replies": [
                        {
                          "id": "ic1rhi1",
                          "text": "Lmaoo I guess your right 😂😂",
                          "timestamp": "2022-06-12 03:27:18",
                          "score": 2,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ic1owae",
      "text": "I think you should wait a few months to tell her when she is a good mood. She might actually be sad at first but then also find it funny and kind of cute that you left and came back later.",
      "timestamp": "2022-06-12 03:02:41",
      "score": 1,
      "num_children": 0,
      "author": 400174,
      "replies": []
    },
    {
      "id": "ic1p1si",
      "text": "I've done something similar, great job OP!",
      "timestamp": "2022-06-12 03:04:06",
      "score": 1,
      "num_children": 0,
      "author": 104821,
      "replies": []
    },
    {
      "id": "ic1pduy",
      "text": "good \"f ups\" are like positivity on cable news, so rare that one tends to forget that they're even possible.",
      "timestamp": "2022-06-12 03:07:10",
      "score": 1,
      "num_children": 0,
      "author": 242903,
      "replies": []
    },
    {
      "id": "ic1pidy",
      "text": "You played it just right",
      "timestamp": "2022-06-12 03:08:22",
      "score": 1,
      "num_children": 0,
      "author": 91670,
      "replies": []
    },
    {
      "id": "ic1pmba",
      "text": "r/wholesome af",
      "timestamp": "2022-06-12 03:09:24",
      "score": 1,
      "num_children": 0,
      "author": 177404,
      "replies": []
    },
    {
      "id": "ic1psic",
      "text": "I’m going through a hard time & this made me tear up in such a happy way.",
      "timestamp": "2022-06-12 03:11:06",
      "score": 1,
      "num_children": 1,
      "author": 51017,
      "replies": [
        {
          "id": "ic1pu8e",
          "text": "I hope wtv your going through gets better. All the best 🙏🙏",
          "timestamp": "2022-06-12 03:11:35",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1q19j",
      "text": "This is so cute!! I'm dead. Oh man, let every relationship be this wholesome.",
      "timestamp": "2022-06-12 03:13:29",
      "score": 1,
      "num_children": 0,
      "author": 85052,
      "replies": []
    },
    {
      "id": "ic1q2hz",
      "text": "This is incredibly cute",
      "timestamp": "2022-06-12 03:13:50",
      "score": 1,
      "num_children": 0,
      "author": 7732,
      "replies": []
    },
    {
      "id": "ic1qvnx",
      "text": "How was the movie marathon though?",
      "timestamp": "2022-06-12 03:21:25",
      "score": 1,
      "num_children": 1,
      "author": 394941,
      "replies": [
        {
          "id": "ic1r1tw",
          "text": "Pretty awesome. It was not fun getting up the next morning though 😂",
          "timestamp": "2022-06-12 03:23:04",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1sa4f",
      "text": "[deleted]",
      "timestamp": "2022-06-12 03:35:12",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "ic1tdyu",
          "text": "Well Not with that attitude 😅Your person will come eventually. Just gotta be Patient",
          "timestamp": "2022-06-12 03:46:15",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1tnwe",
      "text": "Lolol wait at least a year until you tell her. She’ll probably get a kick out of it, and maybe she’ll have her own funny anecdote to share with you.",
      "timestamp": "2022-06-12 03:49:04",
      "score": 1,
      "num_children": 1,
      "author": 93449,
      "replies": [
        {
          "id": "ic1tsfa",
          "text": "If I’m being honest I’ll probably slip up and the secret will spill before then 😂 since as y’all can see I’m just so good at keeping secrets to myself",
          "timestamp": "2022-06-12 03:50:20",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "ic1tyo8",
              "text": "I’m sure she’ll appreciate the effort you put into making sure she enjoyed your reaction to her surprise. I sure as hell would if my girlfriend did that, and she’d likely feel the same :)",
              "timestamp": "2022-06-12 03:52:05",
              "score": 1,
              "num_children": 0,
              "author": 93449,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ic1vee8",
      "text": "Happy birthday, and many more years of a wonderful life to you!!! Nice post.",
      "timestamp": "2022-06-12 04:06:51",
      "score": 1,
      "num_children": 1,
      "author": 35680,
      "replies": [
        {
          "id": "ic1vqe1",
          "text": "Thank you very much kind person I wish the same to you 🙏",
          "timestamp": "2022-06-12 04:10:18",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1vipl",
      "text": "Awesome wholesomeness!",
      "timestamp": "2022-06-12 04:08:07",
      "score": 1,
      "num_children": 0,
      "author": 159033,
      "replies": []
    },
    {
      "id": "ic1vmhc",
      "text": "![gif](giphy|6nWhy3ulBL7GSCvKw6)",
      "timestamp": "2022-06-12 04:09:12",
      "score": 1,
      "num_children": 0,
      "author": 155735,
      "replies": []
    },
    {
      "id": "ic1vsk9",
      "text": "“If you like piña coladas…” 🎶🎵",
      "timestamp": "2022-06-12 04:10:56",
      "score": 1,
      "num_children": 0,
      "author": 48347,
      "replies": []
    },
    {
      "id": "ic1wl33",
      "text": "This is the sweetest thing I read all day! Happy Birthday!",
      "timestamp": "2022-06-12 04:18:46",
      "score": 1,
      "num_children": 0,
      "author": 269053,
      "replies": []
    },
    {
      "id": "ic1wq4c",
      "text": "Thank goodness I got my covid shot and was wearing my mask when I read this post.\n\n I might have gotten being a redditor disease.",
      "timestamp": "2022-06-12 04:20:08",
      "score": 1,
      "num_children": 0,
      "author": 273870,
      "replies": []
    },
    {
      "id": "ic1wt8s",
      "text": "Marriage goals. So wholesome",
      "timestamp": "2022-06-12 04:20:56",
      "score": 1,
      "num_children": 0,
      "author": 112681,
      "replies": []
    },
    {
      "id": "ic1wtxv",
      "text": "Happy birthday!!!! Mine is today too! So happy to hear it went well, it's the little things that matter most. Cheers!",
      "timestamp": "2022-06-12 04:21:07",
      "score": 1,
      "num_children": 1,
      "author": 251801,
      "replies": [
        {
          "id": "ic1xd9i",
          "text": "I agree. Happy birthday to you! I hope you had a good birthday !!🙏",
          "timestamp": "2022-06-12 04:26:36",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1xqvw",
      "text": "I imagine a scenerio where you saw your wife making a cake, approach her, hug her from behind, kiss her on the cheek and say thank you to her, then you baking cake together, a lovely happy marriage moment.",
      "timestamp": "2022-06-12 04:30:36",
      "score": 1,
      "num_children": 0,
      "author": 129278,
      "replies": []
    },
    {
      "id": "ic1yv30",
      "text": "When I was a kid my uncle was always 2+ hours early to everything. We loved having him so we planned around him being there then. One year we had a surprise party for his daughter, everyone else was supposed to get there at 2, they were supposed to get there at 3.\n\n\nThey showed up at 1",
      "timestamp": "2022-06-12 04:42:29",
      "score": 1,
      "num_children": 1,
      "author": 412520,
      "replies": [
        {
          "id": "ic1z60g",
          "text": "Oh lord 😂. That’s a party that will never be forgotten 😅",
          "timestamp": "2022-06-12 04:45:50",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1z1gx",
      "text": "Ive forgotten my birthday twice now, as an adult. For reference though, my ADHD is terrible. I forget my own age most days haha",
      "timestamp": "2022-06-12 04:44:24",
      "score": 1,
      "num_children": 0,
      "author": 82972,
      "replies": []
    },
    {
      "id": "ic1zata",
      "text": "Haha that’s hilarious! I’ve forgotten my own birthday more than once and been reminded halfway through the day",
      "timestamp": "2022-06-12 04:47:21",
      "score": 1,
      "num_children": 1,
      "author": 98580,
      "replies": [
        {
          "id": "ic1zjk1",
          "text": "Happened to me a few times to 😅😅 gotta get reminded sometimes lmao",
          "timestamp": "2022-06-12 04:49:54",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1ze46",
      "text": "My now wife, then girlfriend threw me a surprise party in college. I figured it out the day of. She still doesn’t know…. I’m saving it if she’s ever really being a dick /s (she will never know)",
      "timestamp": "2022-06-12 04:48:20",
      "score": 1,
      "num_children": 0,
      "author": 283918,
      "replies": []
    },
    {
      "id": "ic20sc3",
      "text": "So OP pulled a Bob, from Bob's Burgers. lols.\n\nGood on you to back out. <3",
      "timestamp": "2022-06-12 05:03:40",
      "score": 1,
      "num_children": 0,
      "author": 180913,
      "replies": []
    },
    {
      "id": "ic20vex",
      "text": "being considerate of another person's feelings? Good human, very good",
      "timestamp": "2022-06-12 05:04:37",
      "score": 1,
      "num_children": 0,
      "author": 216015,
      "replies": []
    },
    {
      "id": "ic21g6p",
      "text": "You two seem like such nice people hahaha \n\nHappy birthday!",
      "timestamp": "2022-06-12 05:10:36",
      "score": 1,
      "num_children": 1,
      "author": 75937,
      "replies": [
        {
          "id": "ic21hsw",
          "text": "Lol thank you thank you 🙏 🙏",
          "timestamp": "2022-06-12 05:11:04",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic21sik",
      "text": "You are a good man! Happy birthday!!!",
      "timestamp": "2022-06-12 05:14:23",
      "score": 1,
      "num_children": 1,
      "author": 287549,
      "replies": [
        {
          "id": "ic22p9v",
          "text": "Thank you very much 🙏🙏",
          "timestamp": "2022-06-12 05:24:47",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic21yb5",
      "text": "And that’s why she loves you.",
      "timestamp": "2022-06-12 05:16:12",
      "score": 2,
      "num_children": 1,
      "author": 219873,
      "replies": [
        {
          "id": "ic22u1z",
          "text": "Aw this was sweet thank you",
          "timestamp": "2022-06-12 05:26:21",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic223ag",
      "text": "What was the movie series?",
      "timestamp": "2022-06-12 05:17:45",
      "score": 1,
      "num_children": 0,
      "author": 97233,
      "replies": []
    },
    {
      "id": "ic227mi",
      "text": "The most guy thing ever. \"I forgot my own birthday\".  Lmfao.",
      "timestamp": "2022-06-12 05:19:08",
      "score": 1,
      "num_children": 1,
      "author": 238887,
      "replies": [
        {
          "id": "ic22pul",
          "text": "Lmaooo 😅",
          "timestamp": "2022-06-12 05:24:58",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic248ik",
      "text": "This is ridiculously wholesome. Happy birthday, op!",
      "timestamp": "2022-06-12 05:43:09",
      "score": 1,
      "num_children": 0,
      "author": 108553,
      "replies": []
    },
    {
      "id": "ic24bm8",
      "text": "happy birthday! 🥳🎉🎈🎊",
      "timestamp": "2022-06-12 05:44:15",
      "score": 1,
      "num_children": 0,
      "author": 141808,
      "replies": []
    },
    {
      "id": "ic24csd",
      "text": "I love this! I also love that I read \"face hugged her\" and imagined you hugging her whole face before I realized it didn't mean what I thought 😄",
      "timestamp": "2022-06-12 05:44:40",
      "score": 1,
      "num_children": 1,
      "author": 247138,
      "replies": [
        {
          "id": "ic25keh",
          "text": "LMAOO that’s funny 😅😅",
          "timestamp": "2022-06-12 06:00:11",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic24pn1",
      "text": "I had a friend once say to me \"Are you excited for sushi at your surprise birthday par-- ohhh shiittttttt\"",
      "timestamp": "2022-06-12 05:49:07",
      "score": 1,
      "num_children": 1,
      "author": 60134,
      "replies": [
        {
          "id": "ic259uz",
          "text": "Lmaooo he tried A for effort 😅😅😅",
          "timestamp": "2022-06-12 05:56:16",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic24pu9",
      "text": "that's so sweet :-)",
      "timestamp": "2022-06-12 05:49:11",
      "score": 1,
      "num_children": 0,
      "author": 191590,
      "replies": []
    },
    {
      "id": "ic24q0b",
      "text": "Happy Birthday you motherfucker. I teared up at this.",
      "timestamp": "2022-06-12 05:49:14",
      "score": 1,
      "num_children": 1,
      "author": 145550,
      "replies": [
        {
          "id": "ic258jw",
          "text": "Hahaha thank you 😂😂🙏🙏",
          "timestamp": "2022-06-12 05:55:48",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic25ky1",
      "text": "so when it is your birthday and someone gives you a suprise like this you get double shocked. You say some shit like \"yo its my birthday today?\"",
      "timestamp": "2022-06-12 06:00:22",
      "score": 1,
      "num_children": 1,
      "author": 125445,
      "replies": [
        {
          "id": "ic25nos",
          "text": "yes!! Pretty much exactly this. Or im normally like “says who?” But then I check the date and it is in fact my birthday. Or there is a situation like this😅😅",
          "timestamp": "2022-06-12 06:01:23",
          "score": 4,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic25u5y",
      "text": "Everything about this is so sweet. You'll have to tell her one day and I'm sure she'll find it hilarious!\n\nHappy you've found someone who not only makes you feel happy and appreciated but you want to make feel happy and appreciated in return.",
      "timestamp": "2022-06-12 06:03:46",
      "score": 1,
      "num_children": 0,
      "author": 213643,
      "replies": []
    },
    {
      "id": "ic283xm",
      "text": "I detect zero fuckups in this story.",
      "timestamp": "2022-06-12 06:34:33",
      "score": 1,
      "num_children": 0,
      "author": 120080,
      "replies": []
    },
    {
      "id": "ic287z1",
      "text": "Not sure why but Reddit has this post listed as mature content.",
      "timestamp": "2022-06-12 06:36:04",
      "score": 1,
      "num_children": 1,
      "author": 334638,
      "replies": [
        {
          "id": "ic2890u",
          "text": "Really?, hm weird",
          "timestamp": "2022-06-12 06:36:28",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic28h4a",
      "text": "You didn't fuck up man, you fucked down 😁👌",
      "timestamp": "2022-06-12 06:39:39",
      "score": 1,
      "num_children": 0,
      "author": 24254,
      "replies": []
    },
    {
      "id": "ic28mcy",
      "text": "There is no way this is a TIFU story",
      "timestamp": "2022-06-12 06:41:36",
      "score": 1,
      "num_children": 1,
      "author": 52645,
      "replies": [
        {
          "id": "ic28pxk",
          "text": "Not all fuck up story’s gotta be bad ones Lmao",
          "timestamp": "2022-06-12 06:42:59",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic293l0",
      "text": "I hope husbands who have wives who do this sort of thing really appreciate it because there are those of us out here who have never had a woman remember our birthdays. It sucks to be forgotten and not cared about. Enjoy it.",
      "timestamp": "2022-06-12 06:48:25",
      "score": 1,
      "num_children": 1,
      "author": 386786,
      "replies": [
        {
          "id": "ic298e3",
          "text": "Yea I get the feeling man.",
          "timestamp": "2022-06-12 06:50:15",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic29grf",
      "text": "After the first line and half. Was expecting a different outcome.",
      "timestamp": "2022-06-12 06:53:34",
      "score": 1,
      "num_children": 1,
      "author": 361589,
      "replies": [
        {
          "id": "ic29jcl",
          "text": "Lmaoo many people thought this was gonna go sideways to 😅😅",
          "timestamp": "2022-06-12 06:54:34",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic29mq7",
      "text": "Happy birthday and all ended well and forgetting your birthday is a good thing don't need reminder of old age",
      "timestamp": "2022-06-12 06:55:56",
      "score": 1,
      "num_children": 0,
      "author": 32970,
      "replies": []
    },
    {
      "id": "ic29n2p",
      "text": "So wholesome, I love it!",
      "timestamp": "2022-06-12 06:56:04",
      "score": 1,
      "num_children": 0,
      "author": 333132,
      "replies": []
    },
    {
      "id": "ic2cf5l",
      "text": "I love how OP is more excited for his wife's excitement than his own. Good signs",
      "timestamp": "2022-06-12 07:36:02",
      "score": 1,
      "num_children": 0,
      "author": 102939,
      "replies": []
    },
    {
      "id": "ic2col0",
      "text": "This is so sweet!",
      "timestamp": "2022-06-12 07:39:56",
      "score": 1,
      "num_children": 0,
      "author": 288306,
      "replies": []
    },
    {
      "id": "ic2d20y",
      "text": "You pulled the Uno Reverse Card on her...",
      "timestamp": "2022-06-12 07:45:19",
      "score": 1,
      "num_children": 0,
      "author": 178342,
      "replies": []
    },
    {
      "id": "ic2df1a",
      "text": "This is a situation where it is very much the thought that is the most important thing.",
      "timestamp": "2022-06-12 07:50:41",
      "score": 1,
      "num_children": 0,
      "author": 237341,
      "replies": []
    },
    {
      "id": "ic2dkdb",
      "text": "r/Wholesome",
      "timestamp": "2022-06-12 07:52:55",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ic2ecia",
      "text": "This is great! I’ve forgotten my birthday no less than 5 times now, so I completely understand",
      "timestamp": "2022-06-12 08:04:32",
      "score": 1,
      "num_children": 1,
      "author": 159659,
      "replies": [
        {
          "id": "ic2efj9",
          "text": "Haha! Pretty soon I’ll start forgetting my age 😅😅",
          "timestamp": "2022-06-12 08:05:48",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "ic2eqle",
              "text": "Haha I’m surprised you haven’t already! Years ago I was on a bus with a close friend and I saw another friend who I hadn’t seen in quite a while. They mentioned that it had been so long and asked how old I was now. We finished our conversation and got off the bus a few stops later, when my friend asked me why I lied about my age. I looked at him confused and he told me that I had said the wrong age. Turned out, I just didn’t realize how old I really was and innocently said I was a year younger lol\n\nEdit: I’m 45 now, but this was when I was 27",
              "timestamp": "2022-06-12 08:10:30",
              "score": 1,
              "num_children": 1,
              "author": 159659,
              "replies": [
                {
                  "id": "ic2f4zy",
                  "text": "Lmaooo pretty soon that’s gonna be me if I keep forgetting😅😅. Very funny story",
                  "timestamp": "2022-06-12 08:16:46",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ic2f6su",
      "text": "/r/wholesometifu",
      "timestamp": "2022-06-12 08:17:31",
      "score": 1,
      "num_children": 0,
      "author": 351623,
      "replies": []
    },
    {
      "id": "ic2fg8u",
      "text": "That’s adorable. I love that you backed up and let her have her surprise. You two deserve each other.",
      "timestamp": "2022-06-12 08:21:30",
      "score": 1,
      "num_children": 0,
      "author": 69060,
      "replies": []
    },
    {
      "id": "ic2gdkf",
      "text": "Man you are a one lucky 🍀 Guy, Touch wud, Happy Birthday 🎉 🎂 🎉",
      "timestamp": "2022-06-12 08:35:38",
      "score": 1,
      "num_children": 0,
      "author": 332880,
      "replies": []
    },
    {
      "id": "ic2gtwz",
      "text": "Sounds more wholesome than a fuck up. Unless you're super bummed about not actually getting to be surprised for real, but it sounds like you had a good time regardless.",
      "timestamp": "2022-06-12 08:42:43",
      "score": 1,
      "num_children": 0,
      "author": 353925,
      "replies": []
    },
    {
      "id": "ic2h02x",
      "text": "What about her birthday tho",
      "timestamp": "2022-06-12 08:45:24",
      "score": 1,
      "num_children": 0,
      "author": 116988,
      "replies": []
    },
    {
      "id": "ic2h1d3",
      "text": "This is so cute :)",
      "timestamp": "2022-06-12 08:45:56",
      "score": 1,
      "num_children": 0,
      "author": 39962,
      "replies": []
    },
    {
      "id": "ic2i6es",
      "text": "aah...cute :)",
      "timestamp": "2022-06-12 09:03:33",
      "score": 1,
      "num_children": 0,
      "author": 67011,
      "replies": []
    },
    {
      "id": "ic2im8j",
      "text": "Ah, that’s so cute. I would totally not be able to act out my first genuine surprised face. A hug is a great coverup. Just so sweet of your wife. I hope you do something super special for her once her birthday rolls around.",
      "timestamp": "2022-06-12 09:10:15",
      "score": 1,
      "num_children": 0,
      "author": 266128,
      "replies": []
    },
    {
      "id": "ic2jgrk",
      "text": "You unfucked your fuck up there. That's a really sweet move of you to preserve the \"suprise\" moment for your wife.",
      "timestamp": "2022-06-12 09:23:26",
      "score": 1,
      "num_children": 0,
      "author": 101753,
      "replies": []
    },
    {
      "id": "ic2kk3t",
      "text": "The one time i got to leave early was the day my gf (now fiance) was setting up bday surprises for me XD",
      "timestamp": "2022-06-12 09:40:23",
      "score": 1,
      "num_children": 0,
      "author": 248955,
      "replies": []
    },
    {
      "id": "ic2kqv2",
      "text": "cute",
      "timestamp": "2022-06-12 09:43:16",
      "score": 1,
      "num_children": 0,
      "author": 140476,
      "replies": []
    },
    {
      "id": "ic2ktsj",
      "text": "DUDE HOW MANY PEOPLE HAVE THEIR BIRTHDAYS THIS WEEK??",
      "timestamp": "2022-06-12 09:44:30",
      "score": 1,
      "num_children": 1,
      "author": 246396,
      "replies": [
        {
          "id": "ic2lc9s",
          "text": "Get only 23 people in the same room and there's 50/50 chance two people of the 23 share a birthday\n \n[Probability chart ](https://i.imgur.com/FKspcnr.png)",
          "timestamp": "2022-06-12 09:52:21",
          "score": 1,
          "num_children": 0,
          "author": 28062,
          "replies": []
        }
      ]
    },
    {
      "id": "ic2lu6d",
      "text": "Happy birthday OP! This is wholesome!",
      "timestamp": "2022-06-12 10:00:04",
      "score": 1,
      "num_children": 0,
      "author": 50908,
      "replies": []
    },
    {
      "id": "ic2lvlg",
      "text": "I, too, have the tendency to forget about it, specifically on the day it takes place. That, and I don't see the point in celebrating it, but I simply take a mental note of something that is related to the respective day, which in exchange, reminds me what date we are on.",
      "timestamp": "2022-06-12 10:00:38",
      "score": 1,
      "num_children": 0,
      "author": 188091,
      "replies": []
    },
    {
      "id": "ic2mqcf",
      "text": "If my birthday didn’t land on a holiday I would be in the same boat",
      "timestamp": "2022-06-12 10:13:30",
      "score": 1,
      "num_children": 0,
      "author": 116340,
      "replies": []
    },
    {
      "id": "ic2nrpy",
      "text": "May your relationship last till your end of days. Because I can see when two people love each other. And this is it. Speaking from a sixteen year relationship in which we JUST got married, hold on to her as long as you can. And she should hold on to you. Ok, some ninjas broke into my house and started cutting onions........",
      "timestamp": "2022-06-12 10:29:08",
      "score": 1,
      "num_children": 0,
      "author": 39000,
      "replies": []
    },
    {
      "id": "ic2o2qm",
      "text": "This reminds me of when my wife threw a surprise 30th for me. The night she decided to plan it, she got drunk and spilled the beans. 3 months of planning I had to pretend I didn’t know anything.",
      "timestamp": "2022-06-12 10:33:45",
      "score": 1,
      "num_children": 0,
      "author": 237273,
      "replies": []
    },
    {
      "id": "ic2o8ws",
      "text": "More like Today You Fucking Nailed It",
      "timestamp": "2022-06-12 10:36:13",
      "score": 1,
      "num_children": 0,
      "author": 248291,
      "replies": []
    },
    {
      "id": "ic2oa5u",
      "text": "This is best tifu ever. ❤️",
      "timestamp": "2022-06-12 10:36:44",
      "score": 1,
      "num_children": 0,
      "author": 254980,
      "replies": []
    },
    {
      "id": "ic2op8z",
      "text": "Lol how did she not hear you come in?",
      "timestamp": "2022-06-12 10:43:01",
      "score": 1,
      "num_children": 0,
      "author": 192399,
      "replies": []
    },
    {
      "id": "ic2py1l",
      "text": "Go back to work and make that money. 😂",
      "timestamp": "2022-06-12 11:01:10",
      "score": 1,
      "num_children": 0,
      "author": 97064,
      "replies": []
    },
    {
      "id": "ic2qlnr",
      "text": "My wife was planning a surprise party once, and accidentally cc'ed me with all the other invitees. Saw the email on my phone while I was in the kitchen.  Immediately texted my best friend letting him know I got an email that I shouldn't have, and that my laptop in the other room was logged into my email. Deleted the text. Stayed in the kitchen for about 30 minutes and never spoke of it again to anyone. Did have a really cool surprise party that year though",
      "timestamp": "2022-06-12 11:10:05",
      "score": 1,
      "num_children": 0,
      "author": 330684,
      "replies": []
    },
    {
      "id": "ic2s2hp",
      "text": "Tell her idly one time, tell her you were tired and didn’t realise it was your birthday and didn’t want to ruin your wives hard work, I’m sure she’d think it was really sweet",
      "timestamp": "2022-06-12 11:29:08",
      "score": 1,
      "num_children": 0,
      "author": 239680,
      "replies": []
    },
    {
      "id": "ic2sj61",
      "text": "I'm so happy you walked back out of the door and she didn't notice you.",
      "timestamp": "2022-06-12 11:34:46",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ic2talc",
      "text": "This is super cute! \nAs a woman who puts a lot into things for others, thank you for quietly walking out and doing that for her, as she did this for you. \nIt may not seem like a lot, but you did a great thing.",
      "timestamp": "2022-06-12 11:43:40",
      "score": 1,
      "num_children": 0,
      "author": 249159,
      "replies": []
    },
    {
      "id": "ic2u1i8",
      "text": "Idk why, but this smells a whole lot of some sort of fanfic",
      "timestamp": "2022-06-12 11:52:12",
      "score": 1,
      "num_children": 1,
      "author": 330300,
      "replies": [
        {
          "id": "ic3jyhi",
          "text": "How do you figure? You don't always get cake mix all over your face like they do in a rom com?",
          "timestamp": "2022-06-12 15:48:58",
          "score": 2,
          "num_children": 1,
          "author": 238802,
          "replies": [
            {
              "id": "ic3k75n",
              "text": "Yeah that's what made me suspicious in the first place",
              "timestamp": "2022-06-12 15:50:49",
              "score": 1,
              "num_children": 0,
              "author": 330300,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ic2xgcl",
      "text": "Awwwww, so cute.",
      "timestamp": "2022-06-12 12:30:28",
      "score": 1,
      "num_children": 0,
      "author": 42844,
      "replies": []
    },
    {
      "id": "ic2xny3",
      "text": "Nice moves on BOTH your parts.  \nShows true love,respect and care for each other.",
      "timestamp": "2022-06-12 12:32:39",
      "score": 1,
      "num_children": 0,
      "author": 203468,
      "replies": []
    },
    {
      "id": "ic2xtco",
      "text": "Ohhh this is the most wholesome thing I have ever heard in my whole life and I love you for it.  Your wife is a lucky individual.",
      "timestamp": "2022-06-12 12:34:15",
      "score": 1,
      "num_children": 0,
      "author": 346701,
      "replies": []
    },
    {
      "id": "ic2xu0o",
      "text": "The best TIFU ever. Way to go OP!!! Smooth move making it a win win!!!",
      "timestamp": "2022-06-12 12:34:27",
      "score": 1,
      "num_children": 0,
      "author": 374905,
      "replies": []
    },
    {
      "id": "ic2yvjo",
      "text": "Okay this made me cry. Too cute.",
      "timestamp": "2022-06-12 12:45:12",
      "score": 1,
      "num_children": 0,
      "author": 173100,
      "replies": []
    },
    {
      "id": "ic2yy0d",
      "text": "Just back it up. Back it up.",
      "timestamp": "2022-06-12 12:45:53",
      "score": 1,
      "num_children": 0,
      "author": 107665,
      "replies": []
    },
    {
      "id": "ic30r9c",
      "text": "This is the most wholesome TIFU post I’ve ever read. Thanks, OP!",
      "timestamp": "2022-06-12 13:03:54",
      "score": 1,
      "num_children": 0,
      "author": 92300,
      "replies": []
    },
    {
      "id": "ic31gtr",
      "text": "Tifu = I’d like to tell someone a mildly good story",
      "timestamp": "2022-06-12 13:10:52",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ic33it5",
      "text": "A \"ruff\" childhood, eh? Were you raised by wolves?",
      "timestamp": "2022-06-12 13:30:36",
      "score": 1,
      "num_children": 0,
      "author": 292139,
      "replies": []
    },
    {
      "id": "ic33wco",
      "text": "Aw! I love this so much. Happy birthday!",
      "timestamp": "2022-06-12 13:34:11",
      "score": 1,
      "num_children": 0,
      "author": 91757,
      "replies": []
    },
    {
      "id": "ic35uqb",
      "text": ">chuckling",
      "timestamp": "2022-06-12 13:52:16",
      "score": 1,
      "num_children": 0,
      "author": 185036,
      "replies": []
    },
    {
      "id": "ic373dp",
      "text": "Why can’t I just be happy like you guys. Sounds like a loving relationship.",
      "timestamp": "2022-06-12 14:03:19",
      "score": 1,
      "num_children": 0,
      "author": 68051,
      "replies": []
    },
    {
      "id": "ic3cr30",
      "text": "She made you tapestries too! You fortunate man!",
      "timestamp": "2022-06-12 14:51:30",
      "score": 1,
      "num_children": 0,
      "author": 48482,
      "replies": []
    },
    {
      "id": "ic3d855",
      "text": "The most wholesome TIFU ever. I am so happy for both you and your wife to be in such a loving relationship. Happy birthday!!!",
      "timestamp": "2022-06-12 14:55:25",
      "score": 1,
      "num_children": 0,
      "author": 210714,
      "replies": []
    },
    {
      "id": "ic3j0ct",
      "text": "Stories like this, give me hope, and encourage me to never settle for less that what I would do myself",
      "timestamp": "2022-06-12 15:41:35",
      "score": 1,
      "num_children": 0,
      "author": 311969,
      "replies": []
    },
    {
      "id": "ic3n6hc",
      "text": "Happy birthday buddy",
      "timestamp": "2022-06-12 16:13:55",
      "score": 1,
      "num_children": 0,
      "author": 188236,
      "replies": []
    },
    {
      "id": "ic3rbpc",
      "text": "A gentleman for sure",
      "timestamp": "2022-06-12 16:45:41",
      "score": 1,
      "num_children": 0,
      "author": 377229,
      "replies": []
    },
    {
      "id": "ic3v0ii",
      "text": "Birthdays aren't a big deal for some people.  Don't feel bad about that. \nYou though, are a good man and deserve the celebration.",
      "timestamp": "2022-06-12 17:14:09",
      "score": 1,
      "num_children": 0,
      "author": 264230,
      "replies": []
    },
    {
      "id": "ic3xs6i",
      "text": "No one has ever done that for me. I did quite a few great parties for my husband",
      "timestamp": "2022-06-12 17:35:27",
      "score": 1,
      "num_children": 0,
      "author": 272236,
      "replies": []
    },
    {
      "id": "ic4196s",
      "text": "This is so wholesome.",
      "timestamp": "2022-06-12 18:02:11",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ic420zd",
      "text": "Happy birthday!!! Thank you for sharing this wonderful story! Wishing you and your wife the very best!!",
      "timestamp": "2022-06-12 18:08:12",
      "score": 1,
      "num_children": 0,
      "author": 195126,
      "replies": []
    },
    {
      "id": "ic4gpzo",
      "text": "This is real couple goals",
      "timestamp": "2022-06-12 20:00:55",
      "score": 1,
      "num_children": 0,
      "author": 159343,
      "replies": []
    },
    {
      "id": "ic51wje",
      "text": "Happy Birthday!!! 🎂🎉🎊 I definitely want a relationship like yours 💗💗",
      "timestamp": "2022-06-12 22:49:46",
      "score": 1,
      "num_children": 0,
      "author": 126626,
      "replies": []
    },
    {
      "id": "ic6rb3y",
      "text": "Thats sounds like a great day",
      "timestamp": "2022-06-13 10:12:37",
      "score": 1,
      "num_children": 0,
      "author": 257282,
      "replies": []
    },
    {
      "id": "ic6spj5",
      "text": "istg if i dont have a wholesome marriage like y’all ill lose my mind 😭",
      "timestamp": "2022-06-13 10:32:06",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "idtlqn2",
      "text": "This just put such a smile on my face. That’s such a sweet birthday memory and a sign of y’all’s love.",
      "timestamp": "2022-06-26 16:30:21",
      "score": 1,
      "num_children": 0,
      "author": 113897,
      "replies": []
    },
    {
      "id": "ic1yv0r",
      "text": "Not enough sex in the story. Downvote /s",
      "timestamp": "2022-06-12 04:42:28",
      "score": -3,
      "num_children": 0,
      "author": 41754,
      "replies": []
    },
    {
      "id": "ic1sqbl",
      "text": "Thank you for being so awesome and appreciating this gesture. It made me cry, and I'm not even your wife.",
      "timestamp": "2022-06-12 03:39:38",
      "score": -2,
      "num_children": 1,
      "author": 34165,
      "replies": [
        {
          "id": "ic1tiol",
          "text": "Haha! Your very kind thank you😅😅",
          "timestamp": "2022-06-12 03:47:36",
          "score": 0,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic2acop",
      "text": "She was having an affair. She used cake batter to cover up something else. You fell for it all.",
      "timestamp": "2022-06-12 07:06:01",
      "score": -7,
      "num_children": 1,
      "author": 54133,
      "replies": [
        {
          "id": "ic2ag2k",
          "text": "Ah shit 🤦",
          "timestamp": "2022-06-12 07:07:20",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic2d2be",
      "text": "[removed]",
      "timestamp": "2022-06-12 07:45:26",
      "score": -5,
      "num_children": 3,
      "replies": [
        {
          "id": "ic2l1m7",
          "text": "Reddit is filled with copy pasta's and made up stories, sadly most people lack originality",
          "timestamp": "2022-06-12 09:47:51",
          "score": 2,
          "num_children": 1,
          "author": 267956,
          "replies": [
            {
              "id": "ic6e2vm",
              "text": "Personally, I don't even mind the made-up stuff.  Made-up or real, it's all the same to me.  But it sucks when so much content doesn't fit in with the sub's intent at all.  I mean, this is Today I Fucked Up, not Today I Had A Silly Sitcom Encounter.",
              "timestamp": "2022-06-13 06:54:49",
              "score": 0,
              "num_children": 0,
              "author": 355178,
              "replies": []
            }
          ]
        },
        {
          "id": "ic2dabd",
          "text": "Bye 👋👋",
          "timestamp": "2022-06-12 07:48:47",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ic2e8z5",
          "text": "what are you smoking bruv?",
          "timestamp": "2022-06-12 08:03:06",
          "score": 0,
          "num_children": 0,
          "author": 221891,
          "replies": []
        }
      ]
    },
    {
      "id": "ic1wvkb",
      "text": "As an undiagnosed add (attention defi.. squirrel) adult with now grown kids I apologize to them for missing bdays frequently. Thankfully they all are stupid great at creating new pretty sweet bday traditions for their kids. \n\nWe all live a lot of little lives. You probably would not appreciate her working so hard to surprise/treat you if you had  great childhood bdays. Not dissing your childhood pain, glad the universe found you a great partner to make up for it.",
      "timestamp": "2022-06-12 04:21:33",
      "score": -2,
      "num_children": 1,
      "author": 117528,
      "replies": [
        {
          "id": "ic1x9oe",
          "text": "I’m not sure why you would think that. She does a lot and I’m grateful for all of it regardless of the scenario haha",
          "timestamp": "2022-06-12 04:25:32",
          "score": 2,
          "num_children": 2,
          "replies": [
            {
              "id": "ic1y7de",
              "text": "Cause she rocks obviously. Take good care of her.",
              "timestamp": "2022-06-12 04:35:22",
              "score": 1,
              "num_children": 0,
              "author": 117528,
              "replies": []
            },
            {
              "id": "ic1yhio",
              "text": "Ack. And you rock too... For making her think you didn't come home early. Rockstar you are!",
              "timestamp": "2022-06-12 04:38:22",
              "score": 1,
              "num_children": 0,
              "author": 117528,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ic2lh6r",
      "text": "You only mentioned 1, and you called her women. I thought you had wives, but you only have 1.\nYou think she is wonderful, and you think she is thoughtful. You should marry her a few more times, so you can have her all.",
      "timestamp": "2022-06-12 09:54:30",
      "score": -2,
      "num_children": 1,
      "author": 237473,
      "replies": [
        {
          "id": "ic2lrbx",
          "text": "dude what? \n\nNvm😐",
          "timestamp": "2022-06-12 09:58:52",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ic4e9f8",
      "text": "My latest return surprised my husband on Tiffany's day.\n\nIt is not small, but stupid. I don't remember the results of my birth.\n\nYes, I know the difference. Unfortunately, as a child, I didn't celebrate my birthday. I'll never forget it, so when I was younger I couldn't remember. So I don't care\n\nHe married a beautiful woman, but he's still throwing a birthday party. Sometimes I forget. This morning I went home and surprised my wife.\n\nI was silent and wanted to eat in the kitchen. Caramel dough Christmas cake I found in the kitchen with flowers and decorations. I make a cake for a good meal. My birthday is beautiful\n\nI opened the room and walked slowly to the door, walked out slowly and waited seven and a half hours to get home. My husband is angry and hard working.\n\nHe practices three hours. I miss you, God.\n\n\"Below!\" I cried. To my surprise, I ran a marathon.\n\nThere will be no secrets. But I think birthdays are better. Do something, I want to tell you the secret of the tomb.\n\nI don't remember my doctor's birthday, I ran home. I am proud of my husband. My wife makes cakes for my daughter. On me",
      "timestamp": "2022-06-12 19:41:38",
      "score": 0,
      "num_children": 0,
      "replies": []
    }
  ]
}