{
  "id": "vdjnif",
  "text": "Mormon Church child leader admits to sex abuse at sleepovers he hosted. Once again, we have evidence that kids are in more danger around church folks than around transgender folks in a bathroom. Funny how right wingers never suggest banning church leaders from bathrooms.\nhttps://komonews.com/amp/news/nation-world/mormon-church-child-leader-admits-to-sex-abuse-at-sleepovers-he-hosted-sexual-assault-child-abuse-psychosexual",
  "timestamp": "2022-06-16 11:18:57",
  "score": 14719,
  "subreddit": "t5_2qh2p",
  "num_children": 127,
  "author": 255450,
  "replies": [
    {
      "id": "icliihz",
      "text": "Hello r/all, Welcome to r/atheism!\n\nPlease read our [Commandments](http://www.reddit.com/r/atheism/wiki/guidelines) and [FAQ](http://www.reddit.com/r/atheism/wiki/FAQ) before commenting. If you follow the rules and act civilly we can avoid a lot of bans. While everyone is welcome here, this sub is intended for atheists to discuss things of interest to us. This means that a wide variety of subjects are on-topic here. This is not a sub about just atheism.\n\nRemember: The mods do not choose which posts get voted up the frontpage. They remove the posts that violate the [Commandments](/r/atheism/w/guidelines); they don't police quality.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*",
      "timestamp": "2022-06-16 16:15:21",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "ickihbu",
      "text": "And they have the gall to ask atheists \"where we get our morals\" from.\n\nCertainly not the damn Bible if this is how biblical morality works.",
      "timestamp": "2022-06-16 11:21:52",
      "score": 893,
      "num_children": 19,
      "author": 129879,
      "replies": [
        {
          "id": "icl00cf",
          "text": "Imagine only doing the right thing because your afraid of getting banned from heaven. Sounds like an efficient brainwashing method to get bad people to do the right thing against their will.  Somehow they turned it into just being huge pieces of shit to everyone else.",
          "timestamp": "2022-06-16 14:01:58",
          "score": 230,
          "num_children": 6,
          "author": 4803,
          "replies": [
            {
              "id": "iclf7d3",
              "text": "\"wait so the only thing stopping you from being a horrible person, is because someone said to not to in this old book? You couldnt figure out the whole dont rape or murder thing on your own?\"",
              "timestamp": "2022-06-16 15:52:06",
              "score": 132,
              "num_children": 3,
              "author": 218032,
              "replies": [
                {
                  "id": "iclwnb9",
                  "text": "I rape and kill as many people as I want.\n\n\n\nWell, I don't want to rape or kill anyone. The idea makes me sick. Don't need a book if I was born with and cultivated empathy *taps forehead",
                  "timestamp": "2022-06-16 17:51:45",
                  "score": 57,
                  "num_children": 2,
                  "author": 200339,
                  "replies": [
                    {
                      "id": "icmpxdj",
                      "text": "it is fine, you can rape and kill on the weekends, but come monday morning you can repent and apologize at the confession booths and then stay out of trouble for that week, until the next weekend rolls again and repeat!",
                      "timestamp": "2022-06-16 21:22:18",
                      "score": 29,
                      "num_children": 3,
                      "replies": [
                        {
                          "id": "icn1ubt",
                          "text": "Thats how it works, and when caught out fucking up its \"Im not perfect, but I'm forgiven\"",
                          "timestamp": "2022-06-16 22:49:49",
                          "score": 13,
                          "num_children": 0,
                          "author": 376180,
                          "replies": []
                        },
                        {
                          "id": "icmwbpb",
                          "text": "Can i get an Amen!?",
                          "timestamp": "2022-06-16 22:08:40",
                          "score": 6,
                          "num_children": 0,
                          "author": 297919,
                          "replies": []
                        },
                        {
                          "id": "iecj3lf",
                          "text": "You know. You're absolutely right. I never believed it until I met someone who does exactly that. From Monday through Saturday he will do drugs, steal from elderly people, lie to his customer (realtor), cheat on his wife. And he is an avid consumer of all kinds of pornography, including zoophilia. Always looking for either under-age, or near under-age sex. The guy does all kinds of shit imaginable. And he is a devout catholic on top of it all. On Sunday after mass he will go into one of those booths and will confess all his sins. He gets pardoned, or absolved (I'm not familiar with religious jargon). And the following week he is at everything all over again. The guy is simply DESPICABLE,  and a total prick. But I guess he is a good Christian.",
                          "timestamp": "2022-06-30 18:07:05",
                          "score": 1,
                          "num_children": 0,
                          "author": 122201,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "icml1y7",
                      "text": "My sister always said that they invented church for those who don’t innately have feelings of empathy and the concept of the Golden Rule. They have to be told regularly to be good.  Or they won’t.",
                      "timestamp": "2022-06-16 20:47:33",
                      "score": 17,
                      "num_children": 2,
                      "author": 170871,
                      "replies": [
                        {
                          "id": "icnb2is",
                          "text": "They should've put more effort into ensuring the people without empathy don't end up in control of the church.",
                          "timestamp": "2022-06-17 00:04:19",
                          "score": 13,
                          "num_children": 0,
                          "author": 5588,
                          "replies": []
                        },
                        {
                          "id": "icnn2w5",
                          "text": ">My sister always said that they invented church for those who don’t innately have feelings of empathy and the concept of the Golden Rule.\n\nNo, church wasn't invented FOR people without empathy.  It was invented BY people without empathy, to enable them to exploit everyone else.",
                          "timestamp": "2022-06-17 01:44:06",
                          "score": 1,
                          "num_children": 0,
                          "author": 184569,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "icmps0g",
                  "text": " I get people argue that the bible has \"good points of self improvement\" but why do you need the bible to tell you these things? why can't you just be considerate on your own? and if you're just following the bible as a self help book, using the morals of the stories to apply to yourself, then why not just drop the whole cult and jesus motif all together and just focus on the messages in the stories? \n\n  \nHeck, re-write and modernize them, apply them to Marvel characters, if you have to. You can have the same A-Z plots with the same moral at the end of it, without having to have the baggage of Christianity stuck to it. Those stories can be rewritten in anyway with the same core message to it.. And learn to be a good person to be considerate, not for some prize.  \n\n\nIt is honestly the same thing about Christmas, why wait for that specific day to give gifts and spend time with people you love? Pick any day of the year to gather together. Why does giving your son an Xbox and eating food with your extended family have to be tied to Chrsitianity? We just need to drop that cult and stop giving it power. You can give a gift to your son, without it having to mean something, without it having to be on that day, without stapeling that irrelivant cult from some desert to it. People can't just do nice things, it needs a Chrisitanity label on it when they do it... It just isn't needed.",
                  "timestamp": "2022-06-16 21:21:15",
                  "score": 10,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "icmytmk",
                  "text": "It's more sinister than that. Apparently they fundamentally don't believe in others right *to exist* unless they are fellow converts/cultists.\n\nBut for the book telling them not to, they would be raping and murdering everything that didn't conform to their worldview. \n\nIt's nuts.",
                  "timestamp": "2022-06-16 22:27:07",
                  "score": 8,
                  "num_children": 1,
                  "author": 255896,
                  "replies": [
                    {
                      "id": "icnzjs1",
                      "text": "Dude, after I left the Mormon church I legit had a member tell me if it wasn't for the gospel he'd take advantage of people any way he could and only care about himself and what he could get out of the world.",
                      "timestamp": "2022-06-17 03:22:00",
                      "score": 4,
                      "num_children": 0,
                      "author": 262096,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iclfqqy",
              "text": "But they don't get banned from heaven because all they have to do is confess their sins to God to be forgiven. So it's a free pass to do whatever they want as long as they talk to the sky about all the shitty things they've done.",
              "timestamp": "2022-06-16 15:55:55",
              "score": 41,
              "num_children": 3,
              "author": 378423,
              "replies": [
                {
                  "id": "iclmymh",
                  "text": "[deleted]",
                  "timestamp": "2022-06-16 16:45:52",
                  "score": 19,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "icmmkgg",
                      "text": "Ah yes, slander an entire religion and the people who follow it because of a minority of sick people. What a wonderful world",
                      "timestamp": "2022-06-16 20:58:18",
                      "score": -1,
                      "num_children": 2,
                      "author": 221434,
                      "replies": [
                        {
                          "id": "icrvlb2",
                          "text": "[deleted]",
                          "timestamp": "2022-06-17 23:32:01",
                          "score": 2,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "icrz2wd",
                              "text": "I wasn't expecting a well thought out answer to my statement as well, this is reddit but honestly, i respect it. Im a man of Christian faith but, im not seriously devoted or one of those mega religious people you think about when you here Christianity. I more or so believe in god and the events that have taken place, thanks.",
                              "timestamp": "2022-06-18 00:02:01",
                              "score": 2,
                              "num_children": 0,
                              "author": 221434,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ico6p7k",
                          "text": "I used to follow it, and I can assure you, it's not a minority.",
                          "timestamp": "2022-06-17 04:24:39",
                          "score": 1,
                          "num_children": 0,
                          "author": 316726,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "icm3amo",
                  "text": "Honestly depends on which part of the Bible you’re talking about, there are some parts that would argue against that and some that would support it, that’s the issue with a book that was written by many different people over a long period of time.",
                  "timestamp": "2022-06-16 18:37:24",
                  "score": 4,
                  "num_children": 0,
                  "author": 265879,
                  "replies": []
                },
                {
                  "id": "icmac6b",
                  "text": "And that's not even a loophole - but a feature.",
                  "timestamp": "2022-06-16 19:25:45",
                  "score": 4,
                  "num_children": 1,
                  "author": 295230,
                  "replies": [
                    {
                      "id": "icpjbqq",
                      "text": "Oh definitely!",
                      "timestamp": "2022-06-17 13:48:46",
                      "score": 2,
                      "num_children": 0,
                      "author": 378423,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iclqlyo",
              "text": "Even as a little kid Christianity seemed ridiculous to me, but the fear of going to hell for all eternity scared me into going along with it because it just wasn't worth the risk of being wrong to little kid me. If they can't fool you into believing their bs then they'll try to scare or intimidate you into falling in line. \n\nIt's a literal cult with tax exemption and always has been.",
              "timestamp": "2022-06-16 17:10:48",
              "score": 20,
              "num_children": 2,
              "author": 189879,
              "replies": [
                {
                  "id": "icltm4n",
                  "text": "One of the big arguments people make when trying to persuade me is \"If I'm wrong, so what? But IF YOU'RE WRONG...\" Either positive or negative reinforcement alone is a strong tool for manipulating people and this shit uses both for all eternity.  Eternal bliss or whatever heaven is supposed to be, or eternal torture in hell. Even though the Bible only ever mentions torment.",
                  "timestamp": "2022-06-16 17:31:04",
                  "score": 7,
                  "num_children": 1,
                  "author": 4803,
                  "replies": [
                    {
                      "id": "icmyqna",
                      "text": "If god is truly benevolent he will see my character and forgive me for not believing.  If he is so malevolent that my moral behavior is ignored entirely and I’m damned to hell for simply not believing, then he is not a god worth worshipping.\n\nGive them that line and watch them try and wiggle their way out of that one.",
                      "timestamp": "2022-06-16 22:26:31",
                      "score": 9,
                      "num_children": 0,
                      "author": 237413,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "icmqdxl",
                  "text": "it is how mormons convert old people, by sticking their foot in their door when they try to close  it and telling them they will burn forever",
                  "timestamp": "2022-06-16 21:25:35",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "icma7d2",
              "text": "I firmly believe that the most religious people know that deep inside they are trash and are hoping that if they go through the motions, maybe they can transform themselves. \n\nEverytime I hear a religious person mention \"sin\", I want 🤮.",
              "timestamp": "2022-06-16 19:24:48",
              "score": 4,
              "num_children": 0,
              "author": 295230,
              "replies": []
            },
            {
              "id": "icmp6ts",
              "text": "It is insincere. They'll open a door open for an old lady because they feel they have to and will look to the sky \"Did you see that deed God? put another tick next to my name to secure my place!\" while as when we do good deeds, we know we aren't gonna get rewarded, we do it to be considerate humans. We know we are damned to eternal nothingness and we know the whole world is just based on a cosmic randomness and there's no one looking out for us.   \n\n\nWe do good deeds because we know everyone is in the same boat in this pointless existence, and try to make our short time in this pointless existence as pleasant as possible for ourselves and others, because we know it is short and meaningless. So when I open a door for an old lady, I do it to be kind. Christians will only do it because they feel they have to, and probably are angry that they have to act like a good person just to get their reward.",
              "timestamp": "2022-06-16 21:17:03",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "icph84x",
                  "text": "Not all Christian’s are like that and not all atheists are good.  People need to start to understand that it’s not the organization job etc that makes a person do what they do.   There are definitions for a cult had I been raised Mormon I Probably would refer to everything as a cult as well but it’s not so.  I was raised by mostly atheists and it was a living nightmare and I also have very shitty atheist friends and work colleagues but I do not believe that all atheists are x etc.  ultimately like Christ says most people maybe even all of us “they know not what they do”. It’s all about the heart and if you believe in Christ you would believe that only god knows your heart and should believe that no matter what atheist or not or Christian you will be judged according to your heart.  Only doing things to get into heaven - good luck with that I wonder how many only participate or do things because of that but there are people Christian and atheists that just care and want to be the best version of themselves and want to see good things happen and it just makes them happy to see others happy and succeeding.",
                  "timestamp": "2022-06-17 13:32:23",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "icmqhf8",
              "text": "It's the mentally of a child. \"If you're good you'll get a cookie but if you're bad you'll get a spanking!\"",
              "timestamp": "2022-06-16 21:26:17",
              "score": 1,
              "num_children": 1,
              "author": 339561,
              "replies": [
                {
                  "id": "icnasqj",
                  "text": "It's text book brainwashing.",
                  "timestamp": "2022-06-17 00:02:03",
                  "score": 1,
                  "num_children": 0,
                  "author": 4803,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "icl7xyt",
          "text": "Response to that is \"you need to be *told* what morals are?\"",
          "timestamp": "2022-06-16 15:00:33",
          "score": 26,
          "num_children": 1,
          "author": 300703,
          "replies": [
            {
              "id": "icmqo59",
              "text": "which is why Anton LaVey wrote \"dont' touch little kids\" in his Satanic sins list. Becuase Chrsitians DIDN'T include that. And that's scary, considering Christians only don't do what they aren't told and aren't capable of figuring out what is wrong on their own. He put it in there to troll them that they didn't include it. It isn't even a real sin, it is common sense and merely put there to laugh at their lack of it. He should have also put \"Don't stick your finger in a toaster and don't hit yourself with a hammer\"",
              "timestamp": "2022-06-16 21:27:37",
              "score": 3,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "iclotnf",
          "text": ">The question I get asked by religious people all the time is, without God, what’s to stop me from raping all I want? And my answer is: I do rape all I want. And the amount I want is zero. And I do murder all I want, and the amount I want is zero. The fact that these people think that if they didn’t have this person watching over them that they would go on killing, raping rampages is the most self-damning thing I can imagine.\n\n-Penn Jillette\n\nhttps://theinterrobang.com/penn-jillette-morality-without-religion/",
          "timestamp": "2022-06-16 16:58:35",
          "score": 11,
          "num_children": 1,
          "author": 229203,
          "replies": [
            {
              "id": "icphvl8",
              "text": "Yeah get that from folks who think we can’t live without government.  Ultimately without government etc you would be more focused on survival and their would be real consequences.  You try to rape someone they could come eliminate the threat or you could get hurt and there would be no hospital or there would be no society to take care of you.",
              "timestamp": "2022-06-17 13:37:36",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "icl5u77",
          "text": "Correct. That's what a coworker once asked me when she learned I was an atheist. ⚛️ Hahahaha! I burst into laughter.  😂😂😂",
          "timestamp": "2022-06-16 14:45:26",
          "score": 7,
          "num_children": 0,
          "author": 122201,
          "replies": []
        },
        {
          "id": "ickvpc4",
          "text": "He's a Mormon, he probably has rarely read the Bible. They are all into the Book of Mormon.",
          "timestamp": "2022-06-16 13:27:58",
          "score": 36,
          "num_children": 7,
          "author": 58336,
          "replies": [
            {
              "id": "icl3rwe",
              "text": "He didn't get a skin of blackness so Mormon god must approve of this.",
              "timestamp": "2022-06-16 14:30:24",
              "score": 23,
              "num_children": 0,
              "author": 373122,
              "replies": []
            },
            {
              "id": "iclbicp",
              "text": "Which is the laziest, obviously bullshit fan fiction of the Bible I’ve ever seen. \n\nNot that it all isn’t fake but at least the OG Bible *tried* to sound convincing and official.  Book of Mormon sounds like something a bad liar would make up on the spot to try to fuck your underage daughters.",
              "timestamp": "2022-06-16 15:26:03",
              "score": 17,
              "num_children": 1,
              "author": 306472,
              "replies": [
                {
                  "id": "iclehr0",
                  "text": "[deleted]",
                  "timestamp": "2022-06-16 15:47:09",
                  "score": 12,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "iclhx0i",
                      "text": "Funny enough, the Book of Mormon doesn't talk about polygamy except in one verse where it actually teaches against it. Joseph Smith didn't start the polygamy thing until several years later when god conveniently told him to start fucking teenagers. Go figure..",
                      "timestamp": "2022-06-16 16:11:14",
                      "score": 13,
                      "num_children": 0,
                      "author": 29569,
                      "replies": []
                    },
                    {
                      "id": "iclue9l",
                      "text": "I'm ex momo and it's shocking how much disinformation there is about Mormons. Joe Smith is shitty and is on record for fucking a 14 year old, but the Book of Mormon doesn't say anything about any of this shit.",
                      "timestamp": "2022-06-16 17:36:19",
                      "score": 4,
                      "num_children": 1,
                      "author": 315552,
                      "replies": [
                        {
                          "id": "iclw3zn",
                          "text": "[deleted]",
                          "timestamp": "2022-06-16 17:48:06",
                          "score": 3,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "iclxwvr",
                              "text": "This was kinda a response to all the comments. Joke noted though and I'm okay with that. It was a pretty misinformed joke though about Mormons and Islam.",
                              "timestamp": "2022-06-16 18:00:23",
                              "score": 1,
                              "num_children": 0,
                              "author": 315552,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "icl1ejr",
              "text": "I was a Mormon, read the bible cover to cover. Maybe that's partly why I'm an atheist now.. But yeah they do tend to focus a lot more on the B of M.",
              "timestamp": "2022-06-16 14:12:44",
              "score": 28,
              "num_children": 4,
              "author": 29569,
              "replies": [
                {
                  "id": "icl6yh4",
                  "text": "> read the bible cover to cover. Maybe that's partly why I'm an atheist now\n\nThis is a very common response from people who have actually read the entire bible.",
                  "timestamp": "2022-06-16 14:53:29",
                  "score": 32,
                  "num_children": 1,
                  "author": 269983,
                  "replies": [
                    {
                      "id": "icl7me2",
                      "text": "Yeah they don't really tell you about all the slavery, rape, and genocide in there.",
                      "timestamp": "2022-06-16 14:58:15",
                      "score": 19,
                      "num_children": 2,
                      "author": 29569,
                      "replies": [
                        {
                          "id": "iclaube",
                          "text": "They also don't tell people how many times it has been rewritten, by who, and why. In a talk, called \"The Fragility of God\", given by a Biblical scholar from England, he made the point that the most common versions read as though written by an entitled man, not an omnipotent God. Most religious people never even look at something like the Greek Seputuigent to realize that even basic translations of specific words have been changed. Then again, you have to be a special kind of ignorant to just blindly follow something without understanding it's history.",
                          "timestamp": "2022-06-16 15:21:20",
                          "score": 18,
                          "num_children": 1,
                          "author": 269983,
                          "replies": [
                            {
                              "id": "iclbcqw",
                              "text": "Yeah, thinking in general is a bad idea if you want to maintain your belief.",
                              "timestamp": "2022-06-16 15:24:56",
                              "score": 13,
                              "num_children": 1,
                              "author": 29569,
                              "replies": [
                                {
                                  "id": "iclbvxw",
                                  "text": "Well you put that much more succinctly than I did with my paragraph! \nThat would be good on a t-shirt :-)",
                                  "timestamp": "2022-06-16 15:28:42",
                                  "score": 6,
                                  "num_children": 0,
                                  "author": 269983,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "iclk3o6",
                          "text": "You can find that stuff at this helpful website.  https://www.evilbible.com/",
                          "timestamp": "2022-06-16 16:26:10",
                          "score": 5,
                          "num_children": 2,
                          "author": 115265,
                          "replies": [
                            {
                              "id": "icllefi",
                              "text": "Oh yeah, I've spent some time there. Good site.",
                              "timestamp": "2022-06-16 16:35:03",
                              "score": 1,
                              "num_children": 0,
                              "author": 29569,
                              "replies": []
                            },
                            {
                              "id": "iclual0",
                              "text": "Thank you so much for this link.",
                              "timestamp": "2022-06-16 17:35:37",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "icmosez",
                                  "text": "You're welcome.",
                                  "timestamp": "2022-06-16 21:14:09",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 115265,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "icl7xdx",
                  "text": "Maybe you can explain to me why we don't see black Mormons? Have you watched \"Keep Sweet. Pray and Obey\"? It's a documentary on Netflix. It's about the FLDS. It describes the lives and actions of Phrophets Roulon, and son Warren Jeff. I actually found it fascinating. I could not imagine such a level of indoctrination. And I know about indoctrination. I was born in a Communist country. But the FLDS simply blew my mind. Curiously,  I also did not see one single BLACK person, nor a HISPANICS, or ASIAN. They all seemed CAUCASIAN to me. Am I wrong? What's going on with these people? 🤷🏿‍♂️",
                  "timestamp": "2022-06-16 15:00:27",
                  "score": 15,
                  "num_children": 5,
                  "author": 122201,
                  "replies": [
                    {
                      "id": "iclhj8d",
                      "text": "The answer is [pretty fucked up.](https://en.m.wikipedia.org/wiki/Black_people_and_Mormonism)\n\nI also find it vastly amusing that the numbers are listed as \"a million PoC *around the world,*\" with the vast majority being in Africa. \n\nI.e. people with little access to education, and almost no access to information.",
                      "timestamp": "2022-06-16 16:08:34",
                      "score": 10,
                      "num_children": 0,
                      "author": 61137,
                      "replies": []
                    },
                    {
                      "id": "iclhkjc",
                      "text": "Mormonism is fundamentally racist af. Black folks couldn’t get the “priesthood” until 1978. Without the priesthood you couldn’t get married in the temple and if you don’t get married in the temple you can’t get to the highest degree of heaven. And that was the mainstream church. FLDS follow leaders like Brigham Young. Brigham Young the second leader of the church said that if a white man mixes his seed with a black woman the penalty would be death on the spot. So much more the mainstream lds are not being truthful about in their history. Black folks were fence riders in the war in heaven, some leader said they could make it to the highest level but that they would be “servants” there. Now they are trying to act like none of that happened.",
                      "timestamp": "2022-06-16 16:08:49",
                      "score": 11,
                      "num_children": 3,
                      "author": 43979,
                      "replies": [
                        {
                          "id": "iclkowy",
                          "text": "It was more than just the priesthood. The Mormon church focuses on that so you don't see the other parts. They couldn't even be \"sealed\" as a family. Which basically means only white families were allowed to stay together in heaven.",
                          "timestamp": "2022-06-16 16:30:12",
                          "score": 5,
                          "num_children": 1,
                          "author": 336101,
                          "replies": [
                            {
                              "id": "icloc4w",
                              "text": "Yep. Exaltation ban",
                              "timestamp": "2022-06-16 16:55:20",
                              "score": 3,
                              "num_children": 0,
                              "author": 43979,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "if7t955",
                          "text": "I'm sorry to come back so late to your reply. I wanted to thank you for that explanatation. I appreciate it. Bye.",
                          "timestamp": "2022-07-07 15:19:46",
                          "score": 2,
                          "num_children": 0,
                          "author": 122201,
                          "replies": []
                        },
                        {
                          "id": "if7tmum",
                          "text": "I am not religious, I was not born or raised in America and much of this is actually unknown to me. I discovered FLDS on NETFLIX entirely by chance. Never had heard about it before. I appreciate your explanation.",
                          "timestamp": "2022-07-07 15:22:16",
                          "score": 2,
                          "num_children": 0,
                          "author": 122201,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iclkm96",
                      "text": "Other branches of the LDS church do have black members.  Politician Mia Love is one.  I don't know why she would want to be part of a church that thinks dark skin is a curse from God.",
                      "timestamp": "2022-06-16 16:29:41",
                      "score": 5,
                      "num_children": 2,
                      "author": 115265,
                      "replies": [
                        {
                          "id": "icmlh3u",
                          "text": "I mean, there are LGBTQ Catholics, and according to that religion they are abominations. So, think about it: why might someone follow a religion that, to all appearances, supports hate of that person? I'm guessing the most common reason is they were raised in it and are employing mental gymnastics to avoid the obvious issues, but it could also be a firm of self-hate.",
                          "timestamp": "2022-06-16 20:50:30",
                          "score": 3,
                          "num_children": 2,
                          "author": 183809,
                          "replies": [
                            {
                              "id": "icpieep",
                              "text": "Bottom line and where this comes from In Catholicism it’s pretty equal surprising since it’s been around so long actually all sex is considered a sin even between a married woman and man that is not for the purpose of creating a child.  \n\nThat is a much longer discussion though.",
                              "timestamp": "2022-06-17 13:41:37",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            },
                            {
                              "id": "igxjija",
                              "text": ">I mean, there are LGBTQ Catholics, and according to that religion they are abominations. \n\nI'm sorry for coming back to your comment so late. I have been extremely busy all this time. Yes, I've heard of GAY Catholics, and GAY Republicans and I still can't comprehend this issue. Can you imagine a Black KKK? To me all three things are like the same: INCOMPREHENSIBLE. It may be as you say: cultural enviroment, and also lack of self-esteem. And in my opinion that is something RELIGION is truly good at. Deprive people of their self-esteem. The constant message is: \"Put yourself in the hands of the Almighty and you will be alright\".  Just yesterday I saw this documentary series: \"They call me Magic\". It's about the life of NBA Great Earvin \"Magic\" Johnson. As you surely know he got infected with the HIV virus back in the late 80's. He entered a very agressive medical treatment for the disease under a state-of the-art medical team. The team was led by world re-nowned HIV/AIDS researcher Dr. David Ho, and by Dr. Fauci. But you will never hear either name being uttered by \"Cookie\" Johnson, Earvin's wife. She only praised God, but never not once she thanked the doctors. Later in the film \"Magic\" does thank the doctors. But his wife never did. How can you even  understand something like that? \"Magic\" Johnson is still alive because of two things, and two things only: 1. SCIENCE  2. MONEY. I promise you GOD had never anything to do with it.",
                              "timestamp": "2022-07-20 15:57:40",
                              "score": 1,
                              "num_children": 1,
                              "author": 122201,
                              "replies": [
                                {
                                  "id": "igzeuj3",
                                  "text": "No worries. Yeah, religion is the direct antithesis of logic, reason, and science. No argument from me on that. I find that directly leads to the kind of ignorance and gracelessness shown by Cookie in your example.",
                                  "timestamp": "2022-07-20 23:49:35",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 183809,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "igxgl0u",
                          "text": "I'm sorry for coming back to your comment so late. I have been extremely busy all this time. I did not know this woman you mention. I was in Utah one time for 2 days (a business trip) and I could not see one single black person. I guess I was staying in the wrong neighboord. In fact, I always tell everyone there are no black persons in Utah. I was staying in Salt Lake City. But, I also remember driving by a car dealership that read MALONE CARS DEALERSHIP in big letters. And I remember Karl Malone from the Dream Team, and for playing for the Utah Jazz. Still, I do not recall seeing one single black person in Salt Lake City. Honestly, I do not even understand why Black Americans are so committed to Christianity, either.  Christianity, and the Bible were the ideological foundations to justify the enslavement and forced shipment of millions of blacks to the Americas. I feel immensily frustrated watching Black Americans' total devotion to a white God that has never done absolutely anything good for them. But, what can you do, right? Thank you for your comment.",
                          "timestamp": "2022-07-20 15:39:14",
                          "score": 1,
                          "num_children": 0,
                          "author": 122201,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "icl8v36",
                      "text": "I'm no expert but they are a bunch of white loons who ran off to live by their own stricter rules. That doesn't seem very inclusive to me.",
                      "timestamp": "2022-06-16 15:07:14",
                      "score": 2,
                      "num_children": 0,
                      "author": 303974,
                      "replies": []
                    },
                    {
                      "id": "iclqs7i",
                      "text": "There are a lot of good reasons that other people have provided that explain why in most of America, the black mormon population is quite low. But also be aware that they do exist and in certain parts of the world congregations are filled with black members.",
                      "timestamp": "2022-06-16 17:11:59",
                      "score": 2,
                      "num_children": 1,
                      "author": 315273,
                      "replies": [
                        {
                          "id": "icu8uoe",
                          "text": "That's new to me. I was not aware there were black Mormons. Much less Mormonism existed outside the US. Thank you. 👍🏿",
                          "timestamp": "2022-06-18 15:16:48",
                          "score": 1,
                          "num_children": 0,
                          "author": 122201,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "icl8619",
                  "text": "Hi five fellow FOMO",
                  "timestamp": "2022-06-16 15:02:11",
                  "score": 5,
                  "num_children": 1,
                  "author": 343053,
                  "replies": [
                    {
                      "id": "iclb4x9",
                      "text": "Wooo!",
                      "timestamp": "2022-06-16 15:23:24",
                      "score": 3,
                      "num_children": 0,
                      "author": 29569,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "icnfs5r",
                  "text": "Man, I sat down one day determined to read the Bible cover to cover and just ....couldn't do it. The insanity is *insane*",
                  "timestamp": "2022-06-17 00:44:21",
                  "score": 2,
                  "num_children": 0,
                  "author": 52213,
                  "replies": []
                }
              ]
            },
            {
              "id": "iclct59",
              "text": "Mormons study both. \n\nSource: am exmormon",
              "timestamp": "2022-06-16 15:35:17",
              "score": 4,
              "num_children": 1,
              "author": 13505,
              "replies": [
                {
                  "id": "icli7wy",
                  "text": "I concur",
                  "timestamp": "2022-06-16 16:13:19",
                  "score": 1,
                  "num_children": 0,
                  "author": 29569,
                  "replies": []
                }
              ]
            },
            {
              "id": "iclkd4p",
              "text": "Mormons read the Bible a lot. But are very selective like most other Christian religions.",
              "timestamp": "2022-06-16 16:27:57",
              "score": 2,
              "num_children": 0,
              "author": 336101,
              "replies": []
            },
            {
              "id": "iclqkzs",
              "text": "Most Mormons know the bible better than most Christians I've met, they are hardcore about reading scriptures, they just have more of them than other religions",
              "timestamp": "2022-06-16 17:10:36",
              "score": 2,
              "num_children": 0,
              "author": 315273,
              "replies": []
            },
            {
              "id": "icmqti6",
              "text": "mormon = hitler youth of the christianity party",
              "timestamp": "2022-06-16 21:28:41",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "icl78fb",
          "text": "This is exactly how biblical morality works, the problem is no one reads the bible.....",
          "timestamp": "2022-06-16 14:55:29",
          "score": 5,
          "num_children": 2,
          "author": 378462,
          "replies": [
            {
              "id": "icmrbm8",
              "text": "since christians still sin, even after reading the bible, or just refuse to read the bible at all, then all the messages to the stories should be simplified and just become a Do and Do Not list, much like their sin table. Them trying to focus on  a bible story and understand the message to it, is like trying to make a Gen Z person sit through a Twilight Zone episode, and understand the twist ending.",
              "timestamp": "2022-06-16 21:32:21",
              "score": 3,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "icldxkw",
              "text": "Sure is, I was being tongue-in-cheek about it lol.",
              "timestamp": "2022-06-16 15:43:12",
              "score": 2,
              "num_children": 0,
              "author": 129879,
              "replies": []
            }
          ]
        },
        {
          "id": "iclemp4",
          "text": "> And they have the gall to ask atheists \"where we get our morals\" from.\n\nI have had extensive conversations with all manner of religious people who crowd under the umbrella of christianity. Basically, they believe that morality is a gift from god and that secular morality does not exist. It all comes from god. It's a very frustrating, closed loop, argument.",
          "timestamp": "2022-06-16 15:48:08",
          "score": 3,
          "num_children": 0,
          "author": 299262,
          "replies": []
        },
        {
          "id": "icmgbhd",
          "text": "They'll just No True Scotsmen the shit out of the story. Or there's a massive and growing segment that will just lie to your face and denounce the bad actor, say they're taking action, or any number of things that will make the listener think, \"Oh good. I won that one and they're coming around.\" Then they go and do the opposite, never once troubled by ethics because it's all in service to \"their side\".",
          "timestamp": "2022-06-16 20:13:48",
          "score": 3,
          "num_children": 0,
          "author": 297254,
          "replies": []
        },
        {
          "id": "iclj3mm",
          "text": "That’s god damn right. Wait….",
          "timestamp": "2022-06-16 16:19:20",
          "score": 1,
          "num_children": 0,
          "author": 364509,
          "replies": []
        },
        {
          "id": "iclw620",
          "text": "That phrase alway irked me. It’s as if these people would just run wild without the Bible stopping them and they can’t fathom not having said rules governing their lives. It’s batshit crazy if you ask me.",
          "timestamp": "2022-06-16 17:48:29",
          "score": 1,
          "num_children": 0,
          "author": 393797,
          "replies": []
        },
        {
          "id": "iclylda",
          "text": "They skipped a step though.\n\nLogically for them, why be moral? They have a get out of hell free card.",
          "timestamp": "2022-06-16 18:05:03",
          "score": 1,
          "num_children": 0,
          "author": 223206,
          "replies": []
        },
        {
          "id": "icm246h",
          "text": "Sin more, so that gods mercy may increase.",
          "timestamp": "2022-06-16 18:29:22",
          "score": 1,
          "num_children": 0,
          "author": 399161,
          "replies": []
        },
        {
          "id": "icm2xmv",
          "text": "I’ve never understood why some religious people think that people need to follow a religion to be good, as if humanity can’t just have a conscience on its own.",
          "timestamp": "2022-06-16 18:34:56",
          "score": 1,
          "num_children": 1,
          "author": 265879,
          "replies": [
            {
              "id": "icmrkya",
              "text": "it is to give power to the cult. Give your son an Xbox for Christmas, for uh.. jesus's birth.. I guess? not because he's been good, not because you want to give him a gif and you love him, but to celebrate the birth of some dude in a desert a long time ago. Makes sense to me!",
              "timestamp": "2022-06-16 21:34:11",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "icm9vtm",
          "text": "When I got to the incest part, I was done. \n\nNot fond of the 1,000 virgins part either. \n\nWTH?",
          "timestamp": "2022-06-16 19:22:34",
          "score": 1,
          "num_children": 0,
          "author": 295230,
          "replies": []
        },
        {
          "id": "icmo5f2",
          "text": "anything worth agreeing with in the bible is written out int he old testiments. stoning cheating girlfriend's to death, yes please!",
          "timestamp": "2022-06-16 21:09:34",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "icn27y0",
          "text": "Do you think this is what morality is in the bible or do you think the bible would go against his actions?",
          "timestamp": "2022-06-16 22:52:46",
          "score": 1,
          "num_children": 1,
          "author": 4817,
          "replies": [
            {
              "id": "icnnqgi",
              "text": "One of the guiding principles of the Spanish Inquisition was that the inquisitors would rather be tortured or killed rather than living without the joy of knowing Christ's perfect love. So they did to others what they would want done to them. \n\nIf this creep wanted to be raped by clergy at a sleepover, then his actions were in line with biblical morality.\n\nThe morality if the Bible isn't perfect. It barely qualifies as good.",
              "timestamp": "2022-06-17 01:48:54",
              "score": 2,
              "num_children": 1,
              "author": 318636,
              "replies": [
                {
                  "id": "ico1ypb",
                  "text": "\n\n> So they did to others what they would want done to them\n\nThey wanted to be tortured? So they tortured others? \n\n> If this creep wanted to be raped by clergy at a sleepover, then his actions were in line with biblical morality.\n\nDo you think that God would be okay if you yourself wanted to be raped? And then using that to justify raping others? The bible clearly states that you shouldn't harm yourself. \n\nIf you play any games I'd be happy to hop on sometime and talk to you about any of this. It seems you have a fundamental misunderstanding about what the bible is and who God is.",
                  "timestamp": "2022-06-17 03:41:26",
                  "score": 1,
                  "num_children": 1,
                  "author": 4817,
                  "replies": [
                    {
                      "id": "icogdvm",
                      "text": ">They wanted to be tortured? So they tortured others?\n\nYes. That's what I said. They *would rather be tortured or executed* than to not be Christians, so they applied that same policy to the Jews. \n\n>Do you think that God would be okay if you yourself wanted to be raped?\n\nHave you read the Old Testament? God apparently considered rape a misdemeanor.\n\n>The bible clearly states that you shouldn't harm yourself.\n\nThen explain circumcision. \n\n>If you play any games I'd be happy to hop on sometime and talk to you\n\nEew, no. Why the hell would I want that? It's bad enough you fools come into the subreddit for atheists thinking you know what you're talking about. \n\n>It seems you have a fundamental misunderstanding about what the bible is and who God is.\n\nNo. I read the Bible, applied critical thought and reasoned analysis to it, and found that it's really very poorly written. Most atheists didn't get to be atheists by not studying religion enough. It's typically rather the opposite.",
                      "timestamp": "2022-06-17 06:09:09",
                      "score": 2,
                      "num_children": 1,
                      "author": 318636,
                      "replies": [
                        {
                          "id": "icp9mg1",
                          "text": "This is such bad faith and it's obvious that you haven't critically read and thought about the bible because everything you're saying is wrong. Do you think there's no difference between wanting to be raped and getting circumcised? \n\nYou are on a different planet of hate right now lol again I'll extend the option to actually talk, otherwise you can continue to screaming to the echo chamber it seems you locked yourself in",
                          "timestamp": "2022-06-17 12:26:41",
                          "score": 1,
                          "num_children": 1,
                          "author": 4817,
                          "replies": [
                            {
                              "id": "icqdki8",
                              "text": "Oh fuck off. Look, if you don't want to talk in this subreddit, you have no business commenting here. Don't call me hateful because I don't want to play games with you.",
                              "timestamp": "2022-06-17 16:43:02",
                              "score": 2,
                              "num_children": 0,
                              "author": 318636,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "icn8hfy",
          "text": "Makes you wonder what kind of God they \"believe\" in when they aren't even the tiniest bit afraid of that God for covering up child molestation.",
          "timestamp": "2022-06-16 23:42:47",
          "score": 1,
          "num_children": 0,
          "author": 236111,
          "replies": []
        },
        {
          "id": "icnps0l",
          "text": "My response to where do you get your morality from if not the Bible?\n\nSo you're in favor of rape, slavery, and abortions,  right? Or did you develop a different morality aside from the Bible?",
          "timestamp": "2022-06-17 02:04:37",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iechck2",
          "text": "100% right!",
          "timestamp": "2022-06-30 17:55:38",
          "score": 1,
          "num_children": 0,
          "author": 122201,
          "replies": []
        }
      ]
    },
    {
      "id": "ickj07j",
      "text": "How many kids are going to be abused by “religious leaders” before something real happens to stop it?",
      "timestamp": "2022-06-16 11:27:48",
      "score": 254,
      "num_children": 7,
      "author": 154748,
      "replies": [
        {
          "id": "ickxukk",
          "text": "never.... read up about residential schools...",
          "timestamp": "2022-06-16 13:45:08",
          "score": 82,
          "num_children": 3,
          "author": 24320,
          "replies": [
            {
              "id": "icl7253",
              "text": "Hell, they even had the RCMP round up kids to send to the clergy so they could do whatever they wanted with them, no questions allowed to be asked.\n\nPurposefully malnourished? Check. Beaten for speaking their mother tongue? Check. Raped? Check. Left to infect others and die during a tuberculosis epidemic in the school? Check. Throwing their bodies in unmarked mass graves? Check. Digging up said bodies to rebury them deeper to thwart cadaver dogs? Double-check.",
              "timestamp": "2022-06-16 14:54:14",
              "score": 44,
              "num_children": 1,
              "author": 57026,
              "replies": [
                {
                  "id": "iclzv9k",
                  "text": "Fun fact: The [Mormon Church had their version of it too](https://en.wikipedia.org/wiki/Indian_Placement_Program).",
                  "timestamp": "2022-06-16 18:13:51",
                  "score": 15,
                  "num_children": 2,
                  "author": 407452,
                  "replies": [
                    {
                      "id": "icmgf0d",
                      "text": "TIL....that there's another reason to be wary of the Mormons, besides the ludicrous origin story, the polygamy, the official racist beliefs, and the massacre of white settlers to justify conflict with Native tribes by framing them for the  murders committed by the Mormons.\n\nAppalling, but interesting, information, thanks!",
                      "timestamp": "2022-06-16 20:14:32",
                      "score": 9,
                      "num_children": 0,
                      "author": 57026,
                      "replies": []
                    },
                    {
                      "id": "icm681x",
                      "text": "if you have the time/interest have a boo at 'last podcast on the left' morman series. my wife is an ex morman and she said she was balling her eyes out listening to it.",
                      "timestamp": "2022-06-16 18:57:26",
                      "score": 3,
                      "num_children": 0,
                      "author": 24320,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iclv12r",
              "text": "Attended one in Mormon capital, went in to get therapy help, left with raging ptsd and ten times more issues. Year before I went a therapist raped a child, swept under the rug with all the other assaults, rapes, abuse, etc. Keep talking about them, for us. We can’t make our reports matter  unless the public backs us up and applies the pressure. Love yall",
              "timestamp": "2022-06-16 17:40:40",
              "score": 8,
              "num_children": 1,
              "author": 302044,
              "replies": [
                {
                  "id": "icm6e5x",
                  "text": "my wife and i always bring it up, we should never forget what we have done to people",
                  "timestamp": "2022-06-16 18:58:35",
                  "score": 2,
                  "num_children": 1,
                  "author": 24320,
                  "replies": [
                    {
                      "id": "icm6w8u",
                      "text": "I guess I forget how long of a history they have. I attended one just a few short years ago, and still up and running. It’s always haunting to wonder what child sleeps in the bed I did. Look around at the troubled teen industry if your curious to see how those stark history “lessons” were never truly learned.\n\nThat’s why it’s so important. Thank you for this comment actually, today has been really disheartening as I am realizing I have run out or places to make my reports. Maybe not today, or tomorrow, but one day someone will be forced to hold accountability.",
                      "timestamp": "2022-06-16 19:02:00",
                      "score": 1,
                      "num_children": 1,
                      "author": 302044,
                      "replies": [
                        {
                          "id": "icm7a4z",
                          "text": "are you sending me down a dark rabbit hole? anything you would recommend?",
                          "timestamp": "2022-06-16 19:04:38",
                          "score": 2,
                          "num_children": 1,
                          "author": 24320,
                          "replies": [
                            {
                              "id": "icm90ju",
                              "text": "Oh man, the stories I could personally tell you. \nIf you look into RTCs (residential treatment centers) particularly for minors (hint: involuntary). Utah is the capital of them, and so that definitely has a religious impact for better or worse. \n\nYou can also look into transporters (I was unfortunately a victim of this as well!) they are adults hired to take children to these treatment centers, but require no certification, background checks, etc. So in the USA, you need more rigorous certification for running a food stand than to take children across state lines with no contacts. I was handcuffed and told the police would arrest me if I tried to ask for help. \n\nParents often are either totally naive or totally abusive, and they count on this to keep funds incoming. Lying to parents (or ignoring extreme child abuse from parents), no phones besides when listening to by staff, letters not sent if not deemed acceptable by staff leaves children with literally no devices or places to even file complaints. They will literally hang up the phone if they don’t like what you are saying. When parents do visit, everything is cleaned, food is put out, and everything swept under rug. \n\nChild abuse is the norm, even the best of the best have hundreds of incidents of sexual assault, abuse, emotional abuse, racism, sexism, gaslighting (like actual, honest to god, family ruining gas lighting), over meditation (hint:sedation), negligence, and more from staff to student and student to student. I experienced or witnessed every single one of those things in my time. And of course when you tell anyone this, the response tends to be “but that’s illegal! Make a report! Call the police!”\n\nThe police made sure to keep us there, and I’m sure they knew. You can try to make reports to the department of human services. But then you have to get your records. Takes months of course, and thrown out after seven years (hint: they don’t want you to have any evidence of what they do). You take those all in, and won’t get replies for months. Send dozens of emails, get no replies. Try dozens of people, no replies. Reach out for interviews, anything, no replies or no one cares. It’s hard, so so hard. \n\nObviously there are hundreds of details and stories and specifics I could share, if you ever want to chat just pm me. But now that I am an adult I am still realizing the extent of how wrong it all was. It’s even harder when the government itself calls about a mental health crisis, but wont take any reports or care. (As for the shooters we always see, I can tell you that one of my centers had a shrine for parkland and “attractive” school shooters. Staff did not give a single fuck, it stayed up the entire time I was there. Nicholas Cruz would’ve been worshipped in my treatment center. But sure, it’s a mental health crisis that you care so much about) \n\nSorry for the rambling, but it really means a lot to have someone even show interest.\n\nEdit: also I didn’t attend these but look into wilderness camps. So many friends I had were completely broken. Children taken out to the dessert with no outside world contact for months. Forced to be watched shower, girls nearly killing each other, abuse, starvation.\n\nCheck out r/troubledteens to get a general idea",
                              "timestamp": "2022-06-16 19:16:35",
                              "score": 1,
                              "num_children": 1,
                              "author": 302044,
                              "replies": [
                                {
                                  "id": "icmac9f",
                                  "text": "how did you get out? if you dont mind me asking",
                                  "timestamp": "2022-06-16 19:25:46",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 24320,
                                  "replies": [
                                    {
                                      "id": "icmcm37",
                                      "text": "Not at all. Sharing is so so important. I actually went thru several programs. First, a lockdown facility in a small town area. Obviously was a special kind of hell. Spent only a week there as they are short term. Later I spent two months in a short term live in facility in Connecticut. That one just felt very culty and ill. Later I was transported to the one in Utah, where I spent half a year. I most likely would have stayed a year or two more if I didn’t do what I did. \n\nAnd what I did, was lie. I pretended to give in, follow the program. They liked it at first, until my parents thought I would be well enough to come home. Then they said I was “faking it now” because I was “progressing too fast”. I sure was, but far too late for them to backtrack. I’m very lucky I was pulled. I had already made the decision that I would commit suicide if I wasn’t. \n\nWhen I got home I hid it all, pretended I had “healed” because I was so fearful of going back. I hid knives all over my room in case I would be transported, but never really slept. Nightmares, flashbacks, lost 50 pounds, gained it, lost 60, constant brain fog, repressed memories, you name it. I drank a lot, more than before I left. My grades fell from 4.2 gpa to barely passing. I really only graduated high school because they felt bad for me, but I still damn graduated. \n\nI waited a few years until I was no longer a minor (again, involuntary treatment and no bodily autonomy is scary) and started opening up to my parents. It’s hard, and our relationship suffered immensely, but now that we are seeing how much we were both truly lied to (it helps keep up the chaos and confusion), we can at least understand. \n\nAll in all, I’m really messed up. Some days what keeps me going is spite. But, I don’t drink anymore, at all. I haven’t in over a year. I am learning to eat normally, I’m back in school to work with kids struggling with mental health. I still put in the useless reports, because then I have documentation for when people will listen. I’m in therapy, and I’m trying harder than I ever have in my entire life.  \n\nThey took most of my childhood, my innocence, my will, and so many pieces I can never get back. However, they gave me a motivation like no other that is so strong some days it can give me goosebumps. Who is sleeping where I did? Who is hungry like I was? Who is scared and sad and lost like I was? Who are they screwing over for hundreds of thousands of dollars? It sucks for me that my biggest passion in life comes from my biggest traumas, but it’s even worse news for them. \n\nSo really, thank you for listening. All I’ve ever wanted is enough people to listen. The past few years, especially after Britney Spears and Paris Hilton, people have actually started to ask questions. And each time I get a boost because I remember just how wrong it really was, and how hard they tried to convince me it wasn’t.",
                                      "timestamp": "2022-06-16 19:41:43",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 302044,
                                      "replies": [
                                        {
                                          "id": "icmdowc",
                                          "text": "well my wife is an ex mormon so i find all of this very interesting, and i want to hear the stories and be an ear to listen. thank you for sharing your story. if you dont mind im going to let my wife read through your comments, she would very much love to hear it being brought up in the mormon cult.",
                                          "timestamp": "2022-06-16 19:49:14",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 24320,
                                          "replies": [
                                            {
                                              "id": "icnlojj",
                                              "text": "That would be great, yes please share. I hope your wife knows she’s not at fault, a lot of these things and organizations rely on leaving self doubt, a what if? That makes it so much harder to truly recognize it as abuse from an inside perspective. If either of you ever want to send me a message I would be glad to share more or whatever you’d like!",
                                              "timestamp": "2022-06-17 01:33:26",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 302044,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "iclky3i",
              "text": "Here in AZ the state gives huge subsidies to religious schools.\n\nLast year it was $135M.",
              "timestamp": "2022-06-16 16:31:57",
              "score": 4,
              "num_children": 1,
              "author": 336101,
              "replies": [
                {
                  "id": "icm6ryz",
                  "text": "so much for the separation of state and church huh",
                  "timestamp": "2022-06-16 19:01:10",
                  "score": 1,
                  "num_children": 0,
                  "author": 24320,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "icl479y",
          "text": "As many kids as parents willing to hand them over to \"religious leaders\".",
          "timestamp": "2022-06-16 14:33:32",
          "score": 12,
          "num_children": 0,
          "author": 4065,
          "replies": []
        },
        {
          "id": "icleg2k",
          "text": "The fact that it's been happening since religion was invented should tell you something.",
          "timestamp": "2022-06-16 15:46:49",
          "score": 8,
          "num_children": 0,
          "author": 248641,
          "replies": []
        },
        {
          "id": "icm4p4u",
          "text": "Maybe when they’re no longer in the majority. It’s coming.",
          "timestamp": "2022-06-16 18:47:03",
          "score": 2,
          "num_children": 1,
          "author": 222012,
          "replies": [
            {
              "id": "icm90u1",
              "text": "I love how Christianity is in a free fall.",
              "timestamp": "2022-06-16 19:16:38",
              "score": 3,
              "num_children": 0,
              "author": 154748,
              "replies": []
            }
          ]
        },
        {
          "id": "icmijx2",
          "text": "They don’t seem to care too much about the safety of their kids after they plop out into this world 🤷‍♂️",
          "timestamp": "2022-06-16 20:29:59",
          "score": 2,
          "num_children": 0,
          "author": 161479,
          "replies": []
        },
        {
          "id": "icm680t",
          "text": "Tale as old as time.",
          "timestamp": "2022-06-16 18:57:25",
          "score": 1,
          "num_children": 0,
          "author": 350320,
          "replies": []
        },
        {
          "id": "icnb5qj",
          "text": "Religious folks have way more important things to worry about like abortion, gay marriage and fealty to Donald Trump. It's really insensitive of you to expect them to also care about their kids.",
          "timestamp": "2022-06-17 00:05:02",
          "score": 1,
          "num_children": 0,
          "author": 373404,
          "replies": []
        }
      ]
    },
    {
      "id": "icksuop",
      "text": "[deleted]",
      "timestamp": "2022-06-16 13:04:11",
      "score": 123,
      "num_children": 1,
      "replies": [
        {
          "id": "icn8c9l",
          "text": "[deleted]",
          "timestamp": "2022-06-16 23:41:35",
          "score": 7,
          "num_children": 1,
          "replies": [
            {
              "id": "icofn50",
              "text": "I remember reading last week that the overall in the population of in prison pedophiles that had same sex victims its around 8%, meanwhile, pedophiles that were some form of pastor or clergy in the church 36%. Now there is bound to be some overlap there, but its still 450% more likely that its someone from a church.",
              "timestamp": "2022-06-17 06:00:16",
              "score": 3,
              "num_children": 0,
              "author": 206738,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ickkioh",
      "text": "Cult members gotta cult",
      "timestamp": "2022-06-16 11:44:17",
      "score": 35,
      "num_children": 1,
      "replies": [
        {
          "id": "icmrtvh",
          "text": "to the cult leaders there is no children, only new recruitments. a normal family decide to have a child out of love, a cult has a child to recruit an easily brainwashed empty cell.",
          "timestamp": "2022-06-16 21:35:56",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ickpnl5",
      "text": "Church leaders don't hunt in bathrooms, they do it from the ~~commodity~~  comfort of their own office.",
      "timestamp": "2022-06-16 12:35:30",
      "score": 29,
      "num_children": 1,
      "author": 64067,
      "replies": [
        {
          "id": "ickv3m2",
          "text": "commodity?",
          "timestamp": "2022-06-16 13:23:02",
          "score": 6,
          "num_children": 2,
          "author": 254853,
          "replies": [
            {
              "id": "icl88v8",
              "text": "Probably autocorrected from \"comfort\".",
              "timestamp": "2022-06-16 15:02:46",
              "score": 3,
              "num_children": 1,
              "author": 162119,
              "replies": [
                {
                  "id": "iclilwr",
                  "text": "no, I miss translated my thoughts but yes, it was an attempt to say comfort.",
                  "timestamp": "2022-06-16 16:16:00",
                  "score": 4,
                  "num_children": 0,
                  "author": 64067,
                  "replies": []
                }
              ]
            },
            {
              "id": "iclywzj",
              "text": "In this regard yes, it’s a private place where people are trained to feel safe and comfortable. Yeah I can see how a predator would treat an office as a commodity.",
              "timestamp": "2022-06-16 18:07:16",
              "score": 2,
              "num_children": 0,
              "author": 378412,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ickv2mo",
      "text": "The right wing Evangelicals, the QAnons, and the white supremacists are all hysterically screaming about  LGBT+ groomers.  \n\nThose who yell loudest about grooming children are the real groomers. \n\nBTW: the revelation this week of the massive sexual abuse scandal in the Baptist Church this week detailed there were over 700 victims who were molested or raped, most were children and were as young as [3 years old]( https://www.newsweek.com/southern-baptist-sexual-abuse-rape-predators-scandal-church-christian-leaders-1325750)",
      "timestamp": "2022-06-16 13:22:48",
      "score": 22,
      "num_children": 1,
      "author": 7016,
      "replies": [
        {
          "id": "iclzwu0",
          "text": "Michelle Duggar recording a robo-call about the threat of trans women in bathrooms with young girls when the whole time her OWN DAUGHTERS were not even safe in their beds. You mean like that?",
          "timestamp": "2022-06-16 18:14:09",
          "score": 5,
          "num_children": 0,
          "author": 246053,
          "replies": []
        }
      ]
    },
    {
      "id": "icknd03",
      "text": "I have heard of a lot of children getting raped by religious officials. I have not heard of a single child getting hurt in any way by a trans person in a bathroom. I imagine if it happened, it would be screamed about by conservatives for weeks.",
      "timestamp": "2022-06-16 12:13:26",
      "score": 135,
      "num_children": 6,
      "author": 286151,
      "replies": [
        {
          "id": "ickuty1",
          "text": "Yes exactly. If it had even happened *once* you bet your ass we would have heard about it. Meanwhile I feel like 3x a week I hear about another pastor somewhere messing with kids.\n\nOn top of that, pastors make up a far smaller percentage of the population than LGBTQ people. So the percentage of pastors who molest kids has gotta be incredibly high comparatively.",
          "timestamp": "2022-06-16 13:20:50",
          "score": 53,
          "num_children": 0,
          "author": 238664,
          "replies": []
        },
        {
          "id": "ickxtwb",
          "text": "I’m a trans woman, and would happily stomp a pedos ass if I caught one messing with your kid in the bathroom.",
          "timestamp": "2022-06-16 13:44:59",
          "score": 35,
          "num_children": 0,
          "author": 106734,
          "replies": []
        },
        {
          "id": "icldqpx",
          "text": ">  imagine if it happened, it would be screamed about by conservatives for weeks.\n\nThey've been screaming about it for years already... It's all projection, if you want to know what a conservative is guilty of just listen to what they accuse others of.",
          "timestamp": "2022-06-16 15:41:52",
          "score": 11,
          "num_children": 0,
          "author": 333531,
          "replies": []
        },
        {
          "id": "icm9spq",
          "text": "[removed]",
          "timestamp": "2022-06-16 19:21:58",
          "score": 8,
          "num_children": 1,
          "replies": [
            {
              "id": "icmd0a1",
              "text": "Ok. One single instance. And not an adult hurting a child. Compared to how many religious officials?",
              "timestamp": "2022-06-16 19:44:27",
              "score": 0,
              "num_children": 1,
              "author": 286151,
              "replies": [
                {
                  "id": "icmi6t1",
                  "text": "[removed]",
                  "timestamp": "2022-06-16 20:27:23",
                  "score": -3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "icmjkpb",
                      "text": "So I take it you think someone who looks like [this](https://media.vanityfair.com/photos/5f08af09d9b8498dfbe5554d/2:3/w_656,h_984,c_limit/Valentina-Sampaio.jpg) should use the men's restroom and she won't at all be at risk by doing so, right?\n\nMeanwhile, [this](https://bloximages.chicago2.vip.townnews.com/phillytrib.com/content/tncms/assets/v3/editorial/b/c0/bc0f95b5-7f42-568f-bb34-1a4167d25eb3/5d8e4c7e404b7.image.jpg?crop=402%2C366%2C457%2C217) person should be forced to use the women's restroom, correct? And that will make the women there feel safe?",
                      "timestamp": "2022-06-16 20:37:09",
                      "score": 4,
                      "num_children": 0,
                      "author": 286151,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ickzz96",
          "text": "Not saying the numbers aren't HEAVILY outweighed by religious people but after a quick google search..\n\n\nhttps://ktla.com/news/local-news/adult-who-at-17-sexually-assaulted-child-is-sentenced-to-juvenile-facility-in-l-a-county/amp/\n\nAlso not all religious people are bad. Just like everything else",
          "timestamp": "2022-06-16 14:01:44",
          "score": 5,
          "num_children": 1,
          "author": 72986,
          "replies": [
            {
              "id": "icle7i2",
              "text": "The problem isn't that all religious people are bad.\n\nThe problem is that religious people will always protect and conceal those who are bad within their own ranks.  There is a pervasive belief that the law of man is insufficient to punish the wrongdoer, and that it's best to handle things internally.  Especially if there's a possibility that they can be redeemed without involving outsiders.\n\nEven worse, those who refuse to cover and protect the bad ones are persecuted.",
              "timestamp": "2022-06-16 15:45:09",
              "score": 15,
              "num_children": 1,
              "author": 61137,
              "replies": [
                {
                  "id": "iclk00t",
                  "text": "ACAB but for religion",
                  "timestamp": "2022-06-16 16:25:27",
                  "score": 7,
                  "num_children": 1,
                  "author": 277899,
                  "replies": [
                    {
                      "id": "iclpbwp",
                      "text": "All Clergy Are Bastards?",
                      "timestamp": "2022-06-16 17:02:00",
                      "score": 12,
                      "num_children": 1,
                      "author": 91014,
                      "replies": [
                        {
                          "id": "iclql0n",
                          "text": "Very clever I love it",
                          "timestamp": "2022-06-16 17:10:37",
                          "score": 4,
                          "num_children": 0,
                          "author": 277899,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "icl84ey",
          "text": "[removed]",
          "timestamp": "2022-06-16 15:01:52",
          "score": 0,
          "num_children": 1,
          "replies": [
            {
              "id": "icl8aj0",
              "text": "Oh, well that definitely means there's a big problem with trans people raping children in bathrooms. I mean it's not like there's anywhere else in the entire world where they might sexually assault a child.",
              "timestamp": "2022-06-16 15:03:06",
              "score": 2,
              "num_children": 1,
              "author": 286151,
              "replies": [
                {
                  "id": "icl8ja3",
                  "text": "[removed]",
                  "timestamp": "2022-06-16 15:04:53",
                  "score": -2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "icl8rh4",
                      "text": "Yet you felt it was necessary to tell us that information when we were specifically talking about bathrooms. No one said it is impossible for a trans person to sexually assault a child. The whole point is that trans people are being blocked from using restrooms of their chosen gender because people are claiming they will commit rapes.",
                      "timestamp": "2022-06-16 15:06:30",
                      "score": 8,
                      "num_children": 2,
                      "author": 286151,
                      "replies": [
                        {
                          "id": "iclbasy",
                          "text": "I like how you narrow it down for trans folk, but anything anywhere from any religious person is fair game.\n\n\"It's been proven that trans people harass and assault far more people at drag shows than religious people do\".\n\nSee how dumb you sound?",
                          "timestamp": "2022-06-16 15:24:33",
                          "score": -3,
                          "num_children": 1,
                          "author": 249707,
                          "replies": [
                            {
                              "id": "iclbgu4",
                              "text": "Did you not even read the headline of the post you're commenting in? This is specifically about trans people in bathrooms.",
                              "timestamp": "2022-06-16 15:25:44",
                              "score": 3,
                              "num_children": 1,
                              "author": 286151,
                              "replies": [
                                {
                                  "id": "iclbxz9",
                                  "text": "And I'm making fun of how god damn stupid you and the op are for having a very strict set of circumstances that you'll compare.\n\nSexual assault is a problem no matter where it happens or who does it. But you seem to like it if it's a trans person, and only allow arguments if you narrow it down to trans people in bathrooms.",
                                  "timestamp": "2022-06-16 15:29:06",
                                  "score": -2,
                                  "num_children": 1,
                                  "author": 249707,
                                  "replies": [
                                    {
                                      "id": "iclc1up",
                                      "text": "Yes, sexual assault *is* a problem. You know what *isn't* a problem? Trans people in bathrooms. So maybe Christians should stop trying to bar them.",
                                      "timestamp": "2022-06-16 15:29:52",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 286151,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "icl9cnu",
                          "text": "[removed]",
                          "timestamp": "2022-06-16 15:10:45",
                          "score": -4,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "icl9gmw",
                              "text": "Do you *really* think being trans means you're more likely to rape a child? *Really?*",
                              "timestamp": "2022-06-16 15:11:32",
                              "score": 3,
                              "num_children": 1,
                              "author": 286151,
                              "replies": [
                                {
                                  "id": "icl9tv9",
                                  "text": "[removed]",
                                  "timestamp": "2022-06-16 15:14:11",
                                  "score": -2,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "icla0fi",
                                      "text": "Weird that absolutely no one, not even the most virulent anti-trans activists, are claiming that pedophiles use being trans as a way to assault children as proven by British prison statistics where a small handful of trans people are in prison for sexually assaulting a child.\n\nI find that odd, don't you?",
                                      "timestamp": "2022-06-16 15:15:29",
                                      "score": 3,
                                      "num_children": 1,
                                      "author": 286151,
                                      "replies": [
                                        {
                                          "id": "icla604",
                                          "text": "[removed]",
                                          "timestamp": "2022-06-16 15:16:35",
                                          "score": 1,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "iclb7ya",
                                              "text": "They say that children are at risk of being raped by trans people in bathrooms because seven transwomen sexually assaulted children *somewhere?*\n\nThat's as irrational as you can get.",
                                              "timestamp": "2022-06-16 15:24:00",
                                              "score": 5,
                                              "num_children": 1,
                                              "author": 286151,
                                              "replies": [
                                                {
                                                  "id": "iclbkpa",
                                                  "text": "[removed]",
                                                  "timestamp": "2022-06-16 15:26:30",
                                                  "score": 0,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "iclbt99",
                                                      "text": "Again, that's not rational. Seven people in prison does not say anything about the likelihood because of the tiny sample size and, again, it doesn't say *where* these children were sexually assaulted, so barring transwomen form women's bathrooms doesn't make sense.\n\nInteresting, by the way, that you are only concerned about transwomen and not transmen.",
                                                      "timestamp": "2022-06-16 15:28:11",
                                                      "score": 4,
                                                      "num_children": 1,
                                                      "author": 286151,
                                                      "replies": [
                                                        {
                                                          "id": "iclcd2t",
                                                          "text": "[removed]",
                                                          "timestamp": "2022-06-16 15:32:06",
                                                          "score": -1,
                                                          "num_children": 1,
                                                          "replies": [
                                                            {
                                                              "id": "icld2gu",
                                                              "text": "Seven transwomen sexually assaulted children. Seven. That is not an accurate sample size. You are being as irrational as they are.",
                                                              "timestamp": "2022-06-16 15:37:08",
                                                              "score": 5,
                                                              "num_children": 0,
                                                              "author": 286151,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "icktc74",
      "text": "I don't invite kids to sleepovers but maybe I'm just built different",
      "timestamp": "2022-06-16 13:08:22",
      "score": 13,
      "num_children": 1,
      "author": 55006,
      "replies": [
        {
          "id": "icoa2od",
          "text": "That's not even normal for his position in the church. It should have raised red flags earlier.",
          "timestamp": "2022-06-17 04:58:31",
          "score": 2,
          "num_children": 1,
          "author": 195160,
          "replies": [
            {
              "id": "id3aec5",
              "text": "Unfortunately that may be *why* he got his position in the church. “Oh, Brother Sund is so good with kids, he’s a natural at planning fun activities, he’d make a great Primary teacher!” \n\nAbusers know how to get themselves into the positions they want. You can’t really volunteer for a calling in the LDS church, but you can make yourself look like a good candidate. Things that look like obvious red flags in an article like this, can be made to seem charming and benign when it’s your neighbor down the street.",
              "timestamp": "2022-06-20 18:56:25",
              "score": 2,
              "num_children": 0,
              "author": 51143,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ickqh58",
      "text": "Priests maintain heirarchy. Breaking away from gender norms subverts that patriarchy. An affront to authority is against the natural order if you believe authority should come from God. It's some real mental acrobatics.",
      "timestamp": "2022-06-16 12:43:02",
      "score": 10,
      "num_children": 0,
      "author": 346709,
      "replies": []
    },
    {
      "id": "iclbya3",
      "text": "This cult kept my father from going to jail after years and years of sexual assault on 7 of his 10 children. \n\nFuck  all religions and their followers. A blight on this planet.",
      "timestamp": "2022-06-16 15:29:09",
      "score": 8,
      "num_children": 0,
      "author": 354241,
      "replies": []
    },
    {
      "id": "ickjb69",
      "text": "I wish someone would come up with the stats for this and post it on billboards all over.  Sex crimes:  church = 3507  LGBTQ = 0.  Maybe the numbers could be digital so they could increase the count as more are reported.",
      "timestamp": "2022-06-16 11:31:12",
      "score": 70,
      "num_children": 3,
      "author": 295200,
      "replies": [
        {
          "id": "icl5xxb",
          "text": "Not to be that guy, but I bet there are more than zero from the LGBTQ+ group. Just saying",
          "timestamp": "2022-06-16 14:46:11",
          "score": 53,
          "num_children": 2,
          "author": 115279,
          "replies": [
            {
              "id": "icl8yxl",
              "text": "Had this thought, too. I 100% agree the number would be low enough to be statistically insignificant, but the religious folk will claim it’s all things LGBTQ that is causing the problem AND blame them for influencing the religious leaders to do bad things in the first place.",
              "timestamp": "2022-06-16 15:08:02",
              "score": 14,
              "num_children": 2,
              "author": 189808,
              "replies": [
                {
                  "id": "iclv41i",
                  "text": "Just like how the gays force God to wipe out cities with hurricanes.",
                  "timestamp": "2022-06-16 17:41:14",
                  "score": 3,
                  "num_children": 0,
                  "author": 361264,
                  "replies": []
                },
                {
                  "id": "icm0qg1",
                  "text": "Probably not a good idea to start down this rabbit hole. Since LGBTQ are such a small part of the population, any incidences would way very heavy in a per capita comparison.",
                  "timestamp": "2022-06-16 18:19:53",
                  "score": 5,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "icopp8a",
                      "text": "Pretty sure there are more lgbt people than priests, though.",
                      "timestamp": "2022-06-17 08:14:35",
                      "score": 2,
                      "num_children": 0,
                      "author": 401180,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iclbs55",
              "text": "I’m sure it’s not zero I was just throwing out imaginary numbers to make a point.  I’m pretty sure the number for church is much higher as well.",
              "timestamp": "2022-06-16 15:27:58",
              "score": 4,
              "num_children": 0,
              "author": 295200,
              "replies": []
            }
          ]
        },
        {
          "id": "ickymmj",
          "text": "Can I have another one committed by other religious bodies too? Christianity is not mainstream where I live, but it's not rare to hear muslim preachers sexually abusing their students/followers/staff yet treated to same way priests are: too holy to be guilty.",
          "timestamp": "2022-06-16 13:51:14",
          "score": 13,
          "num_children": 3,
          "author": 231210,
          "replies": [
            {
              "id": "ickzz77",
              "text": "I'm not that sure about sexual abuse but physical abuse, DEFINITELY. Especially Islamic teachers, so many of them resolve to hitting minors cause they can't pronounce certain words or memorize things in a language they do not know. 🤦🏻‍♀️ it's so common and normalized in my country it's awful, parents don't even mind it cause it's for God anyway.",
              "timestamp": "2022-06-16 14:01:43",
              "score": 8,
              "num_children": 0,
              "author": 177602,
              "replies": []
            },
            {
              "id": "iclakb1",
              "text": "I think it needs to be focused on Christianity in the US otherwise the right would just use Islam to scapegoat the issue.",
              "timestamp": "2022-06-16 15:19:26",
              "score": 2,
              "num_children": 1,
              "replies": [
                {
                  "id": "iclriv0",
                  "text": "Maybe just a recap of the past year by religion? Would likely show Christians with the highest numbers but still keep the focus on religious pedophilia as a whole.",
                  "timestamp": "2022-06-16 17:17:05",
                  "score": 1,
                  "num_children": 0,
                  "author": 281991,
                  "replies": []
                }
              ]
            },
            {
              "id": "icmdsvh",
              "text": "I looked at your profile to see where you are (had turkey in mind for some reason), but that lotus bread and…hummus?…looks amazing. I want it :)",
              "timestamp": "2022-06-16 19:50:01",
              "score": 2,
              "num_children": 0,
              "author": 222012,
              "replies": []
            }
          ]
        },
        {
          "id": "icl8kph",
          "text": "[removed]",
          "timestamp": "2022-06-16 15:05:10",
          "score": -3,
          "num_children": 1,
          "replies": [
            {
              "id": "iclc09u",
              "text": "How many straight men and women does it show are in for sex offenses?  The point is really that u shouldn’t just say one particular sexual orientation is somehow more dangerous than another.",
              "timestamp": "2022-06-16 15:29:33",
              "score": 2,
              "num_children": 0,
              "author": 295200,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ickof0d",
      "text": "I mean you'd probably find a huge chunk willing to ban the Mormon church.",
      "timestamp": "2022-06-16 12:23:35",
      "score": 19,
      "num_children": 1,
      "author": 346229,
      "replies": [
        {
          "id": "ickolj9",
          "text": "As a former member, I would ban it in a heartbeat.",
          "timestamp": "2022-06-16 12:25:20",
          "score": 26,
          "num_children": 4,
          "author": 138802,
          "replies": [
            {
              "id": "ickpcvw",
              "text": "When you manage to escape a cult you tend to have clarity about these things.",
              "timestamp": "2022-06-16 12:32:43",
              "score": 16,
              "num_children": 1,
              "author": 346229,
              "replies": [
                {
                  "id": "ickq1q4",
                  "text": "It's like putting glasses on for the first time. You really don't know how blind you are until that moment.",
                  "timestamp": "2022-06-16 12:39:11",
                  "score": 14,
                  "num_children": 2,
                  "author": 138802,
                  "replies": [
                    {
                      "id": "iclhi2k",
                      "text": "ExJW here, perfect way to put it, I'm going to use that one",
                      "timestamp": "2022-06-16 16:08:20",
                      "score": 6,
                      "num_children": 0,
                      "author": 96590,
                      "replies": []
                    },
                    {
                      "id": "icl1l0a",
                      "text": "Well said, from a glasses-wearing fellow exmo",
                      "timestamp": "2022-06-16 14:14:07",
                      "score": 6,
                      "num_children": 1,
                      "author": 277105,
                      "replies": [
                        {
                          "id": "icm8bxv",
                          "text": "We're everywhere!",
                          "timestamp": "2022-06-16 19:11:53",
                          "score": 3,
                          "num_children": 1,
                          "author": 109558,
                          "replies": [
                            {
                              "id": "ico222u",
                              "text": "Just not on chapel on Sunday mornings... Thankfully!",
                              "timestamp": "2022-06-17 03:42:14",
                              "score": 2,
                              "num_children": 0,
                              "author": 257130,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ickpwt6",
              "text": "One of my close friends is still trapped. And I'm like 80% sure she's a lesbian but in denial. It's so sad. We try to support her but can't say anything negative about LDS or she pulls back.\n\nHer sister left the faith and the way she talks about her as if she literally died. It's so fucking weird.",
              "timestamp": "2022-06-16 12:37:54",
              "score": 8,
              "num_children": 2,
              "author": 236654,
              "replies": [
                {
                  "id": "ickqhmx",
                  "text": "That sucks. I was the 4th child out of my family to leave. My brother and parents are still in it, but I think they've given up on trying to bring anyone back. It sucks that when you present all of the evidence (From LDS sources) on how they are wrong, they still chalk it up to \"God has a plan!\" I despise the church for how much they have lied to me and hurt my family.",
                  "timestamp": "2022-06-16 12:43:10",
                  "score": 7,
                  "num_children": 0,
                  "author": 138802,
                  "replies": []
                },
                {
                  "id": "icl1r59",
                  "text": "\n>Her sister left the faith and the way she talks about her as if she literally died. It's so fucking weird.\n\nThis is pretty standard stuff from insular communities, especially religious ones.  It's pretty easy to \"other\" everyone in the outgroup when you don't ever interact with the outgroup.  However, they know their members are much more likely to actually listen to a family member or friend who has left, so the solution is to require the group to shun anyone who leaves.",
                  "timestamp": "2022-06-16 14:15:26",
                  "score": 2,
                  "num_children": 0,
                  "author": 237884,
                  "replies": []
                }
              ]
            },
            {
              "id": "icllg3w",
              "text": "There are a lot of us here. LDS church fucks you up.",
              "timestamp": "2022-06-16 16:35:22",
              "score": 2,
              "num_children": 0,
              "author": 336101,
              "replies": []
            },
            {
              "id": "icmguv8",
              "text": "Having just binge watched Under the Banner of Heaven, I have been on a binge of reading about the fucked up nature of the LDS church and just, holy hell.",
              "timestamp": "2022-06-16 20:17:50",
              "score": 1,
              "num_children": 0,
              "author": 308681,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ickohfw",
      "text": "I was just thinking something along the lines of how many such stories I have come across and the statistics are alarming (Watched the netflix docu series 'Keep sweet pray and obey'  and it disturbed me to no end). \n\nThere are so many reported cases (and so many unreported)  and yet they get Scot free. While the Trans people are wrongly targeted despite having no proof.\n\nIt saddens me to no end at the injustice of it all.",
      "timestamp": "2022-06-16 12:24:14",
      "score": 5,
      "num_children": 0,
      "author": 271278,
      "replies": []
    },
    {
      "id": "icl3gf0",
      "text": "364 days!? Seems kind of light?",
      "timestamp": "2022-06-16 14:28:03",
      "score": 6,
      "num_children": 1,
      "author": 292112,
      "replies": [
        {
          "id": "icm5b1k",
          "text": "This is what I said and why is this at the bottom?",
          "timestamp": "2022-06-16 18:51:10",
          "score": 1,
          "num_children": 0,
          "author": 328723,
          "replies": []
        }
      ]
    },
    {
      "id": "icm7can",
      "text": "Dan Savage [said](https://twitter.com/fakedansavage/status/1140985337893646336?lang=en) it best:\n\n> If kids got raped by clowns as often as kids get raped by preachers, it would be against the law to take your kid to the circus.",
      "timestamp": "2022-06-16 19:05:03",
      "score": 7,
      "num_children": 0,
      "author": 118182,
      "replies": []
    },
    {
      "id": "icknw7o",
      "text": "it wasnt him it was Satan duuh",
      "timestamp": "2022-06-16 12:18:38",
      "score": 6,
      "num_children": 0,
      "author": 176673,
      "replies": []
    },
    {
      "id": "icl1rmo",
      "text": "He was a primary teacher, that means the kid was probably under 12 years old.",
      "timestamp": "2022-06-16 14:15:32",
      "score": 6,
      "num_children": 0,
      "author": 229424,
      "replies": []
    },
    {
      "id": "ickoqk3",
      "text": "Where are those Utahn patriot front idiots? I thought they were going after pedos and groomers? Oh right. They’re just hateful bigots.",
      "timestamp": "2022-06-16 12:26:42",
      "score": 13,
      "num_children": 0,
      "author": 397352,
      "replies": []
    },
    {
      "id": "icl313a",
      "text": "Kids are safer with a random prisonner than a random priest. Prison culture doesn’t tolerate child molesters. When the morality of your culture lags behind prison culture, you should ask yourself some serious questions.",
      "timestamp": "2022-06-16 14:24:54",
      "score": 12,
      "num_children": 1,
      "author": 140664,
      "replies": [
        {
          "id": "icldqr3",
          "text": "[deleted]",
          "timestamp": "2022-06-16 15:41:53",
          "score": -2,
          "num_children": 1,
          "replies": [
            {
              "id": "ico2a7m",
              "text": "Why? The comment you've replied to was too hyperbolic IMO, but what is wrong with the concept it developed?",
              "timestamp": "2022-06-17 03:44:09",
              "score": 1,
              "num_children": 0,
              "author": 257130,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "icli74r",
      "text": "Religion: 18+ to enter",
      "timestamp": "2022-06-16 16:13:11",
      "score": 4,
      "num_children": 0,
      "author": 380189,
      "replies": []
    },
    {
      "id": "ickv2ug",
      "text": "I hope that 100 years from now putting your child in a sex cult will be illegal.",
      "timestamp": "2022-06-16 13:22:51",
      "score": 9,
      "num_children": 1,
      "author": 400541,
      "replies": [
        {
          "id": "icl0hqy",
          "text": "I just hope the indoctrination (child abuse) is illegal regardless of belief or flavor of religion. You can teach *about* the religion(s) using critical thinking skills, like that *none* of them are actually correct; which prevents the indoctrination within families before kids have the skills to avoid it.",
          "timestamp": "2022-06-16 14:05:45",
          "score": 6,
          "num_children": 1,
          "author": 113468,
          "replies": [
            {
              "id": "iclvcyd",
              "text": "To clarify my earlier statement, all organized Western religion is a rape cult.",
              "timestamp": "2022-06-16 17:42:56",
              "score": 3,
              "num_children": 1,
              "author": 400541,
              "replies": [
                {
                  "id": "ico2ccl",
                  "text": "Why only western?",
                  "timestamp": "2022-06-17 03:44:39",
                  "score": 2,
                  "num_children": 1,
                  "author": 257130,
                  "replies": [
                    {
                      "id": "icp3xq6",
                      "text": "Eh, I don’t know Buddhism and Hinduism well enough…. Wouldn’t be shocked if they are, too",
                      "timestamp": "2022-06-17 11:28:46",
                      "score": 1,
                      "num_children": 0,
                      "author": 400541,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "icld8a2",
      "text": "They don't care about arresting these people because the vote republican. Let them vote Democrat or Independent and they're on a list for life. But being apart of the church makes them infallible.",
      "timestamp": "2022-06-16 15:38:16",
      "score": 3,
      "num_children": 0,
      "author": 357778,
      "replies": []
    },
    {
      "id": "iclf062",
      "text": "Posts like these are so stupid\n\nCan we stop comparing LGBTQ people to everything under the sun\n\n“See this thing that was documented and tracked for 10 years proves this sweeping statement!”",
      "timestamp": "2022-06-16 15:50:42",
      "score": 3,
      "num_children": 0,
      "author": 207994,
      "replies": []
    },
    {
      "id": "iclhtn1",
      "text": "I don't see correlations but okay",
      "timestamp": "2022-06-16 16:10:35",
      "score": 3,
      "num_children": 0,
      "author": 384090,
      "replies": []
    },
    {
      "id": "iclneea",
      "text": "In all fairness there are probably more priests in the world than there are transgender people.\n\nBut unlike priests, most transgender people are not put in positions of power, where their words are supposedly backed by divine beings.",
      "timestamp": "2022-06-16 16:48:52",
      "score": 3,
      "num_children": 0,
      "author": 16792,
      "replies": []
    },
    {
      "id": "icly779",
      "text": "I’ve never seen a Christian or Republican talk about or show outrage at any story about a religious leader diddling kids. And it happens every day. r/pastorarrested",
      "timestamp": "2022-06-16 18:02:20",
      "score": 3,
      "num_children": 0,
      "author": 101555,
      "replies": []
    },
    {
      "id": "icm9nxz",
      "text": "Every time they project, calling everyone they don't like a groomer, my response is preventing child sexual abuse starts at home and that extends to that pillar of the community, the pastor, and that youth leader/Sunday school teacher, they are so stupid as to leave their kid (s) with. 🤬\n\nEvery time some charlatan sets up a religious cult it is for the express purpose of molesting kids their dumb🐴 willingly have over their kids to.🤬",
      "timestamp": "2022-06-16 19:21:04",
      "score": 3,
      "num_children": 0,
      "author": 295230,
      "replies": []
    },
    {
      "id": "ickx6gq",
      "text": "It's so strange that people who lie for a living are also into abusing children.",
      "timestamp": "2022-06-16 13:39:52",
      "score": 5,
      "num_children": 0,
      "author": 77515,
      "replies": []
    },
    {
      "id": "ickq0mb",
      "text": "So are we done with the \"Protect the Children\" or is that just the slogan when my trans child wants to go pee and be on the swim team? Don't worry, y'all, I tell him just to pee in the pool instead...no one said trans kids couldn't pee there plus it's more efficient.",
      "timestamp": "2022-06-16 12:38:54",
      "score": 8,
      "num_children": 0,
      "author": 246557,
      "replies": []
    },
    {
      "id": "icl67y1",
      "text": "Can somebody explain to me why there are no black Mormons? I'm not religious. I don't know much about Mormons. Thanks.",
      "timestamp": "2022-06-16 14:48:13",
      "score": 7,
      "num_children": 5,
      "author": 122201,
      "replies": [
        {
          "id": "iclj2w5",
          "text": "Ex-Mormon here. It’s taught in the church that black people are cursed with dark skin due to the actions of their shared ancestor, Cain. Until the 1970s, black people were not allowed to receive the higher blessings/rites given by the church. Essentially, in the eyes of the church, the greatest degree of glory that a black person could reach was being a servant in the highest tier of heaven. \n\nSo, not too surprising why there are very few black members.",
          "timestamp": "2022-06-16 16:19:11",
          "score": 12,
          "num_children": 3,
          "author": 300487,
          "replies": [
            {
              "id": "iclmz4q",
              "text": "Not a Mormon, but I understood that if someone was not virtuous enough in the \"pre-existance\", they were condemned to be born black.  It was not just because they were descended from Cain. \n\nhttps://en.wikipedia.org/wiki/Black\\_people\\_and\\_Mormonism#Pre-existence",
              "timestamp": "2022-06-16 16:45:57",
              "score": 9,
              "num_children": 1,
              "author": 115265,
              "replies": [
                {
                  "id": "icmfbu0",
                  "text": "Edit: Just added /s for clarity\n\nYep! That's what we were always told. AND if you're born \"into the covenant\" then you are one of God's chosen to lead the world in the latter-days.\n\nNot a cult. /s",
                  "timestamp": "2022-06-16 20:05:19",
                  "score": 2,
                  "num_children": 1,
                  "author": 300487,
                  "replies": [
                    {
                      "id": "icmoq78",
                      "text": "Amazing how these \"latter days\" just keep dragging on...and on...",
                      "timestamp": "2022-06-16 21:13:43",
                      "score": 4,
                      "num_children": 0,
                      "author": 115265,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "igxbyfz",
              "text": "Sorry for coming back to your comment so late, about a month later. I have been extremely busy all this time. I appreciate your response. I always wondered why I did not see Black mormons. Now I know. Thank you.",
              "timestamp": "2022-07-20 15:09:40",
              "score": 2,
              "num_children": 0,
              "author": 122201,
              "replies": []
            },
            {
              "id": "icltkom",
              "text": "[deleted]",
              "timestamp": "2022-06-16 17:30:47",
              "score": -2,
              "num_children": 2,
              "replies": [
                {
                  "id": "icm0u68",
                  "text": "Lol. Found the mormon.",
                  "timestamp": "2022-06-16 18:20:34",
                  "score": 3,
                  "num_children": 1,
                  "author": 299021,
                  "replies": [
                    {
                      "id": "icmfgrc",
                      "text": "Aww I missed what they said",
                      "timestamp": "2022-06-16 20:06:44",
                      "score": 1,
                      "num_children": 1,
                      "author": 300487,
                      "replies": [
                        {
                          "id": "icmgi9q",
                          "text": "It was just the standard apologist stuff from someone who doesn't know their own history. \"The church disavows the theories... etc, etc.\" \n\n\nBut he outed himself by doing the whole long-winded name.",
                          "timestamp": "2022-06-16 20:15:14",
                          "score": 1,
                          "num_children": 1,
                          "author": 299021,
                          "replies": [
                            {
                              "id": "icmiv0k",
                              "text": "Lol - I know the type well... I used to be one of them unfortunately",
                              "timestamp": "2022-06-16 20:32:12",
                              "score": 1,
                              "num_children": 0,
                              "author": 300487,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "icmbspe",
                  "text": "It was really cool of God to change his mind like that.",
                  "timestamp": "2022-06-16 19:36:02",
                  "score": 2,
                  "num_children": 1,
                  "author": 165537,
                  "replies": [
                    {
                      "id": "icmf8m7",
                      "text": "SO cool. And definitely not an attempt by church leadership to appear more current with the times to keep young members.",
                      "timestamp": "2022-06-16 20:04:22",
                      "score": 1,
                      "num_children": 0,
                      "author": 300487,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iclbcdi",
          "text": "In the Age of Google and Duck Duck Go, that's a bit of a disingenuous question. \n\nThat said, the answer is [a level of fucknuttery that truly defies belief.](https://en.wikipedia.org/wiki/Black_people_and_Mormonism)",
          "timestamp": "2022-06-16 15:24:51",
          "score": 6,
          "num_children": 0,
          "author": 61137,
          "replies": []
        },
        {
          "id": "iclmbh6",
          "text": "There are some, but I don't know why they would want to be.  The Mormons think God punished Cain by turning him black, and punished evil Native Americans with dark skin.",
          "timestamp": "2022-06-16 16:41:24",
          "score": 3,
          "num_children": 1,
          "author": 115265,
          "replies": [
            {
              "id": "icuab4w",
              "text": "That is a very interesting topic I am still mesmerized about: blacks being Christian (any denomination). My own Mother, a direct descendant from African slaves was a devout Catholic. But, she learned to be religious from her own Mother. My mother was not very educated. She could barely write, and read. My GRANDMOTHER was illiterate. Back then slaves and children of slaves were banned from learning to read, and write. But, here in America I have found highly educated, middle or upper middle class blacks who are as devout Christians as my uneducated black Mother. And it gets even weirder. I learned Christianity as a whole (both Protestant and Catholic) is now the fastest growing religion in black Africa. It completely blows my mind! There must be very powerful economic, sociological,  and political reasons for that development. But I will have to educate myself in the issue before I get to a conclusion of any kind. Thanks.",
              "timestamp": "2022-06-18 15:28:41",
              "score": 1,
              "num_children": 0,
              "author": 122201,
              "replies": []
            }
          ]
        },
        {
          "id": "icmso20",
          "text": "Mormons like most religions have their problematic history with race.",
          "timestamp": "2022-06-16 21:41:56",
          "score": 1,
          "num_children": 1,
          "author": 125485,
          "replies": [
            {
              "id": "icmv9o5",
              "text": "Thank you. I suspected that, but I was not quite sure. 👍🏿",
              "timestamp": "2022-06-16 22:00:49",
              "score": 1,
              "num_children": 0,
              "author": 122201,
              "replies": []
            }
          ]
        },
        {
          "id": "ico2srf",
          "text": "There are many, specially in places outside the USA, but the church has a very troubled history with racism bring taught as part of it's doctrine very explicitly until a few decades ago.\n\nNowadays, a POC can have all the rights as a white person has there, but it's such a toxic environment that new people are bound to but stay there for long, specially if they look different from most of the congregation.",
          "timestamp": "2022-06-17 03:48:38",
          "score": 1,
          "num_children": 1,
          "author": 257130,
          "replies": [
            {
              "id": "idzax5q",
              "text": "I'm sorry. I do not know what a POC is. And I don't remember if I had asked you this same question before. If I have, please, pardon me. I frequently read \"POC\" on many comments, but I do not know what it means. English is not my first language. Spanish is. Thank you.",
              "timestamp": "2022-06-27 22:00:28",
              "score": 2,
              "num_children": 1,
              "author": 122201,
              "replies": [
                {
                  "id": "idzl6q2",
                  "text": "No problem! English is not my first language as well. I'm from Brazil.\n\nPOC means Person (or people) Of Color, mostly meaning people who are not predominantly caucasian (white), in other words, people who are black, asian, brown, etc...",
                  "timestamp": "2022-06-27 23:16:53",
                  "score": 1,
                  "num_children": 2,
                  "author": 257130,
                  "replies": [
                    {
                      "id": "ie31z2o",
                      "text": "WOW! I would've never guessed it. Obrigado! 👍🏿",
                      "timestamp": "2022-06-28 18:11:09",
                      "score": 2,
                      "num_children": 1,
                      "author": 122201,
                      "replies": [
                        {
                          "id": "ie4ax21",
                          "text": "De nada! \n\n¡Que tengas una buena semana!",
                          "timestamp": "2022-06-28 23:22:31",
                          "score": 1,
                          "num_children": 1,
                          "author": 257130,
                          "replies": [
                            {
                              "id": "ie4posh",
                              "text": "Igualmente. Gracias. Obrigado. 👍🏿",
                              "timestamp": "2022-06-29 01:19:57",
                              "score": 1,
                              "num_children": 0,
                              "author": 122201,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ie45g8k",
                      "text": "Just one more thing, if you don't mind.  \"POC' would not be derogatory,  correct? I'm never ashamed to say \"I don't know\". Better asking than guessing. That's my motto. And the reason being just recently someone told me the word \"MULATTO\" is not acceptable in American English.  You would rather use \"BROWN\". I did not know that. I also learned the meaning of the word \"MONGREL\" online when I asked, and someone pointed out the meaning to me on one of these posts saying: \"Your son is one\". I'm black, and my wife is white. Our son is of mixed race. I had never even heard that word before,  let alone how it was used. But, you have to grow out of your concerns of being offended in social media. It's remote, and it's anonymous,  so it is a very useful tool to be used as a form of abuse. Thankfully that's not always the case. But, I have been called all kinds of names right here on REDDIT. At first I would refrain to counter. Not anymore. But it's better to know and that's the reason I always ask first. Thank you. 👍🏿",
                      "timestamp": "2022-06-28 22:40:50",
                      "score": 2,
                      "num_children": 1,
                      "author": 122201,
                      "replies": [
                        {
                          "id": "ie4aqmo",
                          "text": "I don't mind at all!\n\nAs far as I know POC is used to try to be as inclusive as possible. Of course, there might be someone that gets offended, just as people can be offended to be called African-American instead of black, but as far as I know, it is a very inoffensive term, and that's by design. \n\nBy the way, I completely agree with you on being offended on the internet. Of course everybody has the right to be offended, but as you said so well, the anonymity and impersonality the internet provides makes it a very fertile ground for offending someone, be it on purpose or not.\n\nHave a great week my friend!",
                          "timestamp": "2022-06-28 23:21:09",
                          "score": 1,
                          "num_children": 1,
                          "author": 257130,
                          "replies": [
                            {
                              "id": "ie4pkdz",
                              "text": "Same to you. Thanks.",
                              "timestamp": "2022-06-29 01:18:58",
                              "score": 2,
                              "num_children": 0,
                              "author": 122201,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "icl3gfn",
      "text": "Sick pedos hiding behind a imaginary being",
      "timestamp": "2022-06-16 14:28:03",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "icl3o4y",
      "text": "After family members Religious Leadership are the most likely abusers of children.",
      "timestamp": "2022-06-16 14:29:38",
      "score": 2,
      "num_children": 0,
      "author": 151636,
      "replies": []
    },
    {
      "id": "icl81m8",
      "text": "AKA just another day in the world of religion. He screwed up because he got caught so LDS can't protect him anymore. He'll be shipped off to see Cardinal Law for counsel.",
      "timestamp": "2022-06-16 15:01:17",
      "score": 2,
      "num_children": 0,
      "author": 180482,
      "replies": []
    },
    {
      "id": "iclbhun",
      "text": "The \"groomer\" conspiracy theory is being spread to distract people from the fact that large-scale child sexual abuse is actually being perpetrated by religious clergy and the capitalist ruling class (such as the pedophile ring lead by Jeffrey Epstein).",
      "timestamp": "2022-06-16 15:25:56",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iclbiey",
      "text": "He hosted a sleep over??",
      "timestamp": "2022-06-16 15:26:03",
      "score": 2,
      "num_children": 0,
      "author": 42228,
      "replies": []
    },
    {
      "id": "iclf6ik",
      "text": "I'm right wing by my country's standards and I'd happily ban Christians as whole from the entire fucking landmass. Fucking nonces.",
      "timestamp": "2022-06-16 15:51:56",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iclgl22",
      "text": "The Baptists are still wringing their hands over the list some flunky found in a desk drawer somewhere",
      "timestamp": "2022-06-16 16:01:50",
      "score": 2,
      "num_children": 0,
      "author": 37213,
      "replies": []
    },
    {
      "id": "iclnftz",
      "text": "They'll call him brave and reformed.",
      "timestamp": "2022-06-16 16:49:08",
      "score": 2,
      "num_children": 0,
      "author": 101656,
      "replies": []
    },
    {
      "id": "iclnw9s",
      "text": "We have all these rules for school teachers (ever wondered why every classroom has windows that you can look into from the hallway?) but when it comes to Church parents suddenly turn into naive idiots.",
      "timestamp": "2022-06-16 16:52:18",
      "score": 2,
      "num_children": 0,
      "author": 378732,
      "replies": []
    },
    {
      "id": "iclpoe7",
      "text": "Children are in danger at every single church and religious home.",
      "timestamp": "2022-06-16 17:04:22",
      "score": 2,
      "num_children": 0,
      "author": 203961,
      "replies": []
    },
    {
      "id": "iclpq67",
      "text": "We need to remove their tax exempt status and their ability to issue securities to raise money. \n\nChurches are nothing but cesspools of corruption",
      "timestamp": "2022-06-16 17:04:42",
      "score": 2,
      "num_children": 1,
      "author": 385743,
      "replies": [
        {
          "id": "icm3ki0",
          "text": "Ability to issue securities to raise money ?   Thank you, now I'm gonna have to google and learn shit as this seems particularly interesting.  I appreciate it.  Education is incredible.",
          "timestamp": "2022-06-16 18:39:20",
          "score": 1,
          "num_children": 1,
          "author": 354252,
          "replies": [
            {
              "id": "icm3xx1",
              "text": "Yes churches can issues non sec registered bonds to raise money",
              "timestamp": "2022-06-16 18:41:49",
              "score": 2,
              "num_children": 1,
              "author": 385743,
              "replies": [
                {
                  "id": "icm5wdf",
                  "text": "I've been reading for a moment.... And thank you for the follow up..... Unsecured bond = debenture = no guarantee of repayment = \"full faith and credit\" bonds.      Wild.    I'll read more later; but you've set the hooks in.  Again; thank you!",
                  "timestamp": "2022-06-16 18:55:14",
                  "score": 1,
                  "num_children": 1,
                  "author": 354252,
                  "replies": [
                    {
                      "id": "icm7401",
                      "text": "Welcome. \n\nThere are a lot of finance and tax laws these mega churches exploit",
                      "timestamp": "2022-06-16 19:03:29",
                      "score": 2,
                      "num_children": 1,
                      "author": 385743,
                      "replies": [
                        {
                          "id": "icn4xj3",
                          "text": "Exploitation is always their way.   Thank you for a huge rabbit warren to get lost and amazed and confused in !!",
                          "timestamp": "2022-06-16 23:13:59",
                          "score": 2,
                          "num_children": 0,
                          "author": 354252,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iclvosi",
      "text": "It serves them to demonize someone else, so they can look the other way.",
      "timestamp": "2022-06-16 17:45:12",
      "score": 2,
      "num_children": 0,
      "author": 297085,
      "replies": []
    },
    {
      "id": "iclxyiv",
      "text": "If these people actually believed the tripe they peddled to the masses, would they jeopardize their eternal accommodations with such heinously vile acts? I think we have our answer.",
      "timestamp": "2022-06-16 18:00:41",
      "score": 2,
      "num_children": 0,
      "author": 293710,
      "replies": []
    },
    {
      "id": "icm14ym",
      "text": "Of course not, the religious sector is a major part of their base. Same with assault rifle advocates.",
      "timestamp": "2022-06-16 18:22:37",
      "score": 2,
      "num_children": 0,
      "author": 52631,
      "replies": []
    },
    {
      "id": "icm2pcd",
      "text": "I can’t understand why people are surprised that people who abuse children would be drawn to positions with authority over them, with little to no oversight from others. This is why it happens so often in religious organizations. If they would add oversight and reduce the authority individuals have over children it could work *wonders*.",
      "timestamp": "2022-06-16 18:33:22",
      "score": 2,
      "num_children": 0,
      "author": 272062,
      "replies": []
    },
    {
      "id": "icms9i0",
      "text": "That's disgusting. The girl was younger than 12. Thank the universe that her parents believed her and it was reported. Ick. \n\n\nObviously all sexual assault is bad but it gets ickier the younger the victim.",
      "timestamp": "2022-06-16 21:39:01",
      "score": 2,
      "num_children": 0,
      "author": 18471,
      "replies": []
    },
    {
      "id": "icl2yjs",
      "text": "Where my other ex-Mormons at? Fuck the cult! 100 billion dollar hedge fund and exploits Africans",
      "timestamp": "2022-06-16 14:24:23",
      "score": 2,
      "num_children": 1,
      "author": 277289,
      "replies": [
        {
          "id": "icnqdzb",
          "text": "Boom!",
          "timestamp": "2022-06-17 02:09:26",
          "score": 1,
          "num_children": 0,
          "author": 186012,
          "replies": []
        }
      ]
    },
    {
      "id": "icl34db",
      "text": "Yeah, right wingers fuck off",
      "timestamp": "2022-06-16 14:25:34",
      "score": 3,
      "num_children": 0,
      "author": 336833,
      "replies": []
    },
    {
      "id": "iclzdlz",
      "text": "Christians are never up to any good.",
      "timestamp": "2022-06-16 18:10:27",
      "score": 3,
      "num_children": 0,
      "author": 76199,
      "replies": []
    },
    {
      "id": "icnbudi",
      "text": "Jeezus..I’m not religious or a republican but so many of you commenting and the author are beyond fucking saving. Complete fucking morons you are.",
      "timestamp": "2022-06-17 00:10:45",
      "score": 3,
      "num_children": 0,
      "author": 277086,
      "replies": []
    },
    {
      "id": "iclhbxy",
      "text": "Trans people literally just want health care and affordable housing.",
      "timestamp": "2022-06-16 16:07:07",
      "score": 4,
      "num_children": 1,
      "author": 144591,
      "replies": [
        {
          "id": "iclm6ec",
          "text": "And to win women's scholarships",
          "timestamp": "2022-06-16 16:40:27",
          "score": -7,
          "num_children": 2,
          "author": 156729,
          "replies": [
            {
              "id": "iclp8vh",
              "text": "I mean, sure? We're women. What's your point?",
              "timestamp": "2022-06-16 17:01:26",
              "score": 0,
              "num_children": 1,
              "author": 144591,
              "replies": [
                {
                  "id": "iclrqbn",
                  "text": "Let me be more clear, \"cis women\" scholarships should be created to protect cis women's sports.",
                  "timestamp": "2022-06-16 17:18:29",
                  "score": -9,
                  "num_children": 1,
                  "author": 156729,
                  "replies": [
                    {
                      "id": "iclwl4l",
                      "text": "Protect cis women from what?",
                      "timestamp": "2022-06-16 17:51:20",
                      "score": 4,
                      "num_children": 1,
                      "author": 144591,
                      "replies": [
                        {
                          "id": "iclzgmo",
                          "text": "I didn't stutter, so acting obtuse about the current issues with transgender women in cis women's sports only makes you come across as a troll today",
                          "timestamp": "2022-06-16 18:11:02",
                          "score": -1,
                          "num_children": 4,
                          "author": 156729,
                          "replies": [
                            {
                              "id": "icm7t6s",
                              "text": "I want you to state your opinion. You haven’t yet.",
                              "timestamp": "2022-06-16 19:08:17",
                              "score": 4,
                              "num_children": 1,
                              "author": 144591,
                              "replies": [
                                {
                                  "id": "icojf4d",
                                  "text": "It's obvious what they think, the usual \"tran bad\" rhetoric thats incredibly common across the entire political spectrum. That user basically said trans women aren't women. Sadly, that's common. See trans people mentioned outside of an LGBT sub, you will see these types of comments consistently.",
                                  "timestamp": "2022-06-17 06:47:28",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 217046,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "icmcspf",
                              "text": "[deleted]",
                              "timestamp": "2022-06-16 19:42:59",
                              "score": 3,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "icmi8t5",
                                  "text": "Not to mention athletes with rich and/or stable families have a massive leg up. Or athletes who happen to live closer to practice or athletes who don’t have mental illnesses. Like there’s so many ways to cut the cake but trans women are THE problem apparently. And most of the time the grief is from people who aren’t involved in sport whatsoever.",
                                  "timestamp": "2022-06-16 20:27:46",
                                  "score": 4,
                                  "num_children": 1,
                                  "author": 144591,
                                  "replies": [
                                    {
                                      "id": "icmno5i",
                                      "text": "[deleted]",
                                      "timestamp": "2022-06-16 21:06:08",
                                      "score": 1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "icmokye",
                                          "text": "Preachin to the choir!",
                                          "timestamp": "2022-06-16 21:12:41",
                                          "score": 3,
                                          "num_children": 0,
                                          "author": 144591,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "icm6x36",
                              "text": "Says the troll.",
                              "timestamp": "2022-06-16 19:02:09",
                              "score": 2,
                              "num_children": 1,
                              "author": 260720,
                              "replies": [
                                {
                                  "id": "icn45pv",
                                  "text": "Oh, I'm the only cis female athlete who feels this way about male to female athletes walking away with scholarships and medals created for cis women? \n\n😂 🤣 😭\n\n[Sex Matters: Why Transgender Athletes Must Not Compete Against Biological Females](https://www.swimmingworldmagazine.com/news/sex-matters-why-transgender-athletes-must-not-compete-against-biological-females/)\n\n\n[Transgender women outpace cisgender women in athletic tests after 1 year on hormones](https://www.healio.com/news/endocrinology/20201216/transgender-women-outpace-cisgender-women-in-athletic-tests-after-1-year-on-hormones)",
                                  "timestamp": "2022-06-16 23:07:53",
                                  "score": 3,
                                  "num_children": 1,
                                  "author": 156729,
                                  "replies": [
                                    {
                                      "id": "icqochv",
                                      "text": ">male to female athletes walking away with scholarships and medals created for cis women? \n\nWhere/when did that happen? \n\nLoved that first article, they made a lot of good points. \n\nThe second one? Hell no. As an Air Force vet, I can tell you from experience that a good third to almost half of those PT Scores are complete bullshit. The testing is almost always self/partner counted and reported. And since in your own self interest to report a passing score, and because the passing benchmarks are complete bullshit anyway, you like because you want to keep your job. The only numbers I would trust at all would be the running scores. And even those are shite because the entire test is basically just numbers someone came up with, that have nothing to do with actual physical capabilities. \n\nI find it hilarious that actual researchers looked at the Air Force pt system and thought \"Yeah! That's a good source of data!!\"",
                                      "timestamp": "2022-06-17 18:01:31",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 186012,
                                      "replies": [
                                        {
                                          "id": "icqtqqu",
                                          "text": "\"With the emergence of male-to-female transgender athletes, the competitive concerns are obvious: The separation of the sexes is compromised and biological men could potentially deny women of opportunities they were denied at every level of sport for decades until the passage of Title IX in the ’70s — scholarships, roster spots, contracts, prize money, medals — if not put them at increased risk of injury in contact sports (see sidebar note in which MTF fighter Fallon Fox seriously injured her female opponent in the first two minutes of their bout).\"\n\nSerena Williams is considered by some as the greatest women’s tennis player ever. In 2013, she told TV talk show host David Letterman, “For me, men’s tennis and women’s tennis are completely, almost, two separate sports. If I were to play (British star) Andy Murray, I would lose 6-0, 6-0 in five to six minutes, maybe 10 minutes. No, it’s true. It’s a completely different sport. The men are a lot faster and they serve harder, they hit harder, it’s just a different game.”\n\n\nWhen males reach puberty, their bodies begin producing large amounts of testosterone, the original, natural, performance-enhancing drug. It gives them increased strength, endurance, power, size and muscle mass, with less fat and bigger and denser bones, which can support bigger muscles and internal organs. The advantages of such hormones are so great that some athletes take synthetic hormones — anabolic steroids — to increase those advantages over their own sex.\n\nTestosterone accounts for the difference between male and female athletic performance, and that difference is one of the very reasons women’s sports were created in the first place — to bring an even playing field. Other concessions have also been made for females — shorter tee boxes (golf), lower nets (volleyball) and hurdles (track), smaller implements (track and field) and smaller balls (basketball).\"\n\n\n[In search of a level playing field. How male-to-female transgender athletes are impacting women’s sports](http://\nhttps://www.deseret.com/2021/7/29/22584285/male-to-female-transgender-olympic-athletes-impact-womens-sports-president-biden-mike-lee-weigh-in?_amp=true)",
                                          "timestamp": "2022-06-17 18:40:44",
                                          "score": 1,
                                          "num_children": 2,
                                          "author": 156729,
                                          "replies": [
                                            {
                                              "id": "icr4g8d",
                                              "text": "Ok. None of that answers my question. So are you going to back up your claim or not?\n\nHave you ever even competed against a trans athlete?",
                                              "timestamp": "2022-06-17 19:59:39",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 186012,
                                              "replies": [
                                                {
                                                  "id": "icrnblm",
                                                  "text": "[Transgender athletes should have their own teams, leagues](https://readthereporter.com/briggs-transgender-athletes-should-have-their-own-teams-leagues/)\n\n\n\"In 2011, the University of California, Los Angeles law school’s Williams Institute conducted research on sexual orientation and gender identity and reported there were approximately 700,000 Americans identifying as transgender. More than likely the numbers of transgenders have grown.\n\nWith these facts in mind, it is only fair for the transgender athletes of both genders to create their own teams and leagues.\"",
                                                  "timestamp": "2022-06-17 22:24:00",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 156729,
                                                  "replies": [
                                                    {
                                                      "id": "ics0nv3",
                                                      "text": ">Oh, I'm the only cis female athlete who feels this way about male to female athletes walking away with scholarships and medals created for cis women? \n\nLet's try this again. Either back this up with evidence, or stop spreading lies.",
                                                      "timestamp": "2022-06-18 00:15:31",
                                                      "score": 2,
                                                      "num_children": 1,
                                                      "author": 186012,
                                                      "replies": [
                                                        {
                                                          "id": "icutzzs",
                                                          "text": "😂 someone doesn't like the TRUTH!",
                                                          "timestamp": "2022-06-18 18:04:37",
                                                          "score": 1,
                                                          "num_children": 2,
                                                          "author": 156729,
                                                          "replies": [
                                                            {
                                                              "id": "icv2al9",
                                                              "text": "So you don't have anything. Cool. Figures.",
                                                              "timestamp": "2022-06-18 19:11:20",
                                                              "score": 1,
                                                              "num_children": 0,
                                                              "author": 186012,
                                                              "replies": []
                                                            },
                                                            {
                                                              "id": "icve3gp",
                                                              "text": "I mean, you haven't really shared any. You've definitely shown some good points, but they're not at all the crushing truth you say it is. It's all just saying that it's an issue that needs to be handled carefully. Automatic, permanent exclusion is not the answer. It never is.",
                                                              "timestamp": "2022-06-18 20:46:20",
                                                              "score": 0,
                                                              "num_children": 1,
                                                              "author": 186012,
                                                              "replies": [
                                                                {
                                                                  "id": "icvll7n",
                                                                  "text": "Hahaha! I already know why you haven't shared anything with me that says cis females have an advantage over born males. \n\n\"When males reach puberty, their bodies begin producing large amounts of testosterone, the original, natural, performance-enhancing drug. It gives them increased strength, endurance, power, size and muscle mass, with less fat and bigger and denser bones, which can support bigger muscles and internal organs. The advantages of such hormones are so great that some athletes take synthetic hormones — anabolic steroids — to increase those advantages over their own sex.\n\nTestosterone accounts for the difference between male and female athletic performance, and that difference is one of the very reasons women’s sports were created in the first place — to bring an even playing field. Other concessions have also been made for females — shorter tee boxes (golf), lower nets (volleyball) and hurdles (track), smaller implements (track and field) and smaller balls (basketball).\n\n\nWith the emergence of male-to-female transgender athletes, the competitive concerns are obvious: The separation of the sexes is compromised and biological men could potentially deny women of opportunities they were denied at every level of sport for decades until the passage of Title IX in the ’70s — scholarships, roster spots, contracts, prize money, medals — if not put them at increased risk of injury in contact sports (see sidebar note in which MTF fighter Fallon Fox seriously injured her female opponent in the first two minutes of their bout).\n\n\n\nJoanna Harper, a competitive transgender runner herself and a medical physicist, has done considerable research on transgender athletes in sport. “… Allowing these athletes to compete in women’s sport with their serious testosterone-based advantage threatens the very fabric of women’s sport,” she once said in a Q&A with exercise physiologist Ross Tucker.\n\nHarper, who has been a consultant for the IOC and World Athletics, told The Seattle Times, “The gender identity doesn’t matter, it’s the testosterone levels.”\n\n[FACTS! ](https://www.deseret.com/2021/7/29/22584285/male-to-female-transgender-olympic-athletes-impact-womens-sports-president-biden-mike-lee-weigh-in?_amp=true))",
                                                                  "timestamp": "2022-06-18 21:46:48",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "author": 156729,
                                                                  "replies": [
                                                                    {
                                                                      "id": "icxg1yw",
                                                                      "text": "You're just repeating stuff wtf?",
                                                                      "timestamp": "2022-06-19 09:53:26",
                                                                      "score": 1,
                                                                      "num_children": 1,
                                                                      "author": 186012,
                                                                      "replies": [
                                                                        {
                                                                          "id": "icyth1m",
                                                                          "text": "You're just repeating yourself, wtf?",
                                                                          "timestamp": "2022-06-19 17:48:52",
                                                                          "score": 1,
                                                                          "num_children": 0,
                                                                          "author": 156729,
                                                                          "replies": []
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "icr59kq",
                                              "text": ">Serena Williams is considered by some as the greatest women’s tennis player ever. In 2013, she told TV talk show host David Letterman, “For me, men’s tennis and women’s tennis are completely, almost, two separate sports. If I were to play (British star) Andy Murray, I would lose 6-0, 6-0 in five to six minutes, maybe 10 minutes. No, it’s true. It’s a completely different sport. The men are a lot faster and they serve harder, they hit harder, it’s just a different game.”\n\nOk? A male is not the same as a transitioned female, so bad analogy, also, anecdotal comparison that is interesting, but ultimately meaningless. People saying how they feel about stuff means nothing against actual data. You keep throwing out these stories as if they mean anything. Why?\n\n>Testosterone accounts for the difference between male and female athletic performance, and that difference is one of the very reasons women’s sports were created in the first place\n\nAnd HRT changes that. Making blanket statements and absolute judgements won't work in this. It's an entirely new area, with little data showing what needs to be done. It's not black and white. \n\n>When males reach puberty, their bodies begin producing large amounts of testosterone, the original, natural, performance-enhancing drug\n\nEvery argument made completely ignores prepuberty transitions. Why?",
                                              "timestamp": "2022-06-17 20:05:32",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 186012,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "icmkmlc",
                              "text": "Most trans women can't handle the dysphoria of competing in gender-affirming sports. You're entertaining a fake \"problem.\"",
                              "timestamp": "2022-06-16 20:44:32",
                              "score": -2,
                              "num_children": 0,
                              "author": 177493,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "icnqjcq",
              "text": "Please, show us how transgender people are ruining women's sports.",
              "timestamp": "2022-06-17 02:10:35",
              "score": 2,
              "num_children": 2,
              "author": 186012,
              "replies": [
                {
                  "id": "icnv0ec",
                  "text": "Just like the Paralympics and Special Olympics, there needs to be a league created for Transgender athletes where they can compete with each other, or in another newly formed classification which include all genders.\n\nCisgender athletes shouldn't have to compete with male to female athletes they never ever competed against when such athletes were developing muscles as boys.",
                  "timestamp": "2022-06-17 02:45:36",
                  "score": 5,
                  "num_children": 1,
                  "author": 156729,
                  "replies": [
                    {
                      "id": "icnyyko",
                      "text": "Do you know what happens to a transgender woman when they go on hrt? Their testosterone drops. They lose muscle mass. Their entire body changes. Saying they are competing with an unfair advantage is false. \n\nSo unless you've got some actual, verifiable evidence to back up your claims, stop spreading this bullshit.",
                      "timestamp": "2022-06-17 03:17:34",
                      "score": 4,
                      "num_children": 1,
                      "author": 186012,
                      "replies": [
                        {
                          "id": "ico5c2m",
                          "text": "Interesting, cognitive dissonance is thick in this one who's spreading bs without anything to debunk the actual evidence I've just shared?\n\nThis is how crazy people like yourself are.\n\nAll the studies have shown that boy athletes had already developed stronger muscles before transitioning to female which is why we're seeing today for instance boy swimmers or ironman athletes who barely placed in the top 20 are now taking 1st & 2nd place in women's sports.\n\n Common sense would tell anyone with an IQ over 100 this. \n\nSo while you're heading to kick bricks, we're going to have to agree to disagree. 😊",
                          "timestamp": "2022-06-17 04:11:51",
                          "score": 3,
                          "num_children": 3,
                          "author": 156729,
                          "replies": [
                            {
                              "id": "icpudop",
                              "text": "Dude, you just want an axe to grind. How are trans women placing high in women's sports any different than cis women still placing high in women's sports? If trans women were a problem, cis women wouldn't be placing at all. The whole rhetoric that trans women are dominating sports is bullshit. They aren't dominating. They're placing in high percentiles. Like another comment or said, how is that any different than rich cis women who dedicate their entire lives to the sports and absolutely dominate over those who can't? \n\n>Common sense would tell anyone with an IQ over 100 this. \n\nCommon sense would recognize that the issue is way more complex. But you don't actually care. You just want to push others down.",
                              "timestamp": "2022-06-17 15:06:32",
                              "score": 3,
                              "num_children": 0,
                              "author": 186012,
                              "replies": []
                            },
                            {
                              "id": "icqjsf1",
                              "text": "Dude, you just want an axe to grind. How are trans women placing high in women's sports any different than cis women still placing high in women's sports? If trans women were a problem, cis women wouldn't be placing at all. The whole rhetoric that trans women are dominating sports is bullshit. They aren't dominating. They're placing in high percentiles. Like another comment or said, how is that any different than rich cis women who dedicate their entire lives to the sports and absolutely dominate over those who can't? \n\n>Common sense would tell anyone with an IQ over 100 this. \n\nCommon sense would recognize that the issue is way more complex. But you don't actually care. You just want to push others down.",
                              "timestamp": "2022-06-17 17:28:30",
                              "score": 2,
                              "num_children": 1,
                              "author": 186012,
                              "replies": [
                                {
                                  "id": "icqt6xb",
                                  "text": "For anyone to deny the biological sciences when it comes to women fighting for our place in sports for the past 100 years to only have male born athletes to take over women's sports only tells me You Don't Care. \n\n\n\n\n\"Joanna Harper, a competitive transgender runner herself and a medical physicist, has done considerable research on transgender athletes in sport. “… Allowing these athletes to compete in women’s sport with their serious testosterone-based advantage threatens the very fabric of women’s sport,” she once said in a Q&A with exercise physiologist Ross Tucker.\n\nHarper, who has been a consultant for the IOC and World Athletics, told The Seattle Times, “The gender identity doesn’t matter, it’s the testosterone levels.”\n\n\n[\n\"In search of a level playing field. How male-to-female transgender athletes are impacting women’s sports\"](http://\nhttps://www.deseret.com/2021/7/29/22584285/male-to-female-transgender-olympic-athletes-impact-womens-sports-president-biden-mike-lee-weigh-in)",
                                  "timestamp": "2022-06-17 18:36:43",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 156729,
                                  "replies": [
                                    {
                                      "id": "icr44yv",
                                      "text": ">For anyone to deny the biological sciences when it comes to women\n\nI'm not denying it. I'm saying that it's not nearly as big of a problem as people make it out to be. Everyone's screaming that trans athletes have a huge advantage when the numbers say they don't. They're placing high, but they're definitely not *dominating* as people say. \n\n>Joanna Harper, a competitive transgender runner herself and a medical physicist, has done considerable research on transgender athletes in sport \n\nI'd love to see that research and what it says. Otherwise this is just and interesting anecdote. \n\n>Harper, who has been a consultant for the IOC and World Athletics, told The Seattle Times, “The gender identity doesn’t matter, it’s the testosterone levels.”\n\nHuh! Now isn't that interesting! It's almost as if the fact that they're transgender doesn't matter! No shit?!\n\nBecause here's the other side of the coin that anti trans athletes never talk about, which is trans women who began transitioning young, and never developed all that testosterone, muscle mass, etc. Because that's what really matters. \n\nWhat we need is to change how sports are handled, how the performance brackets are decided and measured, and change how people think about gender in sports. Not blanket deny entry based on arbitrary definitions and outdated traditions.",
                                      "timestamp": "2022-06-17 19:57:20",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 186012,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "icpuhvb",
                              "text": "Dude, you just want an axe to grind. How are trans women placing high in women's sports any different than cis women still placing high in women's sports? If trans women were a problem, cis women wouldn't be placing at all. The whole rhetoric that trans women are dominating sports is bullshit. They aren't dominating. They're placing in high percentiles. Like another comment or said, how is that any different than rich cis women who dedicate their entire lives to the sports and absolutely dominate over those who can't? \n\n>Common sense would tell anyone with an IQ over 100 this. \n\nCommon sense would recognize that the issue is way more complex. But you don't actually care. You just want to push others down.",
                              "timestamp": "2022-06-17 15:06:55",
                              "score": 1,
                              "num_children": 0,
                              "author": 186012,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "icnsvks",
                  "text": "No one can show the willfully blind anything",
                  "timestamp": "2022-06-17 02:29:09",
                  "score": 3,
                  "num_children": 0,
                  "author": 156729,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iclm2w7",
      "text": "Just a reminder, the number of people assaulted by trans people using their preferred gendered restrooms remains zero.",
      "timestamp": "2022-06-16 16:39:48",
      "score": 4,
      "num_children": 0,
      "author": 339917,
      "replies": []
    },
    {
      "id": "icm3ytu",
      "text": "Of course they don’t. Because Father Bubba is a straight white male. And that’s better than being trans no matter how many crimes he commits. Obviously. \n\nIf these are the lords interpreters, I’m glad I got out when I did.",
      "timestamp": "2022-06-16 18:41:59",
      "score": 2,
      "num_children": 0,
      "author": 196527,
      "replies": []
    },
    {
      "id": "icmlbv9",
      "text": ">church leaders\n>banned from the women's bathroom\n\nMen are already barred from the women's bathroom though.",
      "timestamp": "2022-06-16 20:49:29",
      "score": 2,
      "num_children": 0,
      "author": 381490,
      "replies": []
    },
    {
      "id": "icnd77q",
      "text": "This is exactly why we need separate bathrooms! I don't care if this is not PC. People should feel safe when using the restroom. But no, children (regardless of gender) need to be on guard when using the bathroom because you never know if the next stall is being occupied a clergy member. We must add a third bathroom for clergy!",
      "timestamp": "2022-06-17 00:22:21",
      "score": 2,
      "num_children": 0,
      "author": 110203,
      "replies": []
    },
    {
      "id": "iclmdz5",
      "text": "I'm only concerned about what's happening to cis women's sports and women's scholarships.",
      "timestamp": "2022-06-16 16:41:53",
      "score": 0,
      "num_children": 0,
      "author": 156729,
      "replies": []
    },
    {
      "id": "ickx6ov",
      "text": "This just in…. Water is wet",
      "timestamp": "2022-06-16 13:39:55",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "icl07u9",
      "text": "The argument around trans people in bathrooms has never been that trans people pose a risk. The argument is that if the only criteria to gain access to womens' spaces is that you say you're a woman, this leaves the door open to genuine threats from e.g. the aforementioned church leaders.",
      "timestamp": "2022-06-16 14:03:36",
      "score": 5,
      "num_children": 1,
      "author": 70700,
      "replies": [
        {
          "id": "iclx3vn",
          "text": "I’ve heard both arguments",
          "timestamp": "2022-06-16 17:54:53",
          "score": 5,
          "num_children": 0,
          "author": 238844,
          "replies": []
        }
      ]
    },
    {
      "id": "ickr48t",
      "text": "Yeah but he fell to the devils temptation and sought redemption so Saul good, unlike that trans person who just uses bathrooms at attack vectors.\n\nJFC sarcasm. Comprehension goes a long way.",
      "timestamp": "2022-06-16 12:48:54",
      "score": 0,
      "num_children": 2,
      "author": 208162,
      "replies": [
        {
          "id": "ickvcel",
          "text": ">  unlike that trans person who just uses bathrooms at attack vectors.\n\nunlike that trans person who just uses bathrooms to go pee. \n\nFTFY",
          "timestamp": "2022-06-16 13:25:01",
          "score": 9,
          "num_children": 1,
          "author": 7016,
          "replies": [
            {
              "id": "icll7bc",
              "text": "JFC is everyone’s sarcasm detector broken? FFS my flair is anti-theist and you guys think my statement is true? Obviously people don’t attack people in bathrooms.",
              "timestamp": "2022-06-16 16:33:43",
              "score": 4,
              "num_children": 0,
              "author": 208162,
              "replies": []
            }
          ]
        },
        {
          "id": "icm1r2b",
          "text": "Sarcasm does not work very well through text, it's why peoe use \"/s\".",
          "timestamp": "2022-06-16 18:26:51",
          "score": 2,
          "num_children": 1,
          "author": 342708,
          "replies": [
            {
              "id": "icm8613",
              "text": "You’d think the Anti-theist tag would show exactly who I am LOL I hate religion more than the average Atheist, and dumb bullshit discrimination that comes with it.",
              "timestamp": "2022-06-16 19:10:45",
              "score": 1,
              "num_children": 1,
              "author": 208162,
              "replies": [
                {
                  "id": "icm8vzi",
                  "text": "Can't speak for everyone else, but when I'm on my phone I don't always see the tags.",
                  "timestamp": "2022-06-16 19:15:43",
                  "score": 1,
                  "num_children": 0,
                  "author": 342708,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "icl5jlu",
      "text": "Hahahahahaha! Absolutely right! 😂😂😂",
      "timestamp": "2022-06-16 14:43:16",
      "score": 2,
      "num_children": 0,
      "author": 122201,
      "replies": []
    },
    {
      "id": "icmmjj5",
      "text": "What does transgenderism have to do with this? I saw no mention of the church leader being trans in the article.",
      "timestamp": "2022-06-16 20:58:07",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "icmyvcn",
      "text": "What does transgenderism have to do with this headline at all.",
      "timestamp": "2022-06-16 22:27:28",
      "score": 1,
      "num_children": 1,
      "author": 344566,
      "replies": [
        {
          "id": "ico6khy",
          "text": "Well it has to do with the religious-right insisting that trans people molest children in bathrooms and therefore trans people need use the bathroom they choose you must use.  Funny that the people caught molesting kids in bathrooms are mostly clergy.  How come they are not being banned from public restrooms and business restrooms?",
          "timestamp": "2022-06-17 04:23:24",
          "score": 1,
          "num_children": 0,
          "author": 259252,
          "replies": []
        }
      ]
    },
    {
      "id": "icmkcpq",
      "text": " Can I get an amen?  Hahaha!   As an atheist, fourth generation, (maybe more) I get asked by church people about how I obviously have no moral grounding. The most insane time this happened was when the old lady across the street found out about my lack of belief. Asked this after I had been helping her and looking after her for YEARS!  Told me she wondered if we could remain friends.   It’s so crazy!",
      "timestamp": "2022-06-16 20:42:35",
      "score": 1,
      "num_children": 0,
      "author": 170871,
      "replies": []
    },
    {
      "id": "icmuqeu",
      "text": "Males are the forest, church leaders and drag queens are the trees.",
      "timestamp": "2022-06-16 21:56:57",
      "score": 1,
      "num_children": 0,
      "author": 24089,
      "replies": []
    },
    {
      "id": "icmkn5a",
      "text": "I think both are wrong.",
      "timestamp": "2022-06-16 20:44:39",
      "score": -1,
      "num_children": 0,
      "author": 227575,
      "replies": []
    },
    {
      "id": "icnnd7c",
      "text": "Why not ban both",
      "timestamp": "2022-06-17 01:46:11",
      "score": -4,
      "num_children": 0,
      "author": 87161,
      "replies": []
    },
    {
      "id": "icmc521",
      "text": "Why can't we keep children away from the priests and inappropriate sexualised drag shows in libraries and schools? Why expose children to any danger of being molested? \n\nTransgender drag performers should be kept out of schools as should the priests and pastors.",
      "timestamp": "2022-06-16 19:38:26",
      "score": -12,
      "num_children": 5,
      "author": 83415,
      "replies": [
        {
          "id": "icnbud0",
          "text": "Please, show us more about all the drag performers molesting children. I'd love to see the all articles and studies that show that drag performers are more dangerous than school teachers and staff.",
          "timestamp": "2022-06-17 00:10:45",
          "score": 2,
          "num_children": 1,
          "author": 186012,
          "replies": [
            {
              "id": "ico369z",
              "text": "What place does a drag performance have in a school curriculum? A school teacher needs to be in school to teach. Why does a drag queen/performer need to be in a school? Why not burlesque dancers then?\n\nI can't believe you seriously compared them to school teachers.",
              "timestamp": "2022-06-17 03:51:57",
              "score": 0,
              "num_children": 1,
              "author": 83415,
              "replies": [
                {
                  "id": "icpnm70",
                  "text": "It teaches kids that people in drag are just normal people, like everyone else. It teaches them variety of life, the beauty of the human body and acceptance of who you are as a human being in your own skin. It's completely different from burlesque. \n\n>I can't believe you seriously compared them to school teachers.\n\nI can't believe you think kids are in danger around drag queens and that you think school staff are so safe. You don't understand drag so their automatically potential pedos but school staff are automatically safer. \n\n>Because no kid has ever been abused by a teacher. No child has ever been beaten by a teacher. No teacher had ever looked the other way while another student was bullied and driven to suicide but other students. No different had ever been raped by a teacher! Oh no that would never happen!!\n\n>But drag queens are dangerous! They make me uncomfortable and I don't like that! They're going to touch my kids!\n\nYou better believe I compared them. By and large drag queens have much bigger hearts, and more respect for people, than the majority of the population. Drag is about the body; acceptance, education, love and respect.",
                  "timestamp": "2022-06-17 14:20:48",
                  "score": 1,
                  "num_children": 1,
                  "author": 186012,
                  "replies": [
                    {
                      "id": "icq2uu3",
                      "text": "\n\n\n>By and large drag queens have much bigger hearts, and more respect for people, than the majority of the population\n\nYeah right. Have been on Twitter when transfolk have attacked feminists and threatened them with rape, muder and doxxed them. Drag queens and transfolk are like every other human being they are not special.\n\n\n\n>It teaches them variety of life, the beauty of the human body and acceptance of who you are as a human being in your own skin.\n\nThe school should teach them math, science, history civics etc etc. The variety of life etc can be taught by parents, life and experience. Not the schools place to teach this. \n\n>You don't understand drag so their automatically potential pedos but school staff are automatically safer. \n\n\nThere is nothing to understand here. Some people like to dress as caricatures albeit glamorous caricatures. Again why does that have to be shoved down school children's throats. If you want children to talk to trans people, bring in a trans person not stars dressed like a caricature. That would reinforce normalcy. \n\nThe school staff NEED to be in a school to teach children the curriculum. Drag queens don't. That you think the utility of having a maths teacher is somehow equivalent to having a drag queen in school says volumes. The risk of a necessity versus the risk of something that is useless can't be compared.",
                      "timestamp": "2022-06-17 15:40:09",
                      "score": 0,
                      "num_children": 0,
                      "author": 83415,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ico352h",
          "text": "Do you have a source on sexualized drag shows at libraries? I couldn't find anything.\n\nThe only \"source\" I could find was from the christian broadcasting network and it's very vague saying a drag strip show \"reportedly\" happened as some point. But no confirmation.\n\n[link to the awful source](https://www1.cbn.com/cbnnews/us/2019/october/librarys-drag-queen-story-hour-strip-show-goes-viral)",
          "timestamp": "2022-06-17 03:51:39",
          "score": 3,
          "num_children": 5,
          "author": 93963,
          "replies": [
            {
              "id": "ico3wob",
              "text": "https://nypost.com/2022/06/11/over-200k-being-spent-on-drag-queen-shows-at-nyc-schools/",
              "timestamp": "2022-06-17 03:58:37",
              "score": 3,
              "num_children": 1,
              "author": 83415,
              "replies": [
                {
                  "id": "ico428v",
                  "text": "Thank you but this article says nothing about it having any sexual content.\n\n\nEdit: none of the sources you sent said the drag shows were sexualized in anyway only that drag queens reading to kids.",
                  "timestamp": "2022-06-17 04:00:03",
                  "score": -1,
                  "num_children": 2,
                  "author": 93963,
                  "replies": [
                    {
                      "id": "ico4j7j",
                      "text": "Have you ever been to a drag performance or a burlesque performance? They are not appropriate for a school environment. \n\nI wouldn't want women or men performing burlesque in front of kids, trans people do not get a pass for being trans",
                      "timestamp": "2022-06-17 04:04:21",
                      "score": 1,
                      "num_children": 1,
                      "author": 83415,
                      "replies": [
                        {
                          "id": "ico5jjf",
                          "text": "Not all drag is like that. A drag queen reading to kids in a library is not the same as the drag shows you see in a 21+ club.",
                          "timestamp": "2022-06-17 04:13:45",
                          "score": 2,
                          "num_children": 1,
                          "author": 93963,
                          "replies": [
                            {
                              "id": "ico616u",
                              "text": "What need of glamour to read books to a children?",
                              "timestamp": "2022-06-17 04:18:23",
                              "score": 2,
                              "num_children": 0,
                              "author": 83415,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ico5urf",
                      "text": "It doesn't matter if they read to the children or gaped their anuses on stage.\n\nDrag performances are not the best way to teach kids about trans people. I find drag to be like a caricature or a highly stylised and inaccurate depiction of a person. \n\nI would rather a trans person come and talk to kids dressed in their day to day attire and converse with them over some overly glamourised caricature",
                      "timestamp": "2022-06-17 04:16:40",
                      "score": 1,
                      "num_children": 1,
                      "author": 83415,
                      "replies": [
                        {
                          "id": "ico66ul",
                          "text": ">Why can't we keep children away from the priests and inappropriate sexualised drag shows in libraries and schools? Why expose children to any danger of being molested? \n\nThis you?",
                          "timestamp": "2022-06-17 04:19:52",
                          "score": 1,
                          "num_children": 2,
                          "author": 93963,
                          "replies": [
                            {
                              "id": "ico6944",
                              "text": "Yes",
                              "timestamp": "2022-06-17 04:20:28",
                              "score": 3,
                              "num_children": 0,
                              "author": 83415,
                              "replies": []
                            },
                            {
                              "id": "ico6e9n",
                              "text": "Not all drag performers are trans. Some people just like to dress in women's attire",
                              "timestamp": "2022-06-17 04:21:45",
                              "score": 3,
                              "num_children": 1,
                              "author": 83415,
                              "replies": [
                                {
                                  "id": "ico6hkk",
                                  "text": "You're an idiot and arguing in bad faith.",
                                  "timestamp": "2022-06-17 04:22:38",
                                  "score": -1,
                                  "num_children": 1,
                                  "author": 93963,
                                  "replies": [
                                    {
                                      "id": "ico6z7h",
                                      "text": "Lol I am the idiot but you want drag queens in school. If you can't distinguish between drag performers and trans people, that is on you.\n\nI wouldn't want a cabaret performer in full get up to come and read to school children",
                                      "timestamp": "2022-06-17 04:27:20",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 83415,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ico3z0d",
              "text": "https://www.washingtontimes.com/news/2022/jun/3/dc-public-schools-host-drag-queen-performance-high/",
              "timestamp": "2022-06-17 03:59:13",
              "score": 1,
              "num_children": 0,
              "author": 83415,
              "replies": []
            },
            {
              "id": "ico417d",
              "text": "https://www.nbc12.com/2022/04/19/high-school-teachers-drag-performance-students-draws-controversy/",
              "timestamp": "2022-06-17 03:59:47",
              "score": 1,
              "num_children": 0,
              "author": 83415,
              "replies": []
            },
            {
              "id": "ico472w",
              "text": "Just first page of Google search drag performance in schools\n\nDid you really look for a source?",
              "timestamp": "2022-06-17 04:01:16",
              "score": 1,
              "num_children": 0,
              "author": 83415,
              "replies": []
            },
            {
              "id": "ico43rv",
              "text": "https://www.desmoinesregister.com/story/news/local/ankeny/2022/05/25/ankeny-high-school-drag-show-under-investigation-negative-social-media/9926324002/",
              "timestamp": "2022-06-17 04:00:26",
              "score": 0,
              "num_children": 0,
              "author": 83415,
              "replies": []
            }
          ]
        },
        {
          "id": "icmkj1q",
          "text": "Sounds reasonable. Don’t know why your being downvoted.",
          "timestamp": "2022-06-16 20:43:50",
          "score": 1,
          "num_children": 2,
          "author": 336011,
          "replies": [
            {
              "id": "icnqa70",
              "text": "How is that reasonable? Why are transgender people more likely to abuse than any of the staff?",
              "timestamp": "2022-06-17 02:08:35",
              "score": 6,
              "num_children": 1,
              "author": 186012,
              "replies": [
                {
                  "id": "ico3ik3",
                  "text": "Lol why does a drag performance need to happen in a school? You think the exaggerated version of what a woman is supposed to look like is the only way to teach children about transgenderism. \n\nWhy take a miniscule chance of any child being molested by people that don't need to be in a school",
                  "timestamp": "2022-06-17 03:55:04",
                  "score": -2,
                  "num_children": 0,
                  "author": 83415,
                  "replies": []
                }
              ]
            },
            {
              "id": "ico4tk0",
              "text": "Because the hive mind thinks drag performers have a right to be in schools because they are just as likely to molest children as school staff.\n\nLol",
              "timestamp": "2022-06-17 04:06:59",
              "score": -1,
              "num_children": 1,
              "author": 83415,
              "replies": [
                {
                  "id": "icpuq62",
                  "text": "No they don't. It has nothing to do with that and you know it.",
                  "timestamp": "2022-06-17 15:07:42",
                  "score": 1,
                  "num_children": 0,
                  "author": 186012,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "icoxnv8",
          "text": "Drag shows and transgender people are two entirely different things. Drag performers are *not* transgender.",
          "timestamp": "2022-06-17 10:10:57",
          "score": 1,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "icoxq1i",
              "text": "Yes! I said the same thing to some in the thread",
              "timestamp": "2022-06-17 10:11:47",
              "score": 2,
              "num_children": 0,
              "author": 83415,
              "replies": []
            }
          ]
        },
        {
          "id": "icp3i9z",
          "text": "Not every drag performer is trans.",
          "timestamp": "2022-06-17 11:23:57",
          "score": 1,
          "num_children": 1,
          "author": 391584,
          "replies": [
            {
              "id": "icp3ofs",
              "text": "Yes I make the same point, read on. Drag performance, gender of the performers notwithstanding has no place in a school.",
              "timestamp": "2022-06-17 11:25:54",
              "score": 0,
              "num_children": 1,
              "author": 83415,
              "replies": [
                {
                  "id": "icpd0bs",
                  "text": "Readings books in drag is not equivalent to a drag performance. Even if it was a performance, do you believe that each drag show is sexually explicit?",
                  "timestamp": "2022-06-17 12:57:20",
                  "score": 0,
                  "num_children": 1,
                  "author": 391584,
                  "replies": [
                    {
                      "id": "icpfvyc",
                      "text": "Still not appropriate for school children. And also the same rules apply for burlesque and cabaret performances... A cabaret performer or a burlesque shouldn't read to kids in their get up",
                      "timestamp": "2022-06-17 13:21:33",
                      "score": 1,
                      "num_children": 0,
                      "author": 83415,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ickyw8t",
      "text": "This whole thing seems tired. Even church of Satan people will sin.  \n\n\nHumans being humans.  Unfortunately that includes production of  victims   All the time. Victims.  Young and old, black and white, poor and gold.",
      "timestamp": "2022-06-16 13:53:20",
      "score": -16,
      "num_children": 2,
      "author": 33406,
      "replies": [
        {
          "id": "iclx765",
          "text": "Proportion of victimhood is questionable",
          "timestamp": "2022-06-16 17:55:31",
          "score": 7,
          "num_children": 0,
          "author": 238844,
          "replies": []
        },
        {
          "id": "icm1gr2",
          "text": "Good people will do good things and bad people will do bad things, no matter the setting. But to get good people to do bad things, you need religion.",
          "timestamp": "2022-06-16 18:24:52",
          "score": 3,
          "num_children": 1,
          "author": 299021,
          "replies": [
            {
              "id": "icmad4i",
              "text": "Okay… I can think of a lot of reasons why good people would do bad things apart from religion though",
              "timestamp": "2022-06-16 19:25:56",
              "score": -2,
              "num_children": 1,
              "author": 278856,
              "replies": [
                {
                  "id": "icmdjvp",
                  "text": "I might be able to cherry pick a few, but they would be outliers compared to the atrocities we see religion perpetuate daily, using good people as its tools.\n\n\nThe purpose of the above quote is to illustrate how religion takes otherwise good people and enables or pressures them to do bad things. I.e.: the crusades, covering up sexual abuse, bigotry, violence against outside groups. All in the name of a God who is supposedly good.",
                  "timestamp": "2022-06-16 19:48:16",
                  "score": 2,
                  "num_children": 1,
                  "author": 299021,
                  "replies": [
                    {
                      "id": "icmpkui",
                      "text": "Patriotism has killed a lot too.  Racism.  Capitalism. Commun Am.  It’s not just religion",
                      "timestamp": "2022-06-16 21:19:52",
                      "score": 1,
                      "num_children": 1,
                      "author": 33406,
                      "replies": [
                        {
                          "id": "icmu476",
                          "text": "That's a good point. You could probably amend the above quote to, \"any institution that claims a higher authority over an individual's conscience, can lead someone who is inclined to do good into committing evil acts.\"\n\n\nI think the reason religion is the worst of these offenders is because it claims to be the ultimate source of good and morality. A lot of these other examples ask that the individual forsake their own morality for \"the greater good\" according to the institution, but religion instead defines what good is. \"Do this or go against the all powerful omnibenevolent creator of the universe.\"",
                          "timestamp": "2022-06-16 21:52:28",
                          "score": 1,
                          "num_children": 1,
                          "author": 299021,
                          "replies": [
                            {
                              "id": "icmvku9",
                              "text": "Yes. Agree with all of that.  Fellowship is important for human happiness. Unfortunately, the only options for fellowship for most are the taverns or the tabernacles.   Both deliver poison concoctions.\n\nWriter’s note: I’m not sure what a tabernacle is, and too lazy to look it up.  Sounded good is all.",
                              "timestamp": "2022-06-16 22:03:05",
                              "score": 1,
                              "num_children": 0,
                              "author": 33406,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ico4ayi",
      "text": "Impressive mental gymnastics. Seems atheism has found a new god after all. Praise LGBT. Trans bless you.",
      "timestamp": "2022-06-17 04:02:15",
      "score": -4,
      "num_children": 2,
      "author": 22608,
      "replies": [
        {
          "id": "icoxgmw",
          "text": "Pretty sure you can't worship a concept...",
          "timestamp": "2022-06-17 10:08:08",
          "score": 2,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "icqu2pr",
              "text": "What makes you sure of that? Of course you can. You can worship whatever you want. God is a concept for many people.",
              "timestamp": "2022-06-17 18:43:12",
              "score": 0,
              "num_children": 1,
              "author": 22608,
              "replies": [
                {
                  "id": "icqy3yc",
                  "text": "God is an entity. No one worships the concept of being LGBT+.",
                  "timestamp": "2022-06-17 19:12:48",
                  "score": 2,
                  "num_children": 1,
                  "author": 286151,
                  "replies": [
                    {
                      "id": "icr3txt",
                      "text": "An entity must exist. This is the atheism subreddit. Thus, God is a concept. \n\nLet me remind you what month it is. The entire month is dedicated to lgbt. Huge numbers of people worship it, whether they acknowledge it or not. No specific person is being worshipped. The month isn't dedicated to an entity. It is to the concept.",
                      "timestamp": "2022-06-17 19:55:01",
                      "score": 1,
                      "num_children": 1,
                      "author": 22608,
                      "replies": [
                        {
                          "id": "icr3zfa",
                          "text": "So do huge numbers of people worship blackness during black history month?",
                          "timestamp": "2022-06-17 19:56:10",
                          "score": 2,
                          "num_children": 1,
                          "author": 286151,
                          "replies": [
                            {
                              "id": "icr4ab0",
                              "text": "Yes lol And at other times not specifically outlined for such worship depending on how devout they are. They even have their own Satan, dichotomy to stand against (ie: whiteness)",
                              "timestamp": "2022-06-17 19:58:25",
                              "score": 1,
                              "num_children": 1,
                              "author": 22608,
                              "replies": [
                                {
                                  "id": "icr7sbe",
                                  "text": "You have a strange idea of what 'worship' means.",
                                  "timestamp": "2022-06-17 20:24:13",
                                  "score": 3,
                                  "num_children": 1,
                                  "author": 286151,
                                  "replies": [
                                    {
                                      "id": "icrypkh",
                                      "text": "Not really. Your idea of what it means seems to be overly constrained.",
                                      "timestamp": "2022-06-17 23:58:50",
                                      "score": 0,
                                      "num_children": 1,
                                      "author": 22608,
                                      "replies": [
                                        {
                                          "id": "icteo4g",
                                          "text": "So you think any celebration is worship? Do people worship you on your birthday?",
                                          "timestamp": "2022-06-18 09:51:59",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 286151,
                                          "replies": [
                                            {
                                              "id": "icugog2",
                                              "text": "Obviously not and its odd you would suggest that.  \n\n\nI am worshipped even not on my birthday but i don't see how that is relevant. lolThe insertion of lgbt politics into this story about child abuse was stupid and opaque propaganda. The suggestion transpeople are uniquely free from similar evil acts is ridiculous. Many are troubled individuals who often consciously embrace darkness and struggle with self loathing.  \n\n\nThe fact atheism is willing to attack one delusion while fully and uncritically embracing another is laughable. That was my point.  \n\n\nDo you have a point you are trying to make?",
                                              "timestamp": "2022-06-18 16:19:23",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 22608,
                                              "replies": [
                                                {
                                                  "id": "icvo84m",
                                                  "text": "You seem to think when people celebrate things, it is worship.\n\nOr does that only apply to LGBT+ and black people being celebrated?",
                                                  "timestamp": "2022-06-18 22:08:34",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 286151,
                                                  "replies": [
                                                    {
                                                      "id": "id5lzdj",
                                                      "text": "Why should i bother responding further if you are going to ignore everything I say?\n\nYou started this saying it was impossible to worship a concept and when i showed how silly that was you moved onto word games around the distinction between celebration and worship.\n\nWorship is a form of celebration, but not all celebration is a form of worship. I am using the comparison of worship toward lgbt ideology to make my point given that we are in the atheism subreddit. Lgbt ideology is an incoherent delusion, exalted above criticism by its adherents, belief in which is reinforced through social pressure much like religion and the fact the atheism subreddit has fallen in line with such nonsense is ironic.\n\nIf you have a disagreement, explain it and we could discuss it but I see no point in going in circles with you telling me what you think i seem to think, even after i reply to the contrary",
                                                      "timestamp": "2022-06-21 07:02:14",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 22608,
                                                      "replies": [
                                                        {
                                                          "id": "id5v6db",
                                                          "text": "> Worship is a form of celebration, but not all celebration is a form of worship.\n\nAnd pride month and black history month are not form of worship. Period. That's just bigotry.",
                                                          "timestamp": "2022-06-21 09:16:59",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 286151,
                                                          "replies": [
                                                            {
                                                              "id": "id64vib",
                                                              "text": "What is just bigotry? Which unreasonable viewpoint am I holding on to?   \nWhat have you actually said other than this dumb word play? Do you know what the phrase \"to draw parallels\" means? Who am i showcasing intolerance to? You are very dense.",
                                                              "timestamp": "2022-06-21 11:28:49",
                                                              "score": 1,
                                                              "num_children": 0,
                                                              "author": 22608,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ico5z3j",
          "text": "No need to get snippy - and I saw no mental gymnastics in their comment - and what was wrong with their suggestion?",
          "timestamp": "2022-06-17 04:17:50",
          "score": 2,
          "num_children": 1,
          "author": 259252,
          "replies": [
            {
              "id": "icqxm7x",
              "text": "The gymnastics was the reach to connect these two subjects together in the first place. A mormon church leader abusing children doesn't mean that transpeople are not doing so.\n\nIt is just bizarre that these two things were even linked in this way. They have nothing to do with each other but the event is being used to cast light upon one group as evil and the other as innocent.\n\nI think it rich that atheism, the subreddit that prides itself on rejecting fantasy and delusion delights in dunking on the religious for their insane beliefs but entirely adopts/protects the delusions of men who believe they are women and expect everyone else to play along. To the point of inserting them into a child abuse story in an attempt to showcase their collective virtue, as if trans people are all good automatically by virtue of being trans.   \n\"Church leader\" isn't a sexual/gender identifier so it has nothing to do with bathrooms. The suggestion is obviously a stupid and smug attempt at making a witty point.\n\nWhy would someone abusing children at a sleepover lead to them being banned from bathrooms? Which bathrooms? All of them? Or just the women's? What if the church leader identified as a women? \n\nThe whole thing is stupid. Transparently adding lgbt identity politics into an event that had nothing to do with it.",
              "timestamp": "2022-06-17 19:09:09",
              "score": -1,
              "num_children": 0,
              "author": 22608,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "icljqt4",
      "text": "I think they are in danger in both situations",
      "timestamp": "2022-06-16 16:23:42",
      "score": -21,
      "num_children": 1,
      "author": 27750,
      "replies": [
        {
          "id": "icm8zge",
          "text": "Care to explain the danger of a transperson using the bathroom?",
          "timestamp": "2022-06-16 19:16:22",
          "score": 6,
          "num_children": 0,
          "author": 410714,
          "replies": []
        }
      ]
    },
    {
      "id": "ickz6q4",
      "text": "Omg komo is my local news, I thought this one was going to get personal.",
      "timestamp": "2022-06-16 13:55:35",
      "score": 1,
      "num_children": 0,
      "author": 368434,
      "replies": []
    },
    {
      "id": "icl7347",
      "text": "Way to use child victims to push an agenda. Church abuse is organized, rampant, and singularly disgusting in its prevalence. There are millions of human victims that have had their lives destroyed and continue to have their lives destroyed by people in power who are not only not checked, but covered and supported by organizations our taxes fund. Don't minimize this epidemic by comparing it to any other kind of abuse in order to make a point about social justice.",
      "timestamp": "2022-06-16 14:54:26",
      "score": 1,
      "num_children": 0,
      "author": 378462,
      "replies": []
    },
    {
      "id": "icliw10",
      "text": "We have evidence statistical evidence that kids are in more danger for molestation and rape at public schools were they are mandated to go to.",
      "timestamp": "2022-06-16 16:17:54",
      "score": 1,
      "num_children": 0,
      "author": 58147,
      "replies": []
    },
    {
      "id": "iclmvy7",
      "text": "It's just culture war bullshit fox dreams up to trick uneducated, low income voters to vote against their own interests.",
      "timestamp": "2022-06-16 16:45:20",
      "score": 1,
      "num_children": 0,
      "author": 304646,
      "replies": []
    },
    {
      "id": "icloboc",
      "text": "This needs to stop",
      "timestamp": "2022-06-16 16:55:14",
      "score": 1,
      "num_children": 0,
      "author": 317640,
      "replies": []
    },
    {
      "id": "iclt2zf",
      "text": "> “I confess I was stupid, it was horrible,” Sund reportedly told a West Jordan police officer.\n\nThe problem isn't that it was stupid, the problem is that it was evil you absolute monster of a person.",
      "timestamp": "2022-06-16 17:27:30",
      "score": 1,
      "num_children": 0,
      "author": 153627,
      "replies": []
    },
    {
      "id": "icltczl",
      "text": "Murder rape, pedophilia, just make sure you ask god for forgiveness after you cum.",
      "timestamp": "2022-06-16 17:29:20",
      "score": 1,
      "num_children": 0,
      "author": 288731,
      "replies": []
    },
    {
      "id": "iclvaab",
      "text": "It feels like kids are in danger around anyone who goes out of their way to spend more time than they need to with kids 🤷",
      "timestamp": "2022-06-16 17:42:25",
      "score": 1,
      "num_children": 0,
      "author": 43555,
      "replies": []
    },
    {
      "id": "icm0tyi",
      "text": "A YEAR!?!! WTF Utah??? Bring 'em all, but  Brigham Young, right?",
      "timestamp": "2022-06-16 18:20:32",
      "score": 1,
      "num_children": 0,
      "author": 17951,
      "replies": []
    },
    {
      "id": "icm4khl",
      "text": "Only a year?!",
      "timestamp": "2022-06-16 18:46:09",
      "score": 1,
      "num_children": 0,
      "author": 328723,
      "replies": []
    },
    {
      "id": "icm6qnw",
      "text": "Considering 2 factors: the current lack of separation of the church from state processes; and the states need to create jobs; perhaps lowering the separation of the state in the church should be reflected to the same level.   \n\n\nInclude religious registration to voter registration; allow non-aligned to vote on a chaperone sherriff for each  church to lower the amount of these cases from going unpunished. Oddly enough I'm using the terms loosely, but really it only really needs to target the one major religion.   \n\n\nTo extend further enact something along the lines of the \"Practice What Your Preach Act\". Currently in my area the only ones that would stay tax-exempt would be the Sikh temples and Muslim mosques.. They are the ones that tend to allow anyone in (following their wardrobe rules) for a hot meal and if they wanted a place to worship said religion.   \n\n\nIn my Evangelic Christian upbringing; I remember many a luncheon after the service and tea/coffee before/during the service, but only members were allowed access. Sure there was 'outreach to the community' during major holidays, but again the meals weren't for everyone, only those that were wealthy enough to live with a roof over their head and therefore the ability to pay the church back. Took a while for me to understand the hypocrisy of this, even after my eyes were opened by a bible class teacher as to how stupid the religion's basis was.",
      "timestamp": "2022-06-16 19:00:55",
      "score": 1,
      "num_children": 0,
      "author": 127738,
      "replies": []
    },
    {
      "id": "icm6vub",
      "text": "People who trust their children with religious leaders are negligent.",
      "timestamp": "2022-06-16 19:01:55",
      "score": 1,
      "num_children": 0,
      "author": 155322,
      "replies": []
    },
    {
      "id": "icm8mzt",
      "text": "You’re not wrong",
      "timestamp": "2022-06-16 19:14:01",
      "score": 1,
      "num_children": 0,
      "author": 354727,
      "replies": []
    },
    {
      "id": "icmajzf",
      "text": "Church leaders and politicians...what's the difference?",
      "timestamp": "2022-06-16 19:27:16",
      "score": 1,
      "num_children": 0,
      "author": 323222,
      "replies": []
    },
    {
      "id": "icmc0nc",
      "text": "Well #notallchristians they are the shield they can hide behind cause your punishing the lot for the few (even though they do that on the regular)",
      "timestamp": "2022-06-16 19:37:35",
      "score": 1,
      "num_children": 0,
      "author": 153938,
      "replies": []
    },
    {
      "id": "icmi9al",
      "text": "The one thing is an institutionalized basically every day occurance with tonnes of peer pressure the other is a quick to withdraw from gig. These are not the same things.... You could compare the Mormon thing the katholic thing that is both institutionalized basically every day occurance with tonnes of peer pressure..... This is nuts...",
      "timestamp": "2022-06-16 20:27:52",
      "score": 1,
      "num_children": 0,
      "author": 215262,
      "replies": []
    },
    {
      "id": "icmo2su",
      "text": "What do you expect from people who follow a religion founded by a 14 year old psychopath",
      "timestamp": "2022-06-16 21:09:02",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "icmo4v6",
      "text": "fight me. the whole concept of christianity is a coverup for allowing these fiends close to your kids, by gaining your trust, giving you false, frightening you with talks of damnation and using the whole motif as a disguise to gain access to your kids. Those who think otherwise are expected to think otherwise because that's the point of their lies.. to deiceive. and it is a success.",
      "timestamp": "2022-06-16 21:09:27",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "icmpci2",
      "text": "Word for word the same post as on twoxchromosones…",
      "timestamp": "2022-06-16 21:18:11",
      "score": 1,
      "num_children": 0,
      "author": 225772,
      "replies": []
    },
    {
      "id": "icmq8ah",
      "text": "Can I cross post this to r/exmormon",
      "timestamp": "2022-06-16 21:24:27",
      "score": 1,
      "num_children": 0,
      "author": 211184,
      "replies": []
    },
    {
      "id": "icmrhy5",
      "text": "I said this elsewhere (thinking it was atheism sub) but Ill copy here as well:\n\nJust to clarify, doesnt discount any of the points made or change the overall problem here, but calling a \"primary leader\" who is just literally some random member of the congregation, a \"church leader\" is a bit misleading. They arent in charge of really anything beyond some person that volunteered to lead the kids in songs and given a list of talking points or whatever they go over before the kids split into age group classes. Everyone is assigned little roles to help or given a class to lead thru a pre set lesson so its not any type of leadership in the church at all even on a local level. They only deal with like less than an hour of time with the kids on Sunday.\n\nThis does however worryingly bring up questions of why and when were there sleep overs at all. Was it one of his kids that they had sleepovers for and parents figured obviously there should be no issue. Which argues a point that there are consequences to just letting anyone have some kind of role especially over children when theres no application or real interview process or background check. Plus that even non leadership members of the church cant be trusted.\n\nThis doesnt change the fact that churches are prone to, known for, and much more likely than seemingly any other group to take advantage of and abuse minors. Or that I absolutely would love to see christian teachers, youth leaders, or any type of leadership or management role questioned on how we could trust them around our children given their history. Just prefer to be accurate in accusations so they arent then fact checked and used as some kind of proof against claims of immoral and illegal activities because they were just slightly inaccurate. Wouldnt want to be the same as the crazy christian claims they just make up out of nothing like morons.",
      "timestamp": "2022-06-16 21:33:35",
      "score": 1,
      "num_children": 0,
      "author": 350517,
      "replies": []
    },
    {
      "id": "icmu545",
      "text": "There are bad people everywhere. No matter their identity\n\nIf your point is you want to use whatever bathroom you want make a post about that as well. \n\nAbuse is serious and it's kinda making light of the victims situation clumping these two things together",
      "timestamp": "2022-06-16 21:52:40",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "icmwd4g",
      "text": "As if they give a literal crap about when we are actually assaulted.",
      "timestamp": "2022-06-16 22:08:58",
      "score": 1,
      "num_children": 0,
      "author": 278027,
      "replies": []
    },
    {
      "id": "icn6tka",
      "text": "Watch ‘Keep Sweet: Pray & Obey’ on Netflix. Same type of shit, so extremely fucked up",
      "timestamp": "2022-06-16 23:29:10",
      "score": 1,
      "num_children": 0,
      "author": 204014,
      "replies": []
    },
    {
      "id": "icn797z",
      "text": "Egfuckingzactly! The projection from the most evil finger wagging scum is absolutely out of control!",
      "timestamp": "2022-06-16 23:32:42",
      "score": 1,
      "num_children": 0,
      "author": 225964,
      "replies": []
    },
    {
      "id": "icn98yu",
      "text": "They’ll just blame the devil instead of the fact that these people are child abusers/rapists.",
      "timestamp": "2022-06-16 23:49:08",
      "score": 1,
      "num_children": 0,
      "author": 104107,
      "replies": []
    },
    {
      "id": "icnjlxt",
      "text": "Can I get a T-shirt or bumper sticker to the effect of \"ban priests from bathrooms\"?",
      "timestamp": "2022-06-17 01:16:28",
      "score": 1,
      "num_children": 0,
      "author": 104082,
      "replies": []
    },
    {
      "id": "icnnye7",
      "text": "There's alot of posts popping up like this. I know it's intended to call out hypocrisy, but cumulative tone carries whiff of inferring a link between religion / the church to paedophilia. Is pointing at a priest and shouting Child Molester so far removed from crying Witch at a woman, or yelling Mugger when you see a black man?",
      "timestamp": "2022-06-17 01:50:36",
      "score": 1,
      "num_children": 1,
      "author": 365939,
      "replies": [
        {
          "id": "icpocs0",
          "text": "It's hilarious that one of your attempted counter examples just drags up another crime of the church.\n\nCare to try again and come up with a better defense for an organization that systematically hides and protects those who are guilty of raping children?",
          "timestamp": "2022-06-17 14:26:07",
          "score": 1,
          "num_children": 2,
          "author": 80514,
          "replies": [
            {
              "id": "icq57gm",
              "text": "I was just asking the question.\nAll large organisations are susceptible to corruption: governments, political parties, unions, hospitals, schools, media, etc. People close ranks or turn a blind eye. You need structures in place to protect against it. It's only gradually the west has developed the necessary regulatory and legal frameworks to promote fair practise and protect against corruption. It's a very recent development that we've begun to demand much higher expectations of our institutions.\n\nReligions have been guilty of great many things, no doubt, but to insinuate that paedophilia is a problem systemic to the church, rather than one of individuals that churches made the mistake of covering up (largely before child sexual abuse was something society discussed or acknowledged), I think it's wrong.\n\nYou and I may well share many similar political outlooks, but it worries me that the tone of debate is toxic and enflamatory. Its so easy for people to launch angry, ill-thought and insulting posts with little regard to the possibility that it really only serves to feed resentment and suspicion in what is a deeply devisive and damaging culture war. The left has engaged in a race to the bottom and, frankly, should bare its fair share responsibility for helping to create a climate in which a man like Trump is able to be elected leader of the free world. That didn't happen in a vacuum, it happened in a cauldron...",
              "timestamp": "2022-06-17 15:50:45",
              "score": 1,
              "num_children": 0,
              "author": 365939,
              "replies": []
            },
            {
              "id": "icq6sju",
              "text": "I was just asking the question.\nAll large organisations are susceptible to corruption: governments, political parties, unions, hospitals, schools, media, etc. People close ranks or turn a blind eye. You need structures in place to protect against it. It's only gradually the west has developed the necessary regulatory and legal frameworks to promote fair practise and protect against corruption. It's a very recent development that we've begun to demand much higher expectations of our institutions.\n\nReligions have been guilty of great many things, no doubt, but to insinuate that paedophilia is a problem systemic to the church, rather than one of individuals that churches made the mistake of covering up (largely before child sexual abuse was something society discussed or acknowledged), I think it's wrong.\n\nYou and I may well share many similar political outlooks, but it worries me that the tone of debate is toxic and enflamatory. Its so easy for people to launch angry, ill-thought and insulting posts with little regard to the possibility that it really only serves to feed resentment and suspicion in what is a deeply devisive and damaging culture war. The left has engaged in a race to the bottom and, frankly, should bare its fair share responsibility for helping to create a climate in which a man like Trump is able to be elected leader of the free world. That didn't happen in a vacuum, it happened in a cauldron.\n\nYou slowly, slowly catch the tiger; and certainly not by starting a fight with him...",
              "timestamp": "2022-06-17 15:58:34",
              "score": 1,
              "num_children": 0,
              "author": 365939,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ico22tu",
      "text": "Ban church",
      "timestamp": "2022-06-17 03:42:24",
      "score": 1,
      "num_children": 0,
      "author": 49081,
      "replies": []
    },
    {
      "id": "ico5qn2",
      "text": "Fuck religion. Be a good human.",
      "timestamp": "2022-06-17 04:15:36",
      "score": 1,
      "num_children": 0,
      "author": 330116,
      "replies": []
    },
    {
      "id": "icoa4m7",
      "text": "Le Reddit moment",
      "timestamp": "2022-06-17 04:59:04",
      "score": 1,
      "num_children": 0,
      "author": 63489,
      "replies": []
    },
    {
      "id": "icobbfe",
      "text": "The cock they know versus the cock they don't? \n\nIn all seriousness, how anyone defends this is beyond me.",
      "timestamp": "2022-06-17 05:11:32",
      "score": 1,
      "num_children": 0,
      "author": 317249,
      "replies": []
    },
    {
      "id": "icobh3j",
      "text": "While I am not a fan of the Mormon Church my initial thought was Anecdotes are not statistics. During the Catholic preist debacle it was discovered that Catholic priests were half as likely to molest children as teachers and police officers..statistically.",
      "timestamp": "2022-06-17 05:13:14",
      "score": 1,
      "num_children": 0,
      "author": 80077,
      "replies": []
    },
    {
      "id": "icocko5",
      "text": "Or from sleepovers",
      "timestamp": "2022-06-17 05:25:09",
      "score": 1,
      "num_children": 0,
      "author": 355502,
      "replies": []
    },
    {
      "id": "icodfr6",
      "text": "Suppose its also a numbers game as there are more religous folk then trans people what you need to do is find the average % of sexual abusers between the 2 to get solid data.",
      "timestamp": "2022-06-17 05:34:48",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "icof4wd",
      "text": "Another good wholesome christian caught diddling kids: New at 11. \n\nWhy am I not shocked??\n\nOf course kids are safer in the bathroom with trans folks, they typically aren't christian.\n\nThe religious right are the only ones warning about how gay and trans people will victimize children or kidnap them and sell them into human trafficking.\n\nAny time you hear a chrisitian or one of these repu  errrr fascists accusing others of doing something horrible, you can be assured that they are in fact the ones doing those horrible things instead.\n\nProjection of \"sin\" is the entire first hundred pages of their playbook.",
      "timestamp": "2022-06-17 05:54:14",
      "score": 1,
      "num_children": 0,
      "author": 140750,
      "replies": []
    },
    {
      "id": "icogg05",
      "text": "Crucify him",
      "timestamp": "2022-06-17 06:09:54",
      "score": 1,
      "num_children": 0,
      "author": 262382,
      "replies": []
    },
    {
      "id": "icoiou7",
      "text": "This isn’t even close to the worst thing the Mormon church has done either. I live in Utah and have to go to the church for my mom, mainly so her and my dad don’t feel embarrassed. Kinda sucks. If you rape somebody”God will forgive you”. Also the church has a huge history of racism and other shit like that. I can’t even with Christianity, let alone Mormonism",
      "timestamp": "2022-06-17 06:37:59",
      "score": 1,
      "num_children": 0,
      "author": 324969,
      "replies": []
    },
    {
      "id": "icosbsz",
      "text": "Why do you think Leviticus 18 22 changed with King James Bible in 1953 to ban \"lieth with men\" instead of the traditional \"lieth with young men\"?   \n       \nChurch vastly prefers paedophiles to homosexuality.",
      "timestamp": "2022-06-17 08:53:17",
      "score": 1,
      "num_children": 0,
      "author": 10733,
      "replies": []
    },
    {
      "id": "icotzk4",
      "text": "Mormons, Southern Baptists, Catholics, Episcopalians… why do they all have child sex abuse in common? 🤔",
      "timestamp": "2022-06-17 09:18:22",
      "score": 1,
      "num_children": 1,
      "author": 358252,
      "replies": [
        {
          "id": "icpnotx",
          "text": "Repressive sexual morals,\n\nthe idea that all sins are equally bad,\n\nmassive imbalances of power between the clergy and everybody else,\n\nand an intrinsic need of the system to uphold the idea that it cannot ever do, or be, wrong.",
          "timestamp": "2022-06-17 14:21:20",
          "score": 2,
          "num_children": 0,
          "author": 80514,
          "replies": []
        }
      ]
    },
    {
      "id": "icox97k",
      "text": "Or banning children from church… just what is happening in their unregulated Sunday “schools?”",
      "timestamp": "2022-06-17 10:05:15",
      "score": 1,
      "num_children": 0,
      "author": 395216,
      "replies": []
    },
    {
      "id": "icp99za",
      "text": "As an r/exmormon, none of this shocks me, sadly.",
      "timestamp": "2022-06-17 12:23:28",
      "score": 1,
      "num_children": 0,
      "author": 13863,
      "replies": []
    },
    {
      "id": "id8mzsb",
      "text": "The evil thug is going to enjoy prison.\n\nAnd by enjoy, I mean not enjoy. And he is going to wish for a millstone at the judgement bar.\n\n\"Primary Teacher\" isn't a \"leader\" in anyone's imagination. \n\nAnd the idiots and morons screaming about trans humans being a threat to kids need to look in the mirror.",
      "timestamp": "2022-06-21 23:15:55",
      "score": 1,
      "num_children": 0,
      "author": 363289,
      "replies": []
    },
    {
      "id": "igjs0xr",
      "text": "5-6% of all people are child sexual predators.  I say this to combat people who want us to look only at certain “types” of people as possible perpetrators, ie clergy, homosexuals, etc.   it’s 5-6% of all people. Do not mislead people.\n\nIt is true to say that the betrayal is greater, the harm caused is greater when these heinous acts are committed by those whom we trust.  The greater the level of trust…such as in clergy/religious, the greater the betrayal and harm.",
      "timestamp": "2022-07-17 18:55:50",
      "score": 1,
      "num_children": 0,
      "author": 135270,
      "replies": []
    },
    {
      "id": "icl9l4r",
      "text": "‘Primary Teacher’ isn’t exactly leadership track. It’s more like, “Hey useless, babysit some kids while the adults do Bible study in peace.” It’s a during-church-service task.\n\nAlso, that job normally has nothing to do with ‘sleepovers’. I don’t remember any Church-sanctioned overnight events for Primary age kids…. ever.\n\nThe ‘church leaders’ headline is misleading. Whoever let this dude host primary sleepovers is way outta line, but he isn’t a leader.",
      "timestamp": "2022-06-16 15:12:26",
      "score": -9,
      "num_children": 1,
      "author": 49354,
      "replies": [
        {
          "id": "icncc08",
          "text": "Still a leader. And nothing was said about church sleepovers. \n\nA primary teacher is still a leadership role.",
          "timestamp": "2022-06-17 00:15:02",
          "score": 1,
          "num_children": 1,
          "author": 186012,
          "replies": [
            {
              "id": "icneod6",
              "text": "“The abuse occurred during sleepovers at the home of Sean Sund, 49, between January and March of 2018…Court records show that Sund told detectives that he frequently hosted sleepovers for children from his ward.”\n\nIt says *something* about sleepovers. It isn’t clear if he just invited kids over he knew from church, if he invited them as a church function without permission of leadership, or at what level this was approved.",
              "timestamp": "2022-06-17 00:34:52",
              "score": 1,
              "num_children": 1,
              "author": 49354,
              "replies": [
                {
                  "id": "icnnop3",
                  "text": "Sleepovers are super common in Mormon communities. And the church has never to my knowledge sponsored them. \n\nIt's a sleepover. His kids knew other kids and they came over. Have you never had a sleepover?",
                  "timestamp": "2022-06-17 01:48:32",
                  "score": 1,
                  "num_children": 0,
                  "author": 186012,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "icnrr6c",
      "text": "I'm all for equal rights, and that includes Trans rights, but please don't equate atheism with being transgender.",
      "timestamp": "2022-06-17 02:20:08",
      "score": -3,
      "num_children": 0,
      "author": 408349,
      "replies": []
    },
    {
      "id": "icn2h33",
      "text": "[removed]",
      "timestamp": "2022-06-16 22:54:42",
      "score": -4,
      "num_children": 2,
      "replies": [
        {
          "id": "icn2qgj",
          "text": "Trans people aren't grooming kids",
          "timestamp": "2022-06-16 22:56:45",
          "score": 5,
          "num_children": 1,
          "author": 267885,
          "replies": [
            {
              "id": "icn97d7",
              "text": "[removed]",
              "timestamp": "2022-06-16 23:48:46",
              "score": -6,
              "num_children": 1,
              "replies": [
                {
                  "id": "icnaii7",
                  "text": "Drag does not equal trans, and drag shows are not inherently sexual.  Here's a good video explaining the situation you're referring to. https://www.youtube.com/watch?v=pIlT4LpeFPU",
                  "timestamp": "2022-06-16 23:59:43",
                  "score": 5,
                  "num_children": 1,
                  "author": 267885,
                  "replies": [
                    {
                      "id": "icnclsc",
                      "text": "[removed]",
                      "timestamp": "2022-06-17 00:17:22",
                      "score": -6,
                      "num_children": 3,
                      "replies": [
                        {
                          "id": "icncxqr",
                          "text": "And there's the transphobia.  It was a family-friendly event.  There were no kids putting money into thongs.",
                          "timestamp": "2022-06-17 00:20:11",
                          "score": 4,
                          "num_children": 1,
                          "author": 267885,
                          "replies": [
                            {
                              "id": "icnf6hr",
                              "text": "[removed]",
                              "timestamp": "2022-06-17 00:39:12",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "icnh686",
                                  "text": "[removed]",
                                  "timestamp": "2022-06-17 00:56:07",
                                  "score": -1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "icoxl0b",
                                      "text": "You are wrong.",
                                      "timestamp": "2022-06-17 10:09:49",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 286151,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "icoqoa5",
                          "text": "Your disagreement is objectively wrong.",
                          "timestamp": "2022-06-17 08:28:43",
                          "score": 1,
                          "num_children": 0,
                          "author": 79577,
                          "replies": []
                        },
                        {
                          "id": "icoxk4n",
                          "text": "Yet again, drag shows and trans people are two completely different things.",
                          "timestamp": "2022-06-17 10:09:29",
                          "score": 1,
                          "num_children": 0,
                          "author": 286151,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "icnqcl6",
          "text": "Why do kids need protection from transgender people?",
          "timestamp": "2022-06-17 02:09:08",
          "score": 4,
          "num_children": 1,
          "author": 186012,
          "replies": [
            {
              "id": "icocual",
              "text": "[removed]",
              "timestamp": "2022-06-17 05:28:07",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "icn9eav",
      "text": "How about kids shouldn't be around either.  It doesn't have to be one or the other.",
      "timestamp": "2022-06-16 23:50:21",
      "score": -4,
      "num_children": 1,
      "author": 303179,
      "replies": [
        {
          "id": "icnk8jd",
          "text": "How about you don't pretend they're the same? It's disingenuous.",
          "timestamp": "2022-06-17 01:21:35",
          "score": 5,
          "num_children": 0,
          "author": 318636,
          "replies": []
        }
      ]
    },
    {
      "id": "icmwb36",
      "text": "I just keep my kid from most churches and most transgendered. Fuck all the flavors of groomers. I don’t care what adults do, your business and not mine. The line is drawn at kids. Especially mine.",
      "timestamp": "2022-06-16 22:08:33",
      "score": -8,
      "num_children": 1,
      "author": 187260,
      "replies": [
        {
          "id": "icnid11",
          "text": "Why not just say you keep them away from all strangers? Predators come in all forms.",
          "timestamp": "2022-06-17 01:06:06",
          "score": 5,
          "num_children": 1,
          "author": 386694,
          "replies": [
            {
              "id": "ico6xnm",
              "text": "True. I was replying to the context of the thread. It’s not that she’s hidden from the world out of fear. She’s encouraged to explore the world but it’s my responsibility to ensure her safety. She has gay family members and occasionally goes to church, but with vetted people. People I trust, who sometimes are gay or active church attendants.",
              "timestamp": "2022-06-17 04:26:55",
              "score": -3,
              "num_children": 0,
              "author": 187260,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "icm1mee",
      "text": "They should ban both. For the kids.",
      "timestamp": "2022-06-16 18:25:57",
      "score": -9,
      "num_children": 1,
      "author": 36180,
      "replies": [
        {
          "id": "icm9bvf",
          "text": "Why both?",
          "timestamp": "2022-06-16 19:18:47",
          "score": 2,
          "num_children": 1,
          "author": 410714,
          "replies": [
            {
              "id": "icmd5cj",
              "text": "People both are bad for kids. In the long run.",
              "timestamp": "2022-06-16 19:45:26",
              "score": -6,
              "num_children": 2,
              "author": 36180,
              "replies": [
                {
                  "id": "icmdvsb",
                  "text": "I fail to see why a transgender person would have a negative impact on a child, in the long or short run. If you know a reason please enlighten me.",
                  "timestamp": "2022-06-16 19:50:39",
                  "score": 4,
                  "num_children": 0,
                  "author": 410714,
                  "replies": []
                },
                {
                  "id": "icmdwef",
                  "text": "I fail to see why a transgender person would have a negative impact on a child, in the long or short run. If you know a reason please enlighten me.",
                  "timestamp": "2022-06-16 19:50:46",
                  "score": 4,
                  "num_children": 1,
                  "author": 410714,
                  "replies": [
                    {
                      "id": "icmptta",
                      "text": "Not the person. but the need to get children understand something the adults can't even explain without sounding insane. If you cannot even give a definition of what a woman is without circular thinking.",
                      "timestamp": "2022-06-16 21:21:36",
                      "score": -9,
                      "num_children": 1,
                      "author": 36180,
                      "replies": [
                        {
                          "id": "icoqj2c",
                          "text": "You're a woman if you trully feel like one. That's it. That's how gender works.",
                          "timestamp": "2022-06-17 08:26:34",
                          "score": 3,
                          "num_children": 0,
                          "author": 79577,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "icmd0af",
      "text": "[removed]",
      "timestamp": "2022-06-16 19:44:27",
      "score": -13,
      "num_children": 1,
      "replies": [
        {
          "id": "icnqfs9",
          "text": "Please, that's not at all what's being said and you know it.",
          "timestamp": "2022-06-17 02:09:50",
          "score": 1,
          "num_children": 0,
          "author": 186012,
          "replies": []
        }
      ]
    },
    {
      "id": "icli6fq",
      "text": "[removed]",
      "timestamp": "2022-06-16 16:13:02",
      "score": -13,
      "num_children": 5,
      "replies": [
        {
          "id": "iclxmue",
          "text": "This rant was incoherent",
          "timestamp": "2022-06-16 17:58:29",
          "score": 7,
          "num_children": 0,
          "author": 238844,
          "replies": []
        },
        {
          "id": "iclzz2p",
          "text": "I've noticed this argument a lot on Reddit from people who try to defend the insane amounts of sex abuse that goes on in religious institutions. It's always \"what about the schools!!!!\" As if that somehow excuses what we see from religious institutions.\n\nFirst, we can worry about both things. The \"left\" has spent the last 3 weeks yelling about safety in schools and the sickening rise of school shootings and how to prevent them and how useless the police officers were and how the system needs to be reformed. So I don't think where this idea that nobody ever talks about schools comes from.\n\nSecond, the vast majority of people support making school officials mandatory reporters of abuse, strict background checks, teaching kids on how to identify and report abuse. And if you have more ideas that should be instituted, I guarantee you nobody in this subreddit will tell you \"how dare you try to make schools safer when there's so much abuse going on in religions institutions.\" People can recognize that you can take care of multiple problems in multiple areas.\n\nThird, this is the athiesm suibreddit, not the education subreddit. Why would you expect people here to concentrate on abuse in schools? Do you think the abuse that goes on in religious institutions is nothing to worry about?\n\nFourth, unlike schools, religious institutions have been dragging their feet an hiding behind their religious rights to oppose being held accountable and prevent any change that would help sex abuse victims.",
          "timestamp": "2022-06-16 18:14:35",
          "score": 3,
          "num_children": 0,
          "author": 5257,
          "replies": []
        },
        {
          "id": "icm0g96",
          "text": ">The left is full of the worst arguments that can possibly be made on any given subject. \n\n\n>Why dont we just ban public schools?\n\nYeah idk what \"left\" you're talking about but perhaps you should look in a mirror",
          "timestamp": "2022-06-16 18:17:54",
          "score": 3,
          "num_children": 0,
          "author": 118985,
          "replies": []
        },
        {
          "id": "icm2l2r",
          "text": "Do schools claim to be the ultimate moral authority as dictated by the almighty god?",
          "timestamp": "2022-06-16 18:32:34",
          "score": 2,
          "num_children": 0,
          "author": 286151,
          "replies": []
        },
        {
          "id": "icmc9qo",
          "text": "Church isn’t voluntary for children.",
          "timestamp": "2022-06-16 19:39:22",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iclj8hy",
      "text": "[removed]",
      "timestamp": "2022-06-16 16:20:13",
      "score": -7,
      "num_children": 2,
      "replies": [
        {
          "id": "icm0guu",
          "text": "Your kids can be in danger around anyone in bathrooms regardless of their identity. Saying \"well this institution bans trans women from the women's bathrooms so my kids must be safe there\" is stupid.\n\nReminds me of the South Park episode where the parents got rid of Big Gay Al as a scout leader and brought in a manly conservative-like guy who turned out to be the real pedo.",
          "timestamp": "2022-06-16 18:18:02",
          "score": 4,
          "num_children": 0,
          "author": 5257,
          "replies": []
        },
        {
          "id": "icm9nvw",
          "text": "There is nothing about a person being transgender that makes them a threat to a child.",
          "timestamp": "2022-06-16 19:21:03",
          "score": 3,
          "num_children": 0,
          "author": 410714,
          "replies": []
        }
      ]
    },
    {
      "id": "iclqfne",
      "text": "What does child abuse churches have to do with transgender people?",
      "timestamp": "2022-06-16 17:09:35",
      "score": -13,
      "num_children": 1,
      "author": 54401,
      "replies": [
        {
          "id": "iclqrnw",
          "text": "Having religious folks continuously push for fear of peoples sexual orientation as sexually dangerous when there's so much sexual abuse coming from religious folks themselves.",
          "timestamp": "2022-06-16 17:11:53",
          "score": 11,
          "num_children": 1,
          "author": 341136,
          "replies": [
            {
              "id": "iclrlsc",
              "text": "Sure, but most religious folks aren’t child molesters. Just like most LGBT people aren’t. \n\nAnd there is a statistically insignificant portion of both groups that are abusers. But it’s disingenuous to let their actions label a group. \n\nI don’t like nor agree with organized religion, but it’s been here way longer than I have. And I don’t see it going anywhere.",
              "timestamp": "2022-06-16 17:17:38",
              "score": -10,
              "num_children": 2,
              "author": 54401,
              "replies": [
                {
                  "id": "icm08q9",
                  "text": "I think the argument is that they shouldn't be casting any stones given the skeletons in their closets.\n\nAlso, no. This isn't a case of isolated incidents. Every group on the planet may have child molesters but not all have pervasive systemic sex abuse where the victims are silenced, evidence is kept secret, and the offenders moved around to escape prosecution. In so many cases where I've seen sex abuse in religious institutions, there has almost always been a web involved a whole lot of people covering it up and preventing the police from finding out.",
                  "timestamp": "2022-06-16 18:16:27",
                  "score": 5,
                  "num_children": 0,
                  "author": 5257,
                  "replies": []
                },
                {
                  "id": "iclw9km",
                  "text": "True however I think this may be referring to how often we hear about sexual abuse in the news coming from religious groups opposed to how often you hear about sexual abuse coming from LGBT individuals/ groups. Not saying it doesn't happen everywhere, media makes it seems more prevalant in religious groups.",
                  "timestamp": "2022-06-16 17:49:10",
                  "score": 3,
                  "num_children": 0,
                  "author": 341136,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "icoudoe",
      "text": "We can ban both…",
      "timestamp": "2022-06-17 09:24:01",
      "score": -1,
      "num_children": 0,
      "author": 276475,
      "replies": []
    },
    {
      "id": "ie2sy4j",
      "text": "[removed]",
      "timestamp": "2022-06-28 17:11:51",
      "score": -1,
      "num_children": 2,
      "replies": [
        {
          "id": "ie2tf7p",
          "text": "They believe in the divinity and teachings of Jesus Christ, which makes them Christians.",
          "timestamp": "2022-06-28 17:14:59",
          "score": 1,
          "num_children": 1,
          "author": 318636,
          "replies": [
            {
              "id": "ie2tmmh",
              "text": "[removed]",
              "timestamp": "2022-06-28 17:16:21",
              "score": 1,
              "num_children": 2,
              "replies": [
                {
                  "id": "ie2v0vd",
                  "text": "I have studied Mormonism, and Christianity. Being a liar, con artist, and child rapist is not a disqualification from being Christian.",
                  "timestamp": "2022-06-28 17:25:31",
                  "score": 1,
                  "num_children": 1,
                  "author": 318636,
                  "replies": [
                    {
                      "id": "ie2vnb1",
                      "text": "[removed]",
                      "timestamp": "2022-06-28 17:29:42",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ie3gzq0",
                          "text": "Yes, I have. I've read the Old Testament as well, which you seem to have missed. Mary was a child when God impregnated her. God Himself commits a bunch of atrocities in the OT.\n\n>I’ve actually been banned from going into Mormon churches.\n\nI can believe that.",
                          "timestamp": "2022-06-28 19:51:21",
                          "score": 1,
                          "num_children": 1,
                          "author": 318636,
                          "replies": [
                            {
                              "id": "ie3ho9z",
                              "text": "[removed]",
                              "timestamp": "2022-06-28 19:55:46",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "ie42rqd",
                                  "text": "Let's see... Drowning everyone. Killing kids for insulting a prophet. He destroyed Sodom and Gomorrah. He killed the firstborn of the Egyptians and killed seventy thousand Israelites. He supposedly ordered the murder and rape of civilians many times. He endorses sex slavery and regular slavery type slavery. Oh, and there's the general order to murder all homosexuals.",
                                  "timestamp": "2022-06-28 22:20:49",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 318636,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ie4sp3f",
                  "text": "You are approaching the argument as if it’s a forgone conclusion that Jesus and Satan are real and that the Bible is some holy infallible absolute truth. Not everyone believes that. Especially on this sub. What you are saying is like your opinion man. Your argument has about as much authority as a Mormon’s – which is zero.",
                  "timestamp": "2022-06-29 01:44:28",
                  "score": 1,
                  "num_children": 0,
                  "author": 60116,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ie4s0jh",
          "text": "Spoiler alert. The Bible was specifically written to manipulate and control people by religious leaders who are ALL phony. Don’t act like your Evangrlical shit doesn’t stink. You are just as duped as the Mormons, but whatever…",
          "timestamp": "2022-06-29 01:38:55",
          "score": 1,
          "num_children": 1,
          "author": 60116,
          "replies": [
            {
              "id": "ie4skl1",
              "text": "[removed]",
              "timestamp": "2022-06-29 01:43:25",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ie4v689",
                  "text": "Who told you it wasn’t? Let me guess? God? LOL.",
                  "timestamp": "2022-06-29 02:04:24",
                  "score": 1,
                  "num_children": 0,
                  "author": 60116,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}