{
  "id": "vjvlah",
  "text": "Friendly reminder that if management found u lied during a job interview about an established policy, u'd be fired immediately\n",
  "timestamp": "2022-06-24 18:53:32",
  "score": 4161,
  "subreddit": "t5_3fdcn",
  "num_children": 52,
  "author": 392603,
  "replies": [
    {
      "id": "idleen2",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-06-24 18:53:32",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "idlh7et",
      "text": "All 4 should be IMPEACHED.",
      "timestamp": "2022-06-24 19:12:09",
      "score": 316,
      "num_children": 5,
      "author": 184924,
      "replies": [
        {
          "id": "idm64p9",
          "text": "Two of them have been accused sex offenders.",
          "timestamp": "2022-06-24 22:02:51",
          "score": 106,
          "num_children": 3,
          "author": 413406,
          "replies": [
            {
              "id": "idmnqay",
              "text": "another belonged to a religious cult that only sees women as baby making objects and literally had the title of \"Handmaiden\" for certain women.",
              "timestamp": "2022-06-25 00:17:38",
              "score": 84,
              "num_children": 1,
              "author": 93212,
              "replies": [
                {
                  "id": "idmwo2x",
                  "text": "Ofjesse.",
                  "timestamp": "2022-06-25 01:29:50",
                  "score": 18,
                  "num_children": 0,
                  "author": 354546,
                  "replies": []
                }
              ]
            },
            {
              "id": "idnll29",
              "text": "The Nazis don't care as long as they're on their team.\n\nTrump proved that already.",
              "timestamp": "2022-06-25 05:16:25",
              "score": 14,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "idmz5k5",
              "text": "Yeah so absolute heroes to the right.",
              "timestamp": "2022-06-25 01:50:08",
              "score": 10,
              "num_children": 0,
              "author": 83475,
              "replies": []
            }
          ]
        },
        {
          "id": "idlrajj",
          "text": "Please. At least one of them will be President soon. Guaranteed. They're heroes to the fascists in the GQP.",
          "timestamp": "2022-06-24 20:19:40",
          "score": 106,
          "num_children": 1,
          "author": 54010,
          "replies": [
            {
              "id": "idot266",
              "text": "They would most likely have to resign from their lifelong SCOTUS position, which is a lot cushier than POTUS by most measures.",
              "timestamp": "2022-06-25 14:08:48",
              "score": 14,
              "num_children": 0,
              "author": 257687,
              "replies": []
            }
          ]
        },
        {
          "id": "idn1z8t",
          "text": "All of them could be, as the Democrats control the House.",
          "timestamp": "2022-06-25 02:13:25",
          "score": 10,
          "num_children": 1,
          "author": 268607,
          "replies": [
            {
              "id": "idnes2p",
              "text": "But none could be convicted, so it's not like this would change anything beyond making the GOP base love these assholes even more than they already do.\n\nDon't get me wrong, they should be impeached anyway. I'm just saying it won't make the slightest practical difference.",
              "timestamp": "2022-06-25 04:06:00",
              "score": 19,
              "num_children": 0,
              "author": 275941,
              "replies": []
            }
          ]
        },
        {
          "id": "idn4i48",
          "text": "[removed]",
          "timestamp": "2022-06-25 02:34:31",
          "score": 3,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "idqsrck",
          "text": "Plus Clarence Thomas for abetting the traitors with the January 6th insurrection.\n\nBut we'll only get there by voting Democratic for all congressional seats. No way they'd agree to it with the current lineup. Which is why it's important to fight the \"both sides are the same\" bullshit that seems so prevalent.",
          "timestamp": "2022-06-25 23:22:48",
          "score": 1,
          "num_children": 0,
          "author": 161320,
          "replies": []
        }
      ]
    },
    {
      "id": "idmbbxg",
      "text": "6 need to go.\n\n4 lied under oath about Roe v Wade\n\n1 participated in insurrection and also tried to obstruct the investigation\n\n1 received the position as a payoff for selecting a certain candidate\n\nThe worst part about having these activist judges legislating from the bench for life is that people now have an incentive to remove them from the bench in the worst way possible, as demonstrated by that false flag threat actor.",
      "timestamp": "2022-06-24 22:40:58",
      "score": 269,
      "num_children": 4,
      "author": 213701,
      "replies": [
        {
          "id": "idns5zc",
          "text": "They didn’t lie, per se- they *hedged*. And they weren’t asked the right question. We all knew it was settled law. The correct question they should have been forced to answer is, “Was Roe decided correctly?” “Do you think it’s a states right issue?” \n\nRoe *WAS* established…until it isn’t. We already knew it was settled. Of course they never had any intention of upholding it. But that wasn’t the question they were asked. \n\nThey were disingenuous and used legal speak to answer the question in such a way that *sounded* like they would continue to uphold it, but they didn’t really say they would. \n\nIt’s sneaky and cowardly. The least they could do is have the courage of their convictions.",
          "timestamp": "2022-06-25 06:34:38",
          "score": 75,
          "num_children": 2,
          "author": 10817,
          "replies": [
            {
              "id": "idod31q",
              "text": "That's what I've been warning people about. They all used \"weasel words.\" \"Roe is established law\" is not an answer about whether a given person would OVERTURN that established law. Fucking lie by omission. I knew they'd weasel out of upholding precedent.",
              "timestamp": "2022-06-25 11:29:13",
              "score": 30,
              "num_children": 0,
              "author": 389128,
              "replies": []
            },
            {
              "id": "idnsqmw",
              "text": "And the lesson is?",
              "timestamp": "2022-06-25 06:42:02",
              "score": 6,
              "num_children": 1,
              "author": 213701,
              "replies": [
                {
                  "id": "ido5k3w",
                  "text": "Your country is fucked",
                  "timestamp": "2022-06-25 09:44:30",
                  "score": 28,
                  "num_children": 1,
                  "author": 191739,
                  "replies": [
                    {
                      "id": "ignx8nf",
                      "text": "Fully, totally and absolutely!! Ugh!",
                      "timestamp": "2022-07-18 17:05:08",
                      "score": 1,
                      "num_children": 0,
                      "author": 268111,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "idnlmge",
          "text": "> people now have an incentive to remove them from the bench in the worst way possible\n\nWhat other options are there?",
          "timestamp": "2022-06-25 05:16:52",
          "score": 20,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "idnm7w4",
          "text": "Technically, none of those quotes are lies.\n“It’s an important precedent” doesn’t mean he won’t rule against it. It was an important precedent. All Supreme Court rulings are important precedents.\n“It’s the law of the land and I accept the law” doesn’t mean “I’ll vote against the law given an opportunity.” Laws change. \n“It’s settled as precedent” doesn’t mean “I won’t rule against it.”\n“It clearly held that the constitution gives women the right to terminate a pregnancy” is something off of Wikipedia, and not an admission that she won’t vote against it.\n\nIs this really the best that our senators could get out of these people? Sad.",
          "timestamp": "2022-06-25 05:23:27",
          "score": 28,
          "num_children": 1,
          "author": 372920,
          "replies": [
            {
              "id": "idntgyz",
              "text": "I was literally yelling at the TV. Democrats are feckless at best or colluding at worst.",
              "timestamp": "2022-06-25 06:51:40",
              "score": 19,
              "num_children": 1,
              "author": 371013,
              "replies": [
                {
                  "id": "idrdl5m",
                  "text": "Democrats are spineless cowards. Their entire idea of \"standing up to Republicans\" is  tiptoeing up to them, waiting politely for their attention, timidly asking \"Um, please, sir, may we have some civil rights?\", and then turning back to their colleagues and going \"We've tried everything they could possibly do\".\n\nI want Democrats to fight DIRTY. I want them to flood the airwaves with ads that just stop short of accusing their opponents of child molestation. I want Matt Gaetz's opponent to run an ad saying \"Matt Gaetz REPEATEDLY RAPED a 17 year old girl. Will Matt Gaetz target YOUR CHILD next?\". Republicans want to do the whole \"trans people are groomers\" thing? We've got WAY more material to work with than they do. I want to see Democrats get dirty, vulgar, crass, and just tiptoe up to the line of defamatory (though in some cases, it's just telling it like it is). \n\nLike a COVID anti-vaxxer and a Big Lie pusher, I want them to be constantly \"just asking questions\"? Why DID the Tennessee Republicans try to legalize child marriage? Which children specifically are they looking to marry? Republicans want to make abortion illegal even for a minor who is the victim of rape? Why ARE they trying to empower and encourage rapists to target children? Are the child rapists they embolden going to target YOUR CHILD next? Known Trump terrorist supporter Clarence Thomas listed a number of freedoms he wants to destroy. Is he coming for YOUR freedom next? I want these to be the contents of \"moderate\" Democratic ads. Republicans make ads implying that they are literally going to murder their opponents almost daily. I think shining a light on their perpetual child predation and attempt to wipe out American democracy is very reasonable.\n\n\"When they go low, we go high\" is a blueprint on how to let Nazis take over your country. It should be \"When they go low, we stop them into the ground like the maggots they are\".",
                  "timestamp": "2022-06-26 02:24:32",
                  "score": 1,
                  "num_children": 1,
                  "author": 322940,
                  "replies": [
                    {
                      "id": "idrfcil",
                      "text": "This is why I offered collusion as a possible explanation. There are nearly 300 democrats currently in congress. That is just congress and I like to stick to lower bounds. There is no way in hell that many people, most with law degrees, are this fucking naive. AOC is seen as the most \"radical\" and IMHO she is pretty tame and represents her generation pretty well, but even she shows tremendous restraint in attacking Republicans. Meanwhile, GOP members are constantly harassing her in the Capitol like middle school bullies. How can you look at this situation, look at what is happening in this country, and look at the GOP's behavior and think \"yeah, what we are doing is definitely working! It'll work out!\" Nah... not buying it.",
                      "timestamp": "2022-06-26 02:40:25",
                      "score": 2,
                      "num_children": 0,
                      "author": 371013,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "idov72n",
          "text": ">incentive to remove them from the bench in the worst way possible\n\nWon't happen. Assassination is an extremist way of dealing with people you disagree with, and the US doesn't have an extreme left, only an extreme right. If the SCOTUS overruled DC Vs Heller, they'd be dropping like flies.\n\nEdit: clarification",
          "timestamp": "2022-06-25 14:26:23",
          "score": 3,
          "num_children": 1,
          "author": 400913,
          "replies": [
            {
              "id": "idqkqqd",
              "text": "True, but we also have a greater wealth disparity than during the French revolution. Also, republicans are threatening to murder their own \"rinos\" so we cannot rule out the usual right-wing terrorists.",
              "timestamp": "2022-06-25 22:17:41",
              "score": 2,
              "num_children": 1,
              "author": 213701,
              "replies": [
                {
                  "id": "if2cdde",
                  "text": "Ah yes, then blame it on Antifa.",
                  "timestamp": "2022-07-06 12:08:58",
                  "score": 2,
                  "num_children": 0,
                  "author": 400913,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "idlq63q",
      "text": "There will be a general strike starting this coming week 27th. Help spread the word:\n\n[Save this.](https://i.imgur.com/EUtze9C.png) Print as many as you can. Post it on every telephone pole in your area.  \n\nMake your own, share them, give people a simple way to spread the word into the real world.\n\nCall off for a day or the whole week. Boycott unnecessary spending. Quit, whatever you can do to help amplify the effect.",
      "timestamp": "2022-06-24 20:12:12",
      "score": 184,
      "num_children": 2,
      "author": 123487,
      "replies": [
        {
          "id": "idlujry",
          "text": "[deleted]",
          "timestamp": "2022-06-24 20:41:39",
          "score": -7,
          "num_children": 2,
          "replies": [
            {
              "id": "idm4bt8",
              "text": "Not working one day is going to stop you from paying your mortgage?\n\nMaybe you should protest the fact that we live in a society that caused that too?\n\nYou can stand by and do nothing and no one will stop you. So why even comment this? Like who was this comment for?",
              "timestamp": "2022-06-24 21:49:54",
              "score": 47,
              "num_children": 1,
              "author": 362088,
              "replies": [
                {
                  "id": "idmascj",
                  "text": "Also if you were to lose everything after losing one day…. That isn’t really a system you should either be a part of nor defend",
                  "timestamp": "2022-06-24 22:36:56",
                  "score": 26,
                  "num_children": 0,
                  "author": 46683,
                  "replies": []
                }
              ]
            },
            {
              "id": "idm78tv",
              "text": "You own property, you're already doing better than a lot of us.",
              "timestamp": "2022-06-24 22:10:57",
              "score": 23,
              "num_children": 1,
              "author": 77215,
              "replies": [
                {
                  "id": "idm8mar",
                  "text": "Only because I got ridiculously lucky ten years ago, but I get what you're saying.",
                  "timestamp": "2022-06-24 22:20:58",
                  "score": -1,
                  "num_children": 0,
                  "author": 52387,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "idmwlgy",
          "text": "Quitting your job to own the Repugs.\n\nYeah, *that'll* show 'em. 😒",
          "timestamp": "2022-06-25 01:29:16",
          "score": -51,
          "num_children": 1,
          "author": 354546,
          "replies": [
            {
              "id": "idmyymk",
              "text": "Yeah, seriously. [Why bother.](https://blogs.loc.gov/law/2022/03/kvennafridagurinn-the-day-icelandic-women-went-on-strike/)",
              "timestamp": "2022-06-25 01:48:33",
              "score": 14,
              "num_children": 1,
              "author": 32386,
              "replies": [
                {
                  "id": "idn1mo5",
                  "text": "1. Going on strike is different from quitting your job.\n\n2. If you quit your job, what will you do for money?",
                  "timestamp": "2022-06-25 02:10:31",
                  "score": -23,
                  "num_children": 0,
                  "author": 354546,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "idlqn8x",
      "text": "Lying shit-heads. Are you really surprised?",
      "timestamp": "2022-06-24 20:15:19",
      "score": 25,
      "num_children": 1,
      "author": 354939,
      "replies": [
        {
          "id": "idlruzg",
          "text": "Oh, by no means. We all saw it coming",
          "timestamp": "2022-06-24 20:23:25",
          "score": 12,
          "num_children": 0,
          "author": 392603,
          "replies": []
        }
      ]
    },
    {
      "id": "idlh9fg",
      "text": "They should all be impeached and charged for lying under oath, isn't perjury a criminal offense?",
      "timestamp": "2022-06-24 19:12:31",
      "score": 117,
      "num_children": 3,
      "author": 109352,
      "replies": [
        {
          "id": "idluecl",
          "text": "They can claim to have had a change of heart. Whatever the case, it's the republicans who organize and get shit done. We just whine and waffle and wait for the problems to fix themselves. \n\nI'm a progressive and a registered Democrat, so understand that I'm saying this out of anger and frustration.",
          "timestamp": "2022-06-24 20:40:38",
          "score": 81,
          "num_children": 3,
          "author": 52387,
          "replies": [
            {
              "id": "idmjyb5",
              "text": "Not a lot that can be done when the people who vote the most in this country are the least educated and most hateful. Only way to really fix the problem without forcing the whole eligible population to vote is to enact ranked choice voting but the republicant's would never go for that as they'd lose practically all their power",
              "timestamp": "2022-06-24 23:47:18",
              "score": 16,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "idmwu60",
              "text": "> We just whine and waffle and wait for the problems to fix themselves.\n> \n> I'm a progressive and a registered Democrat, so understand that I'm saying this out of anger and frustration.\n\nI totally agree, and I share your anger and frustration.",
              "timestamp": "2022-06-25 01:31:11",
              "score": 9,
              "num_children": 2,
              "author": 354546,
              "replies": [
                {
                  "id": "idmyzab",
                  "text": "Thanks, friend.",
                  "timestamp": "2022-06-25 01:48:42",
                  "score": 3,
                  "num_children": 1,
                  "author": 52387,
                  "replies": [
                    {
                      "id": "idn0olh",
                      "text": "You're welcome!",
                      "timestamp": "2022-06-25 02:02:45",
                      "score": 3,
                      "num_children": 0,
                      "author": 354546,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "idnljp4",
                  "text": "We could pack the court.\nSeriously!",
                  "timestamp": "2022-06-25 05:15:59",
                  "score": 2,
                  "num_children": 1,
                  "author": 201659,
                  "replies": [
                    {
                      "id": "idpqrc7",
                      "text": "I wish the Dems had the balls to do it.",
                      "timestamp": "2022-06-25 18:23:28",
                      "score": 2,
                      "num_children": 1,
                      "author": 354546,
                      "replies": [
                        {
                          "id": "idprmm2",
                          "text": "There’s no reason not to!\n“Oh the republicans will just take control later and do the same thing!”\n\nOk, so if that’s the problem, that puts us right back where we are right _now_.",
                          "timestamp": "2022-06-25 18:30:10",
                          "score": 2,
                          "num_children": 1,
                          "author": 201659,
                          "replies": [
                            {
                              "id": "idprw7w",
                              "text": "> There’s no reason not to! “Oh the republicans will just take control later and do the same thing!”\n\nI wonder if that'll be any consolation when they're being loaded into black unmarked vans by people in sunglasses and black suits.",
                              "timestamp": "2022-06-25 18:32:15",
                              "score": 1,
                              "num_children": 0,
                              "author": 354546,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "idni7he",
              "text": "They can claim anything they want, but it will still fall under high crimes and misdemeanors. Democrats can impeach — no problem.\n\nWe have to give them power in the Senate by voting in more Dems, then they can actually do this.",
              "timestamp": "2022-06-25 04:40:14",
              "score": 3,
              "num_children": 1,
              "author": 337970,
              "replies": [
                {
                  "id": "ido3dhs",
                  "text": "In order to do that everyone must get out and vote it is the only voice you actually have.",
                  "timestamp": "2022-06-25 09:11:57",
                  "score": 3,
                  "num_children": 1,
                  "author": 109352,
                  "replies": [
                    {
                      "id": "idocsu1",
                      "text": "\"Just vote harder\"",
                      "timestamp": "2022-06-25 11:25:38",
                      "score": 2,
                      "num_children": 0,
                      "author": 138646,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "idmwqnn",
          "text": "Rules and laws don't apply to Repugs.  Haven't you noticed?",
          "timestamp": "2022-06-25 01:30:24",
          "score": 2,
          "num_children": 0,
          "author": 354546,
          "replies": []
        },
        {
          "id": "idludys",
          "text": "I fully support that what these justices did was wrong… but none of them lied. When they were testifying Roe WAS precedent, what they’re saying is “Roe is a case that the Supreme Court has previously ruled on”… none of them said they wouldn’t do anything to change that if given the chance. Precedent isn’t permanent. Segregation in schools was “settled precedent” until Brown v. Board changed that",
          "timestamp": "2022-06-24 20:40:34",
          "score": 15,
          "num_children": 2,
          "author": 95748,
          "replies": [
            {
              "id": "idm3pga",
              "text": "They all knew damn well that the context of the question was to discover whether they would support a decision that went against that precedent.",
              "timestamp": "2022-06-24 21:45:27",
              "score": 23,
              "num_children": 2,
              "author": 277945,
              "replies": [
                {
                  "id": "idmebot",
                  "text": "Of course they did. And they're all well aware of exactly how evasive they are legally allowed to be. They didn't break the law, because they weren't made to give unambiguous testimony, and ambiguity is a get-out-of-perjury free card. Every single Senator on both sides knew that these were anti-abortion activists during their confirmation hearings. None of the Senators were stupid enough to sincerely believe their promises about court precedent, although some may have been stupid enough to assume the chance was unlikely to arise.\n\nIt's been a big stupid joke for more than 30 years now that every SCOTUS nominee goes before Congress, and Senators ask them whether or not they would overturn Roe, and the nominees say \"gosh how inappropriate to ask about a hypothetical situation that will totally never come up\" and Senators cite their lifetime's worth of previous correspondence in which they outlined exactly what they would do given the chance, and the nominees say \"I'm a super duper principled judge and I would only rule on the merits of the case\" and the Senators all say \"okay sounds believable to me.\"\n\nWere the justices lying during their hearings? Depends on how you define a lie, but regardless it's not a useful accusation.\n\nCan you impeach them for lying? No, not even the worst of these statements would rise to a legal standard of perjury.\n\nCan you impeach them without perjury? Sure! Impeachment is a political process and it's the final word in removing justices.\n\nCan you impeach them for being fascist scum who don't deserve a lifetime of unaccountable power? Theoretically, yes! If two thirds of the Senate vote to convict, then it doesn't matter what they are convicted of.\n\nWill a SCOTUS justice ever be removed from the bench by impeachment? No, never, not ever. Forget about this because it may as well not even exist as a legal pathway.\n\nWill it help to pursue impeachment against a corrupt SCOTUS justice? In my opinion, no. It would likely hurt things worse by failing. The oligarchy is real, and this is its face. Institutions will not save us.\n\nWhat will help? This is the answer nobody wants to hear. Look after one another, vote locally, and spend decades painstakingly eroding the base of support that these fascists have. Render the political environment uninhabitable for fascists. In the meantime, it will be constant uncertainty and existential dread, and we all will have to live with that. We have yet to stop falling, so brace yourself for worse to come including civil unrest.",
                  "timestamp": "2022-06-24 23:03:25",
                  "score": 20,
                  "num_children": 1,
                  "author": 105173,
                  "replies": [
                    {
                      "id": "idms614",
                      "text": ">What will help? This is the answer nobody wants to hear. Look after one another, vote locally, and spend decades painstakingly eroding the base of support that these fascists have.\n\nThere's another answer nobody likes to hear.\n\nBurn it the fuck down.",
                      "timestamp": "2022-06-25 00:53:26",
                      "score": 11,
                      "num_children": 1,
                      "author": 277945,
                      "replies": [
                        {
                          "id": "idn4qj8",
                          "text": "fascists love a power vacuum",
                          "timestamp": "2022-06-25 02:36:27",
                          "score": 5,
                          "num_children": 2,
                          "author": 245802,
                          "replies": [
                            {
                              "id": "idnlrsp",
                              "text": "Remember what it took to stop them last time?",
                              "timestamp": "2022-06-25 05:18:33",
                              "score": 4,
                              "num_children": 0,
                              "replies": []
                            },
                            {
                              "id": "idnx3ah",
                              "text": ">fascists love a power vacuum\n\nOh, I don't mean get rid of the whole system, I'm well aware that fascists are loving this opportunity to exacerbate anti government sentiment.\n\nI just think the SCOTUS is completely illegitimate.",
                              "timestamp": "2022-06-25 07:40:46",
                              "score": 1,
                              "num_children": 0,
                              "author": 277945,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "idmbzoz",
                  "text": "Yeah. That context is true but their answer was factual not contextual. \n\nAt the time it was absolutely clear these were pre prepared legally correct answers - all it needed was a follow up along the lines of 'and is it a precedent you agree with and will uphold?'",
                  "timestamp": "2022-06-24 22:45:52",
                  "score": 3,
                  "num_children": 1,
                  "author": 1519,
                  "replies": [
                    {
                      "id": "idmhqkm",
                      "text": "> all it needed was a follow up along the lines of 'and is it a precedent you agree with and will uphold?\n\nThat the question wasn't asked is infuriating. We all knew it was double-speak when they said it.",
                      "timestamp": "2022-06-24 23:29:49",
                      "score": 8,
                      "num_children": 0,
                      "author": 306899,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "idmjws5",
              "text": "Exactly… the interviewers should have said:” You didn’t answer my question. Would you try to overturn Roe vs Wade?”",
              "timestamp": "2022-06-24 23:46:58",
              "score": 5,
              "num_children": 1,
              "author": 228459,
              "replies": [
                {
                  "id": "idmksqr",
                  "text": "A lot of them did but then the justice would say something along the lines of “it would all depend on the details of a specific case and it’s not appropriate for me to try and determine what my ruling would be when I haven’t reviewed specific case details”. \nEverybody knew exactly what they were going to do and in my opinion the people we should be mad at are Susan Collins and Lisa Murkowski, they both pretend to support the right to choose but still let 3 of the 4 justices pictured get through congress because they “Trust them to uphold the right to choose”",
                  "timestamp": "2022-06-24 23:54:04",
                  "score": 8,
                  "num_children": 0,
                  "author": 95748,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "idmnaes",
      "text": "Anybody who believed Kavanaugh, Gorsuch, or Barrett is an idiot. Looking right at you, Senator Collins.",
      "timestamp": "2022-06-25 00:14:02",
      "score": 17,
      "num_children": 0,
      "author": 343540,
      "replies": []
    },
    {
      "id": "idly6dr",
      "text": "Today Christian Conservatives starting turning the US into the Handmaid’s Tale - sad day when Guns have more rights than Women",
      "timestamp": "2022-06-24 21:06:23",
      "score": 12,
      "num_children": 0,
      "author": 347355,
      "replies": []
    },
    {
      "id": "idmlcnf",
      "text": "These are very much lawyer answers. They stated they accepted it as precedent not that they wouldn't overturn if given the chance. I mean, fuck each and every one of them but that's what happened here.",
      "timestamp": "2022-06-24 23:58:33",
      "score": 13,
      "num_children": 0,
      "author": 121917,
      "replies": []
    },
    {
      "id": "idmm1c7",
      "text": "Fucking liars. Traitors. Threats to democracy, enemies of women.",
      "timestamp": "2022-06-25 00:04:01",
      "score": 14,
      "num_children": 0,
      "author": 121177,
      "replies": []
    },
    {
      "id": "idlf989",
      "text": "Judicial fraud. They're guaranteed lifetime tenure but it doesn't strictly say it has to be on the Supreme Court. \n\nHave them reassigned to federal courts in Macon Georgia and other shitholes.",
      "timestamp": "2022-06-24 18:59:10",
      "score": 58,
      "num_children": 2,
      "author": 63379,
      "replies": [
        {
          "id": "idlif0j",
          "text": "There are methods that can be employed for legal impeachment. \n\nWe just likely won't see it happen.",
          "timestamp": "2022-06-24 19:20:15",
          "score": 33,
          "num_children": 2,
          "author": 392603,
          "replies": [
            {
              "id": "idlvibw",
              "text": "There should be a general strike nationwide",
              "timestamp": "2022-06-24 20:48:11",
              "score": 7,
              "num_children": 0,
              "author": 63379,
              "replies": []
            },
            {
              "id": "idmml77",
              "text": "Yeah, Kavanaugh and Thomas actually have ample reason to be impeached, and this was even before we found out about Thomas's wife. But it won't happen.",
              "timestamp": "2022-06-25 00:08:22",
              "score": 7,
              "num_children": 1,
              "author": 180225,
              "replies": [
                {
                  "id": "idmo06n",
                  "text": "We can't even get the democrats to go after Trump who is clearly guilty of a swath of different crimes because it would be \"politically divisive\".  Like, mf, you don't think them storming the fucking capital was \"politically divisive\"?",
                  "timestamp": "2022-06-25 00:19:45",
                  "score": 7,
                  "num_children": 1,
                  "author": 93212,
                  "replies": [
                    {
                      "id": "idmx2fc",
                      "text": "The Dems will keep trying to \"reach across the aisle\" and work with the Repugs right up until they're being loaded into unmarked black vans by people in sunglasses and black suits. 😒",
                      "timestamp": "2022-06-25 01:33:03",
                      "score": 3,
                      "num_children": 1,
                      "author": 354546,
                      "replies": [
                        {
                          "id": "idmxddx",
                          "text": "And the Overton window just shifts further and further to the right.  It's already taboo to be pro-union with the majority of democrats.  Something that should have been a cornerstone of the party.  Now, only Bernie and other progressives support unions and they're seen as extremists.",
                          "timestamp": "2022-06-25 01:35:29",
                          "score": 4,
                          "num_children": 1,
                          "author": 93212,
                          "replies": [
                            {
                              "id": "idn1ol7",
                              "text": "It's literally insane.",
                              "timestamp": "2022-06-25 02:10:57",
                              "score": 1,
                              "num_children": 0,
                              "author": 354546,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "idlzgjl",
          "text": "Don’t do that to poor Macon! They vote blue by a significant margin (60/40) and have it hard enough as it is.",
          "timestamp": "2022-06-24 21:15:26",
          "score": 7,
          "num_children": 1,
          "author": 245078,
          "replies": [
            {
              "id": "idm46rn",
              "text": "Yeah I saw that. The college towns in GA went for Biden too.",
              "timestamp": "2022-06-24 21:48:55",
              "score": 3,
              "num_children": 0,
              "author": 63379,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "idlsjfc",
      "text": "The only person who believed them was Susan Collins.",
      "timestamp": "2022-06-24 20:28:00",
      "score": 11,
      "num_children": 1,
      "author": 277671,
      "replies": [
        {
          "id": "idm5yad",
          "text": "Has she commented on the decision today or was her foot too deep in her mouth?",
          "timestamp": "2022-06-24 22:01:35",
          "score": 10,
          "num_children": 1,
          "author": 392603,
          "replies": [
            {
              "id": "idmnkzu",
              "text": "Some bullshit about how they \"mislead\" her. Honestly if her and Manchin are dumb enough to believe them then they shouldn't be anywhere near the Senate.",
              "timestamp": "2022-06-25 00:16:26",
              "score": 12,
              "num_children": 0,
              "author": 343540,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "idmd0t7",
      "text": "It is absolutely insane to me that a man with multiple accusations of sexual assault in his past and who's very own wife committed sedition against the United States is able to participate in making the decision of what women can and can't do with with their bodies.",
      "timestamp": "2022-06-24 22:53:34",
      "score": 10,
      "num_children": 0,
      "author": 177892,
      "replies": []
    },
    {
      "id": "idlr4vo",
      "text": "Let's stop acting like they're stupid. They know EXACTLY what they're doing, and EXACTLY how to manipulate the system. Im more upset with the cowardly Democrats who REFUSE to stand up for America and punish these asshats. And it's the cowardice of the entire Democratic party that emboldens the fascists and bigots of the GOP to destroy America in the name of bigotry.",
      "timestamp": "2022-06-24 20:18:35",
      "score": 38,
      "num_children": 2,
      "author": 54010,
      "replies": [
        {
          "id": "idmo839",
          "text": "> Im more upset with the cowardly Democrats\n\nYeah the Dems are totally worse than the GQP who *put* these hooligans on the bench.\n\nI'm about as lefty as they come (yuh know, the kind that wants to feed their organs to my dog), and this constant equivocating is awful.\n\nDo the Dems suck? Of course! Do they suck as bad as the GOP? Not even fucking close.",
          "timestamp": "2022-06-25 00:21:30",
          "score": 13,
          "num_children": 0,
          "author": 287856,
          "replies": []
        },
        {
          "id": "idndcx0",
          "text": "Punish them how? What can the Democrats do with 50 votes in the Senate, when almost everything requires 60?",
          "timestamp": "2022-06-25 03:52:33",
          "score": 1,
          "num_children": 0,
          "author": 230515,
          "replies": []
        }
      ]
    },
    {
      "id": "idlmv6f",
      "text": " We couldn't even kick a shit monkey reality TV grifter out of office, I don't see them getting impeached for this.",
      "timestamp": "2022-06-24 19:50:00",
      "score": 25,
      "num_children": 1,
      "author": 73470,
      "replies": [
        {
          "id": "idn8x0l",
          "text": "He was impeached *twice*",
          "timestamp": "2022-06-25 03:12:16",
          "score": 6,
          "num_children": 0,
          "author": 286309,
          "replies": []
        }
      ]
    },
    {
      "id": "idlxxhp",
      "text": "You would also not get the job if you had an outburst like Kavanaugh did. What other job interview would proceed after that?\n\nI’d vote him “most likely to have caused procurement of an abortion.”",
      "timestamp": "2022-06-24 21:04:41",
      "score": 7,
      "num_children": 1,
      "author": 395817,
      "replies": [
        {
          "id": "idoqanm",
          "text": "Every time I hear him speak all I hear is “I like beer!”",
          "timestamp": "2022-06-25 13:45:24",
          "score": 2,
          "num_children": 0,
          "author": 244328,
          "replies": []
        }
      ]
    },
    {
      "id": "idmrvu8",
      "text": "They should all be impeached and then charged with perjury.",
      "timestamp": "2022-06-25 00:51:09",
      "score": 6,
      "num_children": 0,
      "author": 299333,
      "replies": []
    },
    {
      "id": "idmmmis",
      "text": "First steps to Gilead.",
      "timestamp": "2022-06-25 00:08:40",
      "score": 5,
      "num_children": 0,
      "author": 404389,
      "replies": []
    },
    {
      "id": "idmnwvy",
      "text": "What?! Republicans?? Liars?? Who’da thunk it?",
      "timestamp": "2022-06-25 00:19:03",
      "score": 4,
      "num_children": 0,
      "author": 125671,
      "replies": []
    },
    {
      "id": "idokrkb",
      "text": "Impeach them all and Clarence Thomas. He needs to go for being a seditionist. \nYou can’t be married to someone so nuts and not suffer the consequences.",
      "timestamp": "2022-06-25 12:54:05",
      "score": 5,
      "num_children": 0,
      "author": 48323,
      "replies": []
    },
    {
      "id": "idlr3sw",
      "text": "We all knew this was the end game. Trying to impeach these pieces of shit is just wasted energy and symbolic at best with how Congress is stacked. We knew they were full of it, and they knew they were full of it, but wasting energy proving it when there is so much else to be done isn't going to help us.",
      "timestamp": "2022-06-24 20:18:23",
      "score": 3,
      "num_children": 0,
      "author": 4720,
      "replies": []
    },
    {
      "id": "idnxag8",
      "text": "The SC is an illegitimate institution. Republiqans have destroyed its legitimacy with overt and cynical intent. They’ve cheated every step of the way to force in minority rule and they talk openly now of never relinquishing power once they have it. It’s an insurgency—and it’s going to need to be repelled with force.",
      "timestamp": "2022-06-25 07:43:31",
      "score": 3,
      "num_children": 0,
      "author": 250495,
      "replies": []
    },
    {
      "id": "idlpyfw",
      "text": "They lied, and they really should be impeached for that, but let's not pretend we didn't know they were lying, it was pretty damn obvious, no matter what Susan Collins might claim.",
      "timestamp": "2022-06-24 20:10:47",
      "score": 7,
      "num_children": 0,
      "author": 91844,
      "replies": []
    },
    {
      "id": "idm6uiw",
      "text": "Trust nothing they say and assume they have an agenda you don't know about.",
      "timestamp": "2022-06-24 22:08:02",
      "score": 4,
      "num_children": 0,
      "author": 328367,
      "replies": []
    },
    {
      "id": "idlywqa",
      "text": "I hate all of these cunts, but they technically didn't lie. They just spoke past the question and made a statement that R v. W is established law. And the senators let them get away with that answer.",
      "timestamp": "2022-06-24 21:11:32",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "idmdc8f",
      "text": "Not an American (thank goodness), but can you not impeach them for lying or misleading answers?",
      "timestamp": "2022-06-24 22:56:00",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "idmj3ph",
      "text": "If you need or are interested in supporting reproductive rights, [I made a master post of pro-choice resources](https://docdro.id/s3OwS8u). Please comment if you would like to add a resource and spread this information on whatever social media you use.",
      "timestamp": "2022-06-24 23:40:33",
      "score": 2,
      "num_children": 0,
      "author": 168329,
      "replies": []
    },
    {
      "id": "idmmv0n",
      "text": "None of these quotes say anything untrue. Nor that they wouldn't overturn it once given the choice.\n\nThey are non-statements.\n\nAnd that's why they shouldn't have made it onto the court.",
      "timestamp": "2022-06-25 00:10:34",
      "score": 3,
      "num_children": 0,
      "author": 234400,
      "replies": []
    },
    {
      "id": "idmr0c0",
      "text": "Weren't they under oath? Isn't perjury in the Senate a federal felony?",
      "timestamp": "2022-06-25 00:44:04",
      "score": 2,
      "num_children": 0,
      "author": 297077,
      "replies": []
    },
    {
      "id": "idn13rk",
      "text": "Lying sacks of shit",
      "timestamp": "2022-06-25 02:06:09",
      "score": 2,
      "num_children": 0,
      "author": 164320,
      "replies": []
    },
    {
      "id": "idn3tmo",
      "text": "Good thing rules don't apply to the Republicans, then. Cause otherwise they'd be out of a job. /s",
      "timestamp": "2022-06-25 02:28:48",
      "score": 2,
      "num_children": 0,
      "author": 85871,
      "replies": []
    },
    {
      "id": "idn5cg9",
      "text": "The corrupt four, coming to the SC with an agenda and fulfilling it immediately.",
      "timestamp": "2022-06-25 02:41:38",
      "score": 2,
      "num_children": 0,
      "author": 181879,
      "replies": []
    },
    {
      "id": "idncme5",
      "text": "How can a woman sit and deny her fellow women bodily autonomy?",
      "timestamp": "2022-06-25 03:45:46",
      "score": 2,
      "num_children": 0,
      "author": 399766,
      "replies": []
    },
    {
      "id": "idnf95g",
      "text": "Nobody believed them. not you, not them, not the people in front of them. no one. And if they tell you otherwise they are lying.",
      "timestamp": "2022-06-25 04:10:36",
      "score": 2,
      "num_children": 1,
      "author": 126425,
      "replies": [
        {
          "id": "idopy5j",
          "text": "Literally nobody… Except Susan Collins.",
          "timestamp": "2022-06-25 13:42:19",
          "score": 1,
          "num_children": 0,
          "author": 244328,
          "replies": []
        }
      ]
    },
    {
      "id": "idnmd4a",
      "text": "Lying under oath is a fucking crime. These people lied under oath for a position in the government, several of which they were nowhere close to qualified for. They'll be prosecuted eventually, but perhaps not in the calm, white-collar context they expect.",
      "timestamp": "2022-06-25 05:25:07",
      "score": 2,
      "num_children": 0,
      "author": 187896,
      "replies": []
    },
    {
      "id": "idoqk95",
      "text": "Welcome to America, where the rules are made up and no one in power is ever held accountable.",
      "timestamp": "2022-06-25 13:47:43",
      "score": 2,
      "num_children": 0,
      "author": 268985,
      "replies": []
    },
    {
      "id": "idmwojz",
      "text": "[deleted]",
      "timestamp": "2022-06-25 01:29:56",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "idmzp1e",
          "text": "Comments like these have been getting subs banned, btw, just a headsup",
          "timestamp": "2022-06-25 01:54:36",
          "score": 1,
          "num_children": 1,
          "author": 392603,
          "replies": [
            {
              "id": "idn1e9d",
              "text": "Great. I guess I'll delete this. -_-  \nThat's a legitimate question though, even if said abruptly. I'm french, I have no idea and with the political situation of the USA, I honestly wonder what happens when violence starts erupting from the side that is for now, not that violent.  \nI mean... There's one side that had a fucking coup. And it keeps pushing and pushing. So... What happens when the other side begins to answer violence with violence?",
              "timestamp": "2022-06-25 02:08:34",
              "score": 3,
              "num_children": 1,
              "author": 57349,
              "replies": [
                {
                  "id": "idnhr1g",
                  "text": "Oh, I know. It's bullshit that stuff on left-leaning subs is targeted while right wing subs are generally free to do/say whatever they want",
                  "timestamp": "2022-06-25 04:35:28",
                  "score": 2,
                  "num_children": 0,
                  "author": 392603,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "idmrv4e",
      "text": "[deleted]",
      "timestamp": "2022-06-25 00:50:59",
      "score": 0,
      "num_children": 2,
      "replies": [
        {
          "id": "idmwb6y",
          "text": "Is this aimed at people in general or at someone here specifically?",
          "timestamp": "2022-06-25 01:26:56",
          "score": 3,
          "num_children": 0,
          "author": 392603,
          "replies": []
        },
        {
          "id": "idnf0h0",
          "text": "Vote for what? Vote for who? We’ve been doing this and yet somehow this still happens.",
          "timestamp": "2022-06-25 04:08:17",
          "score": 2,
          "num_children": 0,
          "author": 334909,
          "replies": []
        }
      ]
    },
    {
      "id": "idmcbbp",
      "text": "The answers left these zealots too much wiggle room such that their current decision does not exposes a past lie.  For example, Kavanaugh’s answer that Roe is  “settled precedent of the Supreme Court” does not mean that the decision is correct or that it should not be overturned.  The same is true of each of these supposed lies.  The correct questions needed to be, “is Roe correct” or “should Roe be overturned”?",
      "timestamp": "2022-06-24 22:48:16",
      "score": 1,
      "num_children": 0,
      "author": 153403,
      "replies": []
    },
    {
      "id": "idmo6yc",
      "text": "Maybe We The People should notify the employers of this grievous error and how more reputable places of business conduct business accordingly.",
      "timestamp": "2022-06-25 00:21:15",
      "score": 1,
      "num_children": 0,
      "author": 325885,
      "replies": []
    },
    {
      "id": "idn5ncs",
      "text": "\"Liar, liar court's on fire!\"",
      "timestamp": "2022-06-25 02:44:11",
      "score": 1,
      "num_children": 0,
      "author": 252900,
      "replies": []
    },
    {
      "id": "idndy4x",
      "text": "IMPEACH THEM NOW!\n\nhttps://www.cnn.com/2019/09/16/politics/scotus-impeach/index.html",
      "timestamp": "2022-06-25 03:58:06",
      "score": 1,
      "num_children": 0,
      "author": 391633,
      "replies": []
    },
    {
      "id": "idnewev",
      "text": "Ohhh nooooo! The Senate got lied to?!?",
      "timestamp": "2022-06-25 04:07:11",
      "score": 1,
      "num_children": 0,
      "author": 334909,
      "replies": []
    },
    {
      "id": "idnfsyz",
      "text": "[removed]",
      "timestamp": "2022-06-25 04:16:03",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "idnms0h",
      "text": "All these mfs are full of it",
      "timestamp": "2022-06-25 05:29:53",
      "score": 1,
      "num_children": 0,
      "author": 214137,
      "replies": []
    },
    {
      "id": "idnwsvb",
      "text": "Where's thomas?",
      "timestamp": "2022-06-25 07:36:42",
      "score": 1,
      "num_children": 0,
      "author": 75760,
      "replies": []
    },
    {
      "id": "ido1vu4",
      "text": "Every one of them should be impeached.",
      "timestamp": "2022-06-25 08:49:56",
      "score": 1,
      "num_children": 0,
      "author": 277234,
      "replies": []
    },
    {
      "id": "ido4o5u",
      "text": "“But they pinky swore!  Gosh darn it!”",
      "timestamp": "2022-06-25 09:31:23",
      "score": 1,
      "num_children": 0,
      "author": 80351,
      "replies": []
    },
    {
      "id": "idoexvs",
      "text": "Does anyone have a supercut of the video evidence of this?",
      "timestamp": "2022-06-25 11:51:20",
      "score": 1,
      "num_children": 0,
      "author": 341455,
      "replies": []
    },
    {
      "id": "idow26e",
      "text": "Impeachment will never happen. It’s time for people to exercise their 2nd amendment rights. That’s supposedly about overthrowing a tyrannical government, is it not?",
      "timestamp": "2022-06-25 14:33:23",
      "score": 1,
      "num_children": 0,
      "author": 59684,
      "replies": []
    },
    {
      "id": "idpd55o",
      "text": "They didn't say \"yes\" they just described it.  It's not perjury.  It's going to be as easily evaded in a case as it was when they asked.\n\nThis is just hoopla to distract from the collapse of the nation from unchecked kleptocracy",
      "timestamp": "2022-06-25 16:41:27",
      "score": 1,
      "num_children": 0,
      "author": 221184,
      "replies": []
    },
    {
      "id": "idogsdl",
      "text": "They didn’t really lie. They said it was law, precedent, settled. What they didn’t say is whether they agreed with that and whether they planned to change it. Liberals could do so much better with their messaging and calling these things out. It was obvious.",
      "timestamp": "2022-06-25 12:12:29",
      "score": 0,
      "num_children": 0,
      "author": 48827,
      "replies": []
    }
  ]
}