{
  "id": "vlro86",
  "text": "Insufferable women get rejected, to their surprise :D\n",
  "timestamp": "2022-06-27 09:41:26",
  "score": 722,
  "subreddit": "t5_2zaj2",
  "num_children": 10,
  "replies": [
    {
      "id": "idx34si",
      "text": "See so many empowered women coming through the work site being obnoxious and saying anything they want to whoever they chose. It's like they're beating their chest to show everybody not to mess with them. As soon as someone starts giving any back they get upset and run to management.\n\nIn the meantime the normal women that I work with are nothing special. They do their job just like me.  There's a couple of women that I love working with and they hate these idiots.",
      "timestamp": "2022-06-27 11:49:40",
      "score": 61,
      "num_children": 2,
      "author": 53957,
      "replies": [
        {
          "id": "idxxelf",
          "text": "It’s like “shank someone your first day in prison so the homies won’t mess wid ya!”",
          "timestamp": "2022-06-27 15:51:27",
          "score": 22,
          "num_children": 0,
          "author": 368316,
          "replies": []
        },
        {
          "id": "ihp30zm",
          "text": "its because women born in the past 50 years, particularly the last 30, are raised to think to be successful you have to emit masculine energy. You want to be a strong woman? you have to fight, fight like a girl, don't take anything from anyone, only listen to yourself. Feminine energy, and its power, has been completely rejected. Thats why its so difficult to find the forgiving, soft, receptive feminine energy in the us. my gender has banned it and deemed it weak. I'm determined to show this world how strong this receptive, gentle feminine energy is and try to bring this energy back because I think our country really needs it.",
          "timestamp": "2022-07-26 10:07:35",
          "score": 1,
          "num_children": 0,
          "author": 6531,
          "replies": []
        }
      ]
    },
    {
      "id": "idyggbj",
      "text": "How can we fight them? My boss is like this, hate her",
      "timestamp": "2022-06-27 17:57:39",
      "score": 13,
      "num_children": 1,
      "author": 137139,
      "replies": [
        {
          "id": "idyhyce",
          "text": "New boss.",
          "timestamp": "2022-06-27 18:07:44",
          "score": 13,
          "num_children": 0,
          "author": 389946,
          "replies": []
        }
      ]
    },
    {
      "id": "idz1wln",
      "text": "Same with 'fatphobia'.  It is arrogant and condescending to pretend to be psychic enough to know someone else's mental state.  Further, such people clearly ignore the actual, and obvious response most people have to those who are fat: Disgust, not fear.",
      "timestamp": "2022-06-27 20:26:06",
      "score": 14,
      "num_children": 1,
      "replies": [
        {
          "id": "igx68hm",
          "text": "or you could not comment on people's bodies. keep that shit to yourself",
          "timestamp": "2022-07-20 14:32:09",
          "score": 1,
          "num_children": 0,
          "author": 70164,
          "replies": []
        }
      ]
    },
    {
      "id": "idwwy8p",
      "text": "Notice how \"a strong woman\" usually just means that she is physically as strong or stronger than an average man, and can \"put a man in his place\" in a dialogue or, additionally, whop a physically weak and defenceless man's arse, or smth? While saying \"strong man\" usually implies that said man is chivalrous, and uses his strength to protect, especially to protect a woman (which in it's turn means just bullying men she dislikes at her demand). Not even the farthest right-winger ever said that a wife beater is a \"strong and independent man\" but you'd easily find feminists defending husband beaters as \"strong and independent women\" (oh you've already seen at least one case). Strength in a woman = hurt men, strength in a man = protect women.",
      "timestamp": "2022-06-27 10:35:07",
      "score": 52,
      "num_children": 1,
      "author": 13527,
      "replies": [
        {
          "id": "idyapke",
          "text": "Well said, good orginization",
          "timestamp": "2022-06-27 17:19:51",
          "score": 7,
          "num_children": 0,
          "author": 141508,
          "replies": []
        }
      ]
    },
    {
      "id": "idwy7c6",
      "text": "Strong women is someone who is strong in feminine qualities, not putting her man in place and going around shops demanding to speak to the manager",
      "timestamp": "2022-06-27 10:51:20",
      "score": 16,
      "num_children": 1,
      "author": 302154,
      "replies": [
        {
          "id": "ihp3cu5",
          "text": "Thank you, I feel feminism has totally banned the idea that there is strength is femininity, they think think you're only strong if you act masculine, it's really turned me off to feminism the last few years",
          "timestamp": "2022-07-26 10:11:54",
          "score": 2,
          "num_children": 0,
          "author": 6531,
          "replies": []
        }
      ]
    },
    {
      "id": "if9fpj4",
      "text": "Yeah I’ve heard it plenty, women saying we can’t “handle them” or are “insecure.” Bro no, you’re just a shitty person and I don’t want to waste time, money, or energy dealing with that when I can go find someone who’s actually a decent human being.",
      "timestamp": "2022-07-07 21:35:57",
      "score": 2,
      "num_children": 0,
      "author": 69429,
      "replies": []
    },
    {
      "id": "ie0jfha",
      "text": "Truth.",
      "timestamp": "2022-06-28 03:57:53",
      "score": 1,
      "num_children": 0,
      "author": 193518,
      "replies": []
    },
    {
      "id": "ie0k3u7",
      "text": "To me, strong women and men are people who stand up to what they believe in, not putting themselves or others down, and using what they are given/achieve to succeed. You can’t really slap a gender on those qualities.",
      "timestamp": "2022-06-28 04:04:25",
      "score": 1,
      "num_children": 0,
      "author": 288118,
      "replies": []
    },
    {
      "id": "ie15wul",
      "text": "It’s always the ones that make it part of their personality I can’t stand",
      "timestamp": "2022-06-28 08:29:43",
      "score": 1,
      "num_children": 0,
      "author": 403255,
      "replies": []
    },
    {
      "id": "ig0nv05",
      "text": "Ever think it’s because a lot of men don’t like being treated the same way they treat women?",
      "timestamp": "2022-07-13 17:38:41",
      "score": 0,
      "num_children": 1,
      "author": 111637,
      "replies": [
        {
          "id": "ig0wl7g",
          "text": "No. Also fuck off.",
          "timestamp": "2022-07-13 18:35:21",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "ig0yg6b",
              "text": "So instead of explaining your perspective to someone who thinks differently you’d rather they “fuck off” and not question you? I would expect the self-proclaimed free thinkers to be better than that.",
              "timestamp": "2022-07-13 18:47:19",
              "score": 0,
              "num_children": 2,
              "author": 111637,
              "replies": [
                {
                  "id": "ig0ypis",
                  "text": "Yes. Feminists out, you included.",
                  "timestamp": "2022-07-13 18:48:58",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "ig6k3g6",
                  "text": "i dont think this is a debate page, the men are here to post and agree with eachother. but keep being you and speaking up",
                  "timestamp": "2022-07-14 21:25:40",
                  "score": 0,
                  "num_children": 0,
                  "author": 291397,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}