{
  "id": "vmw5k2",
  "text": "Today I left my Christian boyfriend. Thank you r/atheism for giving me the strength to do so.\nYesterday I made a post asking people whether or not I should leave my Christian boyfriend, in spite of everything else being fine, due to his anti-choice views. I expected to only get a handful of replies, but much to my surprise there were over 700 responses. I read them all, and couldn’t be any more grateful for all of your thoughts. \n\nFor what it’s worth, I’ve had a few people message me about what I decided to do, and the answer is that I was honestly on the fence, but after reading all of your wise words, I realise that leaving is the only option, and so as tough as it was, as of today my life is now Christian free. \n\nI know I am just some random woman on the Internet, and most of you probably don’t care, but I just wanted to thank you all for giving me the strength to make this decision. I’m now looking forward to open up a fresh chapter of life where I am now free to find a man who would respect me: an atheist man.\n\nThank you all!",
  "timestamp": "2022-06-28 19:52:48",
  "score": 15410,
  "subreddit": "t5_2qh2p",
  "num_children": 380,
  "author": 272705,
  "replies": [
    {
      "id": "ie4lz8p",
      "text": "The Only Moral Abortion is my Abortion:\n\nhttps://joycearthur.com/abortion/the-only-moral-abortion-is-my-abortion/\n\nA Defense of Abortion:\n\nhttps://spot.colorado.edu/~heathwoo/Phil160,Fall02/thomson.htm\n\nResources:\n\n[Link 1](https://www.reddit.com/r/Anarchism/comments/vjrf9h/megathread_supreme_court_overturning_roe_v_wade)\n\n[Link 2](https://www.reddit.com/r/antiwork/comments/vjqs0r/calls_for_mass_walkout_of_women_across_america_if/idnh2ex)\n\nhttps://www.womensmarch.com/\n\nhttp://abortion.cafe",
      "timestamp": "2022-06-29 00:49:33",
      "score": 1,
      "num_children": 2,
      "replies": [
        {
          "id": "ie5zzbi",
          "text": "Great resources and fantastic reading.  Thank you!",
          "timestamp": "2022-06-29 09:38:39",
          "score": 11,
          "num_children": 0,
          "author": 199436,
          "replies": []
        },
        {
          "id": "ie4tyzk",
          "text": "[removed]",
          "timestamp": "2022-06-29 01:54:47",
          "score": -7,
          "num_children": 1,
          "replies": [
            {
              "id": "ie4vbfg",
              "text": "Damn, sounds like somebody's parents needed these resources...",
              "timestamp": "2022-06-29 02:05:33",
              "score": 30,
              "num_children": 1,
              "author": 91654,
              "replies": [
                {
                  "id": "ief6icg",
                  "text": "Pour cold water on the burnt area",
                  "timestamp": "2022-07-01 06:26:54",
                  "score": 1,
                  "num_children": 0,
                  "author": 315150,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ie3k44s",
      "text": "Yay! Say no to christofascism",
      "timestamp": "2022-06-28 20:11:35",
      "score": 1879,
      "num_children": 4,
      "author": 56041,
      "replies": [
        {
          "id": "ie418xu",
          "text": "The deleted comment by u/Algacrain poorly responding to you said \"Fascism is when anything I don't like!\"\n\nMy response:\n\n\"Fascism is when the state's needs trump individual liberty.\n\nNearly every definition of fascism, and especially Umberto Eco's, considers anti-choice action to be fascism.\n\nLet's not forget that their movement is deeply rooted in eugenics and white supremacy.  Why all the talk of white vs non-white birthrates?  Why harsher punishments for and tighter scruples on women, especially women of color?  Why is the state pushing for \"traditional family values\", and why do those values specifically command that we have more children?\"",
          "timestamp": "2022-06-28 22:09:34",
          "score": 813,
          "num_children": 8,
          "author": 185216,
          "replies": [
            {
              "id": "ie41jd3",
              "text": "[removed]",
              "timestamp": "2022-06-28 22:11:43",
              "score": 290,
              "num_children": 11,
              "replies": [
                {
                  "id": "ie42nlp",
                  "text": "Careful.  The alt right specifically targets young boys and men who are not doing well in certain areas of their life, and tries to provide a convenient scapegoat for their mis-steps.\n\nMany start by blaming universities, liberals, freeloaders, etc.  They eventually teach the young one to replace those scapegoats with new ones.  Immigrants, Clintons, Soros, Jews...and then they're tempted to violence.\n\nJust look at Charlie Kirk and the Proud Boys.",
                  "timestamp": "2022-06-28 22:19:58",
                  "score": 400,
                  "num_children": 5,
                  "author": 185216,
                  "replies": [
                    {
                      "id": "ie4419t",
                      "text": "It was a sad day when I realized some of my old coworkers had been brainwashed by Jordan Peterson.",
                      "timestamp": "2022-06-28 22:30:17",
                      "score": 200,
                      "num_children": 7,
                      "author": 336041,
                      "replies": [
                        {
                          "id": "ie58lxd",
                          "text": "You know it's bad when Americans are getting brainwashed by Great Value fascists.\n\nIt's one thing when you live in 1940, have no means of fact checking, and a charismatic failed art student is telling you it's the minority's fault for the lot you drew in life.\n\nIt's another when you live in the information age, have every freedom at your disposal to make good choices, and then double down on Great Value because you're too stupid and lazy to even attempt to see a counterpoint.",
                          "timestamp": "2022-06-29 04:00:00",
                          "score": 120,
                          "num_children": 2,
                          "author": 166394,
                          "replies": [
                            {
                              "id": "ie5ofzr",
                              "text": "\"Great Value fascist\"? Never heard the term.",
                              "timestamp": "2022-06-29 06:56:48",
                              "score": 16,
                              "num_children": 1,
                              "author": 292446,
                              "replies": [
                                {
                                  "id": "ie5raqh",
                                  "text": "\"Great Value\" is Wal-Mart's name for their generic brand of goods.\n\nMy wife and I use the term when we see strangers in public who vaguely look like a celebrity.",
                                  "timestamp": "2022-06-29 07:35:21",
                                  "score": 55,
                                  "num_children": 3,
                                  "author": 109580,
                                  "replies": [
                                    {
                                      "id": "ie642js",
                                      "text": "Hey now, some of the great value products are quite good -the individual frozen biscuits, Neapolitan ice cream sandwiches, and blue cheese (the best I’ve ever bought except for really fancy brands from Whole Foods).\n\nThey’re much better than Jordan Peterson.",
                                      "timestamp": "2022-06-29 10:34:14",
                                      "score": 14,
                                      "num_children": 2,
                                      "author": 359163,
                                      "replies": [
                                        {
                                          "id": "ie6t5ya",
                                          "text": "I like their salt and vinegar chips. Definitely better than Jordan Peterson, a guru for men who need to be told how to wipe their asses.",
                                          "timestamp": "2022-06-29 14:23:58",
                                          "score": 3,
                                          "num_children": 0,
                                          "author": 125506,
                                          "replies": []
                                        },
                                        {
                                          "id": "ie81a4v",
                                          "text": "Great value chicken nuggets are awesome in an air fryer. Some Ore-Ida McDonalds-style fries from the frozen foods department makes a quick dinner at home with them and some dip.",
                                          "timestamp": "2022-06-29 19:15:30",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 99671,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "ie6gvnb",
                                      "text": "I just say \"roundy's brand\"",
                                      "timestamp": "2022-06-29 12:47:35",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 98543,
                                      "replies": []
                                    },
                                    {
                                      "id": "ie6pt32",
                                      "text": "I used to work for the company and like to remind people that the Walmart brand started out as \"Sam's American Choice\" and was originally aimed at selling American made goods. It then transformed to \"Sam's Choice\" (after Sam died, I have to point out). Now it's \"Great Value\". The evolution of a business model.",
                                      "timestamp": "2022-06-29 13:59:36",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 39935,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "ie6azkp",
                              "text": "I think I get why it's easier.  People are struggling with fear, isolation, misinformation overload, and simple answers feel better.  It sucks, but it makes a lot of sense.",
                              "timestamp": "2022-06-29 11:52:12",
                              "score": 1,
                              "num_children": 0,
                              "author": 64439,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ie60z4a",
                          "text": "Jordan Peterson is one of the masters of saying a bunch of meaningless bullshit that sounds somewhat intelligent. Also making up his own definitions of commonly known terms and then whining about differences in defining characteristics. Like how he defines god for example, purposely defines it in an utterly ridiculous manner to leave the door open for it's existence. He even will never blatantly admit he believes in god when questioned about it, will beat around the bush to avoid looking dumb. (When it is clear to everyone that he is a ridiculous evangelical)",
                          "timestamp": "2022-06-29 09:52:51",
                          "score": 21,
                          "num_children": 1,
                          "author": 162841,
                          "replies": [
                            {
                              "id": "ie6un69",
                              "text": "He's a hypocrite too. Tells people to fix their own shit before worrying about others, but his entire life was falling apart and he only stopped trying to \"fix\" other people when he was in a literal coma. Tells people to clean up their room, but when he streams from his own home it's clear that his room is a complete mess. Tells people to be precise in their speech, and then he only ever speaks in the most non-committal and circumlocuitous way possible so you can't possibly nail him down as any one position or another without getting a vague objection back.",
                              "timestamp": "2022-06-29 14:34:25",
                              "score": 5,
                              "num_children": 0,
                              "author": 65151,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ie5bg39",
                          "text": "If I was just a bit dumber, that could have been me. I really enjoyed Peterson's video lectures before he went off the deep end in politics. He's one of those people who makes me physically ill now.",
                          "timestamp": "2022-06-29 04:27:45",
                          "score": 26,
                          "num_children": 1,
                          "author": 211210,
                          "replies": [
                            {
                              "id": "ie5i47r",
                              "text": "Guess I’m glad I didn’t keep up with him after the Benzos situation…",
                              "timestamp": "2022-06-29 05:38:49",
                              "score": 13,
                              "num_children": 1,
                              "author": 152065,
                              "replies": [
                                {
                                  "id": "ie5k5ul",
                                  "text": "Lol, he went off the deep end way before the benzo addiction almost killed him.",
                                  "timestamp": "2022-06-29 06:03:01",
                                  "score": 13,
                                  "num_children": 0,
                                  "author": 211210,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ie6dl5m",
                          "text": "Honestly, if your taken in by the utterly stupid logic of Jordan Peterson;. There wasn't much of a brain to be washed.",
                          "timestamp": "2022-06-29 12:17:52",
                          "score": 3,
                          "num_children": 0,
                          "author": 146103,
                          "replies": []
                        },
                        {
                          "id": "ie71g2k",
                          "text": "Hey, honest question, what’s fascistic about Jordan Peterson? I’ve recently came across a bunch of his videos and didn’t get those vibes.",
                          "timestamp": "2022-06-29 15:20:58",
                          "score": 2,
                          "num_children": 1,
                          "author": 96728,
                          "replies": [
                            {
                              "id": "ie7nm6r",
                              "text": "He makes a few good points about how a lot of young men are essentially perceived as worthless by our society, and are crushed by toxic masculinity, but he also makes a lot of dumb points about religion and \"western values\" and about how personal responsibility can solve the world's problems. Also he is a raging hypocrite. Also he rabidly promotes a diet which is neither healthy nor sustainable. However I don't see how he is a fascist in almost any meaningful way.",
                              "timestamp": "2022-06-29 17:44:52",
                              "score": 2,
                              "num_children": 1,
                              "author": 333002,
                              "replies": [
                                {
                                  "id": "ie7pi7c",
                                  "text": "Cool thanks for some context. \nAs I do with almost everyone else, I see sense and agree with a bunch of what he says, and disagree with a bunch too. So I guess he’s human, and so not perfect. Who knew?\nI will say however, that I’ve seen about 4 clips from interviews where he’s talking about his diet, and he’s not at all promoting it, actually the opposite. He often talked about how horribly bland and difficult it is to maintain and explicitly urged others not to do it unless they themselves had whatever autoimmune issues seemingly run in his family. I’d argue most points about religion are dumb, and would also suggest that if our world leaders took personal responsibility perhaps the world would be at least a little better.",
                                  "timestamp": "2022-06-29 17:57:08",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 96728,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ie6qu7b",
                          "text": "[deleted]",
                          "timestamp": "2022-06-29 14:07:12",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ie7ofr0",
                              "text": "I don't think Peterson is nearly as dangerous as people make him out to be (from what I have seen of his lectures). In essence he preaches personal responsibility, personal liberty, pro-science. However some of his ideas are flat out wrong, needlessly strident, or actively damaging (such as his meat-only diet). I consider myself pretty hard left (anti-nation-state, anti-billionaires, pacifist, pro-immigration etc.) and I find some of his lectures to be of value and containing interesting thoughts. I think you need to be able to sort the good from the bad though, just like with anyone else.",
                              "timestamp": "2022-06-29 17:50:12",
                              "score": 1,
                              "num_children": 0,
                              "author": 333002,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ie80j6y",
                          "text": "Then those coworkers are not very good at parsing information.",
                          "timestamp": "2022-06-29 19:10:30",
                          "score": 1,
                          "num_children": 0,
                          "author": 99671,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ie444yk",
                      "text": "You have very valid and serious points",
                      "timestamp": "2022-06-28 22:31:02",
                      "score": 35,
                      "num_children": 0,
                      "author": 56041,
                      "replies": []
                    },
                    {
                      "id": "ie6qq46",
                      "text": "Just be careful.. the same ideas are on the left as well. Be skeptical about everyone!",
                      "timestamp": "2022-06-29 14:06:22",
                      "score": 1,
                      "num_children": 1,
                      "author": 113216,
                      "replies": [
                        {
                          "id": "ie6t4ui",
                          "text": "The left: we want to take power away from the rich and we want to stop fascists.\n\nThe right: we want to exterminate minorities and turn women into broodmares for the state.\n\nYou: holy shit guys both sides are awful.",
                          "timestamp": "2022-06-29 14:23:45",
                          "score": 2,
                          "num_children": 1,
                          "author": 185216,
                          "replies": [
                            {
                              "id": "ie82yt9",
                              "text": "Yep... Anything extreme is.... well... extreme..  BTW that's a pretty balanced view of each side/s . If you see the world as black and white, you miss the subtleties of both.. and that's as wrong as going all in on either.",
                              "timestamp": "2022-06-29 19:26:41",
                              "score": 0,
                              "num_children": 0,
                              "author": 113216,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ie4sfx6",
                      "text": "So you're saying that user is possibly the next mass shooter...I think we should alert reddit and the authorities.",
                      "timestamp": "2022-06-29 01:42:23",
                      "score": -13,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ie4tazg",
                          "text": "Just saying don't go crazy with attacking and ridiculing them.  Try to enlighten if you can.\n\nOnce they're a fascist fully, they're not human and need to be destroyed.  Prevent that if possible.",
                          "timestamp": "2022-06-29 01:49:22",
                          "score": 17,
                          "num_children": 1,
                          "author": 185216,
                          "replies": [
                            {
                              "id": "ie4tocy",
                              "text": "As an atheist I have no desire to spend a limited resource such as time on enlightening such people and if they end up being destroyed by the authorities, well that's a shame.",
                              "timestamp": "2022-06-29 01:52:22",
                              "score": -3,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "ie4u572",
                                  "text": "What limited resource?  Your time and attention?  You're on Reddit, it's clearly something in surplus.\n\nI would strongly encourage you to try helping others first, if possible.  It's usually free and easy.",
                                  "timestamp": "2022-06-29 01:56:08",
                                  "score": 21,
                                  "num_children": 2,
                                  "author": 185216,
                                  "replies": [
                                    {
                                      "id": "ie4yhg0",
                                      "text": "yes, time, attention, empathy.  these are limited resources.  after two years of pandemic and 4 years of trump i am EXHAUSTED, physically and emotionally.  i do not have enough of myself to give to a proto-fascist to save them from themselves.  maybe someone else does, i do not.",
                                      "timestamp": "2022-06-29 02:30:58",
                                      "score": 6,
                                      "num_children": 0,
                                      "author": 71127,
                                      "replies": []
                                    },
                                    {
                                      "id": "ie4uf9a",
                                      "text": "There are plenty of non-nazis that I can help instead of people like that though. Starting with women (and other men) that feel terrible due to the SC decisions.",
                                      "timestamp": "2022-06-29 01:58:21",
                                      "score": -1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "ie4uw2y",
                                          "text": "No person is born a fascist.  They are raised and effected into them.  We can affect others similarly, and should do so before resorting to anti-fascist violence.",
                                          "timestamp": "2022-06-29 02:02:08",
                                          "score": 7,
                                          "num_children": 0,
                                          "author": 185216,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "ie5bgt0",
                                  "text": "> and if they end up being destroyed by the authorities, well that's a shame.\n\nthe problem is when they aren't destroyed by the authorities and then BECOME the authorities",
                                  "timestamp": "2022-06-29 04:27:57",
                                  "score": 6,
                                  "num_children": 0,
                                  "author": 190878,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ie6ke7y",
                      "text": "Indeed.\n\nThis is also how many churches operate. Get the children and teens under their control early, and get the doctrine deep in their brains. This is also why they scream \"groomer\", \"it's a choice\", \"it's a demonic possession\" and all that rubbish to other people that don't agree with their positions. It's their projection on how the world works.",
                      "timestamp": "2022-06-29 13:17:29",
                      "score": 1,
                      "num_children": 0,
                      "author": 400715,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ie43cq5",
                  "text": "That comment history is a hell of a ride.",
                  "timestamp": "2022-06-28 22:25:12",
                  "score": 36,
                  "num_children": 2,
                  "author": 306405,
                  "replies": [
                    {
                      "id": "ie44b7y",
                      "text": "They need to watch “13th” on Netflix to get a clear view of what is really happening",
                      "timestamp": "2022-06-28 22:32:21",
                      "score": 27,
                      "num_children": 1,
                      "author": 56041,
                      "replies": [
                        {
                          "id": "ie4ty9r",
                          "text": "Yeah lets watch tv to understand. There’s never an agenda at work with television shows",
                          "timestamp": "2022-06-29 01:54:36",
                          "score": -17,
                          "num_children": 2,
                          "author": 154874,
                          "replies": [
                            {
                              "id": "ie56mkn",
                              "text": "You can derive value consuming _anything_ when armed with critical thinking and an understanding of the value of objectivity.",
                              "timestamp": "2022-06-29 03:41:21",
                              "score": 10,
                              "num_children": 0,
                              "author": 50457,
                              "replies": []
                            },
                            {
                              "id": "ie4wkoq",
                              "text": "They are failing all of their classes, a documentary would the best option than books, right? Lol",
                              "timestamp": "2022-06-29 02:15:39",
                              "score": 8,
                              "num_children": 0,
                              "author": 56041,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ie4r6x1",
                      "text": "Wow... you don't even need to dive into his comment history for a wild ride, the \"About You\" part covers alot.",
                      "timestamp": "2022-06-29 01:32:11",
                      "score": 5,
                      "num_children": 0,
                      "author": 359652,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ie48dik",
                  "text": "They got so mad that they went and made a post about being mad \"people don't wear hats in western countries\". People are wild lol",
                  "timestamp": "2022-06-28 23:02:46",
                  "score": 19,
                  "num_children": 0,
                  "author": 167119,
                  "replies": []
                },
                {
                  "id": "ie4nsv7",
                  "text": "13th is a good one.\n\nIt is free to watch on YouTube: https://youtu.be/krfcq5pF8u8",
                  "timestamp": "2022-06-29 01:04:07",
                  "score": 16,
                  "num_children": 0,
                  "author": 242674,
                  "replies": []
                },
                {
                  "id": "ie47co0",
                  "text": "Seconding 13th, so good. The prison system in the US is basically slavery pt 2",
                  "timestamp": "2022-06-28 22:55:02",
                  "score": 24,
                  "num_children": 1,
                  "author": 298324,
                  "replies": [
                    {
                      "id": "ie5p2af",
                      "text": "That's the whole point. Punitive slavery was never outlawed.",
                      "timestamp": "2022-06-29 07:05:00",
                      "score": 12,
                      "num_children": 0,
                      "author": 383029,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ie62w9z",
                  "text": "Oh boy. That's gonna be too hard to watch for me but a good recommendation for people who aren't familiar with the subject matter. Good suggestion. \n\nMore info: https://www.imdb.com/title/tt5895028/",
                  "timestamp": "2022-06-29 10:19:05",
                  "score": 2,
                  "num_children": 0,
                  "author": 297341,
                  "replies": []
                },
                {
                  "id": "ie4o3al",
                  "text": "public shaming",
                  "timestamp": "2022-06-29 01:06:31",
                  "score": -3,
                  "num_children": 1,
                  "author": 8427,
                  "replies": [
                    {
                      "id": "ie4obkb",
                      "text": "I have no issue with public shaming Christofascism",
                      "timestamp": "2022-06-29 01:08:33",
                      "score": 14,
                      "num_children": 1,
                      "author": 56041,
                      "replies": [
                        {
                          "id": "ie4y0we",
                          "text": "You’re not publicly shaming christofascism, you’re attacking the user.",
                          "timestamp": "2022-06-29 02:27:16",
                          "score": -6,
                          "num_children": 2,
                          "author": 8427,
                          "replies": [
                            {
                              "id": "ie5v6g1",
                              "text": "Yes, who is a christofacist defending christofacism...",
                              "timestamp": "2022-06-29 08:30:13",
                              "score": 5,
                              "num_children": 0,
                              "author": 10793,
                              "replies": []
                            },
                            {
                              "id": "ie56q33",
                              "text": "Why not both?",
                              "timestamp": "2022-06-29 03:42:16",
                              "score": 3,
                              "num_children": 0,
                              "author": 50457,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ie5hkyh",
                  "text": "Depressed guy goin through a hard time?  Perfect target huh.  Keep it rollin dude!",
                  "timestamp": "2022-06-29 05:32:35",
                  "score": -1,
                  "num_children": 0,
                  "author": 69345,
                  "replies": []
                },
                {
                  "id": "ie82deu",
                  "text": "Netflix put it on youtube\n\n13TH | FULL FEATURE | Netflix - YouTube\nhttps://www.youtube.com/watch?v=krfcq5pF8u8",
                  "timestamp": "2022-06-29 19:22:41",
                  "score": 1,
                  "num_children": 0,
                  "author": 178250,
                  "replies": []
                },
                {
                  "id": "ie8xumu",
                  "text": "Why does any of that matter? I didn’t see the deleted comment, but why punch down?\n\nIsn’t it also low to tag him so people can dm him threats and hateful messages?",
                  "timestamp": "2022-06-29 22:55:19",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "ieb7695",
                  "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for using abusive language, personal attacks, being a dick, or fighting with other users. These activities are against the [rules](https://www.reddit.com/r/atheism/wiki/guidelines).   \r\nConnected comments may also be removed for the same reason, though editing out the direct attack may merit your comment being restored.  Users who don't cease this behavior may get banned temporarily or permanently.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                  "timestamp": "2022-06-30 12:34:16",
                  "score": 1,
                  "num_children": 0,
                  "author": 122319,
                  "replies": []
                }
              ]
            },
            {
              "id": "ie48rdt",
              "text": "[deleted]",
              "timestamp": "2022-06-28 23:05:42",
              "score": -13,
              "num_children": 1,
              "replies": [
                {
                  "id": "ie49h10",
                  "text": "The distinction lies in the difference between the state and the collective well-being of society.  If someone violently accosts me, the state should remove them from society and punish them, briefly, in the interest of public peace...not in its own interest.\n\nAnother example is mass vaccination.  I find this acceptable because it promotes public health, and is a net positive for humanity as a whole to have fewer of us dying.  It does not solely exist to put government interest over individual liberty.  It puts collective liberty ahead of individual liberty.",
                  "timestamp": "2022-06-28 23:11:15",
                  "score": 27,
                  "num_children": 2,
                  "author": 185216,
                  "replies": [
                    {
                      "id": "ie4fkpq",
                      "text": "[removed]",
                      "timestamp": "2022-06-28 23:58:45",
                      "score": -1,
                      "num_children": 3,
                      "replies": [
                        {
                          "id": "ie4i7rk",
                          "text": "I'm not the person you asked, but I'd say that the biggest difference here is that forcing a woman to give birth against her will would always be unacceptable, as permitting something that vile would effectively cancel out any other hypothetical benefits to society. Society incentivizing women to have more children would be the only correct option in this case.\n\nFurther, a major difference between mandated vaccinations and forced birth is that nobody is being forced under pain of imprisonment to get vaccinated. People who insist on refusing vaccination are free to remove themselves from situations where vaccination is required. So no more air travel, concerts, or restaurants for them, but they preserve their bodily autonomy if they really want to.",
                          "timestamp": "2022-06-29 00:19:27",
                          "score": 12,
                          "num_children": 0,
                          "author": 55169,
                          "replies": []
                        },
                        {
                          "id": "ie4ixhc",
                          "text": "It still limits freedom of choice. Unless the society is in dire need of younger work force or it'll collapse, even then that's still debatable. Vaccination is immediate and deals with individual's safety as well as collective well being, completely a different case.",
                          "timestamp": "2022-06-29 00:25:08",
                          "score": 8,
                          "num_children": 0,
                          "author": 135752,
                          "replies": []
                        },
                        {
                          "id": "ie4pt44",
                          "text": "If we aren't going to force living organ and tissue donation, (the liver can regrow in a few months) then we shouldn't be forcing women to donate the use of their uterus.\n\nHell, we can't even make organ donation opt OUT rather than opt IN because christians would lose their goddamn minds.  \n\nWe don't even mandate fucking blood or plasma donation when supplies are low and that's minimally invasive.  \n\nWhy are people with uteruses the only people who should be forced to donate the use of their bodies to keep another \"person\" alive?  And let's not forget that the procedure known as an abortion is lifesaving for women who have had an incomplete miscarriage, to diagnose or resolve certain medical conditions, and in some cases is needed after a birth if the placenta is not completely delivered.\n\nThe government should not be involved in medical decisions, but if they are going to cross that line, then let's apply it equally.  All male adults should be required to register for living organ and tissue donation for blood, plasma, liver and bone marrow.  Think of all the lives that would be saved if there were shorter waitlists for donations of this type.   Women of childbearing age should be excluded, as these procedures could be a danger to a fetus.  No medical costs or paid leave will be provided for these procedures.  They can use FMLA, and take unpaid leave unless their employer will pay for their leave, especially after liver donation which is major abdominal surgery.  If they have complications, too bad, so sad.",
                          "timestamp": "2022-06-29 01:20:55",
                          "score": 8,
                          "num_children": 0,
                          "author": 178008,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ie5nci0",
                      "text": "Personally, I feel individual liberty should trump the collective well-being. A lot of really bad shit can be excused away for the sake of the \"collective well-being\". I'm not anti-vax or anything, I'm vaccinated and everyone else should be too. I don't think the government should force its hand, though. I know people want to be safe but giving up your liberty for the sake of that safety is how we get things like the patriot act.",
                      "timestamp": "2022-06-29 06:42:27",
                      "score": -2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ie6cbmh",
                          "text": "That's why vaccinations were not forced, you could opt out and keep your individual liberty noone was forcefully vaccinating people.",
                          "timestamp": "2022-06-29 12:05:34",
                          "score": 2,
                          "num_children": 1,
                          "author": 25348,
                          "replies": [
                            {
                              "id": "ie74swt",
                              "text": "Yeah, but a lot of people supported forced vaccinations like the ones in Canada.",
                              "timestamp": "2022-06-29 15:42:57",
                              "score": 0,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "ie75b0v",
                                  "text": "Really were people vaccinated against their wishes, held down and vaccinated forcefully? Or did they decide to get a vaccine to participate in society?\n\nHave not heard about any forced vaccinations if you can provide the source, please.",
                                  "timestamp": "2022-06-29 15:46:14",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 25348,
                                  "replies": [
                                    {
                                      "id": "ie7j79o",
                                      "text": "They were mandatory for foreigners coming into the country and for Canadians returning. Nationwide mandatory covid vaccinations were also proposed but I hadn't heard anything else about it since that trucker strike, which was the reason they were doing it.\n\nhttps://theconversation-com.cdn.ampproject.org/v/s/theconversation.com/amp/covid-19-vaccine-mandates-would-likely-face-legal-hurdles-in-canada-174856?amp_js_v=a6&amp_gsa=1&usqp=mq331AQKKAFQArABIIACAw%3D%3D#aoh=16565225532834&referrer=https%3A%2F%2Fwww.google.com&amp_tf=From%20%251%24s&ampshare=https%3A%2F%2Ftheconversation.com%2Fcovid-19-vaccine-mandates-would-likely-face-legal-hurdles-in-canada-174856\n\nhttps://travel.gc.ca/travel-covid/travel-restrictions/covid-vaccinated-travellers-entering-canada\n\nhttps://www.canada.ca/en/transport-canada/news/2022/06/suspension-of-the-mandatory-vaccination-requirement-for-domestic-travellers-and-federally-regulated-transportation-workers.html\n\nYou don't have to be held down and vaccinated forcefully for them to be mandatory. Vaccines are mandatory for any kids going to public school, but they don't hold them down to do it.",
                                      "timestamp": "2022-06-29 17:16:15",
                                      "score": 0,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "ie7laqc",
                                          "text": "So there's the difference between being mandatory to participate in society and forced.\n\nYou can keep your bodily autonomy if you want, you are not forced to get a vaccine, my initial point stands.",
                                          "timestamp": "2022-06-29 17:29:41",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 25348,
                                          "replies": [
                                            {
                                              "id": "ie7soah",
                                              "text": "There's no real difference between mandatory and forced. Mandatory vaccines are incompatible with a free and liberal democracy.\n\nThe government demanding we get vaccinated or else \"this bad thing happens\" is using force. The government should not have the right to demand anything of us but to respect the rights of others. This is why all drug laws, prostitution laws, gambling laws, etc are also incompatible with a free society. If the government can restrict your freedom of movement through the public sphere or block your passage home or your ability to earn a wage when you have committed no crime against another, it is an authoritarian government.",
                                              "timestamp": "2022-06-29 18:18:08",
                                              "score": 0,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "ie80jag",
                                                  "text": "Good argument for anarchism.",
                                                  "timestamp": "2022-06-29 19:10:31",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 25348,
                                                  "replies": [
                                                    {
                                                      "id": "ie8lki3",
                                                      "text": "It doesn't have to be anarchy for it to be a free society. The government just needs to respect people's rights to their own bodies.",
                                                      "timestamp": "2022-06-29 21:29:17",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ie6bkv7",
              "text": "By that logic taxation is facist,\n\nbecause the state decides what happens with part of the money I earn instead of me.",
              "timestamp": "2022-06-29 11:58:11",
              "score": 1,
              "num_children": 1,
              "author": 266269,
              "replies": [
                {
                  "id": "ie6tt6o",
                  "text": "You're partially correct, which is the worst kind of correct.  Your tax dollars do fund police departments (there to protect the state and capital above all else) and the military (there to \"intervene\" in other countries so we can steal their elections and resources).\n\nYou're forgetting that your tax dollars do also go to helping others, and to help the government do the things it needs to do, i.e. environmental regulations, labor protections, provide general welfare, infrastructure, mass vaccinations, disease mitigation, etc.\n\nMy largest criticisms of the government are all the things in the first paragraph...and that rich people and their goons sabotage it so it does all the good stuff less effectively as well.",
                  "timestamp": "2022-06-29 14:28:32",
                  "score": 1,
                  "num_children": 1,
                  "author": 185216,
                  "replies": [
                    {
                      "id": "ie6zn63",
                      "text": "Your response is irrelevant to my point, it is done regardless of my choices",
                      "timestamp": "2022-06-29 15:08:48",
                      "score": 0,
                      "num_children": 1,
                      "author": 266269,
                      "replies": [
                        {
                          "id": "ie7mw2d",
                          "text": "You can choose to get behind certain causes, candidates, or engage in direct action for or against whatever you want.  Do your best to shape a government that does what you actually want it to do.",
                          "timestamp": "2022-06-29 17:40:04",
                          "score": 1,
                          "num_children": 1,
                          "author": 185216,
                          "replies": [
                            {
                              "id": "ie7ovmg",
                              "text": "I was talking about the flaws of your view as it defines all governments as facist.\n\nNothing I said reflects how I think about government",
                              "timestamp": "2022-06-29 17:53:04",
                              "score": 1,
                              "num_children": 1,
                              "author": 266269,
                              "replies": [
                                {
                                  "id": "ie96mqq",
                                  "text": "A logically flawed premise cannot itself be used to illustrate a flaw in logic. The two things being compared are not conceptually similar, such that no “if one is this the other is also” statement can be true.",
                                  "timestamp": "2022-06-30 00:01:31",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 195149,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ie70m7w",
              "text": "Forgive me for asking, but I recently watched a video about what fascism is and the guy, after analysing both Italy and Nazi Germany described it as \"Doing everything In your power to make the nation great\" or something like that. And specified that the \"anything\" part is vague in order to let the \"thing\" be anything the fascists want. Me being 16 and new to these kinds of things am confused by all the different definitions im encountering. What the hell is fascism?",
              "timestamp": "2022-06-29 15:15:24",
              "score": 1,
              "num_children": 0,
              "author": 334129,
              "replies": []
            },
            {
              "id": "ie8y4cg",
              "text": "I think specifically the push for more children is to combat the overall downward trend of population in the long term.",
              "timestamp": "2022-06-29 22:57:18",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ie99yg5",
                  "text": "That downward trend isn't a problem.  It's a good thing.  A VERY good thing.  And the Hallmark of a stable, peaceful, healthy country and world.\n\nGoogle Hans and Ola Rosling and read their research.",
                  "timestamp": "2022-06-30 00:27:03",
                  "score": 1,
                  "num_children": 1,
                  "author": 185216,
                  "replies": [
                    {
                      "id": "ie9a72j",
                      "text": "I don’t need to, I don’t have a horse in that race. I don’t know why people immediately see support for a cause where there is nothing but an objective statement.\n\nFwiw: the research of 2 people does *not* mean that pop decline is all around good. There will be down sides.",
                      "timestamp": "2022-06-30 00:28:55",
                      "score": 0,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ie9aovd",
                          "text": "There is an ENTIRE body of research around this phenomenon.  I'm just providing two easily accessible examples.\n\nYou can also read Levitt and Dubner on how birth rates and access to contraceptive and family planning services relate to crime rates and generational poverty.",
                          "timestamp": "2022-06-30 00:32:43",
                          "score": 1,
                          "num_children": 1,
                          "author": 185216,
                          "replies": [
                            {
                              "id": "ie9azuv",
                              "text": "My man I literally do not care. I stated something objective and indisputable, then said that I don’t have a a horse in the race, and then added a caveat that *even if X many people publish research stating that pop decline is good/bad, there will still be some factors of it that are the opposite*.\n\nWhy are you so mad? Why do you assume people that you try to instigate fights with are unaware of your profound knowledge?",
                              "timestamp": "2022-06-30 00:35:04",
                              "score": 0,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ie5owuw",
              "text": "Wait, wtf are you talking about? How is being against a choice that disproportionately terminates black and brown pregnancies the position of white supremacy?",
              "timestamp": "2022-06-29 07:03:04",
              "score": -2,
              "num_children": 0,
              "author": 383029,
              "replies": []
            },
            {
              "id": "ie5hk09",
              "text": "I am a nazi.",
              "timestamp": "2022-06-29 05:32:16",
              "score": -12,
              "num_children": 0,
              "author": 333423,
              "replies": []
            },
            {
              "id": "ie5z4qx",
              "text": "Umm I’d look at what Mussolini did and said when he declared fascism. Fascism has nothing to do with the states needs. The first thing that happened in Italy where the idea started was publicly elected officials were removed from office and rich industrialist who were loyal to the leader were put in there place. Same with Germany. Obviously the Germans had racist bs going on too but that has nothing to do with fascism. The extreme control and punishment of oppression is inherent to fascism because the leader and the wealthy want to maintain power.",
              "timestamp": "2022-06-29 09:26:22",
              "score": -2,
              "num_children": 0,
              "author": 158520,
              "replies": []
            }
          ]
        },
        {
          "id": "ie42yd0",
          "text": "It's what Jesus wants.",
          "timestamp": "2022-06-28 22:22:12",
          "score": 17,
          "num_children": 2,
          "author": 246525,
          "replies": [
            {
              "id": "ie51395",
              "text": "you cant know that, only I can know that because he told me, and only me.\n\npls send money.",
              "timestamp": "2022-06-29 02:52:41",
              "score": 23,
              "num_children": 1,
              "author": 55609,
              "replies": [
                {
                  "id": "ie5ynkn",
                  "text": "God loves you, and he needs MONEY!",
                  "timestamp": "2022-06-29 09:19:33",
                  "score": 9,
                  "num_children": 1,
                  "author": 354285,
                  "replies": [
                    {
                      "id": "iejmr1g",
                      "text": "She also needs more money.",
                      "timestamp": "2022-07-02 05:26:26",
                      "score": 1,
                      "num_children": 0,
                      "author": 199576,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iejncct",
              "text": "You made a choice in leaving your guy, and making any choice makes it easier for you to make other choices, which is good. Choosing makes you stronger.",
              "timestamp": "2022-07-02 05:33:17",
              "score": 2,
              "num_children": 0,
              "author": 199576,
              "replies": []
            }
          ]
        },
        {
          "id": "ie402g9",
          "text": "[removed]",
          "timestamp": "2022-06-28 22:00:48",
          "score": -43,
          "num_children": 1,
          "replies": [
            {
              "id": "ie40c58",
              "text": "Being forced to have a child definitely counts.",
              "timestamp": "2022-06-28 22:02:48",
              "score": 43,
              "num_children": 0,
              "author": 277167,
              "replies": []
            }
          ]
        },
        {
          "id": "ie4um0x",
          "text": "Bruh I ain't even Christian but even I know the majority of em just wanna go about their normal business like everyone else. Grow up.",
          "timestamp": "2022-06-29 01:59:53",
          "score": -38,
          "num_children": 3,
          "author": 105786,
          "replies": [
            {
              "id": "ie4w9cz",
              "text": "Demonstrably false.",
              "timestamp": "2022-06-29 02:13:08",
              "score": 29,
              "num_children": 1,
              "author": 14092,
              "replies": [
                {
                  "id": "ie573at",
                  "text": "I _am_ Christian and you’re absolutely right.  Nobody’s turning people off to Christ faster than idiot public conservatives.",
                  "timestamp": "2022-06-29 03:45:40",
                  "score": 19,
                  "num_children": 0,
                  "author": 50457,
                  "replies": []
                }
              ]
            },
            {
              "id": "ie5wymw",
              "text": "Take a gander at r/catholicism at the moment and you’ll see otherwise. They want total moral control over every aspect of life",
              "timestamp": "2022-06-29 08:55:43",
              "score": 11,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ie65rep",
              "text": "We'll \"grow up\" when Christians stop thinking it's \"normal buisness\" to criticize complete strangers for living their lives.\n\nNo, of course not all of them are bad just like not all American cops have a superiority complex. But there's certainly enough for it to be acknowledged as a legitimate problem to society.",
              "timestamp": "2022-06-29 10:55:04",
              "score": 6,
              "num_children": 0,
              "author": 107359,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ie3qkf1",
      "text": "It's nice to see some rare positivity from this sub. I'm glad you were able to make a decision that positively impacts your life. I stayed with a partner that I disagreed with for far too long because I didn't respect myself enough. I'm so happy to see young people doing better! Good luck in your life, I hope you continue to do well!",
      "timestamp": "2022-06-28 20:54:31",
      "score": 58,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie3hfuq",
      "text": "Congrats to you.",
      "timestamp": "2022-06-28 19:54:16",
      "score": 53,
      "num_children": 1,
      "replies": [
        {
          "id": "ie774jb",
          "text": "It's weird to congrats someone on a break up but in this case it's a W for sure.",
          "timestamp": "2022-06-29 15:58:12",
          "score": 2,
          "num_children": 0,
          "author": 344200,
          "replies": []
        }
      ]
    },
    {
      "id": "ie3hyxr",
      "text": "This is the way.\n\nNever settle for someone who doesn't think you deserve bodily autonomy.",
      "timestamp": "2022-06-28 19:57:43",
      "score": 601,
      "num_children": 5,
      "author": 68985,
      "replies": [
        {
          "id": "ie3pzlc",
          "text": "This right here. And any other form of autonomy.",
          "timestamp": "2022-06-28 20:50:42",
          "score": 113,
          "num_children": 1,
          "author": 197833,
          "replies": [
            {
              "id": "ikd6bgd",
              "text": "What if someone wants to use their bodily autonomy to refuse vaccines?",
              "timestamp": "2022-08-15 10:25:25",
              "score": 0,
              "num_children": 0,
              "author": 386319,
              "replies": []
            }
          ]
        },
        {
          "id": "ie4xrfn",
          "text": "Never settle for anyone who makes you compromise any of your core values.",
          "timestamp": "2022-06-29 02:25:07",
          "score": 39,
          "num_children": 3,
          "author": 384860,
          "replies": [
            {
              "id": "ie69twj",
              "text": "But note that it's healthy to be with someone who encourages you to examine those values.",
              "timestamp": "2022-06-29 11:40:28",
              "score": 6,
              "num_children": 0,
              "author": 187732,
              "replies": []
            },
            {
              "id": "ie574mp",
              "text": "Concur.",
              "timestamp": "2022-06-29 03:46:01",
              "score": 9,
              "num_children": 0,
              "author": 68985,
              "replies": []
            },
            {
              "id": "ie6p4sb",
              "text": "Does an unborn baby not have bodily autonomy as well tho?",
              "timestamp": "2022-06-29 13:54:30",
              "score": 0,
              "num_children": 0,
              "author": 190829,
              "replies": []
            }
          ]
        },
        {
          "id": "ie58bwl",
          "text": "If they don't think you deserve bodily autonomy imagine what else they don't think you'll deserve.  Op pulled a matrix dodge here.",
          "timestamp": "2022-06-29 03:57:22",
          "score": 15,
          "num_children": 0,
          "author": 244332,
          "replies": []
        },
        {
          "id": "ie404io",
          "text": "This is the way.",
          "timestamp": "2022-06-28 22:01:14",
          "score": 13,
          "num_children": 1,
          "author": 145103,
          "replies": [
            {
              "id": "ie4ksxk",
              "text": "tHiS iS the WaY",
              "timestamp": "2022-06-29 00:40:14",
              "score": -9,
              "num_children": 1,
              "replies": [
                {
                  "id": "ie4rnh2",
                  "text": "Yeah it's weird people are quoting that terrible star wars show like a cult.",
                  "timestamp": "2022-06-29 01:35:56",
                  "score": -8,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ie6vvwp",
          "text": "Ladies particularly: we're in a scary time. Do not commit yourself to any man who you wouldn't want making decisions about your rights. Because the way things are going he just might be a mole on the inside. Do you want a man who's going to report you for birth control pills or an accidental miscarriage in the name of \"pro life?\"",
          "timestamp": "2022-06-29 14:43:10",
          "score": 2,
          "num_children": 0,
          "author": 211506,
          "replies": []
        }
      ]
    },
    {
      "id": "ie3heqo",
      "text": "[deleted]",
      "timestamp": "2022-06-28 19:54:03",
      "score": 533,
      "num_children": 3,
      "replies": [
        {
          "id": "ie3yrx5",
          "text": "Yes, this is very good for her. I hope that she finds someone who deserves her, and respects her bodily autonomy.",
          "timestamp": "2022-06-28 21:51:32",
          "score": 87,
          "num_children": 0,
          "author": 196362,
          "replies": []
        },
        {
          "id": "ie4b59v",
          "text": "[removed]",
          "timestamp": "2022-06-28 23:24:18",
          "score": -66,
          "num_children": 3,
          "replies": [
            {
              "id": "ie4dimz",
              "text": "[deleted]",
              "timestamp": "2022-06-28 23:42:41",
              "score": 35,
              "num_children": 1,
              "replies": [
                {
                  "id": "ie4ettb",
                  "text": "It's a bad attempt to sound like he agrees while saying the opposite.  It's a sad troll",
                  "timestamp": "2022-06-28 23:52:57",
                  "score": 26,
                  "num_children": 0,
                  "author": 301985,
                  "replies": []
                }
              ]
            },
            {
              "id": "ie4d61f",
              "text": "at its core*",
              "timestamp": "2022-06-28 23:39:56",
              "score": 12,
              "num_children": 0,
              "author": 284031,
              "replies": []
            },
            {
              "id": "ie4gpey",
              "text": "[removed]",
              "timestamp": "2022-06-29 00:07:35",
              "score": 6,
              "num_children": 1,
              "replies": [
                {
                  "id": "ie4npf9",
                  "text": "[removed]",
                  "timestamp": "2022-06-29 01:03:21",
                  "score": 2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ie51cge",
          "text": "[removed]",
          "timestamp": "2022-06-29 02:54:51",
          "score": -2,
          "num_children": 1,
          "replies": [
            {
              "id": "ie56a3w",
              "text": "Good for you, or, bad for you.\n\nThere are ways to remove this from your notification list from what I'm aware of.",
              "timestamp": "2022-06-29 03:38:10",
              "score": 4,
              "num_children": 0,
              "author": 196362,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ie3jw2l",
      "text": "You deserve better than someone who denies you your autonomy.",
      "timestamp": "2022-06-28 20:10:06",
      "score": 374,
      "num_children": 0,
      "author": 221845,
      "replies": []
    },
    {
      "id": "ie3l3xc",
      "text": "You have chosen...wisely. Congrats. It's not easy, but it's already better for you.",
      "timestamp": "2022-06-28 20:18:12",
      "score": 30,
      "num_children": 0,
      "author": 388794,
      "replies": []
    },
    {
      "id": "ie3kbj9",
      "text": "I'm proud of you. That takes a lot of courage to step into the unknown and leave relative security. I hope you find someone even better than you imagine.",
      "timestamp": "2022-06-28 20:12:56",
      "score": 24,
      "num_children": 0,
      "author": 359414,
      "replies": []
    },
    {
      "id": "ie3kbqi",
      "text": "There are plenty of fish in the sea, my friend. Bon courage!",
      "timestamp": "2022-06-28 20:12:58",
      "score": 22,
      "num_children": 2,
      "author": 51806,
      "replies": [
        {
          "id": "ie3mpks",
          "text": "Plenty of Darwin fish in the sea ☺️☺️",
          "timestamp": "2022-06-28 20:28:55",
          "score": 14,
          "num_children": 0,
          "author": 68689,
          "replies": []
        },
        {
          "id": "ie48lru",
          "text": "Maybe, maybe not. You may end up alone. Who cares.\n\n\nIt shouldn’t  have anything to do with if there are fish in the sea you leave religious fruitcakes.",
          "timestamp": "2022-06-28 23:04:31",
          "score": 9,
          "num_children": 1,
          "author": 82100,
          "replies": [
            {
              "id": "ieatp2q",
              "text": "She won't be alone. She'll have dozens of cats.",
              "timestamp": "2022-06-30 10:08:21",
              "score": 1,
              "num_children": 1,
              "author": 242518,
              "replies": [
                {
                  "id": "iee84yr",
                  "text": "Good. Cats are better than many humans, especially the Religious nuts jobs trying to overthrow our country.",
                  "timestamp": "2022-07-01 01:10:06",
                  "score": 1,
                  "num_children": 0,
                  "author": 82100,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ie3p32b",
      "text": "I really think it's awesome that you're standing up for what you believe, even though it's a tough thing to do. I think you'll be happier overall by finding someone who agrees with you.",
      "timestamp": "2022-06-28 20:44:42",
      "score": 22,
      "num_children": 0,
      "author": 48973,
      "replies": []
    },
    {
      "id": "ie3lvrz",
      "text": "Yes ! I remember that post and honestly I think you are saving yourself from future heartache. It's so strange to me when people use their Christianity as a compass toward the Pro Choice / Life when the god of their bible kills kids or orders kids to be killed with high frequency.... >\\_\\_<  Good for you !!",
      "timestamp": "2022-06-28 20:23:22",
      "score": 146,
      "num_children": 2,
      "author": 373842,
      "replies": [
        {
          "id": "ie508ie",
          "text": "Once you are born, no one is safe from the bloodthirsty sky daddy.",
          "timestamp": "2022-06-29 02:45:30",
          "score": 15,
          "num_children": 1,
          "author": 273933,
          "replies": [
            {
              "id": "ie71gb5",
              "text": "Hell, sky daddy also likes his book to provide advice on how to conduct abortions, so I’d say he seems pretty confused about what he wants!",
              "timestamp": "2022-06-29 15:21:01",
              "score": 3,
              "num_children": 1,
              "author": 235699,
              "replies": [
                {
                  "id": "ie7b9fo",
                  "text": "Contradictions in the Bible?? No way!",
                  "timestamp": "2022-06-29 16:25:06",
                  "score": 3,
                  "num_children": 0,
                  "author": 273933,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ie4o4e4",
          "text": "You ought to remember the post. It was just from yesterday",
          "timestamp": "2022-06-29 01:06:48",
          "score": -27,
          "num_children": 1,
          "author": 360346,
          "replies": [
            {
              "id": "ie4o7tx",
              "text": "Yeah but I read a lot of posts LOL 😂",
              "timestamp": "2022-06-29 01:07:38",
              "score": 14,
              "num_children": 1,
              "author": 373842,
              "replies": [
                {
                  "id": "ie5d2jo",
                  "text": "[removed]",
                  "timestamp": "2022-06-29 04:43:41",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ie5d9mt",
                      "text": "Thank you for your contribution. Unfortunately, personal attacks and/or flaming are not allowed in this subreddit per the [subreddit rules](http://www.reddit.com/r/atheism/wiki/guidelines). \n\nIf you have any questions, please don't hesitate to [contact the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fatheism). Thank you for your cooperation.",
                      "timestamp": "2022-06-29 04:45:43",
                      "score": 2,
                      "num_children": 0,
                      "author": 318636,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ie3n17o",
      "text": "From one stranger to another, congratulations, and thank you for some good news :-)",
      "timestamp": "2022-06-28 20:31:03",
      "score": 21,
      "num_children": 0,
      "author": 28249,
      "replies": []
    },
    {
      "id": "ie3ie5i",
      "text": "I'm really happy for you. I don't know where you live or how easy it is to meet people. But in my experience, they are out there. And there are more athiests than we might think.\n\nFor instance, on dating apps, people in general are afraid to state that they are agnostic or athiest. They may leave it blank. Or even indicate spiritual but not religious. So give people a chance to open up.\n\nI live in New Orleans and so many people are Catholic. My goal had been just to meet someone who wasn't Catholic! Thankfully, I did a lot better than that!",
      "timestamp": "2022-06-28 20:00:26",
      "score": 124,
      "num_children": 5,
      "author": 94930,
      "replies": [
        {
          "id": "ie3sm1i",
          "text": "Yeah I just make sure to filter out any main denomination, but by me that eliminates like 90% of the dating pool 😔",
          "timestamp": "2022-06-28 21:08:18",
          "score": 12,
          "num_children": 0,
          "author": 335782,
          "replies": []
        },
        {
          "id": "ie3xv3k",
          "text": "... soooooo Vampire?  TV may have ruined New Orleans for me.",
          "timestamp": "2022-06-28 21:45:05",
          "score": 9,
          "num_children": 1,
          "author": 298168,
          "replies": [
            {
              "id": "ie3yifs",
              "text": "Ha. Nah, just a liberal athiest like myself. But we did work on the new Interview with the Vampire TV series together recently.",
              "timestamp": "2022-06-28 21:49:41",
              "score": 14,
              "num_children": 1,
              "author": 94930,
              "replies": [
                {
                  "id": "ie3zn5z",
                  "text": "(definitely Vampire)",
                  "timestamp": "2022-06-28 21:57:45",
                  "score": 8,
                  "num_children": 0,
                  "author": 298168,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ie3z65c",
          "text": "It's still pretty taboo to openly tell people you are atheist or non-religious since you can easily trigger somebody who can retaliate against you. This is even the case sometimes more blue/liberal areas where it's implied people are pretty secular but people still don't exactly come out and tell you their religious preferences most of the time unless they ARE religious. Also, it is not unheard of to see the same religious folks who claim they are being \"oppressed\" all the time by secular culture and values to react very negatively and try to do something to \"fix\" or teach a lesson or those who are open about their lack of faith.",
          "timestamp": "2022-06-28 21:54:22",
          "score": 27,
          "num_children": 2,
          "author": 109053,
          "replies": [
            {
              "id": "ie480lv",
              "text": "For someone living in Europe, that sounds so strange. Nobody gives a fuck here if or in which imaginary friend you believe in.",
              "timestamp": "2022-06-28 23:00:04",
              "score": 35,
              "num_children": 3,
              "author": 202949,
              "replies": [
                {
                  "id": "ie4jqdo",
                  "text": "For whatever it's worth, it sounds very strange to me as someone living in the US in a blue state, too. It's not \"taboo\" where I am at all. It also doesn't come up much, but I've told plenty of people over the years that I wasn't religious. None of them cared or had any kind of negative reaction that I can recall.\n\nThat said, I'm sure it's very different in the south and other areas with a higher percentage of religious people.",
                  "timestamp": "2022-06-29 00:31:36",
                  "score": 13,
                  "num_children": 2,
                  "author": 354050,
                  "replies": [
                    {
                      "id": "ie4ogpv",
                      "text": "Yup.. I live in south Texas and basically just say \"I dunno\" when the topic comes up..",
                      "timestamp": "2022-06-29 01:09:46",
                      "score": 3,
                      "num_children": 0,
                      "author": 137974,
                      "replies": []
                    },
                    {
                      "id": "ie4s0fz",
                      "text": "I would say it's about the same for me but it is just something you don't come out and say openly too much. Meanwhile, you still have the relatively small but more vocal folks who are more open about their religion though I imagine still much less so than in places like the bible belt.",
                      "timestamp": "2022-06-29 01:38:54",
                      "score": 2,
                      "num_children": 0,
                      "author": 109053,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ie4shs0",
                  "text": "Sounds awesome but instead, we are basically going through like a  sort of Christian crusade/inquisition type era where a small but incredibly vocal and influential Evangelical minority is fighting tooth and nail to stay relevant and avoid seeing their church attendance/\"customers\" dwindle down to nothing as you have seen happen in Europe post-WWII.",
                  "timestamp": "2022-06-29 01:42:49",
                  "score": 8,
                  "num_children": 0,
                  "author": 109053,
                  "replies": []
                },
                {
                  "id": "ie74qs2",
                  "text": "Same. Idk if it's just the region I live in, but the rare thing here is to find someone religious under the age of 40. To the point that when meeting someone new you just assume that they're also atheist/agnostic. I have just one friend who is Catholic, and she isn't even religious at all. She thinks that there's a higher power, but she doesn't follow any religious rules.",
                  "timestamp": "2022-06-29 15:42:33",
                  "score": 1,
                  "num_children": 0,
                  "author": 44840,
                  "replies": []
                }
              ]
            },
            {
              "id": "ie45kci",
              "text": "I recently decided I’m tired of hiding and no longer do. But I’m in a position of relative power so it’s easier for me than most. Terrible state of affairs we are in.",
              "timestamp": "2022-06-28 22:41:41",
              "score": 10,
              "num_children": 0,
              "author": 367378,
              "replies": []
            }
          ]
        },
        {
          "id": "ie60bkp",
          "text": "Hey, another Nola atheist!  We’re out there!",
          "timestamp": "2022-06-29 09:43:34",
          "score": 2,
          "num_children": 0,
          "author": 199436,
          "replies": []
        },
        {
          "id": "ie93n2r",
          "text": "I dunno I was on a dating app at one point.  I put atheist.  Funny thing is most guys kinda ignored it and were surprised when they found out.  One guy even texted me blah blah you seem like a nice Christian girl blah blah.  I just thought to myself did he even read my profile? .  No wonder they believe some crusty old book...they don't read it!",
          "timestamp": "2022-06-29 23:38:30",
          "score": 1,
          "num_children": 0,
          "author": 295521,
          "replies": []
        }
      ]
    },
    {
      "id": "ie3mt0k",
      "text": "Good!\nI recently had a situation where I ran into my childhood crush in a bar. We hung out all night and had a great time. Zero indication that she’s very Christian until I spoke with her the next day. 👎 Not going down that path. I have no problem if it helps her (and awesome she doesn’t preach it), but there is no way I can ever be with someone who is very religious.",
      "timestamp": "2022-06-28 20:29:33",
      "score": 79,
      "num_children": 4,
      "author": 387109,
      "replies": [
        {
          "id": "ie53ido",
          "text": "I was recently on a couple of dating apps. The number of women that put in their profile \"God is first\" was disturbing. Immediately swiped left. Had to delete the apps when they both said I had swiped through all of the women in my area.",
          "timestamp": "2022-06-29 03:13:28",
          "score": 22,
          "num_children": 0,
          "author": 344103,
          "replies": []
        },
        {
          "id": "ie40jsn",
          "text": ">I have no problem if it helps her\n\nReligion 'helps people' in the same way that opiates help addicts. My MIL is like this. She'll say 'it helps me', but then lose sleep over the thought that her loved ones are being tormented by demons in hell. Then she'll pray about it and feel better. A problem caused by religion in the first place, solved by religion.",
          "timestamp": "2022-06-28 22:04:23",
          "score": 88,
          "num_children": 4,
          "author": 129759,
          "replies": [
            {
              "id": "ie4m4te",
              "text": "As someone who’s struggled with both opiates and religion I agree with the comparison.",
              "timestamp": "2022-06-29 00:50:46",
              "score": 28,
              "num_children": 0,
              "author": 272381,
              "replies": []
            },
            {
              "id": "ie5htys",
              "text": "Religion: giving people hope in a world torn apart by religion.",
              "timestamp": "2022-06-29 05:35:27",
              "score": 14,
              "num_children": 0,
              "author": 343634,
              "replies": []
            },
            {
              "id": "ie58sfh",
              "text": "Holy shit this is a great analogy.",
              "timestamp": "2022-06-29 04:01:43",
              "score": 1,
              "num_children": 0,
              "author": 198016,
              "replies": []
            },
            {
              "id": "ie842an",
              "text": "Yup. Religion is *built* around taking advantage of emotionally/mentally vulnerable people, offering hope and/or absolution in exchange for obedience. It's downright predatory, to put it very mildly.",
              "timestamp": "2022-06-29 19:33:54",
              "score": 1,
              "num_children": 0,
              "author": 314755,
              "replies": []
            }
          ]
        },
        {
          "id": "ie4y75f",
          "text": "I asked someone once how old the earth was. I was not prepared for his answer to be 6000 years. Things de-escalated quickly.",
          "timestamp": "2022-06-29 02:28:40",
          "score": 8,
          "num_children": 0,
          "author": 337982,
          "replies": []
        },
        {
          "id": "ie50mk4",
          "text": "The harm religion does to all of humanity certainly outweighs the help it gives to any individuals.",
          "timestamp": "2022-06-29 02:48:46",
          "score": 6,
          "num_children": 0,
          "author": 189267,
          "replies": []
        }
      ]
    },
    {
      "id": "ie3iqsg",
      "text": "I'm glad you decided to do what's right for you. You're no good for anyone else if you don't take care of yourself, first.",
      "timestamp": "2022-06-28 20:02:42",
      "score": 51,
      "num_children": 0,
      "author": 51690,
      "replies": []
    },
    {
      "id": "ie3jwkb",
      "text": "Good for you!  With everything going on its a true pleasure to hear some uplifting news.",
      "timestamp": "2022-06-28 20:10:12",
      "score": 16,
      "num_children": 0,
      "author": 90476,
      "replies": []
    },
    {
      "id": "ie3nr76",
      "text": "Congratulations on making a decision and for choosing yourself!",
      "timestamp": "2022-06-28 20:35:53",
      "score": 16,
      "num_children": 0,
      "author": 19930,
      "replies": []
    },
    {
      "id": "ie3ho1n",
      "text": "Glad you made it out! 🤗",
      "timestamp": "2022-06-28 19:55:43",
      "score": 40,
      "num_children": 0,
      "author": 361741,
      "replies": []
    },
    {
      "id": "ie44u03",
      "text": "I hope more people get courage like you. Fuck Christianity",
      "timestamp": "2022-06-28 22:36:13",
      "score": 12,
      "num_children": 0,
      "author": 355415,
      "replies": []
    },
    {
      "id": "ie4vl23",
      "text": "If he's having premarital sex, he's already a hypocrite.",
      "timestamp": "2022-06-29 02:07:43",
      "score": 13,
      "num_children": 0,
      "author": 536,
      "replies": []
    },
    {
      "id": "ie3hz08",
      "text": "Congrats to you!",
      "timestamp": "2022-06-28 19:57:44",
      "score": 12,
      "num_children": 0,
      "author": 43796,
      "replies": []
    },
    {
      "id": "ie3lt3n",
      "text": "Good for you!",
      "timestamp": "2022-06-28 20:22:53",
      "score": 13,
      "num_children": 0,
      "author": 45660,
      "replies": []
    },
    {
      "id": "ie45ely",
      "text": "I am in the process of cutting out any pro-forced-birth friends. You did the right thing!",
      "timestamp": "2022-06-28 22:40:30",
      "score": 13,
      "num_children": 0,
      "author": 281864,
      "replies": []
    },
    {
      "id": "ie3rf2v",
      "text": "Good for you! Find a PARTNER, someone who supports you and compliments you (and you them).",
      "timestamp": "2022-06-28 21:00:10",
      "score": 12,
      "num_children": 0,
      "author": 296051,
      "replies": []
    },
    {
      "id": "ie444du",
      "text": "More of us care than you think. Happy for you.",
      "timestamp": "2022-06-28 22:30:55",
      "score": 13,
      "num_children": 0,
      "author": 253698,
      "replies": []
    },
    {
      "id": "ie3mxcw",
      "text": "Congrats op. You deserve to be happy, and while things were okay now, they wouldn't stay that way. If religion influences his stance on abortion it likely influences other things he believes too and it's better to get out now than later when it's too hard. I wish you all the best!",
      "timestamp": "2022-06-28 20:30:21",
      "score": 11,
      "num_children": 0,
      "author": 380892,
      "replies": []
    },
    {
      "id": "ie3nxyx",
      "text": "Congrats and good riddance",
      "timestamp": "2022-06-28 20:37:10",
      "score": 12,
      "num_children": 1,
      "author": 165716,
      "replies": [
        {
          "id": "ieds5ma",
          "text": "Yeah. Poo to that moron! I was dating a guy like that. Everytime we got in the car, he would put on that cult Christian music (I refer to all of these people as \"cults\" because that's what they are) He would use consistent phrases with me like \" the tongue has the power of life and death\" or constantly saying \"in Jesus mighty name\" I couldn't stand being around him. My days were almost constantly in a depressing state of mind. He was no saint but the guy thought he was. It was the best thing I ever did was completely cutting him out of my life. The guy was a total Christofacist! Real sicko! So happy for you. You made the right move. These types of cults want to control people and they are incorrect about God and everything. They make me sick.",
          "timestamp": "2022-06-30 23:06:34",
          "score": 1,
          "num_children": 0,
          "author": 153982,
          "replies": []
        }
      ]
    },
    {
      "id": "ie3nyvg",
      "text": "I was in the same relationship and he keeper pushing his believes on to me until he finally he tried giving me an ultimatum but It was never going to work",
      "timestamp": "2022-06-28 20:37:20",
      "score": 13,
      "num_children": 0,
      "author": 73181,
      "replies": []
    },
    {
      "id": "ie46idv",
      "text": "Just be careful... he's expecting you to return in 3 days.",
      "timestamp": "2022-06-28 22:48:45",
      "score": 11,
      "num_children": 1,
      "author": 311720,
      "replies": [
        {
          "id": "ie7qcas",
          "text": "Lol, I'd give you two upvotes If I could",
          "timestamp": "2022-06-29 18:02:36",
          "score": 1,
          "num_children": 1,
          "author": 335135,
          "replies": [
            {
              "id": "ie7uaml",
              "text": "Just do what everyone else does with my comments and click the upvote twice.",
              "timestamp": "2022-06-29 18:28:51",
              "score": 1,
              "num_children": 0,
              "author": 311720,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ie5dfds",
      "text": "Man, I’m Christian but I’m also pro-choice since I think it is everyone’s right to make their own choices and come to terms with it with whatever belief system / morality they choose to follow. I legitimately don’t know why it’s so hard for these ridiculous hard line Christians to understand this. \n\nAs a fellow redditor, just want to let people know that not all Christians are crazy! (I know this is probably not a popular subreddit for me to post in)\n\nAlso - Op! Good for you on standing up to your beliefs, you deserve a better bf!",
      "timestamp": "2022-06-29 04:47:23",
      "score": 11,
      "num_children": 1,
      "author": 284923,
      "replies": [
        {
          "id": "iedshmj",
          "text": "The music on the radio is immoral. Who wants to ride around with that frame of mind all day? I don't.",
          "timestamp": "2022-06-30 23:09:03",
          "score": 1,
          "num_children": 0,
          "author": 153982,
          "replies": []
        }
      ]
    },
    {
      "id": "ie3og6g",
      "text": "Congrats! Major problem removed ✌^^",
      "timestamp": "2022-06-28 20:40:30",
      "score": 9,
      "num_children": 0,
      "author": 305299,
      "replies": []
    },
    {
      "id": "ie3nx77",
      "text": "I am happy for you. Thanks for the update. I always wonder what happens on posts like this.",
      "timestamp": "2022-06-28 20:37:01",
      "score": 11,
      "num_children": 0,
      "author": 119515,
      "replies": []
    },
    {
      "id": "ie3rfrg",
      "text": "Well, I wish you luck.  Dating isn’t easy.  But there are damned sure options out there for partners in life that respect you.  \n\nJust don’t look on Christian mingle;)",
      "timestamp": "2022-06-28 21:00:18",
      "score": 9,
      "num_children": 0,
      "author": 201981,
      "replies": []
    },
    {
      "id": "ie3ywdo",
      "text": "Warms my frigid, reptilian-atheist heart to read about an anti-choice person actually feeling some consequences for their mentality.\n\nGood on you OP.",
      "timestamp": "2022-06-28 21:52:26",
      "score": 9,
      "num_children": 0,
      "author": 29852,
      "replies": []
    },
    {
      "id": "ie45fi6",
      "text": "Congrats. You will still miss parts of him, but just know that you will be better off for this.",
      "timestamp": "2022-06-28 22:40:41",
      "score": 9,
      "num_children": 0,
      "author": 388786,
      "replies": []
    },
    {
      "id": "ie45hh6",
      "text": "I mean... I couldn't be with someone who thought I was a lesser being. Kudos to those who can do that.",
      "timestamp": "2022-06-28 22:41:05",
      "score": 9,
      "num_children": 0,
      "author": 92076,
      "replies": []
    },
    {
      "id": "ie3rnms",
      "text": "You, as everyone else, deserves to be yourself and not be controlled by someone else.\n\nTake care and stay safe!",
      "timestamp": "2022-06-28 21:01:46",
      "score": 10,
      "num_children": 0,
      "author": 242458,
      "replies": []
    },
    {
      "id": "ie3tsfd",
      "text": "I've been there. Break-ups are never fun but it was the correct decision for you short and long-term future. Those situations get worse over time.\n\nI'm proud of you for making such a tough decision!",
      "timestamp": "2022-06-28 21:16:25",
      "score": 8,
      "num_children": 0,
      "author": 150005,
      "replies": []
    },
    {
      "id": "ie3xrm0",
      "text": "You'll get a lot of deserved support here, I just want to add that your gut told you something was off and you came to a conclusion to make a difficult change.\n\nWhatever comes next for you, you know you can trust your gut.\n\nIn addition, your life is normal. It might take some time to feel like you're moving toward something instead of away from something, and this sub has strong feelings about religion, but the point is that your everyday life can be one where you are not being gaslit. That is a normal life.",
      "timestamp": "2022-06-28 21:44:24",
      "score": 9,
      "num_children": 0,
      "author": 242674,
      "replies": []
    },
    {
      "id": "ie3o733",
      "text": "Here's to a Christian-free future!",
      "timestamp": "2022-06-28 20:38:50",
      "score": 35,
      "num_children": 1,
      "author": 256165,
      "replies": [
        {
          "id": "ie45wgp",
          "text": "Here’s to the rest following suit!",
          "timestamp": "2022-06-28 22:44:11",
          "score": 5,
          "num_children": 0,
          "author": 351411,
          "replies": []
        }
      ]
    },
    {
      "id": "ie3mt3k",
      "text": "Happy for you :) !",
      "timestamp": "2022-06-28 20:29:34",
      "score": 7,
      "num_children": 0,
      "author": 351680,
      "replies": []
    },
    {
      "id": "ie3qrvo",
      "text": "Congrats on the start of your new life!",
      "timestamp": "2022-06-28 20:55:53",
      "score": 5,
      "num_children": 0,
      "author": 393340,
      "replies": []
    },
    {
      "id": "ie3sk1m",
      "text": "Yes 🙌🏽.  Always trust your gut. You made the right choice.",
      "timestamp": "2022-06-28 21:07:55",
      "score": 7,
      "num_children": 0,
      "author": 70709,
      "replies": []
    },
    {
      "id": "ie3y0m2",
      "text": "You're not just some random woman on the internet. You're some random woman who did something good for herself. Good luck.",
      "timestamp": "2022-06-28 21:46:09",
      "score": 7,
      "num_children": 0,
      "author": 191524,
      "replies": []
    },
    {
      "id": "ie49kfh",
      "text": "If all women stopped fucking republican men, they'd fix their shitty views.",
      "timestamp": "2022-06-28 23:11:59",
      "score": 8,
      "num_children": 0,
      "author": 260899,
      "replies": []
    },
    {
      "id": "ie4rqj6",
      "text": "You've just confirmed you're never going to be forced to carry his baby to term in the most legal way possible, so he's got no right to complain. Congratulations.",
      "timestamp": "2022-06-29 01:36:38",
      "score": 7,
      "num_children": 0,
      "author": 6187,
      "replies": []
    },
    {
      "id": "ie3kvij",
      "text": "Great",
      "timestamp": "2022-06-28 20:16:38",
      "score": 6,
      "num_children": 0,
      "author": 407643,
      "replies": []
    },
    {
      "id": "ie3r6tu",
      "text": "We hope for your continued happiness, and the best to you going forward!",
      "timestamp": "2022-06-28 20:58:39",
      "score": 5,
      "num_children": 0,
      "author": 157070,
      "replies": []
    },
    {
      "id": "ie3s4o3",
      "text": "I'm sure it's difficult, but I know in my own case I would have felt a lot more difficulty down the line just living with it.\n\nBest of luck going forward",
      "timestamp": "2022-06-28 21:04:59",
      "score": 5,
      "num_children": 0,
      "author": 194219,
      "replies": []
    },
    {
      "id": "ie3x0qy",
      "text": "Sending you lots of tots and pears. ❤️",
      "timestamp": "2022-06-28 21:39:08",
      "score": 6,
      "num_children": 0,
      "author": 52675,
      "replies": []
    },
    {
      "id": "ie3xbee",
      "text": "This was a good decision, as difficult as it was. The difference in your beliefs would only have continued to cause more and more conflicts over time.",
      "timestamp": "2022-06-28 21:41:14",
      "score": 6,
      "num_children": 0,
      "author": 88959,
      "replies": []
    },
    {
      "id": "ie3zngw",
      "text": "My ex fiancée was a fundamentalist Christian. Honestly I just don't think couples are compatible with vastly different religious views. It's best to find someone compatible who shares your core values.",
      "timestamp": "2022-06-28 21:57:48",
      "score": 5,
      "num_children": 0,
      "author": 173477,
      "replies": []
    },
    {
      "id": "ie42uay",
      "text": "We need more atheist singles in the Bible belt. Or I just need to move.",
      "timestamp": "2022-06-28 22:21:21",
      "score": 8,
      "num_children": 0,
      "author": 372321,
      "replies": []
    },
    {
      "id": "ie47hl3",
      "text": "As a clinical Psychologist,  I have had to walk away from 20+yr relationships because of the abhorrent disregard for views not \"Christian-Nationalist\". I can't be associated with those who wouldn't wear a mask...but think its ok that Roe v Wade sbould be overturned.  \n\nYou have my support.",
      "timestamp": "2022-06-28 22:56:04",
      "score": 5,
      "num_children": 1,
      "author": 356576,
      "replies": [
        {
          "id": "ie6jv5y",
          "text": "True courage. You both have my support.",
          "timestamp": "2022-06-29 13:13:03",
          "score": 1,
          "num_children": 0,
          "author": 83277,
          "replies": []
        }
      ]
    },
    {
      "id": "ie4aoc5",
      "text": "stop fucking christians.",
      "timestamp": "2022-06-28 23:20:40",
      "score": 7,
      "num_children": 0,
      "author": 408581,
      "replies": []
    },
    {
      "id": "ie65i75",
      "text": "Men can’t even wrap their minds around me not dating them because they are Christian or Muslim. They think I can somehow ignore that part of them and see them as the men they are. No thank you.",
      "timestamp": "2022-06-29 10:52:01",
      "score": 7,
      "num_children": 0,
      "author": 99649,
      "replies": []
    },
    {
      "id": "ie3plmh",
      "text": "Now that’s nonsense you’re a fellow human being and that wasn’t easy. The love and support is real.",
      "timestamp": "2022-06-28 20:48:10",
      "score": 5,
      "num_children": 0,
      "author": 91404,
      "replies": []
    },
    {
      "id": "ie3sjl9",
      "text": "Good luck going forward, couldn't have been easy",
      "timestamp": "2022-06-28 21:07:50",
      "score": 5,
      "num_children": 0,
      "author": 92339,
      "replies": []
    },
    {
      "id": "ie3sya0",
      "text": "I needed a happy ending today thanks 😊 .",
      "timestamp": "2022-06-28 21:10:39",
      "score": 6,
      "num_children": 0,
      "author": 297181,
      "replies": []
    },
    {
      "id": "ie3u82z",
      "text": "I'm in awe of your strength.  Good for you!",
      "timestamp": "2022-06-28 21:19:27",
      "score": 5,
      "num_children": 0,
      "author": 81465,
      "replies": []
    },
    {
      "id": "ie414qt",
      "text": "You'll be better off in life like this, seriously! Cutting out my ultra-conservative religious family and a few friends has been the biggest weight off of my shoulders that I can't even describe.\n\nYou go girl!",
      "timestamp": "2022-06-28 22:08:41",
      "score": 4,
      "num_children": 0,
      "author": 367192,
      "replies": []
    },
    {
      "id": "ie41e12",
      "text": "Whereas it's true that I don't know you, I do care, your post made me smile. I only saw it now, didn't read the original post, but it seems you got good advice.\nDating religious people is quite difficult, since they have a whole different ontology, from the Universe's beginning on, they derive values from that distorted view.\nI've tried to stay clear from religious women for that reason. \nI wish you all the best in this fresh stage of your life, OP, cheers ;)",
      "timestamp": "2022-06-28 22:10:37",
      "score": 4,
      "num_children": 0,
      "author": 335135,
      "replies": []
    },
    {
      "id": "ie47ly5",
      "text": "OP, no doubt you will find someone **who respects something as basic as your own rights to your own body**. When such time comes, you will look back and view what happened with the Christian boyfriend with relief and happiness. \n\nBest of luck to you.",
      "timestamp": "2022-06-28 22:56:58",
      "score": 4,
      "num_children": 0,
      "author": 94238,
      "replies": []
    },
    {
      "id": "ie4b63m",
      "text": "I didn’t respond yesterday when I saw your post, but I did say out loud, “Fuck that dude.” So, good for you!",
      "timestamp": "2022-06-28 23:24:29",
      "score": 5,
      "num_children": 0,
      "author": 4849,
      "replies": []
    },
    {
      "id": "ie4gl8j",
      "text": "Honestly, no hate like Christian love",
      "timestamp": "2022-06-29 00:06:38",
      "score": 6,
      "num_children": 0,
      "author": 190114,
      "replies": []
    },
    {
      "id": "ie5lbm3",
      "text": "Someone who believes that you don't deserve the same rights they have is called a bigot. I have no reason to associate with people who would oppress me or my loved ones.",
      "timestamp": "2022-06-29 06:17:00",
      "score": 5,
      "num_children": 0,
      "author": 148915,
      "replies": []
    },
    {
      "id": "ie5rxoq",
      "text": "I left my ex SO 2 months ago, after 2 years.  \nHer beliefs grew stronger as we were together and wanted me to believe. Which I could not do, I went with her to church and read the bible but that wasnt enough.  \nIt was tough at the beginning, and she will always have a place in my heart.  \n\n\nI've met this other girl last weekend and MAN do I feel free. I was able to speak and discuss without thinking twice. She cursed once and I was like, oh man curse again, it felt relieving.  \n\n\nYou did the right thing.",
      "timestamp": "2022-06-29 07:44:22",
      "score": 5,
      "num_children": 1,
      "author": 368990,
      "replies": [
        {
          "id": "iedt7jj",
          "text": "Yeah that's how mine acted. He always acted like I didn't believe and HE did. People like that just aren't worth the time of day.",
          "timestamp": "2022-06-30 23:14:25",
          "score": 1,
          "num_children": 0,
          "author": 153982,
          "replies": []
        }
      ]
    },
    {
      "id": "ie63tnt",
      "text": "There is absolutely no way I could date a Christian. They decided women are disposable. Fuck that shit.",
      "timestamp": "2022-06-29 10:31:07",
      "score": 5,
      "num_children": 0,
      "author": 217695,
      "replies": []
    },
    {
      "id": "ie3wv07",
      "text": "I literally just commented on your last post and I was also surprised at how many responses you got. Thank you for the update and I am so proud of you. Any sort of breakup, regardless of the reason, takes guts and way to go you. I am so glad you found that you *could* lean on us for help.",
      "timestamp": "2022-06-28 21:38:00",
      "score": 4,
      "num_children": 0,
      "author": 354004,
      "replies": []
    },
    {
      "id": "ie3xv3l",
      "text": "I read your original post and I had a feeling you just needed validation for what you’d already decided.\n\nThere are some differences that are too vast to bridge",
      "timestamp": "2022-06-28 21:45:05",
      "score": 3,
      "num_children": 0,
      "author": 106022,
      "replies": []
    },
    {
      "id": "ie41wdu",
      "text": "We are all just some random person on the internet, but as we meet and help each other we become part of a world.",
      "timestamp": "2022-06-28 22:14:23",
      "score": 4,
      "num_children": 0,
      "author": 26645,
      "replies": []
    },
    {
      "id": "ie42340",
      "text": "Good for you, girl. Also, thanks from a sister.",
      "timestamp": "2022-06-28 22:15:47",
      "score": 4,
      "num_children": 0,
      "author": 273043,
      "replies": []
    },
    {
      "id": "ie4421o",
      "text": "Good riddance.",
      "timestamp": "2022-06-28 22:30:26",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie44b5r",
      "text": "Right call.",
      "timestamp": "2022-06-28 22:32:20",
      "score": 4,
      "num_children": 0,
      "author": 306470,
      "replies": []
    },
    {
      "id": "ie44dcq",
      "text": "I wish i could double upvote, seriously good.",
      "timestamp": "2022-06-28 22:32:48",
      "score": 5,
      "num_children": 0,
      "author": 394374,
      "replies": []
    },
    {
      "id": "ie44euw",
      "text": "Good for you op. I know it's hard but you're doing what's best in the long run.",
      "timestamp": "2022-06-28 22:33:07",
      "score": 3,
      "num_children": 0,
      "author": 290477,
      "replies": []
    },
    {
      "id": "ie48un4",
      "text": "Fantastic!\n\nAnti-choice boyfriends deserve to be with anti-choice girlfriends and I know that is going to dwindle their dating pool, but they do not deserve to have any of us who are smart enough to recognize that we should have control over our own bodies. You want some submissive slag who is fine with letting herself be treated as nothing more than breeding chattel? Go to fucking church and find your woman; leave the rest of us alone.",
      "timestamp": "2022-06-28 23:06:24",
      "score": 4,
      "num_children": 0,
      "author": 96945,
      "replies": []
    },
    {
      "id": "ie4bh1q",
      "text": "Bravo! \n\nPlease do be careful. Some guys on the receiving end of rejection don't react kindly. Do take a moment to be extra aware of your surroundings, for the next few weeks.",
      "timestamp": "2022-06-28 23:26:51",
      "score": 4,
      "num_children": 0,
      "author": 17781,
      "replies": []
    },
    {
      "id": "ie4dzs9",
      "text": "Good for you, life would have been difficult under your previous circumstances.",
      "timestamp": "2022-06-28 23:46:26",
      "score": 5,
      "num_children": 0,
      "author": 162008,
      "replies": []
    },
    {
      "id": "ie4pubk",
      "text": "I don't know you, but I'm proud of you. You made the right choice.",
      "timestamp": "2022-06-29 01:21:12",
      "score": 4,
      "num_children": 0,
      "author": 236639,
      "replies": []
    },
    {
      "id": "ie4s8th",
      "text": "I missed your post yesterday but you are seen and and valued by this other random woman on the internet!!  You did a very hard but  great thing for yourself!!  Your future is bright.",
      "timestamp": "2022-06-29 01:40:49",
      "score": 4,
      "num_children": 0,
      "author": 119716,
      "replies": []
    },
    {
      "id": "ie4xilp",
      "text": "Based on what you described, it sounds like you made the right choice. That being said it sounds like you did really care about him. If part of you is feeling sadness or loss, that normal.",
      "timestamp": "2022-06-29 02:23:10",
      "score": 4,
      "num_children": 0,
      "author": 341170,
      "replies": []
    },
    {
      "id": "ie4yava",
      "text": "You made a tough choice. My husband and I were married in the church.  But as people grow, and learn, thankfully we embraced atheism together.  He may or may not have grown with you, but when you don’t appreciate the rights of others from the get go,that is a large hurdle.",
      "timestamp": "2022-06-29 02:29:30",
      "score": 4,
      "num_children": 0,
      "author": 271699,
      "replies": []
    },
    {
      "id": "ie51x7a",
      "text": "Grew up fundamentalist, almost cult like. From a young age realized I was going to die in the apocalypse because I didn’t believe everything “God” said. Unlearned a shit ton of awful stuff. Dated a guy until he said “gay people disgust me”. I don’t consider myself gay but I do fight for peoples rights, so that was a no brainer. I don’t date people who say something about religion because we won’t be compatible and I won’t negotiate human rights",
      "timestamp": "2022-06-29 02:59:48",
      "score": 3,
      "num_children": 0,
      "author": 195009,
      "replies": []
    },
    {
      "id": "ie57nkm",
      "text": "I was wondering about this week’s events triggering women to wake up and end relationships (and friendships). I fantasized about it actually. Did he cry? I really hope he cried.",
      "timestamp": "2022-06-29 03:50:55",
      "score": 4,
      "num_children": 0,
      "author": 48499,
      "replies": []
    },
    {
      "id": "ie5foqn",
      "text": "That’s the best part of this sub. Only thoughts and no fucking prayers.",
      "timestamp": "2022-06-29 05:11:19",
      "score": 4,
      "num_children": 0,
      "author": 385092,
      "replies": []
    },
    {
      "id": "ie5hsfk",
      "text": "No. You're not some random woman on the internet. You're a human being that deserves to be treated as such.",
      "timestamp": "2022-06-29 05:34:57",
      "score": 4,
      "num_children": 0,
      "author": 70821,
      "replies": []
    },
    {
      "id": "ie5lgsx",
      "text": "Christian+atheist relationships barely ever work. Especially when there is a child. It starts with \"Oh, grandma wanted to baptize the kid, do it for her, she is old and needs comfort, and you don't believe in god anyway, so it's not a big deal, right?\". Then you have to get involved in all the bullshit because \"hey, it's your child and it's a very important day for them, any responsible parent would do that\". \n\nThen you realize you just got tricked to support the existence of an institution you oppose, and you did some clown shit, just because you dated a nutjob sect member. Don't go for it.",
      "timestamp": "2022-06-29 06:18:44",
      "score": 4,
      "num_children": 1,
      "author": 240563,
      "replies": [
        {
          "id": "iedszta",
          "text": "She never said she was an atheist. You must be a left wing Christian fascist. Just because people don't want to be a part of the cults, doesn't mean they don't believe in God. Bite your tongue.",
          "timestamp": "2022-06-30 23:12:48",
          "score": 0,
          "num_children": 1,
          "author": 153982,
          "replies": [
            {
              "id": "ief36zm",
              "text": "> left wing christian fascist \n\nThat makes no damn sense. Please don't call me christian, let's not take things too far. \n\nAlso, my description relates to any relationship of two people with different beliefs. They might even be both christians, just protestant and catholic for example. One who believes stronger will try to impose this belief on a child. I mean if they truly believe their path leads to salvation, they will want the same for their child, and if they don't believe that, they wouldn't subscribe to this religion.  \n\nI had several examples in my life that showed how it may end, and i can tell you, it's just not worth the risk.",
              "timestamp": "2022-07-01 05:49:09",
              "score": 1,
              "num_children": 0,
              "author": 240563,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ie5o8i6",
      "text": "Good for you, I'm glad you left someone who wouldn't respect you.",
      "timestamp": "2022-06-29 06:54:00",
      "score": 3,
      "num_children": 0,
      "author": 240728,
      "replies": []
    },
    {
      "id": "ie5wbnd",
      "text": "I care.",
      "timestamp": "2022-06-29 08:46:43",
      "score": 3,
      "num_children": 0,
      "author": 166088,
      "replies": []
    },
    {
      "id": "ie5wk2t",
      "text": "I’m so proud of you! I’m in a similar situation, leaving a 6 year relationship for various reasons but I’m very glad to be getting away from his super Christian family. It’s past time for us to demand the respect we deserve!",
      "timestamp": "2022-06-29 08:49:59",
      "score": 4,
      "num_children": 0,
      "author": 369428,
      "replies": []
    },
    {
      "id": "ie5zdh6",
      "text": "Credit to you, even though it sounded like an obvious choice to most of us here I'm sure it wasn't an easy thing to do.\n\nHere's to finding someone that respects your bodily autonomy.",
      "timestamp": "2022-06-29 09:29:53",
      "score": 4,
      "num_children": 0,
      "author": 342603,
      "replies": []
    },
    {
      "id": "ie60ina",
      "text": "Hello random woman on the Internet, you have so done the right thing and huge respect from me. The main problem I have with the religious is their failure to question, their unwillingness to look in the mirror, listen to the other side and challenge their own beliefs. If more people do what you did it might trigger more 'wait a minute' moments and get them to actually think for a change, instead of blindly follow. Cudos to you.\n\nRandom man on the Internet",
      "timestamp": "2022-06-29 09:46:21",
      "score": 3,
      "num_children": 0,
      "author": 293036,
      "replies": []
    },
    {
      "id": "ie61387",
      "text": ">I know I am just some random woman on the Internet, and most of you probably don’t care\n\nNormal people do care about other fellow human beings. It might be a surprise for the religious ones, but atheists can have empathy ;)",
      "timestamp": "2022-06-29 09:54:28",
      "score": 3,
      "num_children": 0,
      "author": 326976,
      "replies": []
    },
    {
      "id": "ie61rea",
      "text": "a wise choice",
      "timestamp": "2022-06-29 10:03:45",
      "score": 3,
      "num_children": 0,
      "author": 402307,
      "replies": []
    },
    {
      "id": "ie62b37",
      "text": "I am also just some random woman on the internet and I promise you that I care.",
      "timestamp": "2022-06-29 10:11:07",
      "score": 3,
      "num_children": 0,
      "author": 178642,
      "replies": []
    },
    {
      "id": "ie739td",
      "text": "The world needs an atheist dating network",
      "timestamp": "2022-06-29 15:32:50",
      "score": 4,
      "num_children": 0,
      "author": 313226,
      "replies": []
    },
    {
      "id": "ie3viiy",
      "text": "Congrats to you, that takes courage.\n\nI hope you find that road to happiness, you deserve it.\n\nPS: Avoid the incels lol.",
      "timestamp": "2022-06-28 21:28:34",
      "score": 3,
      "num_children": 0,
      "author": 80945,
      "replies": []
    },
    {
      "id": "ie3yd6s",
      "text": "when you dont believe in a higher power\n\nyou are the higher power\n\n:-)",
      "timestamp": "2022-06-28 21:48:38",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie3ye16",
      "text": "Only good news iv seen today!",
      "timestamp": "2022-06-28 21:48:48",
      "score": 3,
      "num_children": 0,
      "author": 55143,
      "replies": []
    },
    {
      "id": "ie3ylzk",
      "text": "It might be a good idea to take some time for yourself and process the whole thing. Consider what you want and when you're ready, go for it.",
      "timestamp": "2022-06-28 21:50:23",
      "score": 3,
      "num_children": 0,
      "author": 126001,
      "replies": []
    },
    {
      "id": "ie3ys8y",
      "text": "Congrats! :D",
      "timestamp": "2022-06-28 21:51:36",
      "score": 3,
      "num_children": 0,
      "author": 154050,
      "replies": []
    },
    {
      "id": "ie3zvbe",
      "text": "I am super glad to hear a followup from you, good to know what your choice was and especially relieving to hear you have done it and that you're ok! Keep speaking your truth, reddit has your back!",
      "timestamp": "2022-06-28 21:59:23",
      "score": 3,
      "num_children": 0,
      "author": 312922,
      "replies": []
    },
    {
      "id": "ie3zz4a",
      "text": "Good for you. If they don't respect your body autonomy, they don't deserve your body.",
      "timestamp": "2022-06-28 22:00:08",
      "score": 3,
      "num_children": 0,
      "author": 353481,
      "replies": []
    },
    {
      "id": "ie40aof",
      "text": "Yay you! \n\nI’m sure it was a difficult decision and feelings hang around on their own schedule. Hope you’re doing okay and happy you found strength from this group.",
      "timestamp": "2022-06-28 22:02:29",
      "score": 3,
      "num_children": 0,
      "author": 278893,
      "replies": []
    },
    {
      "id": "ie40y37",
      "text": "Even if you're just one person in a sea of humanity, you should be free to choose your own destiny in all aspects of your life. I venture we all care very much about that.",
      "timestamp": "2022-06-28 22:07:18",
      "score": 3,
      "num_children": 0,
      "author": 81193,
      "replies": []
    },
    {
      "id": "ie417ne",
      "text": "Fuck God. Hail yourself!",
      "timestamp": "2022-06-28 22:09:17",
      "score": 3,
      "num_children": 0,
      "author": 310943,
      "replies": []
    },
    {
      "id": "ie41l49",
      "text": "I’m happy for you. And I hope the next girl finds it in her strength to stay away from him. I feel bad for every person he gets romantically involved with.",
      "timestamp": "2022-06-28 22:12:05",
      "score": 3,
      "num_children": 0,
      "author": 14718,
      "replies": []
    },
    {
      "id": "ie41w46",
      "text": "Congrats!",
      "timestamp": "2022-06-28 22:14:20",
      "score": 3,
      "num_children": 0,
      "author": 319604,
      "replies": []
    },
    {
      "id": "ie42ef0",
      "text": "So happy on your decision! ❤️ I wish you many days of happy Christian-free life and that you'll someday find new atheist love!",
      "timestamp": "2022-06-28 22:18:05",
      "score": 3,
      "num_children": 0,
      "author": 58223,
      "replies": []
    },
    {
      "id": "ie43gef",
      "text": "Plenty of us exist, best of luck.",
      "timestamp": "2022-06-28 22:25:57",
      "score": 3,
      "num_children": 0,
      "author": 390574,
      "replies": []
    },
    {
      "id": "ie43nrh",
      "text": "Apologies if this question is too personal, but how did he react?",
      "timestamp": "2022-06-28 22:27:30",
      "score": 3,
      "num_children": 0,
      "author": 233424,
      "replies": []
    },
    {
      "id": "ie46wmh",
      "text": "Congratulations on your freedom.",
      "timestamp": "2022-06-28 22:51:40",
      "score": 3,
      "num_children": 0,
      "author": 73515,
      "replies": []
    },
    {
      "id": "ie47jz0",
      "text": "I wish an honest happy and healthy relationship for you on even ground.",
      "timestamp": "2022-06-28 22:56:34",
      "score": 3,
      "num_children": 0,
      "author": 43064,
      "replies": []
    },
    {
      "id": "ie47x2j",
      "text": "I'm sorry it ended, obviously it sucks less when there are deep glaring flaws that stand completely and utterly at odds with your beliefs, but relationships ending still suck \n\nBut this gives you another tool in the toolkit to help you find what you want in a partner",
      "timestamp": "2022-06-28 22:59:19",
      "score": 3,
      "num_children": 0,
      "author": 1443,
      "replies": []
    },
    {
      "id": "ie4870h",
      "text": "Congrats!! Proud of you for realizing your worth and that you don’t have to settle for someone just cause they are good in some areas, but crappy in others",
      "timestamp": "2022-06-28 23:01:24",
      "score": 3,
      "num_children": 0,
      "author": 14413,
      "replies": []
    },
    {
      "id": "ie48ktv",
      "text": "*Ramen!*",
      "timestamp": "2022-06-28 23:04:19",
      "score": 3,
      "num_children": 0,
      "author": 209709,
      "replies": []
    },
    {
      "id": "ie48l1e",
      "text": "I wish you all the Best, and a man who will respect your right to body autonomy, and everyone else's.",
      "timestamp": "2022-06-28 23:04:22",
      "score": 3,
      "num_children": 0,
      "author": 272263,
      "replies": []
    },
    {
      "id": "ie48uud",
      "text": "Happy you got out! 👏",
      "timestamp": "2022-06-28 23:06:26",
      "score": 3,
      "num_children": 0,
      "author": 288168,
      "replies": []
    },
    {
      "id": "ie48xiy",
      "text": "Thank you for the update! Your experience will help others going forward, \"random woman\" or not. Wish I had the internet when I was younger, it really can be an amazing source of support and valuable information.",
      "timestamp": "2022-06-28 23:07:01",
      "score": 3,
      "num_children": 0,
      "author": 200652,
      "replies": []
    },
    {
      "id": "ie49ljd",
      "text": "Thank you for following up. I was concerned and am glad to know we could help you make a difficult choice.",
      "timestamp": "2022-06-28 23:12:13",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie49p59",
      "text": "Congrats",
      "timestamp": "2022-06-28 23:13:00",
      "score": 3,
      "num_children": 0,
      "author": 212774,
      "replies": []
    },
    {
      "id": "ie49vdl",
      "text": "Hopefully you left him on a farm where he can run and play and chase rabbits..",
      "timestamp": "2022-06-28 23:14:22",
      "score": 3,
      "num_children": 0,
      "author": 109615,
      "replies": []
    },
    {
      "id": "ie4al6w",
      "text": "Good for you my friend. Congrats on changing your life👍",
      "timestamp": "2022-06-28 23:19:59",
      "score": 3,
      "num_children": 0,
      "author": 274178,
      "replies": []
    },
    {
      "id": "ie4c8vc",
      "text": "Don't ever let anyone treat you as less-than for any reason. You did the right thing.",
      "timestamp": "2022-06-28 23:32:48",
      "score": 3,
      "num_children": 0,
      "author": 327811,
      "replies": []
    },
    {
      "id": "ie4czwh",
      "text": "As a Christian I would have told you the same. I’m pro choice and think that certain views are not negotiable. I can argue limits on time and partial birth I can’t say 0 choice. I can’t say 6 weeks/heartbeat. It’s all insane and doing that is not a Christian thing it is disrespectful to women. Don’t be with someone like that",
      "timestamp": "2022-06-28 23:38:36",
      "score": 3,
      "num_children": 0,
      "author": 294593,
      "replies": []
    },
    {
      "id": "ie4dytp",
      "text": "You’re welcome",
      "timestamp": "2022-06-28 23:46:13",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie4gdql",
      "text": "Ma'am, I wasn't part of your initial discussion, but I'm glad you got out of that relationship for your wellbeing.\n\n*I know I am just some random woman on the Internet, and most of you probably don’t care*\n\nI care, Ma'am, and everyone who responded to you yesterday, also care.\n\nHad you stayed, your life would have been terrible. Religion and contact with religious people are something you try to avoid at all costs. The emotional toll it would have took on you would have been devastating.\n\nLive a free and and happy life, Ma'am.\n\nEveryone deserves that, all the best to you for the future. 💖",
      "timestamp": "2022-06-29 00:05:00",
      "score": 3,
      "num_children": 0,
      "author": 9123,
      "replies": []
    },
    {
      "id": "ie4m5su",
      "text": "Good choice. I know all I need to to know he didn't see you as an equal.",
      "timestamp": "2022-06-29 00:50:59",
      "score": 3,
      "num_children": 0,
      "author": 166164,
      "replies": []
    },
    {
      "id": "ie4rxdy",
      "text": "So, first I am sorry this happen. That's not something you necessarily wanted to do. \n\nA close second, though, is that by reaching out here, you understood something that you might be missing something here.  I think most of the comments would have been something you could have thought about. \n\nYou really will be better in the long run. Belief, or lack of are core values and neither of you would have been able to change for the other. One of ypu would have been miserable, and most probably you as sadly the woman is usually the one to try an accommodate. \n\nBest of luck in the future 👍",
      "timestamp": "2022-06-29 01:38:11",
      "score": 3,
      "num_children": 0,
      "author": 340864,
      "replies": []
    },
    {
      "id": "ie4ychp",
      "text": "Good for you. You deserve better",
      "timestamp": "2022-06-29 02:29:51",
      "score": 3,
      "num_children": 0,
      "author": 232508,
      "replies": []
    },
    {
      "id": "ie4zws1",
      "text": "It sounds like you already had the strength, enjoy your next exciting chapter in life and you will find someone who gives you the complete love you deserve",
      "timestamp": "2022-06-29 02:42:44",
      "score": 3,
      "num_children": 0,
      "author": 402680,
      "replies": []
    },
    {
      "id": "ie56072",
      "text": "Fuck anyone that expects you to follow their beliefs I'm order to be loved.",
      "timestamp": "2022-06-29 03:35:41",
      "score": 3,
      "num_children": 0,
      "author": 363946,
      "replies": []
    },
    {
      "id": "ie5le15",
      "text": "You should not be violated by people who believe you are less human than they are.\n\nI hope your future relationships are with better, more considerate people.",
      "timestamp": "2022-06-29 06:17:48",
      "score": 3,
      "num_children": 0,
      "author": 342657,
      "replies": []
    },
    {
      "id": "ie5sgm0",
      "text": "Props to you.\n\nThere is no difference of opinion here",
      "timestamp": "2022-06-29 07:51:40",
      "score": 3,
      "num_children": 0,
      "author": 138119,
      "replies": []
    },
    {
      "id": "ie5uc32",
      "text": "Welcome to the real world and congrats for leaving the Christian fantasy behind!",
      "timestamp": "2022-06-29 08:18:09",
      "score": 3,
      "num_children": 0,
      "author": 325235,
      "replies": []
    },
    {
      "id": "ie5uq58",
      "text": "Gratz!!!",
      "timestamp": "2022-06-29 08:23:41",
      "score": 3,
      "num_children": 0,
      "author": 168311,
      "replies": []
    },
    {
      "id": "ie5w2pz",
      "text": "I know that was probably difficult to do. Proud of you! I’m sure you’ll find someone who will make you feel validated in the values and beliefs that are important to you.",
      "timestamp": "2022-06-29 08:43:10",
      "score": 3,
      "num_children": 0,
      "author": 52975,
      "replies": []
    },
    {
      "id": "ie5yos7",
      "text": "You chose the right one. I congratulate you. I hope you'll find a better bf.",
      "timestamp": "2022-06-29 09:20:01",
      "score": 3,
      "num_children": 0,
      "author": 63695,
      "replies": []
    },
    {
      "id": "ie60glm",
      "text": "I wouldn't advertise that you are looking for an atheist man in an atheist subreddit, lmao. Your DMs will be loaded.",
      "timestamp": "2022-06-29 09:45:32",
      "score": 3,
      "num_children": 0,
      "author": 162841,
      "replies": []
    },
    {
      "id": "ie68mc3",
      "text": "I care. I’m both happy and excited for your future. Best of luck.",
      "timestamp": "2022-06-29 11:27:39",
      "score": 3,
      "num_children": 0,
      "author": 171063,
      "replies": []
    },
    {
      "id": "ie6cgfk",
      "text": "If u ask reddit if u should leave someone they will typically say yes. That being said I've tried dating Christians and it's never worked out. One told me I was going to hell. Another told me they wanted to wait till marriage to have sex. Lot of brainwashing going on. We try to pretend it's not a cult, but it is.",
      "timestamp": "2022-06-29 12:06:53",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie6emam",
      "text": "There are some fundamental stuff you can't overlook in a relationship and that's one of them. Wishing you happiness.",
      "timestamp": "2022-06-29 12:27:22",
      "score": 3,
      "num_children": 0,
      "author": 11441,
      "replies": []
    },
    {
      "id": "ie7qygh",
      "text": "Good for you.\n\nPro Life is just another term for misogyny. No matter how it is presented it comes down to other people making decisions for women. \n\nHope everything goes well for you.",
      "timestamp": "2022-06-29 18:06:39",
      "score": 3,
      "num_children": 0,
      "author": 186683,
      "replies": []
    },
    {
      "id": "ie3i09f",
      "text": "Good decision. All atheist dudes have big weiners.",
      "timestamp": "2022-06-28 19:57:58",
      "score": 24,
      "num_children": 1,
      "author": 408196,
      "replies": [
        {
          "id": "ie3phgu",
          "text": "Is it supposed to automatically adjust when you convert one way or another? Just checking.",
          "timestamp": "2022-06-28 20:47:24",
          "score": 20,
          "num_children": 1,
          "author": 388511,
          "replies": [
            {
              "id": "ie3wn5i",
              "text": "I don’t know. Mine’s been the same since birth, and I’ve never joined any cult.",
              "timestamp": "2022-06-28 21:36:28",
              "score": 7,
              "num_children": 1,
              "replies": [
                {
                  "id": "ie4chen",
                  "text": "Can confirm it works. I had to convert to a religion once because my girlfriend at the time couldn't handle my giant atheist wang. We broke up and obviously I dropped the religion and my glory returned within a couple of days.",
                  "timestamp": "2022-06-28 23:34:37",
                  "score": 11,
                  "num_children": 1,
                  "author": 223197,
                  "replies": [
                    {
                      "id": "ie4ioo4",
                      "text": "Took to heart. Shall attempt that experiment on my own",
                      "timestamp": "2022-06-29 00:23:11",
                      "score": 3,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ie4psvs",
      "text": "I just want to say that I am a Christian who is completely PRO CHOICE!! I think that it’s good you left this kid, there are many Christians who are more modern in thinking. I think the fact he is a Christian was a big excuse, bc as Christians we are taught to love an accept others.. it doesn’t sound like he was doing that for you. Happy for you!! On to greater things ❤️❤️",
      "timestamp": "2022-06-29 01:20:52",
      "score": 5,
      "num_children": 0,
      "author": 358148,
      "replies": []
    },
    {
      "id": "ie4d1gu",
      "text": "I am confident that you will find a guy who will be two tines better than your ex-boyfriend.",
      "timestamp": "2022-06-28 23:38:57",
      "score": 4,
      "num_children": 0,
      "author": 150670,
      "replies": []
    },
    {
      "id": "ie3z2zy",
      "text": "It's just one of the things we can do to combat this creeping christo-fascism threatening our country. Cut those people out of our lives, make them feel alone and ostracized as much as possible. Show them we won't tolerate their bigoted beliefs.",
      "timestamp": "2022-06-28 21:53:43",
      "score": 2,
      "num_children": 0,
      "author": 264251,
      "replies": []
    },
    {
      "id": "ie40v0h",
      "text": "<3",
      "timestamp": "2022-06-28 22:06:40",
      "score": 2,
      "num_children": 0,
      "author": 46056,
      "replies": []
    },
    {
      "id": "ie42dgj",
      "text": "Yeah overall dating someone with different views/values never ends well.",
      "timestamp": "2022-06-28 22:17:53",
      "score": 2,
      "num_children": 0,
      "author": 245889,
      "replies": []
    },
    {
      "id": "ie4b1nh",
      "text": "Good for you, best of luck.",
      "timestamp": "2022-06-28 23:23:31",
      "score": 2,
      "num_children": 0,
      "author": 191758,
      "replies": []
    },
    {
      "id": "ie4byhg",
      "text": "Best of luck while moving forward.",
      "timestamp": "2022-06-28 23:30:34",
      "score": 2,
      "num_children": 0,
      "author": 79189,
      "replies": []
    },
    {
      "id": "ie4cric",
      "text": "He is only a boyfriend?  You will be fine.  Wish you all the best.",
      "timestamp": "2022-06-28 23:36:46",
      "score": 2,
      "num_children": 0,
      "author": 400705,
      "replies": []
    },
    {
      "id": "ie4ew5f",
      "text": "I totally get you. Being christian, or whatever else religion that forces itself on others, is a complete deal breaker for me. It sucks you already had an established relationship but it is difficult seeing eye to eye with a religious person because their views don't change.",
      "timestamp": "2022-06-28 23:53:27",
      "score": 2,
      "num_children": 0,
      "author": 252582,
      "replies": []
    },
    {
      "id": "ie4gdep",
      "text": "Hello r/all, Welcome to r/atheism!\n\nPlease read our [Commandments](http://www.reddit.com/r/atheism/wiki/guidelines) and [FAQ](http://www.reddit.com/r/atheism/wiki/FAQ) before commenting. If you follow the rules and act civilly we can avoid a lot of bans. While everyone is welcome here, this sub is intended for atheists to discuss things of interest to us. This means that a wide variety of subjects are on-topic here. This is not a sub about just atheism.\n\nRemember: The mods do not choose which posts get voted up the frontpage. They remove the posts that violate the [Commandments](/r/atheism/w/guidelines); they don't police quality.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*",
      "timestamp": "2022-06-29 00:04:56",
      "score": 2,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "ie4h331",
      "text": "I'm glad you left. And to answer your question from your first post, if my husband didn't believe in women's rights, you're damn right I'd leave him despite the fact that he's a wonderful human otherwise. But I don't think wonderful human and anti-woman goes together. You did the right thing!",
      "timestamp": "2022-06-29 00:10:33",
      "score": 2,
      "num_children": 0,
      "author": 144762,
      "replies": []
    },
    {
      "id": "ie4hequ",
      "text": "It’s less about someone’s faith as it is about shared core values. If you don’t agree about fundamentals, it’s always going to be tough. I’m an atheist, my wife is Christian. It’s not a problem.",
      "timestamp": "2022-06-29 00:13:04",
      "score": 2,
      "num_children": 0,
      "author": 340590,
      "replies": []
    },
    {
      "id": "ie4himo",
      "text": "You certainly made the right choice there! Most interfaith relationships & marriages never works out in the long run & will only make non-religious more miserable. He might have even control what you do once you're officially married to him.",
      "timestamp": "2022-06-29 00:13:56",
      "score": 2,
      "num_children": 0,
      "author": 200819,
      "replies": []
    },
    {
      "id": "ie4ho9r",
      "text": "I remember this one from yesterday. Thank you for the update. That is certainly a lot of responses. I hope everything goes well for you. I know it can be hard but we are here if you need us.",
      "timestamp": "2022-06-29 00:15:10",
      "score": 2,
      "num_children": 0,
      "author": 353414,
      "replies": []
    },
    {
      "id": "ie4j0hs",
      "text": "You go girl.",
      "timestamp": "2022-06-29 00:25:47",
      "score": 2,
      "num_children": 0,
      "author": 350232,
      "replies": []
    },
    {
      "id": "ie4j752",
      "text": "It's not only about respecting you, it's about not telling you what you can and cannot do with your body. Which in my opinion is completely different than simply respecting you. It's about removing yourself from that potential control.",
      "timestamp": "2022-06-29 00:27:15",
      "score": 2,
      "num_children": 0,
      "author": 216528,
      "replies": []
    },
    {
      "id": "ie4jald",
      "text": "Just saw your prior post. Congratulations on taking this courageous step. I hope you find the atheist you’re looking for!",
      "timestamp": "2022-06-29 00:28:02",
      "score": 2,
      "num_children": 0,
      "author": 17322,
      "replies": []
    },
    {
      "id": "ie4jbtd",
      "text": "You deserve someone who will actually view you as an equal human being and not equal to a pet dog or cat. Seriously Christian extremism has got out of hand. I married my wife when she was still a Christian 23years ago, but in todays world I would advise most people avoid relationships with them. Especially the religious men...",
      "timestamp": "2022-06-29 00:28:18",
      "score": 2,
      "num_children": 0,
      "author": 285992,
      "replies": []
    },
    {
      "id": "ie4kz9f",
      "text": "while we may be good supporters, soundboards, teachers, etc., don't forget that you did this. You did this. We don't need the thanks. You deserve all the credit for making a rational decision in your best interests.",
      "timestamp": "2022-06-29 00:41:38",
      "score": 2,
      "num_children": 0,
      "author": 195161,
      "replies": []
    },
    {
      "id": "ie4l118",
      "text": "How YOU doin?\n\nJoking. Hope you take a while to heal and, when you're ready, you find that perfect someone whose belief system better aligns with your own.",
      "timestamp": "2022-06-29 00:42:03",
      "score": 2,
      "num_children": 0,
      "author": 254810,
      "replies": []
    },
    {
      "id": "ie4lbpy",
      "text": "I care <3",
      "timestamp": "2022-06-29 00:44:24",
      "score": 2,
      "num_children": 0,
      "author": 150618,
      "replies": []
    },
    {
      "id": "ie4lgga",
      "text": "Man that's a shit situation. I'm sorry you had to go through it, but also happy for you that you've come out the other side. I wouldn't personally care about a difference of belief but when it comes to anti-choice kind of views, that's a big one. Big enough that it could ruin a marriage if it had gone that far.",
      "timestamp": "2022-06-29 00:45:26",
      "score": 2,
      "num_children": 0,
      "author": 271241,
      "replies": []
    },
    {
      "id": "ie4li3n",
      "text": "You're not some random woman in the internet and we *all* care. Or at least *I* care. We're all brothers, sisters, and siblings here to break the wheel of oppression. Good luck on your journey.",
      "timestamp": "2022-06-29 00:45:48",
      "score": 2,
      "num_children": 0,
      "author": 198832,
      "replies": []
    },
    {
      "id": "ie4lm1l",
      "text": "Didn't see your original post, but glad you did the right thing.  And your'e not some random anything, you are just as important in the grand scheme of things as any other living being on this planet. Might as well be true to yourself and live your best life while you are here! Good luck and I know you'll find a better man!",
      "timestamp": "2022-06-29 00:46:40",
      "score": 2,
      "num_children": 0,
      "author": 94618,
      "replies": []
    },
    {
      "id": "ie4ln9c",
      "text": "May every one with a religious nutjob for an SO find the same will.",
      "timestamp": "2022-06-29 00:46:56",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie4mlao",
      "text": "Go live your best life!",
      "timestamp": "2022-06-29 00:54:27",
      "score": 2,
      "num_children": 0,
      "author": 162835,
      "replies": []
    },
    {
      "id": "ie4mm5g",
      "text": "They're out there. Be patient. Live Fabulous (read that on an earlier post on Ukraine and gotta admit I love it).",
      "timestamp": "2022-06-29 00:54:37",
      "score": 2,
      "num_children": 0,
      "author": 284467,
      "replies": []
    },
    {
      "id": "ie4nfnc",
      "text": "Fuck. Yes.",
      "timestamp": "2022-06-29 01:01:12",
      "score": 2,
      "num_children": 0,
      "author": 237847,
      "replies": []
    },
    {
      "id": "ie4nhgk",
      "text": "I didn’t see your post but happy to hear it. You dodged a bullet.",
      "timestamp": "2022-06-29 01:01:36",
      "score": 2,
      "num_children": 0,
      "author": 38049,
      "replies": []
    },
    {
      "id": "ie4nlz7",
      "text": "FYI it is tough dating for atheists.  I go through two to three people a year thinking they can “change my mind.”  Even had a girl say “That atheism nonsense stops now if you wanna date me.”  Accused me of trying to be “edgy” and then totally expected me not to walk the fuck out of the Chile’s (her pick btw) and never look back.",
      "timestamp": "2022-06-29 01:02:36",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie4nvah",
      "text": "You should be proud of yourself for doing what’s best for you. My ex-wife became super religious towards the end of our marriage. We even tried marriage counseling though “our” church in the months leading up to her and I divorcing. To be fair, we were both casual Christians when we met. As time passed, she went deeper into her faith and I pulled further away from mine. This was likely a factor in her and I disliking each other so very much. I never mocked or judged her for her faith but I did not participate and this excluded me from her circle of friends and her family. It may have also played a role in the cycle of abuse that lasted for years. She was incredibly violent at times, emotionally and physically abusive towards me while hiding behind this facade of a good, godly, Christian woman. My experience with her probably solidified my lack of faith forever.",
      "timestamp": "2022-06-29 01:04:39",
      "score": 2,
      "num_children": 0,
      "author": 272381,
      "replies": []
    },
    {
      "id": "ie4nvh5",
      "text": "You are strong.  That was a super hard decision.",
      "timestamp": "2022-06-29 01:04:42",
      "score": 2,
      "num_children": 0,
      "author": 20915,
      "replies": []
    },
    {
      "id": "ie4q1fn",
      "text": "Good for you!  You are better off bc now That Gut Feeling won’t be lingering.",
      "timestamp": "2022-06-29 01:22:50",
      "score": 2,
      "num_children": 0,
      "author": 266677,
      "replies": []
    },
    {
      "id": "ie4qmd8",
      "text": "I'm very happy for you!",
      "timestamp": "2022-06-29 01:27:33",
      "score": 2,
      "num_children": 0,
      "author": 37062,
      "replies": []
    },
    {
      "id": "ie4r2xu",
      "text": "Great work!",
      "timestamp": "2022-06-29 01:31:15",
      "score": 2,
      "num_children": 0,
      "author": 279386,
      "replies": []
    },
    {
      "id": "ie4rya9",
      "text": "Random woman, you have made the right choice! He'll never respect you. His religion doesn't allow it.",
      "timestamp": "2022-06-29 01:38:24",
      "score": 2,
      "num_children": 0,
      "author": 85568,
      "replies": []
    },
    {
      "id": "ie4rz8o",
      "text": "You done the right thing and, no matter what you chose, it would have been a hard relationship to fix. Well done. Onwards and upwards.\n\nI'm an atheist from Scotland and we don't care about religion (nor does half of Europe) so you have nearly half the planet to chose from. Good hunting my girl 😘",
      "timestamp": "2022-06-29 01:38:37",
      "score": 2,
      "num_children": 0,
      "author": 381405,
      "replies": []
    },
    {
      "id": "ie4s0m6",
      "text": " You don't necessarily need to date an atheist (though that's still probably the safest choice).\n\nThere's a decent amount of people who have a religion but aren't crazy extremists.",
      "timestamp": "2022-06-29 01:38:56",
      "score": 2,
      "num_children": 0,
      "author": 110638,
      "replies": []
    },
    {
      "id": "ie4s3cf",
      "text": "Congratulations!",
      "timestamp": "2022-06-29 01:39:34",
      "score": 2,
      "num_children": 0,
      "author": 133891,
      "replies": []
    },
    {
      "id": "ie4s3ku",
      "text": "W",
      "timestamp": "2022-06-29 01:39:37",
      "score": 2,
      "num_children": 0,
      "author": 359337,
      "replies": []
    },
    {
      "id": "ie4txgm",
      "text": "No, thank YOU for having the strength!  Good for you and keep up the fight!",
      "timestamp": "2022-06-29 01:54:25",
      "score": 2,
      "num_children": 0,
      "author": 329298,
      "replies": []
    },
    {
      "id": "ie4ud00",
      "text": "Atheist AND Feminist man, keep those standards high! And congrats on the awesome freedom!!",
      "timestamp": "2022-06-29 01:57:52",
      "score": 2,
      "num_children": 0,
      "author": 379345,
      "replies": []
    },
    {
      "id": "ie4uq50",
      "text": "Glad for the update. I honestly thought about your situation a couple of times after you posted it.",
      "timestamp": "2022-06-29 02:00:48",
      "score": 2,
      "num_children": 0,
      "author": 132509,
      "replies": []
    },
    {
      "id": "ie4v03g",
      "text": "Congrats!",
      "timestamp": "2022-06-29 02:03:03",
      "score": 2,
      "num_children": 0,
      "author": 153870,
      "replies": []
    },
    {
      "id": "ie4vbvr",
      "text": "You decided correctly. Christianity is based on a god sacrificing his son to appease his rage over a fruit theft at Eden gsrdens, and resentment over human-angel sex.  Ridiculous. \nChristian hypocrisy is colossal, their creed is comparable to Star Trek. No person should take it seriously.\nYet here we are.",
      "timestamp": "2022-06-29 02:05:39",
      "score": 2,
      "num_children": 0,
      "author": 107603,
      "replies": []
    },
    {
      "id": "ie4wqdp",
      "text": "Don't be so sure that we don't care only because you're a stranger, we have something in common that binds us all together. These are scary times, the least we can do is try to encourage and support one more person that doesn't want to live under the thumb of a religious group. Enjoy your freedom, it does get easier.",
      "timestamp": "2022-06-29 02:16:54",
      "score": 2,
      "num_children": 0,
      "author": 198394,
      "replies": []
    },
    {
      "id": "ie4xias",
      "text": "Good. If y'all cannot agree about to do if you get pregnant than many other issues were over the horizon. I am sorry for the pain you might be feeling over the relationships end.",
      "timestamp": "2022-06-29 02:23:06",
      "score": 2,
      "num_children": 0,
      "author": 282829,
      "replies": []
    },
    {
      "id": "ie4z823",
      "text": "Reading your words is the best thing to happen to me today!\n\nPeace.",
      "timestamp": "2022-06-29 02:37:01",
      "score": 2,
      "num_children": 0,
      "author": 12286,
      "replies": []
    },
    {
      "id": "ie4zesg",
      "text": "I care about you, and I'm glad that you are free to live your life to the fullest",
      "timestamp": "2022-06-29 02:38:34",
      "score": 2,
      "num_children": 0,
      "author": 53247,
      "replies": []
    },
    {
      "id": "ie50pxm",
      "text": "Good job! 🎉",
      "timestamp": "2022-06-29 02:49:34",
      "score": 2,
      "num_children": 0,
      "author": 206047,
      "replies": []
    },
    {
      "id": "ie52939",
      "text": "Proud of you! I had a Christian (abusive) ex boyfriend who told me I was too “lazy” to convert to Christianity. I know the choice to leave was not an easy one, but you deserve someone who respects you and your beliefs.",
      "timestamp": "2022-06-29 03:02:36",
      "score": 2,
      "num_children": 0,
      "author": 301426,
      "replies": []
    },
    {
      "id": "ie5351j",
      "text": "\"Most of you don't care\"?...\n\nUm, that was 700 responses; only 10%, *max*, ever really respond - *even though they want to and don't know what to say.*\n\nI'd read that as *\"7,000 people cared about you*\".\n😊",
      "timestamp": "2022-06-29 03:10:14",
      "score": 2,
      "num_children": 0,
      "author": 174957,
      "replies": []
    },
    {
      "id": "ie53war",
      "text": "Thank you for being strong 💪",
      "timestamp": "2022-06-29 03:16:55",
      "score": 2,
      "num_children": 0,
      "author": 393752,
      "replies": []
    },
    {
      "id": "ie5761q",
      "text": " You have the right to want to be welcomed ENTIRELY as an equal.  You have the right to expect respect, you have the right not be be considered livestock to be bred at the whim of anyone else.  If a person can't tolerate the thought that an 11 year-old girl who happens to get raped by her very close relative and became pregnant should be able to remove that misbegotten error of a pregnancy and be able to go forward to create wonderful, WANTED children, then they are not people you want in your life.",
      "timestamp": "2022-06-29 03:46:23",
      "score": 2,
      "num_children": 0,
      "author": 57129,
      "replies": []
    },
    {
      "id": "ie57m4z",
      "text": "Lol",
      "timestamp": "2022-06-29 03:50:33",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie5anyw",
      "text": "Congratulation’s! enjoy living your life and embrace everything! Also believe in yourself and don’t fear failure, fear regret.",
      "timestamp": "2022-06-29 04:20:01",
      "score": 2,
      "num_children": 0,
      "author": 31431,
      "replies": []
    },
    {
      "id": "ie5b88m",
      "text": "When I read that his life was now \"Christian free\" I thought, oh crap, his NAME was Christian!  But either way, if they were anti-choice, right decision.",
      "timestamp": "2022-06-29 04:25:35",
      "score": 2,
      "num_children": 0,
      "author": 365046,
      "replies": []
    },
    {
      "id": "ie5g3bz",
      "text": "I'm happy for you that you're not staying with somebody anti-choice. Congrats! You'll be better off.\n\nOne word of warning is, it's not always safe to assume that somebody is pro-choice just because they're an atheist. It's always best to check on this early. There are certainly issues with dating religious people, but personally I would take a pro-choice theist over an anti-choice atheist any day.",
      "timestamp": "2022-06-29 05:15:47",
      "score": 2,
      "num_children": 0,
      "author": 133856,
      "replies": []
    },
    {
      "id": "ie5ibvs",
      "text": "Religion is the scourge of humanity with Christians bar far being the worst all religions have to offer.",
      "timestamp": "2022-06-29 05:41:19",
      "score": 2,
      "num_children": 0,
      "author": 402729,
      "replies": []
    },
    {
      "id": "ie61dea",
      "text": "Big love and good luck.",
      "timestamp": "2022-06-29 09:58:27",
      "score": 2,
      "num_children": 0,
      "author": 300262,
      "replies": []
    },
    {
      "id": "ie6iszw",
      "text": "Leaving toxic religion is not easy. They provide for our social needs as humans. Being an atheist can be lonely, but the quality of people you meet will be 1,000 times better than any fake relationship you form in a church. This is because their mentality is a group mentality, and they will turn on any one person for any reason. It happens in all churches.",
      "timestamp": "2022-06-29 13:04:07",
      "score": 2,
      "num_children": 0,
      "author": 70523,
      "replies": []
    },
    {
      "id": "ie6pk4o",
      "text": "Now the true fight begins to win back rights your rights, but Atheist's rights all over this country. Welcome to the fight.",
      "timestamp": "2022-06-29 13:57:44",
      "score": 2,
      "num_children": 0,
      "author": 345933,
      "replies": []
    },
    {
      "id": "ie6udyv",
      "text": "This may sound silly but I dated a very conservative man for 4 years thinking that it was just his parents’ views and with age and space they’d become more open minded. It was a day I’ll never forget- I told our mutual best friend my concerns and he said “if you marry him and have kids, every time you leave the room his entire family will say ‘but don’t listen to your mom she’s crazy’” those words from again,  our MUTUAL best friend, broke the spell. I would never know complete happiness in that setting always worrying if I’d be undermined. You did the right thing for you and now all you can do is the next right thing ♥️",
      "timestamp": "2022-06-29 14:32:38",
      "score": 2,
      "num_children": 0,
      "author": 13145,
      "replies": []
    },
    {
      "id": "ie724rw",
      "text": "Congratulations! For me personally whenever a person says they are religious, it's a red flag.",
      "timestamp": "2022-06-29 15:25:36",
      "score": 2,
      "num_children": 0,
      "author": 135251,
      "replies": []
    },
    {
      "id": "ie732s8",
      "text": "Congratulations!!!😁",
      "timestamp": "2022-06-29 15:31:33",
      "score": 2,
      "num_children": 0,
      "author": 199159,
      "replies": []
    },
    {
      "id": "ie73l35",
      "text": "I wasn’t here for the first post, but I’m so proud of you!!!",
      "timestamp": "2022-06-29 15:34:55",
      "score": 2,
      "num_children": 0,
      "author": 276811,
      "replies": []
    },
    {
      "id": "ie7acut",
      "text": "I'm glad you left someone who doesn't care about your rights. But take it from me, atheist men have just as much sexism to get over, so don't assume just because they're atheist they'll respect you more. Make sure you talk to your next partner about  e v e r y t h i n g  and keep checking in on their values.   \n\n\nI wish you well.",
      "timestamp": "2022-06-29 16:19:17",
      "score": 2,
      "num_children": 0,
      "author": 379553,
      "replies": []
    },
    {
      "id": "ie7drrv",
      "text": "Glad to hear it. It can work when they share views with you, but disagreeing on fundamental human rights with someone just can’t do in a relationship.",
      "timestamp": "2022-06-29 16:41:14",
      "score": 2,
      "num_children": 0,
      "author": 275093,
      "replies": []
    },
    {
      "id": "ie4wiyw",
      "text": "Good for you.  Today you took your life into your own hands and made yourself powerful.",
      "timestamp": "2022-06-29 02:15:16",
      "score": 5,
      "num_children": 0,
      "author": 364643,
      "replies": []
    },
    {
      "id": "ie3xqdg",
      "text": "TBF: It doesn't have to be an atheist man... atheists can be militant assholes too.  Find someone who respects you and your views and whose views you can respect in turn.",
      "timestamp": "2022-06-28 21:44:09",
      "score": 6,
      "num_children": 0,
      "author": 298168,
      "replies": []
    },
    {
      "id": "ie4pb1z",
      "text": "I'm atheist.\n\nMy wife is Christian.\n\nMy religious views weigh zero on my relationships.",
      "timestamp": "2022-06-29 01:16:50",
      "score": 10,
      "num_children": 4,
      "author": 31747,
      "replies": [
        {
          "id": "ie506yb",
          "text": "How are the kids raised?",
          "timestamp": "2022-06-29 02:45:07",
          "score": 9,
          "num_children": 0,
          "author": 194685,
          "replies": []
        },
        {
          "id": "ie6exbc",
          "text": "That’s great for you. I am also an atheist married to a Christian. I won’t say religious views weigh zero on my relationship though. There are many different kinds of Christians, some open minded, some not. My husband is open minded. He is pro-choice and supports gay and trans rights. His actual religion doesn’t make a difference to me,  it’s how he uses it to interact with the world. If he used his religion to justify taking rights away from others that would absolutely have a big affect on our relationship. I simply couldn’t be with the kind of Christian who thinks they can force everyone around them to be pro-birth and to take away gay rights.",
          "timestamp": "2022-06-29 12:30:09",
          "score": 2,
          "num_children": 1,
          "author": 287989,
          "replies": [
            {
              "id": "ie7se7y",
              "text": "My political views also weigh zero in my relationships.\n\nAs an atheist, you can understand how unconventional your views are.\n\nNow, I will tell you that I also have very unconventional political views.\n\nI already know the damage my unconventional religious views have done in interpersonal relationships.\n\nI won't let my unconventional political views do the same thing.\n\nAs the saying goes:  At the dinner table, do not bring up religion or politics.  --some very wise person",
              "timestamp": "2022-06-29 18:16:16",
              "score": 1,
              "num_children": 0,
              "author": 31747,
              "replies": []
            }
          ]
        },
        {
          "id": "ie4vnyw",
          "text": "Same. I was militant in my 20s. Felt like I needed to deconvert the world. In my 30s I mellowed and stopped caring about what others believe.",
          "timestamp": "2022-06-29 02:08:22",
          "score": 7,
          "num_children": 0,
          "author": 42786,
          "replies": []
        },
        {
          "id": "ie4tncg",
          "text": "Aww how sweet.",
          "timestamp": "2022-06-29 01:52:08",
          "score": 2,
          "num_children": 0,
          "author": 235156,
          "replies": []
        }
      ]
    },
    {
      "id": "ie3w78d",
      "text": "While I congratulate and support your decision, I think you should keep an open mind moving forward. While a lot of people are foolish enough to fall into the trappings of religion, some of those are genuinely kind people that just fundamentally misunderstand the workings of the world because of how well indoctrinated they were as children. I know their hypocrisy and foolishness all too well, but we Athiests should understand exactly what it's like to be generalized and excluded based off of those generalizations. We don't need to make their same mistakes. There are good and smart people that admit to following religions, same as there are absolute smooth brains that are Athiests. Individuals can be flawed while still being great and exceptionally worthy.\n\nEdit: for examples of smooth brained Athiests, look below! People are so dumb they thought this comment was somehow in defense of the piece of shit I congratulated and supported OP in dumping. Probably just reading the 2nd sentence and getting upset I won't be an absolute fuckwit and deal in absolutes. In the same way not all religious people are horrendous creatures that want to tear your rights away from you, not all athiests are even intelligent enough to fucking read. We treat people as individuals because while some traits may be more common within a certain group, they are not exclusive or guaranteed.",
      "timestamp": "2022-06-28 21:33:24",
      "score": 13,
      "num_children": 4,
      "author": 269972,
      "replies": [
        {
          "id": "ie4okg5",
          "text": "I see where you're coming from, but she said he was a pro-birther. That means he considers her choices irrelevant; he doesn't think she should have control over her own body, if that's not valid reason to break up with someone, I don't know what is.",
          "timestamp": "2022-06-29 01:10:39",
          "score": 11,
          "num_children": 1,
          "author": 196362,
          "replies": [
            {
              "id": "ie67ti0",
              "text": ">That means he considers her choices irrelevant; he doesn't think she should have control over her own body\n\nThis strawman of anti-choicers helps nothing, and just makes it even harder for people (presumably like OP and her ex) to talk to each other and come to an understanding.",
              "timestamp": "2022-06-29 11:19:01",
              "score": -6,
              "num_children": 1,
              "author": 16579,
              "replies": [
                {
                  "id": "ie6nwqk",
                  "text": "Honestly it’s not just a case of coming to an understanding.\nIf someone expresses pro-birth views and I come to need an abortion illegally, they’re not going to support me and might even report me if I try and go out of state or take pills. It’s like having big brother in your home watching you, no better way than to have the state in your uterus than to date a forced birther. It’s just a massive risk to my safety.",
                  "timestamp": "2022-06-29 13:45:11",
                  "score": 3,
                  "num_children": 2,
                  "author": 291514,
                  "replies": [
                    {
                      "id": "ie8d4jb",
                      "text": "Religious person =/= pro birth. Generalizing your perceived opposition is a good way to make more enemies than you actually have.",
                      "timestamp": "2022-06-29 20:32:56",
                      "score": 1,
                      "num_children": 0,
                      "author": 269972,
                      "replies": []
                    },
                    {
                      "id": "ie96hfq",
                      "text": "The laws are mostly horrible I agree. What I'm getting at is that pretending they literally do not care about women at all isn't helpful, just as them pretending you/we don't care about babies isn't helpful. It's just divisive and makes everyone more uncompromising because nobody's actually talking to each other about their concerns and just assumes the other side is psychopathically insane. The belief that someone opposed to you can't be reasoned with is almost always a self-fulfilling prophecy.",
                      "timestamp": "2022-06-30 00:00:23",
                      "score": 1,
                      "num_children": 1,
                      "author": 16579,
                      "replies": [
                        {
                          "id": "ieccvso",
                          "text": "But that’s the problem, they don’t care about us when we express concern for our health and/or life, there’s not really much discussion when the other side doesn’t see you as human and gaslights these non-trivial concerns. That’s toxic, it’s best to avoid people that wish direct harm to you for self preservation. That’s more important than coming to an understanding when the basic arguments don’t work.",
                          "timestamp": "2022-06-30 17:26:20",
                          "score": 1,
                          "num_children": 1,
                          "author": 291514,
                          "replies": [
                            {
                              "id": "iee45q9",
                              "text": ">they don’t care about us when we express concern for our health and/or life\n\nThat's just not true. Yeah, there are *some* religious fanatics (too many writing legislation) who believe God would never let someone die to a complicated pregnancy, but for the most part (71% according to a quick poll I looked up) anti-choicers are in favor of having the choice of abortion when there's \"a danger to the life of the mother\" (e.g. ectopic pregnancies).\n\nWhat they're not in favor of, are medically unnecessary abortions, particularly the further along in development the fetus is, and when they hear \"This legislation will kill women\", they don't think you're referring to women with ectopic pregnancies, they think you're referring to (as some are) women who just wanted an abortion badly enough to get one in a back alley. Nobody likes being emotionally blackmailed with \"If you don't let me get what I want, I'm going to kill myself getting it\", which is why they will never find those particular arguments compelling.\n\nAnd when they see testimony like this (one minute video, important exchange right at the start) https://v.redd.it/ezlseyim5g091 , they don't see the pro-choice side looking reasonable. She's a doctor, and even though she's talking to a fucking wingnut, she ends up the one sounding insane because she can't muster up a common sense answer like \"No, of course we wouldn't abort a healthy fetus moments before delivery\".",
                              "timestamp": "2022-07-01 00:38:29",
                              "score": 1,
                              "num_children": 1,
                              "author": 16579,
                              "replies": [
                                {
                                  "id": "ieea87o",
                                  "text": "I feel like you’re kind of missing my point and there’s a lot more nuance to what I’m saying, I’m not clarifying because I assume we’re on the same page with regards to abortion like I would do if I’m speaking with a prolifer.\n\nWhen I say they don’t care about our health/life, I mean they don’t understand that you CANNOT force someone into an extreme medical process that is ALWAYS a risk to health/life such as pregnancy - they don’t care about autonomy which is the toxic trait I’m talking about and the irreconcilable difference that is quite terrifying tbh. The proof it’s more than just they don’t want someone killing a fetus because they’re ignorant to how harmful pregnancy is, is when you confront them about forced organ donation when the victim’s ailment was caused by you (or not), if they don’t end up throwing expletives at you because they can’t argue back, they argue your autonomy is trumped by their right to life or that a woman should be forced into pregnancy anyway even with the risks involved. There’s no discussion with someone of this level of stupidity whether they’re religious or not, they actively wish harm on women in spite in some cases.\n\nBut I have to agree with you, people who argue on the prochoice side really have no idea how to do so with prolifers and they rarely use any of the irrevocable arguments nor educate them on the relevant points such as the complications or pregnancy, rate of miscarriage, autonomy, medical nuances etc. the list goes on. The humanity of the fetus is also a pretty mute point that I wish prochoicers would stop using because it’s irrelevant compared to autonomy and actually weakens their argument, because, yes, the fetus has human DNA, but so what?",
                                  "timestamp": "2022-07-01 01:26:55",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 291514,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ie40exn",
          "text": "I really appreciate seeing comments like this.\n\nI encounter a whole lot of generalization, hate, and anger on this sub, which, while not unexpected, is usually pretty hypocritical. Blind indoctrination is bad in any situation.",
          "timestamp": "2022-06-28 22:03:22",
          "score": 5,
          "num_children": 2,
          "author": 176139,
          "replies": [
            {
              "id": "ie4u2m3",
              "text": "Generalizing in any context makes zero sense to me. Glad there are a select few that get this. No one group is entirely this way or that.",
              "timestamp": "2022-06-29 01:55:34",
              "score": 4,
              "num_children": 0,
              "author": 235156,
              "replies": []
            },
            {
              "id": "ie6mr5o",
              "text": "What blind indoctrination do you see on this sub? I’m very curious because this sounds a lot like the silly argument that atheism itself is a religion.",
              "timestamp": "2022-06-29 13:36:14",
              "score": 2,
              "num_children": 1,
              "author": 37515,
              "replies": [
                {
                  "id": "ie7syrr",
                  "text": "Nah, not going down *that* route lol, but I’ve seen aggressive posts about how all religious people deserve 0 respect, or about how every adherent to a religion is evil, etc.\n\nThose posts seem to be coming from a place of anger and pain, and I feel for those peeps, but lashing out and making sweeping generalizations like that is stooping to the level of the religious asshats who spread hate.\n\nMaybe indoctrination isn’t the right word, but when I see r/atheism posts that are just as hateful as posts from religious bigots I have to raise a flag and remind us to be better than them.",
                  "timestamp": "2022-06-29 18:20:03",
                  "score": 2,
                  "num_children": 0,
                  "author": 176139,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ie6mktc",
          "text": "This comment is misplaced. Belief in god is a belief in the irrational. That’s a fact, even if it’s also a generalization. This man uses his belief in an imaginary man in the sky to justify a worldview that says OP doesn’t deserve control of her own body. It’d bad enough that we have to navigate a world where people make critical decisions based on fairytales, but it becomes intolerable when they use those fairytales to justify the oppression of others. Rational people need to draw the line somewhere. This seems like a good place.",
          "timestamp": "2022-06-29 13:34:51",
          "score": 2,
          "num_children": 1,
          "author": 37515,
          "replies": [
            {
              "id": "ie8aojm",
              "text": "Yes your comment is misplaced, you need to spec more into reading comprehension. I in no way spoke about her ex, beyond congratulating and supporting her in dropping that dead weight. Belief in a religion does not automatically mean someone is going to try take your or anyone's rights. People are individuals who make their own individual decisions and judgments. Pay attention, most people in the US disagree with what happened. As in the majority of people, regardless of political or religious affiliations, do not agree with stripping people of their rights. Even if they can't agree on certain details about it, they do agree the practice of abortion is necessary and that this attempt to ban it is politically motivated.\n\nhttps://www.google.com/amp/s/www.pbs.org/newshour/amp/politics/majority-of-americans-think-supreme-court-overturning-roe-was-more-about-politics-than-law\n\nhttps://www.hks.harvard.edu/faculty-research/policy-topics/politics/supreme-courts-ruling-overturning-roe-v-wade-will-have-huge\n\nThere have been countless humans that came before you, shackled by religion, that were immeasurably better than any of us or you ever will be. In case you've forgotten, the very people that set up and came up with the separation of Church and State were Christians. People of a religion designed a government to be seperate from their beliefs because they knew they had to get along with the people around them that held different beliefs. Strange. Must be impossible, how could a human being brainwashed by religion do something so intelligent and considerate of others? Because wisdom and morality are not traits exclusive to Athiests.",
              "timestamp": "2022-06-29 20:16:54",
              "score": 1,
              "num_children": 0,
              "author": 269972,
              "replies": []
            }
          ]
        },
        {
          "id": "ie5atwu",
          "text": "This is probably the most rational comment I've ever seen at the top after sorting by controversial.",
          "timestamp": "2022-06-29 04:21:40",
          "score": 1,
          "num_children": 1,
          "author": 128220,
          "replies": [
            {
              "id": "ie8f5jq",
              "text": "Well thank you! I didn't realize I was top of controversial, can't believe pointing out individuals can have their own beliefs and judgments is controversial to a group of people that are so different the only things we have in common sometimes are our enemies and lack of religious brainwashing.",
              "timestamp": "2022-06-29 20:46:21",
              "score": 2,
              "num_children": 0,
              "author": 269972,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ie4xkwd",
      "text": "Glad you escaped.",
      "timestamp": "2022-06-29 02:23:41",
      "score": 4,
      "num_children": 0,
      "author": 390242,
      "replies": []
    },
    {
      "id": "ie535zy",
      "text": "I care! Good for you.",
      "timestamp": "2022-06-29 03:10:28",
      "score": 4,
      "num_children": 0,
      "author": 329823,
      "replies": []
    },
    {
      "id": "ie4p04f",
      "text": "Asking /r/atheism if you should leave your christian boyfriend seems like you already knew what you were going to do. \n\nThere have been many similar questions on /r/TwoXChromosomes if you have never been there I suggest checking it out.\n\nSidenote: I love this subreddit, and believe women should do whatever they need to do to protect their well-being during a pregnancy regardless of the conditions.",
      "timestamp": "2022-06-29 01:14:20",
      "score": 2,
      "num_children": 0,
      "author": 156929,
      "replies": []
    },
    {
      "id": "ie4ynph",
      "text": "He's only parroting things heard from other people.   Most protestants had no issues with abortion until 1980 ( Baptist in particular). They often are using out of context bronze age liability and personal injury laws and poetry to justify their position while ignoring the passages which prescribed an abortion for child conceived through adultery.  (Numbers 5). I'm tired of people who haven't read the Bible dragging is into some kind of hellish theocracy.   There is certainly no passage in the new testament about abortion. Additionally Jewish congregations do not oppose abortion. If those who practice the old testament to the letter don't have a problem with then why should those who follow the new testament that has no prohibitions have issues.",
      "timestamp": "2022-06-29 02:32:24",
      "score": 3,
      "num_children": 0,
      "author": 14520,
      "replies": []
    },
    {
      "id": "ie3ro9v",
      "text": "Cheers to you, sounds like a rough situation to be in. My wife and I don’t always agree on politics but this sounds like far to big of a difference to simply set aside.  \n\nBest of luck finding that special someone!",
      "timestamp": "2022-06-28 21:01:53",
      "score": 3,
      "num_children": 0,
      "author": 386114,
      "replies": []
    },
    {
      "id": "ie4kfzl",
      "text": "You left a life decision to Reddit? Wow!",
      "timestamp": "2022-06-29 00:37:18",
      "score": 6,
      "num_children": 2,
      "replies": [
        {
          "id": "ie6b5vn",
          "text": "Isn’t this a mistake to say where it’s from is a problem and not the advice itself. I’m guessing you think it’s fine to be with someone who doesn’t respect a woman’s bodily autonomy.",
          "timestamp": "2022-06-29 11:53:59",
          "score": 4,
          "num_children": 0,
          "author": 235259,
          "replies": []
        },
        {
          "id": "ie5xg86",
          "text": "For real.. reddit has a lot of good and bad but the vast majority of people who speak up are greasy neckbeards who cant even maintain a relationship with their families.. let alone another woman.\n\nReddit gonna reddit though",
          "timestamp": "2022-06-29 09:02:33",
          "score": 2,
          "num_children": 0,
          "author": 184413,
          "replies": []
        }
      ]
    },
    {
      "id": "ie4khvr",
      "text": "Getting relationship advice from Reddit. Lol.",
      "timestamp": "2022-06-29 00:37:43",
      "score": 3,
      "num_children": 1,
      "author": 243850,
      "replies": [
        {
          "id": "ie6h71i",
          "text": "From teenagers and other people in failed relationships. Doesn’t op realize that people just want them to be unhappy regardless?\n\nI mean, sorry but I’m so pessimistic and cynical that I can’t possibly imagine “atheists” being better human beings than anyone else the world has to offer. \n\nSame shitty humans - just different views.",
          "timestamp": "2022-06-29 12:50:20",
          "score": -3,
          "num_children": 0,
          "author": 327176,
          "replies": []
        }
      ]
    },
    {
      "id": "ie5m2la",
      "text": "Your call.\n\nJust a little word of caution: If you ask on reddit whether you should leave your partner, the answer will ALWAYS be a resounding \"yes\". Even moreso, I guess, if you're a woman and he's a guy. People will always side with OP, simply because that is the only perspective they ever get to know.\n\nJust look at all the relationship/advice related subs. It is very rare to find an opposing viewpoint.\n\nThat doesn't mean that your decision is wrong. It means that *I just don't know*, and I will steadfastly refuse to give any advice either way based on one reddit posting. I think it's uncouth.",
      "timestamp": "2022-06-29 06:26:16",
      "score": 3,
      "num_children": 0,
      "author": 6986,
      "replies": []
    },
    {
      "id": "ie4g28a",
      "text": "Yeah cause all these random people are therapists",
      "timestamp": "2022-06-29 00:02:31",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie42rr5",
      "text": "🤘🏼💪🏻🦶🏻",
      "timestamp": "2022-06-28 22:20:49",
      "score": 1,
      "num_children": 0,
      "author": 388116,
      "replies": []
    },
    {
      "id": "ie5n8l9",
      "text": "Plenty of Christians are pro-choice and there are Atheists who are against abortions lol",
      "timestamp": "2022-06-29 06:41:04",
      "score": 1,
      "num_children": 1,
      "author": 134250,
      "replies": [
        {
          "id": "ie6a0kp",
          "text": "The Christian in the OP's story isn't pro-choice.",
          "timestamp": "2022-06-29 11:42:22",
          "score": 6,
          "num_children": 1,
          "author": 178902,
          "replies": [
            {
              "id": "ie8j0ai",
              "text": "Is he on the Supreme Court as well?",
              "timestamp": "2022-06-29 21:12:02",
              "score": 0,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ie5rz24",
      "text": "Fully agree I would likely cut ties if someone had strong views like that.\n\nBut I would also not end a relationship because reddit comments told me to. Reddit comments will say leave someone at every opportunity. Relationships and problems are nuanced and that can't all be communicated in a post. \n\nUltimately you probably made the right decision, but I urge people to not take relationship advice on Reddit and see a professional (unless you are a victim of any emotional or domestic violence or are at risk, then gtfo).",
      "timestamp": "2022-06-29 07:44:54",
      "score": 2,
      "num_children": 0,
      "author": 57004,
      "replies": []
    },
    {
      "id": "ie5ijo0",
      "text": "[removed]",
      "timestamp": "2022-06-29 05:43:50",
      "score": -7,
      "num_children": 1,
      "replies": [
        {
          "id": "ie5xse5",
          "text": "[removed]",
          "timestamp": "2022-06-29 09:07:14",
          "score": -1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ie5r0q8",
      "text": "You’re going far in life when you listen to Reddit.",
      "timestamp": "2022-06-29 07:31:30",
      "score": -5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie5ncb3",
      "text": "Really fucking unpopular opinion for some reason: you shouldn’t leave someone based on a single opinion",
      "timestamp": "2022-06-29 06:42:23",
      "score": -9,
      "num_children": 4,
      "author": 309340,
      "replies": [
        {
          "id": "ie5pphn",
          "text": "It's not just a single opinion.  \n\nIf she gets pregnant and decided to abort, I guarantee he'd go ape shit over it.",
          "timestamp": "2022-06-29 07:13:39",
          "score": 10,
          "num_children": 3,
          "author": 49087,
          "replies": [
            {
              "id": "ie6oldf",
              "text": "It’s also a risk to her safety and freedom, what if he reports her like in Texas’ bounty state? By being in a relationship with this dude, it’s basically letting the state police you from the privacy of your own home.",
              "timestamp": "2022-06-29 13:50:26",
              "score": 5,
              "num_children": 1,
              "author": 291514,
              "replies": [
                {
                  "id": "ie94y96",
                  "text": "I don’t think that cocaine should be legal, but I wouldn’t report a friend of mine to the police if they did it.",
                  "timestamp": "2022-06-29 23:48:34",
                  "score": 1,
                  "num_children": 1,
                  "author": 309340,
                  "replies": [
                    {
                      "id": "iecd3lt",
                      "text": "This is the thing with prolife men, they often DO report women and try to coerce them into keeping unwanted pregnancies. There’s a case in Poland where a man tried to report his wife for an abortion and ended up suing the woman that helped her get one.",
                      "timestamp": "2022-06-30 17:27:46",
                      "score": 2,
                      "num_children": 0,
                      "author": 291514,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ie5wmfu",
              "text": "And then what?",
              "timestamp": "2022-06-29 08:50:56",
              "score": -7,
              "num_children": 0,
              "author": 30377,
              "replies": []
            },
            {
              "id": "ie94sya",
              "text": "You don’t know that!",
              "timestamp": "2022-06-29 23:47:27",
              "score": 0,
              "num_children": 0,
              "author": 309340,
              "replies": []
            }
          ]
        },
        {
          "id": "ie64rdn",
          "text": "That implies all opinions are similar in importance.\n\nIf someone's opinion is that you don't deserve to be treated as an equal that's a deeply harmful opinion which would make any relationship unhealthy.\n\nIt's an unpopular opinion because it overlooks the fact that the opinion that females shouldn't have bodily autonomy isn't remotely the same as the opinion that the state should invest more into roadwork.",
          "timestamp": "2022-06-29 10:42:53",
          "score": 8,
          "num_children": 1,
          "author": 5588,
          "replies": [
            {
              "id": "ie954pe",
              "text": "Ok, I understand the logic here and it is valid, but your conclusion is wrong. Being anti abortion isn’t about seeing women as not your equal. Richard Dawkins has a great article about this called “they think it’s murder”",
              "timestamp": "2022-06-29 23:49:55",
              "score": 1,
              "num_children": 1,
              "author": 309340,
              "replies": [
                {
                  "id": "ief90sj",
                  "text": "Being anti-abortion isn't necessarily about debasing females for everyone. However, there's a fundamental issue with the idea that the people in charge of the GOP are acting on behalf of the unborn, namely that if it truly was about looking after the well-being of the people they wouldn't constantly be opposing pretty much every social welfare service.\n\nI know that there are people who do genuinely think it's murder and don't want to make life harder for the mother. I go look at r/CatholicMemes sometimes and while they oppose abortion they also generally support services such as better maternal healthcare, so with them, I can believe they genuinely care. However, those are not the people who are in charge of the political party which has been trying to ban abortions.\n\nThe GOP's goals appear to be to appeal to an extremist faction and to normalize policies that erode the privacy and the autonomy of the populace. Even if some of their supporters have good intentions, those good intentions are being abused to push much less pleasant goals.\n\nOn top of that, even if someone genuinely feels like abortions are murder, to argue against the right to abortion is still an argument against bodily autonomy for pregnant females. Intentions matter, but intentions can't change the fact that if a pregnant female can't choose to have an abortion she doesn't have bodily autonomy.\n\nThe best argument an anti-abortionist could make is that they are merely prioritizing the life of the fetus over the autonomy of the mother, but even then they're still voting against bodily autonomy, and that's significant enough an issue that someone who is pro-choice might not consider that an acceptable position, no matter how much the anti-abortionist reiterates that it's really about the fetus.",
                  "timestamp": "2022-07-01 06:57:55",
                  "score": 1,
                  "num_children": 0,
                  "author": 5588,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ie67tr6",
          "text": "So you'd date a nazi? A racist?  \n\n\nThat aside: No!\n\nPeople should date whoever the fuck they please, and they should end relationships when they please to do that, too.\n\nHow utterly toxic to expect people to meet your arbitrary thresholds before they should be allowed to think of their own life choices to be okay.",
          "timestamp": "2022-06-29 11:19:06",
          "score": 8,
          "num_children": 2,
          "author": 80514,
          "replies": [
            {
              "id": "ie962zm",
              "text": "Nazism is not a single belief, it’s a belief system. This imo is true for racism as well. Viewing every race as inferior to your own constitutes a large amount of horrible opinions to justify and “prove” that other races are inferior. The justification for being anti abortion is (not my opinion, this is theirs, read the Dawkins article) that it’s baby killing. I certainly wouldn’t leave someone because they are opposed to baby killing. Again, not my opinion!",
              "timestamp": "2022-06-29 23:57:16",
              "score": 1,
              "num_children": 1,
              "author": 309340,
              "replies": [
                {
                  "id": "ieakoa9",
                  "text": "I can boil both down to a single belief, analogous to \"women shouldn't have abortions\".\n\n\\> The justification for being anti abortion is (not my opinion, this is theirs, read the Dawkins article) that it’s baby killing. \n\n.... and then you need the entire underlying body of related opinions, about why that is bad, why it is worse than dying teenagers, etc pp.  \n\n\n  \n\n\nWould you leave someone because they were for baby killing? Maybe in the sense that they thought it should not be punishable by law? Still a single opinion...",
                  "timestamp": "2022-06-30 08:02:09",
                  "score": 2,
                  "num_children": 0,
                  "author": 80514,
                  "replies": []
                }
              ]
            },
            {
              "id": "ie6xaft",
              "text": "Can you stop commenting dumb shit like this? You make sensible liberals look dumb",
              "timestamp": "2022-06-29 14:52:48",
              "score": -3,
              "num_children": 1,
              "author": 146054,
              "replies": [
                {
                  "id": "ie768p9",
                  "text": "What exactly do you think is dumb here?\n\nThat I can provide not just one, but two obvious counter-examples to a ridiculous claim, or that I challenge the idea that breaking up with someone needs to meet some threshold of reasonableness?",
                  "timestamp": "2022-06-29 15:52:22",
                  "score": 1,
                  "num_children": 1,
                  "author": 80514,
                  "replies": [
                    {
                      "id": "ie76gay",
                      "text": "The fact that you compared a Nazi to somebody who is pro life. It’s disingenuous and disgusting tbh.",
                      "timestamp": "2022-06-29 15:53:45",
                      "score": 1,
                      "num_children": 1,
                      "author": 146054,
                      "replies": [
                        {
                          "id": "ie7n2o2",
                          "text": "I did no such thing.",
                          "timestamp": "2022-06-29 17:41:18",
                          "score": 1,
                          "num_children": 0,
                          "author": 80514,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ie6o9l2",
          "text": "When that opinion is that you shouldn’t have bodily autonomy, you absolutely should leave based on one opinion. It is reason unto itself, but it’s also a red flag. Opinions don’t happen in a vacuum.",
          "timestamp": "2022-06-29 13:47:56",
          "score": 5,
          "num_children": 1,
          "author": 37515,
          "replies": [
            {
              "id": "ie95aek",
              "text": "To them, though, it’s not about bodily autonomy. Read the article “they think it’s murder” by Richard Dawkins\n\nIf they truly believe that abortion is baby killing, of course they would be opposed to it. It doesn’t *necessarily* carry any consequences on overall worldview or views about women’s bodily autonomy.",
              "timestamp": "2022-06-29 23:51:07",
              "score": 1,
              "num_children": 0,
              "author": 309340,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ie5qjt6",
      "text": "Why would anyone take advise from the people here ....",
      "timestamp": "2022-06-29 07:25:01",
      "score": -5,
      "num_children": 1,
      "replies": [
        {
          "id": "ign8lqj",
          "text": "cause it was a prank for a video lol, so damn funny.\n\nhttps://www.youtube.com/watch?v=EyNFAe4c1k0",
          "timestamp": "2022-07-18 14:19:47",
          "score": 1,
          "num_children": 0,
          "author": 149495,
          "replies": []
        }
      ]
    },
    {
      "id": "ie4u3a1",
      "text": "Irreconcilable differences is legitimate.  But are you letting your immediate reaction to this news (your rage: a short term problem) affect a long term commitment that you will regret losing later?  Or are you using this as an excuse to end a relationship you don’t want to be in for more fundamental reasons (like irreconcilable differences)?\n\nIf you wanted to be with him, this issue would likely not kill it.  I mean I assume so.  That’s how I would be.",
      "timestamp": "2022-06-29 01:55:43",
      "score": -6,
      "num_children": 1,
      "author": 411598,
      "replies": [
        {
          "id": "ie65ohd",
          "text": "That highly depends on how insistent the boyfriend would be when it comes to abortion being wrong.\n\nIf he gave the impression that he was willing to get in the way of abortions and treat her as ethically compromised if she did have an abortion that would squarely fall within the category of an irreconcilable difference since it would mean that he would not accept that she has bodily autonomy.\n\nWhat someone thinks about abortion and how vehemently they support their decision is important because it says something about how that person thinks about personal freedom.",
          "timestamp": "2022-06-29 10:54:04",
          "score": 4,
          "num_children": 0,
          "author": 5588,
          "replies": []
        }
      ]
    },
    {
      "id": "ie4v5ty",
      "text": "[removed]",
      "timestamp": "2022-06-29 02:04:19",
      "score": -7,
      "num_children": 1,
      "replies": [
        {
          "id": "ie5xiw2",
          "text": "Eww! Don't say the C word in a place as UNscared as this!!",
          "timestamp": "2022-06-29 09:03:34",
          "score": -2,
          "num_children": 0,
          "author": 184413,
          "replies": []
        }
      ]
    },
    {
      "id": "ie4fy56",
      "text": "Lmao",
      "timestamp": "2022-06-29 00:01:38",
      "score": -27,
      "num_children": 1,
      "author": 100435,
      "replies": [
        {
          "id": "ie4ismx",
          "text": "Like what the hell is this. She asked reddit to decide if she should break up? People so damn weird. Obviously if they are so delusional to be posting on reddit its a shit relationship anyway and shes using this as an excuse to move on but this just so damn weird lol",
          "timestamp": "2022-06-29 00:24:04",
          "score": -1,
          "num_children": 2,
          "author": 196454,
          "replies": [
            {
              "id": "ie5f15b",
              "text": "She talked to a *lot* of people who have been in the situation she's in, and they gave her some sound advice. Why is that so offensive to you?",
              "timestamp": "2022-06-29 05:04:14",
              "score": 5,
              "num_children": 2,
              "author": 318636,
              "replies": [
                {
                  "id": "ie5g4q0",
                  "text": "She literally says she asked wether she should leave or not? Like I get you feel inclined to be defensive its just not normal behavior lol. Its so weird and the fact youre even with somebody while asking reddit if you should leave is crazy",
                  "timestamp": "2022-06-29 05:16:14",
                  "score": -3,
                  "num_children": 1,
                  "author": 196454,
                  "replies": [
                    {
                      "id": "ie5k0d8",
                      "text": ">She literally says she asked wether she should leave or not?\n\nYes... she did ask users on this subreddit, many of whom have been in the situation she's in, if they thought she should leave her boyfriend. \n\n>Like I get you feel inclined to be defensive\n\nTelling you that you're being bizarrely judgemental about a rather mundane act isn't 'defensive'. \n\n>asking reddit if you should leave is crazy\n\nAsking other people for relationship advice is actually very common among adults and people who aren't complete shut-ins. You might not realize this, but the people you talk to on Reddit are, for the most part, *actual human beings*.",
                      "timestamp": "2022-06-29 06:01:13",
                      "score": 2,
                      "num_children": 1,
                      "author": 318636,
                      "replies": [
                        {
                          "id": "ie5k96x",
                          "text": "Okay yes bud but asking wether she should leave or not isnt…plus a good majority is just going to hate boner because the dudes religious and they are single men…and yes just anonymous human beings of reddit, totally can replace talking to a therapist or you know her actual partner? Like I said, if they are posting on reddit asking people whos identity is not believing in religion if they should leave their partner, the question is already answered",
                          "timestamp": "2022-06-29 06:04:05",
                          "score": -4,
                          "num_children": 1,
                          "author": 196454,
                          "replies": [
                            {
                              "id": "ie5ld18",
                              "text": "Okay, look, you're making a *lot* of totally unfounded and frankly pretty bigoted assumptions on your way to vilifying this subreddit and OP. You clearly didn't even look at the original post. You have zero reason to think that she didn't discuss this with her boyfriend or even a therapist. She's an atheist in a relationship with a Christian asking other atheists who have been in relationships with Christians if they think it can work, and she actually got plenty of answers both ways, and from women as well as men.\n\nGrow up.",
                              "timestamp": "2022-06-29 06:17:29",
                              "score": 5,
                              "num_children": 1,
                              "author": 318636,
                              "replies": [
                                {
                                  "id": "ie5liwo",
                                  "text": "All our proving is this is just as crazy a religious group. Relax bud, its not that deep",
                                  "timestamp": "2022-06-29 06:19:26",
                                  "score": -1,
                                  "num_children": 1,
                                  "author": 196454,
                                  "replies": [
                                    {
                                      "id": "ie5vt9k",
                                      "text": "I'm providing very reasonable criticisms of your actions here. If you really think what I'm saying is crazy, then there's really no reasoning with you.",
                                      "timestamp": "2022-06-29 08:39:20",
                                      "score": 3,
                                      "num_children": 0,
                                      "author": 318636,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ie63ebw",
                  "text": "She asked a bunch of preteens on the Internet.  It's not offensive, but it's fucking stupid.",
                  "timestamp": "2022-06-29 10:25:37",
                  "score": -2,
                  "num_children": 1,
                  "author": 246,
                  "replies": [
                    {
                      "id": "ie716wp",
                      "text": "Average age of users on this subreddit is 23.3. Judging by the comments here, what OP did is deeply offensive to people who lack emotional maturity and social skills.",
                      "timestamp": "2022-06-29 15:19:18",
                      "score": 1,
                      "num_children": 0,
                      "author": 318636,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ie4vd9v",
              "text": "[removed]",
              "timestamp": "2022-06-29 02:05:58",
              "score": -1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ie5f6r0",
      "text": "You didn't need to say atheist man, there are good people and bad people on both sides (I hate how that dumb fuck made those words compare nazis to people wanting healthcare, but look past that for a min) it's entirely possible that you find a guy that respects you, your body and rights and is also a religious man. It might just be easier to find one in atheistic circles",
      "timestamp": "2022-06-29 05:05:52",
      "score": -1,
      "num_children": 0,
      "author": 133111,
      "replies": []
    },
    {
      "id": "ie57dgp",
      "text": "One day old account. The ending...I am sus.",
      "timestamp": "2022-06-29 03:48:19",
      "score": -6,
      "num_children": 0,
      "author": 267353,
      "replies": []
    },
    {
      "id": "ie60xwc",
      "text": "[removed]",
      "timestamp": "2022-06-29 09:52:22",
      "score": -5,
      "num_children": 1,
      "replies": [
        {
          "id": "ie61wpl",
          "text": "Hmmm… no blue hair, no whale, and happy relationships. Stop getting your news from QAnon.",
          "timestamp": "2022-06-29 10:05:41",
          "score": 4,
          "num_children": 0,
          "author": 177324,
          "replies": []
        }
      ]
    },
    {
      "id": "ie46i1u",
      "text": "If you are a pro choice woman, then you need to ensure that your partner is voting blue.  Like make them fill out the ballot and sign and seal it in front of you.",
      "timestamp": "2022-06-28 22:48:40",
      "score": -13,
      "num_children": 2,
      "author": 326986,
      "replies": [
        {
          "id": "ie51kit",
          "text": ">If you are a pro choice woman, then you need to ensure that your partner is voting blue. \n\nWrong, they have a right to vote how they want. There are multiple ways to interpret this, and I will address each one.\n\n1: Ensure they're voting blue, if not, break up with them. This one is probably the most reasonable interpretation of this, I don't think it's necessarily wrong to leave someone who disagrees with you on fundamental levels of politics.\n\n2: They have to vote blue. No, they don't, they have the right to vote however they want, regardless of your politics. Look, I'm blue all the way, but we have the right to vote however we want.\n\nFor both of them, this seems an unreasonable waste of time, you should be worrying more about who you're going to vote for than who your partner is voting for.\n\nI get where you're coming from, I wouldn't want to date someone who is pro-forced birth, but that's where breaking up comes in, if you fundamentally disagree with someone to such a degree it will tear a relationship apart, leave them. (I did not log onto r/atheism thinking I was going to be giving relationship advice, but here I am)",
          "timestamp": "2022-06-29 02:56:46",
          "score": -1,
          "num_children": 0,
          "author": 196362,
          "replies": []
        },
        {
          "id": "ie4vhz7",
          "text": "https://imgur.com/a/KfFMNrf/",
          "timestamp": "2022-06-29 02:07:01",
          "score": -4,
          "num_children": 1,
          "author": 42786,
          "replies": [
            {
              "id": "ie4y8ix",
              "text": "So you put together these pictures to show everyone how both sides are the same?\n\nThats what you think these pictures convey?",
              "timestamp": "2022-06-29 02:28:59",
              "score": -1,
              "num_children": 1,
              "author": 326986,
              "replies": [
                {
                  "id": "ie5bcyo",
                  "text": "Exactly",
                  "timestamp": "2022-06-29 04:26:53",
                  "score": 0,
                  "num_children": 1,
                  "author": 42786,
                  "replies": [
                    {
                      "id": "ie6ob07",
                      "text": "Nyet komrade bothsides",
                      "timestamp": "2022-06-29 13:48:14",
                      "score": 0,
                      "num_children": 0,
                      "author": 326986,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ie5hj92",
      "text": "Hahahahahha cringe",
      "timestamp": "2022-06-29 05:32:01",
      "score": -12,
      "num_children": 0,
      "author": 333423,
      "replies": []
    },
    {
      "id": "ie5ug0c",
      "text": "I'm glad you had the courage to let a bunch of strangers on the internet that don't know you or your boyfriend to help you make this decision.",
      "timestamp": "2022-06-29 08:19:40",
      "score": -6,
      "num_children": 0,
      "author": 221706,
      "replies": []
    },
    {
      "id": "ie61orf",
      "text": "Major bullet he dodged",
      "timestamp": "2022-06-29 10:02:47",
      "score": -8,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie487d5",
      "text": "That’s deep👍",
      "timestamp": "2022-06-28 23:01:28",
      "score": 1,
      "num_children": 0,
      "author": 356182,
      "replies": []
    },
    {
      "id": "ie4frq3",
      "text": "My joy is offset by the fact that if nothing bad happens to someone they will continue blissfully unaware and unbothered by massive suffering literally\neverywhere in the world. Maybe the next edition of humans will possess better traits than us",
      "timestamp": "2022-06-29 00:00:15",
      "score": 1,
      "num_children": 0,
      "author": 257952,
      "replies": []
    },
    {
      "id": "ie4hhs9",
      "text": "Having someone feel sorry for me constantly knowing I was going to their hell, is not going to end well. Good for you!",
      "timestamp": "2022-06-29 00:13:44",
      "score": 1,
      "num_children": 0,
      "author": 210369,
      "replies": []
    },
    {
      "id": "ie4lpvg",
      "text": "Hello miss Lady!",
      "timestamp": "2022-06-29 00:47:31",
      "score": 1,
      "num_children": 0,
      "author": 72350,
      "replies": []
    },
    {
      "id": "ie4munk",
      "text": "Single dude here. I don't think I'm compatible with Christians at this point in my life. Were you atheist when you two got together? I wouldn't be able to do it.",
      "timestamp": "2022-06-29 00:56:31",
      "score": 1,
      "num_children": 0,
      "author": 72413,
      "replies": []
    },
    {
      "id": "ie4pi77",
      "text": "Congrats and condolences. Glad you got that guy out of your life but sorry you lost someone that in other respects seemed good. Though if I may I don’t think you should just restrict yourself to atheist men. What matters most is that they are openminded",
      "timestamp": "2022-06-29 01:18:29",
      "score": 1,
      "num_children": 0,
      "author": 232380,
      "replies": []
    },
    {
      "id": "ie4urqq",
      "text": "Can we get an Amen for her inbox?",
      "timestamp": "2022-06-29 02:01:10",
      "score": 1,
      "num_children": 0,
      "author": 140385,
      "replies": []
    },
    {
      "id": "ie4v9uz",
      "text": "Hopefully this comes across the right way, I'm an atheist myself. I don't think we should look at this decision as a poor reflection on being Christian. I have no problem with people who are Christian or religious in general. It's how the interpret those beliefs that can make them crazy or not. (I think anyone not pro-choice is crazy, lol)\n\nI know many people who are Christian that I aslo think are good people. They are pro-choice, anto-violence, open to other life styles. I even dated one because our beliefs about life in general matched up in other areas. \n\nI am really happy for you that you loved on from someone who was clearly not the right person for you. Religious beliefs cover a wide range people. Theres someone out there for you, religious or not, that aligns better with you.",
      "timestamp": "2022-06-29 02:05:12",
      "score": 1,
      "num_children": 0,
      "author": 83035,
      "replies": []
    },
    {
      "id": "ie545bn",
      "text": "Hallelujah!",
      "timestamp": "2022-06-29 03:19:06",
      "score": 1,
      "num_children": 0,
      "author": 15574,
      "replies": []
    },
    {
      "id": "ie59ogi",
      "text": "You made the right decision to leave him. I didn't see your post asking for advice but may I ask what the issue with him was as far as him being a Christian? Just curious.",
      "timestamp": "2022-06-29 04:10:16",
      "score": 1,
      "num_children": 0,
      "author": 131983,
      "replies": []
    },
    {
      "id": "ie5a9dx",
      "text": "Tell him to go and join the Duggar family...",
      "timestamp": "2022-06-29 04:16:02",
      "score": 1,
      "num_children": 0,
      "author": 54231,
      "replies": []
    },
    {
      "id": "ie5by8y",
      "text": "Good for you, OP.  No need to live your one life with one who dwells in a fairy tale, uses magical thinking to make decisions.\n\nThe thought of invisible supernatural beings is beyond claustrophobic.  More like a life sentence in prison where paranoia is the everyday ruler.",
      "timestamp": "2022-06-29 04:32:50",
      "score": 1,
      "num_children": 0,
      "author": 389685,
      "replies": []
    },
    {
      "id": "ie5byje",
      "text": "I am so happy for you! Just a heads up - the immediate aftermath may hurt a little (depending on how close you were) but in time you will thank your past self for having the strength and courage to do what’s best for yourself 💜",
      "timestamp": "2022-06-29 04:32:55",
      "score": 1,
      "num_children": 0,
      "author": 53394,
      "replies": []
    },
    {
      "id": "ie5c527",
      "text": "Woo! Better and brighter! Be free! No more psychological baggage thrown at you. No more nonsense! 🎊",
      "timestamp": "2022-06-29 04:34:42",
      "score": 1,
      "num_children": 0,
      "author": 350798,
      "replies": []
    },
    {
      "id": "ie5ca6u",
      "text": "happy for you!",
      "timestamp": "2022-06-29 04:36:07",
      "score": 1,
      "num_children": 0,
      "author": 9474,
      "replies": []
    },
    {
      "id": "ie5cx0i",
      "text": "[removed]",
      "timestamp": "2022-06-29 04:42:07",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "ie5dp29",
          "text": "Thank you for your contribution. Unfortunately, trolling and/or shitposting are not allowed in this subreddit per the [subreddit rules](http://www.reddit.com/r/atheism/wiki/guidelines). \n\nIf you have any questions, please don't hesitate to [contact the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fatheism). Thank you for your cooperation.",
          "timestamp": "2022-06-29 04:50:08",
          "score": 1,
          "num_children": 0,
          "author": 318636,
          "replies": []
        }
      ]
    },
    {
      "id": "ie5dr24",
      "text": "I am certainly not aware ur life but I’m happy that u are happy. :)",
      "timestamp": "2022-06-29 04:50:41",
      "score": 1,
      "num_children": 0,
      "author": 53060,
      "replies": []
    },
    {
      "id": "ie5eplp",
      "text": "I am extremely proud of you. I was in a similar situation (although I am male and my GF was the Christian), and it never would have worked out. \n\nAlways remember how big role intelligence plays in open-mindedness.",
      "timestamp": "2022-06-29 05:00:50",
      "score": 1,
      "num_children": 0,
      "author": 325056,
      "replies": []
    },
    {
      "id": "ie5gcrr",
      "text": "You made the right choice.  You will find what you seek in life.  Stay true to yourself and believe in your own good judgement.  Don't ever trust someone who follows religion blindly.  Religion teaches some horrific stuff, and it's unacceptable in modern society.  The Bible promotes slavery, child trafficking, genocide, extreme violence, and so many other horrific things.  The Law of Moses is barbaric by today's moral standards.  Don't trust anyone who follows that code and you'll be fine.",
      "timestamp": "2022-06-29 05:18:42",
      "score": 1,
      "num_children": 0,
      "author": 381353,
      "replies": []
    },
    {
      "id": "ie5hzs5",
      "text": "I have a feeling the relationship wouldn't have worked out, anyways...",
      "timestamp": "2022-06-29 05:37:22",
      "score": 1,
      "num_children": 0,
      "author": 346509,
      "replies": []
    },
    {
      "id": "ie5iduf",
      "text": "Good for you! I can't imagine being with someone with such opposing views.",
      "timestamp": "2022-06-29 05:41:58",
      "score": 1,
      "num_children": 0,
      "author": 280415,
      "replies": []
    },
    {
      "id": "ie5ik1e",
      "text": "As someone who's been through a lot, I think you should be proud to have made the decisions to reach out to other people for advice, take so much time to take in the opinions of others, and act on it so quickly. I saw your other post and I think you made the right decision. I wish you the best.",
      "timestamp": "2022-06-29 05:43:58",
      "score": 1,
      "num_children": 0,
      "author": 235547,
      "replies": []
    },
    {
      "id": "ie5kthw",
      "text": "Finding a lifelong partner isn't easy, and not every attempt works out. It's good to identify the showstopper issue early rather than later. We all wish you the best of luck.",
      "timestamp": "2022-06-29 06:10:52",
      "score": 1,
      "num_children": 0,
      "author": 110715,
      "replies": []
    },
    {
      "id": "ie5mnle",
      "text": "Well done",
      "timestamp": "2022-06-29 06:33:36",
      "score": 1,
      "num_children": 0,
      "author": 217340,
      "replies": []
    },
    {
      "id": "ie5psnp",
      "text": "Deus io vult.\n\nYou did the right thing to leave him.",
      "timestamp": "2022-06-29 07:14:51",
      "score": 1,
      "num_children": 0,
      "author": 189957,
      "replies": []
    },
    {
      "id": "ie5s0u9",
      "text": "Thank you for sharing this. Hope you are going to be happy as you deserve.",
      "timestamp": "2022-06-29 07:45:35",
      "score": 1,
      "num_children": 0,
      "author": 292191,
      "replies": []
    },
    {
      "id": "ie637sf",
      "text": "I was actually wondering about what you’d do as I was one of those who left you a message. As someone who was in a situation in which my partner was not as supportive as he should have been when we had a pregnancy scare, I felt compelled to comment even though so many had already chimed in.\n\nI am very glad you made this decision. Normally I would not feel qualified to advise anyone on relationships but in this case, I felt like I had to say something if only for my peace of mind.\n\nYou did the right thing. This issue would only become more pressing in the future. Anyone who doesn’t think your body belongs to you does not deserve you.",
      "timestamp": "2022-06-29 10:23:14",
      "score": 1,
      "num_children": 0,
      "author": 83365,
      "replies": []
    },
    {
      "id": "ie643df",
      "text": "so much for love.  I probably missed a lot, but why couldn't you agree to disagree?",
      "timestamp": "2022-06-29 10:34:32",
      "score": 1,
      "num_children": 0,
      "author": 296939,
      "replies": []
    },
    {
      "id": "ie67uzh",
      "text": "There would only be more conflicts down the road, and it would only get worse.  Take it from a woman on Medicare.  I've seen way too many women ignore major issues in their relationships, whether it's a guy who drinks too much, won't do household chores (even the man-specific jobs), won't stay employed, etc.  Christianity is always about judgment, morality, following archaic and sexist rules, and justifying every action with Jesus or the Bible.  It's irrational.  Even \"liberal\" Christians are like this.",
      "timestamp": "2022-06-29 11:19:27",
      "score": 1,
      "num_children": 0,
      "author": 384598,
      "replies": []
    },
    {
      "id": "ie69ajj",
      "text": "Congrats! Never again! No second coming!👍",
      "timestamp": "2022-06-29 11:34:46",
      "score": 1,
      "num_children": 0,
      "author": 191992,
      "replies": []
    },
    {
      "id": "ie6ady4",
      "text": "I mean, sounds like you already had your mind made up if you asked this sub. What opinion did you expect to get?",
      "timestamp": "2022-06-29 11:46:11",
      "score": 1,
      "num_children": 0,
      "author": 45522,
      "replies": []
    },
    {
      "id": "ie6apm5",
      "text": "I married a good “god-fearing” southern Christian girl. And two years later she ended up being more of a militant atheist than I ever have been!",
      "timestamp": "2022-06-29 11:49:26",
      "score": 1,
      "num_children": 1,
      "author": 282419,
      "replies": [
        {
          "id": "ie7t3bv",
          "text": "This is the sort of story I like to hear, personally.",
          "timestamp": "2022-06-29 18:20:53",
          "score": 1,
          "num_children": 0,
          "author": 77833,
          "replies": []
        }
      ]
    },
    {
      "id": "ie6c0iw",
      "text": "Good for you!!!  Don't tie yourself down to people who use their belief system to be bigots and such.",
      "timestamp": "2022-06-29 12:02:32",
      "score": 1,
      "num_children": 0,
      "author": 21057,
      "replies": []
    },
    {
      "id": "ie6dhgk",
      "text": "Congrats and welcome to the rest of your life.  There are atheist men out there.  You'll eventually meet a guy who will be be a great partner and will appreciate you.",
      "timestamp": "2022-06-29 12:16:53",
      "score": 1,
      "num_children": 0,
      "author": 150056,
      "replies": []
    },
    {
      "id": "ie6e6uc",
      "text": "We don't need religions to be a good and sensible person.",
      "timestamp": "2022-06-29 12:23:27",
      "score": 1,
      "num_children": 0,
      "author": 385581,
      "replies": []
    },
    {
      "id": "ie6escz",
      "text": "I’m so happy for you! Live a life of freedom, just be safe.",
      "timestamp": "2022-06-29 12:28:54",
      "score": 1,
      "num_children": 0,
      "author": 108496,
      "replies": []
    },
    {
      "id": "ie6g83a",
      "text": "Yay! Good for you! You were a random woman on the internet yesterday also, now you area a shitbag free random woman on the internet! Yay!! Good luck and I hope you stay safe!",
      "timestamp": "2022-06-29 12:41:53",
      "score": 1,
      "num_children": 0,
      "author": 160381,
      "replies": []
    },
    {
      "id": "ie6ha6p",
      "text": "I'm sorry you had to go through that.  Heartbreak is not fun.  But ultimately it's really important to have a partner with shared respect and support, and unfortunately religion really gets in the way of that...\n\n>I know I am just some random woman on the Internet\n\nYou are a living breathing thinking human being, and you deserve a good life and good people around you!",
      "timestamp": "2022-06-29 12:51:05",
      "score": 1,
      "num_children": 0,
      "author": 216152,
      "replies": []
    },
    {
      "id": "ie6hia5",
      "text": "Congrats! A life without christians is a life worth living.",
      "timestamp": "2022-06-29 12:53:02",
      "score": 1,
      "num_children": 0,
      "author": 58288,
      "replies": []
    },
    {
      "id": "ie6i3le",
      "text": "Great, great, GREAT choice. You made the smartest move, the move that will allow you to thrive in the future. Especially now, not a single woman can award a man who is anti-choice with her presence. I hope you're doing good, but if you aren't, I hope that you will feel better soon and be happy!",
      "timestamp": "2022-06-29 12:58:06",
      "score": 1,
      "num_children": 0,
      "author": 363113,
      "replies": []
    },
    {
      "id": "ie6je6o",
      "text": "I'm glad you feel good about your decision. And that you got out of a potentially unsafe situation",
      "timestamp": "2022-06-29 13:09:04",
      "score": 1,
      "num_children": 0,
      "author": 302037,
      "replies": []
    },
    {
      "id": "ie6oibq",
      "text": "As one of the people who commented previously, let me just say I am glad you made the decision that was right for you and that you are safe. I hope you find someone else that keeps you safe and makes you happy.",
      "timestamp": "2022-06-29 13:49:47",
      "score": 1,
      "num_children": 0,
      "author": 339001,
      "replies": []
    },
    {
      "id": "ie6p0ps",
      "text": "Congratulations. You made the right choice.",
      "timestamp": "2022-06-29 13:53:38",
      "score": 1,
      "num_children": 0,
      "author": 172547,
      "replies": []
    },
    {
      "id": "ie6rmsc",
      "text": "Yay!  Get away from the toxic people!",
      "timestamp": "2022-06-29 14:12:59",
      "score": 1,
      "num_children": 0,
      "author": 62345,
      "replies": []
    },
    {
      "id": "ie6tq4n",
      "text": "Was his reply go to hell?",
      "timestamp": "2022-06-29 14:27:55",
      "score": 1,
      "num_children": 0,
      "author": 366388,
      "replies": []
    },
    {
      "id": "ie6wl64",
      "text": "You go find yourself a nice logical atheist man!",
      "timestamp": "2022-06-29 14:47:59",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie6x0r7",
      "text": "Good for you we athiests have to stick together",
      "timestamp": "2022-06-29 14:50:56",
      "score": 1,
      "num_children": 0,
      "author": 118002,
      "replies": []
    },
    {
      "id": "ie70j8m",
      "text": "Shared values, not even beliefs, are the bedrock of a relationship. Plenty of people with different religions have lifelong relationships, but they often share core values around things like gender roles, education, etc. Without shared values, life decisions between partners are impossible. It would not be healthy or sustainable. You would divide yourselves naturally. I hope you find someone you can share your life with that also shares your core values.",
      "timestamp": "2022-06-29 15:14:50",
      "score": 1,
      "num_children": 0,
      "author": 226959,
      "replies": []
    },
    {
      "id": "ie75oog",
      "text": "so glad. i never want to see another woman with a man who doesn't care about her health.  proud of you for doing the hard and necessary thing. way to stand up for yourself. may you always have the inner strength you need to do it.",
      "timestamp": "2022-06-29 15:48:44",
      "score": 1,
      "num_children": 0,
      "author": 216584,
      "replies": []
    },
    {
      "id": "ie77rfu",
      "text": "thank you Reddit for showing me the follow up post in my home feed",
      "timestamp": "2022-06-29 16:02:25",
      "score": 1,
      "num_children": 0,
      "author": 324656,
      "replies": []
    },
    {
      "id": "ie77y85",
      "text": "A good way to soft pedal it is to say something like this to a date: \"I'm not religious at all, is that ok with you?\". The goal for me would be to find someone with this attitude: \"My beliefs are 100% my business and 0% yours, and your beliefs are 100% your business and 0% mine.\". Some religious people are tolerant enough to be permanently ok with that. I've been in relationships with some :). But they have to be REALLY ok with that. No hidden agendas. But if you can find someone like that, then religion gets out of the way, and the other components of personality can be used to determine the future of the relationship. As they should :):).",
      "timestamp": "2022-06-29 16:03:40",
      "score": 1,
      "num_children": 0,
      "author": 65874,
      "replies": []
    },
    {
      "id": "ie78d2w",
      "text": "Congrats! Always seek freedom. Religion isn't a right to oppress others.",
      "timestamp": "2022-06-29 16:06:22",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie7bhk4",
      "text": "Congrats! As an atheist engaged to a Christian, religion is no excuse to not believe in human rights and bodily autonomy for women. My fiancé supports my right to choose and if he didn’t I would leave him too. Hehe that rhymes",
      "timestamp": "2022-06-29 16:26:34",
      "score": 1,
      "num_children": 0,
      "author": 23893,
      "replies": []
    },
    {
      "id": "ie7doq4",
      "text": "Right on, young woman! No gods, no masters\n— older woman",
      "timestamp": "2022-06-29 16:40:41",
      "score": 1,
      "num_children": 0,
      "author": 405857,
      "replies": []
    },
    {
      "id": "ie7edcx",
      "text": "I’ll be rooting for ya, OP 👍",
      "timestamp": "2022-06-29 16:45:05",
      "score": 1,
      "num_children": 0,
      "author": 154721,
      "replies": []
    },
    {
      "id": "ie7f0tb",
      "text": "Atheists aren't the only respectful people,  like Christians using the Fish icon or crosses to promote their moral image, so too can atheists be absolute scumbags acting like they've tagged a moral reasoning that is superior for their lack of faith.  But still be morally bankrupt or hold bad views.\n\nJust have the hard conversations earlier and not like 1st date when they're lying to get laid.  Like a few weeks in.\n\nI don't see Atheists as morally superior automatically,  just usually not in religious households, most turning to religion as they age for the \"escape death thoughts\" it provides.\n\nFinding a good person to be with is very difficult,  so good luck.",
      "timestamp": "2022-06-29 16:49:14",
      "score": 1,
      "num_children": 0,
      "author": 221184,
      "replies": []
    },
    {
      "id": "ie7g3jc",
      "text": "I am not an atheist but seriously, fuck fundamentalist Christians.  Throw them all into an exceedingly deep well.",
      "timestamp": "2022-06-29 16:56:05",
      "score": 1,
      "num_children": 0,
      "author": 323367,
      "replies": []
    },
    {
      "id": "ie7gr4z",
      "text": "Did you actually break up with him just because he was Christian?",
      "timestamp": "2022-06-29 17:00:17",
      "score": 1,
      "num_children": 0,
      "author": 235394,
      "replies": []
    },
    {
      "id": "ie7gs2m",
      "text": "So I hear you're single now...😉",
      "timestamp": "2022-06-29 17:00:27",
      "score": 1,
      "num_children": 0,
      "author": 406849,
      "replies": []
    },
    {
      "id": "ie7j508",
      "text": "It sounds like it was for the best",
      "timestamp": "2022-06-29 17:15:51",
      "score": 1,
      "num_children": 0,
      "author": 299723,
      "replies": []
    },
    {
      "id": "ie7jkq3",
      "text": "Whatever happened to, \"no uterus, no opinion\"?",
      "timestamp": "2022-06-29 17:18:38",
      "score": 1,
      "num_children": 0,
      "author": 296292,
      "replies": []
    },
    {
      "id": "ie7manq",
      "text": "Congratulations and good luck!!!",
      "timestamp": "2022-06-29 17:36:09",
      "score": 1,
      "num_children": 0,
      "author": 174048,
      "replies": []
    },
    {
      "id": "ie7ncl9",
      "text": "Thank you for the update!   I know it may be a bummer not having the SO in your life for a little bit but I promise the future will be better off for it.",
      "timestamp": "2022-06-29 17:43:07",
      "score": 1,
      "num_children": 0,
      "author": 257447,
      "replies": []
    },
    {
      "id": "ie7r85i",
      "text": "You made the right decision, it is obvious that your values aren't compatible with his, and you did him a favor in the process.  As a pro-lifer, I don't even know how a person with a strong pro-life stance could stand to date a pro-choicer. I would break it off with any man who would admit to supporting abortion, and I wouldn't want to date a person who has such a big value discrepancy with myself.",
      "timestamp": "2022-06-29 18:08:27",
      "score": 1,
      "num_children": 0,
      "author": 152123,
      "replies": []
    },
    {
      "id": "ie7rrhc",
      "text": "Wow, I'm surprised. Atheism was never about punishing people for bad ideas, it was about encouraging the pursuit of good ones. Shame.",
      "timestamp": "2022-06-29 18:12:01",
      "score": 1,
      "num_children": 0,
      "author": 189272,
      "replies": []
    },
    {
      "id": "ie7sbtg",
      "text": "Late to the thread but yeah you deserve better than a man who doesn't understand that you should be the one to decide what you do and don't do with your own body. If he doesn't respect something as vital as your right to bodily autonomy now, then there's a pretty good chance he won't respect you down the line, when it's something equally important like consent. It's good that you got out early.",
      "timestamp": "2022-06-29 18:15:49",
      "score": 1,
      "num_children": 0,
      "author": 29510,
      "replies": []
    },
    {
      "id": "ie7t4pk",
      "text": "Bravo!  Lots of us care!  Good luck on your new journey!",
      "timestamp": "2022-06-29 18:21:08",
      "score": 1,
      "num_children": 0,
      "author": 306478,
      "replies": []
    },
    {
      "id": "ie7w0bs",
      "text": "Fair play and congratulations. I have no hatred for christians, or followers of any religions, I just think they’re incredibly delusional and manipulated, but having grown up in an extremely religious family (personally thinking it was all bullshit and utterly nonsense from around age 13) I know how difficult it can be. My mum knows I’m atheist and hates it, my dad (former pastor) is now dead so not a problem, I have 2 brothers, one a ‘believer’ and one not, but his wife is, so I still see it as some weird shadow that I’ll never lose. \n\nWell done for making this step. And I come from a place where people have a totally ‘meh’ attitude to what you believe so I’m very lucky, I couldn’t imagine ever having to write the post you have, or the idea that saying ‘sorry, I’m an atheist’ would ever be an issue. \n\nGood luck x",
      "timestamp": "2022-06-29 18:40:17",
      "score": 1,
      "num_children": 0,
      "author": 249781,
      "replies": []
    },
    {
      "id": "ie80xpp",
      "text": "I'm so happy for you. It is really empowering seeing so many women standing up for themselves. That took courage.",
      "timestamp": "2022-06-29 19:13:10",
      "score": 1,
      "num_children": 0,
      "author": 106785,
      "replies": []
    },
    {
      "id": "ie81tz8",
      "text": "Good for you, seriously. Here's hoping you find someone who sees that you deserve more than to be a glorified breeding machine.",
      "timestamp": "2022-06-29 19:19:09",
      "score": 1,
      "num_children": 0,
      "author": 314755,
      "replies": []
    },
    {
      "id": "ie8586n",
      "text": "Good for you!!  I'm Sure it was hard but in the long run  you both will be happier. You should always be happy and upfront about who you are as an individual and find a man that does the same. You are brave and bold.",
      "timestamp": "2022-06-29 19:41:33",
      "score": 1,
      "num_children": 0,
      "author": 275757,
      "replies": []
    },
    {
      "id": "ie85ht2",
      "text": "Congrats 👏🏻",
      "timestamp": "2022-06-29 19:43:16",
      "score": 1,
      "num_children": 0,
      "author": 57389,
      "replies": []
    },
    {
      "id": "ie86ek8",
      "text": "My deranged half assed Christian ex wanted me to raise kids as Christian and get married waaay too fast. Glad I got the hell out of that relationshit.",
      "timestamp": "2022-06-29 19:49:12",
      "score": 1,
      "num_children": 0,
      "author": 219011,
      "replies": []
    },
    {
      "id": "ie876s3",
      "text": "I would say God bless you but…",
      "timestamp": "2022-06-29 19:54:19",
      "score": 1,
      "num_children": 0,
      "author": 261117,
      "replies": []
    },
    {
      "id": "ie8f7sq",
      "text": "Wait until you find out atheists can be pro life",
      "timestamp": "2022-06-29 20:46:46",
      "score": 1,
      "num_children": 0,
      "author": 303235,
      "replies": []
    },
    {
      "id": "ie8l91w",
      "text": "I’m an atheist. Sounds like he dodged a bullet on this one.",
      "timestamp": "2022-06-29 21:27:09",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie8lpc8",
      "text": "Looks like he dodged a bullet there.",
      "timestamp": "2022-06-29 21:30:11",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie8p6iw",
      "text": "I'm so happy that we could help. You deserve someone who's safe, and recognizes your human rights.",
      "timestamp": "2022-06-29 21:53:44",
      "score": 1,
      "num_children": 0,
      "author": 164723,
      "replies": []
    },
    {
      "id": "ie8vmex",
      "text": "From a rando to a rando: It gets better.",
      "timestamp": "2022-06-29 22:39:13",
      "score": 1,
      "num_children": 0,
      "author": 298257,
      "replies": []
    },
    {
      "id": "ie8xiji",
      "text": "It’s always difficult to make these kind of choice but everyone deserve bf/gf respect. No point staying with people that don’t respect you.",
      "timestamp": "2022-06-29 22:52:49",
      "score": 1,
      "num_children": 0,
      "author": 2162,
      "replies": []
    },
    {
      "id": "ie8z37a",
      "text": "plussizeskeptic💀",
      "timestamp": "2022-06-29 23:04:27",
      "score": 1,
      "num_children": 0,
      "author": 96794,
      "replies": []
    },
    {
      "id": "ie9sslw",
      "text": "Imagine being this shallow",
      "timestamp": "2022-06-30 02:56:56",
      "score": 1,
      "num_children": 1,
      "author": 390671,
      "replies": [
        {
          "id": "ign86sl",
          "text": "Luckily it's a joke haha.\n\nhttps://www.youtube.com/watch?v=EyNFAe4c1k0",
          "timestamp": "2022-07-18 14:16:51",
          "score": 1,
          "num_children": 0,
          "author": 149495,
          "replies": []
        }
      ]
    },
    {
      "id": "ie9y3qu",
      "text": "If he doesn’t respect your reproductive rights, why do you want to stay? You’re not a baby-carrying vessel.",
      "timestamp": "2022-06-30 03:43:38",
      "score": 1,
      "num_children": 0,
      "author": 297942,
      "replies": []
    },
    {
      "id": "ieaczuf",
      "text": "You made the right choice stranger.  Ones belief system is a huge component in a relationship. Sure it can work with two different beliefs, but it's really difficult. \n\nI used to be with a hard-core Christian woman,  and man life was so difficult.  Like let's say I come to confide in her a problem or a struggle, looking for comfort or advice, most of the time responses would be \"Well just pray about it, see what God wants you to do\" the conversion is over at that point.  Because there is no God, and prayer is either talking to yourself or akin to meditation. \n\nI'm happily engaged to an atheist scientist now.",
      "timestamp": "2022-06-30 06:20:58",
      "score": 1,
      "num_children": 0,
      "author": 121892,
      "replies": []
    },
    {
      "id": "ieatiwo",
      "text": "He Dodge a bullet, lol \"plus size skeptic.",
      "timestamp": "2022-06-30 10:06:04",
      "score": 1,
      "num_children": 1,
      "author": 242518,
      "replies": [
        {
          "id": "ign82u0",
          "text": "the funny thing is this was all a prank by a YouTuber \n\nhttps://www.youtube.com/watch?v=EyNFAe4c1k0",
          "timestamp": "2022-07-18 14:16:03",
          "score": 1,
          "num_children": 1,
          "author": 149495,
          "replies": [
            {
              "id": "ijhfrg7",
              "text": "A very well thought out prank",
              "timestamp": "2022-08-08 19:49:52",
              "score": 1,
              "num_children": 0,
              "author": 410369,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ieodylj",
      "text": "Not that it matters.  But the Bible is not at all pro-Choice.  It has lots of awful ideas about women, but can be shown to be not pro-Choice pretty easy.  Still, women were property and baby machines.  Who should give a fuck about an agrarian religion over 2000 years ago with no moral relevance.",
      "timestamp": "2022-07-03 08:48:14",
      "score": 1,
      "num_children": 0,
      "author": 38101,
      "replies": []
    },
    {
      "id": "igm5kai",
      "text": "Smh",
      "timestamp": "2022-07-18 07:10:39",
      "score": 1,
      "num_children": 0,
      "author": 12092,
      "replies": []
    },
    {
      "id": "ign7wr9",
      "text": "Damn, Alex really got you guys good lmfao.\n\nhttps://www.youtube.com/watch?v=EyNFAe4c1k0",
      "timestamp": "2022-07-18 14:14:51",
      "score": 1,
      "num_children": 2,
      "author": 149495,
      "replies": [
        {
          "id": "igohwih",
          "text": "pretty funny stuff",
          "timestamp": "2022-07-18 19:21:16",
          "score": 1,
          "num_children": 0,
          "author": 118072,
          "replies": []
        },
        {
          "id": "igpuhkr",
          "text": "Yeah lol. Im just here (came immediately after watching his video) to read the comments before they know about it and nuke the post.\n\nNext time he need to troll SaintsRow sub.",
          "timestamp": "2022-07-19 00:59:18",
          "score": 1,
          "num_children": 1,
          "author": 148412,
          "replies": [
            {
              "id": "igpwswm",
              "text": "Yeah Alex should really make a habit of screwing with cringy subs.",
              "timestamp": "2022-07-19 01:16:44",
              "score": 1,
              "num_children": 0,
              "author": 149495,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "igpri2q",
      "text": "https://www.youtube.com/watch?v=dQw4w9WgXcQ",
      "timestamp": "2022-07-19 00:37:09",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "igrf8ea",
      "text": "That video was amazing bro.",
      "timestamp": "2022-07-19 10:41:27",
      "score": 1,
      "num_children": 0,
      "author": 128826,
      "replies": []
    },
    {
      "id": "igsx7t0",
      "text": "I fucking love hexagons for some reason....",
      "timestamp": "2022-07-19 17:23:20",
      "score": 1,
      "num_children": 1,
      "author": 411618,
      "replies": [
        {
          "id": "igu47oq",
          "text": "I also want to play Saints Row 1 or 2 after reading this brave woman topic.",
          "timestamp": "2022-07-19 21:52:33",
          "score": 1,
          "num_children": 1,
          "author": 148412,
          "replies": [
            {
              "id": "ijhfnqb",
              "text": "I want to learn about the social repercussions of religious decline.",
              "timestamp": "2022-08-08 19:49:12",
              "score": 1,
              "num_children": 0,
              "author": 410369,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "igvvupq",
      "text": "Lmao, great stuff Alex.",
      "timestamp": "2022-07-20 06:28:04",
      "score": 1,
      "num_children": 0,
      "author": 76811,
      "replies": []
    },
    {
      "id": "ij947ws",
      "text": "[removed]",
      "timestamp": "2022-08-07 00:39:48",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "im3xv4b",
      "text": "Wow Alex you really did troll this sub",
      "timestamp": "2022-08-28 09:26:37",
      "score": 1,
      "num_children": 0,
      "author": 405986,
      "replies": []
    },
    {
      "id": "imilgiy",
      "text": "Dear PlusSizeSkeptic.  Sorry I am just now seeing this.  If I had, I would have told you that you are likely never going to find a partner with whom you agree on every single controversial topic.  Furthermore, you said you got along in every other aspect of your relationship.  A shame you threw it away over one disagreement.  \n\nPS.  I know you're not really an atheist and that this was just a social experiment to prove what you thought was a point: that all athiests have the same militant beliefs and that \"atheism is a religion\".  There is as much truth to that as stating that \"all Christians have the same militant beliefs.\"  Best to you.",
      "timestamp": "2022-08-31 12:57:25",
      "score": 1,
      "num_children": 0,
      "author": 15718,
      "replies": []
    },
    {
      "id": "inpfyvl",
      "text": "Just imagine what other rights he doesn't think you're entitled to.",
      "timestamp": "2022-09-09 09:42:15",
      "score": 1,
      "num_children": 0,
      "author": 120295,
      "replies": []
    },
    {
      "id": "ip0uvxd",
      "text": "Absolutely based. Praise God.",
      "timestamp": "2022-09-19 04:05:56",
      "score": 1,
      "num_children": 0,
      "author": 240304,
      "replies": []
    },
    {
      "id": "ie5jt40",
      "text": "I'm pro-choice, and I'm an atheist. I think leaving him just because he's pro-life is a bad choice. People have all kinds of different beliefs about abortion. Most people have no problem with first trimester abortion. Maybe your boyfriend could be talked over to first trimester thinking. But its too late.",
      "timestamp": "2022-06-29 05:58:47",
      "score": -9,
      "num_children": 2,
      "author": 326763,
      "replies": [
        {
          "id": "ie5k87h",
          "text": "The first post was asking for advice. This post is not.",
          "timestamp": "2022-06-29 06:03:47",
          "score": 9,
          "num_children": 0,
          "author": 318636,
          "replies": []
        },
        {
          "id": "ie6ovu7",
          "text": "Nah it’s a red flag, if she has an abortion and goes ape shit, he could report her to the state and have legal problems. She basically has no privacy with this dude.",
          "timestamp": "2022-06-29 13:52:37",
          "score": 2,
          "num_children": 0,
          "author": 291514,
          "replies": []
        }
      ]
    },
    {
      "id": "ie4ttwg",
      "text": "[removed]",
      "timestamp": "2022-06-29 01:53:36",
      "score": -2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie4u7hj",
      "text": "[removed]",
      "timestamp": "2022-06-29 01:56:38",
      "score": -1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie4g9q4",
      "text": "So you’re a single womxn and popular with an select group on the internet? Start an Onlyfans",
      "timestamp": "2022-06-29 00:04:09",
      "score": -23,
      "num_children": 0,
      "author": 71795,
      "replies": []
    },
    {
      "id": "ie55yns",
      "text": "Don’t limit yourself to only atheists as patrners. There are many people who consider themselves as xyz religion but don’t hold those same beliefs. My partner considered himself Catholic when we were first dating. He was open to me challenging or asking questions about some of his beliefs and he did a lot of his own research and came to different conclusions. I don’t know what he considers himself now and I definitely don’t think I “changed” him. He was raised in a religious household and he just kept on with what he was taught. It definitely would not have worked between us if he hadn’t moderated some of his beliefs but we could have been friends. He’s such a chill guy, I have no idea why he hadn’t challenged those beliefs before but I am glad he did.",
      "timestamp": "2022-06-29 03:35:17",
      "score": -5,
      "num_children": 1,
      "author": 263634,
      "replies": [
        {
          "id": "iftcqz3",
          "text": "Lol so people have to start out as atheists to make you people happy? People can’t change and grow? Haha good luck!",
          "timestamp": "2022-07-12 03:51:31",
          "score": 1,
          "num_children": 0,
          "author": 263634,
          "replies": []
        }
      ]
    },
    {
      "id": "ie5dczv",
      "text": "5/5 LARP.",
      "timestamp": "2022-06-29 04:46:41",
      "score": -5,
      "num_children": 0,
      "author": 232711,
      "replies": []
    },
    {
      "id": "ie61lrc",
      "text": "[removed]",
      "timestamp": "2022-06-29 10:01:40",
      "score": -5,
      "num_children": 1,
      "replies": [
        {
          "id": "ie6qefo",
          "text": "That someone is u/Flat-Relationship611",
          "timestamp": "2022-06-29 14:04:01",
          "score": 2,
          "num_children": 0,
          "author": 45215,
          "replies": []
        }
      ]
    },
    {
      "id": "ie6c74k",
      "text": "You mean you broke up with him for the karma.",
      "timestamp": "2022-06-29 12:04:21",
      "score": -6,
      "num_children": 0,
      "author": 307116,
      "replies": []
    },
    {
      "id": "ie4yhgu",
      "text": "[removed]",
      "timestamp": "2022-06-29 02:30:58",
      "score": -5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie6d2t8",
      "text": "I’m sure you saved him from a life of heartache, especially since your only recourse was strangers on the internet apparently.",
      "timestamp": "2022-06-29 12:12:57",
      "score": -6,
      "num_children": 0,
      "author": 216348,
      "replies": []
    },
    {
      "id": "ie5yq8p",
      "text": "Thank you for saving that poor boy's immortal soul. He was doomed with you, DOOMED!",
      "timestamp": "2022-06-29 09:20:35",
      "score": -8,
      "num_children": 1,
      "author": 354285,
      "replies": [
        {
          "id": "ie6qihy",
          "text": "Please comment “Doomed” one more time but in bold.",
          "timestamp": "2022-06-29 14:04:51",
          "score": 2,
          "num_children": 0,
          "author": 45215,
          "replies": []
        }
      ]
    },
    {
      "id": "ie608fh",
      "text": "You should go for a muslim man, they are very tolerant and pro-choice on abortion! :D",
      "timestamp": "2022-06-29 09:42:19",
      "score": -8,
      "num_children": 0,
      "author": 320857,
      "replies": []
    },
    {
      "id": "ie64ftn",
      "text": "Ridiculous, most pro choicers and democrats are Christian too, the abortion debate is not a religious debate.",
      "timestamp": "2022-06-29 10:38:52",
      "score": -8,
      "num_children": 0,
      "author": 304459,
      "replies": []
    },
    {
      "id": "ie4675m",
      "text": "[removed]",
      "timestamp": "2022-06-28 22:46:24",
      "score": -12,
      "num_children": 1,
      "replies": [
        {
          "id": "ie4doxk",
          "text": "No, she left her boyfriend because he didn't respect her right to bodily autonomy and people on the internet helped empower her to find someone who will advocate for her rather than betray her.",
          "timestamp": "2022-06-28 23:44:04",
          "score": 8,
          "num_children": 0,
          "author": 397954,
          "replies": []
        }
      ]
    },
    {
      "id": "ie3o54a",
      "text": "[removed]",
      "timestamp": "2022-06-28 20:38:29",
      "score": -66,
      "num_children": 1,
      "replies": [
        {
          "id": "ie3vahr",
          "text": "[removed]",
          "timestamp": "2022-06-28 21:26:57",
          "score": 12,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ie4d6ov",
      "text": "[deleted]",
      "timestamp": "2022-06-28 23:40:04",
      "score": -22,
      "num_children": 1,
      "replies": [
        {
          "id": "ie4oqyq",
          "text": ">This is why I dont consider myself to be either atheist or theist.\n\nThen what you would consider yourself to be?",
          "timestamp": "2022-06-29 01:12:11",
          "score": 12,
          "num_children": 1,
          "author": 196362,
          "replies": [
            {
              "id": "ie5198j",
              "text": "Isn't it obvious? He believes that a god does/doesn't exist simultaneously!\n\nSarcasm aside he's probably an atheist that doesn't want to identify as such because alot of people think atheists are all assholes",
              "timestamp": "2022-06-29 02:54:06",
              "score": 9,
              "num_children": 1,
              "author": 12674,
              "replies": [
                {
                  "id": "ie55s1r",
                  "text": "Or just hates being associated with any group.\n\nAlso I love how he made up an entirely new meaning for dirty, when the word has not only an established meaning, but an established secondary meaning and implication in the context he uses before he clarifies what he means by dirty.",
                  "timestamp": "2022-06-29 03:33:39",
                  "score": 4,
                  "num_children": 0,
                  "author": 196362,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ie4wfdy",
      "text": "You did him a favor, that was very kind of you",
      "timestamp": "2022-06-29 02:14:29",
      "score": -16,
      "num_children": 0,
      "author": 111672,
      "replies": []
    },
    {
      "id": "ie4r6wm",
      "text": "Yikes",
      "timestamp": "2022-06-29 01:32:11",
      "score": -15,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie4dk4n",
      "text": "Good for you. I am a generic white prochoice Christian male and am happy for you. I'd just ask you don't judge 2.3 billion people off of one dude. Good luck stranger. 💜",
      "timestamp": "2022-06-28 23:43:01",
      "score": -11,
      "num_children": 0,
      "author": 327832,
      "replies": []
    },
    {
      "id": "ie46tkl",
      "text": "[removed]",
      "timestamp": "2022-06-28 22:51:03",
      "score": -9,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie4xiq5",
      "text": "[removed]",
      "timestamp": "2022-06-29 02:23:11",
      "score": -7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie3vmkc",
      "text": "Glad to hear about this! I imagine if you would've stayed with him, Satan knows how toxic it would've been in the future for you. You don't have to put up with that bullshit.\n\nAlso, I heard you needed an atheist boyfriend now? 🥺👉👈 /j\n\nOR AM I??? DUN DUN DUN",
      "timestamp": "2022-06-28 21:29:21",
      "score": -6,
      "num_children": 0,
      "author": 89800,
      "replies": []
    },
    {
      "id": "ie4vkzz",
      "text": "[removed]",
      "timestamp": "2022-06-29 02:07:42",
      "score": -7,
      "num_children": 1,
      "replies": [
        {
          "id": "ie51bz5",
          "text": "[removed]",
          "timestamp": "2022-06-29 02:54:44",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ie4z1tg",
      "text": "[removed]",
      "timestamp": "2022-06-29 02:35:34",
      "score": -7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie6m1aj",
      "text": "You're really stupid",
      "timestamp": "2022-06-29 13:30:32",
      "score": -6,
      "num_children": 0,
      "author": 157368,
      "replies": []
    },
    {
      "id": "ie4zz2l",
      "text": "[removed]",
      "timestamp": "2022-06-29 02:43:17",
      "score": -4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie6bk5j",
      "text": "I don't think you should leave someone based on their religion. I think you have to decide if you're in a happy and healthy relationship.",
      "timestamp": "2022-06-29 11:57:58",
      "score": -6,
      "num_children": 1,
      "author": 97482,
      "replies": [
        {
          "id": "ie6bt73",
          "text": "If you have very different values, it might be difficult to maintain a healthy relationship.",
          "timestamp": "2022-06-29 12:00:32",
          "score": 2,
          "num_children": 1,
          "author": 390043,
          "replies": [
            {
              "id": "ie6c82s",
              "text": "Then you're most likely not in a happy and healthy relationship.\n\nOver the years as I've gotten older, my views changed to be on the more agnostic side. And most of my relationships, the other person was religious. But they understood I wasn't and we both respected one another on that front.",
              "timestamp": "2022-06-29 12:04:36",
              "score": -2,
              "num_children": 0,
              "author": 97482,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ie6ghjc",
      "text": "Lmao, peak reddit moment",
      "timestamp": "2022-06-29 12:44:10",
      "score": -4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie4zwz5",
      "text": "[removed]",
      "timestamp": "2022-06-29 02:42:47",
      "score": -5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie4t9s9",
      "text": "[removed]",
      "timestamp": "2022-06-29 01:49:06",
      "score": -3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie4tnow",
      "text": "[removed]",
      "timestamp": "2022-06-29 01:52:13",
      "score": -3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie6xu4n",
      "text": "Another relationship ruined by Reddit’s totally professional couples therapists 🙄",
      "timestamp": "2022-06-29 14:56:33",
      "score": -2,
      "num_children": 1,
      "author": 290705,
      "replies": [
        {
          "id": "ijhfds8",
          "text": "It's ok watch this video you'll understand the post.\n\nhttps://youtu.be/EyNFAe4c1k0",
          "timestamp": "2022-08-08 19:47:24",
          "score": 1,
          "num_children": 0,
          "author": 410369,
          "replies": []
        }
      ]
    },
    {
      "id": "ie59qns",
      "text": "His faith disallowed him to truly love you",
      "timestamp": "2022-06-29 04:10:52",
      "score": -1,
      "num_children": 0,
      "author": 51318,
      "replies": []
    },
    {
      "id": "ie5b47g",
      "text": "You made the right choice I hope he never gets over you and has an awful life for oppressing birthing people",
      "timestamp": "2022-06-29 04:24:30",
      "score": -1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie5qp6v",
      "text": "[removed]",
      "timestamp": "2022-06-29 07:27:02",
      "score": -1,
      "num_children": 1,
      "replies": [
        {
          "id": "ie686c1",
          "text": "[removed]",
          "timestamp": "2022-06-29 11:22:50",
          "score": 5,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ie93vpe",
      "text": "this is actually the worst place you could have asked that question",
      "timestamp": "2022-06-29 23:40:20",
      "score": -1,
      "num_children": 0,
      "author": 134751,
      "replies": []
    },
    {
      "id": "ie50gh2",
      "text": "[removed]",
      "timestamp": "2022-06-29 02:47:22",
      "score": 0,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "igq9cbr",
      "text": "You sir have pulled off one of the greatest trolls in reddit history, I would give you Reddit gold but fuck giving money to this website",
      "timestamp": "2022-07-19 02:50:43",
      "score": 0,
      "num_children": 0,
      "author": 61391,
      "replies": []
    },
    {
      "id": "ie4knql",
      "text": "I’m seeing some negative comments about it just being an opinion or it not having anything to do with Christianity. This “opinion” means he doesn’t think that you get to choose what to do with your own body. It’s yours, not his, and he wants to control it. And Christianity is the vast majority of the anti choice group, if not the entirety of it.",
      "timestamp": "2022-06-29 00:39:02",
      "score": -1,
      "num_children": 0,
      "author": 290075,
      "replies": []
    }
  ]
}