{
  "id": "vn033s",
  "text": "When you go so far Left that you accidentally become a conservative\n",
  "timestamp": "2022-06-28 22:44:38",
  "score": 691,
  "subreddit": "t5_2zaj2",
  "num_children": 41,
  "author": 304941,
  "replies": [
    {
      "id": "ie4icmi",
      "text": "wait, she's expecting a guy to put in the effort for something she gave away for free to others?",
      "timestamp": "2022-06-29 00:20:31",
      "score": 119,
      "num_children": 3,
      "author": 372543,
      "replies": [
        {
          "id": "ie597j9",
          "text": "She’s a pro-life conservative",
          "timestamp": "2022-06-29 04:05:43",
          "score": 39,
          "num_children": 0,
          "author": 210213,
          "replies": []
        },
        {
          "id": "ie535r3",
          "text": "Supplies don't last forever when you treat women like commodities. Simple economics.",
          "timestamp": "2022-06-29 03:10:24",
          "score": 18,
          "num_children": 2,
          "author": 354442,
          "replies": [
            {
              "id": "ie5tc5s",
              "text": "They make themselves commodities 😂 tf",
              "timestamp": "2022-06-29 08:04:03",
              "score": 5,
              "num_children": 1,
              "author": 391947,
              "replies": [
                {
                  "id": "ie69fl3",
                  "text": "Not at all. It seems these women were entirely willing to forego significant time and money in consideration for who they sleep with... Until they tried that and found out how men would shame them, shout \"look who got free sex,\" and run away like she was never even worth as much as a friend in the first place.",
                  "timestamp": "2022-06-29 11:36:15",
                  "score": 5,
                  "num_children": 1,
                  "author": 354442,
                  "replies": [
                    {
                      "id": "if9g4wd",
                      "text": "Any rational human would see this and think she’s crazy, you can do you, but why would any sensible person in a physical relationship with you want to wait for something you’ve already given away for less effort. No ones gonna buy a ride that’s had miles but pretends now that it’s brand new.",
                      "timestamp": "2022-07-07 21:38:54",
                      "score": 2,
                      "num_children": 1,
                      "author": 69429,
                      "replies": [
                        {
                          "id": "ifak6ti",
                          "text": "I mean, maybe some sensible people don't see having sex as \"giving something away\" or \"buying\" something.",
                          "timestamp": "2022-07-08 02:31:55",
                          "score": 1,
                          "num_children": 1,
                          "author": 354442,
                          "replies": [
                            {
                              "id": "ifauo7r",
                              "text": "I never said it was “buying” I’m just giving a metaphor. And technically you are giving yourself away man or woman when you have sex, remember sex creates life, so you are giving yourself away because there’s a chance you could have something you definitely aren’t prepared for or want happen to you.",
                              "timestamp": "2022-07-08 03:55:59",
                              "score": 1,
                              "num_children": 1,
                              "author": 69429,
                              "replies": [
                                {
                                  "id": "ifbii5m",
                                  "text": "That certainly sounds like a poor decision to take a risk, but not a \"giving of self for free.\" Of course sex doesn't always result in those types of consequences. Also, the science says that embryos don't even develop a gender until at least 2 week in utero, if I recall. Miscarriages happen spontaneously pretty frequently up until 12 weeks, which is also before an embryo/fetus can \"feel\" any pain if I recall. Let's not discuss \"life\" in this way, especially in light of recent supreme court rulings which very much go against the science.\n\nYou are the one who said \"buying.\" It's a very poor metaphor. If women are disappointed in how their rushed encounters turned out, it's blatantly obvious that they didn't think they were taking a risk for nothing. It is a fairly reasonable assumption to make that the main thing these women were missing was probably only TIME. Other promises may have been made obviously, if you want to consider that \"payment.\" If you don't think sex is essentially paid for, then could you clarify what you really mean here?\n\nI do think sex is a risk- man or woman. This is exactly why I have the more equal view that a man logically should be happy to wait a reasonable time frame, even if poorer decisions were made in the past. It isn't men who pay and women who sell... Except in case where that literally happens.",
                                  "timestamp": "2022-07-08 08:17:25",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 354442,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ie5718p",
              "text": "Supply doesn't have to last long. Just a few minutes",
              "timestamp": "2022-06-29 03:45:08",
              "score": 14,
              "num_children": 1,
              "author": 81877,
              "replies": [
                {
                  "id": "ie6inl6",
                  "text": "So it's OK for women to change their minds at different times with different men, right? Lol",
                  "timestamp": "2022-06-29 13:02:50",
                  "score": 0,
                  "num_children": 2,
                  "author": 354442,
                  "replies": [
                    {
                      "id": "ie6mbf4",
                      "text": "How would you stop them? Wouldn't you reserve the same right? Just go no contact with women who can't make up their minds for half an hour. Indicative of much greater problems...",
                      "timestamp": "2022-06-29 13:32:48",
                      "score": 3,
                      "num_children": 1,
                      "author": 81877,
                      "replies": [
                        {
                          "id": "ie75zqu",
                          "text": "Yeah. Tell it to the person above me in comments who was bitching about it instead of just moving on.\n\nNo woman changes her mind THAT often, but women do learn from things that don't work out for them the first few times. Women also learn from what we see happen to other women, if we are fortunate enough to have the necessary dialogue and guidance. It's quite healthy for people to learn from what doesn't work for us.\n\nAnd you'll never catch me saying that men must date or sleep with anyone. They really, really don't have to. I just don't want to hear complaints. They make their decisions, they live with them, and they're not so perfect themselves. If I was left out of it and my nieces didn't have to read about negative stereotypes or falsehoods on the internet, I'd be happy.\n\nI'm well aware I don't agree with people in this sub, and they won't agree with me. I saw like one crosspost from a comment, and now this pops up on my feed. Maybe I can figure out how to change it.",
                          "timestamp": "2022-06-29 15:50:45",
                          "score": 1,
                          "num_children": 1,
                          "author": 354442,
                          "replies": [
                            {
                              "id": "ie7bxtc",
                              "text": "I'm not so sure what the disagreement would be about.....",
                              "timestamp": "2022-06-29 16:29:26",
                              "score": 2,
                              "num_children": 1,
                              "author": 81877,
                              "replies": [
                                {
                                  "id": "ie7c70l",
                                  "text": "For starters, we disagree over whether women change their minds every half hour or not if they ever stop having casual sex.",
                                  "timestamp": "2022-06-29 16:31:05",
                                  "score": 0,
                                  "num_children": 0,
                                  "author": 354442,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ie78zu3",
                      "text": "No one said it's okay.",
                      "timestamp": "2022-06-29 16:10:29",
                      "score": 0,
                      "num_children": 1,
                      "author": 227146,
                      "replies": [
                        {
                          "id": "ie7apkq",
                          "text": "They said supply doesn't have to last... Naturally, making the shortage or fluctuation of supply... OK...",
                          "timestamp": "2022-06-29 16:21:33",
                          "score": 2,
                          "num_children": 1,
                          "author": 354442,
                          "replies": [
                            {
                              "id": "ieamyrv",
                              "text": "I didn't know that you actually think women should be treated like commodities. I assumed that was ironic.",
                              "timestamp": "2022-06-30 08:34:30",
                              "score": 1,
                              "num_children": 1,
                              "author": 227146,
                              "replies": [
                                {
                                  "id": "ieb9xd8",
                                  "text": "I'm not the one that said supply doesn't have to last. I was clarifying the other person's argument, like, with a question mark and everything.",
                                  "timestamp": "2022-06-30 12:57:44",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 354442,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ie78enb",
          "text": "She won't give it away so freely now. If she does she'll at least pick a good man.",
          "timestamp": "2022-06-29 16:06:38",
          "score": 0,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ie55lc2",
      "text": "Ok... Next.",
      "timestamp": "2022-06-29 03:31:59",
      "score": 30,
      "num_children": 1,
      "author": 29780,
      "replies": [
        {
          "id": "ie5whsl",
          "text": "*Thank you, next!* - Ariana Grande",
          "timestamp": "2022-06-29 08:49:05",
          "score": 7,
          "num_children": 0,
          "author": 287753,
          "replies": []
        }
      ]
    },
    {
      "id": "ie47x33",
      "text": "Even though Feminists will no doubt fail to see the irony in asking men to commit to them before sex as a value self-respecting women have had since time immemorial, it's amusing to watch them slowly work it out in their own particularly cunty way.",
      "timestamp": "2022-06-28 22:59:19",
      "score": 63,
      "num_children": 4,
      "author": 304941,
      "replies": [
        {
          "id": "ie6i5wu",
          "text": "Also \"denying sex\" means she still considers sex as a currency here, as not something you do together but rather something \"she gives\"",
          "timestamp": "2022-06-29 12:58:38",
          "score": 11,
          "num_children": 0,
          "author": 31701,
          "replies": []
        },
        {
          "id": "ie4dljm",
          "text": "Um... this is a conservative.",
          "timestamp": "2022-06-28 23:43:20",
          "score": 14,
          "num_children": 0,
          "author": 280062,
          "replies": []
        },
        {
          "id": "ie4hby5",
          "text": "Wait a minute. . . This girl is a thorough bred conservative, check her Twitter bio.",
          "timestamp": "2022-06-29 00:12:28",
          "score": 6,
          "num_children": 1,
          "author": 179179,
          "replies": [
            {
              "id": "ie4hk8s",
              "text": "Right, but she's using the statement as satire for the \"feminist\" reaction, isn't she?",
              "timestamp": "2022-06-29 00:14:18",
              "score": 2,
              "num_children": 1,
              "replies": [
                {
                  "id": "ie4huja",
                  "text": "No she’s not. If you check her page that’s just literally her view. She’s tradcon and doesn’t believe in sex before marriage. At best you can say she’s poking fun at feminists who say being sexually liberal is empowering as she’s saying she finds empowerment in the opposite.",
                  "timestamp": "2022-06-29 00:16:34",
                  "score": 11,
                  "num_children": 1,
                  "author": 179179,
                  "replies": [
                    {
                      "id": "ie4ll6v",
                      "text": "And feminism supports both forms of empowerment.",
                      "timestamp": "2022-06-29 00:46:29",
                      "score": 1,
                      "num_children": 2,
                      "author": 280062,
                      "replies": [
                        {
                          "id": "ie59xnz",
                          "text": "Feminism literally created the modern no-responsibility hookup culture, so I find it more than a little suspect to say that it supports the opposite.",
                          "timestamp": "2022-06-29 04:12:47",
                          "score": 5,
                          "num_children": 1,
                          "author": 304941,
                          "replies": [
                            {
                              "id": "ie6i77u",
                              "text": "Oh yeah. I could see how that could be challenging for some. A lot of women with freewill don't want to stay at home and raise children. Feminism is about women getting the right to choose not force women to be loose. Hookup culture isn't so bad that women should be stripped of rights.",
                              "timestamp": "2022-06-29 12:58:57",
                              "score": 2,
                              "num_children": 2,
                              "author": 280062,
                              "replies": [
                                {
                                  "id": "ie7dw1p",
                                  "text": ">Feminism is about women getting the right to choose not force women to be loose.\n\nExcept that Feminism is not about giving women choice.\n\nYou can literally use the Reddit search bar a few inches above this post and type \"Choice Feminism\" into the field. There you will find hundreds of threads all over Reddit, including [this one posted just 16 hours ago](https://www.reddit.com/r/fourthwavewomen/comments/vn12r4/because_modern_liberal_choice_feminism_is_still/), shitting all over the idea of \"choice Feminism\" or Feminism designed to simply give women more choices. The entire r/fourthwavewomen subreddit is practically overflowing with these kinds of discussions.\n\nAccording to the Radfems who write and engage in these threads, women in our culture do not have free choice. They have internalized misogyny and have been brainwashed by the Patriarchy, therefore they do not have the agency to make proper choices for their lives, especially as it relates to sex work.\n\nThey view liberal/choice Feminists like you as the enemy, promoting a narrative about Feminism that is not only wrong, but dangerous to women.\n\nYou seem like a nice person and I appreciate your contribution to this discussion, but you seem to have a very narrow and rosy-eyed view of what Feminism actually is.",
                                  "timestamp": "2022-06-29 16:42:00",
                                  "score": 3,
                                  "num_children": 1,
                                  "author": 304941,
                                  "replies": [
                                    {
                                      "id": "ie7ojl8",
                                      "text": "I went down a rabbit hole that I will need to do more research on. It looks like there are different types of feminism. Liberal, Marxist, and Radical feminism.\n\n\nWhat you are calling feminism is in fact feminisin. But it doesn't represent all feminisin. I assure you. \n\n (I will say sex work is work. ((Surely we can all agree it can is bad for the forced and coerced.)) It would take a LOT more than Reddit to change my mind).",
                                      "timestamp": "2022-06-29 17:50:53",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 280062,
                                      "replies": [
                                        {
                                          "id": "ie7pwis",
                                          "text": "Radical Feminism and Liberal Feminism are the main two but they are diametrically opposed.\n\nLiberal Feminists are also mainstream and believe in sex positivity, are pro sex-work, and pro trans rights.\n\nRadical Feminists typically think of sex work as an exploitation of women. They think of the porn industry as a objectifying industry which takes advantage of women and turns them into sex objects, same with prostitution and any kind of sex work. They see trans rights as another way that men and the patriarchy are imposing their will on women and invading their spaces.\n\nThere are tons of radical feminist subreddits all over this site, and it's the fastest growing form of Feminism in the world. They see the harm mainstream Feminism has done to women and they're horrified by it.\n\nOf course, Radical Feminism has problems of its own. It still blames men for everything, it's still based on lies and distorted statistics. But worst of all, in order to help women it must first claim that women's choices are a product of brainwashing and cultural indoctrination which keeps them subservient to men.\n\nPoint is, Feminism isn't a monolith, but it certainly is not just about allowing women to choose.",
                                          "timestamp": "2022-06-29 17:59:44",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 304941,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "ie6r10y",
                                  "text": "Then why do so many feminists shame traditionally valued women?",
                                  "timestamp": "2022-06-29 14:08:34",
                                  "score": 1,
                                  "num_children": 2,
                                  "author": 82106,
                                  "replies": [
                                    {
                                      "id": "ie6taxx",
                                      "text": "I think women encourage other women to be empowered and some women feel shame in return. \n\nLike how people pressure friends to drink if they don't. Or when young men pressure young women to have sex. \n\nPerson A wants Person B to have fun with them. But Person B does not find it fun. But Person A was not trying to be malicious. \n\nIt's ultimately disrespectful and people *should* mature out of it. \n\nI think the world is changing a lot and people will be more respectful of the differences as time goes on.",
                                      "timestamp": "2022-06-29 14:24:56",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 280062,
                                      "replies": []
                                    },
                                    {
                                      "id": "ie74joa",
                                      "text": "Because traditional women shame them. It’s a catty back and forth. \n\nTradcons:”You lot are godless whores, ruining it for the rest of us”\nFeminists:”well you lot are slaves to your husbands trying to force women back in time”.\n\nIt’s the age old issue of people thinking their way is the right way and not being able to mind their business when they should.",
                                      "timestamp": "2022-06-29 15:41:15",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 179179,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ie5768g",
                          "text": "Different factions, yes. Definitely not across the board",
                          "timestamp": "2022-06-29 03:46:26",
                          "score": 2,
                          "num_children": 0,
                          "author": 81877,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ie94nei",
          "text": "Yeah, they'll have to learn to have some value beyond their looks and body to SECURE that commitment now. No more breezing in and out of relationships as a matter of personal convenience. \n\n\nPersonality. Skills. Something.",
          "timestamp": "2022-06-29 23:46:14",
          "score": 1,
          "num_children": 0,
          "author": 1716,
          "replies": []
        }
      ]
    },
    {
      "id": "ie4dk23",
      "text": "$10 says she despises MGTOW",
      "timestamp": "2022-06-28 23:43:00",
      "score": 15,
      "num_children": 1,
      "author": 211143,
      "replies": [
        {
          "id": "ie4he6p",
          "text": "She’s a conservative. It’s in her bio. I doubt she even knows what mgtow is",
          "timestamp": "2022-06-29 00:12:57",
          "score": 10,
          "num_children": 0,
          "author": 179179,
          "replies": []
        }
      ]
    },
    {
      "id": "ie484za",
      "text": "They're *now* denying sex to men who aren't willing to have sex with them lol",
      "timestamp": "2022-06-28 23:00:59",
      "score": 21,
      "num_children": 1,
      "author": 13527,
      "replies": [
        {
          "id": "ie49pj7",
          "text": "It very much has the, \"You can't fire me, I quit!\" energy.",
          "timestamp": "2022-06-28 23:13:05",
          "score": 17,
          "num_children": 0,
          "author": 304941,
          "replies": []
        }
      ]
    },
    {
      "id": "ie48per",
      "text": "I know her, she's not a lefty.",
      "timestamp": "2022-06-28 23:05:17",
      "score": 7,
      "num_children": 0,
      "author": 97982,
      "replies": []
    },
    {
      "id": "ie5ah8t",
      "text": "Is she still going to hook up with randoms whenever her exhausted husband is on business travel making money for her to spend on her [fancy fucking house?](https://hgtvhome.sndimg.com/content/dam/images/hgtv/fullset/2013/9/9/0/CI-karen-kettler-old-world-kitchen-lead-image_s4x3.jpg.rend.hgtvcom.1280.960.suffix/1400953130464.jpeg)   Then divorce him in a few years, keep the house, and send him to [his sad small apartment](https://preview.redd.it/ht1ygh32nkmz.jpg?width=1024&auto=webp&s=78b5605f1b1e244db2befb8fa79f074048e70f5b) to work until 70+ earning money for her to spend randomly??   \n\nI'm gonna need to know those details of the contract before I sign....",
      "timestamp": "2022-06-29 04:18:11",
      "score": 5,
      "num_children": 3,
      "author": 73494,
      "replies": [
        {
          "id": "ie5j3q1",
          "text": "Yes to all of the above, and when she cheats... ittl be your fault because \"you aren't there enough for her\" meanwhile you're working 50 hours a week making the life that you both wanted. Women have a funny way of shifting the blame for things they have done.",
          "timestamp": "2022-06-29 05:50:21",
          "score": 6,
          "num_children": 0,
          "author": 105843,
          "replies": []
        },
        {
          "id": "ie6kky5",
          "text": "Nonsense she'll find one guy, probably either his boss or someone he considers a friend, and try to monkey branch up. If it works, then she'll divorce him and take everything he has.",
          "timestamp": "2022-06-29 13:19:04",
          "score": 2,
          "num_children": 0,
          "author": 258630,
          "replies": []
        },
        {
          "id": "ie6d32b",
          "text": "Lol why did you include two random pictures in that?",
          "timestamp": "2022-06-29 12:13:02",
          "score": 1,
          "num_children": 0,
          "author": 73754,
          "replies": []
        }
      ]
    },
    {
      "id": "ie4l4i0",
      "text": "Thats a conservative, not a leftist. \n\nI'm guessing you assumed cause of the \"libby\" part of her name.",
      "timestamp": "2022-06-29 00:42:49",
      "score": 10,
      "num_children": 0,
      "author": 390339,
      "replies": []
    },
    {
      "id": "ie4uok7",
      "text": "This is so goddamn funny.  \n\n\nI didnt know the political spectrum was a circle. LOL",
      "timestamp": "2022-06-29 02:00:27",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "ie94uay",
          "text": "Certainly a circle jerk most days.",
          "timestamp": "2022-06-29 23:47:44",
          "score": 2,
          "num_children": 1,
          "author": 1716,
          "replies": [
            {
              "id": "ie99sl6",
              "text": "Lmao. Trueee",
              "timestamp": "2022-06-30 00:25:47",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ie5691l",
      "text": "They somehow managed to go full circle.  Someone finally has morals and wants to have an actual family structure!\n\nI've also seen it with liberal women wanting to uphold the 2A regarding rapists attacking them (why they didn't do this earlier, I have no idea).",
      "timestamp": "2022-06-29 03:37:55",
      "score": 2,
      "num_children": 0,
      "author": 391281,
      "replies": []
    },
    {
      "id": "ie6nbyi",
      "text": "The grand irony is that most guys are unaffected by this, while most girls now suddenly have to exercise restraint.",
      "timestamp": "2022-06-29 13:40:46",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie9sneh",
      "text": "There is no difference between Fringe Left and Fringe Right. https://youtu.be/WiqxX7ZC2xk",
      "timestamp": "2022-06-30 02:55:43",
      "score": 2,
      "num_children": 0,
      "author": 111363,
      "replies": []
    },
    {
      "id": "ie47bj1",
      "text": "I seriously hope this doesn't become a norm, that shit is lame. Tbh I think it'll just cause more dudes to lie and finesse to get in that box 💀💀💀",
      "timestamp": "2022-06-28 22:54:48",
      "score": 6,
      "num_children": 3,
      "author": 155909,
      "replies": [
        {
          "id": "ie48mng",
          "text": "Yeah, that's what I am worried about for some women, lol. Then again, if they're smart enough, have common sense and a good judge of character - then they'll know what sort of dudes to look out for, not rushing into anything and opening their legs straight away.",
          "timestamp": "2022-06-28 23:04:42",
          "score": 7,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ie4gg90",
          "text": "You can’t lie and finesse to a judge. They’ll know if you didn’t sign the marriage papers lol. This could be a good thing though. Less sexually reckless people creating traumatized kids.",
          "timestamp": "2022-06-29 00:05:33",
          "score": 4,
          "num_children": 1,
          "author": 179179,
          "replies": [
            {
              "id": "ie4iwuh",
              "text": "You have a point, but the whole waiting until marriage thing isn't ideal, especially for those that don't wanna get married in the first place, I don't wanna have to tell women that I want to marry and have kids with them in order to get laid, that's stupid to me.",
              "timestamp": "2022-06-29 00:25:00",
              "score": 1,
              "num_children": 1,
              "author": 155909,
              "replies": [
                {
                  "id": "ie4k29g",
                  "text": "To each their own. You can always say no if you’re not about that vibe but for women that know they want kids this is a better bet because it’s more insurance that the guy you pick actually wants to be a present father.",
                  "timestamp": "2022-06-29 00:34:16",
                  "score": 3,
                  "num_children": 1,
                  "author": 179179,
                  "replies": [
                    {
                      "id": "ie5ls8t",
                      "text": ">for women that know they want kids this is a better bet because it’s more insurance that the guy you pick actually wants to be a present father.\n\nThat's arguable. Sexual repression until marriage spells out I S S U E S to me bro. Does she want the man she marries to be a virgin? Or would she find that repulsive if he was? Does she want the man she's going to spend the \"rest of her life with\" to have ZERO sexual experience? Do you genuinely think that's a good thing? Granted it's their choice - but I'm calling it out as being a bad choice.",
                      "timestamp": "2022-06-29 06:22:40",
                      "score": 2,
                      "num_children": 1,
                      "author": 105843,
                      "replies": [
                        {
                          "id": "ie5whtr",
                          "text": "I can’t speak for all but generally I’ve noticed chaste women prefer chaste men. If it’s an issue for you just don’t date them. Many of the men here don’t seem like they want marriage anyway so what tradcon women do should be if no consequence, as a relationship with them wouldn’t work anyway.\n\nFurthermore it’s about duty, they’re selecting for men who view marriage as something for more than just pleasure. They want men who want to honor a family and who desire to have and be just as invested in children as they are. That’s a good strategy for this. Other methods you risk lower levels of paternal investment.",
                          "timestamp": "2022-06-29 08:49:06",
                          "score": 1,
                          "num_children": 1,
                          "author": 179179,
                          "replies": [
                            {
                              "id": "ie5ztsx",
                              "text": ">they’re selecting for men who view marriage as something for more than just pleasure. They want men who want to honor a family and who desire to have and be just as invested in children as they are. T\n\nHow is being a virgin going into a marriage going to produce a long lasting stable relationship? That's wishful thinking if I've ever seen it. Nobody views marriage as a \"oh I can have sex now\" thing, EXCEPT... except.. The people who are virgins going into their marriage. It's the opposite of what you think. Sex isn't that big of a deal in western culture, and if it's such a big deal to some people, why wait until you're married to do it? Wouldn't men try to marry just to lose their V card so they can divorce? Is that not worse? Devalues the value of marriage as a whole? And would leave you questioning every man's intentions who seems like he ACTUALLY WANTS to marry you because he \"loves\" you.",
                              "timestamp": "2022-06-29 09:36:26",
                              "score": 2,
                              "num_children": 1,
                              "author": 105843,
                              "replies": [
                                {
                                  "id": "ie75p3d",
                                  "text": "It’s because you know the guy has the mindset of honoring his family. If you wait until marriage you don’t run the risk of having out of wedlock kids because you can’t get pregnant if you don’t have sex. \n\nSex is a big deal for those who don’t want to get pregnant and for those who want a partner that values them and wants to start a family with them. If you don’t care about those things, have at it. If you do it’s best to wait and make sure the man you’re sleeping with is a good person and will commit to you. \n\n\nYour assumptions are based on the premise that all or the majority of people would subscribe to waiting until marriage. Everyone has different views and different values, some people will want to wait some people won’t. Men who don’t want to wait will just seek out women who also don’t want to wait so it’s a win win for almost everyone.",
                                  "timestamp": "2022-06-29 15:48:49",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 179179,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ie95typ",
          "text": "Rofl and we already saw the aftermath of \"player culture\" not all that long ago.",
          "timestamp": "2022-06-29 23:55:18",
          "score": 1,
          "num_children": 0,
          "author": 1716,
          "replies": []
        }
      ]
    },
    {
      "id": "ie486yw",
      "text": "Not fucking someone because they don’t want the responsibility of having kids makes you stronger, emotionally of course. (What kind of logic-I simply don’t understand.)",
      "timestamp": "2022-06-28 23:01:23",
      "score": 5,
      "num_children": 1,
      "replies": [
        {
          "id": "ie5tdkn",
          "text": "A person with no physical strength or actual intelligence will go on and on about \"emotional strength\" and \"emotional intelligence\" imo it's their reaction to being women. They don't have strength or abilities, so what do they have? Their emotions? Empathy? I mean men have those things too but by all means they can \"claim\" emotional intelligence and claim being empathic people if they want to. Doesn't make it true though. All I see are manipulators",
          "timestamp": "2022-06-29 08:04:36",
          "score": 2,
          "num_children": 0,
          "author": 105843,
          "replies": []
        }
      ]
    },
    {
      "id": "ie4xhig",
      "text": "Not my kids, not my problem.",
      "timestamp": "2022-06-29 02:22:55",
      "score": 2,
      "num_children": 0,
      "author": 343158,
      "replies": []
    },
    {
      "id": "ie5c52x",
      "text": "I'm tired of everyone's bullshit, I'd hoped I could escape feminisms sexist Idiocy here but nope. \\~99% of people are mentally handicapped, self centered assholes regardless of age, race or gender.",
      "timestamp": "2022-06-29 04:34:42",
      "score": 2,
      "num_children": 0,
      "author": 48705,
      "replies": []
    },
    {
      "id": "ie4e91o",
      "text": "They've come full circle!!",
      "timestamp": "2022-06-28 23:48:27",
      "score": 1,
      "num_children": 0,
      "author": 218157,
      "replies": []
    },
    {
      "id": "ie4o5b8",
      "text": "Ok, have fun being alone then.",
      "timestamp": "2022-06-29 01:07:02",
      "score": 2,
      "num_children": 0,
      "author": 312363,
      "replies": []
    },
    {
      "id": "ie4hfhd",
      "text": "lol, damn...",
      "timestamp": "2022-06-29 00:13:14",
      "score": 0,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie4llne",
      "text": "Horseshoe theory strikes once again.",
      "timestamp": "2022-06-29 00:46:35",
      "score": 0,
      "num_children": 0,
      "author": 206575,
      "replies": []
    },
    {
      "id": "ie55too",
      "text": "Its funny that you dont know a liberal from a leftist",
      "timestamp": "2022-06-29 03:34:03",
      "score": 0,
      "num_children": 1,
      "author": 146880,
      "replies": [
        {
          "id": "ie57be5",
          "text": "Who cares? Shes quacking like a duck so....",
          "timestamp": "2022-06-29 03:47:47",
          "score": 1,
          "num_children": 1,
          "author": 81877,
          "replies": [
            {
              "id": "ie59b01",
              "text": "She’s a conservative and pro-life , go to her Twitter",
              "timestamp": "2022-06-29 04:06:37",
              "score": 3,
              "num_children": 1,
              "author": 210213,
              "replies": [
                {
                  "id": "ie59cxt",
                  "text": "Who the fuck cares?",
                  "timestamp": "2022-06-29 04:07:09",
                  "score": 0,
                  "num_children": 1,
                  "author": 81877,
                  "replies": [
                    {
                      "id": "ie59etd",
                      "text": "You said if it quacks like a duck, so apparently you do in some capacity",
                      "timestamp": "2022-06-29 04:07:39",
                      "score": 2,
                      "num_children": 1,
                      "author": 210213,
                      "replies": [
                        {
                          "id": "ie59gsd",
                          "text": "Not about her politics thats for sure.",
                          "timestamp": "2022-06-29 04:08:13",
                          "score": 0,
                          "num_children": 0,
                          "author": 81877,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ie501dv",
      "text": "one actually had me dying",
      "timestamp": "2022-06-29 02:43:50",
      "score": 1,
      "num_children": 0,
      "author": 404983,
      "replies": []
    },
    {
      "id": "ie5n4in",
      "text": "Not much a gold digger...I messed around with  deadbeats to have my kids, but no sex to the walking wallet that will provide for me and my kids. \n\nIt does not sounds good not matter how you spin it\n\nHow about keeping your legs closed *before* having kids?",
      "timestamp": "2022-06-29 06:39:36",
      "score": 1,
      "num_children": 0,
      "author": 349781,
      "replies": []
    },
    {
      "id": "ie5qx2c",
      "text": "It's like a circle she went around to the other side",
      "timestamp": "2022-06-29 07:30:06",
      "score": 1,
      "num_children": 0,
      "author": 76479,
      "replies": []
    },
    {
      "id": "ie5tds7",
      "text": "She is right you know, why are you booing her",
      "timestamp": "2022-06-29 08:04:41",
      "score": 1,
      "num_children": 1,
      "author": 182949,
      "replies": [
        {
          "id": "ie60k7n",
          "text": "OP assumed she's for \"values\" that are usually associated with being left like \"free love\" or abolishing marriage as most feminists are but at the same time supports abstinence until marriage and thus contradicts herself",
          "timestamp": "2022-06-29 09:46:58",
          "score": 1,
          "num_children": 1,
          "author": 13527,
          "replies": [
            {
              "id": "ie6pv5g",
              "text": "She could be a good girl though, there's no reason to hate on all women, there might be good ones :P",
              "timestamp": "2022-06-29 14:00:02",
              "score": 1,
              "num_children": 0,
              "author": 182949,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ie5vc6i",
      "text": "Lmaooooooo wow",
      "timestamp": "2022-06-29 08:32:30",
      "score": 1,
      "num_children": 0,
      "author": 31753,
      "replies": []
    },
    {
      "id": "ie60ly5",
      "text": "Great, so finally you need men to feel empowered",
      "timestamp": "2022-06-29 09:47:41",
      "score": 1,
      "num_children": 0,
      "author": 391668,
      "replies": []
    },
    {
      "id": "ie6309f",
      "text": "Looking at that photo, I’m guessing she got ran through her whole adult life and now that the wall is coming up, she all of a sudden expects to be treated a certain way.\nAs if she’s owed that and we’re all violating her rights by not settling down and marrying her.\n\nAnd of course since she can’t get it, her feminist advice is to tell other women to act the same way until she gets what she wants/ruin things for other women since she can’t get it.\n\nI’m not sure the word “typical” really quite does this justice.",
      "timestamp": "2022-06-29 10:20:31",
      "score": 1,
      "num_children": 1,
      "author": 104276,
      "replies": [
        {
          "id": "ie6deju",
          "text": "God what a fucking idiot lmao.\n\nShes a tradcon wife, not a feminist 🤦",
          "timestamp": "2022-06-29 12:16:08",
          "score": 1,
          "num_children": 1,
          "author": 73754,
          "replies": [
            {
              "id": "ie8lzqk",
              "text": "Either way, for a feminist this fits perfectly.\nSee it all the time.",
              "timestamp": "2022-06-29 21:32:08",
              "score": 1,
              "num_children": 1,
              "author": 104276,
              "replies": [
                {
                  "id": "ie8r96t",
                  "text": "LOL no it doesn't, and no you don't.",
                  "timestamp": "2022-06-29 22:08:10",
                  "score": 1,
                  "num_children": 2,
                  "author": 73754,
                  "replies": [
                    {
                      "id": "ie8u4jg",
                      "text": "Bitch, yes I do.",
                      "timestamp": "2022-06-29 22:28:34",
                      "score": 1,
                      "num_children": 0,
                      "author": 104276,
                      "replies": []
                    },
                    {
                      "id": "ie8u66n",
                      "text": "And yes it does, Bitch.",
                      "timestamp": "2022-06-29 22:28:53",
                      "score": 1,
                      "num_children": 0,
                      "author": 104276,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ie64jal",
      "text": "\"YOUR kids\". Not \"THEIR kids\". That's the crux of it. Ride the CC for all the years you want. Just don't think I'm obligated to support the consequences, you appalling woman-child.",
      "timestamp": "2022-06-29 10:40:04",
      "score": 1,
      "num_children": 0,
      "author": 341422,
      "replies": []
    },
    {
      "id": "ie6arze",
      "text": "My wife and I watch a good amount of food network and there are many times recently where a femenist says something very close to \"Im going to show these boys that women belong in the kitchen\" I swear eventually they are going to land on 1950's housewife if they keep going.",
      "timestamp": "2022-06-29 11:50:05",
      "score": 1,
      "num_children": 0,
      "author": 106790,
      "replies": []
    },
    {
      "id": "ie6enun",
      "text": "I don’t think this is the flex she thinks it is… No one wants sex topped with marriage with a side of child support, LMAO!",
      "timestamp": "2022-06-29 12:27:46",
      "score": 1,
      "num_children": 0,
      "author": 69391,
      "replies": []
    },
    {
      "id": "ie6xpfc",
      "text": "Um... Abby is a friend of mine one of the most conservative Pro-life supporters I know. She was literally on the Blaze about a month or 2 ago for an interview. Hard to go more conservative than being on BlazeTV. Also is in Tennessee right now to go to Daily Wire Backstage Live... How in the world would you think she's conservative?  \nAlso Libby is her last name, not her political leaning.",
      "timestamp": "2022-06-29 14:55:40",
      "score": 1,
      "num_children": 0,
      "author": 146436,
      "replies": []
    },
    {
      "id": "ie78ah9",
      "text": "Lol they came full circle",
      "timestamp": "2022-06-29 16:05:53",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie79c0g",
      "text": "This is funny because she IS a conservative. Not all women are insane leftist; myself included.",
      "timestamp": "2022-06-29 16:12:40",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie79sjc",
      "text": "You got this so, so wrong…\n\nShe’s the polar opposite of left-leaning",
      "timestamp": "2022-06-29 16:15:38",
      "score": 1,
      "num_children": 0,
      "author": 70664,
      "replies": []
    },
    {
      "id": "ie7pnjj",
      "text": "Next, she’ll say homeschooling is the only way to save your kids from government education.",
      "timestamp": "2022-06-29 17:58:06",
      "score": 1,
      "num_children": 0,
      "author": 343297,
      "replies": []
    },
    {
      "id": "ie7r6wz",
      "text": "Lol  Shes saying ''denying sex to men D:< '' , others have called it ''waiting until marriage'' .",
      "timestamp": "2022-06-29 18:08:13",
      "score": 1,
      "num_children": 0,
      "author": 245363,
      "replies": []
    },
    {
      "id": "ie84d6n",
      "text": "Isn't feminist just the ability to choose? I've met tons if feminists who are married with kids.",
      "timestamp": "2022-06-29 19:35:51",
      "score": 1,
      "num_children": 1,
      "author": 112949,
      "replies": [
        {
          "id": "ie85kqu",
          "text": "In short, no. You can read more about that in this very discussion [here](https://www.reddit.com/r/antifeminists/comments/vn033s/when_you_go_so_far_left_that_you_accidentally/ie7dw1p/?utm_source=reddit&utm_medium=web2x&context=3).\n\nBasically, type \"Choice Feminism\" in the Reddit search bar a few inches about this post and you'll see threads all over this site, by Feminists, shitting on the kind of Feminism that purports to be only about giving women the right to choose.\n\nAccording to Radical Feminism, no choice happens in a vacuum, and if women are indoctrinated and brainwashed by a system of the Patriarchy, they aren't really free to choose at all. There are right and wrong choices.",
          "timestamp": "2022-06-29 19:43:48",
          "score": 1,
          "num_children": 0,
          "author": 304941,
          "replies": []
        }
      ]
    },
    {
      "id": "ie8fo7x",
      "text": "The Spider-Man meme where Spider-man points at Spider-man, except it’s liberal pettiness and conservative women with standards doing the pointing",
      "timestamp": "2022-06-29 20:49:46",
      "score": 1,
      "num_children": 0,
      "author": 128777,
      "replies": []
    },
    {
      "id": "ie8q641",
      "text": "wtf... that's actually the opposite of what a feminist would say?",
      "timestamp": "2022-06-29 22:00:36",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ie4hrxv",
      "text": "The crucial difference here is that women now have the freedom to choose this personally, instead of having it forced on them by culture.",
      "timestamp": "2022-06-29 00:15:59",
      "score": -2,
      "num_children": 1,
      "author": 95477,
      "replies": [
        {
          "id": "ie5k8m5",
          "text": ">instead of having it forced on them by culture.\n\nYou mean like how men are forced to work hard for their entire lives and are forced and expected to support and pay for women in situations that it should be 50/50? How about countries that have mandatory army service for young men? How about how men are forced to focus on their career growing up/as adults aswell, because the main thing women care about is a man's career, how much money he makes e.g. \"How well can he take care of me and our eventual family we make\" talking about \"things that are forced upon a person\" men get everything forced upon them, and then they get blamed for it. Fuck this world. Where are the sugar mommies? Do they exist or is that wishful thinking? Why don't women support men? Why is it men who are expected to support women? Why is everything so broken? Women think men who can't \"take the lead\" (in everything) are weak and not fit to be with etc, so passive/non aggressive men end up alone which is the literal reason so many women are up in arms talking about the nature of masculinity and men etc. Thing is these women wont lift a fucking finger or change a single thing to make a change. You think she wants to live with some guy who's making 70k a year when there's another guy messaging her who makes 140k? No shit she's gonna money branch to the 140k guy and pretend she loves him and they're made for each other etc etc you know how this shit goes. I'm done. Men have no choice, it's either shut out everyone and work on your career for 10/20 years, or you get shit on by women for your entire life, until you fucking die. What's equality?",
          "timestamp": "2022-06-29 06:03:55",
          "score": 2,
          "num_children": 2,
          "author": 105843,
          "replies": [
            {
              "id": "ie5nrgq",
              "text": "Not implying any slight or minimizing the issues  that men have, which are also unfair and largely invisible. Karen Straughan has done a series of masterful video essays on the issues men face and why society is inclined to ignore their needs unless they are rich, famous, or in some way dominant.  As you say, men who are not in some way prominent are dismissed as cannon fodder, red shirts, clone troopers, to be ignored and used without mercy or compassion.  And now, after having alienated men for several generations and blamed them for all of society's ills, women could use some allies; but most progressive men are useless in a fight, and men will fight for their families, they won't fight for themselves.  It's a very good time to be single and to have good friends one can count on.  Not a good time to be in a relationship with an American woman, for the most part.",
              "timestamp": "2022-06-29 06:47:54",
              "score": 2,
              "num_children": 1,
              "author": 95477,
              "replies": [
                {
                  "id": "ie5o704",
                  "text": "Yeah sorry I was ranting a bit there, I'm on board",
                  "timestamp": "2022-06-29 06:53:28",
                  "score": 2,
                  "num_children": 0,
                  "author": 105843,
                  "replies": []
                }
              ]
            },
            {
              "id": "ie6emqx",
              "text": "*Hears a random fact about women*\n\n*Proceeds to go on a really akward and unasked for rant about the struggles of men*",
              "timestamp": "2022-06-29 12:27:29",
              "score": 0,
              "num_children": 1,
              "author": 73754,
              "replies": [
                {
                  "id": "ie6oui0",
                  "text": "*Sees rant in a related place* *Proceeds to critique said rant, except instead of critiquing you question why rant at all* Should I be sorry for speaking my mind? This sub kind of is about the struggles of men in the modern society due to, you know.. feminists, woke agenda, etc. If you dislike what I said, argue against it, prove me wrong? Otherwise I don't know what you're trying to accomplish by just undermining me like that, that achieves nothing.",
                  "timestamp": "2022-06-29 13:52:19",
                  "score": 1,
                  "num_children": 1,
                  "author": 105843,
                  "replies": [
                    {
                      "id": "ie6qy5g",
                      "text": "Yeah... not surprised you are incapable of understanding my comment.\n\nMy point was to make fun of you for going on a whataboutmen rant, in response to someone who just said a single sentence about a problem women have faced. They didn't even mention men lmao. \n\nAnd the end was just super cringey, and /r/persecutionfetish material.",
                      "timestamp": "2022-06-29 14:07:59",
                      "score": 1,
                      "num_children": 2,
                      "author": 73754,
                      "replies": [
                        {
                          "id": "ie6t8rb",
                          "text": ">My point was to make fun of you\n\nSure, my question is *why* is that your point. I find it a little sad how you talk down about being passionate about men's problems in modern day society. Am I not allowed? Is there a rule that I'm breaking, by all means let me know. I don't know what persecutionfetish is but I'll have a look.",
                          "timestamp": "2022-06-29 14:24:31",
                          "score": 1,
                          "num_children": 1,
                          "author": 105843,
                          "replies": [
                            {
                              "id": "ie6vq73",
                              "text": "Yeah that's your persecution fetish for ya.\n\nNobody said you weren't allowed to be passionate about men's problems lmao. No one said anything about rules either. \n\nAgain I was just pointing out how funny it was that the mere mention of a problem women have faced, made you go on a rant about how awful it is to be a man. \n\nThis is not complicated.",
                              "timestamp": "2022-06-29 14:42:04",
                              "score": 1,
                              "num_children": 1,
                              "author": 73754,
                              "replies": [
                                {
                                  "id": "ie77gfq",
                                  "text": "Hey man I'm allowed to rant if I want to rant. Don't read so much into it, it's therapeutic.",
                                  "timestamp": "2022-06-29 16:00:23",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 105843,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ie6tpdf",
                          "text": "Took 60 seconds of reading through comments and it's easy to tell, they're far left, and probably mostly women, the narrative is their narrative, the one where \"cis white males\" are some kind of public enemy. Surprised you posted such a far left sub. Their intentions shine clearly to me.",
                          "timestamp": "2022-06-29 14:27:45",
                          "score": 1,
                          "num_children": 1,
                          "author": 105843,
                          "replies": [
                            {
                              "id": "ie6w9ms",
                              "text": "Nah its just making fun of people who arent being persecuted but still pretend to be.\n\nYou know the type.\n\nLike the conservatives who were acting persecuted when gay marriage was legalized. I'm sure you weren't one of them though. \n\n*wink*",
                              "timestamp": "2022-06-29 14:45:47",
                              "score": 1,
                              "num_children": 0,
                              "author": 73754,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}