{
  "id": "vqh3a1",
  "text": "Fuck these 2 right wingers\n",
  "timestamp": "2022-07-03 12:59:15",
  "score": 3766,
  "subreddit": "t5_3fdcn",
  "num_children": 60,
  "author": 320222,
  "replies": [
    {
      "id": "ieoxfm9",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-07-03 12:59:16",
      "score": 1,
      "num_children": 1,
      "author": 184140,
      "replies": [
        {
          "id": "ieqc1gx",
          "text": "Chris Pratt can NOT stop talking about jesus on sets to the point hes had to be asked to stop at work.",
          "timestamp": "2022-07-03 19:16:55",
          "score": 2,
          "num_children": 0,
          "author": 352419,
          "replies": []
        }
      ]
    },
    {
      "id": "iepywfp",
      "text": "Remember when he said his church was cool with “the gays” because that church treated him “a not gay” super awesome?\n\nI do.",
      "timestamp": "2022-07-03 17:41:10",
      "score": 84,
      "num_children": 0,
      "author": 345249,
      "replies": []
    },
    {
      "id": "ieq7ezo",
      "text": "Why is Chris so orange? What is it with republicans and self tanner?",
      "timestamp": "2022-07-03 18:42:57",
      "score": 67,
      "num_children": 0,
      "author": 339119,
      "replies": []
    },
    {
      "id": "iepxrlk",
      "text": "Chris Pratt keeps going all in and then begging for mercy due to misunderstanding. He needs to pick a lane and his Parks and Rec people need to call him out.",
      "timestamp": "2022-07-03 17:33:02",
      "score": 733,
      "num_children": 5,
      "author": 22240,
      "replies": [
        {
          "id": "ieqb06o",
          "text": "My armchair take on this...\n\nI think Chris Pratt is like many other Americans who believe they are morally upright people and cannot fathom being associated with bad people like racists and homophobes because they do not go about their lives making consciously racist or homophobic actions.\n\nThat being said, what these same people don't realize is that they have a racist and homophobic worldview. The very lens through which they see and interpret the world is racist and homophobic, and thus they end up inadvertently supporting things they simultaneously believe they are against. The next problem then is that it is easier for them to make excuses for the bigotry they see (or even eventually embrace it outright) than it is for them to reevaluate their worldview and the inherent harmfulness of it.\n\nSo when it comes to his former Parks and Rec coworkers, they see the silly, goofy, very funny, non-serious and lovable Chris Pratt who never did bigoted things, and they likely believe him now when he says he still isn't a bigot because, well, he never was around them either. But that is because they likely don't see that his worldview is bigoted. They probably haven't even considered his worldview very much at all.\n\nAgain, just me sharing a completely falsifiable take based only on observation.",
          "timestamp": "2022-07-03 19:09:15",
          "score": 500,
          "num_children": 5,
          "author": 10785,
          "replies": [
            {
              "id": "ieqicd4",
              "text": ">who believe they are morally upright people\n\nSee, that's all you need to know. If someone doesn't think they're capable of being bad or wrong, they're incapable of the introspection required to even understand the problem. Good people are people who know they can mess up and learn from their mistakes. They don't believe they are infallible.",
              "timestamp": "2022-07-03 20:03:51",
              "score": 174,
              "num_children": 2,
              "author": 260270,
              "replies": [
                {
                  "id": "ieqt9hg",
                  "text": "One thing I've learned after becoming an adult, and then a mom was/is that it was important af for my kids to hear me say \"I was wrong. I'm sorry. I'll do better.\" Normalize being wrong and owning up to it. \"Know better, do better\" is a common refrain in our house. I don't understand why adults are so adverse to being wrong. It's how we fucking learn and grow! \"Mom, I was wrong.\" My response is usually, \"I'm proud of you for owning up.\"",
                  "timestamp": "2022-07-03 21:24:32",
                  "score": 67,
                  "num_children": 2,
                  "author": 328976,
                  "replies": [
                    {
                      "id": "iergqki",
                      "text": "Yeah, I think the reason has everything to do with that last thing. Growing up, I knew I would get into serious shit for doing anything wrong, regardless of whether or not I owned up to it. I think adults often don’t grow out of that phase (myself included at times) and so they do all they can to avoid blame for their actions, to the point that they self justify horrible opinions/ideas they hold.",
                      "timestamp": "2022-07-04 00:35:52",
                      "score": 9,
                      "num_children": 2,
                      "author": 226896,
                      "replies": [
                        {
                          "id": "ierov78",
                          "text": "You're spot on. It really is arrested development. Which is also my favorite show... Lol",
                          "timestamp": "2022-07-04 01:49:28",
                          "score": 12,
                          "num_children": 1,
                          "author": 328976,
                          "replies": [
                            {
                              "id": "ies1n6u",
                              "text": "Ugh i still have to watch that. Too many things lmao",
                              "timestamp": "2022-07-04 03:50:55",
                              "score": 2,
                              "num_children": 1,
                              "author": 226896,
                              "replies": [
                                {
                                  "id": "ies3x88",
                                  "text": "The family is just despicable, but so funny. It's very casual viewing.",
                                  "timestamp": "2022-07-04 04:14:27",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 328976,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "iesj3k9",
                          "text": "That is why they are all victims..",
                          "timestamp": "2022-07-04 07:12:19",
                          "score": 1,
                          "num_children": 0,
                          "author": 117485,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ierxs3b",
                      "text": "The thing that doesn’t make sense though is that Chris Pratt along with most right wingers are Christians. Christianity teaches that NO man is good and everyone has sinned and fallen short. You have simply accepted God’s mercy and love, you haven’t done anything at all to earn it because no body is actually worthy of it.\n\nSomehow that idea gets lost on evangelical Christian’s though and they feel as though they’re on a moral high ground.",
                      "timestamp": "2022-07-04 03:12:47",
                      "score": 24,
                      "num_children": 2,
                      "author": 294276,
                      "replies": [
                        {
                          "id": "ies1cxp",
                          "text": "They lack the self-awareness and ability to introspect that would allow them to reflect and make a change where appropriate.",
                          "timestamp": "2022-07-04 03:48:05",
                          "score": 9,
                          "num_children": 0,
                          "author": 328976,
                          "replies": []
                        },
                        {
                          "id": "ies4o0e",
                          "text": "Modern day Pharisees.",
                          "timestamp": "2022-07-04 04:22:15",
                          "score": 8,
                          "num_children": 0,
                          "author": 406658,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ieqoctl",
                  "text": "I think people who think of themselves as \"good people\" don't view themselves as infallible, but I *do* think they are more likely to have blinders on that can inhibit the kind of introspection you're talking about.",
                  "timestamp": "2022-07-03 20:47:59",
                  "score": 15,
                  "num_children": 0,
                  "author": 10785,
                  "replies": []
                }
              ]
            },
            {
              "id": "iergdvr",
              "text": "This is a similar stance I've had to figures like JonTron. They say dumb, hurtful things but it never comes across as a view with malicious intent, but a flawed understanding and world view reinforced by cyclical rhetoric. It's entirely possible to be a friendly, entertaining and loving person and a moron at the same time, which felt like the point of the Andy character in parks and rec.",
              "timestamp": "2022-07-04 00:32:46",
              "score": 9,
              "num_children": 0,
              "author": 6836,
              "replies": []
            },
            {
              "id": "ieqky0a",
              "text": "I think you nailed it.",
              "timestamp": "2022-07-03 20:23:04",
              "score": 14,
              "num_children": 0,
              "author": 210577,
              "replies": []
            },
            {
              "id": "iere849",
              "text": "this, 100%.  \n\nId like to add also that the people in this category can learn and change with a soft had. If you were to engage someone like this in earnest conversation, eventually they can see it. They have to confront themselves and that may take a while but it can happen. Theyre on a fence though, all it takes is a twitter mob screaming HOMOPHOBIC at people like this to turn them into Joe Rogan. I hope that one day its more normalized to try and talk vs tryng to call someone out and shame them. Thats not how we move forward.",
              "timestamp": "2022-07-04 00:13:45",
              "score": 8,
              "num_children": 1,
              "author": 56112,
              "replies": [
                {
                  "id": "ies3acj",
                  "text": "That's a LOT easier to say if you or your loved ones aren't one of their targets.",
                  "timestamp": "2022-07-04 04:07:48",
                  "score": 3,
                  "num_children": 1,
                  "author": 283493,
                  "replies": [
                    {
                      "id": "ies3via",
                      "text": "I never said it was. Being the bigger person ALWAYS sucks. Im 36, bi, neurodivergent, female and black. I know how much people suck, and if i didn't try as hard as I do- I could very easily be a bitter angry and hateful person from...hell the entire decade of the 90s honestly. shite sucked but you don't make progress by throwing people away...if theres a chance to change someone...its better to make an ally than an enemy.\n\nAll I'm saying is, some people aren't worth the effort (people like rogan) and some people can potentially be helped. Maybe they dont come around, but imo the effort is worth it if theres a chance. Yeah it sucks, but...were humans, and if someone honestly doesn't see where they're wrong- telling them to F off aint gonna open their eyes, if anything itll make them shut em",
                      "timestamp": "2022-07-04 04:13:57",
                      "score": 4,
                      "num_children": 0,
                      "author": 56112,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ieso1n2",
              "text": "Too many people think they are “good” because they’re not “the worst”. They only compare themselves to the absolute deplorable and don’t strive to DO BETTER than the only people they should be comparing themselves to, the person they were yesterday.",
              "timestamp": "2022-07-04 08:20:35",
              "score": 1,
              "num_children": 0,
              "author": 199160,
              "replies": []
            }
          ]
        },
        {
          "id": "iesg3l0",
          "text": "What happened with Chris Pratt? I don't stay up on celeb gossip",
          "timestamp": "2022-07-04 06:33:20",
          "score": 3,
          "num_children": 1,
          "author": 349410,
          "replies": [
            {
              "id": "ietfdne",
              "text": "He joined some whackadoo church a while back and then downplayed it and said he wasn’t connected with any church. He made some passive aggressive comment about disabled kids (he has one) and then said it was misunderstood. Now he’s walking around with a Betsy Ross hat which apparently is something his sheriff brother is down with. Wouldn’t say any of this qualifies as “gossip,” per se. My point is that he keeps dipping his toes in shady stuff and then throwing his arms in the air.",
              "timestamp": "2022-07-04 13:42:51",
              "score": -1,
              "num_children": 1,
              "author": 22240,
              "replies": [
                {
                  "id": "ietiwcw",
                  "text": "Idk sounds pretty gossipy to me, hard to consider someone legit alt-right with that level of \"maybe they support some things on the right\". Like George W Bush is way further, and more explicitly, right-wing than that and I don't think anyone considers him \"alt-right\".",
                  "timestamp": "2022-07-04 14:11:10",
                  "score": 3,
                  "num_children": 1,
                  "author": 349410,
                  "replies": [
                    {
                      "id": "ietjcf3",
                      "text": "Ok",
                      "timestamp": "2022-07-04 14:14:36",
                      "score": 0,
                      "num_children": 0,
                      "author": 22240,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ier6oa7",
          "text": "I wouldn’t consider him to be alt right. Here’s the quote from bis interview:\n\n“Religion has been oppressive as f**k for a long time. I didn’t know that I would kind of become the face of religion when really I’m not a religious person. I think there’s a distinction between being religious – adhering to the customs created by man, oftentimes appropriating the awe reserved for who I believe is a very real God – and using it to control people, to take money from people, to abuse children, to steal land, to justify hatred,” Pratt said.\n\nSo it sounds like he’s religious, but against the more organized parts of it. Idk, he is probably on the right but I wouldn’t call him right wing by any means.",
          "timestamp": "2022-07-03 23:09:29",
          "score": 21,
          "num_children": 0,
          "author": 323307,
          "replies": []
        },
        {
          "id": "iery7o1",
          "text": "Okay to be fair on this: all of Pratt’s costars have said “he’s a deeply religious man, but he never forces it on others. We love him because he respect us.”\n\nI’m not saying I agree with his hyper Christianity, but it’s his right.",
          "timestamp": "2022-07-04 03:16:56",
          "score": 7,
          "num_children": 1,
          "author": 343161,
          "replies": [
            {
              "id": "ies0pi2",
              "text": "[deleted]",
              "timestamp": "2022-07-04 03:41:30",
              "score": -2,
              "num_children": 1,
              "replies": [
                {
                  "id": "ies3nz6",
                  "text": "Firstly; I never said anything about alt right terrorism. \nSecondly; that whole thing about his “disabled kid” was bull shit at best. He thanked his wife for giving him a healthy kid. He never said fuck his other child for having autism. He was just happy his kid is healthy. I’m not AT ALL saying autism is terrible, but would you wish it on someone? If your kid could be neurotypical, would you want them to be? But that’s not even the point, all he said was “I’m happy my kid is healthy,” isn’t that what every parent wants? Or would you rather him wish Huntington’s? \n\nI hate fascism as much as the next guy, but let’s not move the goal posts because we disagree with someone’s *completely personal* beliefs.",
                  "timestamp": "2022-07-04 04:11:45",
                  "score": 2,
                  "num_children": 0,
                  "author": 343161,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ieqawzy",
          "text": "Andy is literally the worst main character in PnR, I will never understand how THAT was the spark for him.",
          "timestamp": "2022-07-03 19:08:37",
          "score": 5,
          "num_children": 0,
          "author": 303540,
          "replies": []
        }
      ]
    },
    {
      "id": "iepclrh",
      "text": "I didn't realize Chris Pratt was one. How disappointing.",
      "timestamp": "2022-07-03 15:04:07",
      "score": 550,
      "num_children": 6,
      "author": 147599,
      "replies": [
        {
          "id": "ieqb6iz",
          "text": "Yeah go to any one of his social media accounts and look at who he follows",
          "timestamp": "2022-07-03 19:10:34",
          "score": 35,
          "num_children": 1,
          "author": 17969,
          "replies": [
            {
              "id": "ieqxtpk",
              "text": "Or look at his brother",
              "timestamp": "2022-07-03 21:58:57",
              "score": 19,
              "num_children": 0,
              "author": 235771,
              "replies": []
            }
          ]
        },
        {
          "id": "iepllch",
          "text": "Part of a mega homophobic church :/",
          "timestamp": "2022-07-03 16:08:18",
          "score": 518,
          "num_children": 4,
          "author": 209262,
          "replies": [
            {
              "id": "ieq7azl",
              "text": "Except recently he's be claiming he's \"not very religious.\" Like ok, that doesn't excuse the fact that he's abandoned a dog, a cat, and his own son. Chris Pratt is a major piece of shit.",
              "timestamp": "2022-07-03 18:42:09",
              "score": 218,
              "num_children": 2,
              "author": 77387,
              "replies": [
                {
                  "id": "ieqambr",
                  "text": "My brother in Christ, you personally [erected a giant cross in your backyard.](https://i.imgur.com/qEMN2fw.jpg)",
                  "timestamp": "2022-07-03 19:06:25",
                  "score": 158,
                  "num_children": 1,
                  "author": 300626,
                  "replies": [
                    {
                      "id": "ieqjyi3",
                      "text": "Can any Christians explain to me why the literal murder weapon of an authoritarian state that killed their god, is *the* symbol of their faith?",
                      "timestamp": "2022-07-03 20:15:47",
                      "score": 108,
                      "num_children": 8,
                      "author": 125714,
                      "replies": [
                        {
                          "id": "ieqqlki",
                          "text": "Its simple to draw and was an extremely well known tool. Co opting it for their message was easier than making up a new one, and it literally symbolizes the martyrdom the entire religious is based on.",
                          "timestamp": "2022-07-03 21:04:31",
                          "score": 63,
                          "num_children": 0,
                          "author": 173870,
                          "replies": []
                        },
                        {
                          "id": "ieqq60z",
                          "text": "[A lot of Christians wear crosses around their necks.  You think when Jesus comes back, he ever wants to see a fuckin cross?](https://youtu.be/pJSZcxXe7IQ) - Bill Hicks",
                          "timestamp": "2022-07-03 21:01:24",
                          "score": 55,
                          "num_children": 2,
                          "author": 395462,
                          "replies": [
                            {
                              "id": "iesyzm1",
                              "text": "Fucking love this bit.\n“Thinking of John *bang bang* we miss him!”",
                              "timestamp": "2022-07-04 10:53:47",
                              "score": 2,
                              "num_children": 0,
                              "author": 234057,
                              "replies": []
                            },
                            {
                              "id": "iey5c3c",
                              "text": "[removed]",
                              "timestamp": "2022-07-05 14:49:07",
                              "score": 0,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iey73zd",
                                  "text": "WTF.  Why would you think that?",
                                  "timestamp": "2022-07-05 15:01:28",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 395462,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ieql06u",
                          "text": "It’s a death cult.",
                          "timestamp": "2022-07-03 20:23:32",
                          "score": 30,
                          "num_children": 0,
                          "author": 178879,
                          "replies": []
                        },
                        {
                          "id": "ierkeky",
                          "text": "persecution fetish",
                          "timestamp": "2022-07-04 01:08:47",
                          "score": 10,
                          "num_children": 0,
                          "author": 221887,
                          "replies": []
                        },
                        {
                          "id": "ieqodpj",
                          "text": "Because they’re idiots",
                          "timestamp": "2022-07-03 20:48:09",
                          "score": 23,
                          "num_children": 0,
                          "author": 187962,
                          "replies": []
                        },
                        {
                          "id": "ieqox7f",
                          "text": "Because at it's heart christianity is a death cult",
                          "timestamp": "2022-07-03 20:52:07",
                          "score": 13,
                          "num_children": 0,
                          "author": 32858,
                          "replies": []
                        },
                        {
                          "id": "iesa9i1",
                          "text": "My favourite quote from Stand On Zanzibar is \"Christians killed their god and would happily do it again if they could\"",
                          "timestamp": "2022-07-04 05:23:26",
                          "score": 2,
                          "num_children": 0,
                          "author": 375444,
                          "replies": []
                        },
                        {
                          "id": "ierdyxg",
                          "text": "To play devils advocate I think you can look at it in a similar way to how the word gay has been reclaimed by the LGBT community amd other similar slur words. Reclaiming that symbol of persecution as a symbol of defiance is a common trend thought history. Back when Christians were persecuted for their beliefs (some 2022 years ago) it would make sense for Christians to keep themselves hidden. They had various ways of recognizing each other and iconography is always faster than an exchange of word. It's a :error simple shape so it would be very easy to make a sign of the cross or wear one. And to most it wouldn't mean anything back then, but those who knew what it meant could make the connection. It stuck around and has become the \"thing\" that Christians do.",
                          "timestamp": "2022-07-04 00:11:28",
                          "score": 3,
                          "num_children": 1,
                          "author": 88491,
                          "replies": [
                            {
                              "id": "if8ega3",
                              "text": "Thanks man",
                              "timestamp": "2022-07-07 17:37:09",
                              "score": 1,
                              "num_children": 0,
                              "author": 106059,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ier220c",
                  "text": "This is common evangelical framing: it’s not “religion,” it’s a “close personal relationship with Jesus Christ.”",
                  "timestamp": "2022-07-03 22:32:05",
                  "score": 21,
                  "num_children": 1,
                  "author": 117403,
                  "replies": [
                    {
                      "id": "ierrs9w",
                      "text": "Yep. I saw that headline and couldn’t bring myself to read the full thing. I already knew he’d pull that “relationship, not a religion” shit churchgoers say. When I was younger it was drilled into my head to say to people to help convert them. “I don’t like religion either! But I have a relationship with Jesus.” So gross.",
                      "timestamp": "2022-07-04 02:16:22",
                      "score": 8,
                      "num_children": 0,
                      "author": 213844,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iepn6js",
              "text": "Has been seen wearing 3%er merch as well.",
              "timestamp": "2022-07-03 16:19:32",
              "score": 277,
              "num_children": 3,
              "author": 381883,
              "replies": [
                {
                  "id": "iepr8n3",
                  "text": "His brother was a sheriff for Solano County in CA and is heavily involved in the 3%ers, I believe the brother was making the merch.",
                  "timestamp": "2022-07-03 16:46:48",
                  "score": 174,
                  "num_children": 0,
                  "author": 12597,
                  "replies": []
                },
                {
                  "id": "iepsk26",
                  "text": "The hat with the stars in a circle?",
                  "timestamp": "2022-07-03 16:55:59",
                  "score": 56,
                  "num_children": 1,
                  "author": 24468,
                  "replies": [
                    {
                      "id": "iepzt7y",
                      "text": "Yes, the Betsy Ross star flag has connections to the former slavery colonial past of the USA.",
                      "timestamp": "2022-07-03 17:47:41",
                      "score": 72,
                      "num_children": 2,
                      "author": 97985,
                      "replies": [
                        {
                          "id": "ieq12ja",
                          "text": "Yeah, so does the current flag.",
                          "timestamp": "2022-07-03 17:56:48",
                          "score": 86,
                          "num_children": 3,
                          "author": 24468,
                          "replies": [
                            {
                              "id": "ieqpoup",
                              "text": "I enjoyed this comment!",
                              "timestamp": "2022-07-03 20:57:52",
                              "score": 16,
                              "num_children": 0,
                              "author": 158499,
                              "replies": []
                            },
                            {
                              "id": "ieq30zo",
                              "text": "[deleted]",
                              "timestamp": "2022-07-03 18:10:57",
                              "score": -15,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "ieq6hp6",
                                  "text": "I'm aware.",
                                  "timestamp": "2022-07-03 18:36:13",
                                  "score": 9,
                                  "num_children": 0,
                                  "author": 24468,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "ieq16mu",
                              "text": "The regular US flag? No.",
                              "timestamp": "2022-07-03 17:57:38",
                              "score": -12,
                              "num_children": 1,
                              "author": 97985,
                              "replies": [
                                {
                                  "id": "ieq6g8y",
                                  "text": "No?  Am I misremembering US history?  The Stars & Stripes design has been constant.",
                                  "timestamp": "2022-07-03 18:35:55",
                                  "score": 8,
                                  "num_children": 1,
                                  "author": 24468,
                                  "replies": [
                                    {
                                      "id": "ieq86ei",
                                      "text": "You're not. They add stars for the new states but I feel like that would be completely disingenuous to suggest that it is a \"new flag.\"  A version of that flag has flown over the United States since it was founded and it is definitely connected to the history of the country.",
                                      "timestamp": "2022-07-03 18:48:35",
                                      "score": 9,
                                      "num_children": 0,
                                      "author": 153409,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ieq6ak2",
                          "text": "[removed]",
                          "timestamp": "2022-07-03 18:34:47",
                          "score": -6,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ieqqr0y",
                              "text": "If you have missed an obvious part of American history and have zero comprehension of nuance, you say silly stuff like this,,,",
                              "timestamp": "2022-07-03 21:05:38",
                              "score": 1,
                              "num_children": 0,
                              "author": 124225,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ieqh47u",
                  "text": "Has he, though? Like, Chris Pratt is a piece of shit, but I've only seen a picture of him wearing a Betsy Ross hat. The 3%er logo is the Betsy Ross stars with a roman numeral 3 in the middle - his was just the Betsy Ross stars. It shows that he's a tone-deaf, Jingoist moron, but it's definitely not 3%er merch.",
                  "timestamp": "2022-07-03 19:54:37",
                  "score": 15,
                  "num_children": 1,
                  "author": 38594,
                  "replies": [
                    {
                      "id": "iequagj",
                      "text": "[deleted]",
                      "timestamp": "2022-07-03 21:32:15",
                      "score": 31,
                      "num_children": 3,
                      "replies": [
                        {
                          "id": "ierddrh",
                          "text": "It's such a shame. I remember when that Betsy Ross flag was all over the place during the Bicentennial.\n\nOh well. Another symbol co-opted.\n\nMove along, nothing to see here.",
                          "timestamp": "2022-07-04 00:06:18",
                          "score": 11,
                          "num_children": 0,
                          "author": 410635,
                          "replies": []
                        },
                        {
                          "id": "ier5sm9",
                          "text": "I stand corrected - put together, this is pretty damning.",
                          "timestamp": "2022-07-03 23:02:16",
                          "score": 16,
                          "num_children": 0,
                          "author": 38594,
                          "replies": []
                        },
                        {
                          "id": "ies40zc",
                          "text": "And Patriot Front. They wore the Betsy Ross flag 2-3 years ago. It was a complete rebranding before our eyes.",
                          "timestamp": "2022-07-04 04:15:32",
                          "score": 1,
                          "num_children": 0,
                          "author": 373464,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ierjd5b",
              "text": "Wasn't the denied by the leader of said church and Chris? Just wondering if the connection is proven.",
              "timestamp": "2022-07-04 00:59:17",
              "score": 1,
              "num_children": 0,
              "author": 212728,
              "replies": []
            },
            {
              "id": "ieqm56q",
              "text": "Fake news actually.",
              "timestamp": "2022-07-03 20:31:50",
              "score": -13,
              "num_children": 0,
              "author": 257736,
              "replies": []
            }
          ]
        },
        {
          "id": "iepw4e4",
          "text": "I didn't realize that was Chris Pratt.",
          "timestamp": "2022-07-03 17:21:11",
          "score": 82,
          "num_children": 3,
          "author": 118773,
          "replies": [
            {
              "id": "iepzlvo",
              "text": "Neither of them look like themselves maybe it’s the stupid faces they’re making",
              "timestamp": "2022-07-03 17:46:13",
              "score": 28,
              "num_children": 1,
              "author": 132051,
              "replies": [
                {
                  "id": "ieq09nh",
                  "text": "Maybe it's the carefully cultivated public appearance vs a candid snapshot. He's also older than we tend to think.",
                  "timestamp": "2022-07-03 17:50:59",
                  "score": 36,
                  "num_children": 0,
                  "author": 114743,
                  "replies": []
                }
              ]
            },
            {
              "id": "ieqof11",
              "text": "LOL, I thought it was Tom Brady until I started reading the comments.",
              "timestamp": "2022-07-03 20:48:26",
              "score": 6,
              "num_children": 0,
              "author": 224577,
              "replies": []
            },
            {
              "id": "iesjp4r",
              "text": "I haven’t actually seen him close up recently, didn’t know he needs a toupee now.",
              "timestamp": "2022-07-04 07:20:23",
              "score": 1,
              "num_children": 0,
              "author": 344731,
              "replies": []
            }
          ]
        },
        {
          "id": "iept56h",
          "text": "couldnt be more disappointed",
          "timestamp": "2022-07-03 17:00:07",
          "score": 55,
          "num_children": 1,
          "replies": [
            {
              "id": "ieq1tsf",
              "text": "This has been fairly well known for a while. He follows a lot of these losers on Twitter and gives them kind of a platform by acquaintance, so he took a lot of grief for it. People were sticking up for him and making excuses while he was relatively silent about it. But he is showing up a lot more frequently wearing the merch, too. He's not just a silent supporter, imo. He's at the very least supporting it financially.",
              "timestamp": "2022-07-03 18:02:16",
              "score": 92,
              "num_children": 0,
              "author": 4720,
              "replies": []
            }
          ]
        },
        {
          "id": "iepyshj",
          "text": "Dammit.",
          "timestamp": "2022-07-03 17:40:22",
          "score": 11,
          "num_children": 1,
          "author": 301757,
          "replies": [
            {
              "id": "ieq2vxe",
              "text": "[removed]",
              "timestamp": "2022-07-03 18:09:55",
              "score": -16,
              "num_children": 3,
              "replies": [
                {
                  "id": "ieq505f",
                  "text": "“Dammit”\n\n“So PaThEtIc! TrIgGerReD?”\n\nWhat’s hilarious is this has been people discussing how unfortunate Pratt has been and had the situation been reversed you and your ilk would be calling for him to be military tribunal’d and calling him a pedo/groomer.\n\n\nSo yeah. You’re full of shit snowflake.",
                  "timestamp": "2022-07-03 18:25:22",
                  "score": 7,
                  "num_children": 0,
                  "author": 12261,
                  "replies": []
                },
                {
                  "id": "ieq5i2o",
                  "text": "“Opinion” = chocolate is better than vanilla.\n\nHate filled bigotry “opinion” =  Actively works to diminish other peoples rights. (Through money given to his church.) \n\nSee the difference? (Probably not or probably a hate filled bigot.)",
                  "timestamp": "2022-07-03 18:29:00",
                  "score": 5,
                  "num_children": 0,
                  "author": 101183,
                  "replies": []
                },
                {
                  "id": "ieq45df",
                  "text": "Eh, I've never been on the Chris Pratt train. Dude was never funny, bad actor and shitty views.",
                  "timestamp": "2022-07-03 18:19:09",
                  "score": 2,
                  "num_children": 0,
                  "author": 404389,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ierguza",
          "text": "He's not",
          "timestamp": "2022-07-04 00:36:57",
          "score": 0,
          "num_children": 0,
          "author": 340833,
          "replies": []
        }
      ]
    },
    {
      "id": "iepgvxd",
      "text": "Kirstie Ally too...another irrelevant nitwit on the rw train",
      "timestamp": "2022-07-03 15:35:17",
      "score": 106,
      "num_children": 1,
      "author": 122411,
      "replies": [
        {
          "id": "ieq93jb",
          "text": "Chris Pratt is still relevant though. Jurassic world is killing at the box office right now",
          "timestamp": "2022-07-03 18:55:17",
          "score": 27,
          "num_children": 1,
          "author": 165519,
          "replies": [
            {
              "id": "ieqfifl",
              "text": "we were referring to Joe Rogan who's somewhat relevant to his fans but not like he once was",
              "timestamp": "2022-07-03 19:42:32",
              "score": 13,
              "num_children": 0,
              "author": 122411,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ieqyr9u",
      "text": "I’ll always remember how everyone at marvel lost their shit at a Twitter poll that voted him the worst of the Chris’s, saying how he’s such an amazing guy and everything while they all remained silent when Brie Larson was being harassed for wanting more diversity in film criticism",
      "timestamp": "2022-07-03 22:06:01",
      "score": 63,
      "num_children": 2,
      "author": 128569,
      "replies": [
        {
          "id": "iesohh3",
          "text": "Sounds about white. I’m so over the circle jerk at Marvel thinking they’re god’s gift to earth. The Boys parodied them perfectly.",
          "timestamp": "2022-07-04 08:26:46",
          "score": 18,
          "num_children": 0,
          "author": 199160,
          "replies": []
        },
        {
          "id": "ietfpkx",
          "text": "TBH the whole Brie drama passed straight over my head , but it's obvious that Don Cheadle isn't a fan of hers at all ( if looks could kill she'd be a corpse)",
          "timestamp": "2022-07-04 13:45:38",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iep665o",
      "text": "joe rogan kinda looks like boba fett",
      "timestamp": "2022-07-03 14:15:55",
      "score": 273,
      "num_children": 7,
      "author": 90367,
      "replies": [
        {
          "id": "ieq99hu",
          "text": "You take that back, Temuera Morrison doesn’t deserve the comparison",
          "timestamp": "2022-07-03 18:56:30",
          "score": 67,
          "num_children": 1,
          "author": 105750,
          "replies": [
            {
              "id": "iesxa9e",
              "text": "Temuera Morrison is all purity. Nothing like Rogan. The bacta did wonders.",
              "timestamp": "2022-07-04 10:31:11",
              "score": 2,
              "num_children": 0,
              "author": 372592,
              "replies": []
            }
          ]
        },
        {
          "id": "ieqbtiw",
          "text": "He looks like a dirty thumb.",
          "timestamp": "2022-07-03 19:15:18",
          "score": 35,
          "num_children": 0,
          "author": 339108,
          "replies": []
        },
        {
          "id": "ieq1y6d",
          "text": "Don't do my man Boba dirty like that",
          "timestamp": "2022-07-03 18:03:07",
          "score": 78,
          "num_children": 0,
          "author": 2300,
          "replies": []
        },
        {
          "id": "ieq23o8",
          "text": "Roida Fett.",
          "timestamp": "2022-07-03 18:04:12",
          "score": 19,
          "num_children": 0,
          "author": 42116,
          "replies": []
        },
        {
          "id": "iep6j4f",
          "text": "[removed]",
          "timestamp": "2022-07-03 14:18:46",
          "score": 55,
          "num_children": 1,
          "replies": [
            {
              "id": "iep7bf3",
              "text": "Joe Rogan is a festering piece of shit, but body shaming hurts everyone else that you don't intend to hurt much more than it hurts your intended target",
              "timestamp": "2022-07-03 14:24:44",
              "score": -2,
              "num_children": 3,
              "author": 33841,
              "replies": [
                {
                  "id": "iepzpsv",
                  "text": "Body shaming hurts everyone else that you don't intend to hurt much more than it hurts your intended target.\n\nAnyone who disagrees gets a Sitewide Rule 1 Promotion of Hatred Based on Identity or Vulnerability flag, banned from this subreddit, and no further questions asked.",
                  "timestamp": "2022-07-03 17:47:00",
                  "score": 46,
                  "num_children": 0,
                  "author": 176442,
                  "replies": []
                },
                {
                  "id": "iep9asz",
                  "text": "[removed]",
                  "timestamp": "2022-07-03 14:39:42",
                  "score": 19,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iep9mzs",
                      "text": "I'm a trans man and my height is a dysphoria trigger. When people make short jokes, I feel a need to tell them that it makes others uncomfortable because nobody else will stand up for short men. Short men are a socially \"acceptable\" target, but please remember that many trans men are gonna be on the short side and you're hurting a marginalized people.",
                      "timestamp": "2022-07-03 14:42:17",
                      "score": -24,
                      "num_children": 2,
                      "author": 33841,
                      "replies": [
                        {
                          "id": "iepak1x",
                          "text": "[removed]",
                          "timestamp": "2022-07-03 14:49:01",
                          "score": 26,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "iepbbxv",
                              "text": "The problem is, you're not hurting joe Rogan when you make fun of his height. He will never see it. The people who WILL see it are the short men who already feel hurt about their height. There's so much more about Rogan that you can attack other than his height. There's nothing wrong with being short, and you making fun of him for it indicates otherwise.\n\nDidn't realize people were going to be so hostile towards me about this.",
                              "timestamp": "2022-07-03 14:54:42",
                              "score": -8,
                              "num_children": 1,
                              "author": 33841,
                              "replies": [
                                {
                                  "id": "iepcjtu",
                                  "text": "[removed]",
                                  "timestamp": "2022-07-03 15:03:43",
                                  "score": 21,
                                  "num_children": 2,
                                  "replies": [
                                    {
                                      "id": "ieprlwg",
                                      "text": ">and I hope that can change,\n\nBut you won't BE the change. You clearly don't actually think it's horrible if you are continuing to enable it.",
                                      "timestamp": "2022-07-03 16:49:22",
                                      "score": 12,
                                      "num_children": 1,
                                      "author": 33841,
                                      "replies": [
                                        {
                                          "id": "iepsz6o",
                                          "text": "[removed]",
                                          "timestamp": "2022-07-03 16:58:56",
                                          "score": 1,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "iept6lm",
                                              "text": "If you keep making short jokes, other people will keep making short jokes. If people like me keep speaking up about how shitty short jokes are to some people, maybe y'all will shut the fuck up and stop hurting people.",
                                              "timestamp": "2022-07-03 17:00:23",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 33841,
                                              "replies": [
                                                {
                                                  "id": "ieptgqo",
                                                  "text": "[removed]",
                                                  "timestamp": "2022-07-03 17:02:21",
                                                  "score": 0,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "ieptnfc",
                                                      "text": "[removed]",
                                                      "timestamp": "2022-07-03 17:03:39",
                                                      "score": 2,
                                                      "num_children": 0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "ieph0wh",
                                      "text": "Nah he’s right, think of it. Joe Rogan is a short lil douchebag but calling him short is saying anyone shorter than him is shorter than Baby Fett. I’m shorter than him and height is touchy for me as well so to see someone getting called short that’s taller than you feels like a jab to anyone shorter than him",
                                      "timestamp": "2022-07-03 15:36:17",
                                      "score": -5,
                                      "num_children": 0,
                                      "author": 243748,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ier9a0z",
                          "text": "Why the fuck are you getting down vote brigaded? Are Rogans fans really THAT fucked? I don't get it",
                          "timestamp": "2022-07-03 23:31:12",
                          "score": 2,
                          "num_children": 0,
                          "author": 367630,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iepp6t7",
                  "text": "[removed]",
                  "timestamp": "2022-07-03 16:32:52",
                  "score": 4,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iepqlgq",
                      "text": "[removed]",
                      "timestamp": "2022-07-03 16:42:22",
                      "score": 4,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ieps2bu",
                          "text": "[removed]",
                          "timestamp": "2022-07-03 16:52:33",
                          "score": 5,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ieps5af",
                              "text": "[removed]",
                              "timestamp": "2022-07-03 16:53:07",
                              "score": -2,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "ieptf3e",
                                  "text": "[removed]",
                                  "timestamp": "2022-07-03 17:02:01",
                                  "score": 4,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "ieptm0l",
                                      "text": "[removed]",
                                      "timestamp": "2022-07-03 17:03:22",
                                      "score": 2,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iesulx5",
          "text": "You take that back!",
          "timestamp": "2022-07-04 09:54:26",
          "score": 1,
          "num_children": 0,
          "author": 354412,
          "replies": []
        },
        {
          "id": "ierx0xi",
          "text": "With a little Danny Devito for good measure.",
          "timestamp": "2022-07-04 03:05:30",
          "score": -1,
          "num_children": 0,
          "author": 408402,
          "replies": []
        }
      ]
    },
    {
      "id": "ieoyah0",
      "text": "Who's the guy with Rogan?",
      "timestamp": "2022-07-03 13:07:28",
      "score": 125,
      "num_children": 3,
      "author": 343725,
      "replies": [
        {
          "id": "iep9333",
          "text": "Crisp Rat",
          "timestamp": "2022-07-03 14:38:05",
          "score": 79,
          "num_children": 2,
          "author": 182953,
          "replies": [
            {
              "id": "iep9xet",
              "text": "The hard-boiled detective?",
              "timestamp": "2022-07-03 14:44:26",
              "score": 18,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ierqi1n",
              "text": "It's MouseRat",
              "timestamp": "2022-07-04 02:04:26",
              "score": 1,
              "num_children": 0,
              "author": 381975,
              "replies": []
            }
          ]
        },
        {
          "id": "ieoyguu",
          "text": "Chris Pratt - homophobic actor",
          "timestamp": "2022-07-03 13:09:10",
          "score": 339,
          "num_children": 13,
          "author": 320222,
          "replies": [
            {
              "id": "ieoyic8",
              "text": "That's what I thought. Fuckin shame.",
              "timestamp": "2022-07-03 13:09:32",
              "score": 136,
              "num_children": 2,
              "author": 343725,
              "replies": [
                {
                  "id": "iep3vm3",
                  "text": "He’s a disgrace. \n\nOn the flip side, Chris Evans is in real life everything you’d expect the actor of Captain America to be.",
                  "timestamp": "2022-07-03 13:57:43",
                  "score": 288,
                  "num_children": 4,
                  "replies": [
                    {
                      "id": "iepjpjo",
                      "text": "Chris evans is the best Chris.",
                      "timestamp": "2022-07-03 15:55:23",
                      "score": 113,
                      "num_children": 2,
                      "author": 315922,
                      "replies": [
                        {
                          "id": "iepp9gj",
                          "text": "R.I.P. Cornell",
                          "timestamp": "2022-07-03 16:33:21",
                          "score": 46,
                          "num_children": 1,
                          "author": 384985,
                          "replies": [
                            {
                              "id": "ieqinjf",
                              "text": "No one sings like you anymore.",
                              "timestamp": "2022-07-03 20:06:09",
                              "score": 12,
                              "num_children": 0,
                              "author": 343725,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "iero4zh",
                          "text": "Also the most handsome Chris.",
                          "timestamp": "2022-07-04 01:42:43",
                          "score": 3,
                          "num_children": 0,
                          "author": 402234,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ieqjrku",
                      "text": "Oh yea. He’s very outspoken about his support for the LGBTQ+ community, gun control especially for his home state of Massachusetts, Roe v Wade, etc. He’s a legit stand up guy.",
                      "timestamp": "2022-07-03 20:14:20",
                      "score": 33,
                      "num_children": 1,
                      "author": 267215,
                      "replies": [
                        {
                          "id": "ieqqpgw",
                          "text": "Yep and whenever there’s something racist happening in the news, he is one of the first celebs to call it out. I love that guy. Beautiful inside and out.",
                          "timestamp": "2022-07-03 21:05:20",
                          "score": 22,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ieq0052",
                      "text": "Hemsworth seems pretty decent too",
                      "timestamp": "2022-07-03 17:49:04",
                      "score": 39,
                      "num_children": 0,
                      "author": 372064,
                      "replies": []
                    },
                    {
                      "id": "iepy180",
                      "text": "Thanks for that info, needed for balance",
                      "timestamp": "2022-07-03 17:34:57",
                      "score": 12,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iep14sc",
                  "text": "Isn't it?",
                  "timestamp": "2022-07-03 13:34:09",
                  "score": 19,
                  "num_children": 0,
                  "author": 115227,
                  "replies": []
                }
              ]
            },
            {
              "id": "iep608s",
              "text": "Wait…what’s the story with Pratt?",
              "timestamp": "2022-07-03 14:14:39",
              "score": 49,
              "num_children": 3,
              "author": 26776,
              "replies": [
                {
                  "id": "iepj0ep",
                  "text": "[removed]",
                  "timestamp": "2022-07-03 15:50:26",
                  "score": 178,
                  "num_children": 5,
                  "replies": [
                    {
                      "id": "ieptjkj",
                      "text": "jeez what a complete twat",
                      "timestamp": "2022-07-03 17:02:54",
                      "score": 52,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ierobqu",
                          "text": "He also supports gay conversion therapy.",
                          "timestamp": "2022-07-04 01:44:29",
                          "score": 11,
                          "num_children": 0,
                          "author": 402234,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iepypy4",
                      "text": "It’s okay bro. \n\nHe came out as totally not religious. \n\nI mean sure… there’s all the evidence and posts he’s made prior and all but…. Would he lie?",
                      "timestamp": "2022-07-03 17:39:53",
                      "score": 33,
                      "num_children": 2,
                      "author": 345249,
                      "replies": [
                        {
                          "id": "ieqolzw",
                          "text": "\"Im not really that religious/ political\" is right wing white guy speak for \"sharing my full opinion doesn't get me laid.\"",
                          "timestamp": "2022-07-03 20:49:50",
                          "score": 31,
                          "num_children": 0,
                          "author": 290476,
                          "replies": []
                        },
                        {
                          "id": "ieronwx",
                          "text": "\"I'm not religious. I just like Jesus.\"\n\nYeah, yeah douchebag. I'm not a meat eater. I just like hamburgers.",
                          "timestamp": "2022-07-04 01:47:38",
                          "score": 8,
                          "num_children": 0,
                          "author": 402234,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iepvown",
                      "text": "I remember another time where he posted about how he thought it was hilarious that he’d eaten all of his pregnant wife’s portion of a special meal before she had a chance to.  He seems like a total asshole.",
                      "timestamp": "2022-07-03 17:18:08",
                      "score": 36,
                      "num_children": 0,
                      "author": 398474,
                      "replies": []
                    },
                    {
                      "id": "ieuj57m",
                      "text": "Jeezus….here I am who liked him as an actor. I had no idea. Fuck him.",
                      "timestamp": "2022-07-04 18:28:18",
                      "score": 2,
                      "num_children": 0,
                      "author": 26776,
                      "replies": []
                    },
                    {
                      "id": "ieq47s7",
                      "text": "I just tried to look it up. He’s denying the church and said everyone took tweet the wrong way. Anyone have some fool proof evidence?",
                      "timestamp": "2022-07-03 18:19:38",
                      "score": 1,
                      "num_children": 1,
                      "author": 326270,
                      "replies": [
                        {
                          "id": "ieqtqf3",
                          "text": "Hmmm...that couldn't possibly have anything to do with the fact that he just had a new show released on Amazon Prime?",
                          "timestamp": "2022-07-03 21:28:02",
                          "score": 10,
                          "num_children": 0,
                          "author": 301657,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ieph0oj",
                  "text": "He wears Three Percenters merch. Canada considers them terrorists. \n\nhttps://thebrag.com/chris-pratt-seen-wearing-hat-supporting-white-supremacist-group-three-percenters/",
                  "timestamp": "2022-07-03 15:36:15",
                  "score": 90,
                  "num_children": 3,
                  "author": 232899,
                  "replies": [
                    {
                      "id": "iepk6st",
                      "text": "Three Percenters ARE terrorists.  And Chris Pratt is clearly a homophobic douchebag who hangs out with right-wing propagandists.\n\nThat said, the hat he's wearing that the article is saying is 3%'ers... [I don't think it is](https://en.wikipedia.org/wiki/United_States_Foreign_Service).  Looks like insignia of United States Foreign Service.\n\nThree Percenters logo is VERY similar - basically the same stars but with a big-ass [Roman numeral III inside the circle](https://en.wikipedia.org/wiki/United_States_Foreign_Service).  So maybe it's him trying to be scummy/clever?  Or maybe he's just wearing the logo of the United States Foreign Service because of his Netflix show.  Who knows.",
                      "timestamp": "2022-07-03 15:58:41",
                      "score": 81,
                      "num_children": 5,
                      "author": 187884,
                      "replies": [
                        {
                          "id": "ier6gf2",
                          "text": "His brother is a 3%er who sells merch. He supports them. It's not a misunderstanding.",
                          "timestamp": "2022-07-03 23:07:42",
                          "score": 15,
                          "num_children": 0,
                          "author": 138887,
                          "replies": []
                        },
                        {
                          "id": "iepstf8",
                          "text": "So fucking disappointed to learn this",
                          "timestamp": "2022-07-03 16:57:49",
                          "score": 11,
                          "num_children": 0,
                          "author": 365070,
                          "replies": []
                        },
                        {
                          "id": "ieqygkc",
                          "text": "Yeah, the hat is not clear. \n\nWhat is revealing though is everything that Pratt has done and associates with has put everyone in a position where we have to question his intentions. His actions have been gray enough that it certainly could be.",
                          "timestamp": "2022-07-03 22:03:45",
                          "score": 8,
                          "num_children": 0,
                          "author": 235771,
                          "replies": []
                        },
                        {
                          "id": "ier0ele",
                          "text": "Can’t find anything about a Chris Pratt project having to do with the US Foreign Service, which I’ve never even heard of. He doesn’t get the benefit of the doubt when his brother is an open 3%er and everything an A lister wears is deliberate.",
                          "timestamp": "2022-07-03 22:18:57",
                          "score": 4,
                          "num_children": 0,
                          "author": 67910,
                          "replies": []
                        },
                        {
                          "id": "ies4d73",
                          "text": "It’s a Betsy Ross hat. https://libertymaniacs.com/products/betsy-ross-dad-hat?variant=29408485081182&currency=USD&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic",
                          "timestamp": "2022-07-04 04:19:08",
                          "score": 1,
                          "num_children": 0,
                          "author": 184467,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iepija4",
                      "text": "Yeah this one is simply untrue as I understand it the hat doesn't hand the logo on the middle so so it's just a flag with stars in a circle like the American flag sewn up by betsy ross",
                      "timestamp": "2022-07-03 15:47:05",
                      "score": -11,
                      "num_children": 1,
                      "author": 90403,
                      "replies": [
                        {
                          "id": "iepjx61",
                          "text": "It's all about context. If it was tom hanks wearing this hat I would give him the benefit of the doubt, but this bastard is hanging out with rogane and going to extreme right wing churches.",
                          "timestamp": "2022-07-03 15:56:52",
                          "score": 31,
                          "num_children": 1,
                          "author": 232899,
                          "replies": [
                            {
                              "id": "iepmxmn",
                              "text": "Another piece of crucial context is that his brother is literally a 3 percenter.\n\n[https://nypost.com/2021/02/09/chris-pratts-brother-supports-far-right-group-report/](https://nypost.com/2021/02/09/chris-pratts-brother-supports-far-right-group-report/)\n\nIf you put the logo on the hat that his bro is wearing in this pic and the logo on the hat Chris was wearing together you get the full 3%ers logo...",
                              "timestamp": "2022-07-03 16:17:46",
                              "score": 25,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ier4ikz",
                      "text": "This article would have been better if there was evidence that the hat was actually 3%er merch.",
                      "timestamp": "2022-07-03 22:51:48",
                      "score": 0,
                      "num_children": 0,
                      "author": 68813,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iepbqdy",
                  "text": "Last I heard, he and his wife **(edit: apparently not the actress I thought)** refused to speak against their church for the homophobic actions of said church. So Chris Pratt wasn't directly accused of homophobic actions, just implicit support. Of course, that was a while ago and that may have changed by now.",
                  "timestamp": "2022-07-03 14:57:37",
                  "score": 20,
                  "num_children": 3,
                  "author": 310549,
                  "replies": [
                    {
                      "id": "iepch0g",
                      "text": "He divorced her and married Arnold Schwarzenegger's daughter. He's been in the spotlight quite a bit lately for a his dipshittery. It's sad, really, I liked him on P&R.",
                      "timestamp": "2022-07-03 15:03:08",
                      "score": 67,
                      "num_children": 0,
                      "author": 388457,
                      "replies": []
                    },
                    {
                      "id": "iepckz3",
                      "text": "Anna Faris isn't married to him anymore and also isn't religious. It's his current wife who is religious and goes to the same church which has homophobic links.",
                      "timestamp": "2022-07-03 15:03:57",
                      "score": 67,
                      "num_children": 0,
                      "author": 78498,
                      "replies": []
                    },
                    {
                      "id": "iepdivl",
                      "text": "Remove Anna Faris from that and your story is correct. Anna and Chris got divorced and Chris has been married to Arnold Schwarzeneggers daughter. Anna has been very open about her relationship with Chris, and Anna seems to me to be innocent in all this, Chris did her dirty",
                      "timestamp": "2022-07-03 15:11:06",
                      "score": 43,
                      "num_children": 1,
                      "author": 351863,
                      "replies": [
                        {
                          "id": "iepvelh",
                          "text": "Yeah didn't he cheat on her with Jennifer Lawrence which triggered the divorce?",
                          "timestamp": "2022-07-03 17:16:04",
                          "score": 14,
                          "num_children": 0,
                          "author": 118145,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "iepcxik",
              "text": "Chris Pratt-part of a hateful religion",
              "timestamp": "2022-07-03 15:06:36",
              "score": 17,
              "num_children": 0,
              "author": 374250,
              "replies": []
            },
            {
              "id": "iep0t5u",
              "text": "Neither of them are aging well.",
              "timestamp": "2022-07-03 13:31:15",
              "score": 30,
              "num_children": 0,
              "author": 328367,
              "replies": []
            },
            {
              "id": "iep8lqy",
              "text": "Is there any basis on this? I've never heard him say anything or had any comments attributed to him.",
              "timestamp": "2022-07-03 14:34:33",
              "score": 10,
              "num_children": 1,
              "replies": [
                {
                  "id": "iepsofy",
                  "text": "You supposed to jump on the karma train and not ask questions",
                  "timestamp": "2022-07-03 16:56:51",
                  "score": -9,
                  "num_children": 0,
                  "author": 275033,
                  "replies": []
                }
              ]
            },
            {
              "id": "iep7203",
              "text": "Is there any evidence that he's homophobic? Any actions or comments that would lead somebody to believe he's homophobic? Or does he just go to a church, and people assume he must agree with every comment past and present made by the pastor at that church?",
              "timestamp": "2022-07-03 14:22:45",
              "score": 13,
              "num_children": 3,
              "author": 172737,
              "replies": [
                {
                  "id": "iepyzz5",
                  "text": "I mean if you go to church at all, and the church isn't explicitly inclusive of gays, I assume you're homophobic tbh. If you think that's unfair, have a look at the catechism of the Catholic Church or any major protestant branch and see what they have to say about homosexuality.\n\nSo given that his church is *outspoken* about the anti-LGBT agenda, I don't see why it's unfair to criticize someone who patronizes that church.",
                  "timestamp": "2022-07-03 17:41:51",
                  "score": 12,
                  "num_children": 0,
                  "author": 279088,
                  "replies": []
                },
                {
                  "id": "iep8yca",
                  "text": "Even if that is the case, Pratt wears three per center shit. \n\nThis dude is telling the world who he is and folks don’t want to hear it because they don’t want Star Lord/Andy to be into Christian fascism but he is super into it and signaling it loudly",
                  "timestamp": "2022-07-03 14:37:07",
                  "score": 80,
                  "num_children": 1,
                  "author": 286078,
                  "replies": [
                    {
                      "id": "iepape4",
                      "text": "By \"signaling it loudly\" you mean \"wore a hat once\"? Is everybody who's ever worn a Che Guevara T-shirt a committed and active communist revolutionary?\n\nEdit: Come on folks, I don't think it's unreasonable to expect that if Chris Pratt were as homophobic or fascist as claimed here that it should be possible to find a quote of him saying things that are homophobic or fascist.",
                      "timestamp": "2022-07-03 14:50:06",
                      "score": -59,
                      "num_children": 2,
                      "author": 172737,
                      "replies": [
                        {
                          "id": "iepdpzr",
                          "text": "The problem is whenever anyone asks him to denounce his homophobia his church preaches, he doesn't. \n\nWhile he's not saying it out loud he's not denying it either.",
                          "timestamp": "2022-07-03 15:12:37",
                          "score": 34,
                          "num_children": 2,
                          "author": 376464,
                          "replies": [
                            {
                              "id": "iepvkea",
                              "text": "Also marvel does a lot of blm and pride stuff and he's always mysteriously absent from those events",
                              "timestamp": "2022-07-03 17:17:14",
                              "score": 18,
                              "num_children": 0,
                              "author": 118145,
                              "replies": []
                            },
                            {
                              "id": "iepfsro",
                              "text": "This is Hillsong Church, with its terrible conversion therapies and such? Just this week, he has been interviewed in Men's Health and says he has never been, nor associated, with Hillsong. His church does not seem to preach homophobia. The worst I can see is that his pastor was involved in producing a movie that conflates homosexuality with poor lifestyle choices. But there's no record of anti-LGBT preaching at Zoe Church that I can find. When asked in this interview why he didn't speak out at the time, he says it's because he didn't want to punch down on a different church he didn't know enough about.",
                              "timestamp": "2022-07-03 15:27:30",
                              "score": 3,
                              "num_children": 0,
                              "author": 172737,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "iepftif",
                          "text": "You don’t just accidentally wear the symbol of a fringe right-wing militia group. It’s not like they sell the merch at the local gas station next to the cheap sunglasses and tourist swag.",
                          "timestamp": "2022-07-03 15:27:39",
                          "score": 31,
                          "num_children": 1,
                          "author": 31004,
                          "replies": [
                            {
                              "id": "iepgztd",
                              "text": "His brother is (or was) a member of the group. The brother has been criticized, and seems to have lost his job recently because of that relationship. If the brother had access to the group then it seems reasonable to me that Chris might have borrowed a hat from his brother at one point without knowing where it was from, or perhaps hearing an overview about it being a group for freedom and resistance to tyranny and gun rights, without being aware of the other policies. Those ideologies (even without the threat of violence) are scary and strange to me and I would never support them. But I'm not a native American,and I was never brought up with the idea that freedom is the greatest goal of humanity and all governments can turn tyrannical at the drop of a hat. Chris is American, and so having common American beliefs (like being brought up Christian, or believing people have the right to have guns) doesn't seem very strange to me.",
                              "timestamp": "2022-07-03 15:36:04",
                              "score": -16,
                              "num_children": 1,
                              "author": 172737,
                              "replies": [
                                {
                                  "id": "iephof0",
                                  "text": "I harbor absolutely zero belief that his brother never talked about it and that Chris was naive to the meaning of the symbol.\n\nIt’s possible, of course, but very improbable.",
                                  "timestamp": "2022-07-03 15:40:59",
                                  "score": 24,
                                  "num_children": 0,
                                  "author": 31004,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iepioio",
                  "text": "I mean, there are thousands upon thousands of churches. If you weren't homophobic, you'd go to a church that isn't homophobia. Simple as that.",
                  "timestamp": "2022-07-03 15:48:07",
                  "score": 22,
                  "num_children": 1,
                  "author": 170149,
                  "replies": [
                    {
                      "id": "iepmc38",
                      "text": "And there isn't evidence that Zoe Church, the one that Pratt goes to, is homophobic, so far as I can see online. The most damning evidence that Twitter has come up with appears to be that the pastor was involved in producing a film that clumsily conflated being homosexual with various poor lifestyle choices.\n\nPratt does not go to Hillsong, which is the church that people believe he goes to and which is a church that has preached some homophobic things and has had \"conversion therapy.\"",
                      "timestamp": "2022-07-03 16:13:30",
                      "score": -3,
                      "num_children": 1,
                      "author": 172737,
                      "replies": [
                        {
                          "id": "ieq0q2g",
                          "text": "Did you look up anything on Zoe Church's found, Chad Veach?",
                          "timestamp": "2022-07-03 17:54:18",
                          "score": 4,
                          "num_children": 1,
                          "author": 170149,
                          "replies": [
                            {
                              "id": "ier4y7w",
                              "text": "What are you referring to? He produced a film that seems pretty careless and insensitive. But I've still not seen anything that directly says he's homophobic, or that he preaches homophobia. Every attempt to find out about him links, again, to Hillsong, which has preached and performed terribly homophobic things, not to Zoe Church.",
                              "timestamp": "2022-07-03 22:55:21",
                              "score": 2,
                              "num_children": 0,
                              "author": 172737,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "iergyxs",
              "text": "What has he done that's homophobic?",
              "timestamp": "2022-07-04 00:37:56",
              "score": 1,
              "num_children": 0,
              "author": 340833,
              "replies": []
            },
            {
              "id": "iep6fg6",
              "text": "What has he done that shows he's homophobic? All I can find is allegations that he belongs to a certain church with some (borderline) unaccepting stuff, but nothing that says that Pratt holds those beliefs and the head of that particular church says Pratt doesn't even go there.  Looks like this \"homophobic\" insult is pretty baseless and only an attack on his Christian faith, which isn't fair as Christianity is not a monolith, as weird as that sounds",
              "timestamp": "2022-07-03 14:17:58",
              "score": -31,
              "num_children": 2,
              "author": 296657,
              "replies": [
                {
                  "id": "iep6ke9",
                  "text": "Supporting homophobic institutions is homophobic",
                  "timestamp": "2022-07-03 14:19:02",
                  "score": 64,
                  "num_children": 2,
                  "author": 110769,
                  "replies": [
                    {
                      "id": "iepjslg",
                      "text": "\\>\"Religion has been oppressive as fuck for a long time\" - Chris Pratt, June 2022\n\nYou need to update your view of things.  I think Pratt is on the progressive side of Christianity, the side that advocates love and acceptance and disavows the hate and bigotry that polluted the church.  Some modern Christians simply believe that a loving God sent a part of themself to Earth as both an example of how to live and as a means for the rest of us to attain a boundlessly blissful afterlife in harmony with everyone else who acted decently.  Many modern Christians march in the same marches you want to be a part of.",
                      "timestamp": "2022-07-03 15:55:59",
                      "score": -10,
                      "num_children": 1,
                      "author": 296657,
                      "replies": [
                        {
                          "id": "iepzh0q",
                          "text": "> the hate and bigotry that polluted the church.\n\nThere was a time when mainstream christianity was super accepting of gays and abortions? When?",
                          "timestamp": "2022-07-03 17:45:15",
                          "score": 6,
                          "num_children": 1,
                          "author": 279088,
                          "replies": [
                            {
                              "id": "ieqrfwv",
                              "text": "Literally right now lol.  The three major branches of Christianity (Catholocism, Protestantism, Orthodoxy) are all majority pro gay rights.  Evangelicals appear to be lacking (they're the ones skewing your perception of the world), but Pratt falls into Modern Protestantism which is majority pro.\n\n[https://www.pewresearch.org/religion/religious-landscape-study/views-about-same-sex-marriage/](https://www.pewresearch.org/religion/religious-landscape-study/views-about-same-sex-marriage/)",
                              "timestamp": "2022-07-03 21:10:49",
                              "score": -3,
                              "num_children": 1,
                              "author": 296657,
                              "replies": [
                                {
                                  "id": "ieqziqc",
                                  "text": "You're describing the opinions of the adherents, not the stance of their churches.",
                                  "timestamp": "2022-07-03 22:11:57",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 279088,
                                  "replies": [
                                    {
                                      "id": "ier596f",
                                      "text": "I still disagree with your premise and await data that shows that \"their churches\" are homophobic.  Stick to Mainstream Protestantism if you can.  Evangelicals are a branch of their own these days.",
                                      "timestamp": "2022-07-03 22:57:53",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 296657,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iep7nc5",
                      "text": "True, but as far as I can tell, Pratt doesn’t seem to be anywhere near the same level as Joe Rogan.",
                      "timestamp": "2022-07-03 14:27:17",
                      "score": -25,
                      "num_children": 2,
                      "author": 193507,
                      "replies": [
                        {
                          "id": "iepec5q",
                          "text": "And? Anyone tolerant of alt right bullshit is terrible",
                          "timestamp": "2022-07-03 15:16:58",
                          "score": 19,
                          "num_children": 0,
                          "author": 110769,
                          "replies": []
                        },
                        {
                          "id": "iep9vtf",
                          "text": "That's true. Doesn't mean Pratt doesn't suck.",
                          "timestamp": "2022-07-03 14:44:07",
                          "score": 25,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iepbdiu",
                  "text": ">an attack on his Christian faith, which isn't fair as Christianity is not a monolith\n\nChristianity doesn't have to be a monolith for it to be an explicitly homophobic institution. Can't believe people don't see this. Even churches that are \"tolerant\" don't disavow the homophobia in the scripture, they're just dishonest or quiet about their homophobia.",
                  "timestamp": "2022-07-03 14:55:01",
                  "score": 14,
                  "num_children": 2,
                  "author": 46629,
                  "replies": [
                    {
                      "id": "iepdxoi",
                      "text": "[These people](https://www.gaychurch.org/) seem to disavow homophobia in the scripture.",
                      "timestamp": "2022-07-03 15:14:09",
                      "score": 6,
                      "num_children": 1,
                      "author": 172737,
                      "replies": [
                        {
                          "id": "iepoted",
                          "text": "Hmm, neat. They definitely at least deviate from the standard interpretation of homosexuality being sinful, but who's to say that's not really Christianity, certainly not me.\n\nGood for them.",
                          "timestamp": "2022-07-03 16:30:23",
                          "score": 1,
                          "num_children": 0,
                          "author": 46629,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iepg7aa",
                      "text": "This is very untrue. The Evangelical Lutheran Church and the Episcopal Church here in the United States are both very LGBTQ+ affirming, and often participate in pride events. I believe United Methodists are also affirming now, as well as the United Church of Christ. There are a lot more affirming Christians than people thing. It's just that the hateful homophobic Christians tend to be very loud and get more attention.",
                      "timestamp": "2022-07-03 15:30:24",
                      "score": 8,
                      "num_children": 1,
                      "author": 289799,
                      "replies": [
                        {
                          "id": "ieppedr",
                          "text": "So they openly, unambiguously say homosexuality is not a sin. That's the bar, clearly, whether or not their institution is homophobic is whether they do or don't consider homosexuality to be wrong.\n\nSome do but I assume they're in the minority and that the vast majority of Christian denominations and practice don't actually deviate from the standard interpretation that homosexuality is sinful.",
                          "timestamp": "2022-07-03 16:34:15",
                          "score": 2,
                          "num_children": 0,
                          "author": 46629,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "iepx7cj",
              "text": "How is he homophobic? Haven’t heard anything",
              "timestamp": "2022-07-03 17:29:00",
              "score": -3,
              "num_children": 0,
              "author": 149778,
              "replies": []
            },
            {
              "id": "iepzo83",
              "text": "Is it really? He looked familiar but I don't think that looks like Chris Pratt at all. The guy from Parks and Rec??",
              "timestamp": "2022-07-03 17:46:39",
              "score": -1,
              "num_children": 0,
              "author": 65021,
              "replies": []
            },
            {
              "id": "iep43l9",
              "text": "Really? Doesn't look like him to me",
              "timestamp": "2022-07-03 13:59:35",
              "score": -14,
              "num_children": 0,
              "author": 224168,
              "replies": []
            },
            {
              "id": "ies98oc",
              "text": "Proof of him being a homophobe? Confused",
              "timestamp": "2022-07-04 05:12:00",
              "score": 1,
              "num_children": 0,
              "author": 30676,
              "replies": []
            },
            {
              "id": "ier7rth",
              "text": "Source? I want to read this",
              "timestamp": "2022-07-03 23:18:35",
              "score": 0,
              "num_children": 0,
              "author": 194876,
              "replies": []
            }
          ]
        },
        {
          "id": "iepfb8r",
          "text": "It's Chrisp Ratt",
          "timestamp": "2022-07-03 15:24:00",
          "score": 7,
          "num_children": 0,
          "author": 303730,
          "replies": []
        }
      ]
    },
    {
      "id": "iep3tzg",
      "text": "I saw Rogan at the State Theater in Detroit years ago. He was funny & didn’t talk about any of that shit. The pandemic hit & he turned into an idiot. Now I can’t stand him.",
      "timestamp": "2022-07-03 13:57:22",
      "score": 548,
      "num_children": 8,
      "author": 266463,
      "replies": [
        {
          "id": "iep556y",
          "text": "i wonder how much of his current schtick is \"I need to get paid\"  like all the other failed actors who are now rw idiots like dennis miller for example. Former liberal that got old and outdated is suddenly rw on fox news \n*edited for spelling",
          "timestamp": "2022-07-03 14:08:00",
          "score": 156,
          "num_children": 3,
          "author": 122411,
          "replies": [
            {
              "id": "iep5e1e",
              "text": "Randy Quaid & James Woods are perfect examples. Their careers circling the drain so being Twitter RW loudmouths keeps them relevant.",
              "timestamp": "2022-07-03 14:09:52",
              "score": 115,
              "num_children": 4,
              "author": 266463,
              "replies": [
                {
                  "id": "iep6369",
                  "text": "*cough* Scott Baio *cough*  lol so many of these has beens show up as hard right",
                  "timestamp": "2022-07-03 14:15:18",
                  "score": 81,
                  "num_children": 1,
                  "author": 122411,
                  "replies": [
                    {
                      "id": "iepelnr",
                      "text": "Dean Cain and Antonio Sabato Jr. also.\n\nThey couldn't coast on their looks anymore so they went the hateful idiot route to get attention.",
                      "timestamp": "2022-07-03 15:18:51",
                      "score": 47,
                      "num_children": 2,
                      "author": 41187,
                      "replies": [
                        {
                          "id": "iepfgto",
                          "text": "Kevin Sorbo",
                          "timestamp": "2022-07-03 15:25:06",
                          "score": 50,
                          "num_children": 2,
                          "author": 330082,
                          "replies": [
                            {
                              "id": "ieprkoh",
                              "text": "My god, it's the whos who of has-beens.",
                              "timestamp": "2022-07-03 16:49:08",
                              "score": 26,
                              "num_children": 1,
                              "author": 395550,
                              "replies": [
                                {
                                  "id": "ieps07u",
                                  "text": "Spent all their money on bad plastic surgery and hair implants and now they have to make a living being weirdo's spewing nonsense to brain damaged Republicans.",
                                  "timestamp": "2022-07-03 16:52:08",
                                  "score": 14,
                                  "num_children": 0,
                                  "author": 330082,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "iepvh1t",
                              "text": "Jim Breuer as well.",
                              "timestamp": "2022-07-03 17:16:33",
                              "score": 16,
                              "num_children": 1,
                              "author": 151139,
                              "replies": [
                                {
                                  "id": "iepx997",
                                  "text": "Jim Breuer had to have either slept his way or blackmailed his way to SNL, because good lord he has never once done anything funny.",
                                  "timestamp": "2022-07-03 17:29:23",
                                  "score": 12,
                                  "num_children": 2,
                                  "author": 253002,
                                  "replies": [
                                    {
                                      "id": "ieq02yt",
                                      "text": "Half baked",
                                      "timestamp": "2022-07-03 17:49:38",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 132051,
                                      "replies": [
                                        {
                                          "id": "ieq21jj",
                                          "text": "Is awful.",
                                          "timestamp": "2022-07-03 18:03:46",
                                          "score": -5,
                                          "num_children": 0,
                                          "author": 253002,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "ieqig4l",
                                      "text": "Goat boy?",
                                      "timestamp": "2022-07-03 20:04:39",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 382566,
                                      "replies": [
                                        {
                                          "id": "ierqc1u",
                                          "text": "No",
                                          "timestamp": "2022-07-04 02:02:54",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 173037,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ieq4pg3",
                          "text": "Ricky Schroeder",
                          "timestamp": "2022-07-03 18:23:10",
                          "score": 7,
                          "num_children": 0,
                          "author": 17169,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iepo0tv",
                  "text": "James Woods has always, always, ALWAYS been a twat. That's why those roles come so easily to him.",
                  "timestamp": "2022-07-03 16:25:10",
                  "score": 42,
                  "num_children": 2,
                  "author": 5026,
                  "replies": [
                    {
                      "id": "ieptcgz",
                      "text": "i know james woods is a dick cus in family guy hes a massive piece of shit",
                      "timestamp": "2022-07-03 17:01:29",
                      "score": 15,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "ieq5cbo",
                      "text": "I still don't know how Woods has a career because he's never been good at acting.",
                      "timestamp": "2022-07-03 18:27:50",
                      "score": 2,
                      "num_children": 2,
                      "author": 404389,
                      "replies": [
                        {
                          "id": "ieq5whk",
                          "text": "He doesn't have much of one anymore because nobody wants to work with him",
                          "timestamp": "2022-07-03 18:31:56",
                          "score": 5,
                          "num_children": 0,
                          "author": 5026,
                          "replies": []
                        },
                        {
                          "id": "ieqcrl1",
                          "text": "That's not actually true.  Three movies I can think of at the top of my head in which he was excellent are Joshua Then and Now, Salvador, and Citizen Cohn.  His skills have certainly eroded, but that in no way means that they weren't once there.",
                          "timestamp": "2022-07-03 19:22:13",
                          "score": 3,
                          "num_children": 1,
                          "author": 223408,
                          "replies": [
                            {
                              "id": "iescbo8",
                              "text": "And Hercules",
                              "timestamp": "2022-07-04 05:47:26",
                              "score": 1,
                              "num_children": 0,
                              "author": 24055,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iepgbu4",
                  "text": "Lots of people who made their money in the 80’s and 90’s are now finding out that in this current economy they are running out of money, there are quite a few bands from that era suddenly back from their hiatus making new albums, getting out in the public eye and touring wherever they can. \n\nSaw Duran Duran the other week, pretty fucking neat.",
                  "timestamp": "2022-07-03 15:31:19",
                  "score": 25,
                  "num_children": 1,
                  "author": 38046,
                  "replies": [
                    {
                      "id": "ieposuf",
                      "text": "were they hungry like the...well...yaknow ;P I dont mind bands coming back. Even those who never really left like Gary Numan. Hes pretty much been non stop since the 70s I think",
                      "timestamp": "2022-07-03 16:30:17",
                      "score": 7,
                      "num_children": 1,
                      "author": 122411,
                      "replies": [
                        {
                          "id": "iepxf1z",
                          "text": "This gets posted on Reddit too much, but Gary Numan is older than Gary Oldman. That makes me inexplicably happy.",
                          "timestamp": "2022-07-03 17:30:31",
                          "score": 10,
                          "num_children": 0,
                          "author": 241846,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iepu0te",
                  "text": "Ehh Randy has lost his marbles years ago, left wing or right wing is irrelevant because I dont think he has full control of his actions",
                  "timestamp": "2022-07-03 17:06:13",
                  "score": 12,
                  "num_children": 1,
                  "author": 3487,
                  "replies": [
                    {
                      "id": "ieq35p1",
                      "text": "Those aliens really screwed him up.",
                      "timestamp": "2022-07-03 18:11:54",
                      "score": 12,
                      "num_children": 0,
                      "author": 257594,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iepzu8t",
              "text": "Dennis Miller was always political comedian leaning right since the 80s.  He was like a right wing Bill Maher.  It’s just that “right wing” has changed so much over time",
              "timestamp": "2022-07-03 17:47:54",
              "score": 14,
              "num_children": 2,
              "author": 132051,
              "replies": [
                {
                  "id": "ieqcou8",
                  "text": "The funny part is nowadays they're both a right wing Bill Maher.",
                  "timestamp": "2022-07-03 19:21:39",
                  "score": 18,
                  "num_children": 1,
                  "author": 80606,
                  "replies": [
                    {
                      "id": "ier4pc3",
                      "text": "Bill Maher is only right wing if the only thing you've ever heard from him is from a 14 year old's twitter post taking him out of context.",
                      "timestamp": "2022-07-03 22:53:20",
                      "score": -6,
                      "num_children": 1,
                      "author": 68813,
                      "replies": [
                        {
                          "id": "ierap0y",
                          "text": "Well, I've heard dumber opinions. So you've got that going for you.",
                          "timestamp": "2022-07-03 23:43:08",
                          "score": 5,
                          "num_children": 0,
                          "author": 80606,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ieqk48h",
                  "text": "I remember seeing stuff of his from the 80s or the 90s where he was more liberal. He was constantly going after Reagan and Gingrich. \n\nEven if he already had some conservative views, he went way off the deep end in the 2000s.",
                  "timestamp": "2022-07-03 20:16:59",
                  "score": 1,
                  "num_children": 0,
                  "author": 210577,
                  "replies": []
                }
              ]
            },
            {
              "id": "ieqtsyl",
              "text": "I think Dennis Miller has always been a right wing hack. At least since the mid aughts",
              "timestamp": "2022-07-03 21:28:33",
              "score": 4,
              "num_children": 1,
              "author": 75798,
              "replies": [
                {
                  "id": "iequ1cn",
                  "text": "In the 80s he was pretty liberal on SNL  and his stand up then . By his own admission he was liberal until 9/11",
                  "timestamp": "2022-07-03 21:30:20",
                  "score": 5,
                  "num_children": 0,
                  "author": 122411,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iepcvd7",
          "text": "This started way before the pandemic. He's been platforming fascists, white nationalists, conspiracy theorists, race scientists, and all manner of woo peddlers and hateful bigots for years at this point.",
          "timestamp": "2022-07-03 15:06:09",
          "score": 334,
          "num_children": 2,
          "author": 232365,
          "replies": [
            {
              "id": "iepdop0",
              "text": "He didn’t mention any of that stuff during his stand up. He knew the audience was more liberal comedy lovers. We don’t wanna pay $80 & hear that shit.\n\nSo it just goes to show he selectively chooses his content based on his audience. So he’s just an opportunist chameleon grifter.",
              "timestamp": "2022-07-03 15:12:21",
              "score": 121,
              "num_children": 5,
              "author": 266463,
              "replies": [
                {
                  "id": "iepg20u",
                  "text": "We'd all be better off if he just kept making people eat spiders.",
                  "timestamp": "2022-07-03 15:29:21",
                  "score": 83,
                  "num_children": 1,
                  "author": 232365,
                  "replies": [
                    {
                      "id": "iepit4z",
                      "text": "Totally. I remember fear factor when he would scream at those people to eat elk penises & cover themselves in scorpions. ‘Do it Jenny! You’re almost there! Just a couple more elk penises!’",
                      "timestamp": "2022-07-03 15:49:01",
                      "score": 41,
                      "num_children": 0,
                      "author": 266463,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iepslpm",
                  "text": ">  So he’s just an opportunist chameleon grifter.\n\nNah man, he's just another conservative snowflake who only feels safe saying what he actually feels on his own show surrounded by enablers.",
                  "timestamp": "2022-07-03 16:56:19",
                  "score": 31,
                  "num_children": 0,
                  "author": 138887,
                  "replies": []
                },
                {
                  "id": "ieqi8cv",
                  "text": "Same here when I went to his standup at MSG. No talk of politics thank god but his standup was pretty good. Didn’t even know he did standup.",
                  "timestamp": "2022-07-03 20:03:02",
                  "score": 5,
                  "num_children": 0,
                  "author": 40067,
                  "replies": []
                },
                {
                  "id": "iepvjg9",
                  "text": "Huh an apt description of politicians as well, hmmm...",
                  "timestamp": "2022-07-03 17:17:02",
                  "score": -6,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "iepysn0",
                  "text": "Being the devils advocate here, isn’t that the exact same description of a normal “content creator”?",
                  "timestamp": "2022-07-03 17:40:24",
                  "score": -13,
                  "num_children": 1,
                  "author": 214771,
                  "replies": [
                    {
                      "id": "iepzh2l",
                      "text": "His content is pretty dangerous. He caught COVID & took that Invectermin shit (allegedly) & said he got better. He’s like Alex Jones. He doesn’t care who he puts in danger.",
                      "timestamp": "2022-07-03 17:45:15",
                      "score": 9,
                      "num_children": 0,
                      "author": 266463,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iesk33b",
              "text": "The biggest ‘woo peddler’ that he gave a platform to was Bernie Sanders",
              "timestamp": "2022-07-04 07:25:39",
              "score": -1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "iep6b4u",
          "text": "He’s super influenced by peer pressure. Not very thoughtful or critical. When Covid hit and he was locked away with his security team, and interviewing people who had “alternate takes” he fell into the trap of right wing identity politics. MUH FREEDUM. ONLY ASKING QUESTIONS. POLITICAL CORRECTNESS IS WORSE THAN RACISM.",
          "timestamp": "2022-07-03 14:17:01",
          "score": 75,
          "num_children": 3,
          "author": 354179,
          "replies": [
            {
              "id": "iep6m7m",
              "text": "calling a spade a spade by being as racist as possible",
              "timestamp": "2022-07-03 14:19:26",
              "score": 21,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ier3ey5",
              "text": ">POLITICAL CORRECTNESS IS WORSE THAN RACISM.\n\nSeems like a lot of comedians lean this way because of all the disproportionate amount of crap they get about their jokes.",
              "timestamp": "2022-07-03 22:42:57",
              "score": 3,
              "num_children": 0,
              "author": 162935,
              "replies": []
            },
            {
              "id": "ieppddg",
              "text": "I initially agreed with Rogan when all he had to complain about was that comedians were getting banned from college campuses over political correctness. He took a much harder right turn into conspiracy land during covid though. He now claims he's still \"open-minded\" yet regularly books Q-Anon level fringe guests on his podcasts and never challenges them on their crazy conspiracies. I stopped listening to him years ago.",
              "timestamp": "2022-07-03 16:34:04",
              "score": 6,
              "num_children": 1,
              "author": 269495,
              "replies": [
                {
                  "id": "ieq292d",
                  "text": "For many years in his life, way before his talk show, Joe Rogan believed the moon landing hoax :/",
                  "timestamp": "2022-07-03 18:05:15",
                  "score": 11,
                  "num_children": 1,
                  "author": 154998,
                  "replies": [
                    {
                      "id": "ierl8cc",
                      "text": "That's what I came to say - he was a Moon Landing denier, as a grown-ass adult man, not a stoned teenager. \n\nHe can be entertaining for a while, then he says something that lets you know his brain is a little haywire.",
                      "timestamp": "2022-07-04 01:16:17",
                      "score": 4,
                      "num_children": 0,
                      "author": 102847,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iepezhh",
          "text": "I listened to almost every podcast of his until around 1000 episodes, it changed from stoner entertainment to an absolute idiot having a steady stream of con men, grifters and alt-right gatekeepers.",
          "timestamp": "2022-07-03 15:21:37",
          "score": 50,
          "num_children": 3,
          "author": 406521,
          "replies": [
            {
              "id": "iepim0r",
              "text": "That sucks. He was a decent comedian. His endless search for fringe content makes right wing lunacy a gold mine & he got all caught up. He’s one inch away from becoming Alex Jones.",
              "timestamp": "2022-07-03 15:47:37",
              "score": 17,
              "num_children": 2,
              "author": 266463,
              "replies": [
                {
                  "id": "ieplnkr",
                  "text": "The red flags were there, with Alex Jones being a friend of his and someone he’d banter about. Meanwhile, Alex Jones was bullying traumatized & bereaved parents. Good company you keep, Joe. \nI saw him do standup years ago, also. I laughed a lot, he was funny. Now he’s pathetic.",
                  "timestamp": "2022-07-03 16:08:44",
                  "score": 29,
                  "num_children": 1,
                  "author": 406521,
                  "replies": [
                    {
                      "id": "ieq52dp",
                      "text": "Yeah, you can tell who someone truly is by the company they keep.\n\nFor instance, people starting to realise what a horrendous POS Johnny Depp is because his best friend is Marilyn Manson (who's taking the Depp method of suing his abuse victim for defamation), plus his noted friendships with Allan Ginsbourg (confirmed pedophile), Hunter S. Thompson (abusive shithead who once wrote that \"women claim they don't want to be raped but deep down, they desire it more than anything\"), Roman Polanski (who raped a child and fled to Europe to escape justice) and others.",
                      "timestamp": "2022-07-03 18:25:49",
                      "score": -4,
                      "num_children": 0,
                      "author": 404389,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ier0yrs",
                  "text": "Fr when he has actual scientists and even abit more fringe scientists whose claims aren’t mainstream but still have some credence  like Randall or Hancock it’s fine to be a bit conspiratorial but then he gets guests like Jordan Peterson or Ben Shapiro who not only have warped world views but spout the same garbage the whole right wing media does it’s like they’re all lemmings just jumping off the cliff cause they’ll have no views if they differ from their peers",
                  "timestamp": "2022-07-03 22:23:24",
                  "score": 5,
                  "num_children": 1,
                  "author": 96276,
                  "replies": [
                    {
                      "id": "ier0zpv",
                      "text": "I saw that you mentioned Ben Shapiro. In case some of you don't know, Ben Shapiro is a grifter and a hack. If you find anything he's said compelling, you should keep in mind he also says things like this:\n\n>If you believe that the Jewish state has a right to exist, then you must allow Israel to transfer the Palestinians and the Israeli-Arabs from Judea, Samaria, Gaza and Israel proper. It’s an ugly solution, but it is the only solution… It’s time to stop being squeamish.\n\n\n*****\n\n^(I'm a bot. My purpose is to counteract online radicalization. You can summon me by tagging thebenshapirobot. Options: novel, history, dumb takes, feminism, etc.)\n\n\n\n[^More ^About ^Ben ](https://np.reddit.com/r/AuthoritarianMoment/wiki/index) ^| [^Feedback ^& ^Discussion: ^r/AuthoritarianMoment ](https://np.reddit.com/r/AuthoritarianMoment) ^| [^Opt ^Out ](https://np.reddit.com/r/AuthoritarianMoment/comments/olk6r2/click_here_to_optout_of_uthebenshapirobot/)",
                      "timestamp": "2022-07-03 22:23:37",
                      "score": 8,
                      "num_children": 1,
                      "author": 280326,
                      "replies": [
                        {
                          "id": "ier1rba",
                          "text": "Good bot",
                          "timestamp": "2022-07-03 22:29:46",
                          "score": 3,
                          "num_children": 1,
                          "author": 96276,
                          "replies": [
                            {
                              "id": "ier27r6",
                              "text": "Thank you for your logic and reason.\n\n\n*****\n\n^(I'm a bot. My purpose is to counteract online radicalization. You can summon me by tagging thebenshapirobot. Options: covid, civil rights, healthcare, feminism, etc.)\n\n\n\n[^More ^About ^Ben ](https://np.reddit.com/r/AuthoritarianMoment/wiki/index) ^| [^Feedback ^& ^Discussion: ^r/AuthoritarianMoment ](https://np.reddit.com/r/AuthoritarianMoment) ^| [^Opt ^Out ](https://np.reddit.com/r/AuthoritarianMoment/comments/olk6r2/click_here_to_optout_of_uthebenshapirobot/)",
                              "timestamp": "2022-07-03 22:33:21",
                              "score": 4,
                              "num_children": 0,
                              "author": 280326,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ieq7z8i",
              "text": "Same. I miss the Vimeo days or JRE. Fucking blue cheese on wings or go fuck yourself days",
              "timestamp": "2022-07-03 18:47:07",
              "score": 3,
              "num_children": 2,
              "author": 243703,
              "replies": [
                {
                  "id": "ieqa5mf",
                  "text": "Omg BLUE CHEESE WITH WINGS!!!! Those were formative podcasts for me, can’t stand what happened.",
                  "timestamp": "2022-07-03 19:03:01",
                  "score": 2,
                  "num_children": 0,
                  "author": 406521,
                  "replies": []
                },
                {
                  "id": "ieqla4z",
                  "text": "[deleted]",
                  "timestamp": "2022-07-03 20:25:34",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ieqljpb",
                      "text": "Fuck yeah man. Mushroom pods with Stanhope. Shit ruled.",
                      "timestamp": "2022-07-03 20:27:32",
                      "score": 1,
                      "num_children": 0,
                      "author": 243703,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ierlrvd",
              "text": "The only fun one's now are Duncan Trussell cause he somehow manages to bring out the last piece of goodness that's left in Joe, Bill Burr cause he has no problem calling him on his shit, and Shane Gillis and Mark Normand. \n\nLast episode with Mark, Shane and Ari was hilarious as long they were cracking jokes. Too bad Joe didn't get half of them and the other half got a fake **aaaaaaaahaha** or, when they were looking at a meme of Trump, Joe getting all serious\n\n\"How come it's okay to fat-shame Trump?? That's really interesting\". \n\nAnd remember, don't joke about Don Jr. doing coke cause he \"might get litigious\".",
              "timestamp": "2022-07-04 01:21:12",
              "score": 1,
              "num_children": 1,
              "author": 239721,
              "replies": [
                {
                  "id": "iern5mn",
                  "text": "You have more patience than I do. The sound of his voice is super irritating to me now.",
                  "timestamp": "2022-07-04 01:33:46",
                  "score": 1,
                  "num_children": 1,
                  "author": 406521,
                  "replies": [
                    {
                      "id": "iers5ad",
                      "text": "I skip way more episodes than I listen to though. Really depends on the guest. Like the one's I mentioned earlier or Mike Judge, there was actually zero politics talk on that one which was awesome for change.",
                      "timestamp": "2022-07-04 02:19:41",
                      "score": 1,
                      "num_children": 0,
                      "author": 239721,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iepx1dp",
          "text": "It's sad how easy Jordan Peterson and his ilk can manipulate people like Joe Rogan.",
          "timestamp": "2022-07-03 17:27:49",
          "score": 19,
          "num_children": 1,
          "author": 46021,
          "replies": [
            {
              "id": "ieq4nva",
              "text": "Yeah, I used to enjoy Alex Hefner on YouTube. Dude went from a young rap fan to reacting to metal videos and becoming a huge fan of it.\n\nThen he started branching away from music reactions and agreeing with Jordan Peterson, and I had to hit unsubscribe. Couldn't believe a seemingly intelligent guy who got a law degree would share opinions with Peterson and that whole alt-right bullshit he has going on.",
              "timestamp": "2022-07-03 18:22:51",
              "score": 9,
              "num_children": 0,
              "author": 404389,
              "replies": []
            }
          ]
        },
        {
          "id": "ieq94th",
          "text": "He was getting groomed years ago when bots from 4chan and wherever started hijacking his fan base. You could see the same personalities, taking points, and sound bites become more prominent in discussing threads and it bled into his shows. That started years before the pandemic. He's pretty much a primer for right wing activism now. It's the same reason a lot of people knew what was up with Trump's first campaign early on. It was all the same chatter and tone.",
          "timestamp": "2022-07-03 18:55:33",
          "score": 7,
          "num_children": 0,
          "author": 291411,
          "replies": []
        },
        {
          "id": "ieq0edv",
          "text": "Glad I’m not the only one who still calls it the State theater.",
          "timestamp": "2022-07-03 17:51:56",
          "score": 3,
          "num_children": 1,
          "author": 363098,
          "replies": [
            {
              "id": "ieqebgw",
              "text": "Lol. Oh yea, ‘The Fillmore’. My boy Clint is the manager there. He managed Clutch Cargo’s for 15 years. I was managing the Magic Bag. It’s all a big family. Detroit: Rock City.\n\nPine Knob is Pine Knob again. DTE sold it I heard.",
              "timestamp": "2022-07-03 19:33:42",
              "score": 2,
              "num_children": 1,
              "author": 266463,
              "replies": [
                {
                  "id": "ieqlkp2",
                  "text": "I completely forgot about Clutch Cargos! Now I feel really old because the last show I went there was probably over 20 years ago. \n\nI like the “Fillmore” as a venue. Saw Clutch there in December.",
                  "timestamp": "2022-07-03 20:27:43",
                  "score": 1,
                  "num_children": 0,
                  "author": 363098,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ieqo2vn",
          "text": "He used to say he wasn't smart he just memorized the stuff smarter people had already figured out because it was a huge time saver. Now hes just a muscly parrot spouting other people's talking points thinking they're his ideas. Grifters realized early on they could use his popularity as a springboard and a soapbox to peddle their bullshit.",
          "timestamp": "2022-07-03 20:45:57",
          "score": 1,
          "num_children": 0,
          "author": 290476,
          "replies": []
        }
      ]
    },
    {
      "id": "iep9fvb",
      "text": "Hogs",
      "timestamp": "2022-07-03 14:40:47",
      "score": 50,
      "num_children": 0,
      "author": 208242,
      "replies": []
    },
    {
      "id": "ieq4avd",
      "text": "Why does Chris look so old?",
      "timestamp": "2022-07-03 18:20:16",
      "score": 9,
      "num_children": 1,
      "author": 117420,
      "replies": [
        {
          "id": "ieqp7yf",
          "text": "Because he is. He’s really older than the media he curates",
          "timestamp": "2022-07-03 20:54:21",
          "score": 7,
          "num_children": 1,
          "author": 187962,
          "replies": [
            {
              "id": "ier6qbz",
              "text": "Me taking a look...*he's 43...reflects back on how great my joints felt at 43*  😞",
              "timestamp": "2022-07-03 23:09:58",
              "score": 5,
              "num_children": 0,
              "author": 384860,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ieq2onk",
      "text": "The worst Chris.",
      "timestamp": "2022-07-03 18:08:26",
      "score": 51,
      "num_children": 1,
      "author": 275545,
      "replies": [
        {
          "id": "iequhxh",
          "text": "I think he has to fight Chris Brown for that title.",
          "timestamp": "2022-07-03 21:33:48",
          "score": 46,
          "num_children": 2,
          "author": 356321,
          "replies": [
            {
              "id": "ier4rpu",
              "text": "Chris Brown doesn't fight men.",
              "timestamp": "2022-07-03 22:53:52",
              "score": 45,
              "num_children": 0,
              "author": 68813,
              "replies": []
            },
            {
              "id": "ier0r0b",
              "text": "Shit. You’re not wrong.",
              "timestamp": "2022-07-03 22:21:41",
              "score": 29,
              "num_children": 0,
              "author": 275545,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iepkjqm",
      "text": "I didn't recognize Chris Pratt at first and thought that was the janitor from Scrubs.",
      "timestamp": "2022-07-03 16:01:06",
      "score": 22,
      "num_children": 0,
      "author": 387228,
      "replies": []
    },
    {
      "id": "ieqqz3e",
      "text": "Jesus Christ Chris. Just stop digging yourself lower.",
      "timestamp": "2022-07-03 21:07:18",
      "score": 7,
      "num_children": 0,
      "author": 392212,
      "replies": []
    },
    {
      "id": "iepeqz9",
      "text": "Right wing \"celebrities\"💩😂🤣😂🤣😂🤣",
      "timestamp": "2022-07-03 15:19:56",
      "score": 33,
      "num_children": 0,
      "author": 177892,
      "replies": []
    },
    {
      "id": "ies8i6z",
      "text": "Joe Rogan looks like a bloated baked potato that’s just about to split.",
      "timestamp": "2022-07-04 05:03:50",
      "score": 5,
      "num_children": 0,
      "author": 208388,
      "replies": []
    },
    {
      "id": "iep6987",
      "text": "Fucking Knuckle-dragging taint lickers",
      "timestamp": "2022-07-03 14:16:36",
      "score": 44,
      "num_children": 0,
      "author": 150719,
      "replies": []
    },
    {
      "id": "iephnpd",
      "text": "He needs to go on a huyasca trip n come back to earth.",
      "timestamp": "2022-07-03 15:40:50",
      "score": 14,
      "num_children": 1,
      "author": 131031,
      "replies": [
        {
          "id": "ieppy2v",
          "text": "Eh maybe he can just keep going and just fuck off",
          "timestamp": "2022-07-03 16:37:56",
          "score": 14,
          "num_children": 0,
          "author": 250665,
          "replies": []
        }
      ]
    },
    {
      "id": "iep7aqz",
      "text": "  Chris Shat",
      "timestamp": "2022-07-03 14:24:36",
      "score": 29,
      "num_children": 1,
      "author": 269698,
      "replies": [
        {
          "id": "iepe4uy",
          "text": "Crispy rat",
          "timestamp": "2022-07-03 15:15:35",
          "score": 14,
          "num_children": 0,
          "author": 412449,
          "replies": []
        }
      ]
    },
    {
      "id": "iepytz4",
      "text": "Is Rogan a jesus freak now too?",
      "timestamp": "2022-07-03 17:40:41",
      "score": 4,
      "num_children": 0,
      "author": 347355,
      "replies": []
    },
    {
      "id": "iepiea5",
      "text": "Both just fucking idiots and gigantic man children. Rogan is such an ignorant idiot its disgusting.",
      "timestamp": "2022-07-03 15:46:06",
      "score": 28,
      "num_children": 0,
      "author": 123415,
      "replies": []
    },
    {
      "id": "ieq2zfi",
      "text": "Wait what's with Chris Pratt? Why is he a right winger?",
      "timestamp": "2022-07-03 18:10:38",
      "score": 13,
      "num_children": 1,
      "author": 73654,
      "replies": [
        {
          "id": "ieq3tx2",
          "text": "He's part of Hillsong, which is a more fundamentalist Christian version of Scientology.",
          "timestamp": "2022-07-03 18:16:50",
          "score": 35,
          "num_children": 1,
          "author": 404389,
          "replies": [
            {
              "id": "ieq5ccn",
              "text": "He seems to deny those allegations and says he supports the LGBTQ community though\nhttps://www.dailydot.com/unclick/chris-pratt-backlash-religious-hillsong/",
              "timestamp": "2022-07-03 18:27:51",
              "score": -9,
              "num_children": 2,
              "author": 73654,
              "replies": [
                {
                  "id": "ieqe070",
                  "text": "He can say stuff all he wants but he still supports them. And like other comments and links in this thread point out, he’s been repping merch for a far right militia group, the 3%ers. He says stuff to appease the majority and still have his fame. But his actions show different.",
                  "timestamp": "2022-07-03 19:31:22",
                  "score": 40,
                  "num_children": 1,
                  "author": 235685,
                  "replies": [
                    {
                      "id": "ier4yfb",
                      "text": "Except the people who linked the 3%er stuff... it doesn't actually show that it's 3%er merch. The logo is similar, but not the same and there hasn't been shown a 3%er merch store that has the hat Pratt was wearing.\n\nI see where he's coming from where he complains that people who don't know him just make stuff up about him, because that's exactly what you're doing.",
                      "timestamp": "2022-07-03 22:55:24",
                      "score": -10,
                      "num_children": 1,
                      "author": 68813,
                      "replies": [
                        {
                          "id": "iercj1c",
                          "text": "He could very easily disprove a lot of what is being said about him. Yeah I believe it because he’s so vague with his denials and it’s just talk.",
                          "timestamp": "2022-07-03 23:58:56",
                          "score": 3,
                          "num_children": 1,
                          "author": 235685,
                          "replies": [
                            {
                              "id": "ierhr6s",
                              "text": "I mean, could he? Most of what people are saying about him are views that they believe he has that he says he doesn't. Neither has proof.",
                              "timestamp": "2022-07-04 00:44:51",
                              "score": -1,
                              "num_children": 1,
                              "author": 68813,
                              "replies": [
                                {
                                  "id": "ieriez9",
                                  "text": "Not continue to support the church that hates on gays. Or for the 3%er stuff, denounce his brother’s actions specifically or say what the merch he wears really is. But I doubt he’s wearing EU merch.",
                                  "timestamp": "2022-07-04 00:50:47",
                                  "score": 3,
                                  "num_children": 1,
                                  "author": 235685,
                                  "replies": [
                                    {
                                      "id": "iese3hs",
                                      "text": "He says he doesn't go to that church. The burden of proof on the 3%er stuff should be on the people who point to him wearing a hat that has a logo of the US Foreign Service which is fairly similar to the 3%er logo (but not the same) to show that 3%ers wear or sell that hat before claiming it's 3%er merch.  Why don't you show me their merch sales where they sell that hat? It should be really fucking easy since you're claiming it's their merch?\n\nIf I claimed someone was wearing merch of a group, I'd confirm that before blasting it all over the internet like you're doing.",
                                      "timestamp": "2022-07-04 06:08:32",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 68813,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ieqp4hq",
                  "text": "He’s a piece of shit and supports the white supremacist 3% crap",
                  "timestamp": "2022-07-03 20:53:38",
                  "score": 12,
                  "num_children": 0,
                  "author": 187962,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iepsuox",
      "text": "Between Joe, all the crypto propaganda and \"Alpa Male\" products, seems like UFC is officially the sport of the alt-right. A shame it's so fun to watch.\n\nedit: leaving it",
      "timestamp": "2022-07-03 16:58:04",
      "score": 12,
      "num_children": 3,
      "author": 138887,
      "replies": [
        {
          "id": "ieqrttu",
          "text": "Yeah, I'm a big MMA fan but a lot of the UFC stances anti-union, Dana being a big Trump fan and stuff has made it hard to support them. Part of the reason I sail the high seas with their PPVs.",
          "timestamp": "2022-07-03 21:13:45",
          "score": 6,
          "num_children": 0,
          "author": 128072,
          "replies": []
        },
        {
          "id": "iern2f4",
          "text": "Dana White has been trying to grab up all that “business” ever since NASCAR decided to stop pandering to rednecks as much.",
          "timestamp": "2022-07-04 01:32:59",
          "score": 1,
          "num_children": 0,
          "author": 406921,
          "replies": []
        },
        {
          "id": "ieq71v1",
          "text": "Would say the UFC is more of an international sport, although most of their income is from PPVs. Some US politics subjects get talked about from left and right wing American people. But on any given event you would find none of that stuff, its more about the individual in this sport imo. \n\nBesides that idk why this pic got posted, these 2 did nothing political during this event.",
          "timestamp": "2022-07-03 18:40:19",
          "score": -3,
          "num_children": 0,
          "author": 277121,
          "replies": []
        }
      ]
    },
    {
      "id": "iep4npn",
      "text": "Looks like Chris Pratt got a whiff of Rogan’s bullshit",
      "timestamp": "2022-07-03 14:04:12",
      "score": 17,
      "num_children": 0,
      "author": 367789,
      "replies": []
    },
    {
      "id": "iep6gq9",
      "text": "What did Pratt do??!?",
      "timestamp": "2022-07-03 14:18:15",
      "score": 25,
      "num_children": 1,
      "author": 109112,
      "replies": [
        {
          "id": "iepd0g1",
          "text": "He’s apart of a hateful and homophobic church",
          "timestamp": "2022-07-03 15:07:14",
          "score": 83,
          "num_children": 3,
          "author": 374250,
          "replies": [
            {
              "id": "iepgu07",
              "text": "And he wears Three Percenters merch. \n\nhttps://thebrag.com/chris-pratt-seen-wearing-hat-supporting-white-supremacist-group-three-percenters/",
              "timestamp": "2022-07-03 15:34:53",
              "score": 64,
              "num_children": 1,
              "author": 232899,
              "replies": [
                {
                  "id": "iepo3ys",
                  "text": "Yuuuuup. His actions speak much louder than his words.",
                  "timestamp": "2022-07-03 16:25:44",
                  "score": 27,
                  "num_children": 0,
                  "author": 374250,
                  "replies": []
                }
              ]
            },
            {
              "id": "iepfhzz",
              "text": "Didn’t he recently say in an interview that he’s been trying to get away from that stuff?",
              "timestamp": "2022-07-03 15:25:20",
              "score": -1,
              "num_children": 6,
              "author": 242452,
              "replies": [
                {
                  "id": "iephe63",
                  "text": "He said he was \"more spiritual than religious\" which is a phrase a certain strain of evangelicals uses to sound more approachable. He totally still is a bible thumper, he's just dancing around it a bit.",
                  "timestamp": "2022-07-03 15:38:57",
                  "score": 34,
                  "num_children": 1,
                  "author": 277852,
                  "replies": [
                    {
                      "id": "iepvavm",
                      "text": "Lots of people use that terminology, not just evangelicals. Not supporting the guy, but just noting that using that phrasing doesn’t really mean anything",
                      "timestamp": "2022-07-03 17:15:21",
                      "score": -6,
                      "num_children": 0,
                      "author": 20053,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iepg0i4",
                  "text": "You mean the interviews that just so happened to be timed when he’s doing press for The Terminal List and Thor? The same interviews where he’s lying about being religious?",
                  "timestamp": "2022-07-03 15:29:03",
                  "score": 65,
                  "num_children": 1,
                  "author": 374250,
                  "replies": [
                    {
                      "id": "iepg7hn",
                      "text": "I mean, he could be telling the truth.\n\n…Or he’s taking a page out of the “Book of QAnon” and is lying about it.",
                      "timestamp": "2022-07-03 15:30:27",
                      "score": 10,
                      "num_children": 2,
                      "author": 242452,
                      "replies": [
                        {
                          "id": "iepgqks",
                          "text": "He’s definitely lying. He’s a well known Bible quoter but now claims he’s not religious? But he goes to Zoe church but not hillsong (which iirc is related to hillsong?)?",
                          "timestamp": "2022-07-03 15:34:13",
                          "score": 36,
                          "num_children": 0,
                          "author": 374250,
                          "replies": []
                        },
                        {
                          "id": "iepmp2k",
                          "text": "I believe he actually claimed in his most recent PR statement about his religious beliefs that he had never attended Hillsong but there is reporting showing exactly the opposite. Either he did or he did not and either he's a liar or the reporting is not correct. It's notable he's not going after those media sources making those connections though after it's been in the public sphere for years now.\n\nWeighing these things, it's much more likely that he's lying and trying to downplay his religious views.",
                          "timestamp": "2022-07-03 16:16:06",
                          "score": 14,
                          "num_children": 1,
                          "author": 150465,
                          "replies": [
                            {
                              "id": "iepn8r6",
                              "text": "I think you mean Hillsong, not Westboro. There is no suggestion that Pratt went to Westboro. Indeed he specifically calls them out as a church that can be thrown under a bus. Hillsong is the church that Pratt has repeatedly been linked to, although I still can't find any evidence that he actually went there. Instead he goes to Zoe Church which is influenced by Hillsong, but whether that's in the sense of homophobia, or in the sense of being a happy clappy sing-song church is difficult to say because none of us have been there.",
                              "timestamp": "2022-07-03 16:19:58",
                              "score": 5,
                              "num_children": 2,
                              "author": 172737,
                              "replies": [
                                {
                                  "id": "iepputy",
                                  "text": ">Hillsong is the church that Pratt has repeatedly been linked to, although I still can't find any evidence that he actually went there.\n\nTook me like 5 minutes to track this down but this is the article I remember. It's still up and until now, to the best of my knowledge, Pratt had never actually said anything directly contrary to the reporting. The photo is obviously not inside the church during an actual service and that's probably not allowed anyhow but it begs the question why he's there if not for the service that reasonably just concluded.\n\nhttps://ca.news.yahoo.com/chris-pratt-turns-justin-biebers-hillsong-church-204210465.html",
                                  "timestamp": "2022-07-03 16:37:19",
                                  "score": 7,
                                  "num_children": 1,
                                  "author": 150465,
                                  "replies": [
                                    {
                                      "id": "iepws6q",
                                      "text": "I'm not going to defend Hillsong. It seems like a cult, and there's various sex abuse allegations and sex scandals. It has also been practicing \"conversion therapy\" up until at least 2016. However, it doesn't seem like that was Pratt's church at the time. And it isn't Bieber and Pratt's (and anyone else, for all I know) church now.",
                                      "timestamp": "2022-07-03 17:25:59",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 172737,
                                      "replies": [
                                        {
                                          "id": "ieq11pi",
                                          "text": "Which really only proves that people who did are just distancing themselves from a specific church and not the actual beliefs of that church. As you mentioned Zoe church is founded with Hillsong as it's model. Everything is just a matter of rebranding and plausible deniability it seems to me at least.",
                                          "timestamp": "2022-07-03 17:56:38",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 150465,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "iepni77",
                                  "text": "Yep editing thanks so much.",
                                  "timestamp": "2022-07-03 16:21:45",
                                  "score": 4,
                                  "num_children": 0,
                                  "author": 150465,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iepi3r2",
                  "text": "He also got caught a couple days ago wearing far-right militia group’s logo on his hat, a group that his brother is a confirmed member of.",
                  "timestamp": "2022-07-03 15:44:00",
                  "score": 14,
                  "num_children": 0,
                  "author": 146548,
                  "replies": []
                },
                {
                  "id": "iephf3j",
                  "text": "Until he’s actually away from it I don’t believe it",
                  "timestamp": "2022-07-03 15:39:08",
                  "score": 10,
                  "num_children": 0,
                  "author": 243748,
                  "replies": []
                },
                {
                  "id": "ieq028q",
                  "text": "Gee I wonder why",
                  "timestamp": "2022-07-03 17:49:30",
                  "score": 5,
                  "num_children": 0,
                  "author": 372064,
                  "replies": []
                },
                {
                  "id": "ieq0g9v",
                  "text": "The ones where he says he hangs out with his pastor but that he isn't religious?",
                  "timestamp": "2022-07-03 17:52:20",
                  "score": 4,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "iepdlj8",
              "text": "Ooofff. That sucks.",
              "timestamp": "2022-07-03 15:11:41",
              "score": 1,
              "num_children": 0,
              "author": 109112,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ieq008l",
      "text": "In particular. Fucking liars.",
      "timestamp": "2022-07-03 17:49:05",
      "score": 5,
      "num_children": 0,
      "author": 145084,
      "replies": []
    },
    {
      "id": "ieqemnf",
      "text": "After the repeal of Roe they should never get fucked again.",
      "timestamp": "2022-07-03 19:35:58",
      "score": 4,
      "num_children": 0,
      "author": 335881,
      "replies": []
    },
    {
      "id": "ieqid12",
      "text": "Is Rogan's head growing in size or is the rest of him shrinking?",
      "timestamp": "2022-07-03 20:04:00",
      "score": 4,
      "num_children": 0,
      "author": 193709,
      "replies": []
    },
    {
      "id": "ieqzte6",
      "text": "What did chris Pratt do?",
      "timestamp": "2022-07-03 22:14:19",
      "score": 3,
      "num_children": 0,
      "author": 381821,
      "replies": []
    },
    {
      "id": "ieqripi",
      "text": "Not Crisp Rat!! No!!!",
      "timestamp": "2022-07-03 21:11:25",
      "score": 2,
      "num_children": 0,
      "author": 245678,
      "replies": []
    },
    {
      "id": "ierk6gw",
      "text": "Guess everyone here won’t be watching the new Thor movie when it comes out then? \nOr the new guardians of the galaxy later next year?",
      "timestamp": "2022-07-04 01:06:43",
      "score": 2,
      "num_children": 0,
      "author": 152953,
      "replies": []
    },
    {
      "id": "ierwooo",
      "text": "Who are they?",
      "timestamp": "2022-07-04 03:02:19",
      "score": 2,
      "num_children": 0,
      "author": 283493,
      "replies": []
    },
    {
      "id": "iesk2oa",
      "text": "Who are they?",
      "timestamp": "2022-07-04 07:25:29",
      "score": 2,
      "num_children": 0,
      "author": 108623,
      "replies": []
    },
    {
      "id": "ierqz7w",
      "text": "Being conservative is not synonymous with being alt-right. What right-wing EXTREMIST beliefs does Chris Pratt (or Joe Rogan for that matter) support? Maybe I'm ill-informed here, but these guys aren't nearly as deep into the conservative spectrum as someone like Ben Shapiro, Tucker Carlson, or any other person who actually is considered an alt-right extremist. Not trying to ruffle feathers, just playing devil's advocate and genuinely asking if people in this forum believe these two fit the category theyre being described in.",
      "timestamp": "2022-07-04 02:08:50",
      "score": 6,
      "num_children": 2,
      "author": 70929,
      "replies": [
        {
          "id": "ies7eyq",
          "text": "Chris Pratt's brother is involved with the 3%ers, one of the major groups that attacked the capital. Chris has been photographed wearing their paraphernalia.",
          "timestamp": "2022-07-04 04:51:57",
          "score": 4,
          "num_children": 1,
          "author": 232407,
          "replies": [
            {
              "id": "iesczui",
              "text": "Oh shit, the more you know.",
              "timestamp": "2022-07-04 05:55:19",
              "score": 4,
              "num_children": 0,
              "author": 70929,
              "replies": []
            }
          ]
        },
        {
          "id": "ierr02l",
          "text": "*Let’s say, for the sake of argument, that all of the water levels around the world rise by, let’s say, five feet or ten feet over the next hundred years. It puts all the low-lying areas on the coast underwater. Let’s say all of that happens. You think that people aren’t just going to sell their homes and move?*\n\n\n -Ben Shapiro\n\n\n*****\n\n^(I'm a bot. My purpose is to counteract online radicalization. You can summon me by tagging thebenshapirobot. Options: sex, feminism, history, dumb takes, etc.)\n\n\n\n[^More ^About ^Ben ](https://np.reddit.com/r/AuthoritarianMoment/wiki/index) ^| [^Feedback ^& ^Discussion: ^r/AuthoritarianMoment ](https://np.reddit.com/r/AuthoritarianMoment) ^| [^Opt ^Out ](https://np.reddit.com/r/AuthoritarianMoment/comments/olk6r2/click_here_to_optout_of_uthebenshapirobot/)",
          "timestamp": "2022-07-04 02:09:03",
          "score": 3,
          "num_children": 1,
          "author": 280326,
          "replies": [
            {
              "id": "ierxwua",
              "text": "TO WHO, BEN? FUCKING AQUAMAN?!",
              "timestamp": "2022-07-04 03:14:03",
              "score": 2,
              "num_children": 1,
              "author": 141782,
              "replies": [
                {
                  "id": "ierzoee",
                  "text": "*This is what the radical feminist movement was proposing, remember? Women need a man the way a fish needs a bicycle... unless it turns out that they're little fish, then you might need another fish around to help take care of things.*\n\n\n -Ben Shapiro\n\n\n*****\n\n^(I'm a bot. My purpose is to counteract online radicalization. You can summon me by tagging thebenshapirobot. Options: civil rights, climate, dumb takes, healthcare, etc.)\n\n\n\n[^More ^About ^Ben ](https://np.reddit.com/r/AuthoritarianMoment/wiki/index) ^| [^Feedback ^& ^Discussion: ^r/AuthoritarianMoment ](https://np.reddit.com/r/AuthoritarianMoment) ^| [^Opt ^Out ](https://np.reddit.com/r/AuthoritarianMoment/comments/olk6r2/click_here_to_optout_of_uthebenshapirobot/)",
                  "timestamp": "2022-07-04 03:31:18",
                  "score": 1,
                  "num_children": 0,
                  "author": 280326,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ieqwj4t",
      "text": "Joe Rogan has fried his brain due to DMT. He was logical and reasonable now hes just another right wing nut.",
      "timestamp": "2022-07-03 21:49:05",
      "score": 3,
      "num_children": 0,
      "author": 60819,
      "replies": []
    },
    {
      "id": "ierch1u",
      "text": "I still dont think Joe is right wing, just a dumbo. How do you go from supporting bernie to ron de santis? I feel like he would still say he supports bernies policies. He is so easy to flip flop",
      "timestamp": "2022-07-03 23:58:28",
      "score": 2,
      "num_children": 0,
      "author": 312887,
      "replies": []
    },
    {
      "id": "ierle2c",
      "text": "This shit with Chris Pratt has gone way too far. Rogan? Yeah fuck him and his asinine, far right and harmful conspiracy theory enabling self. But what exactly has Chris Pratt done that’s so awful? Is there any legitimate evidence that he holds super hateful or problematic views? From what I understand, whatever his views are he keeps them to himself and I really don’t see a problem with that. People who hate vocally hate everything Trump and his awful people stand for like Dave Bautista, Chris Evans,and Mark Ruffalo all go to bat for him and I’d imagine if he walked around spouting MAGA bullshit they’d disavow him. Maybe I’m totally wrong on this but I think there’s SO many genuinely awful people out there right now that I think are much more worthy of vitriol than Chris Pratt is.",
      "timestamp": "2022-07-04 01:17:44",
      "score": 2,
      "num_children": 0,
      "author": 254005,
      "replies": []
    },
    {
      "id": "ieqllf0",
      "text": "Two faces, desperately calling out to be pie'd.",
      "timestamp": "2022-07-03 20:27:53",
      "score": 1,
      "num_children": 0,
      "author": 246718,
      "replies": []
    },
    {
      "id": "iequk5z",
      "text": "Yeah they both suck balls",
      "timestamp": "2022-07-03 21:34:17",
      "score": 1,
      "num_children": 0,
      "author": 410577,
      "replies": []
    },
    {
      "id": "ieoy2cu",
      "text": "Why'd you take a selfie",
      "timestamp": "2022-07-03 13:05:18",
      "score": -20,
      "num_children": 1,
      "author": 283991,
      "replies": [
        {
          "id": "iepbrl4",
          "text": "Bruh",
          "timestamp": "2022-07-03 14:57:53",
          "score": 6,
          "num_children": 0,
          "author": 116176,
          "replies": []
        }
      ]
    },
    {
      "id": "iercji8",
      "text": "I’m liberal.. really? Why? Aren’t we being a bit purist.",
      "timestamp": "2022-07-03 23:59:03",
      "score": -4,
      "num_children": 1,
      "author": 83840,
      "replies": [
        {
          "id": "ierjcj6",
          "text": "You’re not a liberal if you are okay with these guys",
          "timestamp": "2022-07-04 00:59:08",
          "score": 1,
          "num_children": 0,
          "author": 320222,
          "replies": []
        }
      ]
    },
    {
      "id": "ierigci",
      "text": "[removed]",
      "timestamp": "2022-07-04 00:51:07",
      "score": -5,
      "num_children": 1,
      "replies": [
        {
          "id": "ierjfvc",
          "text": "And you’re a white nationalist",
          "timestamp": "2022-07-04 00:59:59",
          "score": 4,
          "num_children": 2,
          "author": 320222,
          "replies": [
            {
              "id": "ierjsty",
              "text": "[removed]",
              "timestamp": "2022-07-04 01:03:14",
              "score": -1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ierk54i",
                  "text": "[deleted]",
                  "timestamp": "2022-07-04 01:06:22",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ierrrh0",
                      "text": "[removed]",
                      "timestamp": "2022-07-04 02:16:08",
                      "score": -1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ierjrae",
              "text": "[removed]",
              "timestamp": "2022-07-04 01:02:49",
              "score": -2,
              "num_children": 1,
              "replies": [
                {
                  "id": "ierk1q8",
                  "text": "If you support white nationalists, that makes you one regardless of what your race is",
                  "timestamp": "2022-07-04 01:05:29",
                  "score": 7,
                  "num_children": 0,
                  "author": 320222,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iep8b7q",
      "text": "What’d they do?",
      "timestamp": "2022-07-03 14:32:21",
      "score": -12,
      "num_children": 1,
      "author": 129431,
      "replies": [
        {
          "id": "ieptspp",
          "text": "Well, Rogan said he would vote for desantis, so there's that",
          "timestamp": "2022-07-03 17:04:39",
          "score": 9,
          "num_children": 0,
          "author": 154171,
          "replies": []
        }
      ]
    },
    {
      "id": "iepx6t8",
      "text": "\"BuWhy guys? You were so cool\".\n\n              Shaggy/Norville Rogers",
      "timestamp": "2022-07-03 17:28:54",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ieqdb2v",
      "text": "I wouldn't.",
      "timestamp": "2022-07-03 19:26:12",
      "score": 1,
      "num_children": 0,
      "author": 331926,
      "replies": []
    },
    {
      "id": "ierk5p9",
      "text": "I think he’s a dickhead trying to convince everyone he’s not a dickhead.",
      "timestamp": "2022-07-04 01:06:31",
      "score": 1,
      "num_children": 0,
      "author": 153638,
      "replies": []
    },
    {
      "id": "ierlc40",
      "text": "YEAH. What he said",
      "timestamp": "2022-07-04 01:17:14",
      "score": 1,
      "num_children": 0,
      "author": 45814,
      "replies": []
    },
    {
      "id": "ierr40y",
      "text": "So this is where we’ve come to",
      "timestamp": "2022-07-04 02:10:04",
      "score": 1,
      "num_children": 0,
      "author": 28592,
      "replies": []
    },
    {
      "id": "ierts38",
      "text": "...i thought Chris Pratt was Tom Brady until I went into the comments",
      "timestamp": "2022-07-04 02:34:51",
      "score": 1,
      "num_children": 0,
      "author": 317506,
      "replies": []
    },
    {
      "id": "ieruxj0",
      "text": "Fucking crisp rat",
      "timestamp": "2022-07-04 02:45:39",
      "score": 1,
      "num_children": 0,
      "author": 135629,
      "replies": []
    },
    {
      "id": "ies99rm",
      "text": "Used to be my favorite Chris, is now the worst Chris.",
      "timestamp": "2022-07-04 05:12:21",
      "score": 1,
      "num_children": 0,
      "author": 381578,
      "replies": []
    },
    {
      "id": "iesbeyf",
      "text": "I would rather not, I don't want nazi on my dick.",
      "timestamp": "2022-07-04 05:36:39",
      "score": 1,
      "num_children": 0,
      "author": 333838,
      "replies": []
    },
    {
      "id": "iesih5m",
      "text": "I really feel like his publicist is not great.",
      "timestamp": "2022-07-04 07:04:02",
      "score": 1,
      "num_children": 0,
      "author": 50291,
      "replies": []
    },
    {
      "id": "iey5eec",
      "text": "How is Rogan right wing?!",
      "timestamp": "2022-07-05 14:49:34",
      "score": 1,
      "num_children": 0,
      "author": 393003,
      "replies": []
    },
    {
      "id": "iepmvdq",
      "text": "[deleted]",
      "timestamp": "2022-07-03 16:17:20",
      "score": -2,
      "num_children": 1,
      "replies": [
        {
          "id": "ieppr2v",
          "text": "Hahahahahahahaha",
          "timestamp": "2022-07-03 16:36:37",
          "score": 3,
          "num_children": 1,
          "author": 227345,
          "replies": [
            {
              "id": "ieppw1n",
              "text": "i genuinely wanna know i dont pay attention to celebrities and actors",
              "timestamp": "2022-07-03 16:37:33",
              "score": 0,
              "num_children": 1,
              "author": 266192,
              "replies": [
                {
                  "id": "iepssss",
                  "text": "Well, for starters, he spreads virtually every conspiracy theory/lie that the right wing has been on in the last few years",
                  "timestamp": "2022-07-03 16:57:42",
                  "score": 6,
                  "num_children": 0,
                  "author": 345747,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iervqvi",
      "text": "[removed]",
      "timestamp": "2022-07-04 02:53:22",
      "score": -7,
      "num_children": 1,
      "replies": [
        {
          "id": "iesf65u",
          "text": "Your penis must be super tiny",
          "timestamp": "2022-07-04 06:21:40",
          "score": 3,
          "num_children": 0,
          "author": 213093,
          "replies": []
        }
      ]
    },
    {
      "id": "ierk7w0",
      "text": "[removed]",
      "timestamp": "2022-07-04 01:07:05",
      "score": -9,
      "num_children": 2,
      "replies": [
        {
          "id": "ies8ubd",
          "text": "https://www.yourtango.com/entertainment/chris-pratt-hat-white-supremacist-group-brother",
          "timestamp": "2022-07-04 05:07:34",
          "score": 2,
          "num_children": 0,
          "author": 232407,
          "replies": []
        },
        {
          "id": "iesfgmo",
          "text": "Your dick is softer",
          "timestamp": "2022-07-04 06:25:16",
          "score": 2,
          "num_children": 0,
          "author": 213093,
          "replies": []
        }
      ]
    },
    {
      "id": "iet2i2u",
      "text": "Sorry for not being in the present but how is Chris Pratt a right winger? Not trying to be rude just curious.",
      "timestamp": "2022-07-04 11:37:23",
      "score": 0,
      "num_children": 1,
      "author": 130256,
      "replies": [
        {
          "id": "iet43yz",
          "text": "You can look it up instead of trying to sow doubt. We know what you right wingers are trying to do.",
          "timestamp": "2022-07-04 11:55:34",
          "score": 2,
          "num_children": 1,
          "author": 320222,
          "replies": [
            {
              "id": "iet45mp",
              "text": "Sorry I was just asking",
              "timestamp": "2022-07-04 11:56:04",
              "score": 1,
              "num_children": 0,
              "author": 130256,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iet8nu0",
      "text": "Joe Rogan CONTINUALLY describes himself as a Liberal on his podcasts.\nOP should edit title to be \"opinion\".",
      "timestamp": "2022-07-04 12:42:32",
      "score": 0,
      "num_children": 1,
      "author": 394675,
      "replies": [
        {
          "id": "iet9g42",
          "text": "And the Nazis described themselves as socialists, moron",
          "timestamp": "2022-07-04 12:50:06",
          "score": 2,
          "num_children": 1,
          "author": 320222,
          "replies": [
            {
              "id": "ieyutri",
              "text": "Why would he not take pride in being a Conservative?",
              "timestamp": "2022-07-05 17:38:14",
              "score": 1,
              "num_children": 0,
              "author": 394675,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}