{
  "id": "vriaa3",
  "text": "Absolutely\n",
  "timestamp": "2022-07-04 21:49:26",
  "score": 4336,
  "subreddit": "t5_3fdcn",
  "num_children": 17,
  "author": 133955,
  "replies": [
    {
      "id": "ievb0xf",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-07-04 21:49:26",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "ievkn6y",
      "text": "Fuck review.\n\nKick em out.",
      "timestamp": "2022-07-04 23:02:21",
      "score": 185,
      "num_children": 1,
      "replies": [
        {
          "id": "iewuygg",
          "text": "Yeah exactly! Like this is why people hate liberals",
          "timestamp": "2022-07-05 06:20:17",
          "score": 26,
          "num_children": 1,
          "author": 52797,
          "replies": [
            {
              "id": "iexqn8o",
              "text": "[deleted]",
              "timestamp": "2022-07-05 12:55:15",
              "score": 40,
              "num_children": 3,
              "replies": [
                {
                  "id": "iexw0nk",
                  "text": "They may be talking leftists vs liberals, not conservatives vs liberals.",
                  "timestamp": "2022-07-05 13:40:12",
                  "score": 23,
                  "num_children": 0,
                  "author": 36063,
                  "replies": []
                },
                {
                  "id": "iey141d",
                  "text": "Who else are leftists supposed to vote for? Until we have ranked choice voting we're stuck voting for the lesser of two evils. So, yeah, people can hate liberals and still vote for them.",
                  "timestamp": "2022-07-05 14:18:49",
                  "score": 17,
                  "num_children": 0,
                  "author": 158516,
                  "replies": []
                },
                {
                  "id": "iey0t56",
                  "text": "I think it just may be the way that \"liberals\" handle things. Like threatening punishments for naughty kids but never really following through instead of putting them in their room, taking their phones, their games, their TV, etc., then locking the door and taking the key. I think it's just a preference to take a hardline stance instead of a review as suggested.\n\nFully agree with you about the popular vote. The Electoral College needs to go bye-bye. It should be, people vote and the person who comes out on top wins but the Republicans know that if this was the case then they'd never win an election. I think there definitely needs to be dissenting voices to avoid absolute power but conservatism is not what it used to be. It's now extremism.",
                  "timestamp": "2022-07-05 14:16:35",
                  "score": 5,
                  "num_children": 1,
                  "author": 92865,
                  "replies": [
                    {
                      "id": "if18nnf",
                      "text": "I think you're confusing liberals in general with the Democratic Party. The Dems have often been wusses -- they refuse to eliminate the filibuster yet never used it to stop harmful Trump villainy (like the appointment of three-count-em-three incompetent and right-wing injustices to SCOTUS, e.g.). It goes back to the way they utterly failed to take on Nixon & Reagan's Drug War policies (including racial profiling, a self-fulfilling prophecy) that have led to the mass incarceration and disenfranchisement of Black voters for minor crimes (often ones they probably didn't commit) as well as encouraging police brutality. It is not an effective way to deal with a drug problem because that was never the intent; it was designed to win over the South for Republicans and ensure that even where they were the majority Black voters would have little political power, and even if they managed to survive artificially inflated prison sentences they would still not be allowed to vote. All without (at least not obviously) violating the Voting Rights Act...which has pretty much been overturned anyway. And instead of fixing it, Clinton only made it worse! There have been a lot of other ways the Democrats have failed us, often because they were so frightened of \"alienating the center.\" Yet the way the US political system is set up -- in our Constitution, which is impossible to change for, you guessed it, political reasons -- we are stuck with two and only two parties. Third parties or independent candidates only \"spoil\" elections by taking votes away from whichever party is politically closest to them. It's really quite anticompetitive, and the \"money-is-speech\" BS only makes it harder to unseat either of the parties, *even* after one of them is practically a criminal organization, supporting an attempt by some of its supporters to violently overthrow the government, and installing judges in our highest courts who are happy to support this effort while working to eliminate any individual or civil rights that we may claim even under our imperfect Constitution. At the same time they are inventing nonexistent rights like a right to use guns for self-defence; a right to deprive others of their rights because you're their employer and you claim that your \"deeply held beliefs\" require you to do so -- but  only if they are religious beliefs (as noted, you can claim that they are and nobody is allowed to question you), and even then only if you are a fundamentalist or reactionary Catholic Christian; the right to break any law you want because you claim (again, right-wingers only, no evidence necessary) that it's against your religion; and so forth.\n\n(Err, I guess this post has sorta turned into a bit of a rant...sorry 'bout that.)",
                      "timestamp": "2022-07-06 04:05:07",
                      "score": 1,
                      "num_children": 0,
                      "author": 167074,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iew6zxq",
      "text": "18 US Code 2383- Rebellion or Insurrection “ Whoever incites, sets on foot, assists, or engages in any rebellion or insurrection against the authority of the United States or the laws thereof, or gives aid or comfort thereto, shall be fined under this title or imprisoned not more than ten years, or both; and shall be incapable of holding any office under the United States.”",
      "timestamp": "2022-07-05 02:14:11",
      "score": 107,
      "num_children": 1,
      "author": 118049,
      "replies": [
        {
          "id": "iewyfh8",
          "text": "All I'm hearing is fined\n\nThey're rich\n\nThey'll get away with it, Best country btw",
          "timestamp": "2022-07-05 07:04:06",
          "score": 30,
          "num_children": 2,
          "author": 410098,
          "replies": [
            {
              "id": "iewyinb",
              "text": "Definitely not the best country. By any standards",
              "timestamp": "2022-07-05 07:05:15",
              "score": 10,
              "num_children": 2,
              "author": 118049,
              "replies": [
                {
                  "id": "iewyp10",
                  "text": "Uh, We have like \n\nLike things and stuff \n\nAnd internet tv shows",
                  "timestamp": "2022-07-05 07:07:35",
                  "score": 12,
                  "num_children": 1,
                  "author": 410098,
                  "replies": [
                    {
                      "id": "iex44gb",
                      "text": "America, fuck yeah! Baseball, fuck yeah! NFL, fuck yeah! Fake tits, fuck yeah! Rodeos, fuck yeah! Walmart, fuck yeah! Disney World, fuck yeah!",
                      "timestamp": "2022-07-05 08:23:09",
                      "score": 5,
                      "num_children": 0,
                      "author": 253914,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iex8tj4",
                  "text": "Sarcasm much??",
                  "timestamp": "2022-07-05 09:31:12",
                  "score": 5,
                  "num_children": 0,
                  "author": 307989,
                  "replies": []
                }
              ]
            },
            {
              "id": "iexfpgz",
              "text": "Rico charges say otherwise",
              "timestamp": "2022-07-05 11:02:49",
              "score": 2,
              "num_children": 0,
              "author": 52407,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iew5j8q",
      "text": "The funny thing is, this is definitely a law singling out one individual. We all know who it is. But for him to complain that it's singling him out, he'd have to admit that he committed a crime. I like this.",
      "timestamp": "2022-07-05 02:01:03",
      "score": 42,
      "num_children": 1,
      "author": 6792,
      "replies": [
        {
          "id": "iex9ysy",
          "text": "It's not just one person though. It's several dozen if not hundreds of people in our government who are complicit in the attempted overthrow. God knows Trump wasn't smart enough, nor does he know enough to have come up with it himself.",
          "timestamp": "2022-07-05 09:47:35",
          "score": 18,
          "num_children": 1,
          "author": 191346,
          "replies": [
            {
              "id": "iexc0cw",
              "text": "You make a good point, but in the context of the post, it specifies a President. Only one of those was in on the conspiracy. But I definitely agree with you, he is not smart enough to organise anything more than his own lunch.",
              "timestamp": "2022-07-05 10:16:03",
              "score": 6,
              "num_children": 1,
              "author": 6792,
              "replies": [
                {
                  "id": "if18ytc",
                  "text": "I'm sure he never had to make his own lunch or any other meal in his lazy good4nothing richboy life.",
                  "timestamp": "2022-07-06 04:08:02",
                  "score": 2,
                  "num_children": 0,
                  "author": 167074,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iewanyq",
      "text": "It's fucking insane that we are all publicly talking in the press about the republicans' plans to take control of the us govt permanently in defiance of all democratic process and current majority wants, and we are also letting them just continue governing.",
      "timestamp": "2022-07-05 02:47:07",
      "score": 39,
      "num_children": 1,
      "author": 188064,
      "replies": [
        {
          "id": "if195u8",
          "text": "Seriously. In what sense are these guys a political party, as opposed to a terrorist/insurrectionist group?",
          "timestamp": "2022-07-06 04:09:57",
          "score": 2,
          "num_children": 0,
          "author": 167074,
          "replies": []
        }
      ]
    },
    {
      "id": "ievumh2",
      "text": "Is this in the books or just a wish",
      "timestamp": "2022-07-05 00:24:33",
      "score": 36,
      "num_children": 2,
      "author": 255351,
      "replies": [
        {
          "id": "ievye9f",
          "text": "Just a wish since I don't think ANYBODY since the founding of the United States as its own country ever would have thought something like this could ever happen.",
          "timestamp": "2022-07-05 00:57:23",
          "score": 60,
          "num_children": 0,
          "author": 232227,
          "replies": []
        },
        {
          "id": "ievy385",
          "text": "Just a wish. Never gonna happen.",
          "timestamp": "2022-07-05 00:54:41",
          "score": 18,
          "num_children": 1,
          "author": 313586,
          "replies": [
            {
              "id": "ieweya8",
              "text": "Yep.",
              "timestamp": "2022-07-05 03:26:28",
              "score": 2,
              "num_children": 0,
              "author": 354546,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iewex5r",
      "text": "He won't be, and they won't be. 😒",
      "timestamp": "2022-07-05 03:26:11",
      "score": 7,
      "num_children": 0,
      "author": 354546,
      "replies": []
    },
    {
      "id": "iewchxg",
      "text": "Or, you know, rolled back. They can reapply.",
      "timestamp": "2022-07-05 03:03:39",
      "score": 4,
      "num_children": 1,
      "author": 284749,
      "replies": [
        {
          "id": "iewepa0",
          "text": "Fuck that. Willingly accepting a nomination from a known traitor should be an automatic life sentence in and off itself.",
          "timestamp": "2022-07-05 03:24:04",
          "score": 4,
          "num_children": 0,
          "author": 270983,
          "replies": []
        }
      ]
    },
    {
      "id": "iexkjf7",
      "text": "Vote in more dems in the midterms and they have the ability  to do that.",
      "timestamp": "2022-07-05 11:56:39",
      "score": 3,
      "num_children": 0,
      "author": 148732,
      "replies": []
    },
    {
      "id": "iexxkpq",
      "text": "They should just be removed along with their puppet masters.",
      "timestamp": "2022-07-05 13:52:23",
      "score": 3,
      "num_children": 0,
      "author": 322361,
      "replies": []
    },
    {
      "id": "iew2s8t",
      "text": "What does that even mean? “Automatic review” isn’t a thing in the Constitution or under federal law. Officials can be impeached, and there are some good arguments for impeaching some of the Supreme Court justices currently ruining our country, but that’s it’s own thing.",
      "timestamp": "2022-07-05 01:36:24",
      "score": 8,
      "num_children": 2,
      "author": 121612,
      "replies": [
        {
          "id": "iew6t2f",
          "text": "It’s not a thing, but if a wannabe dictator tried to overthrow democracy, and we don’t have the receipts for all his funding, every single decision he made needs to be investigated for corruption and reasoning.",
          "timestamp": "2022-07-05 02:12:28",
          "score": 10,
          "num_children": 1,
          "author": 283663,
          "replies": [
            {
              "id": "iew8s5b",
              "text": "Just like how judges’ cases come under question if one of their decisions gets thrown out",
              "timestamp": "2022-07-05 02:30:10",
              "score": 4,
              "num_children": 1,
              "author": 37613,
              "replies": [
                {
                  "id": "iex05j7",
                  "text": "Or whole heaps of cases get thrown out or retried when a cop is found to be corrupt.",
                  "timestamp": "2022-07-05 07:27:14",
                  "score": 3,
                  "num_children": 0,
                  "author": 16816,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "if19je9",
          "text": "Impeachment…because it worked so well on Trump. /s If it's not clear, impeachment is a political process. Anyway, want to bet Democrats fear setting a bad precedent by using impeachment for purely poker purposes? (As if that will stop Republicans from doing it.)",
          "timestamp": "2022-07-06 04:13:36",
          "score": 1,
          "num_children": 0,
          "author": 167074,
          "replies": []
        }
      ]
    },
    {
      "id": "iewsqvh",
      "text": "Is that actual law, or wishful thinking?",
      "timestamp": "2022-07-05 05:53:27",
      "score": 2,
      "num_children": 1,
      "author": 298,
      "replies": [
        {
          "id": "iewxaev",
          "text": "I'd say it's more common sense, but as it's not actual law it's likely going to wind up being nothing more than wishful thinking...",
          "timestamp": "2022-07-05 06:49:19",
          "score": 3,
          "num_children": 0,
          "author": 186249,
          "replies": []
        }
      ]
    },
    {
      "id": "iewzgc4",
      "text": "[deleted]",
      "timestamp": "2022-07-05 07:17:53",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "iex07zl",
          "text": "And that is relevant how?\n\nMany posts require senate confirmation, that shouldn't be a pass when something like this happens.",
          "timestamp": "2022-07-05 07:28:09",
          "score": 2,
          "num_children": 1,
          "author": 16816,
          "replies": [
            {
              "id": "iex0mnz",
              "text": "[deleted]",
              "timestamp": "2022-07-05 07:33:48",
              "score": 1,
              "num_children": 2,
              "replies": [
                {
                  "id": "iex143j",
                  "text": "Yeah, hard no.\n\nEven by that logic, and even by the (horribly outdated, shockingly bad) logic that created the Senate in the first place, they are intended to be a final check to _prevent_ bad legislation from happening.\n\nThe Senate was never even _intended_ to be a democratic institution, every state gets 2 senators, regardless of population.  It was, at best, a sop to convince the states that they as their own entities wouldn't be completely without power.\n\nOf course, I tend to lean _very_ heavily towards the idea that land shouldn't get votes, just people, and only one per, but, well...",
                  "timestamp": "2022-07-05 07:40:23",
                  "score": 1,
                  "num_children": 2,
                  "author": 16816,
                  "replies": [
                    {
                      "id": "iex2bqe",
                      "text": "we *are* talking about the illusion of democracy, and the illusion provided by article 2 section ii is that one hundred and one people make scotus appointments.\n\nthe power is only vested in the president \"by [...] advice and consent of the senate.\" the bracketed words are \"and with,\" which add little to the meaning but make it harder to parse.",
                      "timestamp": "2022-07-05 07:57:30",
                      "score": 2,
                      "num_children": 0,
                      "author": 182345,
                      "replies": []
                    },
                    {
                      "id": "if1df34",
                      "text": "It was a compromise to the much less populous Southern states (which also got the infamous \"three-fifths compromise\" as a handout, granting excess representation to white Southerners based not on the number of voters or even the number of citizens but on the number of enslaved people). The Senate likewise overrepresents less populous states, typically rural states which tend to be more right-wing, more religiously extremist, more racist, etc.\n\nWhile the Upper South today is more purple, the less populous states of the Deep South are still bright red, as are many still largely rural states in the Midwest and West. A lot of states, notably Texas and Florida, would be solidly blue due to their large urban and metropolitan populations, if it weren't for gerrymandering. A number of these, mainly in the South and Midwest, are slowly moving in a blue-ward direction, but are hampered by gerrymandering; a sure sign of this is a Democratic governor and a Republican-controlled state legislature. Many gerrymandered electoral maps are being thrown out by state Supreme Courts, but I think we need to pass a law to require that the lines be drawn by a bipartisan commission rather than by whatever party is in power when the census results are made available, and furthermore, states with serious gerrymandering problems need to be required to redraw their borders using the new commission; it is frankly too dangerous to wait until the 2030 census.",
                      "timestamp": "2022-07-06 04:52:36",
                      "score": 1,
                      "num_children": 0,
                      "author": 167074,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "if1avlz",
                  "text": "Not every Senator voted for them. Also, they wouldn't have had the opportunity if Trump hadn't nominated them.\n\nI have a sister who is a partner in a DC law firm. She has read decisions written by some of the right-wing judges from before they were appointed to SCOTUS and says that all of them, Alito and Barrett in particular (and of course Thomas, but that's well-established), are just plain incompetent. Apparently the Federalist Society can't find any actual qualified judges who share its ideological views. This ought to tell us something about those views.",
                  "timestamp": "2022-07-06 04:26:40",
                  "score": 1,
                  "num_children": 0,
                  "author": 167074,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iey0l4b",
      "text": "I can completely get behind this idea.",
      "timestamp": "2022-07-05 14:14:56",
      "score": 1,
      "num_children": 0,
      "author": 313554,
      "replies": []
    },
    {
      "id": "ieyhleg",
      "text": "This is a pretty damn good thought.  Forgetting that I don’t like the make up of the Supreme Court, the fact remains that his decision making could very well have been colored by his desire to hold on the power.  I approve of the idea of a review. That means they don’t necessarily get kicked off of the court if they are qualified, but I do think it needs to go through a review process. And as much as I hate the Roe v. Wade overturn, I don’t think we should put them just because they were on that side of the discussion. I’m much more concerned (if that’s even possible) about the electors Case they’re going to hear.",
      "timestamp": "2022-07-05 16:11:29",
      "score": 1,
      "num_children": 1,
      "author": 244328,
      "replies": [
        {
          "id": "if3ctk5",
          "text": "The reality is that at least some of them aren't qualified. They make decisions based on ideology and they make up arguments that have no basis in law, like this \"tradition\" BS of Alito's. They completely ignore anything that doesn't support their religious and political ideology (such as amicus briefs from medical professional organisations). They use different standards depending on whether they agree or disagree with a precedent, completely ignoring those they don't like while practically worshiping those they do; they don't have any consistent legal approach (they do consistently let their biases  guide them, but that's hardly a legal approach!), and they don't even bother pretending to be objective.",
          "timestamp": "2022-07-06 16:34:20",
          "score": 2,
          "num_children": 0,
          "author": 167074,
          "replies": []
        }
      ]
    },
    {
      "id": "ieyjm1u",
      "text": "Unfortunately we don’t really have that provision in our system. We should. But we don’t.",
      "timestamp": "2022-07-05 16:24:39",
      "score": 1,
      "num_children": 0,
      "author": 362492,
      "replies": []
    },
    {
      "id": "iezynyp",
      "text": "NoOoOO that's witch hunting!!!!1!!!",
      "timestamp": "2022-07-05 22:04:59",
      "score": 1,
      "num_children": 0,
      "author": 157607,
      "replies": []
    }
  ]
}