{
  "id": "vsrox7",
  "text": "Christians are blaming American decline on abortion and lgbtq issues, but most of the mass shooters seem to be straight guys who were unwanted children.\nJesus the Jewish Nazaren never addressed gender issues nor reproductive choice, but he did have something to say about divorce. I don’t see the malevolent Christians passing any anti-divorce laws lately.",
  "timestamp": "2022-07-06 14:45:36",
  "score": 21985,
  "subreddit": "t5_2qh2p",
  "num_children": 221,
  "author": 336246,
  "replies": [
    {
      "id": "if4bc68",
      "text": "Hello r/all, Welcome to r/atheism!\n\nPlease read our [Commandments](http://www.reddit.com/r/atheism/wiki/guidelines) and [FAQ](http://www.reddit.com/r/atheism/wiki/FAQ) before commenting. If you follow the rules and act civilly we can avoid a lot of bans. While everyone is welcome here, this sub is intended for atheists to discuss things of interest to us. This means that a wide variety of subjects are on-topic here. This is not a sub about just atheism.\n\nRemember: The mods do not choose which posts get voted up the frontpage. They remove the posts that violate the [Commandments](/r/atheism/w/guidelines); they don't police quality.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*",
      "timestamp": "2022-07-06 20:30:39",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "if2wgc7",
      "text": "As a matter of fact, he hung out with the kind of people malevolent Christians seem to be focusing their attacks on.",
      "timestamp": "2022-07-06 14:47:24",
      "score": 1601,
      "num_children": 13,
      "author": 336246,
      "replies": [
        {
          "id": "if3g7p1",
          "text": "Yeah thats the messed up thing about modern day christians. They completely piss all over christs teachings with everything they say and do. If you really understand what jesus was saying you know he would be at every pride rally fighting FOR the lgbtq community. Christ's message was love but they only preach hatred.",
          "timestamp": "2022-07-06 16:56:13",
          "score": 830,
          "num_children": 22,
          "author": 104813,
          "replies": [
            {
              "id": "if3n0jf",
              "text": "They believe in Supply Side Jesus.\n\nThe Jewish guy was just another snowflake to them.",
              "timestamp": "2022-07-06 17:41:26",
              "score": 391,
              "num_children": 4,
              "author": 215225,
              "replies": [
                {
                  "id": "if3nss4",
                  "text": "Yeah, bible jesus would likely be a liberal socialist. He literally said to give up your possessions and give to the poor.",
                  "timestamp": "2022-07-06 17:46:41",
                  "score": 269,
                  "num_children": 5,
                  "author": 104813,
                  "replies": [
                    {
                      "id": "if43g1h",
                      "text": "yeah the whole \"let he who is without sin cast the first stone\" and \"a rich man getting into heaven is harder than fitting a camel through the eye of a needle\" goes out the window when their billionare religious fanatic campaign donors talk about lining us queers up to be shot\n\nnot only is a literal and superstitious interpretation of  the bible fucking stupid, but they dont even interpret it right. i hate christianity and i fucking hate america",
                      "timestamp": "2022-07-06 19:35:17",
                      "score": 237,
                      "num_children": 5,
                      "author": 116028,
                      "replies": [
                        {
                          "id": "if4kxux",
                          "text": "It's not that they don't interpret it right, it's that they don't bother interpreting the bits they don't like",
                          "timestamp": "2022-07-06 21:37:08",
                          "score": 85,
                          "num_children": 6,
                          "author": 250009,
                          "replies": [
                            {
                              "id": "if4rd0y",
                              "text": "It's both.",
                              "timestamp": "2022-07-06 22:22:16",
                              "score": 47,
                              "num_children": 1,
                              "author": 229246,
                              "replies": [
                                {
                                  "id": "if6p7sd",
                                  "text": "The Bible is Astro-theological. Abrabmaic religions are all Astro theology. The entire world doesn't interpret it right.Everyone is out here worshipping the stars and cosmos. Teachings kept alive since Ancient Egypt. Even atheism misses what religion really is by miles.",
                                  "timestamp": "2022-07-07 09:09:50",
                                  "score": -1,
                                  "num_children": 1,
                                  "author": 222369,
                                  "replies": [
                                    {
                                      "id": "if7kmvr",
                                      "text": "Abraham was a schizophrenic near-child murderer. Why does he have religions? Why would anyone want to interpret the ramblings of a man we would have locked up today?",
                                      "timestamp": "2022-07-07 14:20:43",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 229246,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "if59je0",
                              "text": "What percentage of American Christians actively read, nevermind read the Bible?\n\nAmerican Christianity just seems like an ant mill death spiral based more on itself than anything else.",
                              "timestamp": "2022-07-07 00:36:33",
                              "score": 20,
                              "num_children": 3,
                              "author": 340873,
                              "replies": [
                                {
                                  "id": "if6bdkw",
                                  "text": "Actually reading the entire Bible with the intent to place it in history was an early influence in my leaving the illusion behind.",
                                  "timestamp": "2022-07-07 06:08:11",
                                  "score": 5,
                                  "num_children": 0,
                                  "author": 180565,
                                  "replies": []
                                },
                                {
                                  "id": "if5p64q",
                                  "text": "I would guess 5%, for the Bible\n\nReading in general would have to track the national average",
                                  "timestamp": "2022-07-07 02:36:01",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 250009,
                                  "replies": []
                                },
                                {
                                  "id": "if76ox1",
                                  "text": "I'd say it's somewhere around 2%, and they're all ordained.",
                                  "timestamp": "2022-07-07 12:31:07",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 22642,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "if5mzxk",
                              "text": "\"There she lusted after her lovers, whose genitals we're like those of donkeys and whose emission was like that of horses .\"",
                              "timestamp": "2022-07-07 02:18:58",
                              "score": 10,
                              "num_children": 1,
                              "author": 346942,
                              "replies": [
                                {
                                  "id": "if720xm",
                                  "text": "50 shades of Christ",
                                  "timestamp": "2022-07-07 11:47:03",
                                  "score": 6,
                                  "num_children": 0,
                                  "author": 196581,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "if4uddy",
                              "text": "It’s all about the benefits",
                              "timestamp": "2022-07-06 22:43:49",
                              "score": 10,
                              "num_children": 0,
                              "author": 207635,
                              "replies": []
                            },
                            {
                              "id": "if5uv20",
                              "text": "This era of Christians don't even read the fucking book.",
                              "timestamp": "2022-07-07 03:22:49",
                              "score": 4,
                              "num_children": 0,
                              "author": 405994,
                              "replies": []
                            },
                            {
                              "id": "if7010p",
                              "text": "Some of them definitely do, but have realized they can't control people who follow the actual teachings, so they muddy the waters in order to retain control. The people at the top 100% know what it means, they also know it will pull money out of their pockets if they dared speak the truth.",
                              "timestamp": "2022-07-07 11:26:11",
                              "score": 3,
                              "num_children": 1,
                              "author": 327712,
                              "replies": [
                                {
                                  "id": "if99igm",
                                  "text": "It's funny, you know, religion in America is descended from the innovation of having a Bible the congregation could read and interpret themselves\n\nNow (and in the last however long) they are recreating the systems of control that older Christianity never gave up",
                                  "timestamp": "2022-07-07 20:55:19",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 250009,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "if5oqos",
                          "text": "> \"a rich man getting into heaven is harder than fitting a camel through the eye of a needle\"\n\nNever forget, many conservative Christians think 'the eye of a needle' was ancient slang for a city's gate, so it's actually super easy for a camel to pass through one.",
                          "timestamp": "2022-07-07 02:32:38",
                          "score": 2,
                          "num_children": 0,
                          "author": 367862,
                          "replies": []
                        },
                        {
                          "id": "if5pfzv",
                          "text": "“If you don’t like it , THEN LEAVE!” As if we wouldn’t go to any other non struggling nation with progressive policies that would have us. I’d immigrate to northern Europe or Canada in a heartbeat if I could gain citizenship or a green card work permit. But they are already overwhelmed taking in refugees from countries the US helped destroy or didn’t help because of their own self interests or apathy.",
                          "timestamp": "2022-07-07 02:38:13",
                          "score": 2,
                          "num_children": 0,
                          "author": 82649,
                          "replies": []
                        },
                        {
                          "id": "if6zzar",
                          "text": "Then you go to point out the issues with the democratic process and get told to quit being \"defeatist\" bitch it's reality, open your eyes.",
                          "timestamp": "2022-07-07 11:25:39",
                          "score": 2,
                          "num_children": 0,
                          "author": 47467,
                          "replies": []
                        },
                        {
                          "id": "if66qxa",
                          "text": "\n>but they dont even interpret it right.\n\nThat's what every denomination religion thinks about their peers anyway. Be better than them and stop this line of thinking.",
                          "timestamp": "2022-07-07 05:16:23",
                          "score": 1,
                          "num_children": 1,
                          "author": 59487,
                          "replies": [
                            {
                              "id": "if6ocgc",
                              "text": "while i generally agree with this sentiment, there's a huge difference between determining authorial intent using anthropological evidence + linguistic analysis VS. homophobic hate speech from a pastor who doesn't give a fuck about analyzing historical text \n\nfrom a spiritual standpoint it's impossible to interpret a \"right\" version of the bible. but from a historical perspective you can absolutely determine the most historically correct interpretation to date. \n\nthese bitches wouldn't know SHIT about the cultural practices and beliefs of a 30 A.D. civilization west of Mesopotamia under colonial occupation by Rome. smh",
                              "timestamp": "2022-07-07 08:57:51",
                              "score": 2,
                              "num_children": 0,
                              "author": 116028,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "if4obet",
                      "text": "I totally understand that take on it, and I somewhat agree. But it’s more likely he would be more on the anarchist spectrum. I doubt he would have been in favor of the government confiscating wealth to make everyone equal or anything like that. He advocated that people give their possessions to the poor out of kindness and goodwill.\n\nThat said, I’m still a socialist. I don’t have to base my beliefs on the sayings of a guy who died 2000 years ago in a totally different culture and region of the world.",
                      "timestamp": "2022-07-06 22:00:42",
                      "score": 27,
                      "num_children": 3,
                      "author": 324500,
                      "replies": [
                        {
                          "id": "if5chfo",
                          "text": "“Give all your earthly possessions to the poor or you don’t have a place in heaven.” doesn’t sound too forceful… except when you consider that the alternative is burning in eternal, non-consuming, hellfire literally forever. 🙃",
                          "timestamp": "2022-07-07 00:58:42",
                          "score": 11,
                          "num_children": 0,
                          "author": 152024,
                          "replies": []
                        },
                        {
                          "id": "if5dz5e",
                          "text": "\"Render unto Caesar the things that are Caesar's, and unto God the things that are God's\" - Matthew 22:21\n\nDoesn't seem all that anarchist",
                          "timestamp": "2022-07-07 01:09:53",
                          "score": 21,
                          "num_children": 2,
                          "author": 314859,
                          "replies": [
                            {
                              "id": "if5zo51",
                              "text": "More like “Don’t fight the government. Obey them up to the point where their laws conflict with God’s laws, but no further.”\n\nThat’s just being pragmatic. But it shows a clear defiance of the government, despite the common interpretation. He’s suggesting that “giving to God what is God’s” might conflict with what the government demands of you, and it’s your responsibility to disobey the government in those circumstances. In context, he’s basically dodging the question of why he’s refusing to obey the law, and turning it back around on the accuser.\n\nIn some ways it’s a more pragmatic libertarian kind of viewpoint. Yet his ideals are very socialist. The government doesn’t really factor into his worldview except insofar as it’s necessary to coexist with it and deal with it. But none of his demands of humanity involved duties of the government in any way (although the older prophets did talk about that extensively).\n\nSo that’s why I think he has a more anarchist bent. Like communism without the strong arm of the government to enforce communist ideals and behaviors. It’s a voluntaristic/anarchistic version of communism.",
                              "timestamp": "2022-07-07 04:05:16",
                              "score": 4,
                              "num_children": 1,
                              "author": 324500,
                              "replies": [
                                {
                                  "id": "if62ple",
                                  "text": "Anarchists are generally some flavour of socialist/communist. \n\nAlso, 'Libertarian' was originally a euphemism for anarchist; right-wing 'libertarians' are the newer anomaly, historically the term is for leftists",
                                  "timestamp": "2022-07-07 04:34:32",
                                  "score": 6,
                                  "num_children": 1,
                                  "author": 321082,
                                  "replies": [
                                    {
                                      "id": "if68exs",
                                      "text": "True. And that’s sort of what I had in mind as I wrote that. The classic communist/anarchist movement was mostly pre-Stalin. Around the time of Stalin, many communists had convinced themselves that the only way to implement communist ideals was to capture the power of government (which was hitherto captured by capitalists), and that’s where modern notions of “communist government” were formed.\n\nWhether that modern version of communism is right or wrong is a topic for another day, but that’s usually what people mean when they invoke the word “communism.” So while it’s probably true that Jesus had some communist ideas, it doesn’t follow that he would prefer to capture the power of the state to implement his vision.",
                                      "timestamp": "2022-07-07 05:34:32",
                                      "score": 3,
                                      "num_children": 0,
                                      "author": 324500,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "if7bvko",
                              "text": "Yeah, the bible, including the new testament, was very conservative and pro-hierarchy, by our standards at least, anyone who thinks otherwise is fooling themselves.  \n\nJesus may have been a progressive compared to some others of his time, but certainly not by today's standards.",
                              "timestamp": "2022-07-07 13:14:39",
                              "score": 1,
                              "num_children": 0,
                              "author": 40547,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "if7bj83",
                          "text": "Anarchism is a form of socialism...  \n\nSocialism isn't when the government \"makes everyone equal\", socialism is when private property is abolished.\n\nYou seem to be thinking of anarcho capitalism, which isn't actual anarchism it's just a mask for fascists to hide behind.",
                          "timestamp": "2022-07-07 13:11:54",
                          "score": 2,
                          "num_children": 1,
                          "author": 40547,
                          "replies": [
                            {
                              "id": "if7fjk8",
                              "text": "Any ideology which advocates or accommodates the absence of a state is an anarchist ideology. It can involve any kind of economic configuration. Just because you’re a leftist who wants to own the word “anarchism” doesn’t mean you’re correct in doing so.\n\nThe original anarchists were mostly communists, but that was pre-Stalin. Since then, most communists have been statists. It makes sense that anarchism at that time had a communist bent, because the western governments of that era were essentially captured by capitalist oligarchs. But ever since socialism entered the mainstream of governance (in Europe, the US, South America, China, etc.), we have seen an anarchist movement on the rise that favors capitalism.\n\nTo equate them with fascists is absurd. I have no doubt there are people who call themselves anarcho-capitalists but are actually fascist in their beliefs. But fascism is inherently pro-government. Fascism is all about capturing the power of the state by any means necessary in order to enforce a nationalist (and perhaps xenophobic) agenda, where autocracy is often preferred, because their power must be absolute. Anarchism is fundamentally at odds with every aspect of that.",
                              "timestamp": "2022-07-07 13:43:20",
                              "score": -1,
                              "num_children": 1,
                              "author": 324500,
                              "replies": [
                                {
                                  "id": "if7hr90",
                                  "text": ">Any ideology which advocates or accommodates the absence of a state is an anarchist ideology.\n\nAny ideology that retains the existence of private property does not advocate or accomodate the absence of a state. \n\nBesides, even if that wasn't the case and it was somehow possible to have private property without having a state, anarchism has never been solely about abolishing the state, anarchism is about opposing hierarchies, capitalism represents one of the most powerful hierarchies imaginable so the idea that it's compatible with anarchism is ludicrous.\n\n>Just because you’re a leftist who wants to own the word “anarchism” doesn’t mean you’re correct in doing so.\n\nAnarchism has always been leftist, I *am* right in doing so.\n\n>But ever since socialism entered the mainstream of governance (in Europe, the US, South America, China, etc.), we have seen an anarchist movement on the rise that favors capitalism.\n\nLMAO when did socialism enter the mainstream?\n\n>To equate them with fascists is absurd. I have no doubt there are people who call themselves anarcho-capitalists but are actually fascist in their beliefs. But fascism is inherently pro-government.\n\nCapitalism is inherently pro government.  \nThey're not just fascists they're also liars.  \n\nNot a single ancap I have ever seen has actually been against hierarchies or against the state.\n\n>Anarchism is fundamentally at odds with every aspect of that. \n\nAgreed, lying assholes who call themselves ancaps are not though.",
                                  "timestamp": "2022-07-07 13:59:47",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 40547,
                                  "replies": [
                                    {
                                      "id": "if7k6m8",
                                      "text": "Dude, of course you can have private property in the absence of the state. It just falls upon your shoulders (or the shoulders of a collective group) to secure that ownership and prevent theft. The state doesn’t magically give us a notion of private property.\n\nAnd the kind of anarchism you’re talking about is classical anarchism. There are many forms of anarchism that are not inherently socialist or communist. If you read the Wikipedia entry on anarchism, you’ll find a wide diversity of philosophies within the umbrella of anarchism.\n\nIt’s insane to think that you can’t have a severe reduction or abolition of hierarchy within a capitalist economy. It’s just called “free commerce involving private property”. The pre-conditions for that involve heavy emphasis on collectivism among workers, allowing them to have very strong bargaining power in the market. Basically, capitalism becomes non-exploitative when the workers are equitably compensated for their labor, and the financier or “owner of the means of production” benefits commensurately with the initial provision of capital, which is required to get a business off the ground. Imagine if, by common law, all the shareholders of a corporation had to be the employees of that corporation. That would bring wealth to the workers themselves, to the point where each of them has an opportunity of owning capital. Of course there will still be some degree of inequality, but you could easily abolish the “wage slavery” issue altogether.\n\nAre most anarchists leftists? Sure, but that doesn’t mean they can’t be capitalist or libertarian as well. That should be obvious.",
                                      "timestamp": "2022-07-07 14:17:33",
                                      "score": -1,
                                      "num_children": 1,
                                      "author": 324500,
                                      "replies": [
                                        {
                                          "id": "if7lyzd",
                                          "text": ">Dude, of course you can have private property in the absence of the state. It just falls upon your shoulders (or the shoulders of a collective group) to secure that ownership and prevent theft. The state doesn’t magically give us a notion of private property.\n\nTo believe that requires complete willful ignorance of the fact that markets tend towards monopoly.  \nAbolishing the state would only serve to accelerate the accumulation of wealth of capitalists and would result in a feudalist society ruled by a noble class that each have their own domain while lording over a bunch of serfs without any property.  \n\nCompany towns but times 1.000.000\n\n>It’s insane to think that you can’t have a severe reduction or abolition of hierarchy within a capitalist economy.\n\nI don't think that, but such a reduction is not achieved by starting with abolishing the state and letting the free market run completely wild, that achieves the exact opposite it gives the wealthy even more wealth and power.  \nEverything ancaps call for would only make the capitalist system more hierarchical. \n\n>Basically, capitalism becomes non-exploitative when the workers are equitably compensated for their labor, and the financier or “owner of the means of production” benefits commensurately with the initial provision of capital, which is required to get a business off the ground.\n\nCapitalism is inherently exploitative. When you have a private owner of the means of production, using their ownership of the means of production as leverage over workers, in order to demand a portion of the fruits of their labor, then you're exploiting workers by exploiting your private property rights.",
                                          "timestamp": "2022-07-07 14:30:18",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 40547,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "if51wuo",
                      "text": "So you mean a leftist? I think liberal socialist is a bit of an oxymoron... But I get what you mean",
                      "timestamp": "2022-07-06 23:39:19",
                      "score": 1,
                      "num_children": 0,
                      "author": 214639,
                      "replies": []
                    },
                    {
                      "id": "if49wm0",
                      "text": "Voluntarily give.\n\nNot force others to share, thus robbing them of moral agency and fostering resentment.",
                      "timestamp": "2022-07-06 20:20:53",
                      "score": -16,
                      "num_children": 2,
                      "author": 303620,
                      "replies": [
                        {
                          "id": "if4afm7",
                          "text": "Socialism is not when the government does things. Its a voluntary association of workers.",
                          "timestamp": "2022-07-06 20:24:27",
                          "score": 13,
                          "num_children": 0,
                          "author": 7785,
                          "replies": []
                        },
                        {
                          "id": "if4rfc3",
                          "text": "He also said pay taxes.",
                          "timestamp": "2022-07-06 22:22:43",
                          "score": 4,
                          "num_children": 1,
                          "author": 229246,
                          "replies": [
                            {
                              "id": "if4vn0j",
                              "text": "\"Go to the lake and throw out your line. Take the first fish you catch; open its mouth and you will find a four-drachma coin. Take it and give it to them for my tax and yours\"",
                              "timestamp": "2022-07-06 22:52:55",
                              "score": -1,
                              "num_children": 1,
                              "author": 303620,
                              "replies": [
                                {
                                  "id": "if7u2vm",
                                  "text": "No. \n\nMatthew 22:20-22\nKing James Version\n20 And he (Jesus) saith unto them, Whose is this image and superscription?\n\n21 They say unto him, Caesar's. Then saith he unto them, Render therefore unto Caesar the things which are Caesar's; and unto God the things that are God's.",
                                  "timestamp": "2022-07-07 15:25:12",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 229246,
                                  "replies": [
                                    {
                                      "id": "if93gzx",
                                      "text": "This leaves wide open the interpretation of what is Caesar's.",
                                      "timestamp": "2022-07-07 20:17:29",
                                      "score": 0,
                                      "num_children": 1,
                                      "author": 303620,
                                      "replies": [
                                        {
                                          "id": "if94u1u",
                                          "text": "Or you're just wrong.",
                                          "timestamp": "2022-07-07 20:25:56",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 229246,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "if4mgrf",
                      "text": "You clearly haven’t read a bible. Like ever. Lol. And you’re “anti-theist”? Gtfo 🤮",
                      "timestamp": "2022-07-06 21:47:50",
                      "score": -6,
                      "num_children": 1,
                      "author": 403699,
                      "replies": [
                        {
                          "id": "if4nldg",
                          "text": "I grew up in a very religious household and have read through the bible many times. I was a hardcore christian at one point. My point is the jesus modern christians worship is a pretty far cry from bible jesus.",
                          "timestamp": "2022-07-06 21:55:40",
                          "score": 3,
                          "num_children": 1,
                          "author": 104813,
                          "replies": [
                            {
                              "id": "if4qcss",
                              "text": "No. “Bible” jeebus is a hateful, divisive and foolish person. Credulous and jealous. Judge-mental and proud of it. Your bible must have been for kids or something. Go get another one and read again. In no way was this man peaceful or intelligent. Just because he was purported saying love this or love that, he also said to hate your family if necessary and he made a weapon to threaten and possibly beat people with. He was in no way supportive of homosexuality either. Seems like you still have christian bias there.",
                              "timestamp": "2022-07-06 22:15:11",
                              "score": -3,
                              "num_children": 1,
                              "author": 403699,
                              "replies": [
                                {
                                  "id": "if4svhs",
                                  "text": "Can you provide examples from the New Testament? I don't recall anything like what you're describing.",
                                  "timestamp": "2022-07-06 22:33:02",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 340949,
                                  "replies": [
                                    {
                                      "id": "if5ja8g",
                                      "text": "Matthew 10:34-38. \n>Do not suppose that I have come to bring peace to the earth. I did not come to bring peace, but a sword. 35 For I have come to turn “‘a man against his father,\n    a daughter against her mother,\na daughter-in-law against her mother-in-law—\n36  a man’s enemies will be the members of his own household.’[c] 37 “Anyone who loves their father or mother more than me is not worthy of me; anyone who loves their son or daughter more than me is not worthy of me. 38 Whoever does not take up their cross and follow me is not worthy of me.",
                                      "timestamp": "2022-07-07 01:50:07",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 127668,
                                      "replies": [
                                        {
                                          "id": "ifc0ptc",
                                          "text": "Given that Jesus is almost certainly a largely fictional character, this makes more sense given the times during which these documents were written.",
                                          "timestamp": "2022-07-08 12:02:07",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 340949,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "if46b3o",
                  "text": "I saw that the other day, that concept is too deep for these numb nuts to understand. \nOn related note: I kinda like Table Flipping-whipping merchants Jesus. He’s upset his Fathers temple is used for money changing, selling doves and animals , and loses it. I like a guy like that. Religion and Profiteering don’t go together. Even the Jews had some laws/customs against Usury.",
                  "timestamp": "2022-07-06 19:55:37",
                  "score": 43,
                  "num_children": 3,
                  "author": 257846,
                  "replies": [
                    {
                      "id": "if4p9dz",
                      "text": "Charging interest for a loan is also expressly forbidden throughout the Bible. They tie themselves in knots to get out of the fact that God commands all men to never charge interest on a loan because doing so is evil in the eyes of God. \n\nThey are all fucking hypocrites.",
                      "timestamp": "2022-07-06 22:07:23",
                      "score": 30,
                      "num_children": 1,
                      "author": 248056,
                      "replies": [
                        {
                          "id": "if5cab8",
                          "text": "Pretty sure this is why Jews went into banking and such. They weren't afraid to handle money and deal with the business of it.",
                          "timestamp": "2022-07-07 00:57:13",
                          "score": 7,
                          "num_children": 0,
                          "author": 200652,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "if6zl9v",
                      "text": "No he doesn't loose it.\n\nHe braided his own whip. Braiding a whip takes a *minimum* of 3 hours. This wasn't a burst of anger that you or I might have where we do something in the moment.\n\nThis was true, seething, unyielding rage.\n\nCould you imagine being one of his followers? \"Jesus you ok buddy?\" And just watching this beacon of peace muttering under his breath hunched over 3 lengths of leather about taining his fathers house with earthly worries such as money?",
                      "timestamp": "2022-07-07 11:21:28",
                      "score": 3,
                      "num_children": 1,
                      "author": 35079,
                      "replies": [
                        {
                          "id": "if748as",
                          "text": "Mumbling, Seething Jesus, planning an ass kicking, I like it.",
                          "timestamp": "2022-07-07 12:08:33",
                          "score": 2,
                          "num_children": 0,
                          "author": 257846,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "if4oj39",
                      "text": "May I introduce you to Scientology?",
                      "timestamp": "2022-07-06 22:02:11",
                      "score": 5,
                      "num_children": 1,
                      "author": 324500,
                      "replies": [
                        {
                          "id": "if4q89n",
                          "text": "I never read up their crazy book, (Dianetics?) Don’t care for new age fantasy bullshit, other planets, and BS so stupid that a Fantasy writer guy authored. I like science sci-fi, No magic, No wizards , No spells, and definitely not recording my own secrets and insecurities so cult leadership can take advantage of me? F-That. (Auditing??? Audit this,🍆)",
                          "timestamp": "2022-07-06 22:14:18",
                          "score": 6,
                          "num_children": 0,
                          "author": 257846,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "if5g5f3",
                  "text": "Thought demand side Jesus would be more apt",
                  "timestamp": "2022-07-07 01:26:17",
                  "score": 1,
                  "num_children": 0,
                  "author": 211073,
                  "replies": []
                },
                {
                  "id": "if7jvfu",
                  "text": "\n[Prosperity Gospel & Supply Side Jesus:](https://i.imgur.com/1MhJ0U1.jpg)",
                  "timestamp": "2022-07-07 14:15:17",
                  "score": 1,
                  "num_children": 0,
                  "author": 54049,
                  "replies": []
                }
              ]
            },
            {
              "id": "if3r9ny",
              "text": "Christ told you to leave your family to follow him. Fuck off, Jesus!",
              "timestamp": "2022-07-06 18:10:02",
              "score": 19,
              "num_children": 0,
              "author": 323838,
              "replies": []
            },
            {
              "id": "if3h4l3",
              "text": "> Christ's message was love\n\nExcept for fig trees...",
              "timestamp": "2022-07-06 17:02:18",
              "score": 84,
              "num_children": 6,
              "author": 168725,
              "replies": [
                {
                  "id": "if3m7ph",
                  "text": "God hates FIGS!\n\n*fixed that anti-gay sign for ya real quick*",
                  "timestamp": "2022-07-06 17:36:08",
                  "score": 62,
                  "num_children": 1,
                  "author": 323678,
                  "replies": [
                    {
                      "id": "if3vvba",
                      "text": "He has no mercy for those who \"show the fig\"!",
                      "timestamp": "2022-07-06 18:41:57",
                      "score": 15,
                      "num_children": 2,
                      "author": 407907,
                      "replies": [
                        {
                          "id": "if3zmco",
                          "text": "I get what you wrote there, you Word Power graduate!",
                          "timestamp": "2022-07-06 19:08:11",
                          "score": 5,
                          "num_children": 0,
                          "author": 74222,
                          "replies": []
                        },
                        {
                          "id": "if4b7gz",
                          "text": "I strongly disagree sir. God adores figs. Think of all the figgy pudding that his adherents sing about.",
                          "timestamp": "2022-07-06 20:29:45",
                          "score": 3,
                          "num_children": 0,
                          "author": 355295,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "if3i4v8",
                  "text": "He had a case of the Mondays",
                  "timestamp": "2022-07-06 17:09:04",
                  "score": 9,
                  "num_children": 0,
                  "author": 296356,
                  "replies": []
                },
                {
                  "id": "if3z9dz",
                  "text": "And pigs. Can't forget about the herd of posessed piggies.",
                  "timestamp": "2022-07-06 19:05:39",
                  "score": 8,
                  "num_children": 0,
                  "author": 275613,
                  "replies": []
                },
                {
                  "id": "if4uu4l",
                  "text": "Ironically, he did somebody a favor. The Roman tax code was *strict* to the point that if you had any fruit trees on your land, you were taxed for each and every tree, whether or not it was producing and making you money or not. A non-productive fig tree didn’t just not give you figs, it represented a financial loss every year it failed. Of course, if it just happened to die of “natural causes” you wouldn’t be on the hook anymore…\n\nAs stated, the man did somebody a solid. 🤣",
                  "timestamp": "2022-07-06 22:47:10",
                  "score": 7,
                  "num_children": 0,
                  "author": 42240,
                  "replies": []
                },
                {
                  "id": "if3hkj3",
                  "text": "Fig trees? You're gonna have to jog my memory. Been a minute since i last read any of the bible.",
                  "timestamp": "2022-07-06 17:05:15",
                  "score": 16,
                  "num_children": 3,
                  "author": 104813,
                  "replies": [
                    {
                      "id": "if3i487",
                      "text": "He wanted figs, but the tree he was walking past didn't have any ripe, so he cursed it, lol. Even Jesus got hangry.",
                      "timestamp": "2022-07-06 17:08:57",
                      "score": 76,
                      "num_children": 2,
                      "author": 276494,
                      "replies": [
                        {
                          "id": "if41ewq",
                          "text": "We wanted instant grati-fig-ation.",
                          "timestamp": "2022-07-06 19:20:58",
                          "score": 24,
                          "num_children": 1,
                          "author": 378423,
                          "replies": [
                            {
                              "id": "if5e4dr",
                              "text": "Take my angry upvote and go away",
                              "timestamp": "2022-07-07 01:10:59",
                              "score": 3,
                              "num_children": 0,
                              "author": 164493,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "if3w2ui",
                          "text": "It's one of those passages that should be problematic if you're pretending Jesus was a real magical dude (aside from all the other supernatural nonsense in the Gospels, of course), but it makes sense when taken as a metaphor.\n\nThe moral of the metaphor was, \"Don't get caught with your pants down when Jesus returns.\"\n\nJust like all the Moses parallels in the Gospel of Matthew, this should really make it clear that this is a sort of genre fiction of its day, designed to get a message across rather than to report history.  As if being written many decades later than when the events supposedly happened wasn't already a clue.",
                          "timestamp": "2022-07-06 18:43:26",
                          "score": 34,
                          "num_children": 3,
                          "author": 181137,
                          "replies": [
                            {
                              "id": "if42yv5",
                              "text": "So many retcons in that Bible fan fiction.... The MCU looks realistic and coherent in comparison.\n\nThere goes Matthew with the friggn zombies again....  Come on dude.... Stick with the main plot. Modern audiences don't need this walking dead sideshow.",
                              "timestamp": "2022-07-06 19:31:53",
                              "score": 19,
                              "num_children": 1,
                              "author": 53757,
                              "replies": [
                                {
                                  "id": "if5s7dr",
                                  "text": "Haha and the king James version no less. What would marvel be like if Biden said, just to rewrite it but spin up the good citizen parts for worker compliance. \n\n12 captain america movies.",
                                  "timestamp": "2022-07-07 03:00:42",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 306197,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "if4dvls",
                              "text": "\"Give me fruit now or I'll tell my dad and he'll kill you by tomorrow.\"\n\nI don't see how that's anything but textbook extortion.",
                              "timestamp": "2022-07-06 20:48:10",
                              "score": 6,
                              "num_children": 0,
                              "author": 91861,
                              "replies": []
                            },
                            {
                              "id": "if4x43f",
                              "text": "Lol you sound so butthurt. It’s common knowledge if something isn’t immediately written down it never happened.",
                              "timestamp": "2022-07-06 23:03:39",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "if3hyvm",
                      "text": "[Fig tree didn't have fruit, so jeebus got pissy and killed it with a curse](https://www.biblegateway.com/passage/?search=Mark%2011%3A12-25&version=NIV)",
                      "timestamp": "2022-07-06 17:07:56",
                      "score": 37,
                      "num_children": 3,
                      "author": 168725,
                      "replies": [
                        {
                          "id": "if3j3te",
                          "text": "Lol, forgot about that verse. You'd think if he was so powerful as to walk on water, turn water into wine, and feed 4000 people with a bit of bread and fish that he could make a fig tree bare fruit out of season. I guess he had a tendency to get hangry.",
                          "timestamp": "2022-07-06 17:15:33",
                          "score": 42,
                          "num_children": 1,
                          "author": 104813,
                          "replies": [
                            {
                              "id": "if4455r",
                              "text": "It was a metaphor. Basically he was mad at the church for pushing merch. So he made up the IHOP then told everyone about \"the secret\".\nOr something like that.",
                              "timestamp": "2022-07-06 19:40:17",
                              "score": 8,
                              "num_children": 0,
                              "author": 53757,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "if53055",
                          "text": "Kewl. Found a way I'm like Jesus. Thought I was propagating a black currant. Couple years later I have fucking gooseberries. Ripped that fucker out of the ground yesterday.",
                          "timestamp": "2022-07-06 23:47:28",
                          "score": 5,
                          "num_children": 0,
                          "author": 22679,
                          "replies": []
                        },
                        {
                          "id": "if655ip",
                          "text": "The tree didn’t have fruit cause it wasn’t even in season. Jesus was pissed that his coffee shop didn’t have pumpkin spice lattes in May, so he called his mafia buddies (daddy) to burn the place down.",
                          "timestamp": "2022-07-07 04:59:37",
                          "score": 2,
                          "num_children": 0,
                          "author": 170849,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "if3i5fo",
                      "text": "I believe jesus cursed a fig tree because it beared no fruit",
                      "timestamp": "2022-07-06 17:09:11",
                      "score": 5,
                      "num_children": 1,
                      "author": 26830,
                      "replies": [
                        {
                          "id": "if3q2h4",
                          "text": "Out of season.",
                          "timestamp": "2022-07-06 18:01:48",
                          "score": 14,
                          "num_children": 0,
                          "author": 215411,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "if4wj2o",
                  "text": "Also that whole apocalypse thing that he said would happen within the lifetimes of his disciples. And that families should turn against one another if they didn't follow him. Also the condoning of all the OT murder.",
                  "timestamp": "2022-07-06 22:59:24",
                  "score": 2,
                  "num_children": 0,
                  "author": 320337,
                  "replies": []
                }
              ]
            },
            {
              "id": "if3ltwx",
              "text": "that was jesus. American jesus loves nascar, guns, hates womens rights to choose but loves capital punishment and war.",
              "timestamp": "2022-07-06 17:33:35",
              "score": 39,
              "num_children": 1,
              "author": 307335,
              "replies": [
                {
                  "id": "if4527l",
                  "text": "It is almost like people just believe whatever their current culture pushes them to believe with no regard to the religion they claim is the source of all morality. Weird.\n\nSuch Independent thinkers they are.",
                  "timestamp": "2022-07-06 19:46:44",
                  "score": 29,
                  "num_children": 1,
                  "author": 53757,
                  "replies": [
                    {
                      "id": "if5tnza",
                      "text": "Church is just a social club to be seen at on Sundays, anyway. No one actually tries to listen to what they say in there. You just need to be seen in your new hat.",
                      "timestamp": "2022-07-07 03:12:45",
                      "score": 2,
                      "num_children": 0,
                      "author": 373823,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "if496hc",
              "text": "I went to the Pride Festival a couple weekends ago. You had your usual dudes outside spewing hatred and poison as you walked in. \n\nBut seeing churches on the inside with tents set up offering support was heart warming to see and it was a great reminder that there ARE Christians out there fighting the good fight. They are just hard to see/hear over that REALLY loud minority",
              "timestamp": "2022-07-06 20:15:52",
              "score": 22,
              "num_children": 0,
              "author": 387574,
              "replies": []
            },
            {
              "id": "if4tjyk",
              "text": "FFS can we stop talking about Christ's teachings as if they were or are legitimate today? We may as well be discussing the origin of the goddamn infinity gauntlet...\n\nThe entirety of Christianity (and all Abrahamic religions)  is fucking fiction. Once we can accept that as a species, WE MOVE FORWARD.",
              "timestamp": "2022-07-06 22:37:54",
              "score": 4,
              "num_children": 0,
              "author": 98021,
              "replies": []
            },
            {
              "id": "if4mbwd",
              "text": "Lol is that a joke? The guy who made a whip to chase and threaten (possibly assault) people with, the guy who said to love ONLY him and to hate your family if necessary, the guy who cursed a fig tree….was all about “love” and supportive of “sinful” lifestyles like homosexuality?\n\nFirst off, show me that he even existed. \nSecond, if the character is to be taken literally, his personality was hateful, divisive and bizarre to say the very least. \nThird, these christians who hate and judge people so brazenly and openly seem to be following the bible to a T. Your attempt at the No-True-christian fallacy only makes the matter worse. Instead of acknowledging the facts, you want to act as if they’re just misrepresenting jeebus and blah blah blah. The facts are that you don’t even know if a jeebus existed, let alone was a magical genie. You also are wrong about his character. He was a foolish, arrogant cult leader IF he was real and was as reported.",
              "timestamp": "2022-07-06 21:46:54",
              "score": -1,
              "num_children": 1,
              "author": 403699,
              "replies": [
                {
                  "id": "if4valy",
                  "text": "None of what you just said is really relevant to the point you're arguing against - least of all whether he was real or existed.\n\nThe point is that Christians believe he existed, and was the son of God, and claim to follow his teachings, yet their behaviour is consistently counter to those teachings they claim to follow.\n\nThe point here isn't about whether their religion is correct or true or valid, it's about hypocrisy among some of the followers.",
                  "timestamp": "2022-07-06 22:50:28",
                  "score": 6,
                  "num_children": 1,
                  "author": 35968,
                  "replies": [
                    {
                      "id": "if4xi1s",
                      "text": "Okie dokie. 🤦🏻‍♂️",
                      "timestamp": "2022-07-06 23:06:30",
                      "score": -3,
                      "num_children": 0,
                      "author": 403699,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "if4pxil",
              "text": "Ummm no i dont think he would. Jesus would adhere to the jewish law he was brought up from. This is shown by how jesus quotes prophets and law from the old testament. Jewish law would not condone same sex marraige or relations.\n\nThe difference is that the pharassies and saduces that murdered jesus, his jewish bretheren. Would be the ones who would be hurt others at pride events. \n\nJesus, the son of god, would defend you because he sees all humans as sinful and in need of a savior. We are all equal in this regard. Not because he thinks your earthly ideas hold any merit.",
              "timestamp": "2022-07-06 22:12:11",
              "score": 1,
              "num_children": 0,
              "author": 247109,
              "replies": []
            },
            {
              "id": "if4lsr6",
              "text": "A (not American) conservative Christian friend of mine was my biggest fear for coming out as trans. He doesn't understand my struggles at all but he totally accepts me and if I struggle with anything he'll be glad to sit down with me and listen to my rants or shit talk clichés.\n\nHe is in a church but part of a smaller group of Christians that are a lot more modern as it seems.",
              "timestamp": "2022-07-06 21:43:11",
              "score": 1,
              "num_children": 0,
              "author": 49095,
              "replies": []
            },
            {
              "id": "if4p2db",
              "text": "I've read the first few books of the new testament which is kind of redundant really, one is enough. And I've tried to read the last one. Plus little bits here and there as they come up. I don't know where you get the idea that understand the teaching of Jesus would put you at pride parades. Which teachings specifically?",
              "timestamp": "2022-07-06 22:06:00",
              "score": 1,
              "num_children": 0,
              "author": 2498,
              "replies": []
            },
            {
              "id": "if4pelc",
              "text": "I lack the articulation to make this point. \n\nBut they basically white washed Christianity. Jesus is just a white dude that seemingly has the same values as your average sexist, racist, capitalistic, colonial nepotist slave owner to them. \n\nNever mind what the actual texts and history have to say.",
              "timestamp": "2022-07-06 22:08:24",
              "score": 1,
              "num_children": 0,
              "author": 28873,
              "replies": []
            },
            {
              "id": "if518f9",
              "text": "You’ve not met GOP Jesus?\n\nhttps://youtu.be/SZ2L-R8NgrA",
              "timestamp": "2022-07-06 23:34:15",
              "score": 1,
              "num_children": 0,
              "author": 339333,
              "replies": []
            },
            {
              "id": "if545q9",
              "text": "Pastors that can broadcast their message teach their flock. Jesus has nothing to do with it.",
              "timestamp": "2022-07-06 23:56:12",
              "score": 1,
              "num_children": 0,
              "author": 18138,
              "replies": []
            },
            {
              "id": "if5a4o8",
              "text": "Jesus replied: “‘Love the Lord your God with all your heart and with all your soul and with all your mind.'  This is the first and greatest commandment. And the second is like it: ‘Love your neighbor as yourself.’ All the Law and the Prophets hang on these two commandments\" -Matthew 22:35-40\n\nJesus also came to fulfill the law in that, it's through him you get that relationship with God, not by upholding an entire novel of Jewish law.\n\nThis is what is frustrating I see these posts lumpingin and condemning all Christians, but those in power are the one tarnishing to image.\n\nThey're basing their Christianity over pre Christ.\n\nI do t like to enforce my crap on people or talk about this, but where I live, th most talked about Christian church in the area has most of it's members commiting to try and reduce homelessness, doing feeds and overall loving their neighbors as themselves.\n\nTruly happy people also sickened by what's going on. But they go to the root, and help th widows and orphans.\n\nThat's what's wrong with a lot of this. People don't love their neighbors, because they dont love themselves. And it trickles down as well.\n\nStop hting on people with different views. Take an inward look. Be the better person. Shits got you divided without realizing it. Stop hating all Christians because of 6/3 \"christians\" on the top floor.\n\nSeriously. Do better. You're better than that.\n\nThanks for letting me rant.",
              "timestamp": "2022-07-07 00:40:58",
              "score": 1,
              "num_children": 0,
              "author": 142742,
              "replies": []
            },
            {
              "id": "if66xme",
              "text": "Jesus would be for banning homosexual marrage. Jesus was a jew, ỷes? In the torah, the punishment for homosexuality was stoning…",
              "timestamp": "2022-07-07 05:18:24",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "if68e7r",
                  "text": "Jesus had a lot of ideas that weren't in line with the Torah. That was kind of the point.",
                  "timestamp": "2022-07-07 05:34:19",
                  "score": 1,
                  "num_children": 1,
                  "author": 318636,
                  "replies": [
                    {
                      "id": "if80o8g",
                      "text": "But, he had to use the old testament torah to convince his early followers",
                      "timestamp": "2022-07-07 16:08:28",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "if8cmkp",
                          "text": "That in no way supports the claim that Jesus would have been anti-gay.",
                          "timestamp": "2022-07-07 17:25:31",
                          "score": 1,
                          "num_children": 0,
                          "author": 318636,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "if6b9qb",
              "text": "most of them havent actually read the bible to be fair, its not that hard, even for an atheist you cant loose the message on each passage, i dont know how these idiots dont get the most basic stuff of treating everyone with care and love and equally xd",
              "timestamp": "2022-07-07 06:06:57",
              "score": 1,
              "num_children": 0,
              "author": 131582,
              "replies": []
            },
            {
              "id": "if6q4gd",
              "text": "That's because they cherry picked topics and fear mongered the fuck out of them to brainwash them it's easy because religious people don't need evidence to believe anything. Also if you show them evidence of the opposite, they're so indoctrinated they'll vehemently oppose it.",
              "timestamp": "2022-07-07 09:22:26",
              "score": 1,
              "num_children": 0,
              "author": 94091,
              "replies": []
            },
            {
              "id": "if6vq8j",
              "text": "My sister's father once told me this: ''Look, if they all would be following the teachings of Jesus, none of those guys would be allowed to own anything or have money''",
              "timestamp": "2022-07-07 10:36:43",
              "score": 1,
              "num_children": 0,
              "author": 110469,
              "replies": []
            },
            {
              "id": "if6wi5u",
              "text": "Theyve always done that. Just different things in different time periods.",
              "timestamp": "2022-07-07 10:46:13",
              "score": 1,
              "num_children": 0,
              "author": 93328,
              "replies": []
            },
            {
              "id": "if733ic",
              "text": "Not even close to true. Google the old testament",
              "timestamp": "2022-07-07 11:57:39",
              "score": 1,
              "num_children": 0,
              "author": 253643,
              "replies": []
            },
            {
              "id": "if7ba4g",
              "text": "Ehhh, he'd be preaching to hate the sin but love the sinner. That's not exactly what I'd consider fighting FOR LGBT+ people, it's just fighting less hard against them.",
              "timestamp": "2022-07-07 13:09:50",
              "score": 1,
              "num_children": 0,
              "author": 40547,
              "replies": []
            },
            {
              "id": "if84bb8",
              "text": "If they actually followed their religion and Christ’s teachings there’d be a lot more Mr. Rogers’ in the world and less of whatever this contorted version is.",
              "timestamp": "2022-07-07 16:32:18",
              "score": 1,
              "num_children": 0,
              "author": 158128,
              "replies": []
            }
          ]
        },
        {
          "id": "if4gy42",
          "text": "Modern Christians are the new Pharisees",
          "timestamp": "2022-07-06 21:09:19",
          "score": 2,
          "num_children": 0,
          "author": 169071,
          "replies": []
        },
        {
          "id": "if4803z",
          "text": "No no no.  Modern Christian thought is to cherry pick the whole f- Bible.  Not this sort of book of truth thing you just outright take what you like and use it.  \n\nSilly atheist.",
          "timestamp": "2022-07-06 20:07:39",
          "score": 1,
          "num_children": 1,
          "author": 362222,
          "replies": [
            {
              "id": "if4a87p",
              "text": "The whole fi king bible is so problematic that for the majority of the history of Christianity it was kept in a language that 99% of followers couldn’t read.        \nThe scripture was basically told as whatever message the church wanted it to be.        \nThe bible is now translated into many languages but not much else has changed.",
              "timestamp": "2022-07-06 20:23:04",
              "score": 9,
              "num_children": 0,
              "author": 122682,
              "replies": []
            }
          ]
        },
        {
          "id": "if4oryf",
          "text": "Fishermen? I just looked it up, Jesus hung out with fishermen.",
          "timestamp": "2022-07-06 22:03:56",
          "score": 1,
          "num_children": 1,
          "author": 2498,
          "replies": [
            {
              "id": "if8dima",
              "text": "Can you blame him? Some fishermen are good company.",
              "timestamp": "2022-07-07 17:31:10",
              "score": 1,
              "num_children": 0,
              "author": 187590,
              "replies": []
            }
          ]
        },
        {
          "id": "if51tlj",
          "text": "I've never heard of a gay person attempting to infringe on the rights of American citizens the way the Christian Right does. Okay maybe Linday Graham. But all the other LGBTQ+ people seem pretty cool.",
          "timestamp": "2022-07-06 23:38:38",
          "score": 1,
          "num_children": 0,
          "author": 158499,
          "replies": []
        },
        {
          "id": "if53lsm",
          "text": "And the thing was, Jesus loved everyone, no one was unincluded.\n\nAnd he wasn't forcing people to change, he was being kind to them regardless and teaching them what it was to love the lord.\n\nI'll never understand the whole \"we have to force you to follow our religion, you know, for our god\", when their god distinctly gave people free will and states that fake believers don't count.\n\nIt simply doesn't work. You know, I think, personally, that the intent of the bible and Christianity was good. That if it's taken contextually as need to be relative to the time and day, and the intent is you need to be a good person, the bible could be great.\n\nIf it wasn't for alllllll these fucking awful christians just winging it based on how they feel, and what they circlejerked with their buddies about being right.\n\nThey completely, irrevocably, took a shit on their own religion. Like there's no fixing it. How are you supposed to trust christians after 3k years of lying, selfishness, and oppression for their own gain?\n\nShit was a decent go of making a better world, but you can't rely on assholes, cheaters, and liars to seal a deal.",
          "timestamp": "2022-07-06 23:51:59",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "if8dz1n",
              "text": "“For our god.” I just reflect on the scene from _The Rock_ where Sean Connery is sharing the etymology of Goodspeed’s name. I think if you replace it with “for their good” it makes more sense.",
              "timestamp": "2022-07-07 17:34:05",
              "score": 1,
              "num_children": 0,
              "author": 187590,
              "replies": []
            }
          ]
        },
        {
          "id": "if5y0k9",
          "text": "The irony is that their version of Christ would have been too self absorbed, mean, and vindictive to have died for anyone sins.",
          "timestamp": "2022-07-07 03:50:11",
          "score": 1,
          "num_children": 0,
          "author": 258923,
          "replies": []
        },
        {
          "id": "if6f030",
          "text": "I bet he has/had some very strong opinions on capital punishment but I doubt any Y'all-queda are talking about doing away with death sentences...",
          "timestamp": "2022-07-07 06:52:22",
          "score": 1,
          "num_children": 0,
          "author": 177904,
          "replies": []
        },
        {
          "id": "if6i72z",
          "text": "I think when he did talk to them about God, the message was “Be good to each other” and “Believe in God”. \n\nIt was never stop enjoying life or live a more conservative life or even stop having drugs and sex.",
          "timestamp": "2022-07-07 07:33:52",
          "score": 1,
          "num_children": 0,
          "author": 108881,
          "replies": []
        },
        {
          "id": "if6pkjg",
          "text": "jesus of nazareth and jesus christ are very different people",
          "timestamp": "2022-07-07 09:14:46",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "if78iob",
          "text": "They are literally worshiping The False Idol their precious book warned them about",
          "timestamp": "2022-07-07 12:47:02",
          "score": 1,
          "num_children": 0,
          "author": 136210,
          "replies": []
        },
        {
          "id": "if7eset",
          "text": "That's what the mythology states.  Though I wouldn't have posited anything to do with the christian Jesus with the preface \"as a matter of fact\".",
          "timestamp": "2022-07-07 13:37:33",
          "score": 1,
          "num_children": 0,
          "author": 216152,
          "replies": []
        },
        {
          "id": "if8cxwo",
          "text": "I’m sure the Catholics just see me as just grapes and bread, and they want to bind their will to mine because they’re shitty humans. Fuck’em. PS. “Raised Catholic”",
          "timestamp": "2022-07-07 17:27:31",
          "score": 1,
          "num_children": 0,
          "author": 187590,
          "replies": []
        }
      ]
    },
    {
      "id": "if2weid",
      "text": "Nothing is *ever* their fault.",
      "timestamp": "2022-07-06 14:47:03",
      "score": 605,
      "num_children": 3,
      "replies": [
        {
          "id": "if3rcpa",
          "text": "Can we make \"\\#NotMyFault\" a thing?",
          "timestamp": "2022-07-06 18:10:36",
          "score": 109,
          "num_children": 4,
          "author": 72413,
          "replies": [
            {
              "id": "if4nyys",
              "text": "It's called 'A Narcissist's Prayer'\n\nThat didn't happen. \n\nAnd if it did, it wasn't that bad.\n\nAnd if it was, that's not a big deal.\n\nAnd if it is, that's not my fault.\n\nAnd if it was, I didn't mean it. \n\nAnd if I did...\n\nYou deserved it.",
              "timestamp": "2022-07-06 21:58:20",
              "score": 59,
              "num_children": 2,
              "author": 83408,
              "replies": [
                {
                  "id": "if75psw",
                  "text": "Wow, so true.",
                  "timestamp": "2022-07-07 12:22:19",
                  "score": 1,
                  "num_children": 0,
                  "author": 121442,
                  "replies": []
                },
                {
                  "id": "if76u7m",
                  "text": "Thoughts and prayers /s",
                  "timestamp": "2022-07-07 12:32:25",
                  "score": 1,
                  "num_children": 0,
                  "author": 223838,
                  "replies": []
                }
              ]
            },
            {
              "id": "if45tev",
              "text": "It’s not the gun; it’s the Internet. It’s not the Internet, it’s the parents. It’s not the parents, it’s first person shooter games. It’s not first person shooter games; it’s mental health. It’s not mental health; it’s education. It’s not education; it’s …..",
              "timestamp": "2022-07-06 19:52:06",
              "score": 64,
              "num_children": 1,
              "author": 116995,
              "replies": [
                {
                  "id": "if4sia5",
                  "text": "When I was a kid, it was D&D. Apparently D&D is not a game as I had thought but rather a tool for performing satanic rituals. \n\nAlso, rock music. All those hidden messages to satan if you play the song backwards. \n\nAnd who can forget rap music? It was the next thing corrupting the youth when I was young.",
                  "timestamp": "2022-07-06 22:30:25",
                  "score": 44,
                  "num_children": 4,
                  "author": 270114,
                  "replies": [
                    {
                      "id": "if54xur",
                      "text": "Old guy here. They said the same things about Elvis.",
                      "timestamp": "2022-07-07 00:02:04",
                      "score": 14,
                      "num_children": 1,
                      "author": 297086,
                      "replies": [
                        {
                          "id": "if7gkc4",
                          "text": "Immortal being here. They said the same thing about the advent of the novel.",
                          "timestamp": "2022-07-07 13:51:00",
                          "score": 1,
                          "num_children": 0,
                          "author": 210272,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "if4w2es",
                      "text": "Yeah and before that it was Alice Cooper, Ozzy, and before that was the Beatles  (play the songs backwards), long hair, and of course, drugs.  Then again, we didn’t have ARs or AKs available to the general public. But we can’t really draw a correlation to daily mass killings / mass showings and available military weapons….. right???\n\nEdit a very embarrassing spelling error.",
                      "timestamp": "2022-07-06 22:56:01",
                      "score": 18,
                      "num_children": 1,
                      "author": 116995,
                      "replies": [
                        {
                          "id": "if7623w",
                          "text": "It's the Beatles. Sorry to be the grammar police :-)",
                          "timestamp": "2022-07-07 12:25:21",
                          "score": 2,
                          "num_children": 1,
                          "author": 121442,
                          "replies": [
                            {
                              "id": "if8hkgw",
                              "text": "Oh good Lord! My Baaaaad!!!  Thank you. I’ll take my penance, make the edit, and move to the back of the room. 🤦🏼‍♀️",
                              "timestamp": "2022-07-07 17:57:03",
                              "score": 2,
                              "num_children": 1,
                              "author": 116995,
                              "replies": [
                                {
                                  "id": "if9bgch",
                                  "text": "Lol, I make spelling mistakes all of the freaking time, lol.",
                                  "timestamp": "2022-07-07 21:07:50",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 121442,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "if61i3b",
                      "text": "Don't even have to listen backwards. Slayer is straight up satanic music. I had a concert shirt from white zombie that said 666 muthafucker when I was a teen. As an atheist I'm probably a better Christian than most of the really religious ones though.",
                      "timestamp": "2022-07-07 04:22:35",
                      "score": 5,
                      "num_children": 0,
                      "author": 158133,
                      "replies": []
                    },
                    {
                      "id": "if4wzlt",
                      "text": "[This is an actual video that was circulated to some police forces in the 80s.](https://www.youtube.com/watch?v=VW32CYJrOMI)",
                      "timestamp": "2022-07-06 23:02:43",
                      "score": 5,
                      "num_children": 1,
                      "author": 320337,
                      "replies": [
                        {
                          "id": "if77akh",
                          "text": "Cop/Pastor - lolololol. \"There are many of them (satanic crimes) but they're hard to find\" - hilarious!",
                          "timestamp": "2022-07-07 12:36:24",
                          "score": 2,
                          "num_children": 0,
                          "author": 121442,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "if3vfdj",
              "text": "That's perfect!",
              "timestamp": "2022-07-06 18:38:51",
              "score": 8,
              "num_children": 0,
              "author": 407907,
              "replies": []
            },
            {
              "id": "if4740w",
              "text": "Naw it should be #ChristiansFault. Don't be polite and name the people endangering other . Americans need to stop bieng \"nice\" because we need to be better. That went out the window years ago .",
              "timestamp": "2022-07-06 20:01:23",
              "score": 14,
              "num_children": 0,
              "author": 62657,
              "replies": []
            }
          ]
        },
        {
          "id": "if41dhi",
          "text": "[The Alt-Right Playbook: Never Play Defense](https://www.youtube.com/watch?v=wmVkJvieaOA)",
          "timestamp": "2022-07-06 19:20:42",
          "score": 41,
          "num_children": 2,
          "author": 28166,
          "replies": [
            {
              "id": "if47l9l",
              "text": "Honestly even more than the alt right, just GOP in general. They're losing the argument, \"seethe and cope\"",
              "timestamp": "2022-07-06 20:04:46",
              "score": 17,
              "num_children": 1,
              "author": 256037,
              "replies": [
                {
                  "id": "if4kusj",
                  "text": "It's because more and more people are becoming fed up with their shit, and I'm all here for it. Republicans and conservatives are all fragile little snowflakes.",
                  "timestamp": "2022-07-06 21:36:32",
                  "score": 9,
                  "num_children": 1,
                  "author": 15037,
                  "replies": [
                    {
                      "id": "if4wx1t",
                      "text": "unfortunately, that’s the absolute last leg of this “democracy”\n\nuntil the majority of voters who supported Roe v. Wade start making their voice heard, they will continue to be drowned out by the cacophony of endless whining from Republicans; in fact, many conservatives want to [make it illegal to even protest](https://nonprofitquarterly.org/the-police-groups-and-fossil-fuel-corporations-lobbying-to-criminalize-protest/) esp. against corporations \n\nthis fall, the [US Supreme Court](https://www.governing.com/next/the-supreme-court-case-that-could-end-american-democracy) will likely allow North Carolina to not only keep their heavily gerrymandered voting districts but enable the state legislatures to simply toss out any election that they don’t agree with\n\nvote for a Democratic presidential candidate and they will simply appoint their own electors while ignoring the election outcome\n\nthis is going to happen before the midterm elections and then we can hold a formal funeral for the idea that was the Constitution of the United States of America\n\nEDIT: add reference, expand upon free speech",
                      "timestamp": "2022-07-06 23:02:11",
                      "score": 16,
                      "num_children": 0,
                      "author": 342637,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "if5552u",
              "text": "It's time to stop calling it alt-right.\n\nThere's nothing *alt* about it.\n\nIt's the entire right wing. That's just who they are now.",
              "timestamp": "2022-07-07 00:03:33",
              "score": 2,
              "num_children": 1,
              "author": 297086,
              "replies": [
                {
                  "id": "if77vug",
                  "text": "Agreed. And stop using the word \"conservative\" when fascist or Christo-fascist is more appropriate.",
                  "timestamp": "2022-07-07 12:41:35",
                  "score": 1,
                  "num_children": 0,
                  "author": 121442,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "if4mhbs",
          "text": "That’s literally the central tenet of Christianity - *Jesus died for your sins*. Living your life completely bereft of personal accountability is next to godliness.",
          "timestamp": "2022-07-06 21:47:57",
          "score": 7,
          "num_children": 0,
          "author": 71190,
          "replies": []
        }
      ]
    },
    {
      "id": "if2x79h",
      "text": "My favorite is when they are assholes and expect no retaliation. When we retaliate we are persecuting them. Those poor poor blameless Christians 🙄",
      "timestamp": "2022-07-06 14:52:26",
      "score": 453,
      "num_children": 8,
      "author": 63121,
      "replies": [
        {
          "id": "if3lado",
          "text": "This is a feature of narcissistic personality disorder\n\nThey are unable to feel empathy for others and are therefore unable to understand how their actions effect others\n\nThen they spend their lives around partners, children and families who learn to never call them out so as to not activate the victim baby narcissistic rage tantrum that comes whenever they are held accountable\n\nIn their homes they never face consequences and feel in control\n\nThen they go out in public and when they act inappropriately and get called out, they are shocked that the world isn’t responding like their gaslighted family, so they try and gaslight the world, which never works, (unless you’re the president) so they have a temper tantrum in public, all the while blaming anyone but themselves, the victims of their consequences\n\nThen they return home from a world that was promised to them, but rejected them, angrier than ever and ready to take back the world that was stolen from them\n\nNever once realizing that the disgusted looks on the faces of their peers was a reflection of themselves the whole time",
          "timestamp": "2022-07-06 17:29:58",
          "score": 227,
          "num_children": 2,
          "author": 112557,
          "replies": [
            {
              "id": "if3t40b",
              "text": "Collective narcissism.  Common among nationalists and others who have a poorly developed sense of self and instead derive most of their identity from a group.\n\n\nhttps://en.m.wikipedia.org/wiki/Collective_narcissism",
              "timestamp": "2022-07-06 18:22:43",
              "score": 103,
              "num_children": 3,
              "author": 178001,
              "replies": [
                {
                  "id": "if3vk4d",
                  "text": "Great link, hadn’t herd that term before\n\nCheck out the Leader Follower section for some particularly relevant information",
                  "timestamp": "2022-07-06 18:39:47",
                  "score": 25,
                  "num_children": 1,
                  "author": 112557,
                  "replies": [
                    {
                      "id": "if78q96",
                      "text": "That is spot-on for IQ45\\*\\* cultists. He reflects what they think about themselves and vice versa. It's one big narcissistic mindfuck between all of them.",
                      "timestamp": "2022-07-07 12:48:49",
                      "score": 3,
                      "num_children": 0,
                      "author": 121442,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "if3yn3r",
                  "text": "Ooo yea same as the other guy thanks never knew this one",
                  "timestamp": "2022-07-06 19:01:17",
                  "score": 7,
                  "num_children": 0,
                  "author": 86715,
                  "replies": []
                },
                {
                  "id": "if5s662",
                  "text": "Ah! This is the phrase I’ve been looking for to describe the boomer generation! This is much more succinct than my explanation. Thank ya for some fresh knowledge.",
                  "timestamp": "2022-07-07 03:00:26",
                  "score": 2,
                  "num_children": 1,
                  "author": 58481,
                  "replies": [
                    {
                      "id": "if5x3ns",
                      "text": "The boomer thing is more just a general phenomenon of older generations.\nhttps://www.inc.com/jessica-stillman/a-new-study-reveals-surprising-reason-why-every-generation-complains-about-kids-these-days.html",
                      "timestamp": "2022-07-07 03:42:05",
                      "score": 2,
                      "num_children": 0,
                      "author": 178001,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "if6djwg",
              "text": "This is alarmingly accurate. I grew up on one of these homes. I've believed for years now that my father, who is a pastor, is a raging narcissist. He's stolen money, lied, protected abusers in the church, stated that husbands can't rape their wives, and any number of other deeply unempathetic and disturbing things. \n\nIt wasn't until I was in my mid-20s that I accepted his behavior was intentional and it blew my world apart. I always disagreed with their beliefs, but I just couldn't see that it was about control until I was completely separated from it.",
              "timestamp": "2022-07-07 06:34:20",
              "score": 7,
              "num_children": 0,
              "author": 401764,
              "replies": []
            }
          ]
        },
        {
          "id": "if3k1lq",
          "text": "They are masters of baiting oppressed groups, then crying oppression when someone pushes back.",
          "timestamp": "2022-07-06 17:21:43",
          "score": 44,
          "num_children": 2,
          "author": 40993,
          "replies": [
            {
              "id": "if3mrjl",
              "text": "Master baiters.",
              "timestamp": "2022-07-06 17:39:48",
              "score": 23,
              "num_children": 1,
              "author": 131965,
              "replies": [
                {
                  "id": "if3xnlc",
                  "text": "Yes, that's right, they love to stroke their cocks.",
                  "timestamp": "2022-07-06 18:54:29",
                  "score": 7,
                  "num_children": 0,
                  "author": 407907,
                  "replies": []
                }
              ]
            },
            {
              "id": "if3oum7",
              "text": "Bingo",
              "timestamp": "2022-07-06 17:53:41",
              "score": 5,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "if3qgcj",
          "text": "Wrong.  They absolutely expect retaliation.  They preemptively declare such retaliation to be off the table, and if you cede that such retaliation wouldn't be 100% justified, you act as their ally and enabler.\n\nRemember that they say wrong things on purpose, and that they do that in open and proud pursuit of genocide.  Remember that they are *fascists*, and recognize what that means.  Stop caring about what they say, and start caring about what it's actually going to take to stop them.",
          "timestamp": "2022-07-06 18:04:27",
          "score": 42,
          "num_children": 1,
          "author": 215411,
          "replies": [
            {
              "id": "if45mvz",
              "text": "You are both right. There exist people amongst the Nationalist Christians (Nat. Cs.) that lie, gaslight, and prevaricate with the intention of taking power and committing genocide against everyone who doesn't fit their mold, and there are people who are just stupid and narcissistic who are along for the ride when told they are the victims for not being given every advantage and deference when they act like assholes.",
              "timestamp": "2022-07-06 19:50:48",
              "score": 20,
              "num_children": 0,
              "author": 239652,
              "replies": []
            }
          ]
        },
        {
          "id": "if35yxs",
          "text": "They expect retaliation but they'll call it oppression.",
          "timestamp": "2022-07-06 15:50:07",
          "score": 52,
          "num_children": 1,
          "author": 348992,
          "replies": [
            {
              "id": "if3pi8u",
              "text": "It feeds their persecution delusions",
              "timestamp": "2022-07-06 17:58:03",
              "score": 22,
              "num_children": 0,
              "author": 404775,
              "replies": []
            }
          ]
        },
        {
          "id": "if35uh8",
          "text": "It's not even retaliation, it's self defense.",
          "timestamp": "2022-07-06 15:49:19",
          "score": 38,
          "num_children": 0,
          "author": 192084,
          "replies": []
        },
        {
          "id": "if3wz41",
          "text": "There may be a way around it. The trick is to acknowledge what they really are and first make it known, the scum of the Earth they truly are and how they behave, and not tolerate their bullshit any longer. But you would have to be prepared for what they can really bring in such circumstances. It would be time to get down to business in such a case.",
          "timestamp": "2022-07-06 18:49:43",
          "score": 5,
          "num_children": 0,
          "author": 407907,
          "replies": []
        },
        {
          "id": "if3yqg9",
          "text": "They are very good at playing the martyr.   I'll bet they think their tires are so much flatter than everyone else's.",
          "timestamp": "2022-07-06 19:01:57",
          "score": 3,
          "num_children": 0,
          "author": 772,
          "replies": []
        },
        {
          "id": "if76ui9",
          "text": "When the exalted leader was a martyr, all the followers want to be martyrs too",
          "timestamp": "2022-07-07 12:32:29",
          "score": 1,
          "num_children": 0,
          "author": 253749,
          "replies": []
        }
      ]
    },
    {
      "id": "if2yf67",
      "text": "Well, duh! It is the very existence of the heathens that is driving these gawdly young men to lash out, don’tcha know? These things wouldn’t happen if everyone else weren’t minions of the anti-christ! They are blameless soldiers of gawd.",
      "timestamp": "2022-07-06 15:00:43",
      "score": 46,
      "num_children": 1,
      "replies": [
        {
          "id": "if4sqyk",
          "text": "Probably true belonging as part of a community based on faith would indeed be enough to dissuade a mass shooter, don't you think? When I think mass shooters I think alienation and ego. A good church should fix both those.",
          "timestamp": "2022-07-06 22:32:08",
          "score": -7,
          "num_children": 2,
          "author": 2498,
          "replies": [
            {
              "id": "if4t0fh",
              "text": "🤣",
              "timestamp": "2022-07-06 22:34:00",
              "score": 2,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "if6n0q2",
              "text": "...That's not very true or likely. You have to remember that not everyone is religious so that would already dog stomp the church. Even if they were religious in a sense and just for your connivance a Christian, there would have to be something that have ticked them off or just something that would have caused such an action.",
              "timestamp": "2022-07-07 08:39:41",
              "score": 2,
              "num_children": 1,
              "author": 200475,
              "replies": [
                {
                  "id": "if73t7r",
                  "text": "I mean, it's your guess against mine. I don't think it's a good criticism to say that not everyone is religious, though. Religions are designed to be meaningful to as broad a range of people as possible; they're meant to tie society together. And you don't need to take the whole drink to get something from it. You can believe in the moral order because that's how you were raised and appreciate the community while quietly doubting the existence of an afterlife. Doesn't mean religion isn't for you.\n\nSure Christians get ticked off but good Christians don't go on shooting rampages. Good Christians are humble and socially integrated.",
                  "timestamp": "2022-07-07 12:04:35",
                  "score": -2,
                  "num_children": 1,
                  "author": 2498,
                  "replies": [
                    {
                      "id": "if7dgu7",
                      "text": "I never said that everyone is non religious, but either way there are a variety of religions. A Christian Church would not have the same impact as a church with the same views as a person. Most churches in the US are Christian so. \n\n\"quietly doubting the existence of an afterlife. Doesn't mean religion isn't for you.\"\n\nWell, ya it would. Why would I be denying the afterlife and religion if religion was for me? Wouldn't I be following a religion if that was the case?",
                      "timestamp": "2022-07-07 13:27:18",
                      "score": 1,
                      "num_children": 1,
                      "author": 200475,
                      "replies": [
                        {
                          "id": "if7h6zp",
                          "text": "Yeah, what you didn't say and what I said are different. I said that any successful religion is comprehensive and flexible enough that it can offer something to anyone. Therefore I don't think 'not religious' is \n\nIf there's no afterlife then why does it matter if your religion gets it wrong, it's not like you'll go to hell or anything. Accept it as a convenient device that means something to some people and look for your own meaning elsewhere. Surely the religion addresses life as well as afterlife.",
                          "timestamp": "2022-07-07 13:55:36",
                          "score": 1,
                          "num_children": 1,
                          "author": 2498,
                          "replies": [
                            {
                              "id": "if88x7p",
                              "text": "\"Yeah, what you didn't say and what I said are different. I said that any successful religion is comprehensive and flexible enough that it can offer something to anyone. Therefore I don't think 'not religious' is\"\n\nMost religions are straight forwards with beliefs that may contradict others. Religions aren't always \"comprehensive and flexible\" because that varies person to person.\n\n\"If there's no afterlife then why does it matter if your religion gets it wrong, it's not like you'll go to hell or anything. Accept it as a convenient device that means something to some people and look for your own meaning elsewhere. Surely the religion addresses life as well as afterlife.\"\n\nI believe that there is no afterlife because I don't believe in a religion. You are on r/atheism. I don't believe in the principles of any religion so I don't believe in any afterlife. I don't think life has any meaning because you have to get that on your own. Religion holds no meaning to me and is not a way to get meaning but that's my opinion on it. It may be meaningful to someone else",
                              "timestamp": "2022-07-07 17:01:45",
                              "score": 1,
                              "num_children": 1,
                              "author": 200475,
                              "replies": [
                                {
                                  "id": "if8a456",
                                  "text": "Fair enough.",
                                  "timestamp": "2022-07-07 17:09:25",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 2498,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "if3honc",
      "text": "Christians don't care about anything but spreading misery and calling it love.",
      "timestamp": "2022-07-06 17:06:01",
      "score": 300,
      "num_children": 8,
      "author": 236111,
      "replies": [
        {
          "id": "if3jsnh",
          "text": "\"If you're happy and you know it, that's a sin.\"",
          "timestamp": "2022-07-06 17:20:05",
          "score": 188,
          "num_children": 1,
          "author": 126001,
          "replies": [
            {
              "id": "if45cby",
              "text": "\"If you are happy and you know it, then the guilt will surely show it!\"",
              "timestamp": "2022-07-06 19:48:44",
              "score": 62,
              "num_children": 1,
              "author": 53757,
              "replies": [
                {
                  "id": "if47yos",
                  "text": "\"If you're happy and you know it, go to hell!\"",
                  "timestamp": "2022-07-06 20:07:22",
                  "score": 46,
                  "num_children": 1,
                  "author": 408106,
                  "replies": [
                    {
                      "id": "if4lwc0",
                      "text": "\"If you're really happy and really want to show it; Straight to hell.\"",
                      "timestamp": "2022-07-06 21:43:52",
                      "score": 9,
                      "num_children": 0,
                      "author": 364156,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "if3mdu1",
          "text": "So many Christians, so few lions",
          "timestamp": "2022-07-06 17:37:16",
          "score": 36,
          "num_children": 1,
          "author": 307335,
          "replies": [
            {
              "id": "if4ansa",
              "text": "Which is a shame considering g how many arenas America has.     \n     \nGoogling robotic lions.",
              "timestamp": "2022-07-06 20:26:00",
              "score": 11,
              "num_children": 0,
              "author": 122682,
              "replies": []
            }
          ]
        },
        {
          "id": "if3qiwu",
          "text": "No hate like christian love.",
          "timestamp": "2022-07-06 18:04:56",
          "score": 68,
          "num_children": 1,
          "author": 215411,
          "replies": [
            {
              "id": "if3u4zg",
              "text": "I'm using that",
              "timestamp": "2022-07-06 18:29:53",
              "score": 8,
              "num_children": 0,
              "author": 224340,
              "replies": []
            }
          ]
        },
        {
          "id": "if3kpbi",
          "text": "Love love LOVE casting stones.",
          "timestamp": "2022-07-06 17:26:04",
          "score": 17,
          "num_children": 1,
          "author": 277340,
          "replies": [
            {
              "id": "if4941z",
              "text": "Hold on... Wasn't there some kind of caveat to this stone throwing thing? /s",
              "timestamp": "2022-07-06 20:15:23",
              "score": 6,
              "num_children": 1,
              "author": 24922,
              "replies": [
                {
                  "id": "if5kfgj",
                  "text": "He without sin, yep. But Jesus died for their sins so they’re off the hook. Very tidy. Take Jesus into your heart and cast stones to your self righteous delight.",
                  "timestamp": "2022-07-07 01:58:55",
                  "score": 6,
                  "num_children": 0,
                  "author": 277340,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "if4mti3",
          "text": "They want everyone to be as miserable as they are.",
          "timestamp": "2022-07-06 21:50:17",
          "score": 4,
          "num_children": 0,
          "author": 10449,
          "replies": []
        },
        {
          "id": "if48n41",
          "text": "Evangelical Dominionists do not honestly believe in the scripture of their religion. They use the Bible as a shield to hide behind and a cudgel to beat you with.",
          "timestamp": "2022-07-06 20:12:08",
          "score": 3,
          "num_children": 0,
          "author": 286479,
          "replies": []
        },
        {
          "id": "if417b7",
          "text": "I'm not Christian but literally the only thing that keeps me clinging on to religion is that I'm scared of believing that there's nothing after death and it will be just like it was before I was born. I'd like to believe in reincarnation because it's comforting. Deep down I know the chances of it being true are slim but I really want it to be true. The idea that one day you can suddenly disappear and vanish into nothingness is very scary. Why are people born if it wasn't forever?",
          "timestamp": "2022-07-06 19:19:29",
          "score": 13,
          "num_children": 15,
          "replies": [
            {
              "id": "if42cmt",
              "text": "Why would you be born forever?\n\nYou have a finite time in this universe. Rather than focus on what happens after you die, try to focus on making the most your time in this world— on making that time wonderful and beautiful.",
              "timestamp": "2022-07-06 19:27:33",
              "score": 28,
              "num_children": 0,
              "author": 286309,
              "replies": []
            },
            {
              "id": "if44j6p",
              "text": "People aren’t born for a reason. \n\nIn fact everything was against our existence since the very beginning.  We are the end result of a series of coincidences, the size of our star, the position of our planet, the conditions that gave life a chance, all the innumerable times we escaped extinction.\n\nWe exist through pure chance.\n\nThe only thing we have to do is make the best of what we have.",
              "timestamp": "2022-07-06 19:43:02",
              "score": 25,
              "num_children": 1,
              "author": 60210,
              "replies": [
                {
                  "id": "if4r0tn",
                  "text": "Chance and the conscious intentions of billions of people who came before us. Even our knuckle-walking ancestors did everything they could to get us here, even our fish ancestors put everything they had into finding food and mates. Where did they get the courage, the dedication? \n\nWe exist because of 500 million years of successful striving.",
                  "timestamp": "2022-07-06 22:19:52",
                  "score": 7,
                  "num_children": 0,
                  "author": 2498,
                  "replies": []
                }
              ]
            },
            {
              "id": "if45ka7",
              "text": "My problem with reincarnation... If you have no memory of your past life, it is still the death of self. No different from end stage Alzheimer's. Seems pointless.",
              "timestamp": "2022-07-06 19:50:18",
              "score": 16,
              "num_children": 0,
              "author": 53757,
              "replies": []
            },
            {
              "id": "if4adfy",
              "text": "You turn back to stardust when you die. Then those molecules form into something else. I can’t think of anything cooler.",
              "timestamp": "2022-07-06 20:24:02",
              "score": 13,
              "num_children": 0,
              "author": 249571,
              "replies": []
            },
            {
              "id": "if47yz6",
              "text": "We are here because of evolution, and evolution generally isn’t interested in producing immortality. It just simply isn’t selected for. Even if our ancestors somehow evolved an extreme anti-aging gene, they would almost certainly have been outcompeted by their mortal buddies who just reproduced and then got out of the way. Immortality is stagnation.\n\nEvolution **is** interested, though, in making death scary (so that you don’t want to die). Ernest Becker’s Denial of Death might be a helpful read on the topic.",
              "timestamp": "2022-07-06 20:07:26",
              "score": 5,
              "num_children": 0,
              "author": 176532,
              "replies": []
            },
            {
              "id": "if44wh9",
              "text": "Think about the time before you were born. Were you upset or distressed about not existing? No, of course not. When you die, it will be the same; no suffering, no pain.  Just make the most of the time you have now.",
              "timestamp": "2022-07-06 19:45:37",
              "score": 14,
              "num_children": 0,
              "author": 239652,
              "replies": []
            },
            {
              "id": "if4fz6i",
              "text": "Lemme blow your mind for a minute: I don't know you, but you (well, what makes you you, your atoms) are like billions of years old. Think of this, the human body consists of 90% water, there's calcium, iron, and other elements and molecules that make up your body. But lest not forget, when you break down molecules and elements, you have atoms. Everything you eat, every time you breath, etc., you are introducing new atoms that make up your body. Some of atoms in the air you breath or the water you drink have been shared with the dinosaurs. When you consume things or breathe, they effectively become you do a certain degree. The things you ate as a child allowed you to grow in atoms to be physically larger. You have acquired more mass because you comprise of more atoms. Again, the atoms did not come from nowhere. So how much of you is even you?\n\nEven crazier is that electron transfer is happening all the time, everywhere, all at once (lol). This means that the electrons that are inside the atoms that create your body are transferring in and out of you from objects, people, and materials that are all around you. There is no such thing as 'you' in a sense. The hippies did kind of have it right, we're all one, man. Or \"we're all just stardust.\" Bits and pieces that have once been part of you are literally littered all around the world. SO, you don't really vanish into nothingness, you're pretty much being recycled all the time, even when you are... idk sitting here reading this Reddit post (ie. your skin cells are constantly shedding). \n\nAs far as consciousness, who can really say. But since the brain does rely on chemical and electrical signals, and:\n\n\"First Law of Thermodynamics: Energy can be changed from one form to another, but it cannot be created or destroyed. The total amount of energy and matter in the Universe remains constant, merely changing from one form to another.\" \n\nThen I suppose you're just converted into a new kind of energy, but you won't be destroyed. (probably).",
              "timestamp": "2022-07-06 21:02:31",
              "score": 6,
              "num_children": 2,
              "author": 62003,
              "replies": [
                {
                  "id": "if67qbm",
                  "text": "I recommend everyone read Billy Bryson’s “A Short History of Nearly Everything” for a whimsical look at, well, nearly everything.",
                  "timestamp": "2022-07-07 05:26:59",
                  "score": 2,
                  "num_children": 0,
                  "author": 188407,
                  "replies": []
                },
                {
                  "id": "if4t04s",
                  "text": "I like this thought.   It seems more beautiful than hanging out with other dead people for eternity.   Sure everybody wants to have lunch with George Washington  (for example) in the afterlife but the poor guy has been pestered for ages.  It doesn't sound like it would be his idea of heaven.",
                  "timestamp": "2022-07-06 22:33:57",
                  "score": 1,
                  "num_children": 0,
                  "author": 76558,
                  "replies": []
                }
              ]
            },
            {
              "id": "if4511u",
              "text": "I found comfort in the concept of brahman as a christian-raised person good luck,  I dealt with this heavily after my mom died.",
              "timestamp": "2022-07-06 19:46:31",
              "score": 3,
              "num_children": 0,
              "author": 224122,
              "replies": []
            },
            {
              "id": "if459hs",
              "text": "Why are dogs born if it isn't forever?",
              "timestamp": "2022-07-06 19:48:10",
              "score": 3,
              "num_children": 0,
              "author": 153423,
              "replies": []
            },
            {
              "id": "if49b4q",
              "text": "Let's even say that we do have immortal souls, and your actions in life determine your outcomes after death.\n\nWhat benevolent god would accept these horrifically evil people who discriminate, harass, beat, and murder people - that gods own creations - just for being born different than them? What good is a heaven that allows them in? What good is a heaven that bans people who have done no harm to anyone, and who have simply been created slightly different from the norm?\n\nThere are different forms of Christianity. You don't have to accept the one built upon bigotry and hate.",
              "timestamp": "2022-07-06 20:16:46",
              "score": 2,
              "num_children": 0,
              "author": 286479,
              "replies": []
            },
            {
              "id": "if4jvhe",
              "text": "You've gotten a lot of viewpoints, but I wanted to chime in with mine as well, because I really resonate with what you said. \n\nI rejected religion as a young adult. Later, I lost someone very important in my life which understandably made me pretty sad. Without religion to fall back on, it was just a senseless loss. My family felt comfort in their belief that they'd see them again, but I had no such comfort.\n\nI probably wouldn't call myself atheist today, but the way I've sort of reconciled it is this: there's nothing that can be done in this life about loss or what happens after you die. All you can really do is try to make your life the best you can, and help your fellow humans do the same. \n\nI'm kinda splitting the uprights of \"Don't consider an afterlife in how you live, just be a net positive to the world\" and \"If I live my life the best that I can and whatever God doesn't accept me, that's not a God I want to spend eternity with\". I find these to lead to basically the same decisions. \n\nAs for yourself -- I don't personally think there's any harm in having some sort of belief for yourself if it brings you comfort. Maybe you're not right, but that's likely going to be true for 99.99%+ of humans ever. As long as you don't use your religious beliefs to push views onto others or act like a dick, I say what's the harm? Keep believing in reincarnation.",
              "timestamp": "2022-07-06 21:29:42",
              "score": 1,
              "num_children": 0,
              "author": 268104,
              "replies": []
            },
            {
              "id": "if4nh1r",
              "text": "I posit that there is something intrinsic as a soul, if you accept the multiverse theory, hyper intelligent beings with no physical limitations, no illusions of time; might get their kicks from the unique position we are in; we all operate under the same rules (no magic allowed), smart enough to acquire more knowledge anew, adaptable enough to manuever in this reality, and above all, sentient capable. Without the last one, the body is a vegetable. The soul doesn't care either way, it's back in the fold ready for round... how many people ever lived.",
              "timestamp": "2022-07-06 21:54:49",
              "score": 1,
              "num_children": 0,
              "author": 364156,
              "replies": []
            },
            {
              "id": "if4qjqo",
              "text": "The chances of reincarnation actually happening are totally unknown. We know so little about consciousness that it's not crazy to suppose that there's an animating force or soul; it's just not fashionable. We understand the physiology of neurons pretty well and we can measure oxygen consumption in different parts of the brain while performing different tasks but that's about it. Nobody knows where your thoughts come from.",
              "timestamp": "2022-07-06 22:16:32",
              "score": 1,
              "num_children": 0,
              "author": 2498,
              "replies": []
            },
            {
              "id": "if5d05t",
              "text": "These things help me with existential angst.\n\nConservation of matter: your molecules will stick around after you die. Bits of you will go out into the world and become part of the ecosystem, part of plants and animals and other people.\n\nPersistence of the universe: the world will go on after you. The planets will orbit the sun, the Earth will rotate, the seasons will change, the birds will sing, the flowers will bloom. Just be amazed that you were a conscious part of the universe for a blink in time.\n\n(Yes the Earth will someday be killed by the sun, and the sun will die, and the universe may die from heat death, but that's millions and billions of years away).",
              "timestamp": "2022-07-07 01:02:34",
              "score": 1,
              "num_children": 0,
              "author": 340128,
              "replies": []
            },
            {
              "id": "if5payx",
              "text": "You can try Buddhism! But then again, Buddhism believes that the higher calling is to ascend from the cycle of reincarnation, because living is suffering 😂😂 but IMO Buddhism is still a better choice of religion than modern-day Christianity; it actively calls for doing good deeds and being kind to everyone. Even the dietary requirement is flexible; I believe in Buddhism but I am still omnivorous 🤷🏻‍♀️\n\nAnd even outside of any religion, I believe death is just another life milestone in our existence. Whether or not you believe in souls or energies or whathaveyous, just the fact that your existence now has already impacted so many people in your life, even the strangers that you don't remember. There was an interview with Keanu where Colbert asked him, what happens after we die, and he answered, \"The people who love us, will miss us.\"\n\nYou can't actively live forever, but trust me, you will live on in your loved one's memories and thoughts.",
              "timestamp": "2022-07-07 02:37:05",
              "score": 1,
              "num_children": 0,
              "author": 123959,
              "replies": []
            }
          ]
        },
        {
          "id": "if655fa",
          "text": "I wish they would realize that most of us don't give a single fuck about their religion.  If they want to live by the rules of their own religion, so be it.  Go for it!  But fuck those assholes for trying to regulate MY rights because of THEIR religion.",
          "timestamp": "2022-07-07 04:59:36",
          "score": 2,
          "num_children": 0,
          "author": 347871,
          "replies": []
        }
      ]
    },
    {
      "id": "if3zb7x",
      "text": "“The child who is not embraced by the village will burn it down to feel its warmth.” -African Proverb",
      "timestamp": "2022-07-06 19:06:00",
      "score": 97,
      "num_children": 1,
      "author": 16080,
      "replies": [
        {
          "id": "if44xe9",
          "text": "That is fascism in a nutshell. And trumpism is fascism",
          "timestamp": "2022-07-06 19:45:48",
          "score": 26,
          "num_children": 1,
          "author": 165249,
          "replies": [
            {
              "id": "if77xsx",
              "text": "You got that right.",
              "timestamp": "2022-07-07 12:42:03",
              "score": 2,
              "num_children": 0,
              "author": 121442,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "if31m37",
      "text": "Caught that, did ya.",
      "timestamp": "2022-07-06 15:21:51",
      "score": 31,
      "num_children": 0,
      "author": 250085,
      "replies": []
    },
    {
      "id": "if3gstm",
      "text": "It's kind of like when the abuser beats the crap out of you and then tells you now see look what you made me do.",
      "timestamp": "2022-07-06 17:00:06",
      "score": 30,
      "num_children": 0,
      "author": 116469,
      "replies": []
    },
    {
      "id": "if36c4c",
      "text": "The issue is with the people who value their beliefs over the welfare of others.",
      "timestamp": "2022-07-06 15:52:28",
      "score": 31,
      "num_children": 3,
      "author": 295200,
      "replies": [
        {
          "id": "if53hzz",
          "text": "There are a lot of issues, like how a lot of \"wanted\" kids become \"unwanted\" when they have challenges, are difficult, or simply don't bend to their parents' will no matter what and how little our society does to support parents.",
          "timestamp": "2022-07-06 23:51:11",
          "score": 2,
          "num_children": 0,
          "author": 92256,
          "replies": []
        },
        {
          "id": "if45un9",
          "text": "That is a perfectly succinct way of putting it.",
          "timestamp": "2022-07-06 19:52:21",
          "score": 1,
          "num_children": 0,
          "author": 63777,
          "replies": []
        },
        {
          "id": "ifcsnrf",
          "text": "Literally everyone values their beliefs over the welfare of other by definition.. Because beliefs include what \"welfare\" means and who should have what kind of it.",
          "timestamp": "2022-07-08 15:32:03",
          "score": 1,
          "num_children": 0,
          "author": 25621,
          "replies": []
        }
      ]
    },
    {
      "id": "if3hgmv",
      "text": "He also said, 'feed the hungry, heal the sick, help the poor and welcome the refugee,' but I don't see them doing any of that stuff.\n\n\n.",
      "timestamp": "2022-07-06 17:04:32",
      "score": 74,
      "num_children": 3,
      "author": 251913,
      "replies": [
        {
          "id": "if3qmbi",
          "text": "C'mon now, they have many charities that spend at least 11cents of every dollar donated. /s",
          "timestamp": "2022-07-06 18:05:35",
          "score": 28,
          "num_children": 0,
          "author": 235104,
          "replies": []
        },
        {
          "id": "if3wfi4",
          "text": "They'll do that but only if the \"downtrodden\" are also christians.",
          "timestamp": "2022-07-06 18:45:54",
          "score": 15,
          "num_children": 1,
          "author": 214531,
          "replies": [
            {
              "id": "if6d0o4",
              "text": "Even then... bootstraps.",
              "timestamp": "2022-07-07 06:27:54",
              "score": 2,
              "num_children": 0,
              "author": 100690,
              "replies": []
            }
          ]
        },
        {
          "id": "if4zl36",
          "text": "The actual sins of the citizens of Sodom, according to the Bible : they were\n\n* arrogant\n\n* overfed\n\n* unconcerned\n\n* did not feed the poor and needy\n\n* haughty\n\n* committed an (unspecified) abomination before me.\n\nThose qualities pretty much describe every pseudo Christian I've ever met, but it's the *gays* who god hates for some reason.",
          "timestamp": "2022-07-06 23:21:58",
          "score": 14,
          "num_children": 0,
          "author": 37248,
          "replies": []
        }
      ]
    },
    {
      "id": "if32tvo",
      "text": "His sky-daddy did have a tendency to promote murder, infanticide and genocide.",
      "timestamp": "2022-07-06 15:29:45",
      "score": 55,
      "num_children": 0,
      "author": 310847,
      "replies": []
    },
    {
      "id": "if33j9r",
      "text": "Please don't give them ideas.",
      "timestamp": "2022-07-06 15:34:22",
      "score": 17,
      "num_children": 0,
      "author": 244434,
      "replies": []
    },
    {
      "id": "if3eh7t",
      "text": "They always want a scapegoat to avoid having to accept their own shortcomings and their own share in the societal collapse. They love scapegoats so much they can't wait for Jesus 2.0 to come back just to lash him and crucify him again to save their own asses lol",
      "timestamp": "2022-07-06 16:44:59",
      "score": 14,
      "num_children": 0,
      "author": 328358,
      "replies": []
    },
    {
      "id": "if3xbzx",
      "text": "Christians are delusional. The truth could hit them in the face and even then, they wouldn’t get it. \nWillful ignorance. \n\nThey have no place at the table of reason and science.",
      "timestamp": "2022-07-06 18:52:13",
      "score": 14,
      "num_children": 0,
      "author": 16178,
      "replies": []
    },
    {
      "id": "if2ykdm",
      "text": "Yep. Wait 20 years now that Roe is gone. You think mass shooters will be a problem now?",
      "timestamp": "2022-07-06 15:01:41",
      "score": 97,
      "num_children": 2,
      "author": 286151,
      "replies": [
        {
          "id": "if3n95p",
          "text": "It's kind of disturbing that the link Levitt and Donohue found was hated by both sides. All they showed is a link between unwantedness and crime but all sorts of people had an issue with that. I've even heard Levitt say that you shouldn't base your abortion beliefs on it but that we should definitely do something about unwantedness.",
          "timestamp": "2022-07-06 17:43:01",
          "score": 31,
          "num_children": 1,
          "author": 41486,
          "replies": [
            {
              "id": "if493bk",
              "text": "The ironic thing about that Freakonomics observation is that you'd figure that the people that continually run their mouths about Family Values would have been able to intuitively us that \"unloved children cause more crime\".  You'd figure they'd arrive at that conclusion naturally, just based on the so-called \"common sense\" they value more than actual education.",
              "timestamp": "2022-07-06 20:15:15",
              "score": 16,
              "num_children": 1,
              "author": 315471,
              "replies": [
                {
                  "id": "if66ead",
                  "text": "Ah but the problem with that is that to reach that conclusion they would have to admit that abortion solves a potential problem. Can't have that, better to attack the messenger.",
                  "timestamp": "2022-07-07 05:12:35",
                  "score": 7,
                  "num_children": 0,
                  "author": 39738,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "if5e920",
          "text": "How else are we going to repopulate our schools to keep up with the shootings?",
          "timestamp": "2022-07-07 01:11:59",
          "score": 2,
          "num_children": 0,
          "author": 133387,
          "replies": []
        }
      ]
    },
    {
      "id": "if3miv8",
      "text": "They all worship Paul's teachings anyway.  Today's \"Christians\" (meaning US Evangelists and Prosperity Gospel idiots) ain't got any time for reflecting on what Jeebus said and did...",
      "timestamp": "2022-07-06 17:38:11",
      "score": 13,
      "num_children": 2,
      "author": 72619,
      "replies": [
        {
          "id": "if3o9s0",
          "text": "Jesus: If he asks for your shirt, give him your coat as well.\n\nPaul: If he does not work, then he shall not eat.\n\nDirectly contradictory advice from \"God\" about how to handle those in need. Which one do you think today's Christians listen to?",
          "timestamp": "2022-07-06 17:49:50",
          "score": 13,
          "num_children": 0,
          "author": 197249,
          "replies": []
        },
        {
          "id": "if4lgc5",
          "text": "Paul was a misogynist and an incel. He might have been asexual, but I think it's equally as likely that he was simply repulsed by sex because of religious influence - much like how John Kellogg was.",
          "timestamp": "2022-07-06 21:40:45",
          "score": 3,
          "num_children": 0,
          "author": 15037,
          "replies": []
        }
      ]
    },
    {
      "id": "if3p8ge",
      "text": "christian nationalists are the cancer of this country",
      "timestamp": "2022-07-06 17:56:15",
      "score": 10,
      "num_children": 0,
      "author": 400413,
      "replies": []
    },
    {
      "id": "if357ye",
      "text": "Jesus the Nazarene probably never existed.",
      "timestamp": "2022-07-06 15:45:16",
      "score": 48,
      "num_children": 5,
      "author": 279405,
      "replies": [
        {
          "id": "if3q7dy",
          "text": "His profile is likely that of an itinerant Rabbi who killed by the Romans for being revolutionary and then it was embellished by Constantine for public consumption after the Roman authority saw that it was useful to control the unwashed masses.",
          "timestamp": "2022-07-06 18:02:45",
          "score": 29,
          "num_children": 3,
          "author": 404775,
          "replies": [
            {
              "id": "if4caq4",
              "text": "The funny thing is that jesus if he existed today would probably not even make it through american airport security",
              "timestamp": "2022-07-06 20:37:17",
              "score": 12,
              "num_children": 1,
              "author": 296050,
              "replies": [
                {
                  "id": "if4dabn",
                  "text": "Are you telling me Jesus wasn't a pasty white Anglo-Saxon man with blue eyes?",
                  "timestamp": "2022-07-06 20:44:08",
                  "score": 5,
                  "num_children": 2,
                  "author": 276709,
                  "replies": [
                    {
                      "id": "if558af",
                      "text": "But God works in mysterious ways!\n\n(Also, if Jesus was white, why did Judas have to point him out? 🤔 A white homeless guy looks obviously different than a middle eastern homeless guy.)",
                      "timestamp": "2022-07-07 00:04:12",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "if4em69",
                      "text": "Believe it or not, from an Iranian, there are light skinned West Asians! No need to be reverse racist to fight racism by calling us all brown and disregarding the regions diversity",
                      "timestamp": "2022-07-06 20:53:09",
                      "score": 0,
                      "num_children": 3,
                      "replies": [
                        {
                          "id": "if4fvw0",
                          "text": "I'm aware of the region's diversity. I'm moreso making fun of the whitewashing done by modern conservative (usually american) christians. If Jesus had light skin, he had light skin. He certainly didn't look like the kid on Kinder chocolate logos, though",
                          "timestamp": "2022-07-06 21:01:52",
                          "score": 2,
                          "num_children": 1,
                          "author": 276709,
                          "replies": [
                            {
                              "id": "if4kn2d",
                              "text": "\"Stop wasting Korean Jesus time! He got Korean things to do!\" Who honeslty cares how people picture Jesus.",
                              "timestamp": "2022-07-06 21:35:02",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "if4fvmi",
                          "text": "Oh there are absolutely \"white passing\" West Asians but they're not exactly the \"Aryan ideal\" so many seem focused on, sigh",
                          "timestamp": "2022-07-06 21:01:49",
                          "score": 1,
                          "num_children": 1,
                          "author": 344368,
                          "replies": [
                            {
                              "id": "if4gocg",
                              "text": "Ironic since Iranians are literally Aryan by the original definition",
                              "timestamp": "2022-07-06 21:07:25",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "if4gszm",
                                  "text": "It's stupid, but that's little reason for it not to persist unfortunately lol",
                                  "timestamp": "2022-07-06 21:08:20",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 344368,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "if55kxe",
                          "text": "Believe it or not, Jesus is so native that Judas had to be paid off so the Romans would know they're arresting the right guy.",
                          "timestamp": "2022-07-07 00:06:47",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "if4hult",
              "text": "Not a Rabbi, the Rabbi's were the Pharisees, a group that the early Xtians very much didn't like",
              "timestamp": "2022-07-06 21:15:40",
              "score": 1,
              "num_children": 1,
              "author": 334263,
              "replies": [
                {
                  "id": "if56426",
                  "text": "Obviously parent commentor meant a literal rabbi. Thanks for correcting this disinfo, as I didn't know they meant 'jewish preacher'.",
                  "timestamp": "2022-07-07 00:10:47",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "if550sv",
              "text": "Seems legit. Imagine if we never wrote anything about MLK and then 90-100 years later we base a religion on him using oral stories and the documents the FBI have on committing his assassination.",
              "timestamp": "2022-07-07 00:02:40",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "if4hc0q",
          "text": "Jesus (Yeshua) is believed by most historians to be a historical person. However, almost nothing is known for sure about his life and message. He’s believed to have been a Jewish preacher who preached in Galilee and Judea and likely taught through parable. He was baptised and crucified. After that, things get fuzzy. None of the authors of the books of the New Testament are believed to have directly known or spoken to Jesus and Jesus didn’t write down anything that has been found. All of his teachings reach us through layers of oral tradition, heresay, and multiple conflicting authors. We really don’t know what he said, believed, or was like.\n\nOdds are he was a Jewish preacher who believed he was a Jewish Messiah, as messianic thought was popular during his time when foreign Romans governed Jerusalem. Most likely he confronted the Jewish and Roman elites of his time and was crucified for it.",
          "timestamp": "2022-07-06 21:12:04",
          "score": 11,
          "num_children": 0,
          "author": 282609,
          "replies": []
        },
        {
          "id": "if41noy",
          "text": "One thing I don't understand is if Jesus Christ isn't the first human being and appeared after a seperate time period, what about those people who lived before him? They certainly didn't know the rules of Christianity. So do they all go to hell? What's the theory.",
          "timestamp": "2022-07-06 19:22:40",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "if4lre2",
              "text": "Some certainly do believe that. Others I think believe in some sort of judging based on the rules at the time (near-term, Jewish rules or \"The Old Law\"). I think the Catholics believe Jesus went down to the \"realm of the dead\" and did the same thing for everyone who came before him there. I've also heard that not having had the chance to hear about Jesus was basically a free pass to Heaven, which has me wonder why anyone would do missionary work. You've basically damned them to hell lol.\n\nAs far as religions go, I actually find the Mormon church to be the fairest in that regard weirdly. After death, everyone's spirit goes to either \"Spirit Paradise\" or \"Spirit Prison\", depending on your faithfulness in life, collectively just called the \"Spirit World\". The idea is that those in spirit paradise try to \"spread the good word\" to those in spirit prison, and it's still up to them to accept it or not. You remember your life on earth, but not the \"premortal life\" (which is a whole other thing that most Christians don't believe in).\n\nThat's where baptisms (and other ordinances) for the dead come from. They do religious ordinances as a proxy for those who didn't have them done during life, but the dead people still have to accept it. There's also the end days where (as I understand it, I wasn't exactly a scripture scholar when I was in), Jesus rules over earth and everyone gets resurrected, you have a final chance to do all of this. Then everyone gets \"Final Judgement\", and sorted into the different tiers of heaven, where you then remember the premortal life as well. Mormons don't *really* have a concept of hell, so nobody is going there. \n\nThe way I understand Mormon Hell (called Outer Darkness) is that it's only for people who have a perfect knowledge of God and reject him. Which is like 5 people in the scriptures and nobody today.\n\n(I know there's nuances to a lot of this that I've missed, but that's the general idea)",
              "timestamp": "2022-07-06 21:42:55",
              "score": 2,
              "num_children": 0,
              "author": 268104,
              "replies": []
            }
          ]
        },
        {
          "id": "if4l5oz",
          "text": "Eh, I'm not really convinced of that theory.",
          "timestamp": "2022-07-06 21:38:40",
          "score": 1,
          "num_children": 0,
          "author": 15037,
          "replies": []
        },
        {
          "id": "if6n9hv",
          "text": "Though this is a guess, I do believe that Jesus existed but people just overexaggerated and praised him way too much which lead to the whole Christianity debacle",
          "timestamp": "2022-07-07 08:43:00",
          "score": 1,
          "num_children": 0,
          "author": 200475,
          "replies": []
        }
      ]
    },
    {
      "id": "if3v6k4",
      "text": "What a bunch of dumbasses they are. The churches and Republicans have controlled national politics and half the states since like 2000, except for Obama's first term but yea, the decline of America couldn't possibly be their own fault.",
      "timestamp": "2022-07-06 18:37:07",
      "score": 9,
      "num_children": 0,
      "author": 68776,
      "replies": []
    },
    {
      "id": "if3yybn",
      "text": "Idk why they're so worried about gay people tbfh like that's never made sense to me. If their religion says they aren't allowed to find love if they're gay then whatever, I don't care, but why do they care what the rest of the world is doing???",
      "timestamp": "2022-07-06 19:03:29",
      "score": 7,
      "num_children": 0,
      "author": 156654,
      "replies": []
    },
    {
      "id": "if3wuaw",
      "text": "You’re telling me people who believe in imaginary sky wizards and talking donkeys don’t see the truth of a matter? Color me shocked.",
      "timestamp": "2022-07-06 18:48:47",
      "score": 21,
      "num_children": 0,
      "author": 379415,
      "replies": []
    },
    {
      "id": "if3x4b9",
      "text": "Yeah lgbt people who just want to live their life happily as anyone else do is somehow destroying this country. Gotta love christian thinking",
      "timestamp": "2022-07-06 18:50:45",
      "score": 6,
      "num_children": 0,
      "author": 274280,
      "replies": []
    },
    {
      "id": "if3jkue",
      "text": "There are studies that link availability of family planning services to a decrease in crime rates.",
      "timestamp": "2022-07-06 17:18:41",
      "score": 20,
      "num_children": 2,
      "author": 389224,
      "replies": [
        {
          "id": "if3zyqt",
          "text": "Exactly this, the issue being that bringing unwanted children just increases the likelihood of this offspring to live miserably. Parenthood is of the most egoistic things we as rational animals can do, summoning a human being into existence without their consent to a world that may not accept who they are... The least must to do is be responsible with that.",
          "timestamp": "2022-07-06 19:10:39",
          "score": 7,
          "num_children": 0,
          "author": 210969,
          "replies": []
        },
        {
          "id": "if46d8u",
          "text": "I think the causality there is not so obvious, though. \n\nI think a lot of the policies about which we tend to argue with our opponents are all more symptoms, not the causes.",
          "timestamp": "2022-07-06 19:56:03",
          "score": 3,
          "num_children": 0,
          "author": 242359,
          "replies": []
        }
      ]
    },
    {
      "id": "if43yo4",
      "text": "There's a research that correlated the drastic drop in violent crime in 1990s-2000s to the expansion of abortion access in the US post Roe v Wade.",
      "timestamp": "2022-07-06 19:39:00",
      "score": 4,
      "num_children": 2,
      "author": 161742,
      "replies": [
        {
          "id": "if6qvkm",
          "text": "Where",
          "timestamp": "2022-07-07 09:32:50",
          "score": 1,
          "num_children": 1,
          "author": 359201,
          "replies": [
            {
              "id": "if8cjbj",
              "text": "https://en.m.wikipedia.org/wiki/Legalized_abortion_and_crime_effect#:~:text=%22We%20estimate%20that%20crime%20fell,crime%20in%20the%20early%201990s.%22",
              "timestamp": "2022-07-07 17:24:56",
              "score": 1,
              "num_children": 0,
              "author": 161742,
              "replies": []
            }
          ]
        },
        {
          "id": "ifgy3fv",
          "text": "Violent crime has been increasing for the last few years though...",
          "timestamp": "2022-07-09 13:15:02",
          "score": 1,
          "num_children": 1,
          "author": 3199,
          "replies": [
            {
              "id": "ifh3snh",
              "text": "It's a factor not the *only* factor.",
              "timestamp": "2022-07-09 14:04:13",
              "score": 1,
              "num_children": 1,
              "author": 161742,
              "replies": [
                {
                  "id": "ifh6fj9",
                  "text": "The problem with that is it leads to an argument for eugenics. If removing the \"undesirables\" decreases violent crime, some will take that logical position to its inevitable conclusion.",
                  "timestamp": "2022-07-09 14:25:13",
                  "score": 1,
                  "num_children": 1,
                  "author": 3199,
                  "replies": [
                    {
                      "id": "ifheebf",
                      "text": "It's just a correlation, no one is making that argument.\n\nOne possible explanation is that crime arises from unwanted, uncared for children who grow up to be unstable young adults. Abortion access reduces that factor.",
                      "timestamp": "2022-07-09 15:24:03",
                      "score": 1,
                      "num_children": 1,
                      "author": 161742,
                      "replies": [
                        {
                          "id": "ifhw5vt",
                          "text": "> One possible explanation is that crime arises from unwanted, uncared for children who grow up to be unstable young adults. ~~Abortion access~~ **Eliminating those unstable young adults** reduces that factor.\n\nSee what I mean?",
                          "timestamp": "2022-07-09 17:32:23",
                          "score": 1,
                          "num_children": 1,
                          "author": 3199,
                          "replies": [
                            {
                              "id": "ifi5nzb",
                              "text": "Or, you know, provide enough social safety nets so those unwanted children don't happen in the first place, or when they happen, they're still supported by society.\n\nEvil minds will use anything to justify what they want, it doesn't mean that these social factors at play are any less pertinent.",
                              "timestamp": "2022-07-09 18:43:01",
                              "score": 1,
                              "num_children": 1,
                              "author": 161742,
                              "replies": [
                                {
                                  "id": "ifjau00",
                                  "text": "How much money do you think the US spends on social programs per year?",
                                  "timestamp": "2022-07-09 23:59:08",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 3199,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "if468pq",
      "text": "And now they’re blaming pot smokers…. These people are freaks And it pisses me off that they are slowly taking over our country and showing god down all of our throats!",
      "timestamp": "2022-07-06 19:55:08",
      "score": 5,
      "num_children": 0,
      "author": 115580,
      "replies": []
    },
    {
      "id": "if3nj8s",
      "text": "The most alarming thing about the number of shootings in America is that most of them are either suicides or suicide by cop or murder suicide. \n\nWhat the fuck is happening that causes do many people to want to commit suicide in the USA? Maybe guns are just making it easier and the whole world is like that? Either way something is incredibly wrong.",
      "timestamp": "2022-07-06 17:44:56",
      "score": 11,
      "num_children": 1,
      "author": 9643,
      "replies": [
        {
          "id": "if3z042",
          "text": ">Maybe guns are just making it easier and the whole world is like that?\n\nAbsolute truth from someone that has tried to commit suicide: if I had access to a firearm as easily as Americans I would have succeeded.",
          "timestamp": "2022-07-06 19:03:50",
          "score": 13,
          "num_children": 0,
          "author": 303026,
          "replies": []
        }
      ]
    },
    {
      "id": "if3vgbz",
      "text": "People who don't acknowledge that unwanted children exist usually have their own and treat them accordingly. The mindset of glorified suffering begets abuse, always.",
      "timestamp": "2022-07-06 18:39:03",
      "score": 9,
      "num_children": 0,
      "author": 374815,
      "replies": []
    },
    {
      "id": "if470yi",
      "text": "Jesus loved everyone. Yet Christians be super judgy.",
      "timestamp": "2022-07-06 20:00:47",
      "score": 4,
      "num_children": 0,
      "author": 295383,
      "replies": []
    },
    {
      "id": "if5kkar",
      "text": "Christians against abortion haven't read their own book. The Christian Bible says foeticide isn't murder. It says causing an abortion by negligent violence is a misdemeanor not murder (Exodus 21:22-25). And it says forcing an abortion on a woman with herbs is an appropriate punishment for possible adultery (Numbers 5:27).",
      "timestamp": "2022-07-07 01:59:58",
      "score": 5,
      "num_children": 0,
      "author": 164578,
      "replies": []
    },
    {
      "id": "if3swnl",
      "text": "Freakonomics identified an inverse causal link between abortion services and violent crime.  Just think about how many more mass shootings there would have been without roe-v-wade.",
      "timestamp": "2022-07-06 18:21:19",
      "score": 15,
      "num_children": 2,
      "author": 64037,
      "replies": [
        {
          "id": "if4r8xn",
          "text": "America is going to be a 3rd world country in a few generations when entire regions are unwanted children, Fetal Alcohol, rampant crime, rampant poverty, incest, rape, and a feedback loop of newly born future Trump supporters. \n\nWhich is exactly what a small percent of elite GOP want. Christian slaves and a hellscape for anyone left of center. \n\nI sure as shit don't want to retire here. It's going to get ugly.",
          "timestamp": "2022-07-06 22:21:27",
          "score": 9,
          "num_children": 0,
          "author": 229669,
          "replies": []
        },
        {
          "id": "if3zto4",
          "text": "Wasn’t that debunked at some point? I truly believe it was related to lead poisoning which they also talked about in the same book.",
          "timestamp": "2022-07-06 19:09:38",
          "score": 3,
          "num_children": 2,
          "author": 231018,
          "replies": [
            {
              "id": "if46rrn",
              "text": "yes - also related to lead poisoning. You can track the changes over time relative to when abortion services change and also when lead in gas was ACTUALLY removed in each region. Strong correlation. \n\nAnother strong correlation is maternal death (e.g. moms dying) and restricting abortion services. \n\nWhen Texas restricted abortion services maternal mortality (e.g. moms dying) skyrocketed (doubled). That's just mom's dying - that didn't include maternal morbidity (e.g. kidney failure, massive bleedouts, sepsis, nearly dying, years of recovery, etc)\n\nWhen Ireland removed abortion restrictions in 2018, Maternal mortality went to zero every year since.\n\nPart of the reason is that the fetus attaches to the mother using a immune-system avoidant technique and a pre-nutrition lock to blood supply that is similar to how parasites attach. If all goes well - then that's fine. If, however, there are any issues then the mother and fetus fight for survival. If there's a miscarriage (e.g. spontaneous abortion, that's why the reported rates in the US are so high, because miscarriages are counted as abortions) that's not going well, and if you don't act immediately, that's a risky death sentence for the mother.\n\nIn Ireland, [Savita Halappanavar](https://www.bbc.com/news/uk-northern-ireland-20321741), a dentist, in the 2nd Trimester went in with complications and was told by a government contractor \"Because of our fetal heartbeat law - we cannot perform an abortion\" and that statement, killed her.\n\nWhat's going to happen in the US now that Roe-v-Wade is destroyed is that all the states that ban abortions will have more women die.\n\n---\n\nRead on for supporting citations to the above statements: \n\nAbortion statistics in the US include miscarriages.\n----\n\nState laws in places like Florida and Texas have been changed to create more stats for babies being \"alive\" after \"abortions.\" That's not a misquote.\n\nI was just debating someone on reddit and they made a really odd claim. It was\n\n> In 2018, the [Florida Agency for Health Care Administration reported 6 infants born alive after an abortion attempt.](https://ahca.myflorida.com/MCHQ/Central_Services/Training_Support/docs/LiveBirthsByCounty_2018.pdf)\n> \n> .... Do you believe it's OK to kill a child born alive after an abortion and/or deprive the child of adequate medical care?\n\nand I was like ... wait ... is that really a thing? So I looked at the above link and as you'll see it is nearly completely blank. No stats, no details, no links to methodology, ... just a number.\n\nI looked for the source and it turns out that this claim is repeated on Qanon-like blogs and websites all repeating the same thing over and over again about all these babies \"surviving\" abortions without evidence.\n\nSo I started searching through the Florida dept of health, etc and I finally found this document: https://ahca.myflorida.com/MCHQ/Health_Facility_Regulation/Hospital_Outpatient/forms/ITOP_Report_Guide.pdf [archive site in case it disappears](https://archive.is/jAuzb) which mandates both how to fill out the ITOP report and as part of that **redefines** what \"alive\" means AND includes as a *definition of \"abortion\"* the FL legislative definition to **include** miscarriages. Quoting from the text\n\n> Select the appropriate response.\n> \n> “Born alive” is defined in 390.011(4), F.S. as: “Born alive” means the complete expulsion or extraction from the mother of a human infant, **at any stage of development**, who, after such expulsion or extraction, breathes or has a beating heart, or definite and voluntary movement of muscles, regardless of whether the umbilical cord has been cut and regardless of whether the expulsion or extraction occurs as a result of **natural [labor]** or induced labor, caesarean section, induced abortion, or other method.\n\nSo medical providers are *mandated* to define a baby \"born\" without a brain as \"alive\" according to this definition.\n\nAlso medical providers are *mandated* to define an expulsion event as a result of **natural labor** (e.g. miscarriage) as abortion.\n\nRemember the woman in Texas arrested for a miscarriage as attempted abortion? Mandated reporting.\n\nSo a miscarriage that results in a baby twitching once ... fits in this definition of both \"alive\" and \"aborted.\" Baby born without lungs and barely any brain? \"Alive\"\n\nMore on Texas and statistics in the next section.\n\n----\n\nMore women die (including Texas doubling mortality rates) when abortion is restricted and fewer when abortion is allowed (Ireland statement):\n----\n\nTexas:\n\n[And maternal mortality spiked](https://www.theguardian.com/us-news/2016/aug/20/texas-maternal-mortality-rate-health-clinics-funding). Something that wasn't seen in adjacent states, or from the article ....\n\n\n>   the **doubling** of [maternal] mortality rates in a **two-year period** was hard to explain “in the absence of war, natural disaster, or severe economic upheaval”. .... No other state saw a comparable increase.\n\nSo something unique to Texas. Something dramatic changed there in 2011 that was not also seen in the other nearby states. That rules out climate and immigration (AZ & NM) and immigration as a cause is further ruled out by knowing that  [immigration rate has decreased](https://www.washingtonpost.com/politics/flow-of-illegal-immigration-slows-as-us-mexico-border-dynamics-evolve/2015/05/27/c5caf02c-006b-11e5-833c-a2de05b6b2a4_story.html)\n\nThe only thing that was different between Texas and all the other nearby states was this:\n\n> The researchers, hailing from the University of Maryland, Boston University’s school of public health and Stanford University’s medical school, called for further study. But they noted that starting in 2011, Texas drastically reduced the number of women’s health clinics within its borders.\n\nWhich strongly pointed the finger of death and disease at the people who created this \"experiment\" \n\nIt got so bad in 2014 that Texas decided \"hey - our rates are toooooo high! Let's *redefine* how to calculate Maternal Mortality Rates with a new [enhanced method](https://www.dshs.texas.gov/legislative/2020-Reports/DSHS-MMMRC-2020.pdf)\"\n\nIn the traditional Maternal Mortality Rate calculation, Texas is at 32 moms dying per 100,000 births. In the \"New and Ehanced\" method they are at 20 moms dying per 100,000 births.\n\nSo Texas is now at either 32 or 20 moms dying per 100,000 births (depending on if you accept how the QOP politicians are attempting to redefine \"alive\" and \"deaths\")\n\n\nBut it wasn't just Texas and Ireland:  In [country](https://www.sciencedirect.com/science/article/pii/S0167629620310596) after country, [around the world](https://bmcwomenshealth.biomedcentral.com/articles/10.1186/s12905-018-0705-y), when abortion is legal, maternal morality (e.g. DEATH) goes down and the opposite (more death and morbidity) when abortion is blocked.\n\nIreland:\n\nAfter the investigation from Savita Halippanar's death they found other women had also been killed because of the foetal heartbeat law in Ireland. The national uproar ended up changing the law in Ireland and made abortion legal. Ireland already had one of the best maternal care records in the world. But it got better as Ireland's maternal mortality went to 0 for each year after.\n\n|Year | Maternal Deaths  Per 100k Births: Complications of pregnancy, childbirth and puerperium (O00-O99) | Context\n|--- | ---|---|\n2007  | 2.80  | Abortion Illegal\n2008  | 3.99     | Abortion Illegal\n2009  | 3.97     | Abortion Illegal\n2010  | 1.33     | Abortion Illegal\n2011  | 2.70     | Abortion Illegal\n2012  | 2.79     | Abortion Illegal\n2013  | 4.34     | [Abortion Illegal: Savita Halappanavar's death caused by law and a \"fetal heartbeat\"](http://cdn.thejournal.ie/media/2013/06/savita-halappanavar-hse-report.pdf)\n2014  | 1.49   | Protection of Life During Pregnancy Act of 2013 passed.  abortion where pregnancy endangers a woman's life\n2015  | 1.53    | Abortion only allowed with mother's life at risk\n2016  | 6.27    | Abortion only allowed with mother's life at risk\n2017  | 1.62    | Abortion only allowed with mother's life at risk\n2018  | 0   | [Constitutional change, Abortion Allowed, 2013 Act repealed](https://www.bbc.com/news/world-europe-44256152)\n2019  | 0 | Abortion Allowed if mother's *health* is at risk\n2020  | 0 | Abortion Allowed if mother's *health* is at risk\n\nDeath Data Source: https://ws.cso.ie/public/api.restful/PxStat.Data.Cube_API.ReadDataset/VSD09/JSON-stat/2.0/en Birth Data Source: https://ws.cso.ie/public/api.restful/PxStat.Data.Cube_API.ReadDataset/VSA18/JSON-stat/1.0/en from the Ireland's Public Health records at Ireland's national data archival.    https://www.cso.ie/en/aboutus/whoweare/ and stored at https://Data.gov.ie\n\nNote: I linked to the raw data and it only goes back to 2007, because Ireland's OWN data scientists state: [\\[prior to 2007\\]  **flaws in methodology** saw Ireland’s maternal mortality rate fall \\[without justification\\], and figures in previous reports \\[prior to 2007\\] should **not be considered reliable**](https://www.thejournal.ie/maternal-deaths-mortality-rate-ireland-pro-life-campaign-statistics-2921139-Aug2016/)\n\n\n\nNote this is ONLY *mortality* and not also *morbidity* (e.g. kidney failure, hysterectomies, etc.).\n\nIf it was one year it might have been a fluke but it was 3 years running. If it was only Ireland it might have been a fluke, but it's seen repeatedly (see above sources) in other states, and countries.\n\nThis \"experiment\" has been repeated so many times that it's really no surprise at the results each time it happens.",
              "timestamp": "2022-07-06 19:58:59",
              "score": 12,
              "num_children": 0,
              "author": 64037,
              "replies": []
            },
            {
              "id": "if46j39",
              "text": "Not exactly debunked, but added to. Another theory about lead levels dropping in our blood came about.",
              "timestamp": "2022-07-06 19:57:14",
              "score": 2,
              "num_children": 0,
              "author": 63777,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "if3wbcw",
      "text": "TBF, Jesus seemed like a thoroughly decent bloke. It's bizarre that the people who claim to love him most are the least likely to adhere to his teachings (presuming they actually happened). If they did live as he suggested, their religion would be a lot more popular, which is essentially what he (supposedly) intended.\n\nHe wasn't trying to convert people to a hateful creed. Basically, he was saying, \"yeah, all that Old Testament stuff about killing first-born sons and stoning blasphemers - forget it. God is a chill guy these days, and he just wants everyone to love each other.\" Nobody would've listened to him if he were as nuts as your average modern Bible-basher.\n\nChristians are killing their own religion by making it as un-Christian as possible. At some point in the future, a new safe-for-work Christianity will become more prevalent, and they'll probably claim that the hardliners were agents of Satan, or something.",
      "timestamp": "2022-07-06 18:45:05",
      "score": 10,
      "num_children": 3,
      "author": 192801,
      "replies": [
        {
          "id": "if3wq5x",
          "text": "[deleted]",
          "timestamp": "2022-07-06 18:47:59",
          "score": 7,
          "num_children": 1,
          "replies": [
            {
              "id": "if54p59",
              "text": "With only 1900 years of written history and major retcons/rewrites every 400-600 years or so. Not to mention the tens of thousands of splinter groups, all of which claim that the others are invalid.",
              "timestamp": "2022-07-07 00:00:16",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "if42e0r",
          "text": "I just have one question. If Jesus isn't the first human on earth then what about those who lived befor him? They didn't know the rules of Christianity and there was no Bible so according to Christianity they should all go to hell because it's likely they are atleast going to break some rules. But what's the point of creating them in the first place as it's said the Christian god creates humans. I don't quite get the logic. The idea that Jesus Christ appeared after human civilization started raises a lot of questions.",
          "timestamp": "2022-07-06 19:27:49",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "if43ln2",
              "text": "Yeah, it doesn't bear scrutiny, but we are talking about the most gullible people in the world, after all.",
              "timestamp": "2022-07-06 19:36:23",
              "score": 2,
              "num_children": 0,
              "author": 192801,
              "replies": []
            }
          ]
        },
        {
          "id": "if4gnm0",
          "text": "No they fucking won't. They'll hardline down a path of genocide and oppression.",
          "timestamp": "2022-07-06 21:07:16",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "if3fq88",
      "text": "Thankfully not all of us unwanted straight guys are mental cases. Not being an incel makes the difference, perhaps.",
      "timestamp": "2022-07-06 16:53:03",
      "score": 10,
      "num_children": 0,
      "author": 396740,
      "replies": []
    },
    {
      "id": "if3lckw",
      "text": "It's not a coincidence that crime rates starting dropping dramatically in the 90's, a couple decades after Roe. We never gave millions of unwanted kids the opportunity to turn into criminals.",
      "timestamp": "2022-07-06 17:30:23",
      "score": 8,
      "num_children": 0,
      "author": 340922,
      "replies": []
    },
    {
      "id": "if51s2s",
      "text": "The Left 🤝 The Right \n\nDoing everything in their power to not mention the correlation between race and people who go on psychotic killing sprees.\n\nEdit: Gang violence is not comparable to people who kill indiscriminately or worse, people who write a racist manifesto shortly before commencing their killing spree.",
      "timestamp": "2022-07-06 23:38:19",
      "score": 6,
      "num_children": 0,
      "author": 364356,
      "replies": []
    },
    {
      "id": "if3a88c",
      "text": "Jesus who rolled with Mary Magdalene, a prostitute, was against divorce? I'm sure that wasn't a hard stance",
      "timestamp": "2022-07-06 16:17:39",
      "score": 12,
      "num_children": 1,
      "replies": [
        {
          "id": "if3gmko",
          "text": "There is no biblical truth to the claim that Mary Magdalene was a prostitute. Her importance to Jesus, by being named throughout the gospels, being the one to see the \"risen Christ\", and her prominence & influence in Christianity, bothered early Christian men so they sought to discredit her by claiming she was a \"fallen woman\" (ie prostitute).",
          "timestamp": "2022-07-06 16:58:57",
          "score": 21,
          "num_children": 1,
          "author": 269983,
          "replies": [
            {
              "id": "if3h945",
              "text": "That makes even more sense and that's sad. I had no judgements when I said prostitute though. In fact when I thought it was true it was another reason I thought Jesus might have been chill (if he even existed)",
              "timestamp": "2022-07-06 17:03:09",
              "score": 5,
              "num_children": 1,
              "replies": [
                {
                  "id": "if3ih0y",
                  "text": "I didn't think you were judging just based on how you phrased it :-) IF Jesus had been real he was really chill, even when he fashioned a whip in which to beat the Pharisees who were ripping off people and drive them out of the market. \n\nHe was so chill that, were he alive today, Christians would kill him again as he would be diametrically opposed to what they believe.",
                  "timestamp": "2022-07-06 17:11:21",
                  "score": 9,
                  "num_children": 0,
                  "author": 269983,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "if3dvs7",
      "text": "Stop making sense!",
      "timestamp": "2022-07-06 16:41:11",
      "score": 3,
      "num_children": 0,
      "author": 95499,
      "replies": []
    },
    {
      "id": "if3g6i5",
      "text": "Hahahahahaha\n\nFacts.",
      "timestamp": "2022-07-06 16:56:00",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "if3liho",
      "text": "Ah, but you see, it's still the gay people's fault. If there weren't gay people, these good Christian boys wouldn't *have* to go commit murder! I mean really, the gay community brings it on themselves for being gay.\n\n/s if it wasn't fucking obvious.",
      "timestamp": "2022-07-06 17:31:28",
      "score": 3,
      "num_children": 0,
      "author": 203212,
      "replies": []
    },
    {
      "id": "if3meb6",
      "text": "The dynamic you are describing is a core strategy of the right in whatever form it takes.",
      "timestamp": "2022-07-06 17:37:21",
      "score": 3,
      "num_children": 0,
      "author": 243846,
      "replies": []
    },
    {
      "id": "if3pxlg",
      "text": "Omg. Please have the supreme court try to outlaw divorce. I know that would be harmful too but I would love to see them start absolutely shitting themselves with rage when they realise they also have to live by their own stupid fucking rules.\n\n(Though actually please don't outlaw divorce because that will increase deaths also).",
      "timestamp": "2022-07-06 18:00:54",
      "score": 3,
      "num_children": 2,
      "author": 92076,
      "replies": [
        {
          "id": "if3uhbo",
          "text": "Probably have a significant impact on the number of faithful willing to tithe as well.",
          "timestamp": "2022-07-06 18:32:16",
          "score": 2,
          "num_children": 0,
          "author": 66348,
          "replies": []
        },
        {
          "id": "if6ncjj",
          "text": "The marriage rates are already dropping if they outlaw divorce it may as well be 0%",
          "timestamp": "2022-07-07 08:44:11",
          "score": 1,
          "num_children": 0,
          "author": 200475,
          "replies": []
        }
      ]
    },
    {
      "id": "if46n6c",
      "text": "A woman can pop a baby each year. They all could have 20 babies and populate if they wanted. But then again, aren't they the highest abortionists to begin with?\n\nTheir excuses are all lies and just diversions for their own. Just like Russia.",
      "timestamp": "2022-07-06 19:58:04",
      "score": 3,
      "num_children": 0,
      "author": 290703,
      "replies": []
    },
    {
      "id": "if4ar8k",
      "text": "That's assuming there actually was a such a person. And that my friend is the first step.",
      "timestamp": "2022-07-06 20:26:39",
      "score": 3,
      "num_children": 0,
      "author": 355295,
      "replies": []
    },
    {
      "id": "if4lkt8",
      "text": "There is a legitimate school of thought that says one big reason the huge wave of criminals that was expected in the 90s never materialized was because those unwanted, neglected children being raised by parents who couldn’t afford them who might have become criminals and who would start to come of age in the early 90s were aborted after Roe in 1972.",
      "timestamp": "2022-07-06 21:41:38",
      "score": 3,
      "num_children": 0,
      "author": 240011,
      "replies": []
    },
    {
      "id": "if4mcow",
      "text": "These folks are simply *Pretend Christians*  they are not Christian in any sense of the word ... they simply call themselves that because anyone who is into a skygod gives them political points.",
      "timestamp": "2022-07-06 21:47:03",
      "score": 3,
      "num_children": 0,
      "author": 345577,
      "replies": []
    },
    {
      "id": "if51qd4",
      "text": "And most extremist violence committed in the US comes from the politically right by a large margin. Not sure how much political ideology comes into play with mass shooters but right wing politicians certainly love to avoid any actual resolution to the real underlying issues with mass shootings or domestic terrorism... I wouldn't consider the DNP to be left winged but they're not as much of a threat to America as the GOP. Not even close... And you probably don't need to guess which party clings much harder to Christianity...\n\nI'll give you a hint. It's red all over.\n\n\nhttps://www.csis.org/analysis/military-police-and-rise-terrorism-united-states\n\nhttps://www.congress.gov/116/bills/s894/BILLS-116s894is.xml\n\nhttps://static.guim.co.uk/images/favicon-32x32.ico",
      "timestamp": "2022-07-06 23:37:58",
      "score": 3,
      "num_children": 0,
      "author": 214639,
      "replies": []
    },
    {
      "id": "if554x2",
      "text": "Christ loved the outcast and Christians hate those people",
      "timestamp": "2022-07-07 00:03:31",
      "score": 3,
      "num_children": 0,
      "author": 44937,
      "replies": []
    },
    {
      "id": "if5cp42",
      "text": "Stop engaging with them as if they are presenting honest discourse. They are not. They don't care if their arguments make no sense because it's just a moral smoke screen",
      "timestamp": "2022-07-07 01:00:18",
      "score": 3,
      "num_children": 0,
      "author": 90769,
      "replies": []
    },
    {
      "id": "if5cwf3",
      "text": "Well they’re not actually passing any laws on his teachings. They’re not even pretending to act as if they follow his word.",
      "timestamp": "2022-07-07 01:01:48",
      "score": 3,
      "num_children": 0,
      "author": 5010,
      "replies": []
    },
    {
      "id": "if5ejpy",
      "text": "Weird cause I blame American decline on Christians",
      "timestamp": "2022-07-07 01:14:14",
      "score": 3,
      "num_children": 1,
      "author": 195243,
      "replies": [
        {
          "id": "if5i98h",
          "text": "absolutely. It's christianity that fuels the spittle spewing idolization of guns, the flag, bootstraps, anti science and aryan philosophy.",
          "timestamp": "2022-07-07 01:42:18",
          "score": 3,
          "num_children": 0,
          "author": 195161,
          "replies": []
        }
      ]
    },
    {
      "id": "if5k1gq",
      "text": "Incels gonna incel.\n\nWe seem to be hell bent on ignoring that incels are hell bent on killing people. Those poor women who died in ATL, the people who died in Buffalo... all angry little incels who were just having a bad day, amirite?",
      "timestamp": "2022-07-07 01:55:53",
      "score": 3,
      "num_children": 0,
      "author": 360133,
      "replies": []
    },
    {
      "id": "if5l6a5",
      "text": "You're asking them to 1) read and 2) understand teachings of someone who preached empathy. \n\nCome on man.",
      "timestamp": "2022-07-07 02:04:41",
      "score": 3,
      "num_children": 0,
      "author": 90086,
      "replies": []
    },
    {
      "id": "if5wvk9",
      "text": "My friend, they have a VERY different idea of an “American decline”- if they’re upset, then something is going right",
      "timestamp": "2022-07-07 03:40:07",
      "score": 3,
      "num_children": 0,
      "author": 152027,
      "replies": []
    },
    {
      "id": "if62c34",
      "text": "Freakinomics reviewed this same thing.  turns out by aborting kids instead of bringing them unwanted in the world ended up reducing a lot of crime in the late 80s and 90s.",
      "timestamp": "2022-07-07 04:30:48",
      "score": 3,
      "num_children": 0,
      "author": 212880,
      "replies": []
    },
    {
      "id": "if3gyms",
      "text": "They want you to keep bringing kids into this world so they can traffic them. The fundamentalist Christian’s were Q all along.",
      "timestamp": "2022-07-06 17:01:11",
      "score": 7,
      "num_children": 1,
      "author": 343617,
      "replies": [
        {
          "id": "if3ph52",
          "text": "Yep, it was projection.",
          "timestamp": "2022-07-06 17:57:50",
          "score": 2,
          "num_children": 0,
          "author": 240203,
          "replies": []
        }
      ]
    },
    {
      "id": "if3g0v3",
      "text": "Don't give them ideas! Divorce wasn't legal in Spain until the 80's",
      "timestamp": "2022-07-06 16:54:57",
      "score": 6,
      "num_children": 0,
      "author": 248794,
      "replies": []
    },
    {
      "id": "if3m9ta",
      "text": "It's because no-one wants to hear about divorce, so they've shamelessly moved on to pimping their religion through the next hot-button issue.",
      "timestamp": "2022-07-06 17:36:31",
      "score": 7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "if3azar",
      "text": "Weed and video games as well. 🤣",
      "timestamp": "2022-07-06 16:22:28",
      "score": 4,
      "num_children": 1,
      "author": 63796,
      "replies": [
        {
          "id": "if5lmfk",
          "text": "I was raised by a single gay mom. I smoke weed I play video games I like heavy metal and tap lol..\n\n\nAccording to them I should constantly be on a shooting spree lol",
          "timestamp": "2022-07-07 02:08:09",
          "score": 1,
          "num_children": 0,
          "author": 330696,
          "replies": []
        }
      ]
    },
    {
      "id": "if3uen6",
      "text": "The right wing in this country will blame mass shootings on anything except the most obvious problem, easy access to guns.",
      "timestamp": "2022-07-06 18:31:45",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "if43u0s",
      "text": "Yet an almighty God placed \"imperfect\" people here just to be punished for how God made them. Use that on a Christian and watch their heads explode",
      "timestamp": "2022-07-06 19:38:04",
      "score": 3,
      "num_children": 1,
      "author": 279069,
      "replies": [
        {
          "id": "if44i6p",
          "text": "I literally have they called me some insult about me sinning to which I said: “I would gladly sin, for through sin I remain healthy and am happier. I find all religion to be disgusting and untrustworthy, so, from my point of view, the hyperreligious are the sinners needing to come to reality or be destroyed. However I don’t frame it like that, for religious rhetoric is backwards and not worth using, I prefer the following: backwards and reactionary cultures which refuse to modernise and adapt to the modern age by accepting differences and encouraging acceptance of them, and promoting equality, must be forced into modernity or cease to exist, for that which does not change will always remain broken”. If god wanted people to be Christian, it wouldn’t have invented science and had that be the thing advancing people, not made up degenerate fantasies!",
          "timestamp": "2022-07-06 19:42:51",
          "score": 2,
          "num_children": 0,
          "author": 165249,
          "replies": []
        }
      ]
    },
    {
      "id": "if4449n",
      "text": "You know that's coming next, right?",
      "timestamp": "2022-07-06 19:40:07",
      "score": 2,
      "num_children": 1,
      "author": 41675,
      "replies": [
        {
          "id": "if45mn4",
          "text": "what's coming next?",
          "timestamp": "2022-07-06 19:50:45",
          "score": 3,
          "num_children": 1,
          "author": 56063,
          "replies": [
            {
              "id": "if4nt1b",
              "text": "The right to divorce.",
              "timestamp": "2022-07-06 21:57:09",
              "score": 1,
              "num_children": 0,
              "author": 41675,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "if42nxh",
      "text": "America is declining because of predatory capitalism sucking all the air out of the economy.",
      "timestamp": "2022-07-06 19:29:45",
      "score": 2,
      "num_children": 1,
      "author": 105003,
      "replies": [
        {
          "id": "if44v7y",
          "text": "And because religion is encouraged here, and because we are too generally conservative. Conservative societies regress and die off, always.",
          "timestamp": "2022-07-06 19:45:22",
          "score": 3,
          "num_children": 0,
          "author": 165249,
          "replies": []
        }
      ]
    },
    {
      "id": "if49czr",
      "text": "No, I won't bring children into this shit hole of a world, So they can die in a school shooting, 4 of July event, or where ever they might be. We done.",
      "timestamp": "2022-07-06 20:17:07",
      "score": 2,
      "num_children": 0,
      "author": 205432,
      "replies": []
    },
    {
      "id": "if4aoh6",
      "text": "It's the role of uneducated religious conservatives to get manipulated by the wealthy and unscrupulous. They do the awful, immoral shit and think they're going to heaven. \n\nIt  has always been this way since the first shaman said he was talking with the Sun God.",
      "timestamp": "2022-07-06 20:26:08",
      "score": 2,
      "num_children": 0,
      "author": 322854,
      "replies": []
    },
    {
      "id": "if4bubk",
      "text": "They are just a bunch of fascists, that’s it. They “blame” everything on anyone else just as their leaders tells them. Not fucking once can they come up with cause and effect. Their “arguments” are infantile and stupid.\n\nFree abortions and full rights to LGBT+, PoC, etc. Period, zero compromise and zero discussion. \n\nStop playing their games, let’s push for the actual factual truths instead. Abortion makes for a better society, and so does equal rights for everyone. \n\nFuck fascists.",
      "timestamp": "2022-07-06 20:34:09",
      "score": 2,
      "num_children": 0,
      "author": 242458,
      "replies": []
    },
    {
      "id": "if4f2j3",
      "text": "Who are also fervent Trump supporters.",
      "timestamp": "2022-07-06 20:56:15",
      "score": 2,
      "num_children": 0,
      "author": 13191,
      "replies": []
    },
    {
      "id": "if4umrq",
      "text": "You need to meet more Christian’s, because the majority don’t care about gayness or abortion issues, the media makes you think it’s one side or the other, the majority thinks “that’s between you and god”",
      "timestamp": "2022-07-06 22:45:42",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "if4w6st",
      "text": "Majority of Americans are politically and socially illiterate, that might be the problem.",
      "timestamp": "2022-07-06 22:56:54",
      "score": 2,
      "num_children": 0,
      "author": 222295,
      "replies": []
    },
    {
      "id": "if4za09",
      "text": "I’ve learned that these people don’t want to listen or learn about anything other then their own personal beliefs. it’s always “ I believe” or “I think” and on some occasions they’ll say “studies have shown” but they are bogus studies of course. So there is no point.",
      "timestamp": "2022-07-06 23:19:43",
      "score": 2,
      "num_children": 0,
      "author": 307080,
      "replies": []
    },
    {
      "id": "if4zier",
      "text": "From the film: \nFreakonomics\nPG-13 2010 ‧ Documentary/Political cinema \n\nSection on abortion and the subsequent causation related to\n\nhttps://youtu.be/zCH_OewK_KI",
      "timestamp": "2022-07-06 23:21:25",
      "score": 2,
      "num_children": 0,
      "author": 356490,
      "replies": []
    },
    {
      "id": "if50lps",
      "text": "As a Christian, I blame Christian fundamentalists, like those found in Bob Jones University, and the many spineless Republicans/Conservatives that are Christian in name only, since they seem to be so fond of that comment. While spouting out that they know the Bible and the acts of Christ, they fail to see how he'd be a liberal socialist that believes in science. My brother in Christ, Allah, & Yahweh, connect the dots.",
      "timestamp": "2022-07-06 23:29:37",
      "score": 2,
      "num_children": 0,
      "author": 194246,
      "replies": []
    },
    {
      "id": "if5435o",
      "text": "Pretty sure the Bible is trans positive as Mary only had 1 set of DNA, which means Jesus Christ of Nazareth, the ***Son*** of God, is a biological clone of Mary.",
      "timestamp": "2022-07-06 23:55:39",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "if55d0v",
      "text": "Christian here - not disagreeing with you in principle. Just breaks my heart that my faith has been reduced to this stereotype. 😞 There *are* good Christians out there, and I hope you all can meet some, but I totally understand the perception and over-generalization.",
      "timestamp": "2022-07-07 00:05:10",
      "score": 2,
      "num_children": 0,
      "author": 22432,
      "replies": []
    },
    {
      "id": "if56hn6",
      "text": "America's decline parallels the rise of evangelical Christians telling and legislating how others should live. They have this invisible friend and mystic book (that they don't appear to have read or understood). They would turn the US into a Christian version of IS. They are the problem.",
      "timestamp": "2022-07-07 00:13:38",
      "score": 2,
      "num_children": 1,
      "author": 2891,
      "replies": [
        {
          "id": "if58fvi",
          "text": "It really is insane. You can pretty much annihilate Christian Theocracy with 2 simple arguments. Make them live by the laws of Leviticus while the non-believers can live by Jesus’ Sermon on the Mount. You know, pray in the closet, let god be the judge, that kind of stuff. Haha. Can I call myself post-Christian?",
          "timestamp": "2022-07-07 00:28:21",
          "score": 2,
          "num_children": 0,
          "author": 209400,
          "replies": []
        }
      ]
    },
    {
      "id": "if57rff",
      "text": "Christians not following what they believe in?!?! I'm so shocked",
      "timestamp": "2022-07-07 00:23:14",
      "score": 2,
      "num_children": 0,
      "author": 201271,
      "replies": []
    },
    {
      "id": "if5aee5",
      "text": "According to FOX News they're all cannabis users....and someone else(politics related) blamed womens rights. I forgot his name.\n\n They're always going to point fingers and have \"logical explanations\" for everything.",
      "timestamp": "2022-07-07 00:43:00",
      "score": 2,
      "num_children": 1,
      "author": 182407,
      "replies": [
        {
          "id": "if6csit",
          "text": "Lol I've never seen cannabis cause people to shoot up a crowd before, but sure let's blame that.",
          "timestamp": "2022-07-07 06:25:04",
          "score": 2,
          "num_children": 1,
          "author": 79577,
          "replies": [
            {
              "id": "if6cvuf",
              "text": "Me either....🤣🤣",
              "timestamp": "2022-07-07 06:26:14",
              "score": 2,
              "num_children": 0,
              "author": 182407,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "if5j0we",
      "text": "shhhhhhh\n\nKeeping people poor is how religion thrives",
      "timestamp": "2022-07-07 01:48:11",
      "score": 2,
      "num_children": 0,
      "author": 267748,
      "replies": []
    },
    {
      "id": "if5jkk1",
      "text": "I remember reading that in the wake of Roe v Wade crime actually decreased over the course of the following 18-20 years. I’m at work now so I can’t find the article.",
      "timestamp": "2022-07-07 01:52:19",
      "score": 2,
      "num_children": 1,
      "author": 374327,
      "replies": [
        {
          "id": "if5mpwo",
          "text": "Levitt's book Freakonomics had a chapter about this.",
          "timestamp": "2022-07-07 02:16:48",
          "score": 2,
          "num_children": 1,
          "author": 308169,
          "replies": [
            {
              "id": "if5rn09",
              "text": "I think it may have been from Freakonomics actually.",
              "timestamp": "2022-07-07 02:56:02",
              "score": 1,
              "num_children": 0,
              "author": 374327,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "if5mk0f",
      "text": "If you take a look at the mass shootings in the past two decades, a good percent of shooters are white males with ties to conspiracy theories/ alt right.",
      "timestamp": "2022-07-07 02:15:30",
      "score": 2,
      "num_children": 0,
      "author": 372177,
      "replies": []
    },
    {
      "id": "if5oqs0",
      "text": "Christians/right-wingers LOVE to blame America’s problems in the things they don’t like…\n\nWhich is ironic because the problems are worst where they’re in complete control at both the state and local level. \n\nMy favorite is that they even blame ESPN’s poor ratings on their coverage of “woke” issues, when research shows that young people can’t stand the channel’s wall to wall football coverage and their turn a few years ago to people just yelling at each other. Once again it’s the stuff the right wingers like that’s to blame. As always.",
      "timestamp": "2022-07-07 02:32:39",
      "score": 2,
      "num_children": 0,
      "author": 377185,
      "replies": []
    },
    {
      "id": "if60567",
      "text": "Any search of serial killers shows you what happens when children are born unwanted. We'll have a serious crime wave in 20-30 years from now.",
      "timestamp": "2022-07-07 04:09:41",
      "score": 2,
      "num_children": 0,
      "author": 327618,
      "replies": []
    },
    {
      "id": "if61pqg",
      "text": ">I don’t see the malevolent Christians passing any anti-divorce laws lately.\n\nPlease don't give them anymore ideas lol.",
      "timestamp": "2022-07-07 04:24:40",
      "score": 2,
      "num_children": 0,
      "author": 102606,
      "replies": []
    },
    {
      "id": "if61scv",
      "text": "This is why they're losing membership. Church is a cult for the irrational and dishonest.",
      "timestamp": "2022-07-07 04:25:22",
      "score": 2,
      "num_children": 0,
      "author": 311759,
      "replies": []
    },
    {
      "id": "if6yioz",
      "text": "With both abortions and saying gay to kids being outlawed in Florida my immediate though was “oh good! Being emotionally neglected and sexually repressed worked out so well for Jeffery Dahmer! I’m sure this next generation of kids are gonna be THE BEST.”",
      "timestamp": "2022-07-07 11:09:37",
      "score": 2,
      "num_children": 0,
      "author": 186884,
      "replies": []
    },
    {
      "id": "if7dnq7",
      "text": "And there is a direct correlation between lower crime and legal abortions.",
      "timestamp": "2022-07-07 13:28:49",
      "score": 2,
      "num_children": 0,
      "author": 170040,
      "replies": []
    },
    {
      "id": "if7emke",
      "text": "Beyond just noticing this in a \"huh - go figure\" moment, this is an actual study done after Roe V. Wade passed, and it is pretty solid understanding that Roe V Wade made things better.  \n\n\"We estimate that crime fell roughly 20% between 1997 and 2014 due to legalized abortion.\n\nGet ready for a crime wave America.  Because apparently all these shootings aren't enough...",
      "timestamp": "2022-07-07 13:36:20",
      "score": 2,
      "num_children": 0,
      "author": 216152,
      "replies": []
    },
    {
      "id": "if3x8kk",
      "text": "Neglectful parents breed hateful children.",
      "timestamp": "2022-07-06 18:51:34",
      "score": 6,
      "num_children": 0,
      "author": 264382,
      "replies": []
    },
    {
      "id": "if4kd98",
      "text": "It's no coincidence that the crime rate in the United States plummeted about 16 years after roe v Wade became law. \n\nUnwanted children in dire circumstances grow up to be delinquents",
      "timestamp": "2022-07-06 21:33:10",
      "score": 3,
      "num_children": 0,
      "author": 243132,
      "replies": []
    },
    {
      "id": "if2wxpd",
      "text": "It's time we make Vasectomies mandatory. Together we can stop unwanted straight children from shooting the masses, and prevent abortion by preventing conception.\n\nIt's a win-win.",
      "timestamp": "2022-07-06 14:50:40",
      "score": 7,
      "num_children": 1,
      "author": 394640,
      "replies": [
        {
          "id": "if3zv8o",
          "text": "I am just waiting for some nut job to pass a ban on vasectomy,  too.",
          "timestamp": "2022-07-06 19:09:57",
          "score": 3,
          "num_children": 0,
          "author": 74222,
          "replies": []
        }
      ]
    },
    {
      "id": "if47aac",
      "text": "Christians are responsible for almost all of our problems.",
      "timestamp": "2022-07-06 20:02:37",
      "score": 2,
      "num_children": 0,
      "author": 176354,
      "replies": []
    },
    {
      "id": "if5go50",
      "text": "You have mass shootings, but in Poland it's uncommon to own any gun, so instead, we have high suicide rate.",
      "timestamp": "2022-07-07 01:30:13",
      "score": 1,
      "num_children": 0,
      "author": 87632,
      "replies": []
    },
    {
      "id": "if5p40w",
      "text": "One thing they almost always have in common is mental illness and SSRI’s.",
      "timestamp": "2022-07-07 02:35:33",
      "score": 0,
      "num_children": 1,
      "author": 219804,
      "replies": [
        {
          "id": "if6p8ef",
          "text": "> One thing they almost always have in common is mental illness and SSRI’s.\n\n1: mental illness rates are about the same in all countries.\n\n2: females have higher rates of depression and SSRI use than males\n\nSo why are nearly all mass shooters white males living in the USA?\n\nBTW-SSRIs first became available in 1987, but mass shootings were occurring long before that. This is NRA bullshit.",
          "timestamp": "2022-07-07 09:10:04",
          "score": 4,
          "num_children": 1,
          "author": 404371,
          "replies": [
            {
              "id": "if6qdf7",
              "text": "Mental illness rates might be the same but they are not prescribed SSRI’s quite like in the U.S. I’ve been all over Europe and it’s just not the same. \n\nIt has nothing to do with females. There is most definitely some type of causation with young males (testosterone flowing) who are on SSRI’s and violence. \n\nWhen almost 100% of mass shooters are on some type of SSRI we need to at the very least question why.  \n\nOr we could continue to make more and more gun laws to make everyone feel warm and fuzzy until the next mass shooter comes along and guess what? Ignores the gun laws. What a shocking surprise. Let’s do this for another 20 years instead.",
              "timestamp": "2022-07-07 09:25:53",
              "score": 1,
              "num_children": 1,
              "author": 219804,
              "replies": [
                {
                  "id": "ifa1t79",
                  "text": "> Mental illness rates might be the same but they are not prescribed SSRI’s quite like in the U.S.\n\nThere actually isn't that much difference between developed countries. While the US ranks either [first or second](https://www.businessinsider.com/countries-largest-antidepressant-drug-users-2016-2) with Iceland in surveys other developed countries are not that far behind. Antidepressant use has significantly increased in European countries in the last decade.\n\n>When almost 100% of mass shooters are on some type of SSRI we need to at the very least question why.\n\nThis is [simply untrue](https://www.politifact.com/article/2019/aug/16/whats-behind-dubious-claim-psychiatric-drugs-fuel-/). It is a claim the Church of Scientology has been making for 25 years regularly publishing 'studies' to gain headlines with the actual data they produce not supporting the claim. \n\nIf SSRIs were the problem, and it is hard to see how given how they work, you would expect a rise in violent activity in all developed countries since 1987. In fact the opposite is the case. Taking [murder rates](https://en.wikipedia.org/wiki/List_of_countries_by_intentional_homicide_rate_by_decade) as a violence marker there has been a significant fall even in the U.S. from 9.4/100,000 in 1990 to 5.0/100,000 in 2018 and this is also true of other developed countries\n\n- [The myth of school shooters and psychotropic medications](https://onlinelibrary.wiley.com/doi/10.1002/bsl.2429)",
                  "timestamp": "2022-07-08 00:14:18",
                  "score": 1,
                  "num_children": 1,
                  "author": 404371,
                  "replies": [
                    {
                      "id": "ifac6xb",
                      "text": "It’s definitely true and it used to be very easy go find but when companies like Phizer who spend billions on drug development actually spend more on advertisements the hush hush is very widespread.   There used to be a graph that showed all the school shootings and what drugs they were on but it had to be taken down because of privacy.  \n\nIt can still be found it’s just much more difficult or when everyone is paid to pull down the evidence.  \n\nhttps://www.prnewswire.com/news-releases/mental-health-watchdog-releases-new-report-on-link-between-psychotropic-drugs--schoolmass-shootings-300618265.html\n\n\nhttps://www.cchrint.org/school-shooters",
                      "timestamp": "2022-07-08 01:31:20",
                      "score": 1,
                      "num_children": 1,
                      "author": 219804,
                      "replies": [
                        {
                          "id": "ifb2jwc",
                          "text": ">It can still be found it’s just much more difficult or when everyone is paid to pull down the evidence.\n\nIt most likely is being pulled because it is a lie.\n\nThe Citizens Commission on Human Rights (CCHR) *is* the friggin Church of Scientology!  Its claims are BS. Scientology actually grew from L. Ron Hubbard's [Dianetrics therapy](https://en.wikipedia.org/wiki/Dianetics) scam. Hubbard essentially plagiarised that other charlatan, Sigmund Freud.  Demonizing psychiatry and psychology is part of the Church's business model. It began by preying on the mentally ill and continues to do so.\n\nIf SSRIs are the problem then how do the CCHR, and you, account for the murder rate nearly halving since SSRIs were introduced in 1987?\n\nPS: The first recorded school shooting was [in 1840](https://en.wikipedia.org/wiki/List_of_school_shootings_in_the_United_States_\\(before_2000\\)),  147 years before SSRIs. They have continued with monotonous regularity ever since.",
                          "timestamp": "2022-07-08 05:08:55",
                          "score": 1,
                          "num_children": 0,
                          "author": 404371,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "if4tqgg",
      "text": "Most of the mass shooters are not white.  You could have looked that up but I realize this is Reddit.",
      "timestamp": "2022-07-06 22:39:14",
      "score": -13,
      "num_children": 2,
      "author": 305154,
      "replies": [
        {
          "id": "if52wb7",
          "text": "Where are you getting your stats from? What you are saying is definitely incorrect",
          "timestamp": "2022-07-06 23:46:40",
          "score": 6,
          "num_children": 0,
          "author": 304844,
          "replies": []
        },
        {
          "id": "if4ztha",
          "text": "Between 1982 and July 2022, 70 out of the 132 mass shootings in the United States were carried out by white shooters. By comparison, the perpetrator was African American in 21 mass shootings, and Latino in 11. When calculated as percentages, this amounts to 53 percent, 16 percent, and eight percent respectively.\n\n[](https://www.statista.com/statistics/476456/mass-shootings-in-the-us-by-shooter-s-race/)",
          "timestamp": "2022-07-06 23:23:44",
          "score": 14,
          "num_children": 1,
          "author": 219335,
          "replies": [
            {
              "id": "if52u2e",
              "text": "It really depends on how you define a \"mass shooting\". If you define it as 3 or more people shot in one incident Blacks are over-represented. If it's by a lone gunman who kills without cause, it's the figure you cite.\n\nEven with your figures, blacks make up about 12.4% of the population which means that if you look at the figures per capita the numbers tend to even out.\n\nThe moral of the story here is that this isn't a *race* issue, it's something else - like mental health, access to guns, a hyper-active media.....",
              "timestamp": "2022-07-06 23:46:13",
              "score": -9,
              "num_children": 2,
              "author": 151400,
              "replies": [
                {
                  "id": "if53fq4",
                  "text": "You're one of those \"I'm not racist but.....\" type people hey? 😅",
                  "timestamp": "2022-07-06 23:50:42",
                  "score": 9,
                  "num_children": 1,
                  "author": 320847,
                  "replies": [
                    {
                      "id": "if59hze",
                      "text": "And I'm guessing you're one of those \"label everyone a racist because I don't know how to read or have an intelligent nuanced discussion about difficult conversations\" people?",
                      "timestamp": "2022-07-07 00:36:16",
                      "score": -10,
                      "num_children": 1,
                      "author": 151400,
                      "replies": [
                        {
                          "id": "if5a6xn",
                          "text": "Could you link me to your stats to back them up? If you can then I'm happy to engage with you further. :)",
                          "timestamp": "2022-07-07 00:41:27",
                          "score": 11,
                          "num_children": 1,
                          "author": 320847,
                          "replies": [
                            {
                              "id": "if5g5q2",
                              "text": "Sure thing, but being as how everything I said is common knowledge and only takes about 5 seconds to find on Google; what exactly are you having issues with understanding? \n\nI'll gladly hold your hand through any issues you're unable to comprehend.",
                              "timestamp": "2022-07-07 01:26:21",
                              "score": -6,
                              "num_children": 1,
                              "author": 151400,
                              "replies": [
                                {
                                  "id": "if5heb7",
                                  "text": "You're the one making the argument, onus is on you to provide the evidence. Not a solid first reply so far.",
                                  "timestamp": "2022-07-07 01:35:47",
                                  "score": 10,
                                  "num_children": 1,
                                  "author": 320847,
                                  "replies": [
                                    {
                                      "id": "if5k9bw",
                                      "text": "This isn't the Journal Nature, my guy. I'm not making extraordinary claims either. At this point you're just trolling. \n\nMuted and moving on.",
                                      "timestamp": "2022-07-07 01:57:36",
                                      "score": -1,
                                      "num_children": 0,
                                      "author": 151400,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "if58yzx",
                  "text": "I did not say it was a race issue.",
                  "timestamp": "2022-07-07 00:32:20",
                  "score": 1,
                  "num_children": 0,
                  "author": 219335,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "if3jx90",
      "text": "Because straights murdering straights isn't a bad thing to them. \nAs long as they've accepted Jesus in their heart, they're good to go buck wild on one another. \nBut if you're queer, sorry. You're ruining others.... experience..?.. of what ever..",
      "timestamp": "2022-07-06 17:20:55",
      "score": 1,
      "num_children": 0,
      "author": 46206,
      "replies": []
    },
    {
      "id": "if3ogfb",
      "text": "Can they just kill me now before my brain explodes?",
      "timestamp": "2022-07-06 17:51:03",
      "score": 1,
      "num_children": 0,
      "author": 292340,
      "replies": []
    },
    {
      "id": "if3p5hv",
      "text": "> I don’t see the malevolent Christians passing any anti-divorce laws lately.\n\nLet's not give them any ideas.",
      "timestamp": "2022-07-06 17:55:41",
      "score": 1,
      "num_children": 0,
      "author": 32472,
      "replies": []
    },
    {
      "id": "if3r8ej",
      "text": "Or that should have been aborted.",
      "timestamp": "2022-07-06 18:09:47",
      "score": 1,
      "num_children": 0,
      "author": 252137,
      "replies": []
    },
    {
      "id": "if3rzbc",
      "text": "I've honestly been hoping there would be more of an equal split among political and social ideologies because then the world wouldn't be as black & white as people keep trying to tell me it isn't but nope, this just keeps happening this way.",
      "timestamp": "2022-07-06 18:14:56",
      "score": 1,
      "num_children": 0,
      "author": 25826,
      "replies": []
    },
    {
      "id": "if3subm",
      "text": "Can we just train them to give abortions and kill two birds with one stone?",
      "timestamp": "2022-07-06 18:20:52",
      "score": 1,
      "num_children": 0,
      "author": 108814,
      "replies": []
    },
    {
      "id": "if3tv50",
      "text": "https://youtu.be/t08l68z6kSk",
      "timestamp": "2022-07-06 18:27:59",
      "score": 1,
      "num_children": 0,
      "author": 109329,
      "replies": []
    },
    {
      "id": "if42cv0",
      "text": "Christian hypocrites? No, that cant be",
      "timestamp": "2022-07-06 19:27:35",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "if430xv",
      "text": "White nationalist terrorist / sov cits were (probably still are) #1 on the FBI's watch list a few years ago.",
      "timestamp": "2022-07-06 19:32:17",
      "score": 1,
      "num_children": 0,
      "author": 402781,
      "replies": []
    },
    {
      "id": "if43rd3",
      "text": "What about anti-adultery laws? They seem to love that shit too.",
      "timestamp": "2022-07-06 19:37:33",
      "score": 1,
      "num_children": 0,
      "author": 232067,
      "replies": []
    },
    {
      "id": "if494sq",
      "text": "Which brings us to the question: Why are there so few Table flipping Socialist extremist christians willing to defend their interpretation of this book?\n\nIn my opinion the whole book and religion is bs but id like to see an explanation for the lack of fundamentalist christians with the 'right' interpretations.",
      "timestamp": "2022-07-06 20:15:32",
      "score": 1,
      "num_children": 0,
      "author": 387774,
      "replies": []
    },
    {
      "id": "if49ayg",
      "text": "Those anti divorce laws come after the Marry your rapist laws.",
      "timestamp": "2022-07-06 20:16:43",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "if49gzv",
      "text": "As we are in atheist forum, I'm obliged to ask if you have any data on that. I didn't find any statistics on the matter. I might buy the straight part, but are straight people overrepresented in the data? I'm pretty sure you're doing 'kitchen psychology' on the unwanted child part.",
      "timestamp": "2022-07-06 20:17:54",
      "score": 1,
      "num_children": 0,
      "author": 268540,
      "replies": []
    },
    {
      "id": "if4b02m",
      "text": "im pretty sure most Christians would be in favour of ending no fault divorce",
      "timestamp": "2022-07-06 20:28:19",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "if4byuo",
      "text": "As a Christian replying to this solely because of the all page, I wholeheartedly agree on the divorce issue. There’s a reason why it’s so heavily talked against. The Bible addresses the sin of lust, even when speaking about homosexuals, there was no love in Sodom and Gomorrah, just rape and people so addicted to sex that they would have intercourse with animals and children. That was Paul’s message. I do believe that if people feel the need to sin, then protection should be prioritised by the state way more than it is in the US. Contraceptives are not given the spotlight they need.",
      "timestamp": "2022-07-06 20:34:59",
      "score": 1,
      "num_children": 0,
      "author": 290956,
      "replies": []
    },
    {
      "id": "if4cy4i",
      "text": "That is a huge overlap with republican voting body, so sure they don't want them aborted",
      "timestamp": "2022-07-06 20:41:46",
      "score": 1,
      "num_children": 0,
      "author": 384529,
      "replies": []
    },
    {
      "id": "if4d77w",
      "text": "You say \"malevolent christians\" as if all christians weren't zealots, hypocrites and enablers.\n\nACAB",
      "timestamp": "2022-07-06 20:43:32",
      "score": 1,
      "num_children": 0,
      "author": 59942,
      "replies": []
    },
    {
      "id": "if4dlet",
      "text": "The abortion and LGBT stuff are just culture-war issues to distract from the fact that the politicians they support don’t have any actual *policy* that improves their lives, and yet they lap it right up. Hating is easy, distracts from real issues, and they’re all to happy to engage in it.",
      "timestamp": "2022-07-06 20:46:14",
      "score": 1,
      "num_children": 0,
      "author": 290988,
      "replies": []
    },
    {
      "id": "if4e4p9",
      "text": "Just saying, before the Roman Empire fell, Christianity took it over. Coincidence? I think not.",
      "timestamp": "2022-07-06 20:49:51",
      "score": 1,
      "num_children": 0,
      "author": 89339,
      "replies": []
    },
    {
      "id": "if4ei7h",
      "text": "In Malcolm Gladwell's book \"Freakonomics\" he makes a statistical correlation between legalized abortion and the rapid decline in violent crimes during the 90s.\n\nUnwanted babies aborted in the 70s would have been in their hell raising years by the 90s.",
      "timestamp": "2022-07-06 20:52:24",
      "score": 1,
      "num_children": 0,
      "author": 152165,
      "replies": []
    },
    {
      "id": "if4eo12",
      "text": "American Christians are the least respectable religion in the world besides Mormans and Scientologist. All mentally very ill.",
      "timestamp": "2022-07-06 20:53:30",
      "score": 1,
      "num_children": 0,
      "author": 122984,
      "replies": []
    },
    {
      "id": "if4ewiz",
      "text": "I blame american decline on Fundamentalist \"christians\" who are bone ignorant monkeys",
      "timestamp": "2022-07-06 20:55:06",
      "score": 1,
      "num_children": 1,
      "author": 241767,
      "replies": [
        {
          "id": "if4h8hv",
          "text": "“The Christian resolution to find the world ugly and bad has made the world ugly and bad.”  -Friedrich Nietzsche",
          "timestamp": "2022-07-06 21:11:22",
          "score": 1,
          "num_children": 0,
          "author": 150519,
          "replies": []
        }
      ]
    },
    {
      "id": "if4ez0x",
      "text": "I'm guessing they won't go against divorce since so many of them are divorced themselves.  But for heaven's sake let's not give them any ideas.",
      "timestamp": "2022-07-06 20:55:35",
      "score": 1,
      "num_children": 0,
      "author": 235150,
      "replies": []
    },
    {
      "id": "if4hn64",
      "text": "Do ya think?!",
      "timestamp": "2022-07-06 21:14:13",
      "score": 1,
      "num_children": 0,
      "author": 264903,
      "replies": []
    },
    {
      "id": "if4ih92",
      "text": "The breakdown of the American family in all aspects",
      "timestamp": "2022-07-06 21:20:02",
      "score": 1,
      "num_children": 1,
      "author": 106753,
      "replies": [
        {
          "id": "ifcmy10",
          "text": "Goon",
          "timestamp": "2022-07-08 14:54:21",
          "score": 1,
          "num_children": 0,
          "author": 246374,
          "replies": []
        }
      ]
    },
    {
      "id": "if4iicr",
      "text": "Jesus DID NOT like rich people. Like, not at all.",
      "timestamp": "2022-07-06 21:20:15",
      "score": 1,
      "num_children": 0,
      "author": 132609,
      "replies": []
    },
    {
      "id": "if4ip4o",
      "text": "I'd bet that most of the shooters are/were either religious themselves or brought up in highly religious environments. Like most serial killers",
      "timestamp": "2022-07-06 21:21:32",
      "score": 1,
      "num_children": 0,
      "author": 17939,
      "replies": []
    },
    {
      "id": "if4lfqe",
      "text": "I'm pretty sure Mary Magdalen had an abortion or two. Back then you'd just drink enough poison to make yourself sick but not die.",
      "timestamp": "2022-07-06 21:40:38",
      "score": 1,
      "num_children": 0,
      "author": 151855,
      "replies": []
    },
    {
      "id": "if4m4ed",
      "text": "How hard is this to understand, parents that want to be parents make the best parents. I remember a debate a while back and Christopher Hitchens had said something like, \"There is one for sure thing that pulls countries out of poverty, ensuring women to have equal rights.\" It would not be beyond the pail to say, \"ensuring that women can control their reproductive rights makes a less violent society.\"",
      "timestamp": "2022-07-06 21:45:27",
      "score": 1,
      "num_children": 0,
      "author": 227322,
      "replies": []
    },
    {
      "id": "if4mi2n",
      "text": "Just you wait.\nJust you wait…",
      "timestamp": "2022-07-06 21:48:06",
      "score": 1,
      "num_children": 0,
      "author": 376590,
      "replies": []
    },
    {
      "id": "if4ol16",
      "text": "Now look at how many were from households without fathers.",
      "timestamp": "2022-07-06 22:02:34",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "if4oxk9",
      "text": "If only there was some way that a person could be judged to be mentally incompetent and be locked away so as to no longer be a danger to society. We could only be so lucky.",
      "timestamp": "2022-07-06 22:05:03",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "if4ozwb",
      "text": "Jesus the jewish nazarene defered to \"jewish law\" so you should probably read about that before you try to make a comparison. Because that has something to say about gender which is what Jesus stance would have been.",
      "timestamp": "2022-07-06 22:05:30",
      "score": 1,
      "num_children": 0,
      "author": 247109,
      "replies": []
    },
    {
      "id": "if4p11w",
      "text": "So the reason for American decline is mass shootings then?",
      "timestamp": "2022-07-06 22:05:44",
      "score": 1,
      "num_children": 0,
      "author": 38548,
      "replies": []
    },
    {
      "id": "if4p27z",
      "text": ">I don’t see the malevolent Christians passing any anti-divorce laws lately.\n\nDon’t give them any ideas.",
      "timestamp": "2022-07-06 22:05:58",
      "score": 1,
      "num_children": 0,
      "author": 91014,
      "replies": []
    },
    {
      "id": "if4qkog",
      "text": "Don’t jinx it. They love to say divorce destroys families and America",
      "timestamp": "2022-07-06 22:16:44",
      "score": 1,
      "num_children": 0,
      "author": 214523,
      "replies": []
    },
    {
      "id": "if4quhq",
      "text": "facts",
      "timestamp": "2022-07-06 22:18:37",
      "score": 1,
      "num_children": 0,
      "author": 229669,
      "replies": []
    },
    {
      "id": "if4sjd6",
      "text": "The Freakanomics book has a chapter on this.  Originally they purported to prove that the establishment of Roe v. Wade caused violent crime rates to drop dramatically starting around 16 years after passage.  Some flaws were eventually found in their statistical argument (i.e. no \"proof\"), but it's still a fairly compelling argument.",
      "timestamp": "2022-07-06 22:30:38",
      "score": 1,
      "num_children": 0,
      "author": 340949,
      "replies": []
    },
    {
      "id": "if4sjjv",
      "text": "I don't think that \"Christians\" see mass shootings as a decline   They see mass cultural acceptance of the people Jesus commanded them to accept as decline.\n\nP.S. they aren't actually Christians, they just *identify* as Christian.",
      "timestamp": "2022-07-06 22:30:40",
      "score": 1,
      "num_children": 0,
      "author": 202518,
      "replies": []
    },
    {
      "id": "if4sr9f",
      "text": "Christianity is a virus that infects otherwise normal people with massive greed and an inability to think logically.  Look at any country that has become majority Christian and you will see that country decline almost instantly.",
      "timestamp": "2022-07-06 22:32:12",
      "score": 1,
      "num_children": 0,
      "author": 159885,
      "replies": []
    },
    {
      "id": "if4sysw",
      "text": "Oh, they will get to divorce eventually",
      "timestamp": "2022-07-06 22:33:41",
      "score": 1,
      "num_children": 0,
      "author": 316578,
      "replies": []
    },
    {
      "id": "if4tqys",
      "text": "Uh, dont ask for that lmao.  They definitely would want to come for divorce.  Fundamentalist, \"family-values\" type Christians definitely do not think that divorce should happen.  They also often dont believe husbands can rape their wives.",
      "timestamp": "2022-07-06 22:39:20",
      "score": 1,
      "num_children": 0,
      "author": 222320,
      "replies": []
    },
    {
      "id": "if4usz6",
      "text": "I am betting this guy has a fucked up sexual perspective exacerbated by the shame  created by christian \"values\"",
      "timestamp": "2022-07-06 22:46:56",
      "score": 1,
      "num_children": 0,
      "author": 311130,
      "replies": []
    },
    {
      "id": "if4vpeh",
      "text": "Well I know plenty of atheists that blame Christians so...",
      "timestamp": "2022-07-06 22:53:24",
      "score": 1,
      "num_children": 0,
      "author": 372525,
      "replies": []
    },
    {
      "id": "if4vpmn",
      "text": "The unwanted children idea is a new one to me. Anyone have some reputable, relevant statistics corroborating that claim?",
      "timestamp": "2022-07-06 22:53:26",
      "score": 1,
      "num_children": 0,
      "author": 153296,
      "replies": []
    },
    {
      "id": "if4w4oe",
      "text": "The guilty conservatives never take responsibility and always blame someone else.",
      "timestamp": "2022-07-06 22:56:28",
      "score": 1,
      "num_children": 0,
      "author": 348259,
      "replies": []
    },
    {
      "id": "if4x6dn",
      "text": "Imagine the landscape in about 20 years...",
      "timestamp": "2022-07-06 23:04:07",
      "score": 1,
      "num_children": 0,
      "author": 206343,
      "replies": []
    },
    {
      "id": "if4yqch",
      "text": "Does anyone know if they think the decline is from their sky fairy punishing Amerika or what? Have they defined decline? Economy's been great, tech and medicine still moves forward rapidly; what's in decline (besides women's right, but they would think that's an uptick)? How can abortion and lgbtq people \"cause\" a decline?",
      "timestamp": "2022-07-06 23:15:40",
      "score": 1,
      "num_children": 0,
      "author": 403397,
      "replies": []
    },
    {
      "id": "if4zg2i",
      "text": "If only it were just mass shooters that caused problems.",
      "timestamp": "2022-07-06 23:20:56",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "if4zsez",
      "text": "They are mostly incels too.  Not only do their parents not want them, no one does.",
      "timestamp": "2022-07-06 23:23:30",
      "score": 1,
      "num_children": 0,
      "author": 143769,
      "replies": []
    },
    {
      "id": "if50xrj",
      "text": "If it's any consolation;\n\nAll of these people will die out eventually and their backwards ways will gradually disappear and be forgotten as another generation comes to light, and another, and another, and another...",
      "timestamp": "2022-07-06 23:32:04",
      "score": 1,
      "num_children": 0,
      "author": 98291,
      "replies": []
    },
    {
      "id": "if511y7",
      "text": "The whole point of religion is to pass blame on to your imaginary friend and never be accountable for anything.",
      "timestamp": "2022-07-06 23:32:55",
      "score": 1,
      "num_children": 0,
      "author": 244485,
      "replies": []
    },
    {
      "id": "if53byf",
      "text": "They've tried, and will try again: https://slate.com/human-interest/2014/04/republicans-against-no-fault-divorce-gop-politicians-push-for-waiting-periods-and-mandate-marriage-classes.html",
      "timestamp": "2022-07-06 23:49:56",
      "score": 1,
      "num_children": 0,
      "author": 290474,
      "replies": []
    },
    {
      "id": "if53mgy",
      "text": "What's the basis for concluding that they were unwanted children with respect to mass shooters?\n\nNot to say the blame on abortion or lgbtq issues is even remotely grounded.",
      "timestamp": "2022-07-06 23:52:07",
      "score": 1,
      "num_children": 0,
      "author": 347780,
      "replies": []
    },
    {
      "id": "if55uv6",
      "text": "Pfft, if you abort them you can't hunt them.",
      "timestamp": "2022-07-07 00:08:52",
      "score": 1,
      "num_children": 0,
      "author": 342486,
      "replies": []
    },
    {
      "id": "if56cob",
      "text": "There is no hypocrite like an American kristian krazy hypocrite.\n\nThey and their Diaper Wearing Orange Fucking Shitstain Jesus are the cause of America's decline.\n\nThose assholes are the scum of the fucking earth.",
      "timestamp": "2022-07-07 00:12:37",
      "score": 1,
      "num_children": 0,
      "author": 114177,
      "replies": []
    },
    {
      "id": "if56go2",
      "text": "But facts don't matter to them or they would base their lives on a better book.",
      "timestamp": "2022-07-07 00:13:26",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "if56jwz",
      "text": "Neither is a cause for the decline.",
      "timestamp": "2022-07-07 00:14:06",
      "score": 1,
      "num_children": 0,
      "author": 251936,
      "replies": []
    },
    {
      "id": "if57xbr",
      "text": "I want to preface this comment by saying I am lucky enough to both have grown up in and live in countries that are significantly less religious than America.\n\n My brand of atheism is not expressed with the need to have all shields up and all defences at the ready, guarding against attack, like many American athiests (understandably) must. My version of atheism is more absolute apathy to the whole religious concept and little to no influence of religion in my daily life (except for the like 500 religious paid public holidays that Germany has each year. In this case I find religion not so bad). \n\nAll that being said, the idiots in America currently using a very loose interpretation of cherry picked parts of some old fantasy book to attempt to control not only their own life or their own body, but the lifes and bodies of all americans, leave me speechless. \n\nFirstly, what does a random book that you like have to do with my life?\n\n I personally love trashy historical romance novels, read them daily, research them endlessly. Love them. But it's never come into my mind to try to force people to dress in Regency english dress or go and fight the French on horseback with a sword. Nor do I advocate for love at first sight across a crowded ballroom or any of the other obviously unrealistic (and honestly slightly toxic) concepts around choosing a life partner. \n\nWhat makes their book so special? Why does their book get to decide laws? And, like you said, if they are going to follow the book then why not all of it? No mixed fabrics and the rest of the madness. \n\nJust cos you like a book doesn't mean you get to make decisions about my life based on it.",
      "timestamp": "2022-07-07 00:24:28",
      "score": 1,
      "num_children": 0,
      "author": 137538,
      "replies": []
    },
    {
      "id": "if58h1i",
      "text": "Incels, probably, but I hear what you’re saying.",
      "timestamp": "2022-07-07 00:28:35",
      "score": 1,
      "num_children": 0,
      "author": 307969,
      "replies": []
    },
    {
      "id": "if58ono",
      "text": "The biggest cause of school shooters is not having a father or not having a good father AFAIK. Which makes sense to me at least, because my father was my hero as a kid, but then as I got older he became a role model and also an authority figure. I didn't want to do anything that would upset him(which is why I haven't told him I've renounced religion yet). I also knew that if I ever did anything that evil, he would break into the jail and kill me himself.",
      "timestamp": "2022-07-07 00:30:11",
      "score": 1,
      "num_children": 0,
      "author": 160701,
      "replies": []
    },
    {
      "id": "if5a0mz",
      "text": "My friend you’ve cracked the code.",
      "timestamp": "2022-07-07 00:40:09",
      "score": 1,
      "num_children": 0,
      "author": 187733,
      "replies": []
    },
    {
      "id": "if5ah12",
      "text": "More educated wisdom from the \"let's pull something else out of our ass\" crowd. It's like a repeat of the 80s. It wasn't true then, and it isn't true now. But blaming other people for their failures is all they have.",
      "timestamp": "2022-07-07 00:43:33",
      "score": 1,
      "num_children": 0,
      "author": 342614,
      "replies": []
    },
    {
      "id": "if5auhf",
      "text": "As someone who lived with those people, and had to see that logic at work, I agree. My mom preached love and Christian values, but at the same time took zero interest in any of her kids and didn't go to church, unless there was an event I was part of. The real decline is the fact that we haven't moved forward as a society. We're caught between the rasicm of the 50's and the progression of today. I don't think that we should force people to do anything like give up their ideals, but I do believe that we need to take huge leaps to move forward. Revise the constitution, remove the older generation from politics by setting age limits and mental health evaluations for all members so we know the people leading us are the right people. So much stuff needs to be done but no one who is qualified, because I very much am not, is willing to step forward and actually fight for what needs to be done.",
      "timestamp": "2022-07-07 00:46:22",
      "score": 1,
      "num_children": 0,
      "author": 62390,
      "replies": []
    },
    {
      "id": "if5b3tu",
      "text": "Their response to this logic [is summarised in this meme.](https://i.imgflip.com/5walpg.jpg)",
      "timestamp": "2022-07-07 00:48:20",
      "score": 1,
      "num_children": 0,
      "author": 58169,
      "replies": []
    },
    {
      "id": "if5cms5",
      "text": "Do you think logic works ?",
      "timestamp": "2022-07-07 00:59:50",
      "score": 1,
      "num_children": 1,
      "author": 307070,
      "replies": [
        {
          "id": "if72mru",
          "text": "Logic is impractical when you use it all the time! How do you think men win wars?",
          "timestamp": "2022-07-07 11:53:05",
          "score": 1,
          "num_children": 0,
          "author": 149052,
          "replies": []
        }
      ]
    },
    {
      "id": "if5f0ad",
      "text": "My main medium-term goal has shifted recently to emigrating out of the country. I am highly skilled, and the US desperately needs people with my skillset. Losing people like me is why America is in decline.",
      "timestamp": "2022-07-07 01:17:46",
      "score": 1,
      "num_children": 0,
      "author": 265817,
      "replies": []
    },
    {
      "id": "if5gz3u",
      "text": "I bet if they add two fathers or two mothers rather than a broken traditional family, they’d be happy young men  now￼",
      "timestamp": "2022-07-07 01:32:32",
      "score": 1,
      "num_children": 0,
      "author": 286600,
      "replies": []
    },
    {
      "id": "if5h30r",
      "text": "Those shooters are just living up to the wishes of the evil Christian destroyer god",
      "timestamp": "2022-07-07 01:33:24",
      "score": 1,
      "num_children": 0,
      "author": 213925,
      "replies": []
    },
    {
      "id": "if5hodq",
      "text": "This last mass shooter misfit went to Trump rallies and his parents were Republicans.  I’d like to know how many shooters came from gay couples from San Francisco?  Not many I bet.",
      "timestamp": "2022-07-07 01:37:55",
      "score": 1,
      "num_children": 0,
      "author": 251464,
      "replies": []
    },
    {
      "id": "if5im4l",
      "text": "Pretty sure they blame it on fatherlessness",
      "timestamp": "2022-07-07 01:45:02",
      "score": 1,
      "num_children": 0,
      "author": 20932,
      "replies": []
    },
    {
      "id": "if5jfkb",
      "text": "They should be more worried about their officiates fucking children! \n\nAlso, make them fucking pay taxes",
      "timestamp": "2022-07-07 01:51:14",
      "score": 1,
      "num_children": 0,
      "author": 348158,
      "replies": []
    },
    {
      "id": "if5jh2f",
      "text": "And probably from \"good whiye christian\" households",
      "timestamp": "2022-07-07 01:51:33",
      "score": 1,
      "num_children": 0,
      "author": 123021,
      "replies": []
    },
    {
      "id": "if5jy9a",
      "text": "This is a feature not a bug. Their whole way of doing politics would be at risk without those extremist elements to rally their base about.",
      "timestamp": "2022-07-07 01:55:11",
      "score": 1,
      "num_children": 0,
      "author": 200038,
      "replies": []
    },
    {
      "id": "if5loot",
      "text": "Just wait, the worst states just might.",
      "timestamp": "2022-07-07 02:08:39",
      "score": 1,
      "num_children": 0,
      "author": 277579,
      "replies": []
    },
    {
      "id": "if5mlz6",
      "text": "No surprise unwanted children are more likely to become criminals. Christians are effectively breeding a new generation of criminals by ramming their farcical and backwards \"pro-life\" garbage on everyone.",
      "timestamp": "2022-07-07 02:15:57",
      "score": 1,
      "num_children": 0,
      "author": 317733,
      "replies": []
    },
    {
      "id": "if5pdxf",
      "text": "Their god does nothing for them, so they grasp at straws to explain what they can't face",
      "timestamp": "2022-07-07 02:37:45",
      "score": 1,
      "num_children": 0,
      "author": 318011,
      "replies": []
    },
    {
      "id": "if5qy3r",
      "text": "I was an unwanted child and haven't shot anyone. Was never religious though, maybe that's part of the common denominator? I've never felt the need to ideologically align to any movement",
      "timestamp": "2022-07-07 02:50:24",
      "score": 1,
      "num_children": 0,
      "author": 147501,
      "replies": []
    },
    {
      "id": "if5srr9",
      "text": "Like rain on your wedding day. Well not like that.  It’s ironic.",
      "timestamp": "2022-07-07 03:05:20",
      "score": 1,
      "num_children": 0,
      "author": 155428,
      "replies": []
    },
    {
      "id": "if5w1ul",
      "text": "He did in galatians.  There's no distinctions,  no male, no female, no jew no gentile for you are all one in christ",
      "timestamp": "2022-07-07 03:33:01",
      "score": 1,
      "num_children": 0,
      "author": 113853,
      "replies": []
    },
    {
      "id": "if610ij",
      "text": "The few people that attend Church most have had abortions they just lie about it ⛪🤭",
      "timestamp": "2022-07-07 04:17:58",
      "score": 1,
      "num_children": 0,
      "author": 196497,
      "replies": []
    },
    {
      "id": "if65eco",
      "text": "And they just happen to be all Trump supporters.",
      "timestamp": "2022-07-07 05:02:12",
      "score": 1,
      "num_children": 0,
      "author": 220749,
      "replies": []
    },
    {
      "id": "if65mah",
      "text": "13% 50%",
      "timestamp": "2022-07-07 05:04:28",
      "score": 1,
      "num_children": 0,
      "author": 348533,
      "replies": []
    },
    {
      "id": "if65mdy",
      "text": "Part of the reason I left my faith was because it seemed more and more apparent that evangelicals were leading the planet closer to armageddon, not bringing heaven on earth.",
      "timestamp": "2022-07-07 05:04:30",
      "score": 1,
      "num_children": 0,
      "author": 413361,
      "replies": []
    },
    {
      "id": "if6cff7",
      "text": "ya know what the problem is? Ya got too many guns.",
      "timestamp": "2022-07-07 06:20:40",
      "score": 1,
      "num_children": 0,
      "author": 225093,
      "replies": []
    },
    {
      "id": "if6cgi9",
      "text": "Jesus’s main complaints were about how he was treated by the hyper religious and politicians and greed. He was basically sold to them by greed (Judas) \n\nThe Bible said under very few circumstances one should divorce. Adultry is one of them.\n\nOh to answer the question, yes, I’d have to agree. Why Christians are getting involved in politics is beyond me. It’s the opposite of what Jesus intended. \n\nThese Christian evangelists are basically religious zealots. It’s history repeating itself.",
      "timestamp": "2022-07-07 06:21:02",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "if6iosp",
      "text": "DIE OF CANCER",
      "timestamp": "2022-07-07 07:40:30",
      "score": 1,
      "num_children": 1,
      "author": 137025,
      "replies": [
        {
          "id": "if72sw0",
          "text": "If only if it was contagious enough but America also has a lot of drugs😞",
          "timestamp": "2022-07-07 11:54:44",
          "score": 1,
          "num_children": 0,
          "author": 149052,
          "replies": []
        }
      ]
    },
    {
      "id": "if6k2u2",
      "text": "Ain’t that crazy? We even had laws to prevent them and they still happened.",
      "timestamp": "2022-07-07 07:59:30",
      "score": 1,
      "num_children": 0,
      "author": 269828,
      "replies": []
    },
    {
      "id": "if6p0pd",
      "text": "Moat mass shooters, more importantly, are customers of SSRI and psyche meds. They can have devastating effects and cause Psychotic behavior.",
      "timestamp": "2022-07-07 09:07:09",
      "score": 1,
      "num_children": 0,
      "author": 222369,
      "replies": []
    },
    {
      "id": "if6p1k2",
      "text": "Don't give them any ideas about anti divorce laws...",
      "timestamp": "2022-07-07 09:07:28",
      "score": 1,
      "num_children": 1,
      "author": 64465,
      "replies": [
        {
          "id": "if72uts",
          "text": "Too late😡",
          "timestamp": "2022-07-07 11:55:16",
          "score": 1,
          "num_children": 0,
          "author": 149052,
          "replies": []
        }
      ]
    },
    {
      "id": "if6r1wm",
      "text": ">I don't see the malevolent Christians passing any anti-divorce laws lately.\n\nIt's coming in the future.",
      "timestamp": "2022-07-07 09:35:15",
      "score": 1,
      "num_children": 0,
      "author": 201527,
      "replies": []
    },
    {
      "id": "if6s1go",
      "text": "Indeed, right wingers are idiots and don't even know what the words and concepts they use actually mean.",
      "timestamp": "2022-07-07 09:48:43",
      "score": 1,
      "num_children": 0,
      "author": 196703,
      "replies": []
    },
    {
      "id": "if6t3bd",
      "text": "Can't believe my bi, trans, athiest ass is out here defending christians, but my Episcopalian Minister father in law and his Deacon wife are awesome people. If you are a believer who's been disillusioned with the hate give the Episcopal Church a try.",
      "timestamp": "2022-07-07 10:02:52",
      "score": 1,
      "num_children": 0,
      "author": 36469,
      "replies": []
    },
    {
      "id": "if6tke2",
      "text": "Accusing everyone else for everything else and spreading hate like a hate flame thrower. American Taliban indeed!",
      "timestamp": "2022-07-07 10:09:05",
      "score": 1,
      "num_children": 0,
      "author": 315060,
      "replies": []
    },
    {
      "id": "if6v09z",
      "text": "Holy shit the phrasing on this is so blunt",
      "timestamp": "2022-07-07 10:27:50",
      "score": 1,
      "num_children": 0,
      "author": 188652,
      "replies": []
    },
    {
      "id": "if6wycj",
      "text": "Not just straight guys though. Right wing., conspiracy theory believers, often with a repressed Christian life style",
      "timestamp": "2022-07-07 10:51:36",
      "score": 1,
      "num_children": 0,
      "author": 42000,
      "replies": []
    },
    {
      "id": "if6yhjj",
      "text": "I would never birth a child and bring them into Christianity. These people are fucking wack jobs. I had a so callled \"Baptist brother\" tell me as a child I would go to hell if I didnt go to church. There is something morally currupt with those who believe this and use this logic to manipulate others.",
      "timestamp": "2022-07-07 11:09:16",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "if730ig",
          "text": "Excuse me, 👑",
          "timestamp": "2022-07-07 11:56:48",
          "score": 1,
          "num_children": 0,
          "author": 149052,
          "replies": []
        }
      ]
    },
    {
      "id": "if7283j",
      "text": "Anti-divorce laws?? Family values are to be talked about, not lived!!",
      "timestamp": "2022-07-07 11:49:02",
      "score": 1,
      "num_children": 0,
      "author": 116563,
      "replies": []
    },
    {
      "id": "if74ytt",
      "text": "Lotta church shootings too, quite telling of who shooters blame for their shit.",
      "timestamp": "2022-07-07 12:15:32",
      "score": 1,
      "num_children": 0,
      "author": 338107,
      "replies": []
    },
    {
      "id": "if7bdey",
      "text": "Abortions have also been steadily declining for a long long time now",
      "timestamp": "2022-07-07 13:10:35",
      "score": 1,
      "num_children": 0,
      "author": 246214,
      "replies": []
    },
    {
      "id": "if7dhmd",
      "text": "Abortions are at historic lows.  So.....",
      "timestamp": "2022-07-07 13:27:28",
      "score": 1,
      "num_children": 0,
      "author": 131424,
      "replies": []
    },
    {
      "id": "if7dxdg",
      "text": "Religious Nationalism is honestly one of the most significant threats to the country rn.",
      "timestamp": "2022-07-07 13:30:55",
      "score": 1,
      "num_children": 0,
      "author": 25810,
      "replies": []
    },
    {
      "id": "if7eiyr",
      "text": "Christians want to blame societal chaos on a lack of adherence to their own version of their own faith, whose leaders have told them that their god punishes those who turn their backs on it. It's a cop-out. They have either no ability to see cause and fault beyond this or are simply dismissive of bad things that happen to other people.\n\nLeaders of their faith make really poorly arguments that tragedy is due to a backsliding of Christian faith in various ways after the fact and from a distance. They make callous and outrageous arguments that god doesn't protect people from these tragedies (shootings, natural disaster, etc) because they are not Christian enough. These statements are not a warning being delivered to the heathens in an effort to get them to change their ways, they are being delivered to their congregations as a warning; another attempt to place fear into them to prevent them from following others away from the church.\n\nWhat is most alarming to me is the backflips of reason they go through and break their own rules to asset this hateful rhetoric:\n\n1. God (or Jesus) is love- this hippy jesus freak mantra doesn't fly any more. There is no real love for others being shown by their followers and throwing their lot in with politicians bely their intentions. God is control and the illusion of safety in numbers. Churches are businesses that make a few people very wealthy. They will play their god however they need to maintain their cash flow and to bring in more wallets. This notion of a soft, squishy, happy god is a bait and switch marketing ploy.\n2. God protects his followers- natural disasters, school shootings, etc indiscriminately takes the lives of believers and non-believers alike. If a heathen dies in a flood, it was obviously because god was angry; if a christian died in the same flood, god had a plan for them. There's no ability to have any real discourse with people who ignore reality in this fashion.\n3. Bad things are because a formerly \"Christian nation\" has turned it's back on god- pure propaganda and historically false, believed by those eager to deny truth, stay uneducated, and maintain control. We currently have access to more information and education at our fingers than ever before in history. Churches have to use no less than outright mind control to veer people away from the truth and keep them in a delusional fantasy world of magic and nonsense. It is scary how well this works.\n4. Schools are a target for violence because prayer has been removed- historically false, grossly callous and disgusting, an excuse to avoid political and social issues. If putting god to the forefront in schools makes kids safer, why are priests, preachers, and other church adults molesting children in the church so easily and with almost no consequences? You would think that a building full of people protected by god would come under his wrath for abusing the innocent. Leaps of false logic are used to prevent NRA members, church goers and funders, and the hateful from asking simple questions about their choices and how they may be influencing actual tragedy.",
      "timestamp": "2022-07-07 13:35:34",
      "score": 1,
      "num_children": 0,
      "author": 53435,
      "replies": []
    },
    {
      "id": "if7f27q",
      "text": "Since when have christians cared about jesus?",
      "timestamp": "2022-07-07 13:39:40",
      "score": 1,
      "num_children": 0,
      "author": 184569,
      "replies": []
    },
    {
      "id": "if7ftmz",
      "text": "This is what the right does. And yeah while we are in /r/atheisms, this is 100% politics. The right get to the media first, with their BS, because they dont need to deal with pesky crap like facts and evidence. Its like in 2008 when the housing crash hit, the entire conservative machine went into overdrive blaming a law from the carter years, and jimmy carter.. for a crash in 2008.. due to a law that was modified 3 times under bush.  a law that had exactly dick to do with the crash. now the actual post mortem of the crash took a good month to work out a good idea of all the bits, though we knew a lot of it was the right winger idea that banks would self regulate.\n\nso when the barely paying attention public turns on the tv, they are inundated with the right winger explanation first. and the left have to explain that no it wasnt that all the poor people in the US suddenly decided together to buy too much house, and no it wasnt a law made in the 70s suddenly blowing up the economy.\n\nand they do these things because the real answers says bad things about them and their ideology.\n\ntax cuts to billionaires dont trickle down.\n\nbanks do need self regulation.\n\nspreading of hate, mainly from the right(along with all their scary imagery, some of the ads for these fucks this year are mega disturbing, where if we posted that shit as individuals we would get a visit from the ATF and FBI) and unwanted kids and the fact we have more guns than people and really shit laws and regulations governing them, is why we have these things. \n\nAnyways, its easy to point to the flaws in their ideas.\n\nRED STATES by far, have the most crime. including murder. BY FAR.\n\nand yet red states are the most restrictive when it comes to abortion and LGBT... in fact most right wing ideas could be fought this way, like the fact that red states are low tax states but blue states blow them away economically. Shouldn't it have trickled down more and all theri citizens being rich?\n\n[every negative stat, looks like an election map. look at this one and realize you do not want to live in a red state, especially dont want to raise a family there.](https://www.cdc.gov/nchs/pressroom/sosmap/homicide_mortality/homicide.htm)\n\nthe most murderous state is Mississippi, followed by Louisiana.\n\n\nand [that map is nearly a mirror of the map of states by religiosity](https://en.wikipedia.org/wiki/List_of_U.S._states_and_territories_by_religiosity)\n\nwith the exception of utah, the mormons go to church a fuck ton but dont murder a lot of people. go figure the people who got their religion out of a hat, appear to be the least crazy.",
      "timestamp": "2022-07-07 13:45:27",
      "score": 1,
      "num_children": 0,
      "author": 220399,
      "replies": []
    },
    {
      "id": "if7hjm4",
      "text": "People need to go study the psychology behind our society. It's a lot easier to get criminals. Organized crime is not organized crime its enough of the % of the population that wants to go around crime because they feel its unfair. Organized crime is a symptom of a system that cannot meet the needs of the society. These people are just acting out naturally due to these circumstances.",
      "timestamp": "2022-07-07 13:58:13",
      "score": 1,
      "num_children": 0,
      "author": 274629,
      "replies": []
    },
    {
      "id": "if7i0s4",
      "text": "I believe the bible does touch on abortion it just isn’t pro- life, (not particularly pro-choice either) Numbers 5:27 and 28 are about abortion being forced onto unfaithful women, again Numbers 5:19-22 related to abortion but describes it as more of a test rather than reaction, Exodus 22:22-25 describes the foetus more as property than a life, god has also used abortion as a punishment in Deuteronomy 28:18 and 53 there are a few other verses that I’m not including because they’re all about killing women (normally despite) that are pregnant, and by extension also killing the foetus.",
      "timestamp": "2022-07-07 14:01:44",
      "score": 1,
      "num_children": 0,
      "author": 115794,
      "replies": []
    },
    {
      "id": "if7r62v",
      "text": "When these unwanted babies grow up (with easy access to guns no less) guess who will be paying the price in about 20 years.",
      "timestamp": "2022-07-07 15:05:44",
      "score": 1,
      "num_children": 0,
      "author": 36053,
      "replies": []
    },
    {
      "id": "if7s6bu",
      "text": "I always bring up divorce  with Christians and it shuts most of them up. It's funny how some even try to support their divorce.",
      "timestamp": "2022-07-07 15:12:30",
      "score": 1,
      "num_children": 0,
      "author": 139793,
      "replies": []
    },
    {
      "id": "ifcsdtq",
      "text": "Damn. Taking one stupidity and replacing it with an even bigger one. Really? \"most of the mass shooters seem to be straight guys who were unwanted children\" ? Are you for fuckin real?.. \n\nI get that religion is bigger deal than it should be in the usa and is used a excuse for many shit things, but geezez fuckin christ this sub has turned into exactly the kind of den of nutjobs that people were treating atheists as 15-20 years ago..",
      "timestamp": "2022-07-08 15:30:15",
      "score": 1,
      "num_children": 0,
      "author": 25621,
      "replies": []
    },
    {
      "id": "igm5gck",
      "text": "Funny how all of these are issues white people have if you want to self genocide be my guest but keep the rest of us sane Americans free from the burden of having baby blood on our hands.",
      "timestamp": "2022-07-18 07:09:10",
      "score": 1,
      "num_children": 0,
      "author": 12092,
      "replies": []
    },
    {
      "id": "iilmm7s",
      "text": "Even tho uvalde school shooter was forced to cross dress by his mother, from what I heard and a picture, BOOM solved political everything",
      "timestamp": "2022-08-02 03:49:32",
      "score": 1,
      "num_children": 0,
      "author": 386504,
      "replies": []
    },
    {
      "id": "if4emxb",
      "text": "because being male sucks",
      "timestamp": "2022-07-06 20:53:17",
      "score": -17,
      "num_children": 2,
      "author": 362650,
      "replies": [
        {
          "id": "if4f9uc",
          "text": "I've never had a problem with it.",
          "timestamp": "2022-07-06 20:57:39",
          "score": 8,
          "num_children": 0,
          "author": 286151,
          "replies": []
        },
        {
          "id": "if4gsdw",
          "text": "Why is that?",
          "timestamp": "2022-07-06 21:08:12",
          "score": 7,
          "num_children": 2,
          "author": 213206,
          "replies": [
            {
              "id": "if4k6wd",
              "text": "If your struggling no one gives two fucks, in fact they make fun of you if you show your struggling.",
              "timestamp": "2022-07-06 21:31:55",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "if6c0ce",
                  "text": "Sounds like you need to hang out with other people instead of blaming your penis.",
                  "timestamp": "2022-07-07 06:15:41",
                  "score": 2,
                  "num_children": 0,
                  "author": 79577,
                  "replies": []
                }
              ]
            },
            {
              "id": "if4s9pu",
              "text": "[removed]",
              "timestamp": "2022-07-06 22:28:44",
              "score": -14,
              "num_children": 1,
              "replies": [
                {
                  "id": "if4tzq1",
                  "text": "I'm not a \"rich Chad\" and I've been married for almost 22 years. Please explain.",
                  "timestamp": "2022-07-06 22:41:03",
                  "score": 4,
                  "num_children": 1,
                  "author": 286151,
                  "replies": [
                    {
                      "id": "if4woss",
                      "text": "Anyone who unironically uses \"rich Chad\" is usually a lost cause. Just look at how he projects, you could refute him point for point but it's not like he would change. Change has got to come from within.",
                      "timestamp": "2022-07-06 23:00:32",
                      "score": 8,
                      "num_children": 1,
                      "author": 31064,
                      "replies": [
                        {
                          "id": "if4yysy",
                          "text": "[removed]",
                          "timestamp": "2022-07-06 23:17:25",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "if4z74q",
                              "text": "Of course they do, there are shallow women just are there are shallow men. But you're painting half of the population with a very broad brush without any critical thinking that there are normal ass women just like men. You think men don't have standards? I mean this in the kindest way and not to demean you, you have a lot of introspection to do.",
                              "timestamp": "2022-07-06 23:19:08",
                              "score": 2,
                              "num_children": 0,
                              "author": 31064,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "if6gykq",
      "text": "[deleted]",
      "timestamp": "2022-07-07 07:17:37",
      "score": -8,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "if50j5h",
      "text": "*White",
      "timestamp": "2022-07-06 23:29:04",
      "score": -3,
      "num_children": 0,
      "author": 131561,
      "replies": []
    },
    {
      "id": "if6vrlw",
      "text": "It's almost like if you constantly say that male masculinity is trash some of them will go insane and lash out. To think that this is as cut and dry as christians placing blame. No it's us atheists too. 9 month Abortion and progressive woke culture needs to go.",
      "timestamp": "2022-07-07 10:37:12",
      "score": -1,
      "num_children": 1,
      "author": 120285,
      "replies": [
        {
          "id": "if6yw7e",
          "text": "A \"9 month abortion\" is what we professional English users know as \"a birth.\" I hope you continue your English-as-a-second-language education so you'll learn these things one day.",
          "timestamp": "2022-07-07 11:13:50",
          "score": 2,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "if4tsvh",
      "text": "There’s no place for logic, accountability, and truth in this conversation.",
      "timestamp": "2022-07-06 22:39:42",
      "score": -15,
      "num_children": 1,
      "author": 9558,
      "replies": [
        {
          "id": "if5l3ab",
          "text": "There's no place for logic in religion. Seriously you can't look at any religion with logic and come away a believer...",
          "timestamp": "2022-07-07 02:04:03",
          "score": 12,
          "num_children": 1,
          "author": 330696,
          "replies": [
            {
              "id": "if5ybwi",
              "text": "[removed]",
              "timestamp": "2022-07-07 03:52:58",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "if5yuqr",
                  "text": "[removed]",
                  "timestamp": "2022-07-07 03:57:49",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "if5eo6l",
      "text": "[deleted]",
      "timestamp": "2022-07-07 01:15:11",
      "score": -1,
      "num_children": 1,
      "replies": [
        {
          "id": "if6cos7",
          "text": "What does being raised by women have to do with this?",
          "timestamp": "2022-07-07 06:23:48",
          "score": 1,
          "num_children": 0,
          "author": 79577,
          "replies": []
        }
      ]
    },
    {
      "id": "if5txwj",
      "text": "I mean chances are you are straight. \n\nPeople keep saying, \"these shooters are always cis white males.\"\n\nBut that's simply going to be true statistically. The only relevant thing you can say is that it is disproportionately young men. Race, sexual orientation aren't statistically significant.",
      "timestamp": "2022-07-07 03:15:07",
      "score": -6,
      "num_children": 0,
      "author": 88548,
      "replies": []
    },
    {
      "id": "if6jpqx",
      "text": "sorry to be the party pooperbbur in part they are right.\nBecause of the last sexual Revolution sexless men between 20-30 have tripled. Women are still behaving according to their biological patterns but in reality a small minority of men are having the time of their live while the dating market and mental health and happyness world wide plumeted. And please think hard before you down vote me. Because I am just the bearer of the bad news. Sex advertised as a free commodity where promiscuity is a virtue with no shame associated with it ia a huge societal change with loads of bad side effects.. Also no money for mentap health programs and you get women hating online connected disillusioned young men with a hate for society and women who wish for old traditional societal norms to make a comeback. As a cherry on top, the number of unhappy women is also at an all time high, because of these developments... If we as a modern society like it or not shame was used as a successful barrier for this problem for centuries.",
      "timestamp": "2022-07-07 07:54:29",
      "score": -9,
      "num_children": 2,
      "author": 65944,
      "replies": [
        {
          "id": "if6qikv",
          "text": "No shame with sex is a good thing. That you believe otherwise just shows how indoctrinated you are.",
          "timestamp": "2022-07-07 09:27:52",
          "score": 5,
          "num_children": 1,
          "author": 150005,
          "replies": [
            {
              "id": "if75b4z",
              "text": "You need to learn to read what people actually write not what you think people have written. The issue with shame is that it was a tool which caused much pain in healthy sexual development but was also a barrier to what is happening now. If you remove shame like society did in recent yeara without teaching people, that there is no such thing as free sex ( free as in free from responsibility and free of ill effects on society and personal development) Then you are simply ignorant of the facts of modern times. Having loads of incels in your popilation is not a good thing. Men giving up marriage is not a good thing. Yet many of you guys here see the evil religious boggy man in such news. How about thinking about solutions to these problems? And news flash: screaming destroy tue patriarchy is not one of them. This is not about religion at all for me, as I am leaning towards harcorde atheistic thinking, but an unstable society is simply not a good thing.",
              "timestamp": "2022-07-07 12:18:40",
              "score": 0,
              "num_children": 1,
              "author": 65944,
              "replies": [
                {
                  "id": "if7js6o",
                  "text": "Is having loads of women not liking sex (because they have no experience and dont know how good it could be if their partner actually tried to make it good for them) a good thing? \n\nIm pretty sure thats where the stereotype that sex ends once you're married comes from, for example. \n\nYour attitude seems to be that, as long as all/most men are able to get some sex, it doesnt matter that in loads of cases its shit for the women. I dont like that attitude at all.",
                  "timestamp": "2022-07-07 14:14:38",
                  "score": 1,
                  "num_children": 1,
                  "author": 350974,
                  "replies": [
                    {
                      "id": "if7neie",
                      "text": "No you got me all wrong  I am saying free dating and pro sex culture made our sexual market very much akin to the other free markets. We changed the way our society works, without proper care for the bad side effects this has. This goes for men and women. If sexual promiscuity is not shamed but praised this leads to many sexless average guys, many unhappy average women who can't find guys the like get into steady relatuonships with them. (instagram and tinder skewed their perception of the dating market because the guys who are willing to have sex with them are not the same group in social media who are willing to go steady with them) And after that whole trouble for a majority of people, there comes the aftermath for many girls, who too late realize these dynamics and try to catch a husbad (e.g. I am ready now for marriage) and then find out not that many stable sane men want a girl which had a body count as high as a mountain. Please note that I am not shaming girla specificall for this. In my experience man AND women change psychologically if they have too many note: casual sexual encounters. They have a real difficutlty forming stable relatuonships and not running away at the first sign of trouble, because in their unconcius mind the next better partner is a swipe away. To me these are not religious but psychological factora for which society needs some way to deal with them. playing the blame game will not help these people and will not help society.\nTLDR: Like it or not shame waa useful to keep society and sexual markets stable, since we abandonded it we as society need a new tool, since unhappy unmarried older women and many sexless young men are not good for us.",
                      "timestamp": "2022-07-07 14:40:10",
                      "score": 1,
                      "num_children": 1,
                      "author": 65944,
                      "replies": [
                        {
                          "id": "if85fxg",
                          "text": ">In my experience man AND women change psychologically if they have too many casual sexual encounters\n\nSpewing more made up bullshit. You’re so full of shut I’d be shocked if your sweat wasn’t brown.",
                          "timestamp": "2022-07-07 16:39:28",
                          "score": 1,
                          "num_children": 1,
                          "author": 150005,
                          "replies": [
                            {
                              "id": "if8e47o",
                              "text": "Look - I know I am not running in any open doors here in this forum.\n\nBut I leave you guys with this: THERE IS NO FREE LUNCH.\n\nEverything litterally everything has a drawback too.\n\nWhy don't you guys wanna believe that sleeping around is not exactly good way to train your brain to make lasting deep connections in monogamous relationships?\n\nNo I get easy snippy comebacks with no real value. Well I guess most of you guys are way below 35...",
                              "timestamp": "2022-07-07 17:35:00",
                              "score": 1,
                              "num_children": 1,
                              "author": 65944,
                              "replies": [
                                {
                                  "id": "if8h35u",
                                  "text": ">Why don't you guys wanna believe that sleeping around is not exactly good way to train your brain to make lasting deep connections in monogamous relationships?\n\nIt doesn't impact your ability at all? How do I know this? Through personal experience and an understanding of basic psychology.\n\nYou being old doesn't make you smart. In fact, your inability to understand physical intimacy vs emotional intimacy vs romantic intimacy shows you have the emotional intelligence of a gnat.",
                                  "timestamp": "2022-07-07 17:53:59",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 150005,
                                  "replies": [
                                    {
                                      "id": "if91eux",
                                      "text": "You are sounding like a ignorant fresh out of the bubble little squat.\n\nIf you have tons of emotional intimicy without physical intimacy that does not take out anything out of being romantic intimate with somebody? From my experiance it does. Maybe you are the kind of guy who can have sex without any emotional intimacy, from my personal experience most people can't or think they should be able to but feel empty or bad afterwards. Yes some people can do that, but that does not make my argument more or less invalid, that it makes it harder to form lasting connections with people if you did do that.\n\n I just can't think that somebody that had casual sex with more than hundred people can stop themselves from comparing their partner with all of those experiences. And nobody will be as good as every one of them in all of those things. Also and that was my main point which you never adressed: The Numbers we have today speak in my favour to my observations beeing true.\n\nIf you have no shame about sex in society a small minority of guys get all the girls.\n\nThese girls then think hey I can have a guy like that, no way I will settle for that average joe.\n\nThose guys will never settle for all but the best of the girls they can have.\n\nThen when their sexual success dwindles, those girls get spitten out and find out hey I am 30-35 now and I have no permanent partner.\n\nNow you have those guys who did not get the girls when they were 20-30 earning proper money. They are 30-35 now. \n\nWhy would they get a 30-35 year old women with a body count that high?\n\nI sure would not want that.\n\nSo they either get a good nice girl who was more on the  conservative side of their sexual journey or they get a younger girl, because heck why not?\n\nAnd all the while you have 3rd wave feminism telling those 30-35 year olds they are strong and empowered women, and every guy should be lucky if they could have a chance with them.\n\nIn short they are lying to them. \n\nSocial Media Tinder & Co are even stronger feedback loops in that whole system.\n\nAnd don't even get me started on glorious single mothers who think they are a catch.\n\nI lived through that sexual revolution and I can just again tell you the following.\n\nThat system produces sexless frustrated angry men and sad spent and lonely women. A small percantage of very attractive or successful people profit by this system. Or people not engaging in this kind of system at all.\n\nThose observations lead to my conclusion why there are so many young frustrated men wishing for a more conservative society and looking to a glorified past which never was.\n\nAnd here you are again not listening but projecting to some dude on the internet which you view as a desperate evil sexually frustrated women hater because how dare he criticise free shamless non monogamic sex as something bad.\n\nMy whole argument was that free sex is not inherently bad but society changed very rapidly and I don't think we thought that change really through.",
                                      "timestamp": "2022-07-07 20:04:23",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 65944,
                                      "replies": [
                                        {
                                          "id": "if9cjto",
                                          "text": "So much to unpack! Let's give it a go..bold strategy, Cotton!\n\n>You are sounding like a ignorant fresh out of the bubble little squat.\n\nNope, just someone who is emotionally secure :)\n\n>If you have tons of emotional intimicy without physical intimacy that does not take out anything out of being romantic intimate with somebody? From my experiance it does. Maybe you are the kind of guy who can have sex without any emotional intimacy, from my personal experience most people can't or think they should be able to but feel empty or bad afterwards. Yes some people can do that, but that does not make my argument more or less invalid, that it makes it harder to form lasting connections with people if you did do that.\n\nEveryone is different, some people don't need physical intimacy for the same connections as others. Sexuality, relationships, and connectivity are all on a grand spectrum.\n\nActually the ability to form lasting connections whether or not you emotionally connect on hookups or with FWBs is completely unrelated to romantic relationship-based connection.\n\n>I just can't think that somebody that had casual sex with more than hundred people can stop themselves from comparing their partner with all of those experiences. And nobody will be as good as every one of them in all of those things. Also and that was my main point which you never adressed: The Numbers we have today speak in my favour to my observations beeing true.\n\nThis is a belief that stems from insecurity. Your partner chose you out all all those hundreds which is what matters. And if you aren't striving to make your partner happy and doing right by them that's on you, not their history.\n\n>If you have no shame about sex in society a small minority of guys get all the girls.  \n>  \n>These girls then think hey I can have a guy like that, no way I will settle for that average joe.\n\nNor should they settle for someone. It's on men to be better, not on women to lower their standards. I know men who are not 10s that have no issue dating. The ones that do struggle believe they are owed things, which they are not.\n\n>Those guys will never settle for all but the best of the girls they can have.  \n>  \n>Then when their sexual success dwindles, those girls get spitten out and find out hey I am 30-35 now and I have no permanent partner.\n\nGuys don't need to settle. And you're making shit up about the women.\n\n>Now you have those guys who did not get the girls when they were 20-30 earning proper money. They are 30-35 now.  \n>  \n>Why would they get a 30-35 year old women with a body count that high?  \n>  \n>I sure would not want that.\n\nSo you're a slut-shamer. What a shock. Again, that's a you problem. Maybe learn to grow.\n\nWomen have the ability to support themselves so they don't need the incel douchebags. And 35 year old women have no problem getting laid or dating.\n\n>So they either get a good nice girl who was more on the  conservative side of their sexual journey or they get a younger girl, because heck why not?  \n>  \n>And all the while you have 3rd wave feminism telling those 30-35 year olds they are strong and empowered women, and every guy should be lucky if they could have a chance with them.  \n>  \n>In short they are lying to them.\n\nMore slut-shaming and woman-hating. Huge incel energy.\n\n>That system produces sexless frustrated angry men and sad spent and lonely women. A small percantage of very attractive or successful people profit by this system. Or people not engaging in this kind of system at all.\n\nAgain, wrong. Know why I have no problem dating? It's not because I'm an LA 10, it's because I respect women and their autonomy and don't hve delusions of being owed anything.\n\nAll these frustrated incels need to be better people, not just hate the syetem.\n\n>Those observations lead to my conclusion why there are so many young frustrated men wishing for a more conservative society and looking to a glorified past which never was.\n\nThere is a glorified past, one where women needed a man to pay the bills and because of this men didn't have to try but instead of self-reflecting they just hate women.\n\n>And here you are again not listening but projecting to some dude on the internet which you view as a desperate evil sexually frustrated women hater because how dare he criticise free shamless non monogamic sex as something bad.\n\nYes, how dare you because it's not any of your fucking business.\n\n>My whole argument was that free sex is not inherently bad but society changed very rapidly and I don't think we thought that change really through.\n\nNo. Men who don't want to put effort in are just unhappy with a system that empowers women. Has nothing to do with thinking it through. Men just dislike women having actual power over their own bodies and **again**, would rather bItch about it than improve themselves.",
                                          "timestamp": "2022-07-07 21:15:04",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 150005,
                                          "replies": [
                                            {
                                              "id": "if9emc9",
                                              "text": "Look from what I can gather you seem to be somewhat reasonable and I have to say yes that back and forth banter was well deserved :D.\nBut from the bottom of my heart no I am not a slut shamer I just simply think we are still much more slaves to our biology than man, it seems you included, are able to get themselves to admit. Also again the numbers don't lie if you think it is empowering for women to live in a society or follow live plans amd goals that leave  them single or worse single and with chils from a random fling then I think you are just lying to yourself and others because how dare they be unhappy that can not be true therefore let us ignore it. Also a tripling of sexless men between 20-30 and you think the all deserve that because they are lazy? Who is blaming whole groups of people here? Not me I am just pointing out that certain behavours seem to be having ill effects.",
                                              "timestamp": "2022-07-07 21:28:44",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 65944,
                                              "replies": [
                                                {
                                                  "id": "ifap2r8",
                                                  "text": "> Also again the numbers don't lie if you think it is empowering for women to live in a society or follow live plans amd goals that leave  them single or worse single and with chils from a random fling then I think you are just lying to yourself and others because how dare they be unhappy that can not be true therefore let us ignore it. \n\nYou're projecting your own beliefs onto others. Not having a partner at 30 or 40 does not just instantly make someone unhappy. And there's way more to feeling good or bad after se than it being caual.\n\n>Also a tripling of sexless men between 20-30 and you think the all deserve that because they are lazy? Who is blaming whole groups of people here? Not me I am just pointing out that certain behavours seem to be having ill effects.\n\nOh I am 100% putting the blame on men here. Women having the ability to be discerning is not the reason that your numbers (if they are verifiable) on sexless men are so high. It's because they do not self-reflect and act in a way that makes them desirable. You don't need to be rich or good-looking to get laid.",
                                                  "timestamp": "2022-07-08 03:09:38",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 150005,
                                                  "replies": [
                                                    {
                                                      "id": "ifb9guf",
                                                      "text": "Well your viewa are pretty ahort sighted then. Then it seems you really are of the oppinion that it is the men`s fault.\nSince you are ignoring these dangerous and destabling changea in society then there is little to talk about left. Have a good day and maybe if your answer is: That is the XYZ groups own fault to huge changes in society try viewing such problems more shades than black and white. \nLonely people are miserable in the long term.\nWomen not having a family if they wanted to in their live abaolutely makes them miserable.",
                                                      "timestamp": "2022-07-08 06:23:12",
                                                      "score": 0,
                                                      "num_children": 0,
                                                      "author": 65944,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "if6yzj6",
          "text": "I was supposed to be ashamed when I had sex? I've gone without shame since the '90s! Oh my!",
          "timestamp": "2022-07-07 11:14:52",
          "score": 1,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "if51az3",
      "text": "[removed]",
      "timestamp": "2022-07-06 23:34:45",
      "score": -12,
      "num_children": 3,
      "replies": [
        {
          "id": "if5kzou",
          "text": "Christians are in a cult period. \n\nGuess what I was raised by a single gay mom. I like heavy metal and tap music. I play video games. \n\nI own an AR-15 I enjoy target shooting with.\n\nGuess what has never once crossed my mind? Yup shooting up a crowd. \n\nChristians need to practice their religion amongst themselves and keep their shit out of my politics/school/government period.",
          "timestamp": "2022-07-07 02:03:16",
          "score": 8,
          "num_children": 0,
          "author": 330696,
          "replies": []
        },
        {
          "id": "if6c6t1",
          "text": "*aborting fetusses",
          "timestamp": "2022-07-07 06:17:51",
          "score": 2,
          "num_children": 0,
          "author": 79577,
          "replies": []
        },
        {
          "id": "if6zbq3",
          "text": "The violent crime rate has steadily decreased since about 16 years after Roe was legalized. You think there might possibly be a connection?",
          "timestamp": "2022-07-07 11:18:36",
          "score": 1,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "if73986",
              "text": "If they could find the true facts an not stand for one side!",
              "timestamp": "2022-07-07 11:59:13",
              "score": 1,
              "num_children": 0,
              "author": 149052,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "if4vv0h",
      "text": "Unwanted... by the father. Doesn't really gain much ground on the abortion front when the mother holds all the power on the decision to abort.",
      "timestamp": "2022-07-06 22:54:32",
      "score": -14,
      "num_children": 0,
      "author": 136921,
      "replies": []
    },
    {
      "id": "if69eo9",
      "text": "It’s a constitutional issue, not religious. The unborn life/potential has a inalienable right to flourish, and no voice yet to defend itself. Aborting or cutting short that life/potential is not upheld by our constitution. This is true freedom for this individual regardless of planned, unplanned and even tragedy. Do you see now?",
      "timestamp": "2022-07-07 05:45:34",
      "score": -14,
      "num_children": 2,
      "author": 190997,
      "replies": [
        {
          "id": "if6j9ce",
          "text": "Until birth a foetus is not a child. It is a human being, but not a natural person, with no corresponding rights, for the very simple reason that until birth the foetus depends on the mother for everything. It has no autonomy. Rights are not attributed to hypothetical beings. \n\nBy the way, until birth, anything can go wrong. Things can be peachy one day and have gone to shit the next. In these cases, the foetus will usually be sacrificed by the mother's body. It is then illogical to try and go against what is simply the way our bodies have evolved to work.",
          "timestamp": "2022-07-07 07:48:15",
          "score": 5,
          "num_children": 0,
          "author": 43520,
          "replies": []
        },
        {
          "id": "if6z1q9",
          "text": "What about the freedom of the individual that doesn't want a parasite living off of their body and risking their health and life?",
          "timestamp": "2022-07-07 11:15:34",
          "score": 2,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "if4mk6h",
      "text": "You forgot to mention that 95% of shooters are atheists. Atheists cherry picking as always,i guess being farmer is your dream job",
      "timestamp": "2022-07-06 21:48:30",
      "score": -27,
      "num_children": 3,
      "author": 71883,
      "replies": [
        {
          "id": "if4ucdv",
          "text": "I also like to make up statistics.",
          "timestamp": "2022-07-06 22:43:37",
          "score": 10,
          "num_children": 0,
          "author": 286151,
          "replies": []
        },
        {
          "id": "if4rsok",
          "text": "Don't most have ideologies based on religion? Women being sluts or gay people grooming.",
          "timestamp": "2022-07-06 22:25:22",
          "score": 9,
          "num_children": 0,
          "author": 37091,
          "replies": []
        },
        {
          "id": "if4ouvv",
          "text": "Do you have a source, the last study I read that was 84% where Atheist or agnostic.\n\n The remaining 16% had some faith, primarily Islamic or Christian.\n\nThe number one shared trait amongst these shooters is a disaffected childhood or childhood trauma.",
          "timestamp": "2022-07-06 22:04:31",
          "score": 2,
          "num_children": 0,
          "author": 13903,
          "replies": []
        }
      ]
    },
    {
      "id": "if5un2q",
      "text": "[deleted]",
      "timestamp": "2022-07-07 03:20:58",
      "score": -13,
      "num_children": 2,
      "replies": [
        {
          "id": "if6iq0r",
          "text": "Since there is no record that Jesus ever addressed the subject of abortion, there's no reason to believe he opposed it.",
          "timestamp": "2022-07-07 07:40:59",
          "score": 2,
          "num_children": 0,
          "author": 178902,
          "replies": []
        },
        {
          "id": "if6jfp1",
          "text": "The Old Testament is OK with abortion. So is the Talmud, based on the idea that the soul is only supposed to incarnate after 40 days of pregnancy. So, why not Jesus?",
          "timestamp": "2022-07-07 07:50:36",
          "score": 2,
          "num_children": 0,
          "author": 43520,
          "replies": []
        }
      ]
    },
    {
      "id": "if4wcw3",
      "text": "[removed]",
      "timestamp": "2022-07-06 22:58:08",
      "score": -5,
      "num_children": 1,
      "replies": [
        {
          "id": "if4y8f9",
          "text": "Was the church a focus to build community before or after black people were treated as second class citizens? Just trying to figure out when this decline started.",
          "timestamp": "2022-07-06 23:11:56",
          "score": 4,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "if50ujf",
              "text": "[removed]",
              "timestamp": "2022-07-06 23:31:24",
              "score": -1,
              "num_children": 1,
              "replies": [
                {
                  "id": "if50y5g",
                  "text": "That's not an answer.",
                  "timestamp": "2022-07-06 23:32:09",
                  "score": 3,
                  "num_children": 0,
                  "author": 286151,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "if5ltmg",
      "text": "End of the day, Jesus was for hope, courage, and love. Think about how much times has changed since he was alive. Do you think he would adapt to the ways of modern-day culture?",
      "timestamp": "2022-07-07 02:09:44",
      "score": -1,
      "num_children": 0,
      "author": 271473,
      "replies": []
    },
    {
      "id": "if7lkwy",
      "text": "[removed]",
      "timestamp": "2022-07-07 14:27:31",
      "score": 0,
      "num_children": 1,
      "replies": [
        {
          "id": "if8em76",
          "text": "I mean, we could also improve childcare for everybody but republicans will just call that insane...",
          "timestamp": "2022-07-07 17:38:12",
          "score": 1,
          "num_children": 1,
          "author": 105119,
          "replies": [
            {
              "id": "if8q27g",
              "text": "I agree with this 100%.",
              "timestamp": "2022-07-07 18:51:07",
              "score": 1,
              "num_children": 0,
              "author": 289831,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}