{
  "id": "vv3j6s",
  "text": "Just a friendly reminder that Republicans are Nazis\n",
  "timestamp": "2022-07-09 15:00:24",
  "score": 6416,
  "subreddit": "t5_3fdcn",
  "num_children": 70,
  "author": 227730,
  "replies": [
    {
      "id": "ifhb3p2",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-07-09 15:00:24",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "ifhn0wh",
      "text": "Well we also teach both sides of the Holocaust here.\n\nOn the one side there are Nazis and their collaborators. On the other side there are 17 million victims all over Europe.\n\nI just have a feeling Ohio means something totally different.",
      "timestamp": "2022-07-09 16:26:47",
      "score": 570,
      "num_children": 4,
      "author": 59716,
      "replies": [
        {
          "id": "ifhpqh6",
          "text": "I have a feeling that it will be less \"Nazi's are horribly complex and inherently interesting genocidal facist monsters\" and more \"Listen guys, the people who gassed jews, gays, romas and the disabled were not that bad\"",
          "timestamp": "2022-07-09 16:46:06",
          "score": 278,
          "num_children": 4,
          "author": 33914,
          "replies": [
            {
              "id": "ifigv3j",
              "text": "They definitely intend the latter, but they'll end up providing resources for an even more nuanced understanding of the rise of fascism and what led to the Holocaust. They're expecting teachers to teach a \"history is written by the victors, so if course the losers look bad\" stance, and some teachers definitely will. They'll also allow for real history teachers to teach the history of the Holocaust and then (before being forced to move on to other topics leaving the Holocaust as a vague horror committed in the pursuit of evil) teach the lies and propaganda that convinced the public to condone or participate in the Holocaust.\n\nIf I was a history teacher in Ohio I'd be thinking about how being forced to teach Nazi ideology doesn't mean having to teach their premises as being true. Have to teach the class about the \"stab in the back\" myth? Teach the full history that exposes the lie the myth is based on.",
              "timestamp": "2022-07-09 20:07:20",
              "score": 102,
              "num_children": 1,
              "author": 114743,
              "replies": [
                {
                  "id": "ifikylr",
                  "text": "What is the stab in the back myth?",
                  "timestamp": "2022-07-09 20:38:03",
                  "score": 27,
                  "num_children": 2,
                  "author": 90047,
                  "replies": [
                    {
                      "id": "ifim03d",
                      "text": "A myth perpetrated by Nazis and other right wing Germans after WW1 arguing that the reason the German Empire lost is because the Jewish People betrayed them and sold them out",
                      "timestamp": "2022-07-09 20:45:48",
                      "score": 55,
                      "num_children": 0,
                      "author": 265994,
                      "replies": []
                    },
                    {
                      "id": "ifimi27",
                      "text": "Jewish 'deep state' actors subverting the 'TRUE government' in a deeply self serving betrayal.\n\nJust like modern day Soros and globalists conspiracies.\n\nhttps://www.annefrank.org/en/timeline/193/the-stab-in-the-back-legend/",
                      "timestamp": "2022-07-09 20:49:35",
                      "score": 57,
                      "num_children": 1,
                      "author": 114743,
                      "replies": [
                        {
                          "id": "ifirroh",
                          "text": "[deleted]",
                          "timestamp": "2022-07-09 21:29:13",
                          "score": -38,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ifiwf7d",
                              "text": "Uh, what? Bruh, I'm drawing the comparison between Infowars propaganda and Nazi propaganda.",
                              "timestamp": "2022-07-09 22:05:08",
                              "score": 35,
                              "num_children": 0,
                              "author": 114743,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ifj6n54",
              "text": "More like “Listen guys, gassing Jews, gays, romas and the disabled isn’t that bad”",
              "timestamp": "2022-07-09 23:25:04",
              "score": 12,
              "num_children": 0,
              "author": 367676,
              "replies": []
            },
            {
              "id": "ifkugfw",
              "text": "Worse it will be \"here's why the Jews, Roma, disabled, etc deserved to be gassed\"",
              "timestamp": "2022-07-10 09:45:22",
              "score": 3,
              "num_children": 0,
              "author": 124676,
              "replies": []
            },
            {
              "id": "ifiq016",
              "text": "> \"Listen guys, the people who gassed jews, gays, romas and the disabled were not that bad\"\n\nYou should read about the Stanford prison experiment. The only difference between Nazis and me might be circumstances - which is nuts.",
              "timestamp": "2022-07-09 21:15:52",
              "score": -26,
              "num_children": 2,
              "author": 172472,
              "replies": [
                {
                  "id": "ifitg4p",
                  "text": "Perhaps you should read about the criticism that experiment got. \n\nThere were plenty of Germans who didn't choose to be a Nazi, and then there were people who signed up for the Einsatzgruppen or become camp guards and who did unspeakable things. I really hope you think more highly of yourself rather than thinking it might be only circumstances which makes you different from a Nazi.",
                  "timestamp": "2022-07-09 21:42:05",
                  "score": 29,
                  "num_children": 1,
                  "author": 59716,
                  "replies": [
                    {
                      "id": "ifiwkgs",
                      "text": "> I really hope you think more highly of yourself rather than thinking it might be only circumstances which makes you different from a Nazi.\n\nNot really. If the majority of a population supported something I assume that I would have too, if I had had the same development and experiences as they had had.",
                      "timestamp": "2022-07-09 22:06:16",
                      "score": -19,
                      "num_children": 1,
                      "author": 172472,
                      "replies": [
                        {
                          "id": "ifj9nyg",
                          "text": "On the one hand, a major part of the German population supported Hitler and were a-okay with the Nuremberg laws and shit. I see where you're coming from if you're thinking about it in terms like that. \n\nHowever, consider that on the other hand, Hitler never gained a majority of the votes, not even in the elections of January 1933; there *was* some German resistance; and at its height towards the end of the war, only about 10% of the German population had actually become members of the Nazi party. While the Wehrmacht participated in the Holocaust too, becoming SS, camp guards, or part of the Einsatzgruppen, was by and large voluntary.\n\nThere is a major difference between \"a majority of the population supported Hitler to varying extents\" and \"being an active member of groups who perpetrated the Holocaust\".",
                          "timestamp": "2022-07-09 23:49:34",
                          "score": 11,
                          "num_children": 1,
                          "author": 59716,
                          "replies": [
                            {
                              "id": "ifjgryb",
                              "text": "Good points. I think to some extent it's a double standard though - many wouldn't differentiate between being Republican vs alt right, or democrat vs communist. Hell... the title of this post is that Republicans are literally Nazis.\n\nI think we're kidding ourselves if we think we would be unambiguously good regardless of circumstance and life experiences. To each his own opinion though.",
                              "timestamp": "2022-07-10 00:48:39",
                              "score": -2,
                              "num_children": 0,
                              "author": 172472,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ifirfli",
                  "text": "Also Milgram's experiment.\n\nTerrifying things.",
                  "timestamp": "2022-07-09 21:26:39",
                  "score": -3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ifio8k3",
          "text": "Maybe they mean this as the other side of the Holocaust: \"The Germans slaughtered 17 million men, women and children because they didn't like 'em. Get over it.\" Something like that, do ya think, for Ohio, where the pregnant 10-year-old rape victim was denied an abortion?",
          "timestamp": "2022-07-09 21:02:36",
          "score": 15,
          "num_children": 0,
          "author": 361712,
          "replies": []
        },
        {
          "id": "ifisler",
          "text": "In a perfect world, we’d teach about how normal Germans excused and even participated in their increasingly totalitarian, warmongering, genocidal government, using the lessons of the past to see how average people can look at an obvious moral wrong - such as unprecedented violence against “the others” - and make excuses for it. \n\nWe could teach about how millions of Germans, who considered themselves good, honest, hardworking folk, actively supported Hitler’s fascism because they believed the propaganda about how he was going to restore Germany’s economy and national pride on a world stage. \n\nWe could teach books like *They Thought They Were Free*, books that examine how hard it is to stand for what is morally right in the face of injustice, and books that tell the stories of men like Oskar Schindler who were able to defy the government and save lives when all their neighbors were happy to lick the government’s collective jackboots because the economy is good and hey, at least nothing’s happening to us, so who can really care too much about the Jews or the Romanis or the disabled or the queer people?\n\nBut we won’t, because that would make people think and maybe *gasp* feel bad, and Heaven knows we can’t have that.",
          "timestamp": "2022-07-09 21:35:35",
          "score": 40,
          "num_children": 2,
          "author": 25101,
          "replies": [
            {
              "id": "ifjrikm",
              "text": "Your second paragraph basically describes the so called \"Freedom Convoy\" people up here in Canada.  Try to explain the them that they are supporting fascists and they going fucking bonkers, but that's exactly what they're doing.",
              "timestamp": "2022-07-10 02:20:21",
              "score": 11,
              "num_children": 0,
              "author": 292980,
              "replies": []
            },
            {
              "id": "iiaa5n0",
              "text": "These fascist Republicans are only about a third of our voting population, even if they are one of two major US political parties. With that being said: it only took 33% of the vote for Hitler and the Nazis to take power.\n\nIf that doesn’t motivate people to vote, then I don’t know what will.",
              "timestamp": "2022-07-30 18:19:23",
              "score": 1,
              "num_children": 0,
              "author": 404110,
              "replies": []
            }
          ]
        },
        {
          "id": "ifizoi4",
          "text": "The whole \"there were good people on both sides\" argument.",
          "timestamp": "2022-07-09 22:30:21",
          "score": 10,
          "num_children": 0,
          "author": 72456,
          "replies": []
        }
      ]
    },
    {
      "id": "ifhs1as",
      "text": "I’ll never not remember how April 2020 with Trump and Covid, I instantly understood the parallels between him, his office, and his party to the Nazi’s, and having people indignantly bitch at me on here about how I’m ridiculous for drawing that conclusion.\n\nSigh",
      "timestamp": "2022-07-09 17:02:33",
      "score": 128,
      "num_children": 3,
      "author": 154180,
      "replies": [
        {
          "id": "ifhzhx9",
          "text": "Their ardent followers still bitch about the comparison.",
          "timestamp": "2022-07-09 17:57:07",
          "score": 42,
          "num_children": 1,
          "author": 49005,
          "replies": [
            {
              "id": "ifi96t1",
              "text": "They call TDS: Trump Derangement Syndrome.\n\nIt’s not that Trump keeps blatantly grabbing at power, it’s all these antifas that can’t keep trump off their mind! They’re deranged because they can’t go a second without bringing him up (translation: they keep calling out his shit and it makes me upset, so I’m just gonna say they’re deranged).",
              "timestamp": "2022-07-09 19:09:16",
              "score": 36,
              "num_children": 2,
              "author": 366582,
              "replies": [
                {
                  "id": "ifigyw9",
                  "text": "Remember when people said Trump was going to claim the election was illegitimate, and then he did exactly that? I do.\n\nRemember when people said Obama was going to invade Texas and take away everyone's guns and never leave the Oval Office, and then he did exactly that? I don't.\n\nTDS is the American right projecting like they always do.",
                  "timestamp": "2022-07-09 20:08:09",
                  "score": 38,
                  "num_children": 1,
                  "author": 10785,
                  "replies": [
                    {
                      "id": "ifin2by",
                      "text": "TDS has always been a dog whistle for the left, funny thing is they devote whole subs/sites/apps, they plaster his face on flags, hang giant posters or tapestries, post his head on Rambo or Rocky, constant go about him not losing the election, but yeah the left definitely has a TDS problem. (I know it's what you said essentially, just going into more details)",
                      "timestamp": "2022-07-09 20:53:49",
                      "score": 14,
                      "num_children": 1,
                      "author": 59804,
                      "replies": [
                        {
                          "id": "ifjs9i3",
                          "text": "I've seen the fat pig's head on a Rocky photo. It's cringe.",
                          "timestamp": "2022-07-10 02:26:48",
                          "score": 6,
                          "num_children": 1,
                          "author": 49005,
                          "replies": [
                            {
                              "id": "ifjzokf",
                              "text": "Yeah, it's pretty bad.",
                              "timestamp": "2022-07-10 03:32:05",
                              "score": 3,
                              "num_children": 0,
                              "author": 59804,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ifk499r",
                  "text": "And then you go through their own post histories and they are constantly bringing up Obama and Hillary, as if those two are anywhere near relevant anymore, lol.",
                  "timestamp": "2022-07-10 04:15:13",
                  "score": 6,
                  "num_children": 0,
                  "author": 232407,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ifjlgca",
          "text": "To anybody who still thinks the nazi comparison is hyperbolic, we are really not that far away from camps. This exact slide into fascism has happened plenty of times in human history, and its happened in places with stronger institutions than modern day America. Democracy is not the natural order. Its not an inherently strong and resilient system. The faith people have in taking the high road and hoping things work out is incredibly naive.\n\n&#x200B;\n\nThe moment democrats are no longer able to win elections is the exact moment its too late. If the modern day GOP is allowed solid and unbroken rule we will very quickly become a full fascist state.",
          "timestamp": "2022-07-10 01:28:27",
          "score": 16,
          "num_children": 3,
          "replies": [
            {
              "id": "ifjmr12",
              "text": "The scariest part for me, as selfish as this is, is realizing that “how could the Germans just *let* the Nazi’s take over?” Is now quite literally what most of America is doing too.\n\nCapitalism rules, and the Christian Army is the most violent mercenary group capitalism can buy.",
              "timestamp": "2022-07-10 01:39:32",
              "score": 13,
              "num_children": 0,
              "author": 154180,
              "replies": []
            },
            {
              "id": "ifk4gnz",
              "text": "> we are really not that far away from camps\n\nThe camps already exist. They're just full of immigrants... for now.\n\nAlso, isn't it funny how you only see one skin color in all those photos and videos of those concentration camps? Even when it is ICE or conservative media releasing those images, it's only one specific skin color.",
              "timestamp": "2022-07-10 04:17:18",
              "score": 8,
              "num_children": 0,
              "author": 232407,
              "replies": []
            },
            {
              "id": "ifjxqpu",
              "text": "Saw someone make the aside that no constitution on Earth could be crafted strong enough to withstand half of its nation's political body actively attempting to subvert it. As we have seen no mass arrests of the Republican governmental body(justified because most Republicans are complicit in sedition) and the party's embrace of an attempted overthrow, they will take power again and shut others out. I struggle to think of a way how we go back to business as usual.",
              "timestamp": "2022-07-10 03:14:32",
              "score": 5,
              "num_children": 0,
              "author": 52414,
              "replies": []
            }
          ]
        },
        {
          "id": "ifjwmgs",
          "text": "Yup. He even named his attempt to steal the election after Mein Kampf. \n\nDemocrats accused him of using Hitler's Big Lie technique when he lied about the election, it also is a pretty strong fit for how Trump calls anything negative towards him \"fake news.\" \n\nThen this happened. \n\n\"AP News: Whose ‘Big Lie’? Trump’s proclamation a new GOP litmus test\"\n\n\"There is no evidence to support Trump’s allegations of mass voter fraud, and numerous audits, Republican state election officials and Trump’s own attorney general have said the election was fair.\n\nBut Trump has stuck to his story and issued a “proclamation” Monday attempting to co-opt the language his foes use to brand his falsehoods.\n\n“The Fraudulent Presidential Election of 2020 will be, from this day forth, known as THE BIG LIE!” he wrote.\n\nCheney, who has not ruled out a 2024 run herself, fired back.\n“The 2020 presidential election was not stolen. Anyone who claims it was is spreading THE BIG LIE, turning their back on the rule of law, and poisoning our democratic system,” she tweeted.\nClearly she has no intention of scaling back her criticism, even as she faces the possibility of losing her leadership post.\"\n\nHitler had claimed that Jews were telling a \"Big Lie\" that nationalist general Erich Ludendorff was to blame for Germany's loss in WWI. \n\nHistorian Timothy Snyder observed: \n\n\"The lie is so big that it reorders the world. And so part of telling the big lie is that you immediately say it's the other side that tells the big lie. Sadly, but it's just a matter of record, all of that is in Mein Kampf.\"\n\nAnd lastly,\n\n\"All this was inspired by the principle – which is quite true within itself – that in the big lie there is always a certain force of credibility; because the broad masses of a nation are always more easily corrupted in the deeper strata of their emotional nature than consciously or voluntarily; and thus in the primitive simplicity of their minds they more readily fall victims to the big lie than the small lie, since they themselves often tell small lies in little matters but would be ashamed to resort to large-scale falsehoods.\n\nIt would never come into their heads to fabricate colossal untruths, and they would not believe others could have the impudence to distort the truth so infamously. Even though the facts which prove this to be so may be brought clearly to their minds, they will still doubt and waver and will continue to think there may be some other explanation. For the grossly impudent lie always leaves traces behind it, even after it has been nailed down, a fact which is known to all expert liars in this world and to all who conspire together in the art of lying.\"\n\n— Adolf Hitler, Mein Kampf, vol. I, ch. X",
          "timestamp": "2022-07-10 03:04:40",
          "score": 7,
          "num_children": 1,
          "author": 52414,
          "replies": [
            {
              "id": "ifk0hl5",
              "text": "Really gives new meaning to “it’s so crazy, it just might work”",
              "timestamp": "2022-07-10 03:39:28",
              "score": 1,
              "num_children": 0,
              "author": 154180,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ifhjkyi",
      "text": "The problem with identifying nazis as nazis (or fascists as fascists) is that it only works when there aren't enough of them. Once there's enough and they have some power they can't be shamed by calling them what they are.",
      "timestamp": "2022-07-09 16:01:47",
      "score": 224,
      "num_children": 2,
      "author": 266273,
      "replies": [
        {
          "id": "ifirk6k",
          "text": "[The Nazi Card](https://www.youtube.com/watch?v=zvgZtdmyKlI) (Turn on subs if you need to)",
          "timestamp": "2022-07-09 21:27:37",
          "score": 14,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ifhqb5l",
          "text": "Or even worse, they'll just make the callout meaningless by labeling everyone they don't like, a Nazi.",
          "timestamp": "2022-07-09 16:50:12",
          "score": 74,
          "num_children": 1,
          "author": 393467,
          "replies": [
            {
              "id": "ifj3kps",
              "text": "Gosh, yeah, what complete fucking idiots, what kind of dumb pricks who have never been burdened by an original thought would ever do that.",
              "timestamp": "2022-07-09 23:00:34",
              "score": 5,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ifhi1rs",
      "text": "anyone got the sauce?",
      "timestamp": "2022-07-09 15:50:39",
      "score": 56,
      "num_children": 2,
      "author": 410352,
      "replies": [
        {
          "id": "ifhilu7",
          "text": "The bill itself: https://www.legislature.ohio.gov/legislation/legislation-summary?id=GA134-HB-327",
          "timestamp": "2022-07-09 15:54:43",
          "score": 76,
          "num_children": 6,
          "author": 410122,
          "replies": [
            {
              "id": "ifilnex",
              "text": "That bill is worse than that tweet says.\n\nThe bill says no \"divisive topics\" can even be taught. When you see what \"divisive topics\" are defined as, you can see that teachers will no longer be able to teach about any genocide, racism, sexism, or other similar things regardless of context unless they want to do so without having the students be graded on it.\n\nWant to teach about the Civil Rights Movement? Great. Want to have your students write a graded essay on how Jim Crow laws were racist and how the Brown v. Board decision began the reversal of those racist laws? Nope. Want to talk about how the Holocaust was the targeted extermination of specific people groups based upon their identities? Great. Want to have a multiple choice question on a test asking which historical event led to the death of six million Jews during World War II? Nope.",
              "timestamp": "2022-07-09 20:43:10",
              "score": 64,
              "num_children": 2,
              "author": 10785,
              "replies": [
                {
                  "id": "ifin3yq",
                  "text": "And it applies to all levels of education and includes any educational organization that receives state funding.\n\nFucking Nazis writing laws to protect themselves from being called Nazis.",
                  "timestamp": "2022-07-09 20:54:09",
                  "score": 37,
                  "num_children": 0,
                  "author": 10785,
                  "replies": []
                },
                {
                  "id": "ifj1uhz",
                  "text": "Math is a pretty divisive topic in certain circles.",
                  "timestamp": "2022-07-09 22:47:07",
                  "score": 12,
                  "num_children": 2,
                  "author": 174325,
                  "replies": [
                    {
                      "id": "ifj2q3a",
                      "text": "Well, math involves critical thinking skills, and those are anathema to a sizable chunk of the population.",
                      "timestamp": "2022-07-09 22:53:55",
                      "score": 6,
                      "num_children": 0,
                      "author": 10785,
                      "replies": []
                    },
                    {
                      "id": "ifk5305",
                      "text": "I would appreciate it if you would refrain from referring to my grandparents' daughter Sally.",
                      "timestamp": "2022-07-10 04:23:12",
                      "score": 1,
                      "num_children": 0,
                      "author": 141730,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ifigqah",
              "text": "So it’s aiming at not teaching the racist history of the united states or it’s current systemic racism, got it c",
              "timestamp": "2022-07-09 20:06:19",
              "score": 29,
              "num_children": 0,
              "author": 260510,
              "replies": []
            },
            {
              "id": "ifiu2b9",
              "text": "Wait, so would (1)(a) mean no saying the USA isn't the greatest country or Americans are better than others?",
              "timestamp": "2022-07-09 21:46:44",
              "score": 6,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ifii3fa",
              "text": "I have never seen two more Ohio-looking women than those two sponsoring that Bill.",
              "timestamp": "2022-07-09 20:16:39",
              "score": 7,
              "num_children": 0,
              "author": 241651,
              "replies": []
            },
            {
              "id": "ifiivgj",
              "text": "Can someone point out the specific part in question? Im having a hard time finding the parts that’s particularly advocating that point",
              "timestamp": "2022-07-09 20:22:23",
              "score": 5,
              "num_children": 1,
              "author": 348120,
              "replies": [
                {
                  "id": "ifkhijn",
                  "text": "The tweet OP posted is deliberately going for the worst possible consequence, but this is the idea:\n\n- The bill forbids \"teaching, instructing, or training\" divisive concepts, but doesn't clearly distinguish between teaching _about_ a concept and teaching that a concept is _correct_. If \"teaching\" includes \"teaching about\" -- like when you say \"I teach American History\" -- then discussion of these topics is forbidden.\n\n\n- The first divisive concept is that \"one nationality [etc.] is inherently superior to another nationality [etc.]\" It would be nearly impossible to discuss the Holocaust without discussing its key justification -- that Aryans are inherently superior to other races -- which is a divisive concept.\n\n\n- The bill tries to get around this by explicitly permitting \"impartial discussion of controversial aspects of history\" and \"impartial discussion on ... historical oppression.\"\n\n\n- The phrase \"impartial discussion\" is what the OP tweet is getting at. \"Impartial discussion\" usually means teaching \"both sides.\" It would be immoral to have an \"impartial discussion\" of the Holocaust or really any historical tragedy motivated by racism, because empathy forces us to be partial.\n\n\nThat said, this all relies on a really uncharitable reading of the bill. I don't think it will actually be used to prevent teaching that genocide is bad. However, it definitely _will_ be used to prevent people from teaching about structural racism, because the existence of structural racism, at least on a national level, is explicitly listed as a divisive concept. That's not as bad as \"both sides-ing the Holocaust,\" but it is still a disservice to students. Students deserve to know about our nation's lasting problems so that they're better equipped to fix them.",
                  "timestamp": "2022-07-10 06:45:38",
                  "score": 6,
                  "num_children": 0,
                  "author": 293450,
                  "replies": []
                }
              ]
            },
            {
              "id": "ifhvegp",
              "text": "I wonder how many people in this thread actually skimmed the bill.",
              "timestamp": "2022-07-09 17:26:50",
              "score": -31,
              "num_children": 2,
              "author": 30039,
              "replies": [
                {
                  "id": "ifhy2uh",
                  "text": "It’s the bog standard “tHe uNiTeD StAtes IsnT inHeRenTLY rAcISt” bullshit\n\nI think the sketchy part is “impartial discussion of controversial parts of history”… although it does follow it up with “impartial discussion of oppression” which… doesn’t sound like a thing that that could exist… the word fundamentally imparts blame on one side.",
                  "timestamp": "2022-07-09 17:46:34",
                  "score": 28,
                  "num_children": 0,
                  "author": 110650,
                  "replies": []
                },
                {
                  "id": "ifi73hk",
                  "text": "could not matter less",
                  "timestamp": "2022-07-09 18:53:44",
                  "score": 6,
                  "num_children": 0,
                  "author": 109802,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ifhios3",
          "text": "Details about the bill: https://ohiohouse.gov/members/brigid-kelly/news/ohio-republican-lawmaker-wants-to-require-teaching-german-soldiers-holocaust-perspective-in-classroom-censorship-bill-109363",
          "timestamp": "2022-07-09 15:55:18",
          "score": 69,
          "num_children": 2,
          "author": 410122,
          "replies": [
            {
              "id": "ifhyh6l",
              "text": "Fucking yikes...",
              "timestamp": "2022-07-09 17:49:31",
              "score": 21,
              "num_children": 2,
              "author": 10221,
              "replies": [
                {
                  "id": "ifieatb",
                  "text": "\"You know, the German SS were victims too. They were roped into genocide, you know? How do you think that made them feel?\"",
                  "timestamp": "2022-07-09 19:47:45",
                  "score": 16,
                  "num_children": 0,
                  "author": 10785,
                  "replies": []
                },
                {
                  "id": "ifl1qdq",
                  "text": "Fucking yikes indeed!  I can't believe what I'm seeing in America these days.  Less than a decade ago, entertaining this scenario as happening in real life would have seemed utterly ridiculous",
                  "timestamp": "2022-07-10 11:25:15",
                  "score": 2,
                  "num_children": 0,
                  "author": 181290,
                  "replies": []
                }
              ]
            },
            {
              "id": "ifj2s0f",
              "text": "Well it looks you guys killed the site, anyone who remembers cares to give an overview.",
              "timestamp": "2022-07-09 22:54:19",
              "score": 4,
              "num_children": 0,
              "author": 333191,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ifhtkh7",
      "text": "Obviously I believe that teaching the Holocaust from the perspective from Germany could be helpful and showing how the Nazis were able to gain power and further show just how terrible these atrocities we're, but obviously that would make sense, and Ohio's trying to push a fucking Nazi agenda so I'm sure it'll be a fucking circle jerk of Nazis grooming kids",
      "timestamp": "2022-07-09 17:13:34",
      "score": 47,
      "num_children": 2,
      "author": 20342,
      "replies": [
        {
          "id": "ifi7833",
          "text": "\"well of course they wanted to kill the Jews, have you seen their hats?\"\n\nTop work there, Ohio",
          "timestamp": "2022-07-09 18:54:42",
          "score": 10,
          "num_children": 0,
          "author": 217910,
          "replies": []
        },
        {
          "id": "ifjs2xb",
          "text": "If only our schools would teach how the Nazi's gained power, because no one seems to understand that we are currently on the edge of having history repeat itself and embrace fascism, in more than one country.",
          "timestamp": "2022-07-10 02:25:13",
          "score": 7,
          "num_children": 1,
          "author": 292980,
          "replies": [
            {
              "id": "ifjxl0w",
              "text": "Yup, it really should be taught more.  I really didn't taught anything about it in school.  Had to learn it myself in college",
              "timestamp": "2022-07-10 03:13:07",
              "score": 2,
              "num_children": 0,
              "author": 20342,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ifhxfdn",
      "text": "If this meant reading documents that outline the Nazi perspective as a way to add context to how Nazis defended and justified their atrocities, that’d be fine.\n\nKnowing Ohio republicans, that’s probably not the case",
      "timestamp": "2022-07-09 17:41:42",
      "score": 39,
      "num_children": 1,
      "author": 350285,
      "replies": [
        {
          "id": "ifk17gi",
          "text": "Did you not read The White Rose in high school?  that book makes it explicitly clear what standing against the Nazis meant and why so many people didn't.  Not all Nazis were inherently bad people, let alone genocidal maniacs, and that's REALLY important historical context to understand.  Most were normal people who were either justifiably too scared to resist or too entrenched in the extremism to care.  Recognizing the fact that these were largely normal people committing unspeakable violence is necessary to appreciate the parallels to the current political environment",
          "timestamp": "2022-07-10 03:46:07",
          "score": 7,
          "num_children": 0,
          "author": 277510,
          "replies": []
        }
      ]
    },
    {
      "id": "ifhjgvh",
      "text": "Sure let’s start with the native Americans, how they were slaughtered by whites. We can throw in all the bullshit the cia has done in South America to destabilize governments. I’d love to see more stories from their point of view of just how f’d up our gov is. Nah they just want a way to make fascism cool",
      "timestamp": "2022-07-09 16:00:58",
      "score": 185,
      "num_children": 1,
      "author": 179709,
      "replies": [
        {
          "id": "ifi6v0c",
          "text": "a fine example of whataboutism in the wild",
          "timestamp": "2022-07-09 18:51:56",
          "score": -82,
          "num_children": 2,
          "author": 217910,
          "replies": [
            {
              "id": "ifiam3e",
              "text": "That’s an idiotic response. Take a deep breath and fire up that one working neuron and try again",
              "timestamp": "2022-07-09 19:19:58",
              "score": 37,
              "num_children": 0,
              "author": 179709,
              "replies": []
            },
            {
              "id": "ifier18",
              "text": "😂 what a hot take lmao",
              "timestamp": "2022-07-09 19:51:10",
              "score": 17,
              "num_children": 1,
              "author": 176687,
              "replies": [
                {
                  "id": "ifiovkt",
                  "text": "What a brilliant retort",
                  "timestamp": "2022-07-09 21:07:22",
                  "score": -24,
                  "num_children": 0,
                  "author": 217910,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ifhwc5q",
      "text": "Ooh ooh Tennessee is trying to make it legal for businesses to put up signs refusing service to jews. Literal nazis. I can't believe it but at the same time I'm not surprised.",
      "timestamp": "2022-07-09 17:33:40",
      "score": 19,
      "num_children": 1,
      "author": 365196,
      "replies": [
        {
          "id": "ifjt07q",
          "text": "As a Jew im never surprised by the endless antisemitism from politicians. Many politicians would likley want to see a second holocaust.",
          "timestamp": "2022-07-10 02:33:17",
          "score": 6,
          "num_children": 0,
          "author": 368970,
          "replies": []
        }
      ]
    },
    {
      "id": "ifhywxz",
      "text": "someone please explain to me what is going on\n\nwhat has happened to this country\n\nhow are so many insane people able to get elected/reelected",
      "timestamp": "2022-07-09 17:52:45",
      "score": 19,
      "num_children": 2,
      "author": 292939,
      "replies": [
        {
          "id": "ifj875r",
          "text": "Extremely effective fear-based propaganda and intense gerrymandering perpetuated by inundating politics with money\n\nThe actual answer is nuanced enough that plenty of academics spend their entire lives studying it, but those are the highlights",
          "timestamp": "2022-07-09 23:37:39",
          "score": 7,
          "num_children": 0,
          "author": 200225,
          "replies": []
        },
        {
          "id": "ifjt8il",
          "text": "The culture of \"patriotism\" has lead to people wanting to put an insane amount of power in the state. At this point people no longer care how outrageous as long as its \"on their side\".",
          "timestamp": "2022-07-10 02:35:17",
          "score": 1,
          "num_children": 0,
          "author": 368970,
          "replies": []
        }
      ]
    },
    {
      "id": "ifi2vo1",
      "text": "\"Let's look at the death of your mother from the drunk driver's perspective.\"",
      "timestamp": "2022-07-09 18:22:15",
      "score": 17,
      "num_children": 0,
      "author": 104777,
      "replies": []
    },
    {
      "id": "ifidqmc",
      "text": "The primary sponsors are Diane V. Grendell (District 76) and Sarah Fowler Arthur (District 99). In case you were curious, here is a list of that bill’s (HB 327’s) cosponsors:\n\nREPRESENTATIVES\n\nCindy Abrams\n\nThomas E. Brinkman Jr.\n\nJamie Callender\n\nSara P. Carruthers\n\nGary Click\n\nRodney Creech\n\nJon Cross\n\nAl Cutrona\n\nBill Dean\n\nJay Edwards\n\nRon Ferguson\n\nTimothy E. Ginter\n\nJennifer Gross\n\nAdam Holmes\n\nMarilyn S. John\n\nMark Johnson\n\nKris Jordan\n\nDarrell Kick\n\nMike Loychik\n\nRiordan T. McClain\n\nDerek Merrin\n\nPhil Plummer\n\nJena Powell\n\nTracy M. Richardson\n\nCraig S. Riedel\n\nJean Schmidt\n\nDick Stein\n\nJason Stephens\n\nReggie Stoltzfus\n\nA. Nino Vitale\n\nScott Wiggam\n\nBob Young\n\nTom Young\n\nPaul Zeltwanger",
      "timestamp": "2022-07-09 19:43:27",
      "score": 13,
      "num_children": 2,
      "author": 341755,
      "replies": [
        {
          "id": "ifinf1g",
          "text": "That is a disappointingly long list. JFC, America. What the fuck happened to you? That's rhetorical. We're proudly poorly educated and thus flamboyantly ignorant. I never thought I'd see this in my lifetime. I carry my paps draft card from ww2. He died in the 90s and I'm glad he didn't have to see his efforts dissolve in a growing vat of stupidity. \nFuck the gop.",
          "timestamp": "2022-07-09 20:56:27",
          "score": 5,
          "num_children": 0,
          "author": 10012,
          "replies": []
        },
        {
          "id": "ifjhqe4",
          "text": "@jasoncstephens representing the 93 district in southern ohio counties of Lawrence, Galia and Scioto",
          "timestamp": "2022-07-10 00:56:39",
          "score": 1,
          "num_children": 0,
          "author": 352316,
          "replies": []
        }
      ]
    },
    {
      "id": "ifi17v7",
      "text": "Wym both sides?? There aren’t sides to this. The nazis killed a bunch of people, mostly jews, and then lost the war. This isn’t about sides, it’s about historical facts.",
      "timestamp": "2022-07-09 18:09:58",
      "score": 11,
      "num_children": 0,
      "author": 288398,
      "replies": []
    },
    {
      "id": "ifhp6os",
      "text": "Not even hiding their love and admiration for Nazis. How can these losers call themselves Americans?",
      "timestamp": "2022-07-09 16:42:10",
      "score": 31,
      "num_children": 2,
      "author": 54010,
      "replies": [
        {
          "id": "ifhqrno",
          "text": "The nazis took a lot of inspiration from the US",
          "timestamp": "2022-07-09 16:53:30",
          "score": 18,
          "num_children": 1,
          "author": 409309,
          "replies": [
            {
              "id": "ifizrtx",
              "text": "The US took a lot of nazis from Germany",
              "timestamp": "2022-07-09 22:31:03",
              "score": 2,
              "num_children": 1,
              "author": 386742,
              "replies": [
                {
                  "id": "ifj5i7w",
                  "text": "The Nazis took a lot of Americans to the moon.",
                  "timestamp": "2022-07-09 23:15:59",
                  "score": 2,
                  "num_children": 1,
                  "author": 103864,
                  "replies": [
                    {
                      "id": "ifjx0kj",
                      "text": "No, that would be Goddard, not Braun, that got the US to the moon.",
                      "timestamp": "2022-07-10 03:08:05",
                      "score": 2,
                      "num_children": 0,
                      "author": 895,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ih766fk",
          "text": "Easy. They want to turn America Into the 4th reich.",
          "timestamp": "2022-07-22 15:16:50",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ifhvr4u",
      "text": "That’s the side with the guns",
      "timestamp": "2022-07-09 17:29:25",
      "score": 9,
      "num_children": 1,
      "replies": [
        {
          "id": "ifj2gs6",
          "text": "If you go far enough left, you get your guns back",
          "timestamp": "2022-07-09 22:51:52",
          "score": 5,
          "num_children": 1,
          "author": 153342,
          "replies": [
            {
              "id": "ifjtpgg",
              "text": "[Karl Marx supported full gun rights for all citizens.](https://www.goodreads.com/quotes/7601546-under-no-pretext-should-arms-and-ammunition-be-surrendered-any) This is because he knew guns were valuable to the average worker. The rich can afford private security and live in areas with well funded police.",
              "timestamp": "2022-07-10 02:39:17",
              "score": 1,
              "num_children": 0,
              "author": 368970,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ifikjdw",
      "text": "To a normal person, teaching both sides would mean a more complete dive into motives. But to a smart person, we know it means they just want to say it was okay like they want to say segregation and slavery was okay.",
      "timestamp": "2022-07-09 20:34:53",
      "score": 8,
      "num_children": 0,
      "author": 317126,
      "replies": []
    },
    {
      "id": "ifhx60h",
      "text": "Boy, that kinda bill is sure going to liven up class in religious schools.  Wonder if they'll get Satanic Temple guest lecturerers.",
      "timestamp": "2022-07-09 17:39:49",
      "score": 7,
      "num_children": 0,
      "author": 213728,
      "replies": []
    },
    {
      "id": "ifhwehu",
      "text": "Ooh ooh Tennessee is trying to make it legal for businesses to put up signs refusing service to jews. Literal nazis. I can't believe it but at the same time I'm not surprised.",
      "timestamp": "2022-07-09 17:34:09",
      "score": 6,
      "num_children": 0,
      "author": 365196,
      "replies": []
    },
    {
      "id": "ifj1u6x",
      "text": "Side A: The Holocaust happened\n\nSide B: Fake news.\n\nAs someone who grew up in a pretty red area, this is literally all it is. Idk if stormfront was archived, I believe it was taken down but if it still exists to view in some form just go look. It's all there. Neo-Nazis and modern Republicans deny the holocaust happened or at least portend that it wasn't as bad as history says. It's revisionism. Just like those who claim that the movement wasn't founded in Christianity. Or that it was a false flag perpetrated by the Jews, or that the Jews had every chance to leave before it began. The \"other side\" is Nazi apologists and sympathizers. They'll whine that \"well history was written by the victors, the Nazis were not bad at all\" while simultaneously plugging Tucker Carlson's replacement theory. We need to start charging the new ones just like we charged the old ones. Nip those little pussy crybabies in the bud. There was an American Nazi Party at the time, their catchphrase you ask? America First. And the big bad wolf ate up all the Jewish children, ripped them limb from limb, burned them with caustic chemical concoctions, starved, beat, tortured and killed their parents before their very eyes before raping and beating those same children...but that was fine, because it's not OUR kids. Now they want it to be our kids. Read your history people, the brown shorts are here and as cowardly as they are, they will only be put down by equal violence. I have no less than five mother fuckers throw shit at my young children, one old bat who stopped, got out of their car and told them my wife and we're planning to murder them, all because I have a real basic Pro-Roe sign in my yard. I'm buying a gun, the next one who accosts my children, throws shit at them, screams at them, will never do so again. My framing hammer has been enough to chase them off so far, but next time it will be a warning shot, one warning shot. Y'all creepy fucking right wingers coming onto my property trying to do whatever creepy shit to my kids is a step too far. Warn your grandparents because it's all geriatric fucks.",
      "timestamp": "2022-07-09 22:47:03",
      "score": 6,
      "num_children": 0,
      "author": 286798,
      "replies": []
    },
    {
      "id": "ifj2aoi",
      "text": "Member when we said trump would lead to shit like this and everyone said we were over reacting? I member",
      "timestamp": "2022-07-09 22:50:33",
      "score": 6,
      "num_children": 0,
      "author": 153342,
      "replies": []
    },
    {
      "id": "ifi8tck",
      "text": "I wonder, what do both-siders think when they see shit like this?",
      "timestamp": "2022-07-09 19:06:29",
      "score": 4,
      "num_children": 1,
      "author": 86603,
      "replies": [
        {
          "id": "ifj8i8q",
          "text": "I'll give you three guesses",
          "timestamp": "2022-07-09 23:40:07",
          "score": 1,
          "num_children": 0,
          "author": 200225,
          "replies": []
        }
      ]
    },
    {
      "id": "ifiekq1",
      "text": "What the fuck is the \"other side\" of the holocaust?  How can you possibly spin this?  This country is going insane.",
      "timestamp": "2022-07-09 19:49:50",
      "score": 5,
      "num_children": 0,
      "author": 201752,
      "replies": []
    },
    {
      "id": "ifingif",
      "text": "Weird how they try and claim deMonRats aRe tHe reAl nazis, and then go and change school courses to promote the nazi side of things. 🤔🤔🤔",
      "timestamp": "2022-07-09 20:56:46",
      "score": 3,
      "num_children": 0,
      "author": 405152,
      "replies": []
    },
    {
      "id": "ifj2diw",
      "text": "Sweet. Fucking. Jesus.\n\nAmerica? We're done.",
      "timestamp": "2022-07-09 22:51:10",
      "score": 3,
      "num_children": 0,
      "author": 301757,
      "replies": []
    },
    {
      "id": "ifj6ti9",
      "text": "Open war. Those fuckers are pushing for open war.\n\nThanks to Republican scum, America is turning into the biggest shithole on the PLANET.\n\nAnd why the FUCK do I have to read about this on reddit instead of in every major newspaper in the country?",
      "timestamp": "2022-07-09 23:26:30",
      "score": 4,
      "num_children": 0,
      "author": 114177,
      "replies": []
    },
    {
      "id": "ifjk5mg",
      "text": "\"Stop calling us Nazis!\" - Nazis",
      "timestamp": "2022-07-10 01:17:22",
      "score": 5,
      "num_children": 0,
      "author": 377260,
      "replies": []
    },
    {
      "id": "ifi1ml6",
      "text": "Both sides what does that even mean",
      "timestamp": "2022-07-09 18:13:03",
      "score": 3,
      "num_children": 1,
      "author": 316170,
      "replies": [
        {
          "id": "ifia63x",
          "text": "It means they will teach the justification of it from the view if the Germans.. \n\nThat's what it means.",
          "timestamp": "2022-07-09 19:16:39",
          "score": 5,
          "num_children": 1,
          "replies": [
            {
              "id": "ifia9ha",
              "text": "I know. As far as I’m concerned there’s only one side. Nazis = bad. End of story",
              "timestamp": "2022-07-09 19:17:21",
              "score": 3,
              "num_children": 0,
              "author": 316170,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ifiby7s",
      "text": "\"And, the Nazi's side... they were full of hate and an inflated sense of self-importance.  This led to them committing genocide against anybody that they deemed 'lesser'.\"\n\nThat's the other side.",
      "timestamp": "2022-07-09 19:30:00",
      "score": 3,
      "num_children": 0,
      "author": 319340,
      "replies": []
    },
    {
      "id": "ififd61",
      "text": "What a brilliant idea. We'll teach the full actual history of the Nazis and then teach the kids the propaganda and social engineering the Nazis used to convince people to commit those atrocities. That way the kids will have a complete understanding of the history from an outsider's *and* insider's perspective and be able to recognize the same tactics and lies being used today!\n\nThe Ohio GQP just green lit the following assignment:\n\n> Compare & Contrast\n\n> Pizzagate : Blood Libel",
      "timestamp": "2022-07-09 19:55:55",
      "score": 3,
      "num_children": 1,
      "author": 114743,
      "replies": [
        {
          "id": "ifir5cj",
          "text": "Knowing reactionaries that would backfire into \"Wow, the Germans were also fighting the deep state satanic pedophiles? We should learn from them!\"",
          "timestamp": "2022-07-09 21:24:30",
          "score": 2,
          "num_children": 1,
          "author": 208846,
          "replies": [
            {
              "id": "ifiyvgl",
              "text": "Probably, the bill actually seems to prevent teaching the motive behind the actions and allows the superintendent the authority to decide what offends the bill or doesn't. It's still complete trash and will be a major hurdle for people teaching history.",
              "timestamp": "2022-07-09 22:24:00",
              "score": 1,
              "num_children": 0,
              "author": 114743,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ifihvxr",
      "text": "Good people, I assume, on both sides.",
      "timestamp": "2022-07-09 20:15:06",
      "score": 3,
      "num_children": 0,
      "author": 80051,
      "replies": []
    },
    {
      "id": "ifjfpv2",
      "text": "Maybe they'll hire Fred Leuchter to write the curriculum...",
      "timestamp": "2022-07-10 00:39:40",
      "score": 3,
      "num_children": 0,
      "author": 201209,
      "replies": []
    },
    {
      "id": "ifjnfjj",
      "text": "Personally, I think the red party is responsible for JFKs & his brother’s assassination.",
      "timestamp": "2022-07-10 01:45:18",
      "score": 3,
      "num_children": 0,
      "author": 280719,
      "replies": []
    },
    {
      "id": "ifhtrmd",
      "text": "It’s hopeless.",
      "timestamp": "2022-07-09 17:14:59",
      "score": 2,
      "num_children": 0,
      "author": 324676,
      "replies": []
    },
    {
      "id": "ifiznz6",
      "text": "Nazis need to be afraid again.",
      "timestamp": "2022-07-09 22:30:14",
      "score": 2,
      "num_children": 0,
      "author": 16440,
      "replies": []
    },
    {
      "id": "ifje3hw",
      "text": "4chan comes to government, finally.\n\nSo this is *literally* \"Hitler did nothing wrong\" 🙄",
      "timestamp": "2022-07-10 00:26:02",
      "score": 2,
      "num_children": 0,
      "author": 82852,
      "replies": []
    },
    {
      "id": "iflb4a6",
      "text": "Just a friendly reminder that \"voting harder\" will not stop shit like this",
      "timestamp": "2022-07-10 13:06:18",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ifhq7qi",
      "text": "Yea and guess who is gonna work right beside them in the spirit of \"bipartisanship\" and \"working together\"... We all know whats next and everybody is just letting it happen",
      "timestamp": "2022-07-09 16:49:32",
      "score": 4,
      "num_children": 0,
      "author": 286897,
      "replies": []
    },
    {
      "id": "ifi50gf",
      "text": "Wtf does both sides mean?",
      "timestamp": "2022-07-09 18:38:08",
      "score": 1,
      "num_children": 1,
      "author": 340054,
      "replies": [
        {
          "id": "ifivscz",
          "text": "They want to see which kids they can groom into being nazis by teaching them how to be a nazi.",
          "timestamp": "2022-07-09 22:00:12",
          "score": 3,
          "num_children": 0,
          "author": 406559,
          "replies": []
        }
      ]
    },
    {
      "id": "ifi8p9e",
      "text": "So I guess nothing will be said about the Kapos who enforced law at Nazi prison camps and not one ever went to trial like the SS guards did.",
      "timestamp": "2022-07-09 19:05:39",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "ifkzcj6",
          "text": "The Kapos didn't exactly have a choice, though. The SS were people who specifically volunteered.",
          "timestamp": "2022-07-10 10:54:40",
          "score": 1,
          "num_children": 0,
          "author": 367236,
          "replies": []
        }
      ]
    },
    {
      "id": "ifin70d",
      "text": "Since when was there another side?",
      "timestamp": "2022-07-09 20:54:48",
      "score": 1,
      "num_children": 0,
      "author": 117956,
      "replies": []
    },
    {
      "id": "ifj0c99",
      "text": "They need to teach about Stalin",
      "timestamp": "2022-07-09 22:35:24",
      "score": 1,
      "num_children": 0,
      "author": 386742,
      "replies": []
    },
    {
      "id": "ifj1bzo",
      "text": "Involuntary cremation",
      "timestamp": "2022-07-09 22:43:04",
      "score": 1,
      "num_children": 0,
      "author": 394435,
      "replies": []
    },
    {
      "id": "ifj8tuo",
      "text": "As someone who lives in ohio this isn’t at all surprising",
      "timestamp": "2022-07-09 23:42:45",
      "score": 1,
      "num_children": 0,
      "author": 378982,
      "replies": []
    },
    {
      "id": "ifjfnpt",
      "text": "ha, awesome \n\nreminds me of the Blues Brothers",
      "timestamp": "2022-07-10 00:39:11",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ifjhj4p",
      "text": "My representative is a co-sponsor. District 93 Jason Stephens. I coached his kid in wrestling and his wife was a co worker. Never knew he was a nazi sympathizer.",
      "timestamp": "2022-07-10 00:54:58",
      "score": 1,
      "num_children": 0,
      "author": 352316,
      "replies": []
    },
    {
      "id": "ifjibtl",
      "text": "And this is why they got sent poop",
      "timestamp": "2022-07-10 01:01:39",
      "score": 1,
      "num_children": 0,
      "author": 368373,
      "replies": []
    },
    {
      "id": "ifjm5d3",
      "text": "I no longer openly admit that Ohio is my birth state. I stopped in November 2016.",
      "timestamp": "2022-07-10 01:34:26",
      "score": 1,
      "num_children": 0,
      "author": 165747,
      "replies": []
    },
    {
      "id": "ifjmu88",
      "text": "Germany literally teaching the Holocaust better than one of the countries that helped end it.",
      "timestamp": "2022-07-10 01:40:17",
      "score": 1,
      "num_children": 0,
      "author": 393996,
      "replies": []
    },
    {
      "id": "ifjna3s",
      "text": "Can someone help me out with this? This is H.B. No. 327, right?",
      "timestamp": "2022-07-10 01:43:58",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ifjqb6n",
      "text": "GOP is a dumpster fire.",
      "timestamp": "2022-07-10 02:10:02",
      "score": 1,
      "num_children": 0,
      "author": 69241,
      "replies": []
    },
    {
      "id": "ifjs1wi",
      "text": "\"Good people on both sides\" *eyeroll* puke",
      "timestamp": "2022-07-10 02:24:57",
      "score": 1,
      "num_children": 0,
      "author": 286248,
      "replies": []
    },
    {
      "id": "ifjt5fb",
      "text": "Ohio is really winning lately",
      "timestamp": "2022-07-10 02:34:32",
      "score": 1,
      "num_children": 0,
      "author": 350469,
      "replies": []
    },
    {
      "id": "ifjtd04",
      "text": "Who the fuck keeps votings for these assholes!?!",
      "timestamp": "2022-07-10 02:36:21",
      "score": 1,
      "num_children": 0,
      "author": 292802,
      "replies": []
    },
    {
      "id": "ifjuo5m",
      "text": "Here's the dumbass trying to advance this fucking idiotic bill:\n\nhttps://ohiohouse.gov/members/sarah-fowler-arthur/biography",
      "timestamp": "2022-07-10 02:47:38",
      "score": 1,
      "num_children": 0,
      "author": 31633,
      "replies": []
    },
    {
      "id": "ifk43g8",
      "text": "\"We're not Nazis, but we'll do everything we can to make sure we can to paint the Nazis in a positive light.\"",
      "timestamp": "2022-07-10 04:13:36",
      "score": 1,
      "num_children": 0,
      "author": 232407,
      "replies": []
    },
    {
      "id": "ifk4ene",
      "text": "I've decided from personal experience that republicanism as it works now is a CANCER. Lacking in any kind of sanity or moral sense, terrifyingly difficult to stop or slow, and deadly to anything kind or beautiful or sane",
      "timestamp": "2022-07-10 04:16:45",
      "score": 1,
      "num_children": 0,
      "author": 164320,
      "replies": []
    },
    {
      "id": "ifk54ij",
      "text": "Germany doesn’t even teach both sides of the Holocaust",
      "timestamp": "2022-07-10 04:23:37",
      "score": 1,
      "num_children": 0,
      "author": 219126,
      "replies": []
    },
    {
      "id": "ifk9e1v",
      "text": "Eventually it will evolve into the holocaust never happened",
      "timestamp": "2022-07-10 05:08:01",
      "score": 1,
      "num_children": 1,
      "author": 409284,
      "replies": [
        {
          "id": "ifk9eza",
          "text": "*Eventually*\n\n*It will evolve into the*\n\n*Holocaust never happened*\n\n\\- GoHedgehog\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
          "timestamp": "2022-07-10 05:08:18",
          "score": 2,
          "num_children": 0,
          "author": 206990,
          "replies": []
        }
      ]
    },
    {
      "id": "ifkdh28",
      "text": "This is their version of \" fine people on both sides \" for Nazis while banning CRT...",
      "timestamp": "2022-07-10 05:54:57",
      "score": 1,
      "num_children": 0,
      "author": 242585,
      "replies": []
    },
    {
      "id": "ifkhq89",
      "text": "If both sides means how the Allies perceived it & put an end to it and how the Nazi party manipulated and bullied it’s way into creating such an atrocity… then that sounds like history. \n\nWhat’s the issue? \n\nLearning their motives and how they did it is part of the whole “those who do not learn history are doomed to repeat it” mindset. How will we stop it from happening if we can’t identify when the evil is sprouting again?",
      "timestamp": "2022-07-10 06:48:26",
      "score": 1,
      "num_children": 0,
      "author": 7762,
      "replies": []
    },
    {
      "id": "ifkihke",
      "text": "Jesus Christ can america stop trying to victimize racist war criminals for five fucking minutes?",
      "timestamp": "2022-07-10 06:58:20",
      "score": 1,
      "num_children": 0,
      "author": 337479,
      "replies": []
    },
    {
      "id": "ifl1v13",
      "text": "So what are they proposing is the the *other side* of the holocaust?  That Jews, Gypsies and gays *deserved* to be killed?\n\nMaybe it's actually worthwhile to emphasize that the Nazi's preached such shit -- and point out that Neo-Nazis and their ilk are preaching the same shit today.",
      "timestamp": "2022-07-10 11:26:51",
      "score": 1,
      "num_children": 0,
      "author": 211403,
      "replies": []
    },
    {
      "id": "ifl6e5b",
      "text": "By both sides you mean the western front and the eastern front right? ... Right?",
      "timestamp": "2022-07-10 12:18:58",
      "score": 1,
      "num_children": 0,
      "author": 275065,
      "replies": []
    },
    {
      "id": "ifmsjfu",
      "text": "Wouldn't be a bad idea to teach how they managed to convince the general public to go along with the madness, but that would probably stray too close to how they do things. That's the sort of important lessons you should be taking from history.",
      "timestamp": "2022-07-10 19:41:56",
      "score": 1,
      "num_children": 0,
      "author": 369561,
      "replies": []
    },
    {
      "id": "ifvx9oa",
      "text": "Beep boop -- this looks like a screenshot of a tweet! Let me grab a [link to the tweet](https://twitter.com/RepWeinstein/status/1545446189310640131) for ya :) \n\n ^(Twitter Screenshot Bot)",
      "timestamp": "2022-07-12 18:09:01",
      "score": 1,
      "num_children": 0,
      "author": 259200,
      "replies": []
    },
    {
      "id": "iglrlqm",
      "text": "They want to teach both sides of holocaust but scream bloody murder if someone mentions both sides of slavery and critical race theory..",
      "timestamp": "2022-07-18 04:27:33",
      "score": 1,
      "num_children": 0,
      "author": 22180,
      "replies": []
    },
    {
      "id": "ihq89ao",
      "text": "Do they mean both sides as in the genocide they committed in Africa first as well as the holocaust?",
      "timestamp": "2022-07-26 15:50:59",
      "score": 1,
      "num_children": 0,
      "author": 45203,
      "replies": []
    },
    {
      "id": "iia3bj6",
      "text": "How the…what the…oh come the fuck on",
      "timestamp": "2022-07-30 17:30:06",
      "score": 1,
      "num_children": 0,
      "author": 404110,
      "replies": []
    },
    {
      "id": "ifi5o8v",
      "text": "[removed]",
      "timestamp": "2022-07-09 18:43:04",
      "score": -12,
      "num_children": 1,
      "replies": [
        {
          "id": "ifi9k28",
          "text": "Antisemitic much?",
          "timestamp": "2022-07-09 19:12:03",
          "score": 9,
          "num_children": 0,
          "author": 18082,
          "replies": []
        }
      ]
    },
    {
      "id": "ifhx7po",
      "text": "\"teaching\" isn't always bad\n\ni mean... there are books about these things, you're free to go read them\n\ndepends on the teacher and what material they're using, and so on",
      "timestamp": "2022-07-09 17:40:09",
      "score": -5,
      "num_children": 1,
      "author": 145946,
      "replies": [
        {
          "id": "ifjtfph",
          "text": "Can you elaborate?",
          "timestamp": "2022-07-10 02:36:59",
          "score": 1,
          "num_children": 0,
          "author": 178562,
          "replies": []
        }
      ]
    }
  ]
}