{
  "id": "vy48l6",
  "text": "Jesse Lee Peterson, one of the most popular far-right anti-LGBT Christian pastors and radio hosts, has been accused by two men of having sexual relatioships with them. One lasted ten years. Other men say he propositioned them. \"I've never witnessed this level of extreme hypocrisy and fraud before.\"\n",
  "timestamp": "2022-07-13 14:14:09",
  "score": 17591,
  "subreddit": "t5_2qh2p",
  "num_children": 399,
  "author": 221311,
  "replies": [
    {
      "id": "ig1qykw",
      "text": "Hello r/all, Welcome to r/atheism!\n\nPlease read our [Commandments](http://www.reddit.com/r/atheism/wiki/guidelines) and [FAQ](http://www.reddit.com/r/atheism/wiki/FAQ) before commenting. If you follow the rules and act civilly we can avoid a lot of bans. While everyone is welcome here, this sub is intended for atheists to discuss things of interest to us. This means that a wide variety of subjects are on-topic here. This is not a sub about just atheism.\n\nRemember: The mods do not choose which posts get voted up the frontpage. They remove the posts that violate the [Commandments](/r/atheism/w/guidelines); they don't police quality.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*",
      "timestamp": "2022-07-13 21:53:58",
      "score": 1,
      "num_children": 1,
      "author": 184140,
      "replies": [
        {
          "id": "ig2thbb",
          "text": "Every religious cult leader is just trying to get with as many teenage girls as possible, and every super-dedicated member of an organized hetero-only religion is gay. How is anyone still surprised at any of this.",
          "timestamp": "2022-07-14 02:37:15",
          "score": 7,
          "num_children": 0,
          "author": 283489,
          "replies": []
        }
      ]
    },
    {
      "id": "ifztkzn",
      "text": "> I've never witnessed this level of extreme hypocrisy and fraud before.\n\nClearly not somebody that has spent much time here.  Because to me, this sounds like a day ending in \"y\".",
      "timestamp": "2022-07-13 14:22:20",
      "score": 1188,
      "num_children": 18,
      "author": 262668,
      "replies": [
        {
          "id": "ig06udz",
          "text": "I saw that quote and couldn't help but think, have they never watched the news or read an article about damn near every religious leader ever?\n\nSay it with me folks, extreme hypocrisy and fraud is part and parcel of all religions.",
          "timestamp": "2022-07-13 15:49:59",
          "score": 328,
          "num_children": 2,
          "author": 65173,
          "replies": [
            {
              "id": "ig0kj65",
              "text": "They're conservative gay men. One of them was lamenting this could damage the conservative movement so.... All I'll say is I sorta miss the days when gay conservatives were outted by dying of aids",
              "timestamp": "2022-07-13 17:17:22",
              "score": 83,
              "num_children": 3,
              "author": 236722,
              "replies": [
                {
                  "id": "ig1s6hc",
                  "text": "A lot more innocent gay men died from aids during those days, including the man who introduced my parents to each other. We shouldn’t look back fondly at that time.",
                  "timestamp": "2022-07-13 22:02:16",
                  "score": 106,
                  "num_children": 2,
                  "author": 273105,
                  "replies": [
                    {
                      "id": "ig27y2q",
                      "text": "Damn personal. :-(",
                      "timestamp": "2022-07-13 23:55:28",
                      "score": 9,
                      "num_children": 1,
                      "author": 165491,
                      "replies": [
                        {
                          "id": "ig2yboo",
                          "text": "Fuck the Reagans. Both of them.",
                          "timestamp": "2022-07-14 03:16:47",
                          "score": 20,
                          "num_children": 2,
                          "author": 273105,
                          "replies": [
                            {
                              "id": "ig48ao3",
                              "text": "Exactly. The same fucking wingnuts that consulted psychics about the future but the christo-fascist crowd had no problems with that 🙄 Plus, Ray-gun was clearly suffering from Alzheimer's in his second term and let Nancy take the reins. This is what the GQp has offered us in th epast 50 years - Nixon and Watergate, Ray-gun and Iran Contra and tanking the Savings and Loans banks AND the Stock Market Crash of '87, HW Bush and the Persian Gulf War PLUS pardoning all of the bozos involved in Iran Contra, W and 9/11, Iraq & Afghanistan and the Crash of '08, and IQ45\\*\\*'s endless scandals and 1/6.  I am still amazed, befuddled, furious, and exasperated why people STILL vote for these assholes.",
                              "timestamp": "2022-07-14 12:05:33",
                              "score": 2,
                              "num_children": 0,
                              "author": 121442,
                              "replies": []
                            },
                            {
                              "id": "ig3x8ym",
                              "text": "They wanted to close the bath houses but yall said it was homophobic don't blame reagan. We decided to take a pill to prevent HIV rather than use condoms and be monogamous",
                              "timestamp": "2022-07-14 10:01:46",
                              "score": -1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ig2fhso",
                      "text": "Noone was celebrating and were happy that AIDS took away many people's loved ones.  I think they were just saying that people who actively worked to hurt the AIDS prone community were outed because of the disease. Classic Projecting and it came back to haunt them.",
                      "timestamp": "2022-07-14 00:51:19",
                      "score": 3,
                      "num_children": 0,
                      "author": 236250,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ig3by4m",
                  "text": "I'm not a fan of anyone dying of aids. Even conservatives.\n\nI'm guessing you were being hyperbolic there.",
                  "timestamp": "2022-07-14 05:25:09",
                  "score": 2,
                  "num_children": 0,
                  "author": 91252,
                  "replies": []
                },
                {
                  "id": "il54vd6",
                  "text": "This sounds horrible!",
                  "timestamp": "2022-08-21 02:01:28",
                  "score": 1,
                  "num_children": 0,
                  "author": 378417,
                  "replies": []
                }
              ]
            },
            {
              "id": "ij6zehr",
              "text": "Yes, all people are sinners.  It doesn’t make people hypocrites.  Yes, if true, this would make JLP a hypocrite but being a leader of a church who also sins does not necessarily make somebody a hypocrite…",
              "timestamp": "2022-08-06 15:12:55",
              "score": 1,
              "num_children": 0,
              "author": 42355,
              "replies": []
            }
          ]
        },
        {
          "id": "ig1dm1u",
          "text": "I have to say, I've spent time actively seeking JLP's content because the way his mind works (or doesn't) is THAT insane. He's done plenty of talks or debates with the likes of Destiny and David Pakman. The extreme hypocrisy or even lack of coherent thought on the part of Peterson is ASTOUNDING. It is beyond your garden variety theist.",
          "timestamp": "2022-07-13 20:25:09",
          "score": 50,
          "num_children": 7,
          "author": 400770,
          "replies": [
            {
              "id": "ig1vpbb",
              "text": "Yeah, IANAPsychologist,  but I'd bet the farm he has some kind of brain damage.  He's WAY off the rails.",
              "timestamp": "2022-07-13 22:26:58",
              "score": 4,
              "num_children": 0,
              "author": 396086,
              "replies": []
            },
            {
              "id": "ig1on4e",
              "text": ">BAYDUH",
              "timestamp": "2022-07-13 21:38:11",
              "score": 9,
              "num_children": 0,
              "author": 408409,
              "replies": []
            },
            {
              "id": "ig23vqg",
              "text": "That Destiny debate was one of the funniest and cringiest thing I have ever seen.\n\nHonestly felt like a fever dream, that guy is like a permanently drunk Trump, if Trump had even less restraint.\n\n&#x200B;\n\nI just have to assume that this guy is just joking, because I can't imagine anyone being that much of a caricature.",
              "timestamp": "2022-07-13 23:25:42",
              "score": 2,
              "num_children": 0,
              "author": 154090,
              "replies": []
            },
            {
              "id": "ig2862v",
              "text": "Uhhmmayzin!",
              "timestamp": "2022-07-13 23:57:09",
              "score": 2,
              "num_children": 0,
              "author": 210682,
              "replies": []
            },
            {
              "id": "ig25pce",
              "text": "[removed]",
              "timestamp": "2022-07-13 23:39:02",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ig2gy55",
                  "text": "Actually found that one earlier downthread and enjoyed it!",
                  "timestamp": "2022-07-14 01:02:00",
                  "score": 1,
                  "num_children": 1,
                  "author": 400770,
                  "replies": [
                    {
                      "id": "ig2hukn",
                      "text": "Nice if you want more cringe have you found hake (jesses studge) he basically has the exact same beliefs he has been making his rounds on modern day debates lately",
                      "timestamp": "2022-07-14 01:08:39",
                      "score": 2,
                      "num_children": 0,
                      "author": 102579,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ig43dgp",
              "text": "I only ever saw him once, years ago on a video by some atheist youtuber I cant remember the name of. Was a ginger woman if that helps anyone. \n\nAnd now seeing his name pop up as this prominent speaker?? Huh? The dude seemed almost brain-dead. Like a caricature you see in movies of the \"stupid\" guy. How the fuck is he this known and successful. WTF",
              "timestamp": "2022-07-14 11:16:12",
              "score": 1,
              "num_children": 0,
              "author": 108509,
              "replies": []
            },
            {
              "id": "ig4ozaz",
              "text": "His talks with Pakman are hilarious.  So funny, I've always thought, this has to be satire.",
              "timestamp": "2022-07-14 14:15:42",
              "score": 1,
              "num_children": 0,
              "author": 391131,
              "replies": []
            }
          ]
        },
        {
          "id": "ig0yzhg",
          "text": "It happens all the time. Remember Ted Haggard, megachurch founder, who got outed by a male escort outraged by his hypocrisy? (They had a lovely crystal meth and sex week end, then the “heterosexual with homosexual attachments” delusional pastor returned to wifey and churchy — and scandal)\nGeorge Alan Rekers, baptist preacher and leader of an anti gay movement, spotted at Miami international airport returning from vacation with a lovely young man hired from rentboy.com. Larry Craig, senator from Idaho, virulently anti gay asshole, busted cruising for sex in an airport bathroom and giving the most ridiculous explanation to the cops (“i have a wide stance” and “i noticed there was a bit of TP on the floor so I picked it up and my hand may accidentally have gone under the stall partition” reminiscent of David Walliam’s MP skit in Little Britain “at this point, my clothes accidentally fell off”)\n\nHappens on a daily basis. The most vituperative and anti gay they are, the most likely it is that they are gay themselves.",
          "timestamp": "2022-07-13 18:50:45",
          "score": 83,
          "num_children": 4,
          "author": 322718,
          "replies": [
            {
              "id": "ig1mc47",
              "text": "The Ted Haggard documentary was so freaking creepy; if anyone didn't suspect him of some sketchy sexual stuff, I don't know why.\n\nAnd if you watched him preaching, you saw him and heard him actually hinting at his dark side. Goes along with a couple of other public creeps, who all along were telling people who they were and I'm talking about Gary Glitter and that very popular English guy, Saville, who was molesting girls for decades and constantly making jokes about his darkside. \n\nPeople like this know that the deep inside that they're so evil, they can't contain themselves and constantly give themselves away if only people would listen.",
              "timestamp": "2022-07-13 21:22:32",
              "score": 31,
              "num_children": 0,
              "author": 295230,
              "replies": []
            },
            {
              "id": "ig1vdy4",
              "text": "[Ted Haggard Is Completely Heterosexual](https://www.youtube.com/watch?v=HZmHC75FDqQ)",
              "timestamp": "2022-07-13 22:24:44",
              "score": 14,
              "num_children": 2,
              "author": 254853,
              "replies": [
                {
                  "id": "ig1vz50",
                  "text": "Delightful 👍",
                  "timestamp": "2022-07-13 22:28:53",
                  "score": 4,
                  "num_children": 1,
                  "author": 322718,
                  "replies": [
                    {
                      "id": "ig1wfq1",
                      "text": "I first heard this when it was new, still cracks me up all these years later.",
                      "timestamp": "2022-07-13 22:32:07",
                      "score": 3,
                      "num_children": 1,
                      "author": 254853,
                      "replies": [
                        {
                          "id": "ig1wjtl",
                          "text": "It’s timeless",
                          "timestamp": "2022-07-13 22:32:56",
                          "score": 3,
                          "num_children": 0,
                          "author": 322718,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ig48y93",
                  "text": "That was totally hilarious! Thanks for the share 👍👏",
                  "timestamp": "2022-07-14 12:11:33",
                  "score": 1,
                  "num_children": 0,
                  "author": 121442,
                  "replies": []
                }
              ]
            },
            {
              "id": "ig3vipj",
              "text": "And I accidentally came to be in a position that the arresting officer described as a spit roast.",
              "timestamp": "2022-07-14 09:38:42",
              "score": 3,
              "num_children": 1,
              "author": 169045,
              "replies": [
                {
                  "id": "ig56hqc",
                  "text": "And as far as I’m concerned that’s all there is to this matter. Thank you! (Meanwhile the wife and two kids are standing behind him looking mortified)\n\nhttps://youtu.be/REpNTi-9oRQ",
                  "timestamp": "2022-07-14 16:09:24",
                  "score": 1,
                  "num_children": 0,
                  "author": 322718,
                  "replies": []
                }
              ]
            },
            {
              "id": "ig4io4g",
              "text": ">The most vituperative and anti gay they are, the most likely it is that they are gay themselves.\n\n\n\nsadly this means the most gay hating people are not straight males but gay males. So it is hate among themselves btu in public it is the straight males that get the most hate.",
              "timestamp": "2022-07-14 13:29:56",
              "score": 0,
              "num_children": 0,
              "author": 270002,
              "replies": []
            }
          ]
        },
        {
          "id": "ig1islt",
          "text": "Next you are going to tell me Lindsey Graham is having homosexual affairs.   /s",
          "timestamp": "2022-07-13 20:58:56",
          "score": 28,
          "num_children": 4,
          "author": 231951,
          "replies": [
            {
              "id": "ig1migj",
              "text": "Lady Lindsey?\n\nSay it ain't so!",
              "timestamp": "2022-07-13 21:23:44",
              "score": 6,
              "num_children": 1,
              "author": 295230,
              "replies": [
                {
                  "id": "ige9tkf",
                  "text": "I'll never stop calling him LadyG!",
                  "timestamp": "2022-07-16 14:07:35",
                  "score": 1,
                  "num_children": 1,
                  "author": 279065,
                  "replies": [
                    {
                      "id": "igeaeqy",
                      "text": "I hang out in this gay news forum just for the shits and giggle (I'm not gay or anything. I just like bitting commentary and snark) and they always call him Lady G or Lady Lindsey.🤣",
                      "timestamp": "2022-07-16 14:12:12",
                      "score": 2,
                      "num_children": 1,
                      "author": 295230,
                      "replies": [
                        {
                          "id": "igeh4v8",
                          "text": "The worst-kept secret in DC apparently.",
                          "timestamp": "2022-07-16 15:03:24",
                          "score": 1,
                          "num_children": 0,
                          "author": 279065,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ig3vtbo",
              "text": "Don't you dare talk about his ladybugs!",
              "timestamp": "2022-07-14 09:42:38",
              "score": 2,
              "num_children": 0,
              "author": 296082,
              "replies": []
            },
            {
              "id": "ig3xdnp",
              "text": "Pete buttgieg Is actually straight\n\nAnd Lindsey Graham is actually gay \n\n\nI see blatant heterosexuality when I look at Pete I'm sorry",
              "timestamp": "2022-07-14 10:03:34",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ig44x2c",
                  "text": "Sheesh.",
                  "timestamp": "2022-07-14 11:32:40",
                  "score": 1,
                  "num_children": 0,
                  "author": 231951,
                  "replies": []
                }
              ]
            },
            {
              "id": "ig4jblb",
              "text": "that would mean he is gay, which would mean gays hating on gays.",
              "timestamp": "2022-07-14 13:34:54",
              "score": 1,
              "num_children": 1,
              "author": 270002,
              "replies": [
                {
                  "id": "ig4p3dc",
                  "text": "Which is absolutely nothing new.",
                  "timestamp": "2022-07-14 14:16:29",
                  "score": 1,
                  "num_children": 0,
                  "author": 231951,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ig1c2sx",
          "text": "Yeah, hands up -- those who are surprised.\n\n.\n\n.\n\n''Crickets''",
          "timestamp": "2022-07-13 20:15:14",
          "score": 17,
          "num_children": 0,
          "author": 137110,
          "replies": []
        },
        {
          "id": "ig1dctg",
          "text": "Same thing.\n\nDid they not hear about how one of the guys that ran Liberty University was picking up guys from the hostel he owned in Florida?\n\nOr the other one that liked to watch guys do his wife?",
          "timestamp": "2022-07-13 20:23:27",
          "score": 15,
          "num_children": 1,
          "author": 40344,
          "replies": [
            {
              "id": "ig49c8q",
              "text": "Jerry Falwell, major hypocrite, but no surprise, they all are.",
              "timestamp": "2022-07-14 12:15:02",
              "score": 1,
              "num_children": 0,
              "author": 121442,
              "replies": []
            }
          ]
        },
        {
          "id": "ig1mwg3",
          "text": "My first thought was that saying that 'conservatives are made of two groups. Grifters and idiots.'\n\nIt's not hard to tell which group one is in, either, so if one has to ask, then they have their answer.",
          "timestamp": "2022-07-13 21:26:21",
          "score": 11,
          "num_children": 1,
          "author": 35328,
          "replies": [
            {
              "id": "ig38a09",
              "text": "JLP was in both groups",
              "timestamp": "2022-07-14 04:46:40",
              "score": 3,
              "num_children": 0,
              "author": 85876,
              "replies": []
            }
          ]
        },
        {
          "id": "ig0u5d3",
          "text": "Franco First Time meme",
          "timestamp": "2022-07-13 18:19:30",
          "score": 1,
          "num_children": 0,
          "author": 294937,
          "replies": []
        },
        {
          "id": "ig1empo",
          "text": "Yeah this is the most surprising part of the article.",
          "timestamp": "2022-07-13 20:31:42",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ig1ljvn",
          "text": "You mean on earth or America?",
          "timestamp": "2022-07-13 21:17:18",
          "score": 1,
          "num_children": 0,
          "author": 395625,
          "replies": []
        },
        {
          "id": "ig1zrbn",
          "text": "Have they never heard of Roy Cohn?",
          "timestamp": "2022-07-13 22:55:45",
          "score": 1,
          "num_children": 0,
          "author": 74053,
          "replies": []
        },
        {
          "id": "ig22t8k",
          "text": "Bro just say Monday and Tuesday and wait...",
          "timestamp": "2022-07-13 23:17:53",
          "score": 1,
          "num_children": 0,
          "author": 404235,
          "replies": []
        },
        {
          "id": "ig25b74",
          "text": "“For me, it was Tuesday.”",
          "timestamp": "2022-07-13 23:36:12",
          "score": 1,
          "num_children": 0,
          "author": 74075,
          "replies": []
        },
        {
          "id": "ig2h3ra",
          "text": "Or on the planet?",
          "timestamp": "2022-07-14 01:03:10",
          "score": 1,
          "num_children": 0,
          "author": 299723,
          "replies": []
        },
        {
          "id": "ig3hcyg",
          "text": "Well to be fair this is something common since the dawn of politics. But ok.",
          "timestamp": "2022-07-14 06:27:46",
          "score": 1,
          "num_children": 0,
          "author": 265068,
          "replies": []
        },
        {
          "id": "ig3y4ad",
          "text": "Oh mah gawd, we are all so shocked. How could this possibly happen to a Christian pastor?! /s",
          "timestamp": "2022-07-14 10:13:23",
          "score": 1,
          "num_children": 0,
          "author": 133649,
          "replies": []
        },
        {
          "id": "ig4ole3",
          "text": "Exactly, seems like the logical conclusions given his heavily restrictive views on life.",
          "timestamp": "2022-07-14 14:13:01",
          "score": 1,
          "num_children": 0,
          "author": 391131,
          "replies": []
        },
        {
          "id": "ig5hhi2",
          "text": "Two words...\n\nTed\n\nHaggard",
          "timestamp": "2022-07-14 17:18:17",
          "score": 1,
          "num_children": 0,
          "author": 250462,
          "replies": []
        }
      ]
    },
    {
      "id": "ifzygf2",
      "text": "I watched a video of this guy \"debate\" with Professor Dave. [He's one of the dumbest people you'll get to hear today.](https://www.youtube.com/watch?v=dVG1dNygOgA)",
      "timestamp": "2022-07-13 14:54:51",
      "score": 258,
      "num_children": 21,
      "author": 363298,
      "replies": [
        {
          "id": "ig04vse",
          "text": "Jesus christ, there's just NOTHING going on in his head. It's like he doesn't hear a single word the other guy says",
          "timestamp": "2022-07-13 15:37:12",
          "score": 116,
          "num_children": 3,
          "author": 398212,
          "replies": [
            {
              "id": "ig1a81p",
              "text": "He’s just trying to set up stupid “ah ha!” Moments like he went to the Ben Shapiro school of dumbassery.",
              "timestamp": "2022-07-13 20:03:13",
              "score": 64,
              "num_children": 0,
              "author": 195433,
              "replies": []
            },
            {
              "id": "ig26klu",
              "text": "It's like can't think straight. Probably hard to do so when he's thinking about willies.",
              "timestamp": "2022-07-13 23:45:21",
              "score": 3,
              "num_children": 0,
              "author": 53569,
              "replies": []
            },
            {
              "id": "ig0zwk9",
              "text": "that's exactly what someone who's 50% daddy 50% momma would say",
              "timestamp": "2022-07-13 18:56:39",
              "score": 7,
              "num_children": 1,
              "author": 100123,
              "replies": [
                {
                  "id": "ig1wirp",
                  "text": "Indeed, everyone is a product of two biological parents. A father and a mother. And sure enough, the person you replied to did say something while being genetically made up of two parents.\n\nLambasted! A superior jape. Keep up the shenanigans, yon hobgoblin!",
                  "timestamp": "2022-07-13 22:32:43",
                  "score": 6,
                  "num_children": 1,
                  "author": 126726,
                  "replies": [
                    {
                      "id": "ig2yfyl",
                      "text": "Observed!",
                      "timestamp": "2022-07-14 03:17:45",
                      "score": 1,
                      "num_children": 0,
                      "author": 409743,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ig0toat",
          "text": "JLP debates are some of the funniest things I've ever seen (they're AMAYZIN'). Prof. Dave, Vaush, Destiny, and even David Pakman all make a total clown out of him.",
          "timestamp": "2022-07-13 18:16:23",
          "score": 39,
          "num_children": 6,
          "author": 263359,
          "replies": [
            {
              "id": "ig130rf",
              "text": "Isn't Destiny a girl's name?",
              "timestamp": "2022-07-13 19:16:43",
              "score": 27,
              "num_children": 7,
              "author": 200451,
              "replies": [
                {
                  "id": "ig13v5f",
                  "text": "Gnome's name.",
                  "timestamp": "2022-07-13 19:22:06",
                  "score": 9,
                  "num_children": 1,
                  "author": 379876,
                  "replies": [
                    {
                      "id": "ig1kh6y",
                      "text": "[Isn't that Ann?](https://xkcd.com/1704/)",
                      "timestamp": "2022-07-13 21:10:08",
                      "score": 2,
                      "num_children": 0,
                      "author": 67053,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ig1hyji",
                  "text": "Beydaaa.",
                  "timestamp": "2022-07-13 20:53:27",
                  "score": 9,
                  "num_children": 0,
                  "author": 263359,
                  "replies": []
                },
                {
                  "id": "ig1tcqe",
                  "text": "AMAZIN",
                  "timestamp": "2022-07-13 22:10:28",
                  "score": 3,
                  "num_children": 0,
                  "author": 242653,
                  "replies": []
                },
                {
                  "id": "ig29fs2",
                  "text": "WHAT A MESS!",
                  "timestamp": "2022-07-14 00:06:36",
                  "score": 3,
                  "num_children": 0,
                  "author": 250274,
                  "replies": []
                },
                {
                  "id": "ig1g706",
                  "text": "- A guy whose name sounds exactly like Jessie",
                  "timestamp": "2022-07-13 20:41:51",
                  "score": 2,
                  "num_children": 0,
                  "author": 367911,
                  "replies": []
                },
                {
                  "id": "ig23g2s",
                  "text": "No no it's Desmond Smalls. His nickname is DesTiny.",
                  "timestamp": "2022-07-13 23:22:29",
                  "score": 2,
                  "num_children": 0,
                  "author": 274053,
                  "replies": []
                },
                {
                  "id": "ig23zoz",
                  "text": "No it's a black stripper who has been abused their whole life",
                  "timestamp": "2022-07-13 23:26:30",
                  "score": -1,
                  "num_children": 0,
                  "author": 91849,
                  "replies": []
                }
              ]
            },
            {
              "id": "ig1ej7q",
              "text": "I'd like to see Sam Seder debate him. Even Hasanabi has.",
              "timestamp": "2022-07-13 20:31:05",
              "score": 6,
              "num_children": 0,
              "author": 367108,
              "replies": []
            },
            {
              "id": "ig1jpf3",
              "text": "[JLP and Destiny had some quality memes after.](https://www.youtube.com/watch?v=CAEz4LzGf90)",
              "timestamp": "2022-07-13 21:04:59",
              "score": 6,
              "num_children": 0,
              "author": 108158,
              "replies": []
            },
            {
              "id": "ig23y15",
              "text": "The Vaush one was great, he clearly knew JLP was a clown and [just trolled him the whole time](https://www.youtube.com/watch?v=TUoEWKBuXGk)",
              "timestamp": "2022-07-13 23:26:09",
              "score": 6,
              "num_children": 0,
              "author": 274053,
              "replies": []
            },
            {
              "id": "ig328ik",
              "text": "Pro Dave demolished his ass, I watched that one.",
              "timestamp": "2022-07-14 03:49:59",
              "score": 2,
              "num_children": 0,
              "author": 330390,
              "replies": []
            },
            {
              "id": "ig1b3ky",
              "text": "What do you mean even Pakman, why wouldn't he clown him?",
              "timestamp": "2022-07-13 20:08:54",
              "score": 2,
              "num_children": 1,
              "author": 74234,
              "replies": [
                {
                  "id": "ig1hwgw",
                  "text": "Dont get me wrong i like DPak a lot, what i mean is he's comparatively soft-spoken, a very different style than the other people i mentioned. He didn't go into that debate looking to humiliate JLP, but still highlighted how much of a fool he is by just calmly talking to him like he wasn't crazy.",
                  "timestamp": "2022-07-13 20:53:04",
                  "score": 7,
                  "num_children": 1,
                  "author": 263359,
                  "replies": [
                    {
                      "id": "ig1p3ch",
                      "text": "Pakman's interview style is hilarious to me. He treats absolute lunatics like he *wants* them to do well, which makes it even funnier when they bomb.",
                      "timestamp": "2022-07-13 21:41:14",
                      "score": 11,
                      "num_children": 0,
                      "author": 220315,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ig0f7zc",
          "text": "The only video of Jesse I have seen was Jimmy Snow's overview of Paul and Morgan appearance on Jesse's show. That guy is painfully dumb and a complete misogynist. I can't imagine how bad things went for him against Professor Dave and I'm not sure I want to torture myself by watching.",
          "timestamp": "2022-07-13 16:43:36",
          "score": 27,
          "num_children": 1,
          "author": 224302,
          "replies": [
            {
              "id": "ig15j6s",
              "text": "He's like a character pre-coming out Mac (from Always Sunny) would have hung out with and thought was a genius!",
              "timestamp": "2022-07-13 19:32:50",
              "score": 6,
              "num_children": 0,
              "author": 285617,
              "replies": []
            }
          ]
        },
        {
          "id": "ig0sxnj",
          "text": "what's more likely?  A Black guy in the south thinks racism doesn't exist.   OR A black guy in the south says racism doesn't exist to make money off racists?",
          "timestamp": "2022-07-13 18:11:28",
          "score": 21,
          "num_children": 1,
          "author": 319972,
          "replies": [
            {
              "id": "ig32i6w",
              "text": "Bro, he really be serious too, that's the fucked up part. White history month,,,? How much are they paying him to say this shit?",
              "timestamp": "2022-07-14 03:52:18",
              "score": 2,
              "num_children": 0,
              "author": 330390,
              "replies": []
            }
          ]
        },
        {
          "id": "ig0ll22",
          "text": "He's honestly frustrating to listen to, sounds like a logorrheic drunk with delusions of being a big brain alpha male.",
          "timestamp": "2022-07-13 17:24:05",
          "score": 17,
          "num_children": 1,
          "author": 314755,
          "replies": [
            {
              "id": "ig0sgwh",
              "text": "Had to look up logorrhea, my new favorite word",
              "timestamp": "2022-07-13 18:08:25",
              "score": 7,
              "num_children": 3,
              "author": 346268,
              "replies": [
                {
                  "id": "ig1eo6g",
                  "text": "\"*In psychology, logorrhea is a communication disorder that causes excessive wordiness and repetitiveness, which can cause incoherency*\"\n\nhttps://en.m.wikipedia.org/wiki/Logorrhea_(psychology)",
                  "timestamp": "2022-07-13 20:31:58",
                  "score": 8,
                  "num_children": 0,
                  "author": 332208,
                  "replies": []
                },
                {
                  "id": "ig19lqn",
                  "text": "Ditto!!",
                  "timestamp": "2022-07-13 19:59:13",
                  "score": 1,
                  "num_children": 0,
                  "author": 222815,
                  "replies": []
                },
                {
                  "id": "ig1d4f6",
                  "text": "Wait until you discover lissencephalic!",
                  "timestamp": "2022-07-13 20:21:57",
                  "score": 1,
                  "num_children": 0,
                  "author": 151148,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ig02joy",
          "text": "Dude looks like he is in blackface.  He really does.",
          "timestamp": "2022-07-13 15:21:51",
          "score": 50,
          "num_children": 1,
          "author": 345709,
          "replies": [
            {
              "id": "ig0ezkt",
              "text": "Hes an Uncle Tom at this point: https://mobile.twitter.com/jlptalk/status/516671165105201152?lang=en",
              "timestamp": "2022-07-13 16:42:07",
              "score": 34,
              "num_children": 3,
              "author": 380062,
              "replies": [
                {
                  "id": "ig1czrc",
                  "text": "What the hell drives someone to that?",
                  "timestamp": "2022-07-13 20:21:07",
                  "score": 13,
                  "num_children": 2,
                  "author": 367108,
                  "replies": [
                    {
                      "id": "ig1g1wg",
                      "text": "Money",
                      "timestamp": "2022-07-13 20:40:56",
                      "score": 13,
                      "num_children": 0,
                      "author": 81689,
                      "replies": []
                    },
                    {
                      "id": "im0q1ge",
                      "text": "Mental illness",
                      "timestamp": "2022-08-27 16:32:29",
                      "score": 1,
                      "num_children": 0,
                      "author": 277549,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ig1pd7u",
                  "text": "I've thought of him as more of an Uncle Ruckus.",
                  "timestamp": "2022-07-13 21:43:04",
                  "score": 11,
                  "num_children": 1,
                  "author": 16579,
                  "replies": [
                    {
                      "id": "ig2xjww",
                      "text": "Am I missing some joke or reference? Uncle Ruckus is an extreme Uncle Tom.",
                      "timestamp": "2022-07-14 03:10:20",
                      "score": 2,
                      "num_children": 1,
                      "author": 110801,
                      "replies": [
                        {
                          "id": "ig34sew",
                          "text": "It's just the degree of caricature I think he is. Anyone can be an Uncle Tom, but you gotta be amazingly insane for your words to legitimately resemble Uncle Ruckus.",
                          "timestamp": "2022-07-14 04:13:06",
                          "score": 3,
                          "num_children": 1,
                          "author": 16579,
                          "replies": [
                            {
                              "id": "ig3dzd8",
                              "text": "The Boondocks went out of its way to separate Tom and Ruckus into two characters for a reason.",
                              "timestamp": "2022-07-14 05:47:49",
                              "score": 1,
                              "num_children": 0,
                              "author": 338669,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ig1xjh0",
                  "text": "His head is huge compared to the rest of his body",
                  "timestamp": "2022-07-13 22:39:57",
                  "score": 2,
                  "num_children": 0,
                  "author": 114990,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ig0y8sy",
          "text": "The guy is genuinely so stupid that I think he's being taken advantage of by the people who run his show. Not to excuse his behavior but the people around him deserve just as much scrutiny.",
          "timestamp": "2022-07-13 18:46:00",
          "score": 14,
          "num_children": 0,
          "author": 346174,
          "replies": []
        },
        {
          "id": "ig17lv0",
          "text": "Dude straight up said slavery wasn’t racist lmao",
          "timestamp": "2022-07-13 19:46:15",
          "score": 10,
          "num_children": 1,
          "author": 295417,
          "replies": [
            {
              "id": "ig32omu",
              "text": "The civil rights movement was a bad idea. Segregation was a good thing. I had to force myself to listen to that shit. And I'm black",
              "timestamp": "2022-07-14 03:53:54",
              "score": 1,
              "num_children": 0,
              "author": 330390,
              "replies": []
            }
          ]
        },
        {
          "id": "ig0njpw",
          "text": "honestly don't think he is dumb.  I think he is a gay comedian that is making money off of dumb people",
          "timestamp": "2022-07-13 17:36:40",
          "score": 9,
          "num_children": 1,
          "author": 319972,
          "replies": [
            {
              "id": "ig1gdl8",
              "text": "Grifting people while also making the world a worse place is by far more evil than just being like he is",
              "timestamp": "2022-07-13 20:43:02",
              "score": 11,
              "num_children": 1,
              "author": 81689,
              "replies": [
                {
                  "id": "ig1i29a",
                  "text": "I don't disagree with that :D",
                  "timestamp": "2022-07-13 20:54:07",
                  "score": 2,
                  "num_children": 0,
                  "author": 319972,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ig0tlze",
          "text": "BETA!",
          "timestamp": "2022-07-13 18:15:58",
          "score": 14,
          "num_children": 1,
          "author": 400208,
          "replies": [
            {
              "id": "ig1h5gs",
              "text": "Beta? Can we stop with the alpha beta male stuff.\n\nEdit: nvm you're making fun of them calling guys beta.",
              "timestamp": "2022-07-13 20:48:07",
              "score": 2,
              "num_children": 1,
              "author": 57004,
              "replies": [
                {
                  "id": "ig1rw6p",
                  "text": "Yeah it's like the guy's catchphrase",
                  "timestamp": "2022-07-13 22:00:21",
                  "score": 6,
                  "num_children": 1,
                  "author": 125539,
                  "replies": [
                    {
                      "id": "ig32q1t",
                      "text": "That's AMAZIN!!",
                      "timestamp": "2022-07-14 03:54:15",
                      "score": 3,
                      "num_children": 0,
                      "author": 330390,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ig3gj1a",
          "text": "For anybody new to Professor Dave, you should know his channel is superb. Most find him through debunk videos like [The Earth Still Isn’t Flat](https://youtu.be/JDy95_eNPzM). However, he is actually a science educator, primarily chemistry. And he is damn good at it. So check out more if you’re into that.",
          "timestamp": "2022-07-14 06:17:35",
          "score": 3,
          "num_children": 0,
          "author": 231529,
          "replies": []
        },
        {
          "id": "ig1e9bh",
          "text": "Damn. I lost IQ in that exchange. I am sorry for Prof Dave!",
          "timestamp": "2022-07-13 20:29:20",
          "score": 1,
          "num_children": 0,
          "author": 137110,
          "replies": []
        },
        {
          "id": "ig1eyxe",
          "text": "Praise middle guy tho! The real hero!",
          "timestamp": "2022-07-13 20:33:54",
          "score": 1,
          "num_children": 0,
          "author": 46631,
          "replies": []
        },
        {
          "id": "ig1n7kq",
          "text": "Ya he does debates with liberals and gets completely dunked on. There are a few debates with David Packman that are interesting to watch.",
          "timestamp": "2022-07-13 21:28:27",
          "score": 1,
          "num_children": 1,
          "author": 154259,
          "replies": [
            {
              "id": "ig1s1fk",
              "text": "Yeah they are fun, not as debates but as comedies",
              "timestamp": "2022-07-13 22:01:18",
              "score": 1,
              "num_children": 0,
              "author": 125539,
              "replies": []
            }
          ]
        },
        {
          "id": "ig1qn58",
          "text": "I couldn’t get past 10 minutes of this “debate”….\n\nAwful all Around. \n\nHow was no one prepared or have any historical insight of the facts??",
          "timestamp": "2022-07-13 21:51:49",
          "score": 1,
          "num_children": 0,
          "author": 137277,
          "replies": []
        },
        {
          "id": "ig1vq8k",
          "text": "Lmao wow i remember talking to and eventually realized /u/XxGanjaXXGOD719 was literally spewing the exact same talking points as this video (crap about lyndon johnson, democrats are the original racists etc.). \n\nJeeze you people are so boringly unoriginal.  (not directed to the person im replying of course)",
          "timestamp": "2022-07-13 22:27:08",
          "score": 1,
          "num_children": 0,
          "author": 19273,
          "replies": []
        },
        {
          "id": "ig2rlzc",
          "text": "Why the fuck did I watch that? Painful.",
          "timestamp": "2022-07-14 02:22:29",
          "score": 1,
          "num_children": 0,
          "author": 186616,
          "replies": []
        },
        {
          "id": "ig2t8dy",
          "text": "[Here's ](https://youtu.be/Gs0KuwInuxM) another one that really just makes your head explode",
          "timestamp": "2022-07-14 02:35:15",
          "score": 1,
          "num_children": 0,
          "author": 403972,
          "replies": []
        },
        {
          "id": "ig31wpr",
          "text": "It's ironic they would post about this guy here because I was just watching his videos on YouTube and this guy is perhaps the most dumbest coon I've ever heard of. He calls Trump the \"Great White Hope\". This knows what's he's doing and is the biggest troll are he's really that mentally challenged and I choose the latter",
          "timestamp": "2022-07-14 03:47:05",
          "score": 1,
          "num_children": 0,
          "author": 330390,
          "replies": []
        },
        {
          "id": "ig3fmc5",
          "text": "He debates other Christians too. Even though I hate paul and Morgan (they are very rude and homophobic and everything) I felt kind of sad for them at that moment. Its like he hates women too",
          "timestamp": "2022-07-14 06:06:42",
          "score": 1,
          "num_children": 0,
          "author": 340830,
          "replies": []
        },
        {
          "id": "ig3m5zk",
          "text": "That is disturbing.  Is he actually black, cos that looks like some bad shoe nugget.",
          "timestamp": "2022-07-14 07:29:41",
          "score": 1,
          "num_children": 0,
          "author": 996,
          "replies": []
        }
      ]
    },
    {
      "id": "ifzsva6",
      "text": "As usual, every accusation is an admission. It never fails with an outspoken \"anti-\" leader.",
      "timestamp": "2022-07-13 14:17:26",
      "score": 1205,
      "num_children": 9,
      "author": 244463,
      "replies": [
        {
          "id": "ifzxxlq",
          "text": "Yep! Projecting like an IMAX.",
          "timestamp": "2022-07-13 14:51:23",
          "score": 342,
          "num_children": 5,
          "author": 279065,
          "replies": [
            {
              "id": "ig04oan",
              "text": "Documentary about the only candidate from Louisiana to spend a substantial amount of time working in science communications! https://www.youtube.com/watch?v=_EaIQoIuSCc",
              "timestamp": "2022-07-13 15:35:50",
              "score": 68,
              "num_children": 0,
              "author": 117993,
              "replies": []
            },
            {
              "id": "ig0yy7k",
              "text": "More like a BETAmax",
              "timestamp": "2022-07-13 18:50:31",
              "score": 45,
              "num_children": 2,
              "author": 310069,
              "replies": [
                {
                  "id": "ig19p4a",
                  "text": "I see what you did there. Take my up vote.",
                  "timestamp": "2022-07-13 19:59:49",
                  "score": 9,
                  "num_children": 0,
                  "author": 379431,
                  "replies": []
                },
                {
                  "id": "ig3dwo8",
                  "text": "I love betamax but you have to clean them often",
                  "timestamp": "2022-07-14 05:46:57",
                  "score": 1,
                  "num_children": 0,
                  "author": 222034,
                  "replies": []
                }
              ]
            },
            {
              "id": "ig1an3m",
              "text": "Projection so strong we can display it on the noon.",
              "timestamp": "2022-07-13 20:05:55",
              "score": 4,
              "num_children": 0,
              "author": 146600,
              "replies": []
            },
            {
              "id": "ig0bn5k",
              "text": "Thats not projection its fucking mental illness lol",
              "timestamp": "2022-07-13 16:20:45",
              "score": 26,
              "num_children": 2,
              "replies": [
                {
                  "id": "ig0mxtt",
                  "text": "There's always someone like you to tell us what something is and isn't. Why does this style of oneupmanship matter to so many people?\n\nIn fact, it's not mental illness (lol?). Homosexuality is completely normal, and repression, while tragic and incurring enormous emotional scarring, is at least understandable given the environment and indoctrination that people like Peterson experience throughout their lives.\n\nImagine if you grew a sixth finger on your left hand. And your society, or at least your social circle, believed that people with six fingers on their left hand were literally demonic. You have the choice to try to cut that finger off and live a mostly normal life among the five fingers, or you can try to hide it until you can't anymore, or you can try to escape. Alternatively you could kill yourself because you have no where to go and can't live with the hate around you day in day out reminding you that you're abnormal, which sadly is what far too many six-fingered kids decide to do.\n\nHaving six fingers is completely normal, is not demonic, and such thoughts have no place in modern society. But you will suffer the scars of the ignorant and hateful people around you, and you're not going to make a decision on how to deal with that pain. People like Peterson decide to hide their differences in plain sight doing exactly what he was taught to do as a child, which is to loudly and proudly preach how demonic and wrong six fingered people are.\n\nIt's not mental illness, it's a defense mechanism. It's a horrible one that causes more pain and more suffering and more indignation. But we can understand the mechanism even as we condemn the hypocrisy. And in this understanding we can hopefully open the eyes of others like Peterson suffering as he has his entire life.",
                  "timestamp": "2022-07-13 17:32:46",
                  "score": 25,
                  "num_children": 7,
                  "author": 120395,
                  "replies": [
                    {
                      "id": "ig0nr4y",
                      "text": ">it's not mental illness (lol?). Homosexuality is completely normal, and repression, while tragic and incurring enormous emotional\n\nNobody said homosexuality was a mental illness. They said the common tactic of the alt right and fascists to project themselves on to the opposition is. When a right wing fascist says \"Democrats have an underground child sex dungeon\" then we can be pretty damn sure that they themselves have an underground child sex dungeon. That is strait out of the fascist manual. It's a common tactic, and the person you replied to was colloquially saying \"that's retarded\".",
                      "timestamp": "2022-07-13 17:37:59",
                      "score": 56,
                      "num_children": 1,
                      "author": 200280,
                      "replies": [
                        {
                          "id": "ig198wa",
                          "text": "Read the whole post more carefully. \n\nI think the point is less they thought the person they were responding to is calling homosexuality a mental illness. \n\nIt's more: Because of how our society has treated homosexuality, behavior like this is a defense response in which they try (and fail) to reject a part of themselves. \n\nHe's loud and bigoted. But in many ways I pity him because I'm well aware he's like this because he's been indoctrinated into believing everything he is saying instead of being allowed to accept himself. \n\nI don't view people like him with disgust and revulsion because I can understand exactly the parts of the society built by cis straight men have led to the way he views himself and others. \n\nThis kind of indoctrination is hard to overcome for many. See how religion has taken hold of so many...\n\nAlso using \"that's retarded\" or \"it's mental illness\" is much like saying \"that's gay\" as a pejorative term. I've been working on using less of those because honestly, mental illness isn't something to be ridiculed.",
                          "timestamp": "2022-07-13 19:56:54",
                          "score": 3,
                          "num_children": 3,
                          "author": 392933,
                          "replies": [
                            {
                              "id": "ig1guwo",
                              "text": ">Also using \"that's retarded\" or \"it's mental illness\" is much like saying \"that's gay\" as a pejorative term. I've been working on using less of those because honestly, mental illness isn't something to be ridiculed.\n\nI understand and agree with that. Which is why I qualified it with \"is using it colloquially to say\". \n\nIt actually bugs the hell out of me when people say religion is a mental illness because it isn't. It's, as youre pointing out, natural human behavior.",
                              "timestamp": "2022-07-13 20:46:11",
                              "score": 4,
                              "num_children": 2,
                              "author": 200280,
                              "replies": [
                                {
                                  "id": "ig2db14",
                                  "text": "Being religious isn't \"natural human behavior\". \n\nBabies are born athiest. They only become religious and gain those beliefs because they are taught them and are surrounded by them from the beginning of their development.\n\nSome people believe that they were \"born Christian\", not realizing that if they had been born somewhere else in the world they would be Muslim, or Jewish, or Hindu. And although there are exceptions, people raised without having religion pushed on them tend to grow up without a need or desire for it.",
                                  "timestamp": "2022-07-14 00:35:12",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 248641,
                                  "replies": [
                                    {
                                      "id": "ig2v6yz",
                                      "text": ">Babies are born athiest.\n\nDepends on how you define it. Under your definition a rock is also atheist. Which I find kinda dumb. Babies don't have the capacity to consider the proposition or concept of a god in order to be an ath**ei**st. Babies don't know or believe anything. \n\n>They only become religious and gain those beliefs because they are taught them and are surrounded by them from the beginning of their development.\n\nYes. Which is how humans lived for 100,000 years before modern society and how our evolution kept us alive and programmed our brains to work. Sitting in air conditioning and using smartphones isn't \"natural human behavior\".  It's nice to only look at us now surrounded by technology like the internet where we learn about atheism but human behavior developed a loooong time ago. \n\n\n>Some people believe that they were \"born Christian\", not realizing that if they had been born somewhere else in the world they would be Muslim, or Jewish, or Hindu.\n\nI'm aware. Maybe I didn't explain what I meant well enough. \n\nWhat I meant was more like humans naturally experience paradolia, have type 1 and type 2 errors in our cognitive processing and it takes work and education to counter those cognitive biases. That's all I meant by it being natural human behavior. Maybe superstitious would have been a better word than religiois. You hear a rustle in the bushes and assume it's a lion even if its just the wind, you run away and survive. If you're skeptical and wait for more data and it is a lion, your eaten.",
                                      "timestamp": "2022-07-14 02:50:59",
                                      "score": 0,
                                      "num_children": 1,
                                      "author": 200280,
                                      "replies": [
                                        {
                                          "id": "ig4ariv",
                                          "text": ">Babies don't know or believe anything. \n\nHence, no one is born believing in a god.\n\nSince atheism is the opposite of theism...",
                                          "timestamp": "2022-07-14 12:27:16",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 374194,
                                          "replies": [
                                            {
                                              "id": "ig4mko6",
                                              "text": "As I said, this depends on your definition. \n\nWhen I say \"atheist\" I'm talking about people who have the capacity to consider whether a god exists or not. If you are incapable of considering the proposition, you're \"an atheist\" in the same way a rock is not \"an atheist\" because rocks also don't believe in god. If you want to go with the \"literally anything that doesn't believe in a god is an atheist\" you go ahead. I defined my terms. You don't have to accept them.",
                                              "timestamp": "2022-07-14 13:58:47",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 200280,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "ig4m6iy",
                                  "text": "Religion is crazy tho. Why is it natural human behaviour because ppl where more gullible before? You do realise ppl are moving away from religion more and more all the time as they should. So is anti religion now more natural then?",
                                  "timestamp": "2022-07-14 13:55:56",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 142785,
                                  "replies": [
                                    {
                                      "id": "ig4mtjm",
                                      "text": "As I already explained in another comment making this point, slightly edited for clarity:\n\n>Which [This] is how humans lived for 100,000 years before modern society and how our evolution kept us alive and programmed our brains to work. We are programmed  by evolution to see agency behind things when there isnt. Sitting in air conditioning and using smartphones isn't \"natural human behavior\". It's nice to only look at us now surrounded by technology  like the internet where we learn about atheism but human behavior developed a loooong time ago on the savannahs when we were trying not to get eaten. it's easy to look down on those people now with hindsight. But considering the context what I said is accurate.  \n\n>I'm aware. Maybe I didn't explain what I meant well enough. \n\n>What I meant was more like humans naturally experience paradolia, have type 1 and type 2 errors in our cognitive processing and it takes work and education to counter those cognitive biases. That's all I meant by it being natural human behavior. Maybe superstitious would have been a better word than religiois. You hear a rustle in the bushes and assume it's a lion even if its just the wind, you run away and survive. If you're skeptical and wait for more data and it is a lion, your eaten.",
                                      "timestamp": "2022-07-14 14:00:31",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 200280,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "ig1u02t",
                              "text": ">Also using \"that's retarded\" or \"it's mental illness\" is much like saying \"that's gay\" as a pejorative term. I've been working on using less of those because honestly, mental illness isn't something to be ridiculed.\n\nThat's ~~retarded~~, ~~moronic~~, ~~imbecilic~~, ~~spastic~~, ~~stupid~~, ~~dumb~~, ignorant, because it's the intent of the user that matters not the word itself. There will always be a need to differentiate levels of capability with medical or literary terms, and those terms will always be used by the competent to describe people and ideas they consider less so. So yes, those ideas are retarded, as in under developed and not fully cognizant, not as in related to a retarded person.",
                              "timestamp": "2022-07-13 22:15:03",
                              "score": 3,
                              "num_children": 0,
                              "author": 34504,
                              "replies": []
                            },
                            {
                              "id": "ig4lzi1",
                              "text": "Ofc its always some one elses fault its never the individual to blame. Must be nice living a life where nothing can ever be your fault. Its petersons fault no matter what happend growing up he choses to act like that now. Nobody is forcing him",
                              "timestamp": "2022-07-14 13:54:32",
                              "score": 1,
                              "num_children": 1,
                              "author": 142785,
                              "replies": [
                                {
                                  "id": "ig4vval",
                                  "text": ">  Its petersons fault no matter what happend growing up he choses to act like that now. Nobody is forcing him\n\nYou can be empathetic and understand the fucked up circumstances of someone's upbringing while also accepting that their actions and responses to those circumstances are entirely their own. \n\nPlenty of gay people come out of circumstances like this without becoming total shitheads. \n\nBut if our society wasn't so cruel to gay people as a whole he likely wouldn't have turned out like that.",
                                  "timestamp": "2022-07-14 15:01:26",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 392933,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ig0omiy",
                      "text": "You've made 38 posts in the last 24 hours. Go outside and touch grass.",
                      "timestamp": "2022-07-13 17:43:32",
                      "score": 24,
                      "num_children": 2,
                      "author": 77831,
                      "replies": [
                        {
                          "id": "ig1gonf",
                          "text": "also his post is just a longer version of \"oneupmanship\".  \n\n\nIronically, he gave us a perfect example of projection",
                          "timestamp": "2022-07-13 20:45:03",
                          "score": 7,
                          "num_children": 0,
                          "author": 78180,
                          "replies": []
                        },
                        {
                          "id": "ig3sq77",
                          "text": "Skin cancer? In this economy?",
                          "timestamp": "2022-07-14 09:00:10",
                          "score": 1,
                          "num_children": 0,
                          "author": 9389,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ig0rc92",
                      "text": "Have you read “The Chrysalids” by John Wyndham?  Almost exactly what you describe there.",
                      "timestamp": "2022-07-13 18:01:00",
                      "score": 2,
                      "num_children": 0,
                      "author": 255240,
                      "replies": []
                    },
                    {
                      "id": "ig1esht",
                      "text": "Lol watch any JLP, as he says himself \"I'm black and I'm slow\". The guy has something wrong mentally.",
                      "timestamp": "2022-07-13 20:32:44",
                      "score": 2,
                      "num_children": 1,
                      "author": 46631,
                      "replies": [
                        {
                          "id": "ig1pxu1",
                          "text": "Perhaps he does have something wrong mentally, but being a hypocrite wrt homosexuality isn’t evidence of that.",
                          "timestamp": "2022-07-13 21:47:00",
                          "score": 1,
                          "num_children": 1,
                          "author": 193714,
                          "replies": [
                            {
                              "id": "ig1ytt4",
                              "text": "Agreed.",
                              "timestamp": "2022-07-13 22:49:09",
                              "score": 1,
                              "num_children": 0,
                              "author": 46631,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ig0nm4j",
                      "text": "Delete this",
                      "timestamp": "2022-07-13 17:37:06",
                      "score": -1,
                      "num_children": 1,
                      "author": 112799,
                      "replies": [
                        {
                          "id": "ig0ts52",
                          "text": "Too late, lmfao",
                          "timestamp": "2022-07-13 18:17:05",
                          "score": 1,
                          "num_children": 0,
                          "author": 118298,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ig1ejlp",
                      "text": "This is how left-handed children were treated when my father was a child.",
                      "timestamp": "2022-07-13 20:31:09",
                      "score": 1,
                      "num_children": 0,
                      "author": 298168,
                      "replies": []
                    },
                    {
                      "id": "ig4lplg",
                      "text": "I cant belive you are actually defending the guy",
                      "timestamp": "2022-07-14 13:52:31",
                      "score": 1,
                      "num_children": 0,
                      "author": 142785,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ig4o9ro",
                  "text": "It's shame. It's shame on a level that one feels like they can never own up to it, so they keep doubling down until their world unravels. And when it finally unravels, they travel to Russia to be put into a medically induced coma where they are finally broken.",
                  "timestamp": "2022-07-14 14:10:46",
                  "score": 1,
                  "num_children": 0,
                  "author": 194105,
                  "replies": []
                }
              ]
            },
            {
              "id": "ig13byc",
              "text": "Oh that would make excellent flair. Also- I’m incorporating that statement into my life post haste!",
              "timestamp": "2022-07-13 19:18:44",
              "score": 1,
              "num_children": 0,
              "author": 207782,
              "replies": []
            }
          ]
        },
        {
          "id": "ig0j0xi",
          "text": "And the more vocal they are against something, the more guilty they are of doing it.",
          "timestamp": "2022-07-13 17:07:39",
          "score": 18,
          "num_children": 2,
          "author": 300245,
          "replies": [
            {
              "id": "ig1aqjx",
              "text": "It's practically a mathematical proof at this point.",
              "timestamp": "2022-07-13 20:06:32",
              "score": 1,
              "num_children": 0,
              "author": 146600,
              "replies": []
            },
            {
              "id": "ig1bzzv",
              "text": "Similar to what Gertrude expressed to Hamlet!",
              "timestamp": "2022-07-13 20:14:44",
              "score": 1,
              "num_children": 0,
              "author": 137110,
              "replies": []
            }
          ]
        },
        {
          "id": "ig1nbme",
          "text": "The ones that rail the hardest against gays are getting railed the hardest by gays. Haha",
          "timestamp": "2022-07-13 21:29:13",
          "score": 16,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ifzzu4i",
          "text": "Yep, this happens over and over again.",
          "timestamp": "2022-07-13 15:03:57",
          "score": 22,
          "num_children": 2,
          "author": 323762,
          "replies": [
            {
              "id": "ig1bwml",
              "text": "Yeah, this isn't unprecedented at all so I don't know why the clickbait title is making it seem that way. I recall they had like a trifecta back around 2006-7 when Mark Foley, Senator Craig and Ted Haggard all got busted in a short period of time for propositioning men or having affairs despite being staunchly against gay rights or trying to claim such a \"lifestyle\" is always a choice. \n\nThe main thing that hasn't changed though is that right wing conservative men continue to rail against the LGBT community in generally  the same way as they did back then (mainly by accusing them of being groomers and pedophiles) while still getting caught on a pretty regular basis as being closeted. If anything it may have gotten worse since there seems to be more and more of these religious conservatives who are caught being predators who prey on children themselves besides all the accusations they throw at the LGBT community.",
              "timestamp": "2022-07-13 20:14:07",
              "score": 12,
              "num_children": 1,
              "author": 109053,
              "replies": [
                {
                  "id": "ig27iy8",
                  "text": "Idk, I’ve watched Petersons videos over the years and just shook my head at the level or bravado he emit s. It’s just amazing that this situation occurs again with him.",
                  "timestamp": "2022-07-13 23:52:20",
                  "score": 2,
                  "num_children": 0,
                  "author": 165491,
                  "replies": []
                }
              ]
            },
            {
              "id": "ig0u5qm",
              "text": "At least they were consenting adult men.  He's still better than Pastor Kiddy-Diddler",
              "timestamp": "2022-07-13 18:19:34",
              "score": 19,
              "num_children": 1,
              "author": 147096,
              "replies": [
                {
                  "id": "ig0xhj0",
                  "text": "That’s one high bar you set there",
                  "timestamp": "2022-07-13 18:41:05",
                  "score": 9,
                  "num_children": 1,
                  "author": 322718,
                  "replies": [
                    {
                      "id": "ig189dv",
                      "text": "Hypocrites are still better than pedos on the chain of scumbaggery",
                      "timestamp": "2022-07-13 19:50:29",
                      "score": 8,
                      "num_children": 1,
                      "author": 147096,
                      "replies": [
                        {
                          "id": "ig3mvix",
                          "text": "The worst part is the hypocrisy: https://youtu.be/x2rcquwo4R0",
                          "timestamp": "2022-07-14 07:39:11",
                          "score": 1,
                          "num_children": 0,
                          "author": 359407,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ig02d04",
          "text": "well in a way they are victims themselves, the reason they became \"anti-\" leaders, was to hide their true selves from their bigoted communities. ANd yes its somewhat human nature to do this in the face of oppression. I dont think it excuses them, but it is what influences them to do this.",
          "timestamp": "2022-07-13 15:20:38",
          "score": 54,
          "num_children": 1,
          "author": 220399,
          "replies": [
            {
              "id": "ig0jwhv",
              "text": "\"Reasons, not excuses.\" \nEveryone has reasons for what they do and think. It doesn't mean it's ok, it just means we might handle them differently.\nI say this whenever I have to explain to my trans son why grampa is such a dick. Grampa has a TBI and has damage to his frontal and parietal lobes. Makes it almost impossible to filter his speech so that he is not hurtful. For example, he might feel that my kid's artwork is a little abstract for his understanding and instead of saying, \"I'm not sure I understand this, will you explain it for me?\" He might say, \"Wow did you spill the paint?\" He's not trying to be mean, his immediate thought comes right out his mouth. My kids know this by now and just explain things at the outset. This way he understands what they're doing and it interrupts his stream of consciousness speech so he's not a dick when it's his turn to talk. He will learn what their artwork means and praise them when he understands.\nIt does NOT, however, make it impossible to not be a bigot in the first place. He is demonstrably capable of learning new things and changing his mind.\nIt just means we know he's a bigot and is guaranteed to be outspoken about it if we don't take steps to interrupt him.\nReasons, not excuses. \nHe speaks his exact thoughts because he has little control over it and sometimes is unable to control things like anxiety and paranoia. He is incapable of being diplomatic if he is not given something else to focus on. We have ways of helping him to not be a douchebag.\nBut if we miss and he acts like a douchebag, he isn't let off the hook. It just changes how we burn his ass for it afterwards.",
              "timestamp": "2022-07-13 17:13:16",
              "score": 33,
              "num_children": 0,
              "author": 115665,
              "replies": []
            }
          ]
        },
        {
          "id": "ig13b3s",
          "text": "Being gay must be a choice cause I have a choice when I realize I want to kiss billy, as he is so damned handsome......\n\n\n:)",
          "timestamp": "2022-07-13 19:18:35",
          "score": 2,
          "num_children": 0,
          "author": 340507,
          "replies": []
        },
        {
          "id": "ig0uswt",
          "text": "It'd be like if I started spouting anti-pizza rhetoric. \n\nComplete and utter bullshit.",
          "timestamp": "2022-07-13 18:23:46",
          "score": 1,
          "num_children": 0,
          "author": 154435,
          "replies": []
        },
        {
          "id": "ig3n5pw",
          "text": "He reminds me of TED HAGGARD. head of a super church who got caught messing with drugs and male prostitutes lol",
          "timestamp": "2022-07-14 07:42:57",
          "score": 1,
          "num_children": 0,
          "author": 190269,
          "replies": []
        },
        {
          "id": "ig4jejm",
          "text": "> It never fails with an outspoken \"anti-\" leader\n\ncorrection, in this case gay \"anti-\" leader",
          "timestamp": "2022-07-14 13:35:30",
          "score": 1,
          "num_children": 0,
          "author": 270002,
          "replies": []
        }
      ]
    },
    {
      "id": "ifzyshj",
      "text": "Don't forget he also liked a tweet that was a video of one gay porn star eating another gay porn stars asshole.  Left if up for a few hours, once realized his shit went private really fast.\n\nI'm surprised he has been pulling off the grift for so long, since he honestly doesn't seem have an IQ much above room temp.",
      "timestamp": "2022-07-13 14:57:03",
      "score": 211,
      "num_children": 3,
      "replies": [
        {
          "id": "ig0ms6d",
          "text": "There’s also this gem (from the article):\n\n>\tPeterson [is] claiming that a woman who orgasms during sex is somehow “becoming a man,” a practice he frowns upon.",
          "timestamp": "2022-07-13 17:31:46",
          "score": 81,
          "num_children": 2,
          "author": 387790,
          "replies": [
            {
              "id": "ig1py2r",
              "text": "This is A-grade inspiration for black comedy.",
              "timestamp": "2022-07-13 21:47:03",
              "score": 24,
              "num_children": 0,
              "author": 398622,
              "replies": []
            },
            {
              "id": "ig2ns42",
              "text": "Something tells me that he's never actually made a woman orgasm during sex...",
              "timestamp": "2022-07-14 01:53:06",
              "score": 13,
              "num_children": 1,
              "author": 272296,
              "replies": [
                {
                  "id": "ig2uagi",
                  "text": "Men, on the other hand...",
                  "timestamp": "2022-07-14 02:43:41",
                  "score": 9,
                  "num_children": 0,
                  "author": 270478,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ig0hon7",
          "text": "he only needs to be slightly smarter than his congregation.",
          "timestamp": "2022-07-13 16:59:06",
          "score": 31,
          "num_children": 0,
          "author": 21293,
          "replies": []
        },
        {
          "id": "igeab9d",
          "text": "...in Celsius.",
          "timestamp": "2022-07-16 14:11:26",
          "score": 2,
          "num_children": 0,
          "author": 279065,
          "replies": []
        }
      ]
    },
    {
      "id": "ig02e0h",
      "text": "AMAZING!",
      "timestamp": "2022-07-13 15:20:49",
      "score": 138,
      "num_children": 4,
      "author": 133090,
      "replies": [
        {
          "id": "ig02y5i",
          "text": "This sounds like a history a BETA male would hide!",
          "timestamp": "2022-07-13 15:24:29",
          "score": 60,
          "num_children": 1,
          "author": 328535,
          "replies": [
            {
              "id": "ig2kqn7",
              "text": "That's a B for Bottom.",
              "timestamp": "2022-07-14 01:30:14",
              "score": 1,
              "num_children": 0,
              "author": 13225,
              "replies": []
            }
          ]
        },
        {
          "id": "ig0cwg1",
          "text": "This should be much higher, but obviously the other people in this thread aren't as brain rotted to know his catch phrases.",
          "timestamp": "2022-07-13 16:28:51",
          "score": 28,
          "num_children": 1,
          "author": 233174,
          "replies": [
            {
              "id": "ig1815h",
              "text": "Fortunately, and unfortunately for them haha 😂",
              "timestamp": "2022-07-13 19:49:00",
              "score": 2,
              "num_children": 0,
              "author": 91390,
              "replies": []
            }
          ]
        },
        {
          "id": "ig0h9a0",
          "text": "\"BETA\"",
          "timestamp": "2022-07-13 16:56:23",
          "score": 24,
          "num_children": 2,
          "author": 93571,
          "replies": [
            {
              "id": "ig3bsaa",
              "text": "You mean \"BETAUH!!!\"",
              "timestamp": "2022-07-14 05:23:21",
              "score": 3,
              "num_children": 0,
              "author": 371625,
              "replies": []
            },
            {
              "id": "ig2visi",
              "text": "A nurse?",
              "timestamp": "2022-07-14 02:53:39",
              "score": 1,
              "num_children": 0,
              "author": 228289,
              "replies": []
            }
          ]
        },
        {
          "id": "ig3aog9",
          "text": "I yelled BETA when i saw the headline",
          "timestamp": "2022-07-14 05:11:17",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ig04nnl",
      "text": "\"BEY\\_TUH!\"",
      "timestamp": "2022-07-13 15:35:43",
      "score": 61,
      "num_children": 1,
      "author": 380104,
      "replies": [
        {
          "id": "ig05yuj",
          "text": "Amazin…",
          "timestamp": "2022-07-13 15:44:17",
          "score": 38,
          "num_children": 0,
          "author": 135730,
          "replies": []
        }
      ]
    },
    {
      "id": "ifzxc2y",
      "text": ">“I’m very sorry to have Jesse’s situation damage the conservative movement,” Patrick Rooney, one of the men who claims to have had a sexual relationship with Peterson, told The Daily Beast.\n\nSo this gay man (or whatever he considers himself, man who had sex with another man) is upset that the *conservative movement* is damaged, but he never gave a shit about LGBTQ people, even though he's one of them.  Got it.",
      "timestamp": "2022-07-13 14:47:29",
      "score": 455,
      "num_children": 8,
      "author": 69213,
      "replies": [
        {
          "id": "ig002mk",
          "text": "It's a cult. Really. [Go down the checklist.](https://cultrecovery101.com/cult-recovery-readings/checklist-of-cult-characteristics/)",
          "timestamp": "2022-07-13 15:05:31",
          "score": 193,
          "num_children": 3,
          "author": 362382,
          "replies": [
            {
              "id": "ig0ezcd",
              "text": "Wow. Every single item should have a check mark for them magats. There might even be more:\n\n- cult members will regularly subject themselves to financial or social harm/disenfranchisement while actively paying for it, believing doing so will somehow injure their fabricated out-group.",
              "timestamp": "2022-07-13 16:42:05",
              "score": 70,
              "num_children": 1,
              "author": 256981,
              "replies": [
                {
                  "id": "ig19l2h",
                  "text": "[removed]",
                  "timestamp": "2022-07-13 19:59:05",
                  "score": -7,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ig1ap4e",
                      "text": "Important difference you’re objectively wrong about trying to “both sides” things, here, troll-bait.  Dems don’t have any idol. Most of them don’t even like Biden, either. A cult can’t cult without a leader (and ravenous followers, like… for example, orange shitstain supporters).",
                      "timestamp": "2022-07-13 20:06:17",
                      "score": 11,
                      "num_children": 1,
                      "author": 256981,
                      "replies": [
                        {
                          "id": "ig1b76t",
                          "text": "[removed]",
                          "timestamp": "2022-07-13 20:09:33",
                          "score": -2,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ig1gt5p",
                              "text": "Get help",
                              "timestamp": "2022-07-13 20:45:53",
                              "score": 3,
                              "num_children": 0,
                              "author": 81689,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ig1z7or",
              "text": "Capitalism checks every one of these boxes.",
              "timestamp": "2022-07-13 22:51:51",
              "score": 3,
              "num_children": 1,
              "author": 148728,
              "replies": [
                {
                  "id": "ig2av5c",
                  "text": "Someone is going to get laid in college.",
                  "timestamp": "2022-07-14 00:17:10",
                  "score": 2,
                  "num_children": 0,
                  "author": 362382,
                  "replies": []
                }
              ]
            },
            {
              "id": "ig1eeug",
              "text": "most political groups fit it as well. why? its the best way to get the peasants fighting the fake culture war while they sit in their ivory towers raking in the campaign donations.",
              "timestamp": "2022-07-13 20:30:19",
              "score": -3,
              "num_children": 2,
              "author": 120292,
              "replies": [
                {
                  "id": "ig1h1k5",
                  "text": "No lol but I can see why a teenager on reddit can be brainwashed by right leaning subs to think that way",
                  "timestamp": "2022-07-13 20:47:25",
                  "score": 2,
                  "num_children": 1,
                  "author": 81689,
                  "replies": [
                    {
                      "id": "ig1krnm",
                      "text": "no? the main goal of a political party is to get in office and get more money and votes, just like a cult. conservatives are the most culty but others definitely share similar ideals",
                      "timestamp": "2022-07-13 21:12:05",
                      "score": -3,
                      "num_children": 2,
                      "author": 120292,
                      "replies": [
                        {
                          "id": "ig1qi5m",
                          "text": "While I was reading the literature about cult recruitment and 'human programming', I passed a comment that said: \"It's not a question of whether any group is a cult. The question is more, how culty is the group?\" A group being anything between 2 and 2000+ people. And furthermore, a cult can be described as destructive or constructive - not all cults are destructive. The kind of cult being discussed here is the destructive kind.",
                          "timestamp": "2022-07-13 21:50:52",
                          "score": 2,
                          "num_children": 0,
                          "author": 398622,
                          "replies": []
                        },
                        {
                          "id": "ig2uh2a",
                          "text": "No that’s the main goal of the Republican party",
                          "timestamp": "2022-07-14 02:45:10",
                          "score": 0,
                          "num_children": 1,
                          "author": 81689,
                          "replies": [
                            {
                              "id": "ig2ux8s",
                              "text": "then the goal of the democrats is to be shining beacons of selflessness? you are naïve if you think that. all politicians exist for profit. the republicans are worse than the others but the democrats do it too. for example they pay for the campaigns of bad republican candidates so they get publicity and are stupid so they lose. they take sponsorships in the form of campaign donations in exchange for swaying votes toward a certain company. theyre here for profit, dont let them convince you otherwise. but yes the republicans are way worse.",
                              "timestamp": "2022-07-14 02:48:50",
                              "score": 1,
                              "num_children": 0,
                              "author": 120292,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ig1qxxy",
                  "text": "You're right, but you'll not find much sympathy for that viewpoint here in this echo chamber. Religion, politics, and even sports or gaming to an extent have the ability to bring about some of the worst of humanity. What they all have in common is tribalism. Us vs Them. Not everyone is so wrapped up in these things that it negatively affects their lives. Maybe not even most. But for many people it can. \n\nPeople like to feel like they belong. It's why they join groups. Generally made up of like-minded people. These groups create an echo-chamber for themselves and make themselves believe that anybody not on their side is the Devil, Nazis/Commies, bad people, etc. People in these groups are willing to stretch the truth, use hyperbole, or even outright fabricate things to prove their opponents wrong. Even knowing what they are doing, they will feel themselves justified. Because \"fuck those people over there! They think (insert opposing belief)!\" \"They must be stupid/brainwashed/evil/etc!\"\n\nTake this subreddit for example. It doesn't even make sense to have a forum based on the idea that we don't believe something. This sub is full of edgelord teens who are pissed off at all Christians for something the minority are responsible for. I've seen some pretty fucked up shit in this sub over the years. I'm an atheist too, but I'm not gonna hate someone for believing something that I don't. Don't none of us know shit, especially whether there is a God or not. The logical position is to just say you don't know. Because we don't. None of us do. So here we are, a group of people that don't know something who are violently opposed to another group of people that also don't know something, except they think they do. Not because they are dumb or hateful, but for a variety of reasons likely out of their control. It could have been any one of us. Smart people are not immune to being misled by religion and someone who is an atheist isn't automatically intelligent. But most people in here think they are. And as a result feel superior to anyone who isn't part of their group. \n\nI mean, I've been guilty of the same shit, but I'm not gonna pretend I haven't. We're still just a bunch of violent apes. Always have been.",
                  "timestamp": "2022-07-13 21:53:51",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ig2bild",
                      "text": "[removed]",
                      "timestamp": "2022-07-14 00:21:56",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ig2o0au",
                          "text": "[removed]",
                          "timestamp": "2022-07-14 01:54:52",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ig2y4e6",
                              "text": "[removed]",
                              "timestamp": "2022-07-14 03:15:05",
                              "score": -1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "ig30iqs",
                                  "text": "[removed]",
                                  "timestamp": "2022-07-14 03:35:08",
                                  "score": 1,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "ig4oxn7",
                                      "text": "[removed]",
                                      "timestamp": "2022-07-14 14:15:23",
                                      "score": 1,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "ig6vu26",
                                          "text": "[removed]",
                                          "timestamp": "2022-07-14 22:46:40",
                                          "score": 0,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "ig7dxe7",
                                              "text": "[removed]",
                                              "timestamp": "2022-07-15 01:02:30",
                                              "score": 1,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "ig7gwl1",
                                                  "text": "[removed]",
                                                  "timestamp": "2022-07-15 01:25:35",
                                                  "score": 0,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "ig7i5m5",
                                                      "text": "[removed]",
                                                      "timestamp": "2022-07-15 01:35:13",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "ig7j0ja",
                                                          "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for using abusive language, personal attacks, being a dick, or fighting with other users. These activities are against the [rules](https://www.reddit.com/r/atheism/wiki/guidelines).   \r\nConnected comments may also be removed for the same reason, though editing out the direct attack may merit your comment being restored.  Users who don't cease this behavior may get banned temporarily or permanently.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                                                          "timestamp": "2022-07-15 01:41:48",
                                                          "score": 1,
                                                          "num_children": 0,
                                                          "author": 122319,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ig0bc7t",
          "text": "He's not gay. He just suffers from same sex attraction and blows men from time to time.",
          "timestamp": "2022-07-13 16:18:50",
          "score": 25,
          "num_children": 1,
          "author": 257007,
          "replies": [
            {
              "id": "ig100zg",
              "text": "Ted Haggard called himself “heterosexual with homosexual attachments”\nWhich as far as I can tell means “gayer than christmas”",
              "timestamp": "2022-07-13 18:57:26",
              "score": 11,
              "num_children": 0,
              "author": 322718,
              "replies": []
            }
          ]
        },
        {
          "id": "ig02lri",
          "text": "yeah and the log cabin republicans are still log cabin republicans, despite the party is basically calling them sub human.\n\nOn that front, it really shows the need for ranked choice, so you could get a conservative party that doesnt give a flying fuck about social issues.",
          "timestamp": "2022-07-13 15:22:14",
          "score": 60,
          "num_children": 2,
          "author": 220399,
          "replies": [
            {
              "id": "ig03g7k",
              "text": "> log cabin republicans\n\nUgh, groups like this are just so so sad. Literally lambs voting for wolves.",
              "timestamp": "2022-07-13 15:27:48",
              "score": 39,
              "num_children": 3,
              "author": 328535,
              "replies": [
                {
                  "id": "ig05moz",
                  "text": "Wolf: I am going to eat you.\nSheep: wow he really tells it like it is!",
                  "timestamp": "2022-07-13 15:42:05",
                  "score": 36,
                  "num_children": 0,
                  "author": 412083,
                  "replies": []
                },
                {
                  "id": "ig0zlaa",
                  "text": "Jews for hitler",
                  "timestamp": "2022-07-13 18:54:38",
                  "score": 5,
                  "num_children": 1,
                  "author": 322718,
                  "replies": [
                    {
                      "id": "ig4rxhd",
                      "text": "[Unironically happened tho](https://en.m.wikipedia.org/wiki/Association_of_German_National_Jews)",
                      "timestamp": "2022-07-14 14:35:41",
                      "score": 2,
                      "num_children": 1,
                      "author": 339869,
                      "replies": [
                        {
                          "id": "ig56ngn",
                          "text": "WTF",
                          "timestamp": "2022-07-14 16:10:23",
                          "score": 1,
                          "num_children": 1,
                          "author": 322718,
                          "replies": [
                            {
                              "id": "ig577ys",
                              "text": "You learn something new every day",
                              "timestamp": "2022-07-14 16:14:04",
                              "score": 2,
                              "num_children": 1,
                              "author": 339869,
                              "replies": [
                                {
                                  "id": "ig57cmt",
                                  "text": "Isn’t that the truth",
                                  "timestamp": "2022-07-14 16:14:54",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 322718,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ig0mryd",
                  "text": "How many people in the USA are log cabin republicans? It’s got to be a insignificant number of people right?\n\nWho the fuck is downvoting this without replying? It’s a legitimate question.",
                  "timestamp": "2022-07-13 17:31:44",
                  "score": -2,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "ig07y03",
              "text": "My former buddy  is a gay conservative.  It eventually became apparent that all he cares about was his wallet. Boy loved weed too at a time where conservatives were actively keeping it illegal. \n\nHaving conversations with him was insufferable,  he was a white straight passing man with lots of money and his perspective was that all the issues people had were overblown. He couldn't get past his own greed or preconceptions.  \n\nI remember one time his boyfriend talking about getting beaten down by the police for being gay and he just refused to accept it transpired the way his boyfriend claimed it did.\n\nWe are no longer friends.",
              "timestamp": "2022-07-13 15:57:01",
              "score": 82,
              "num_children": 2,
              "author": 198393,
              "replies": [
                {
                  "id": "ig0bzju",
                  "text": "Conservative LGBT people are a special type of fool.",
                  "timestamp": "2022-07-13 16:22:58",
                  "score": 56,
                  "num_children": 2,
                  "author": 286899,
                  "replies": [
                    {
                      "id": "ig0d218",
                      "text": "I wonder which is worse, gay Republicans, black Republicans, or poor Republicans?",
                      "timestamp": "2022-07-13 16:29:52",
                      "score": 33,
                      "num_children": 3,
                      "author": 69213,
                      "replies": [
                        {
                          "id": "ig0f7vo",
                          "text": "[How about black gay Republicans?](https://i.imgur.com/PCxt5oP.jpg)",
                          "timestamp": "2022-07-13 16:43:35",
                          "score": 26,
                          "num_children": 2,
                          "author": 5654,
                          "replies": [
                            {
                              "id": "ig0ziu5",
                              "text": "Who are poor",
                              "timestamp": "2022-07-13 18:54:11",
                              "score": 1,
                              "num_children": 0,
                              "author": 322718,
                              "replies": []
                            },
                            {
                              "id": "ig2l2ac",
                              "text": "Or [Gay Black Republicans](https://www.gayblackrepublican.com/)?",
                              "timestamp": "2022-07-14 01:32:38",
                              "score": 1,
                              "num_children": 0,
                              "author": 13225,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ig0higq",
                          "text": "Don't forget all the fucking pro-Trump latinos. That was wild to see.",
                          "timestamp": "2022-07-13 16:58:00",
                          "score": 18,
                          "num_children": 0,
                          "author": 410001,
                          "replies": []
                        },
                        {
                          "id": "ig0ttfp",
                          "text": "I'd almost see the first 2 as a defense mechanism to avoid being shunned in heavily regressive areas. The last one makes zero fucking sense until you realize that lack of education makes it easy to fool them into thinking conservatives care about the poor.",
                          "timestamp": "2022-07-13 18:17:18",
                          "score": 4,
                          "num_children": 0,
                          "author": 327864,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ig336ib",
                      "text": "I can't never understand how can you support people that hate your very existence?",
                      "timestamp": "2022-07-14 03:58:19",
                      "score": 1,
                      "num_children": 0,
                      "author": 330390,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ig1f48s",
                  "text": "I know someone like this. He made a habit of shitting on carpet and then jumping out of the window. He would then claim to get “canceled”.",
                  "timestamp": "2022-07-13 20:34:52",
                  "score": 1,
                  "num_children": 0,
                  "author": 263452,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ig04dnz",
          "text": "Well you have to be pretty fucked in the head to have a relationship with this guy in the first place, so no surprise there.",
          "timestamp": "2022-07-13 15:33:54",
          "score": 10,
          "num_children": 0,
          "author": 335275,
          "replies": []
        },
        {
          "id": "ig0z704",
          "text": "They deserve each other, they really do.",
          "timestamp": "2022-07-13 18:52:04",
          "score": 2,
          "num_children": 0,
          "author": 322718,
          "replies": []
        },
        {
          "id": "ig1evj0",
          "text": "Yeah their gay dudes who will fuck anyone even if they are against their best interests. They are damaged.",
          "timestamp": "2022-07-13 20:33:17",
          "score": 1,
          "num_children": 0,
          "author": 263452,
          "replies": []
        },
        {
          "id": "ig3wwy5",
          "text": "This man is an utter idiot. He hates women, he hates homosexuals, he hates \"betas\", he hates black people, he brags about sleeping with women - watch his show. Preferably his debate with Destiny.",
          "timestamp": "2022-07-14 09:57:23",
          "score": 1,
          "num_children": 0,
          "author": 402129,
          "replies": []
        },
        {
          "id": "ig49ic0",
          "text": "Very similar to your regular conservatives being against their own interests because the RNC is a rich man’s game… but their strategy is having uneducated people who go against their own interest and still think that the other teams the enemy. \n\nIt is so ironic and sad that these gay people are so afraid of being themselves that they become anti- the very thing that they are…",
          "timestamp": "2022-07-14 12:16:31",
          "score": 1,
          "num_children": 0,
          "author": 231544,
          "replies": []
        }
      ]
    },
    {
      "id": "ig0298u",
      "text": "*\"I've never witnessed this level of extreme hypocrisy and fraud before.\"*\n\nlol, has he never met a Christian conservative before?",
      "timestamp": "2022-07-13 15:19:59",
      "score": 221,
      "num_children": 2,
      "replies": [
        {
          "id": "ig02xya",
          "text": "\"Never huh?\" https://www.pinknews.co.uk/2016/12/12/11-anti-gay-preachers-who-got-caught-doing-very-gay-things/",
          "timestamp": "2022-07-13 15:24:27",
          "score": 50,
          "num_children": 1,
          "author": 117993,
          "replies": [
            {
              "id": "ig164n1",
              "text": "Time to reset the counter. \n\nhttps://gayhomophobe.com/",
              "timestamp": "2022-07-13 19:36:39",
              "score": 9,
              "num_children": 0,
              "author": 376584,
              "replies": []
            }
          ]
        },
        {
          "id": "ig15gm4",
          "text": "Welcome to Theocratic Fascism. Franco after The Spanish Civil War (it was a religious war - atheists lost the war).\n\nWhich is why the Catholic Church in Spain walks on eggshells, not like in America.\n\nThey don't have it easy at all. One million deaths (+100k \"dissappeared\" after the war was over), with people still alive who remembers that hell. We have a saying: Spain is Catholic and Anti Church. Bathmouthing priests and the Church can be considered a national sport.",
          "timestamp": "2022-07-13 19:32:22",
          "score": 4,
          "num_children": 1,
          "author": 246285,
          "replies": [
            {
              "id": "ig1c2g3",
              "text": "I know a little bit about Franco and the Spanish civil war along the lines of communist vs fascists but I did not know about it being a religious war.\n\nThough I am not surprised the Catholics threw their lot in with fascists they always seem to be ok with fascists because they know they are unlikely to truly go at them.",
              "timestamp": "2022-07-13 20:15:10",
              "score": 1,
              "num_children": 1,
              "author": 345597,
              "replies": [
                {
                  "id": "ig1dgjt",
                  "text": "Religion is fascism with fanfic about a bearded man in the sky",
                  "timestamp": "2022-07-13 20:24:08",
                  "score": 4,
                  "num_children": 0,
                  "author": 82959,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ifzt9nz",
      "text": "Wow, who would have thought semen in the latte guy was gay? /s",
      "timestamp": "2022-07-13 14:20:11",
      "score": 48,
      "num_children": 2,
      "author": 158365,
      "replies": [
        {
          "id": "ifztl7c",
          "text": "Wait I got this guy mixed up with manning. Peterson is still crazy.",
          "timestamp": "2022-07-13 14:22:22",
          "score": 20,
          "num_children": 1,
          "author": 158365,
          "replies": [
            {
              "id": "ig0rl9g",
              "text": "How does it feel to be in love with Timmy-Boo?",
              "timestamp": "2022-07-13 18:02:40",
              "score": -5,
              "num_children": 1,
              "author": 178858,
              "replies": [
                {
                  "id": "ig0tea3",
                  "text": "Huh?",
                  "timestamp": "2022-07-13 18:14:32",
                  "score": 2,
                  "num_children": 0,
                  "author": 158365,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ig3u123",
          "text": "Wait wat",
          "timestamp": "2022-07-14 09:18:15",
          "score": 1,
          "num_children": 0,
          "author": 169872,
          "replies": []
        }
      ]
    },
    {
      "id": "ifzvcfi",
      "text": "There is literally no way anyone could argue he isn't homosexual or at least bisexual (I've only heard men report to have had sexually explicit experiences with him). Not even the most God-obeying Christians could deny this.",
      "timestamp": "2022-07-13 14:34:23",
      "score": 42,
      "num_children": 2,
      "author": 381387,
      "replies": [
        {
          "id": "ig2zjqr",
          "text": "He basically believes gay people are bad because of religion and that they are \"degenerates\" that provide \"temptation\". The way he talks about it in general is just very telling. It's like he very clearly has gay attraction and tendencies and blames gay men for these things. He seems to believe that this is true for EVERY man and doesn't quite grasp that straight men don't have these attractions or temptations for other men. I honestly believe he's too fucking stupid to understand that he's some level of bisexual but honestly don't really even care because of how obvious his grift is and how vile the shit he stands for is. I refuse to believe conservatives even take him seriously as I could argue any position he has better than he can despite his positions being dog shit. He's like one big running joke that got too popular to shut down and now everyone that liked him ironically is stuck following him unironically. AMAZIN.",
          "timestamp": "2022-07-14 03:26:53",
          "score": 10,
          "num_children": 0,
          "author": 110801,
          "replies": []
        },
        {
          "id": "ig41ah7",
          "text": "When Cawthorn's video was leaked, he said \"We were young, _we were just having fun._\"",
          "timestamp": "2022-07-14 10:52:36",
          "score": 1,
          "num_children": 0,
          "author": 78505,
          "replies": []
        }
      ]
    },
    {
      "id": "ifzypui",
      "text": "Still he's a horrible person",
      "timestamp": "2022-07-13 14:56:35",
      "score": 40,
      "num_children": 1,
      "author": 361177,
      "replies": [
        {
          "id": "ig01us7",
          "text": "Dreadful human being.",
          "timestamp": "2022-07-13 15:17:19",
          "score": 13,
          "num_children": 0,
          "author": 402234,
          "replies": []
        }
      ]
    },
    {
      "id": "ifzya5o",
      "text": "\"Shocking.\"  \"Hard to believe.\" \"What?!\"  \"Never.\"  Said absolutely no one.",
      "timestamp": "2022-07-13 14:53:41",
      "score": 36,
      "num_children": 0,
      "author": 411700,
      "replies": []
    },
    {
      "id": "ifzvxud",
      "text": "This is so commonplace it isn't even surprising anymore.  How many  homophobic \"christian pastors\" need to be caught banging dudes before it is accepted that most of them are in fact homosexuals in hiding?",
      "timestamp": "2022-07-13 14:38:21",
      "score": 80,
      "num_children": 2,
      "author": 33301,
      "replies": [
        {
          "id": "ig054g2",
          "text": "Well I think this is one of those glaring issues of religions that promote internalized guilt and self-hatred.",
          "timestamp": "2022-07-13 15:38:47",
          "score": 24,
          "num_children": 0,
          "author": 28320,
          "replies": []
        },
        {
          "id": "ig06t3u",
          "text": "I’m straight and couldn’t care less who other people are attracted to. \n\nThese gay homophobes fit into one of two categories:\n\n * they’re jealous of the openly gay people because for whatever reason they think they can’t live an openly gay life (true in a lot of cases)\n\n * they think all people are tempted by homosexuality and the openly gay people are “weak” for not resisting the temptation, and then of course have “relapses” themselves\n\nOr a mix of the two. Why would an actual straight person concern themselves with this?",
          "timestamp": "2022-07-13 15:49:46",
          "score": 27,
          "num_children": 3,
          "author": 387695,
          "replies": [
            {
              "id": "ig1a6gh",
              "text": "They have to \"BELIEVE\" that sexual orientation is a choice, because they are attracted to the same sex and they chose to be hetero, so obviously all other people do the same. They can't be living a lie, denying who they really are for reasons...it's everyone else who could do the same but doesn't who is wrong.",
              "timestamp": "2022-07-13 20:02:55",
              "score": 11,
              "num_children": 1,
              "author": 33301,
              "replies": [
                {
                  "id": "ig287n2",
                  "text": "This is something that always really bothered me about the 'born this way' movement of progressing lgbt rights. Like I understand that most, if not all are born that way, but why should that even matter? Outside of explicitly religious dogmatism, why should it matter if someone chooses to be gay or not? Why is that not a valid lifestyle 'choice' people should be allowed to make in the first place?\n\nCeding the argument towards being an innate trait, something people are born as.. IMO opens up the gateway towards people wanting to prove a biological disposition, or a 'gay' gene or whatever, and to me that has way scarier implications. If it was proven that homosexuality had genetic markers, then the worst anti-gay crusaders could actively seek out those people with those markers for active oppression or genocide. If 23andMe could flag people who were gay, the wrong people in control of government having access to that data is about as worst case a scenario as you could get. \n\nJust let people live however they want as long as they're not hurting anyone else. Whether or not certain lifestyles are a choice or not shouldn't matter, let people choose.",
                  "timestamp": "2022-07-13 23:57:29",
                  "score": 1,
                  "num_children": 2,
                  "author": 261769,
                  "replies": [
                    {
                      "id": "ig2rute",
                      "text": "You're right, but smaller steps were required at an earlier point in history to help people understand",
                      "timestamp": "2022-07-14 02:24:27",
                      "score": 1,
                      "num_children": 0,
                      "author": 53916,
                      "replies": []
                    },
                    {
                      "id": "ig5tarh",
                      "text": "Religion is about control ,  fitting into your tribe affects EVERYONE as it is innate to being human.  Unfortunately, the majority of religions force people to choose to fit in or lose a huge social aspect of their life.",
                      "timestamp": "2022-07-14 18:33:36",
                      "score": 1,
                      "num_children": 0,
                      "author": 33301,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ig27ama",
              "text": "I'm like 98% sure my dad is the type of gay homophobe in the 2nd group. Literally thinks all men have gay urges.\n\nI felt bad like an hour but then stopped because he's so fucking dumb. Being gay doesn't give some excuse to be a piece of shit\n\nEven if he was \"right\" and all men have an innate powerful urge to fuck other men, that clearly means it would be NATURAL...",
              "timestamp": "2022-07-13 23:50:38",
              "score": 5,
              "num_children": 1,
              "author": 236654,
              "replies": [
                {
                  "id": "ig29pch",
                  "text": "Sorry about your dad, I'm sure it's rough battling your \"morals\" with your desires.  This became clear to me when I was listening to that congressman that got busted soliciting gay sex at an airport.  He kept saying he wasn't gay, but that the temptation is strong and he has urges and shit like that, thinking every straight person has to go through this battle.  When in reality the guy is just gay.",
                  "timestamp": "2022-07-14 00:08:32",
                  "score": 2,
                  "num_children": 0,
                  "author": 387695,
                  "replies": []
                }
              ]
            },
            {
              "id": "ig4oiw5",
              "text": "While studies do show homophobes are *slightly* more likely to experience same sex attraction, the vast majority of homophobes are still just straight people. I don't know why a straight person would care about this—I guess for the same reason they care what a woman does with her own body, or whether someone smokes a harmless plant in their own home, and why they completely flip out over stuff like the green M&M character having slightly lower heels than she used to or people saying \"Happy Holidays.\" The whole deal with conservatism is getting outraged over completely harmless stuff there's no reason for them to even care about since it doesn't affect them.",
              "timestamp": "2022-07-14 14:12:32",
              "score": 1,
              "num_children": 0,
              "author": 173477,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ig035vp",
      "text": "https://gayhomophobe.com/ hasn't been updated lately 😔",
      "timestamp": "2022-07-13 15:25:55",
      "score": 26,
      "num_children": 0,
      "author": 123899,
      "replies": []
    },
    {
      "id": "ifzymh2",
      "text": "I am zero percent surprised",
      "timestamp": "2022-07-13 14:55:58",
      "score": 16,
      "num_children": 0,
      "author": 26032,
      "replies": []
    },
    {
      "id": "ig00cdq",
      "text": "As famed philosopher Philip J. Fry once opined, I am shocked. Shocked! Well not that shocked.",
      "timestamp": "2022-07-13 15:07:19",
      "score": 15,
      "num_children": 0,
      "author": 173169,
      "replies": []
    },
    {
      "id": "ig030j6",
      "text": "JLP is so performatively masculine that it's no wonder he's actually gay. His protegee, Hake, is so insanely misogynist and also performatively masculine that I suspect a similar trend.",
      "timestamp": "2022-07-13 15:24:56",
      "score": 16,
      "num_children": 2,
      "author": 74392,
      "replies": [
        {
          "id": "ig04bdz",
          "text": "Bet they're butt buddies, literally.",
          "timestamp": "2022-07-13 15:33:29",
          "score": 9,
          "num_children": 3,
          "author": 178636,
          "replies": [
            {
              "id": "ig1wfpt",
              "text": "they are. they live in the same mansion and onr man who lived with them for a period of time said that he once saw JLP and hake giggling as jlp rolled hake up in bedsheets \"like a burrito\" and then kissed his forehead. thats so cute it almost makes me forget about the harm they've both caused.",
              "timestamp": "2022-07-13 22:32:07",
              "score": 7,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ig0ctiv",
              "text": "I wasn't gonna say it but...yeeaaahh",
              "timestamp": "2022-07-13 16:28:20",
              "score": 5,
              "num_children": 0,
              "author": 74392,
              "replies": []
            },
            {
              "id": "ig0pr4b",
              "text": "Is there  a figurative version of butt buddies?",
              "timestamp": "2022-07-13 17:50:45",
              "score": 2,
              "num_children": 0,
              "author": 174315,
              "replies": []
            }
          ]
        },
        {
          "id": "ig292bg",
          "text": "I'm sorry I already knew who Peterson is but I've just wasted 5 minutes listening to \"Hake\". In short he's a fucking idiot. Don't waste your time like I did.\n\nHake is also a type of fish so now I'm guessing he's a gay fish...",
          "timestamp": "2022-07-14 00:03:53",
          "score": 2,
          "num_children": 1,
          "author": 53569,
          "replies": [
            {
              "id": "ig2b2c6",
              "text": "I saw his debate with vaush anf i have to agree with his conclusion. If hake isn't what he says he is then he's asexual.",
              "timestamp": "2022-07-14 00:18:39",
              "score": 2,
              "num_children": 1,
              "author": 362507,
              "replies": [
                {
                  "id": "ig4dx4o",
                  "text": "Same, my only exposure to Hake is through Vaush...I can't believe I even sat through their whole debate. Hake's beliefs were far worse than I expected them to be.",
                  "timestamp": "2022-07-14 12:52:59",
                  "score": 1,
                  "num_children": 0,
                  "author": 74392,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ig04yi6",
      "text": "\"for republican accusation is confession\"",
      "timestamp": "2022-07-13 15:37:42",
      "score": 14,
      "num_children": 0,
      "author": 373143,
      "replies": []
    },
    {
      "id": "ig09d3j",
      "text": "Is this the dude that screams \"BETA\"",
      "timestamp": "2022-07-13 16:06:14",
      "score": 15,
      "num_children": 1,
      "author": 102608,
      "replies": [
        {
          "id": "ig0mlig",
          "text": "you know it",
          "timestamp": "2022-07-13 17:30:35",
          "score": 9,
          "num_children": 0,
          "author": 44794,
          "replies": []
        }
      ]
    },
    {
      "id": "ig03hfx",
      "text": "Amazin'",
      "timestamp": "2022-07-13 15:28:02",
      "score": 13,
      "num_children": 0,
      "author": 135395,
      "replies": []
    },
    {
      "id": "ig03cwj",
      "text": "HAHAHAHA!   \nI knew he was a fraud the very first time I saw him.",
      "timestamp": "2022-07-13 15:27:12",
      "score": 10,
      "num_children": 0,
      "author": 399665,
      "replies": []
    },
    {
      "id": "ig09jtp",
      "text": "Has anyone actually watch this guy? Forgive me for saying this, but he seems borderline special needs. He can’t form proper sentences, his grammar is horrible and nothing he says is well thought out. It’s pitiful to watch.",
      "timestamp": "2022-07-13 16:07:25",
      "score": 10,
      "num_children": 0,
      "author": 317024,
      "replies": []
    },
    {
      "id": "ifztzvl",
      "text": "He’s the most obvious closeted gay guy I have ever seen.",
      "timestamp": "2022-07-13 14:25:12",
      "score": 31,
      "num_children": 2,
      "author": 356829,
      "replies": [
        {
          "id": "ifzykmg",
          "text": "Gestures to Lindsey Graham",
          "timestamp": "2022-07-13 14:55:38",
          "score": 40,
          "num_children": 3,
          "author": 361177,
          "replies": [
            {
              "id": "ig17itu",
              "text": "Why I never! Such accusations against his person will surely give him the vapors! Quickly! Someone fetch him his fainting couch!",
              "timestamp": "2022-07-13 19:45:41",
              "score": 7,
              "num_children": 0,
              "author": 242795,
              "replies": []
            },
            {
              "id": "ig4ijfj",
              "text": "Lady G for the win!",
              "timestamp": "2022-07-14 13:28:57",
              "score": 2,
              "num_children": 0,
              "author": 7187,
              "replies": []
            },
            {
              "id": "ig29kak",
              "text": "You mean Lady G.",
              "timestamp": "2022-07-14 00:07:29",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "ig0ebq5",
          "text": "The way he ask questions about homosexuality and the actual questions he asks about it make it so obvious",
          "timestamp": "2022-07-13 16:37:55",
          "score": 7,
          "num_children": 0,
          "author": 1872,
          "replies": []
        }
      ]
    },
    {
      "id": "ig02m1r",
      "text": "Misygonistic homophobic religious nut jub is also a hypocrite. Color me \"not surprised\".\n\nI'd also never heard the term \"manosphere\" before, but that sounds like an awful place to inhabit.",
      "timestamp": "2022-07-13 15:22:17",
      "score": 9,
      "num_children": 0,
      "author": 262773,
      "replies": []
    },
    {
      "id": "ig04zi9",
      "text": "Have you heard of Ted Haggard? There's a documentary about him called The Trials of Ted Haggard.",
      "timestamp": "2022-07-13 15:37:53",
      "score": 9,
      "num_children": 1,
      "author": 141930,
      "replies": [
        {
          "id": "ig23p98",
          "text": "Is it worth watching?",
          "timestamp": "2022-07-13 23:24:22",
          "score": 1,
          "num_children": 1,
          "author": 359108,
          "replies": [
            {
              "id": "ig3abwb",
              "text": "I would say so. My favorite part is when he's talking about his prospects applying for a major company and thinking they won't have heard of him, but if they do an internet search, then yeah, he probably won't get the job.",
              "timestamp": "2022-07-14 05:07:36",
              "score": 3,
              "num_children": 0,
              "author": 141930,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ig0053u",
      "text": "who could've *possibly* seen that coming",
      "timestamp": "2022-07-13 15:05:58",
      "score": 6,
      "num_children": 0,
      "author": 391812,
      "replies": []
    },
    {
      "id": "ig0087c",
      "text": "Yet another case of heavy projection from a right-winger. I'm not surprised by that at all.",
      "timestamp": "2022-07-13 15:06:33",
      "score": 7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig0ay6e",
      "text": "Amazing!",
      "timestamp": "2022-07-13 16:16:21",
      "score": 7,
      "num_children": 1,
      "author": 224208,
      "replies": [
        {
          "id": "ig0mwua",
          "text": "Not as much amazing as expected.  We have seen this same story many times before.",
          "timestamp": "2022-07-13 17:32:36",
          "score": 1,
          "num_children": 0,
          "author": 122319,
          "replies": []
        }
      ]
    },
    {
      "id": "ig0eog5",
      "text": "BETA!!",
      "timestamp": "2022-07-13 16:40:11",
      "score": 6,
      "num_children": 0,
      "author": 379208,
      "replies": []
    },
    {
      "id": "ifzuof5",
      "text": "\\*shocked face\\*",
      "timestamp": "2022-07-13 14:29:49",
      "score": 6,
      "num_children": 0,
      "author": 150884,
      "replies": []
    },
    {
      "id": "ifzz4ka",
      "text": "Hahaha. Love this",
      "timestamp": "2022-07-13 14:59:17",
      "score": 5,
      "num_children": 0,
      "author": 293159,
      "replies": []
    },
    {
      "id": "ig0276l",
      "text": "That's their strategy. Scream your homophobic remarks from the hilltops and nobody will suspect that you are hiding in your closet too terrified to open the door and come out to the world.",
      "timestamp": "2022-07-13 15:19:36",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig02nu2",
      "text": "Just another CCDC.\n\nCrazy Christian Death Cult",
      "timestamp": "2022-07-13 15:22:36",
      "score": 8,
      "num_children": 0,
      "author": 152718,
      "replies": []
    },
    {
      "id": "ig03d0h",
      "text": "Oh look, another publicly outspoken homophobe has a gay closet. Anyone keeping count?",
      "timestamp": "2022-07-13 15:27:13",
      "score": 6,
      "num_children": 1,
      "author": 222407,
      "replies": [
        {
          "id": "ig04cum",
          "text": "Lost count a decade ago.",
          "timestamp": "2022-07-13 15:33:45",
          "score": 2,
          "num_children": 1,
          "author": 95839,
          "replies": [
            {
              "id": "ig058dz",
              "text": "There are far too many of them, that's for sure. They're awful people.",
              "timestamp": "2022-07-13 15:39:32",
              "score": 3,
              "num_children": 0,
              "author": 222407,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ig08hlu",
      "text": "Hang on, let me put on my shocked face.",
      "timestamp": "2022-07-13 16:00:34",
      "score": 6,
      "num_children": 0,
      "author": 150369,
      "replies": []
    },
    {
      "id": "ig0dgiy",
      "text": "Beta",
      "timestamp": "2022-07-13 16:32:25",
      "score": 6,
      "num_children": 0,
      "author": 394364,
      "replies": []
    },
    {
      "id": "ig0esyh",
      "text": "I am not surprised to hear it at all, he is obsessed with \"alpha males\" vs \"beta males\".\n\nIf you ever heard him speak, you would know he is one of the dumbest people that exist on this planet. He is so full of shit that even dung beetles stay away from him because they can't handle the madness.",
      "timestamp": "2022-07-13 16:40:58",
      "score": 5,
      "num_children": 0,
      "author": 395673,
      "replies": []
    },
    {
      "id": "ig0fp8l",
      "text": "Like Ted Haggard, [he's completely heterosexual](https://youtu.be/HZmHC75FDqQ)",
      "timestamp": "2022-07-13 16:46:38",
      "score": 5,
      "num_children": 1,
      "author": 330287,
      "replies": [
        {
          "id": "ig1kdfr",
          "text": "Thanks for this link. I’m now a subscriber to Roy’s YT channel!! 🥰",
          "timestamp": "2022-07-13 21:09:27",
          "score": 2,
          "num_children": 0,
          "author": 222815,
          "replies": []
        }
      ]
    },
    {
      "id": "ifzywbk",
      "text": "I'm confident every single vocal anti gay xtian \"evangelist\" *loves* the cock",
      "timestamp": "2022-07-13 14:57:45",
      "score": 23,
      "num_children": 3,
      "author": 306309,
      "replies": [
        {
          "id": "ig04w2j",
          "text": "There recently was a catholic seminary for trainee priests in Ireland where every student had a grinder account.",
          "timestamp": "2022-07-13 15:37:16",
          "score": 11,
          "num_children": 2,
          "author": 95839,
          "replies": [
            {
              "id": "ig059li",
              "text": "Hahahahaha\n\nThat's convenient - just need to walk down the hall - not even an Uber ride away.",
              "timestamp": "2022-07-13 15:39:45",
              "score": 5,
              "num_children": 0,
              "author": 306309,
              "replies": []
            },
            {
              "id": "ig1n4ou",
              "text": "Isn't Ireland pretty tolerant of gays recently? Why are so many gays going into seminary?",
              "timestamp": "2022-07-13 21:27:55",
              "score": 1,
              "num_children": 1,
              "author": 124857,
              "replies": [
                {
                  "id": "ig3d96f",
                  "text": "The people of Ireland are but the catholic church is still.......lets say traditional",
                  "timestamp": "2022-07-14 05:39:38",
                  "score": 1,
                  "num_children": 0,
                  "author": 95839,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ig18foo",
          "text": "not that there's anything wrong with that",
          "timestamp": "2022-07-13 19:51:36",
          "score": 2,
          "num_children": 1,
          "author": 242795,
          "replies": [
            {
              "id": "ig1sgox",
              "text": "I miss that show",
              "timestamp": "2022-07-13 22:04:14",
              "score": 1,
              "num_children": 0,
              "author": 306309,
              "replies": []
            }
          ]
        },
        {
          "id": "ig0o95w",
          "text": "It's a pretty safe assumption. Most people wouldn't care enough to get so worked up... however, if your entire life you've been taught being gay is horrible, subhuman, a sin against God and you're very religious... having those wants and urges can manifest itself in a lashing out at those creating those thoughts and feelings.",
          "timestamp": "2022-07-13 17:41:10",
          "score": 4,
          "num_children": 1,
          "author": 241673,
          "replies": [
            {
              "id": "ig0ormu",
              "text": "I'm more cynical about it. I just expect they're condemning the LGBT community because it's a sure way to extract tithes from bigoted idiots.",
              "timestamp": "2022-07-13 17:44:25",
              "score": 3,
              "num_children": 0,
              "author": 306309,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ifzxtfd",
      "text": "The greater hypocrisy and betrayal is being a black Christian pastor, is he a Klan member too? FFS",
      "timestamp": "2022-07-13 14:50:37",
      "score": 11,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig00hi8",
      "text": "Right on par. And the rest of the right wing lunatics won't even acknowledge this.",
      "timestamp": "2022-07-13 15:08:15",
      "score": 5,
      "num_children": 0,
      "author": 347473,
      "replies": []
    },
    {
      "id": "ig01967",
      "text": "He sounds like a very sad man who hates himself quite a lot. Is he also in the Klan?",
      "timestamp": "2022-07-13 15:13:21",
      "score": 4,
      "num_children": 1,
      "author": 409644,
      "replies": [
        {
          "id": "ig1sgjh",
          "text": "So hes the real life clayton bigsby... But not blind?",
          "timestamp": "2022-07-13 22:04:12",
          "score": 1,
          "num_children": 0,
          "author": 19273,
          "replies": []
        }
      ]
    },
    {
      "id": "ig03m52",
      "text": "> \"I've never witnessed this level of extreme hypocrisy and fraud before.\"\n\nExcept every other time this has happened over and over again by many \"religious leaders\" over the years.",
      "timestamp": "2022-07-13 15:28:54",
      "score": 4,
      "num_children": 0,
      "author": 195013,
      "replies": []
    },
    {
      "id": "ig03rom",
      "text": ">\"I've never witnessed this level of extreme hypocrisy and fraud before.\"\n\nThen you haven't been paying attention.",
      "timestamp": "2022-07-13 15:29:54",
      "score": 4,
      "num_children": 0,
      "author": 198532,
      "replies": []
    },
    {
      "id": "ig061rx",
      "text": "One of these days, a preacher like this is gonna get killed or beaten within an inch of his life by the audience he whipped into a fervor.   \n\n\nAnd on that day, I'm probably going to get banned from social media because of the offensive joke and overt joy I express.",
      "timestamp": "2022-07-13 15:44:49",
      "score": 4,
      "num_children": 1,
      "author": 66004,
      "replies": [
        {
          "id": "ig09ch6",
          "text": "Replace \"preacher\" and \"audience\" with \"teacher\" and \"parents\".",
          "timestamp": "2022-07-13 16:06:07",
          "score": 2,
          "num_children": 0,
          "author": 38160,
          "replies": []
        }
      ]
    },
    {
      "id": "ig0cv0v",
      "text": "\"If I condemn homosexuality loud enough, no one will ever suspect I'm gay, too.\" ~ Every homophobe ever",
      "timestamp": "2022-07-13 16:28:37",
      "score": 4,
      "num_children": 0,
      "author": 113992,
      "replies": []
    },
    {
      "id": "ig0fidj",
      "text": "So it really is all projection? I mean, we half joke about it all the time, but it *really is* all projection.",
      "timestamp": "2022-07-13 16:45:26",
      "score": 4,
      "num_children": 0,
      "author": 199678,
      "replies": []
    },
    {
      "id": "ig0iiyi",
      "text": "Amazin’",
      "timestamp": "2022-07-13 17:04:27",
      "score": 4,
      "num_children": 0,
      "author": 322380,
      "replies": []
    },
    {
      "id": "ig0jgtt",
      "text": "What a beta",
      "timestamp": "2022-07-13 17:10:28",
      "score": 4,
      "num_children": 0,
      "author": 408466,
      "replies": []
    },
    {
      "id": "ig0nwxz",
      "text": "Amazin'",
      "timestamp": "2022-07-13 17:39:02",
      "score": 4,
      "num_children": 0,
      "author": 320368,
      "replies": []
    },
    {
      "id": "ig0pqmu",
      "text": "it always the crazy christian conservatives that hate LGBTQ because they hate themselves and their non-hetro desire.",
      "timestamp": "2022-07-13 17:50:40",
      "score": 4,
      "num_children": 0,
      "author": 359877,
      "replies": []
    },
    {
      "id": "ig0sov9",
      "text": "Amazin’",
      "timestamp": "2022-07-13 18:09:53",
      "score": 5,
      "num_children": 0,
      "author": 356929,
      "replies": []
    },
    {
      "id": "ig0zdih",
      "text": "Shocked pikachu face",
      "timestamp": "2022-07-13 18:53:14",
      "score": 3,
      "num_children": 0,
      "author": 263547,
      "replies": []
    },
    {
      "id": "ig13q9t",
      "text": "AMAZING!",
      "timestamp": "2022-07-13 19:21:14",
      "score": 4,
      "num_children": 0,
      "author": 265569,
      "replies": []
    },
    {
      "id": "ig29w7m",
      "text": "\"Fun\" fact: this guy is also a hardcore misogynist and a...white supremacist.\n\nYes. Really.",
      "timestamp": "2022-07-14 00:09:57",
      "score": 4,
      "num_children": 0,
      "author": 81287,
      "replies": []
    },
    {
      "id": "ig3f5bt",
      "text": ">\"I've never witnessed this level of extreme hypocrisy and fraud before.\"\n\nI have. Over and over and over again...",
      "timestamp": "2022-07-14 06:01:12",
      "score": 5,
      "num_children": 0,
      "author": 286585,
      "replies": []
    },
    {
      "id": "ig02joo",
      "text": "Why do “family values” people always seem to be sex pests in reality?",
      "timestamp": "2022-07-13 15:21:51",
      "score": 10,
      "num_children": 1,
      "author": 38336,
      "replies": [
        {
          "id": "ig1prc9",
          "text": "Were these relationships not consensual? I didn't see anything about him assaulting anyone, did I miss something?",
          "timestamp": "2022-07-13 21:45:46",
          "score": 0,
          "num_children": 1,
          "author": 306747,
          "replies": [
            {
              "id": "ig1pwr1",
              "text": "Well, by sex pest I meant highly hypocritically motivated by sex.",
              "timestamp": "2022-07-13 21:46:48",
              "score": 2,
              "num_children": 1,
              "author": 38336,
              "replies": [
                {
                  "id": "ig1uh35",
                  "text": "Ah, so you were just using the term incorrectly, got it.",
                  "timestamp": "2022-07-13 22:18:23",
                  "score": 0,
                  "num_children": 0,
                  "author": 306747,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ig01bj0",
      "text": "None of this is surprising to me at all.",
      "timestamp": "2022-07-13 15:13:47",
      "score": 8,
      "num_children": 1,
      "author": 178252,
      "replies": [
        {
          "id": "ig0vez7",
          "text": "This. Seen it literally a million times by now. It's to the point that if someone is publicly anti-LGBT, I just assume they are in the closet and projecting their self-hatred on the whole world.",
          "timestamp": "2022-07-13 18:27:46",
          "score": 6,
          "num_children": 0,
          "author": 139599,
          "replies": []
        }
      ]
    },
    {
      "id": "ig077bm",
      "text": "Homophobes are gay af. Shocked pikachu face.",
      "timestamp": "2022-07-13 15:52:16",
      "score": 8,
      "num_children": 0,
      "author": 344488,
      "replies": []
    },
    {
      "id": "ig08fl0",
      "text": "Anton who’s never seen hypocrisy like this before has never spoken to a Christian about their religion.",
      "timestamp": "2022-07-13 16:00:14",
      "score": 3,
      "num_children": 0,
      "author": 250085,
      "replies": []
    },
    {
      "id": "ig0ey5v",
      "text": ">In the hyper-masculine right-wing internet community known as the “manosphere,” few figures loom larger than Jesse Lee Peterson\n\nExcept he's not even the most famous Peterson in the \"manosphere\"",
      "timestamp": "2022-07-13 16:41:53",
      "score": 3,
      "num_children": 1,
      "author": 138475,
      "replies": [
        {
          "id": "ig0ldhw",
          "text": "Can someone mansplain the manosphere to me?",
          "timestamp": "2022-07-13 17:22:43",
          "score": 3,
          "num_children": 1,
          "author": 358252,
          "replies": [
            {
              "id": "ig316na",
              "text": "It's basically the anti-feminism, incel spaces and \"celebrities\" online. Anything related to incels, men's rights, MGTOW (men going their own way), etc. JLP was popular in that group because he's a openly misogynistic and a self hating racist. He holds a lot of conservative positions but talks about women the same way incels would referring to them as whores or sluts and claiming that women's \"promiscuity\" and casual hook up culture is ruining America.",
              "timestamp": "2022-07-14 03:40:46",
              "score": 2,
              "num_children": 0,
              "author": 110801,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ig0f3ja",
      "text": "\\> \"I've never witnessed this level of extreme hypocrisy and fraud before.\"  \n\n\nDamn. .... someone hasn't been paying attention.",
      "timestamp": "2022-07-13 16:42:49",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig0u2q8",
      "text": "Vaush manifested this two years ago",
      "timestamp": "2022-07-13 18:19:01",
      "score": 3,
      "num_children": 0,
      "author": 33330,
      "replies": []
    },
    {
      "id": "ig19va5",
      "text": "He's black and right-wing.  A little more hypocrisy and cognitive dissonance isn't a big thing.",
      "timestamp": "2022-07-13 20:00:54",
      "score": 3,
      "num_children": 0,
      "author": 123845,
      "replies": []
    },
    {
      "id": "ig1ff2p",
      "text": "Dats amazin'!\n\nThere's only one thing the gop loves more than LOUD projection and that's abusing kids. **The party of the grand ol' pedophiles** \n\n* **(TRUMP) Republican Tim Nolan, chairman of Donald Trump’s presidential campaign in Kentucky & Former Campbell County Judge**, Served as a judge, school board member and city solicitor, forced 19 victims to perform sex acts, including seven who were minors under 16. Pled guilty on February 11, 2018 and was sentenced to serve 20 years in prison.\nhttps://www.cincinnati.com/story/news/2018/05/03/former-judge-tim-nolan-could-sentenced-today-more-drama-could-get-way/577947002/\n\n* **(TRUMP) Republican George Nader, Trump Foreign Policy Adviser,** sentenced to 10 years in prison for possession of child pornography and transporting a minor into the United States for sex. https://www.courthousenews.com/child-sex-trafficker-from-trump-tower-meeting-gets-10-year-sentence/\n\n* **(TRUMP) Republican Ralph Shortey, a former Oklahoma state senator & Trump’s Oklahoma campaign chair,** was indicted on four counts of human trafficking and child pornography. Pled guilty to a federal charge of child sex trafficking after hiring a 17-year-old boy for sex. Sentenced to 15 years in prison, in addition to ten years of supervised release and ordered to pay $125,000 in restitution.\nhttps://www.nbcnews.com/feature/nbc-out/trump-s-oklahoma-campaign-chair-plead-guilt-child-sex-trafficking-n822461 \n\n* **Republican Dennis Hastert, Speaker of the US House of Representatives, Illinois Congressman and one of the highest-ranking U.S. politicians to ever go to prison**, molested at least four boys as young as 14 years of age when he coached wrestling at an Illinois High School. He was sentenced to 15 months in prison, two years' supervised release, and a $250,000 fine. A civil case was due back in court for a status hearing on Jan. 8, 2021 at the courthouse to further address the jury trial. https://www.pbs.org/newshour/nation/ex-u-s-house-speaker-dennis-hastert-starts-prison-term\n\n* **Republican Minnesota State Representative Jim Knoblach** Drops Out Of Race After Daughter Says He Molested Her For More Than Ten Years 22 Sep 2018\nhttps://www.washingtonpost.com/politics/2018/09/22/lawmaker-quits-race-after-daughter-says-he-molested-her-more-than-decade/?utm_term=.8ac8527c7f43\n\n* **Republican Jayson Boebert, husband of Q-ANON Republican Congresswoman Lauren Boebert of Colorado,** was arrested in Jan. 2004 after allegedly exposing his penis to two women at a bowling alley, according to an arrest affidavit. Lauren Boebert (then a minor at 17 and known as Lauren Opal Roberts) was also there. He pleaded guilty to public indecency and lewd exposure involving minors. https://nypost.com/2021/01/16/gop-rep-lauren-boebert-and-husband-have-racked-up-arrests/\n\n* **Republican congressman and anti-gay activist Robert Bauman** was charged with having sex with a 16-year-old boy he picked up at a gay bar.\nhttps://en.wikipedia.org/wiki/Robert_Bauman\n\n* **Republican Committee Chairman Jeffrey Patti** was arrested for distributing a video clip of a 5-year-old girl being raped.\nhttp://www.njherald.com/article/20060510/ARTICLE/305109971\n\n* **Republican Joseph Dendy, Cobb County GA Republican Party Chairman & Sunday School Teacher,**was sentenced to life in prison after being convicted on four counts of child molestation, four counts of first-degree cruelty to children, three counts of enticing a child for indecent purposes, and one count each of aggravated sexual battery and aggravated child molestation. https://www.fox5atlanta.com/news/former-gop-chairman-arrested-on-child-molestation-charges\n\n* **Republican anti-abortion activist Howard Scott Heldreth** is a convicted child rapist in Florida.\nhttps://offender.fdle.state.fl.us/offender/sops/flyer.jsf?personId=28587\n\n* **Republican director of the “Young Republican Federation” Nicholas Elizondo** molested his 6-year old daughter and was sentenced to six years in prison. https://bakersfieldnow.com/news/local/registered-sex-offender-keeps-custody-of-daughter\n\n* **Republican Kentucky state Representative & pastor Dan Johnson**, committed suicide after an exposé revealed his serial lies, suspected arson, criminal church, racism, accused rape of a teen and more. https://en.wikipedia.org/wiki/Dan_Johnson_%28Kentucky_politician%29\n\n* **Republican County Commissioner David Swartz** pleaded guilty to molesting two girls under the age of 11 and was sentenced to 8 years in prison.\nhttp://www.lanternproject.org.uk/library/child-abuse-arrests-and-court-cases/child-abuse-arrests-trials-and-proceedings/ex-county-commissioner-admits-sexual-abuse-of-girl/\n\n* **Republican judge Mark Pazuhanich** pleaded no contest to fondling a 10-year old girl and was sentenced to 10 years probation.\nhttp://www.poconorecord.com/article/20120426/NEWS90/204260334\n\n* **Republican legislator Edison Misla Aldarondo** was sentenced to 10 years in prison for raping his daughter between the ages of 9 and 17.\nhttps://en.wikipedia.org/wiki/Edison_Misla_Aldarondo\n\n* **Republican Mayor Philip Giordano** is serving a 37-year sentence in federal prison for sexually abusing 8 and 10-year old girls.\nhttps://en.wikipedia.org/wiki/Philip_Giordano\n\n* **Republican activist and Christian Coalition leader Beverly Russell** admitted to an incestuous relationship with his step daughter.\nhttps://www.nytimes.com/1995/08/02/opinion/journal-beverly-russell-s-prayers.html\n\n* **Republican activist Marty Glickman (a.k.a. “Republican Marty”)**, was taken into custody by Florida police on four counts of unlawful sexual activity with an underage girl\nhttps://www.arktimes.com/TheHoglawyer/archives/2007/08/28/the-latest-republican-sex-scandals-plural---more-of-the-same\n\n* **Republican Senate candidate John Hathaway** was accused of having sex with his 12-year old baby sitter and withdrew his candidacy after the allegations were reported in the media.\nhttps://www.nytimes.com/1996/06/06/us/politics-the-senate-maine-candidate-again-faces-1990-child-sex-accusation.html\n\n* **Republican preacher Stephen White**, who demanded \"a return to traditional values\", was sentenced to jail after offering $20 to a 14-year-old boy for permission to perform oral sex on him.\nhttp://www.thedp.com/article/2004/01/brother_stephen_convicted_of_soliciting_sex\n\n* **Republican Party leader Paul Ingram** pleaded guilty to six counts of raping his daughters and served 14 years in federal prison.\nhttps://culteducation.com/group/1255-false-memories/6514-man-in-notorious-sex-case-finishes-term.html\n\n* **Republican election board official Kevin Coan** was sentenced to two years probation for soliciting sex over the internet from a 14-year old girl. https://www.semissourian.com/story/57773.html\n\n* **Republican politician Andrew Buhr** was charged with two counts of first degree sodomy with a 13-year old boy. https://www.arktimes.com/TheHoglawyer/archives/2007/08/28/the-latest-republican-sex-scandals-plural---more-of-the-same\n\n* **Republican politician Keith Westmoreland** was arrested on seven felony counts of lewd and lascivious exhibition to girls under the age of 16 (i.e. exposing himself to children). http://www.chattanoogan.com/2002/6/21/23202/Tennessee-Legislator-Commits-Suicide.aspx\n\n* **Republican County Councilman Keola Childs** pleaded guilty to molesting a male child. http://the.honoluluadvertiser.com/article/2007/Oct/08/ln/hawaii710080338.html\n\n* **Republican candidate Richard Gardner** admitted to molesting his two daughters. https://lasvegassun.com/news/2002/oct/14/assembly-candidate-gardner-ruled-ineligible-due-to/\n\n* **Republican City Councilman Fred C. Smeltzer, Jr.** pleaded no contest to raping a 15 year-old girl and served 6-months in prison. https://www.wgal.com/article/council-accepts-resignation-of-member-imprisoned-for-rape/6189408\n\n* **Republican activist Parker J. Bena** pleaded guilty to possession of child pornography on his home computer and was sentenced to 30 months in prison http://www.salem-news.com/articles/october172007/repubscandals101707.php\n\n* **Republican strategist and Citadel Military College graduate Robin Vanderwall** was convicted in Virginia on five counts of soliciting sex from boys and girls over the internet. https://www.sourcewatch.org/index.php/Robin_Vanderwall\n\n* **Republican city councilman Mark Harris**, described as a “good military man / church goer,” was convicted of repeatedly having sex with an 11-year-old girl and sentenced to 12 years in prison.\n\n* **Republican Brandon Hixon, Idaho State Representative**, resigned while under criminal investigation for molesting two girls, including a young female relative for more than 10 years, then killed himself three months later, shortly before his ex-wife and two others were to testify before a grand jury. https://www.cbsnews.com/news/brandon-hixon-former-idaho-lawmaker-facing-sex-abuse-inquiry-kills-himself/\n\n* **Republican Tony Yocham, Hamilton, TX Chief of Police,** was arrested by Texas Rangers on charges of continuous sexual abuse of a child. https://www.kxxv.com/news/local-news/hamilton-county-chief-of-police-arrested-for-continuous-abuse-of-a-child\n\n* **Republican Nathan Larson of the Virginia House of Delegates** is a self-confessed pedophile and white supremacist. Was arrested on felony charges for kidnapping, child abduction, soliciting child pornography from a minor and meeting a child for the intention of sex. https://www.nbcnews.com/news/us-news/alleged-pedophile-white-supremacist-arrested-kidnapping-12-yr-old-girl-n1251832\n_________________________\n\n* **NOTE: I'm reaching the character limit on Reddit posts, so here's a website with [a list of 400](https://m.dailykos.com/stories/2018/10/23/1806673/-Republican-Sexual-Predators-Abusers-and-Enablers-Pt-1) of these republican shit stains on humanity.**",
      "timestamp": "2022-07-13 20:36:48",
      "score": 3,
      "num_children": 0,
      "author": 75760,
      "replies": []
    },
    {
      "id": "ig1kyux",
      "text": "BETA!",
      "timestamp": "2022-07-13 21:13:25",
      "score": 3,
      "num_children": 0,
      "author": 355826,
      "replies": []
    },
    {
      "id": "ig1l627",
      "text": "I've always enjoyed watching Jesse, for the explicit reason that I just simply cannot believe he is real.  He's such a right wing parody, and probably doesn't realize how genius his spiel really is.",
      "timestamp": "2022-07-13 21:14:45",
      "score": 3,
      "num_children": 0,
      "author": 334093,
      "replies": []
    },
    {
      "id": "ig2k2el",
      "text": "I’ll never forget that Newt Gingrich pursued an impeachment of Clinton for lying about an affair while talking about family values.\n\nMeanwhile, the piece of shit had an ongoing multi year affair with a staffer.  After failing to remove Clinton from office, he divorced his wife who was dealing with cancer and married his staffer and left congress.",
      "timestamp": "2022-07-14 01:25:09",
      "score": 3,
      "num_children": 0,
      "author": 337149,
      "replies": []
    },
    {
      "id": "ig30ltd",
      "text": "I'm a gay man and the thought of Jessi Lee being gay kinda makes me throw up a little in my mouth.",
      "timestamp": "2022-07-14 03:35:49",
      "score": 3,
      "num_children": 1,
      "author": 102946,
      "replies": [
        {
          "id": "ig3t3mc",
          "text": "Lol imagine having sex with Jesse Lee Peterson. Looking into those jaundiced eyes. Touching that crepey ass skin. And on top of that he's basically mentally disabled.",
          "timestamp": "2022-07-14 09:05:16",
          "score": 1,
          "num_children": 0,
          "author": 109620,
          "replies": []
        }
      ]
    },
    {
      "id": "ig3ev1f",
      "text": "All his life he has been taught to hate homosexuality by his religious surroundings. No wonder he shouts those homophobic shit, trying to deflect the notion that he is homosexual himself. It’s actually kind of sad, but it’s even more sad that he is sowing more homophobia by doing that.",
      "timestamp": "2022-07-14 05:57:53",
      "score": 3,
      "num_children": 0,
      "author": 70393,
      "replies": []
    },
    {
      "id": "ig3qw9d",
      "text": "Hypocrisy among religious people? First time, never heard.",
      "timestamp": "2022-07-14 08:34:40",
      "score": 3,
      "num_children": 0,
      "author": 234593,
      "replies": []
    },
    {
      "id": "ig3r538",
      "text": " “I’ve never witnessed this level of extreme hypocrisy and fraud before.”\n\nFirst time meeting someone devout in the Abrahamic religion?",
      "timestamp": "2022-07-14 08:38:04",
      "score": 3,
      "num_children": 0,
      "author": 55159,
      "replies": []
    },
    {
      "id": "ig02s0t",
      "text": "Further evidence that the loudest anti-LGBTQIA+ people are the deepest in the closet.",
      "timestamp": "2022-07-13 15:23:23",
      "score": 5,
      "num_children": 0,
      "author": 277163,
      "replies": []
    },
    {
      "id": "ig0ph8q",
      "text": "Really? You've *never* seen this sort of hypocrisy before?\n\nIn America.\n\nIn current year.\n\nAnd this hypocrisy happens to be over someone's choice of sexual partners. Maybe your definition of hypocrisy needs to be expanded a little bit to include financial misdealings.",
      "timestamp": "2022-07-13 17:49:00",
      "score": 5,
      "num_children": 1,
      "author": 64041,
      "replies": [
        {
          "id": "ig1qd8o",
          "text": "I gotta agree with you here.  Politicians, outspoken media figures, celebrities, priests, etc, etc....all eventually get put out into the light.  And it seems to happen with regular frequency.",
          "timestamp": "2022-07-13 21:49:56",
          "score": 1,
          "num_children": 0,
          "author": 89111,
          "replies": []
        }
      ]
    },
    {
      "id": "ig0ar9y",
      "text": "Always projection with these pious fuckers",
      "timestamp": "2022-07-13 16:15:08",
      "score": 5,
      "num_children": 0,
      "author": 37213,
      "replies": []
    },
    {
      "id": "ig02ocv",
      "text": "Hahahahaha. I used to read WorldNetDaily for fun where he wrote a column. Not a surprise at all.",
      "timestamp": "2022-07-13 15:22:42",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig038sw",
      "text": "That’s what those damn Christian fundies religious zealots are.",
      "timestamp": "2022-07-13 15:26:27",
      "score": 2,
      "num_children": 0,
      "author": 57389,
      "replies": []
    },
    {
      "id": "ig09nom",
      "text": "Gay guys: sex strike on family value leaders.\n\nJust a suggestion",
      "timestamp": "2022-07-13 16:08:07",
      "score": 2,
      "num_children": 0,
      "author": 33970,
      "replies": []
    },
    {
      "id": "ig0agr2",
      "text": "The christofacists are obsessed with peoples sex lives and want to moralize human sexuality. The ones who are the first to condemn and are the loudest always get caught with their pants down. It must be horrible to live with the kind of shame they have about themselves.",
      "timestamp": "2022-07-13 16:13:16",
      "score": 2,
      "num_children": 0,
      "author": 19469,
      "replies": []
    },
    {
      "id": "ig0b8yi",
      "text": "To the surprise of.. *checks notes.. no one.",
      "timestamp": "2022-07-13 16:18:15",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig0bcyk",
      "text": "This is what religion does - turns what us natural and authentic into pain, shame, self-hatred, and the need to project personal self hatred onto others.",
      "timestamp": "2022-07-13 16:18:58",
      "score": 2,
      "num_children": 0,
      "author": 248742,
      "replies": []
    },
    {
      "id": "ig0bewo",
      "text": "Par for the course",
      "timestamp": "2022-07-13 16:19:18",
      "score": 2,
      "num_children": 0,
      "author": 156128,
      "replies": []
    },
    {
      "id": "ig0bnuq",
      "text": "Those who judge the loudest are covering their personal shame.",
      "timestamp": "2022-07-13 16:20:52",
      "score": 2,
      "num_children": 0,
      "author": 410860,
      "replies": []
    },
    {
      "id": "ig0btzx",
      "text": "It’s always self hate with these people",
      "timestamp": "2022-07-13 16:21:59",
      "score": 2,
      "num_children": 0,
      "author": 111339,
      "replies": []
    },
    {
      "id": "ig0cmes",
      "text": "Actually that level of hypocrisy by religious people happens all the time, except they tend to have so little or no self-awareness that they don't even notice.",
      "timestamp": "2022-07-13 16:27:03",
      "score": 2,
      "num_children": 0,
      "author": 55588,
      "replies": []
    },
    {
      "id": "ig0p91b",
      "text": "Jesus makes his glory whole",
      "timestamp": "2022-07-13 17:47:31",
      "score": 2,
      "num_children": 0,
      "author": 80817,
      "replies": []
    },
    {
      "id": "ig0vxme",
      "text": "Amazin",
      "timestamp": "2022-07-13 18:31:08",
      "score": 2,
      "num_children": 0,
      "author": 401078,
      "replies": []
    },
    {
      "id": "ig0yqil",
      "text": "Amazin",
      "timestamp": "2022-07-13 18:49:08",
      "score": 2,
      "num_children": 0,
      "author": 29684,
      "replies": []
    },
    {
      "id": "ig0zf9k",
      "text": "zero surprise to anyone familiar with amazin’ jlp.",
      "timestamp": "2022-07-13 18:53:33",
      "score": 2,
      "num_children": 0,
      "author": 51392,
      "replies": []
    },
    {
      "id": "ig11p6f",
      "text": "He's not gay. He's on the down low. Lol.",
      "timestamp": "2022-07-13 19:08:09",
      "score": 2,
      "num_children": 0,
      "author": 338723,
      "replies": []
    },
    {
      "id": "ig12dwz",
      "text": "AMAZIN!",
      "timestamp": "2022-07-13 19:12:38",
      "score": 2,
      "num_children": 0,
      "author": 165704,
      "replies": []
    },
    {
      "id": "ig12fj3",
      "text": "Amazin.",
      "timestamp": "2022-07-13 19:12:55",
      "score": 2,
      "num_children": 0,
      "author": 361726,
      "replies": []
    },
    {
      "id": "ig16dd3",
      "text": "Lindsay Graham enters the chat",
      "timestamp": "2022-07-13 19:38:13",
      "score": 2,
      "num_children": 0,
      "author": 223503,
      "replies": []
    },
    {
      "id": "ig16t7u",
      "text": "Uuhhmazin",
      "timestamp": "2022-07-13 19:41:03",
      "score": 2,
      "num_children": 0,
      "author": 219652,
      "replies": []
    },
    {
      "id": "ig1e3q6",
      "text": "Shocking.\n\n\nAnyway- did you see the new telescope pictures? They're kinda cool.",
      "timestamp": "2022-07-13 20:28:20",
      "score": 2,
      "num_children": 0,
      "author": 353582,
      "replies": []
    },
    {
      "id": "ig1gblr",
      "text": "‘Amazin’",
      "timestamp": "2022-07-13 20:42:41",
      "score": 2,
      "num_children": 0,
      "author": 42056,
      "replies": []
    },
    {
      "id": "ig1hi6m",
      "text": "If \"I've never witnessed this level of extreme hypocrisy and fraud before.\" then you obviously don't follow politics or religion.",
      "timestamp": "2022-07-13 20:50:28",
      "score": 2,
      "num_children": 0,
      "author": 323222,
      "replies": []
    },
    {
      "id": "ig1je0l",
      "text": "I love it when these people eat their own.",
      "timestamp": "2022-07-13 21:02:52",
      "score": 2,
      "num_children": 0,
      "author": 260534,
      "replies": []
    },
    {
      "id": "ig1lri6",
      "text": "Confirms my suspicions that the highest homophobes are suppressing their own gay urges.",
      "timestamp": "2022-07-13 21:18:42",
      "score": 2,
      "num_children": 0,
      "author": 75432,
      "replies": []
    },
    {
      "id": "ig1ltig",
      "text": "This guy, I know this guy from the Nick Rekieta interview! https://youtu.be/NVx6DsyyZGo\n\nI didn't finish it.",
      "timestamp": "2022-07-13 21:19:05",
      "score": 2,
      "num_children": 0,
      "author": 43606,
      "replies": []
    },
    {
      "id": "ig1lvfe",
      "text": "I wonder how many far right pundits are secretly tired of the grinding culture war grift.",
      "timestamp": "2022-07-13 21:19:26",
      "score": 2,
      "num_children": 0,
      "author": 409481,
      "replies": []
    },
    {
      "id": "ig1mroh",
      "text": "DGG4LYFE",
      "timestamp": "2022-07-13 21:25:28",
      "score": 2,
      "num_children": 0,
      "author": 5067,
      "replies": []
    },
    {
      "id": "ig1mrti",
      "text": "Any Distorted View fans here? Tim covered this story weeks ago.",
      "timestamp": "2022-07-13 21:25:29",
      "score": 2,
      "num_children": 0,
      "author": 110727,
      "replies": []
    },
    {
      "id": "ig1nej4",
      "text": "it’s not what you believe; it’s what your paying followers think you belive.it’s called identity politics.",
      "timestamp": "2022-07-13 21:29:46",
      "score": 2,
      "num_children": 0,
      "author": 340003,
      "replies": []
    },
    {
      "id": "ig1njvr",
      "text": ">Peterson claiming that a woman who orgasms during sex is somehow “becoming a man”\n\nloooooooooooooool\n\n\nNo, seriously.... LOOOOOOOOOOOOOOOL",
      "timestamp": "2022-07-13 21:30:47",
      "score": 2,
      "num_children": 0,
      "author": 125545,
      "replies": []
    },
    {
      "id": "ig1tm87",
      "text": "Amazin'",
      "timestamp": "2022-07-13 22:12:21",
      "score": 2,
      "num_children": 0,
      "author": 34167,
      "replies": []
    },
    {
      "id": "ig1wdr8",
      "text": "Its always the ones that bitch the loudest that are guilty of what they are bitching about.\n\nAlways",
      "timestamp": "2022-07-13 22:31:44",
      "score": 2,
      "num_children": 0,
      "author": 261466,
      "replies": []
    },
    {
      "id": "ig248ni",
      "text": "I thought I recognized that face. I watched him interview \"adult gamers\" and tried suggesting Destiny was a females name (was the dudes screen name)",
      "timestamp": "2022-07-13 23:28:20",
      "score": 2,
      "num_children": 1,
      "author": 2190,
      "replies": [
        {
          "id": "ig2kpxw",
          "text": "[Source](https://www.youtube.com/watch?v=Nvi1wJGI7aE). Kind of a silly conversation, but [some great memes came from it.](https://www.youtube.com/watch?v=CAEz4LzGf90)",
          "timestamp": "2022-07-14 01:30:06",
          "score": 2,
          "num_children": 1,
          "author": 343489,
          "replies": [
            {
              "id": "ig2leqg",
              "text": "Yes! This is the exact video I recalled. \n\nHappy cake day too btw",
              "timestamp": "2022-07-14 01:35:12",
              "score": 1,
              "num_children": 0,
              "author": 2190,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ig25hnc",
      "text": "Let he who is without sin cast the first stone",
      "timestamp": "2022-07-13 23:37:28",
      "score": 2,
      "num_children": 0,
      "author": 370017,
      "replies": []
    },
    {
      "id": "ig26339",
      "text": "Not a surprise. I’ve never listened to anyone who so clearly hated women in every single way. He doesn’t like them, doesn’t like the food they are supposed to be in the kitchen making, doesn’t like them in school, talking, working, and now evidently sex.",
      "timestamp": "2022-07-13 23:41:50",
      "score": 2,
      "num_children": 0,
      "author": 122536,
      "replies": []
    },
    {
      "id": "ig28h8l",
      "text": "Who could have seen this coming",
      "timestamp": "2022-07-13 23:59:32",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig298lf",
      "text": "I thought it was rather well known that these militant anti-gay religious morons are almost always closet homosexuals.",
      "timestamp": "2022-07-14 00:05:10",
      "score": 2,
      "num_children": 0,
      "author": 392452,
      "replies": []
    },
    {
      "id": "ig2bu6b",
      "text": "As a formerly very religious person i have nothing but empathy for the difficult life gay religious people face. It’s a system that put into this man that he cannot be honest about who he is or who he is attracted to. Sad.",
      "timestamp": "2022-07-14 00:24:20",
      "score": 2,
      "num_children": 1,
      "author": 272876,
      "replies": [
        {
          "id": "ig2e1dy",
          "text": "He can it he honest because he doesn't want to be honest. Only dishonest people make money in the church business.",
          "timestamp": "2022-07-14 00:40:37",
          "score": 1,
          "num_children": 0,
          "author": 232028,
          "replies": []
        }
      ]
    },
    {
      "id": "ig2cdeq",
      "text": "Seems the more adamantly outspoken a consevative christain is, the better they are at building closets.",
      "timestamp": "2022-07-14 00:28:16",
      "score": 2,
      "num_children": 0,
      "author": 375889,
      "replies": []
    },
    {
      "id": "ig2e1hz",
      "text": "Whatever a rightie is accusing you of doing and attacking you for is what they're *actually* doing.",
      "timestamp": "2022-07-14 00:40:38",
      "score": 2,
      "num_children": 0,
      "author": 290988,
      "replies": []
    },
    {
      "id": "ig2htqw",
      "text": "The  bible brings the absolute worst out of people.",
      "timestamp": "2022-07-14 01:08:29",
      "score": 2,
      "num_children": 0,
      "author": 107603,
      "replies": []
    },
    {
      "id": "ig2qrub",
      "text": "As far as I've heard, it wasn't just relationships.  It sounds like he also engaged in some pretty predatory behavior.",
      "timestamp": "2022-07-14 02:16:03",
      "score": 2,
      "num_children": 0,
      "author": 261416,
      "replies": []
    },
    {
      "id": "ig2ztqw",
      "text": "Jfc this guy looks so inbred he's basically a sandwich.",
      "timestamp": "2022-07-14 03:29:18",
      "score": 2,
      "num_children": 0,
      "author": 231015,
      "replies": []
    },
    {
      "id": "ig2zyva",
      "text": "Shock of shock.. the guy yelling the loudest anti LGBT slurs is actually gay. Honestly this isn't surprising at all, in fact it falls right in line with the statistics.",
      "timestamp": "2022-07-14 03:30:31",
      "score": 2,
      "num_children": 0,
      "author": 154501,
      "replies": []
    },
    {
      "id": "ig31l3n",
      "text": "What a slut",
      "timestamp": "2022-07-14 03:44:15",
      "score": 2,
      "num_children": 1,
      "author": 315835,
      "replies": [
        {
          "id": "ig3baih",
          "text": "Fucking A right",
          "timestamp": "2022-07-14 05:17:58",
          "score": 2,
          "num_children": 0,
          "author": 381211,
          "replies": []
        }
      ]
    },
    {
      "id": "ig347oh",
      "text": "I only recently found out about this guy and saw some of his \"debates\", it is actually amazing. If you think that people like post coma Peterson goes off the rails, watch this guy instead.",
      "timestamp": "2022-07-14 04:07:46",
      "score": 2,
      "num_children": 0,
      "author": 315971,
      "replies": []
    },
    {
      "id": "ig34h0u",
      "text": "he infiltrated their ranks and played then allllllllll",
      "timestamp": "2022-07-14 04:10:13",
      "score": 2,
      "num_children": 0,
      "author": 262108,
      "replies": []
    },
    {
      "id": "ig367un",
      "text": "He knows a Beta male when he sees one",
      "timestamp": "2022-07-14 04:26:33",
      "score": 2,
      "num_children": 0,
      "author": 39906,
      "replies": []
    },
    {
      "id": "ig37cys",
      "text": "He is a very, very stupid man.  I genuinely think he has some sort of brain disease, he's that stupid.",
      "timestamp": "2022-07-14 04:37:32",
      "score": 2,
      "num_children": 0,
      "author": 267106,
      "replies": []
    },
    {
      "id": "ig38kxu",
      "text": "Both my BIL's are hardcore Right-wing, gaybashing, gun nuts.  They both get way too handsy with me  and stare too long when they drink.(one more than the other).\n\nI wish they were just out,  maybe they wouldn't be so angry all the time.",
      "timestamp": "2022-07-14 04:49:41",
      "score": 2,
      "num_children": 1,
      "author": 54006,
      "replies": [
        {
          "id": "ijfyomy",
          "text": "That's why they had to invent a separate term: MSM.",
          "timestamp": "2022-08-08 14:08:44",
          "score": 2,
          "num_children": 0,
          "author": 208069,
          "replies": []
        }
      ]
    },
    {
      "id": "ig392hj",
      "text": "It’s always, always projection with these people.",
      "timestamp": "2022-07-14 04:54:34",
      "score": 2,
      "num_children": 0,
      "author": 365281,
      "replies": []
    },
    {
      "id": "ig39ogi",
      "text": "Happened several times with prominent televangelists in the 80's and 90's from what I recall.",
      "timestamp": "2022-07-14 05:00:50",
      "score": 2,
      "num_children": 0,
      "author": 155473,
      "replies": []
    },
    {
      "id": "ig3ck7y",
      "text": "That level hypocrisy happens every week in every fundamentalist church in every state in America.",
      "timestamp": "2022-07-14 05:32:00",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig3dru4",
      "text": "Call me surprised! Not",
      "timestamp": "2022-07-14 05:45:26",
      "score": 2,
      "num_children": 0,
      "author": 149812,
      "replies": []
    },
    {
      "id": "ig3fe4p",
      "text": "https://youtu.be/8FIOCvJPoAM",
      "timestamp": "2022-07-14 06:04:05",
      "score": 2,
      "num_children": 0,
      "author": 89817,
      "replies": []
    },
    {
      "id": "ig3ghc3",
      "text": "Amazin",
      "timestamp": "2022-07-14 06:17:01",
      "score": 2,
      "num_children": 0,
      "author": 239088,
      "replies": []
    },
    {
      "id": "ig3h2ua",
      "text": "Dude is a slavery apologist lunatic.",
      "timestamp": "2022-07-14 06:24:15",
      "score": 2,
      "num_children": 0,
      "author": 223197,
      "replies": []
    },
    {
      "id": "ig3iv9y",
      "text": "Ted Haggard did this and also did meth.",
      "timestamp": "2022-07-14 06:46:37",
      "score": 2,
      "num_children": 1,
      "author": 100597,
      "replies": [
        {
          "id": "ijfy7f6",
          "text": "They're probably not allowed to talk about either one.",
          "timestamp": "2022-08-08 14:05:21",
          "score": 1,
          "num_children": 0,
          "author": 208069,
          "replies": []
        }
      ]
    },
    {
      "id": "ig3pf2z",
      "text": "Didn't he get caught with gay porn tabs open a couple of years back? This doesn't surprise me one bit.",
      "timestamp": "2022-07-14 08:14:09",
      "score": 2,
      "num_children": 0,
      "author": 199618,
      "replies": []
    },
    {
      "id": "ig3qe0p",
      "text": "We hate the most in others what we fear the most within ourselves.",
      "timestamp": "2022-07-14 08:27:37",
      "score": 2,
      "num_children": 0,
      "author": 325235,
      "replies": []
    },
    {
      "id": "ig3r8kg",
      "text": ">“I’ve never whitenesses this level of extreme hypocrisy and fraud before”\n\nOh *come* now. *Sure* you have.",
      "timestamp": "2022-07-14 08:39:25",
      "score": 2,
      "num_children": 0,
      "author": 33585,
      "replies": []
    },
    {
      "id": "ig3sdhb",
      "text": "On one hand I feel sympathy - in general, the reason this happens so often is because in deeply conservative communities, this type of thing is repressed.\n\nOn the other hand, *Amazin'!*",
      "timestamp": "2022-07-14 08:55:08",
      "score": 2,
      "num_children": 0,
      "author": 261920,
      "replies": []
    },
    {
      "id": "ig430x3",
      "text": "Funny how so many Christians are so hateful and hypocritical",
      "timestamp": "2022-07-14 11:12:26",
      "score": 2,
      "num_children": 0,
      "author": 64556,
      "replies": []
    },
    {
      "id": "ig47p87",
      "text": "This guy sounds like a homophobic closeted homosexual and maybe someone who is struggling with gender identity, too, given his \"manosphere\" nonsense. What middle-aged single dude lives with a bunch of other men and acts out so sexually in front of them? Who clearly hates women - perhaps he's denying his true gender identity? - and rails so passionately about gays being children of Satan because they march in a freaking parade? I'm not surprised since this outings have been going on since the 1980s and never seem to stop due to non-stop hypocrisy in the christo-fascist crowd. 🙄",
      "timestamp": "2022-07-14 12:00:03",
      "score": 2,
      "num_children": 1,
      "author": 121442,
      "replies": [
        {
          "id": "ijfwocs",
          "text": "The sad thing is that it always seems to be their own team that calls them out first so it's kind of a double whammy. I think it's supposed to be a \"don't ask, don't tell\" situation.",
          "timestamp": "2022-08-08 13:54:22",
          "score": 2,
          "num_children": 0,
          "author": 208069,
          "replies": []
        }
      ]
    },
    {
      "id": "ig4c0wd",
      "text": "Amazin",
      "timestamp": "2022-07-14 12:37:43",
      "score": 2,
      "num_children": 0,
      "author": 277659,
      "replies": []
    },
    {
      "id": "ig4dvym",
      "text": "They're always the thing they claim to oppose.",
      "timestamp": "2022-07-14 12:52:43",
      "score": 2,
      "num_children": 0,
      "author": 224807,
      "replies": []
    },
    {
      "id": "ig4im4u",
      "text": "“I’ve never witnessed this level of extreme hypocrisy and fraud before”\n\n\nExcept the last time this happened, and the time before…",
      "timestamp": "2022-07-14 13:29:30",
      "score": 2,
      "num_children": 1,
      "author": 213741,
      "replies": [
        {
          "id": "ijfvrmo",
          "text": "People seem to only care when you talk out of both sides of your mouth. /Bring your own BJ joke.",
          "timestamp": "2022-08-08 13:47:52",
          "score": 1,
          "num_children": 0,
          "author": 208069,
          "replies": []
        }
      ]
    },
    {
      "id": "ig4nu6k",
      "text": "Every. Fucking. Accusation. Is. Projection. from the vocal right.",
      "timestamp": "2022-07-14 14:07:43",
      "score": 2,
      "num_children": 0,
      "author": 194105,
      "replies": []
    },
    {
      "id": "ig4vff4",
      "text": "I've heard it said that those who oppose something the strongest, are the ones that are denying something to themselves.  \"Thou dost protest too much\".",
      "timestamp": "2022-07-14 14:58:35",
      "score": 2,
      "num_children": 0,
      "author": 279103,
      "replies": []
    },
    {
      "id": "ig589jg",
      "text": "every republican is just projecting",
      "timestamp": "2022-07-14 16:20:37",
      "score": 2,
      "num_children": 0,
      "author": 210763,
      "replies": []
    },
    {
      "id": "ig5mopt",
      "text": "Is there anything gayer than exalting masculinity to this degree, worshipping at an altar of dicks. This is the least surprising thing ever,",
      "timestamp": "2022-07-14 17:51:37",
      "score": 2,
      "num_children": 1,
      "author": 141662,
      "replies": [
        {
          "id": "ijftn8w",
          "text": "I don't believe it's the act itself that's abhorrent but the power dynamic that it often represents. Sex should never be used as a weapon of control and unfortunately that's exactly what it seems to be in way too many of these circles.",
          "timestamp": "2022-08-08 13:32:28",
          "score": 1,
          "num_children": 0,
          "author": 208069,
          "replies": []
        }
      ]
    },
    {
      "id": "ig66m4s",
      "text": "Jesse Lee Peterson might have put his Peter in ur son.",
      "timestamp": "2022-07-14 19:58:24",
      "score": 2,
      "num_children": 0,
      "author": 191511,
      "replies": []
    },
    {
      "id": "ig6vclp",
      "text": "Let ye without sin blow the first dude",
      "timestamp": "2022-07-14 22:43:16",
      "score": 2,
      "num_children": 0,
      "author": 149553,
      "replies": []
    },
    {
      "id": "ig6wy50",
      "text": "Sounds like your normal everyday christian pastor to me.",
      "timestamp": "2022-07-14 22:54:38",
      "score": 2,
      "num_children": 1,
      "author": 86955,
      "replies": [
        {
          "id": "ijft04d",
          "text": "Hopefully that changes.",
          "timestamp": "2022-08-08 13:27:32",
          "score": 1,
          "num_children": 0,
          "author": 208069,
          "replies": []
        }
      ]
    },
    {
      "id": "ig18uus",
      "text": "THEM RADICAL HOMOSEXUALS 😂",
      "timestamp": "2022-07-13 19:54:22",
      "score": 1,
      "num_children": 0,
      "author": 191809,
      "replies": []
    },
    {
      "id": "ig1ft15",
      "text": "Yea, yea where's the proof at",
      "timestamp": "2022-07-13 20:39:20",
      "score": 0,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig23gi6",
      "text": "#YOU SHALL NOT LIKE DICKS IF YOU ARE A MAN, BUT IM GONNA TAKE TWO AFTER THIS SEMEN… I MEAN SERMON.",
      "timestamp": "2022-07-13 23:22:34",
      "score": 0,
      "num_children": 0,
      "author": 114581,
      "replies": []
    },
    {
      "id": "ig03grx",
      "text": "Didn't newsguard demote the daily beast to fake news?",
      "timestamp": "2022-07-13 15:27:55",
      "score": -8,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig09s4l",
      "text": "Holy shit I haven't seen this mug in years HAAA should've seen this coming sooner or later get fucked",
      "timestamp": "2022-07-13 16:08:53",
      "score": 1,
      "num_children": 0,
      "author": 224754,
      "replies": []
    },
    {
      "id": "ig0ams5",
      "text": "First time?",
      "timestamp": "2022-07-13 16:14:20",
      "score": 1,
      "num_children": 0,
      "author": 244552,
      "replies": []
    },
    {
      "id": "ig0b0hr",
      "text": "Probably witnessed it regularly, on sundays",
      "timestamp": "2022-07-13 16:16:45",
      "score": 1,
      "num_children": 0,
      "author": 151195,
      "replies": []
    },
    {
      "id": "ig0b6oj",
      "text": "Oh no!!  Anyway…",
      "timestamp": "2022-07-13 16:17:51",
      "score": 1,
      "num_children": 0,
      "author": 19469,
      "replies": []
    },
    {
      "id": "ig0c5bw",
      "text": "Surprised Pikachu",
      "timestamp": "2022-07-13 16:24:00",
      "score": 1,
      "num_children": 0,
      "author": 82972,
      "replies": []
    },
    {
      "id": "ig0dhhg",
      "text": "Of course.",
      "timestamp": "2022-07-13 16:32:35",
      "score": 1,
      "num_children": 0,
      "author": 23659,
      "replies": []
    },
    {
      "id": "ig0dhrj",
      "text": "The louder and more unhinged the bigot, the more likely it is they are hiding something",
      "timestamp": "2022-07-13 16:32:38",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig0dlos",
      "text": "I don't get why people obsess with him. Dude talks like he has had a stroke a day for the last 20 years.",
      "timestamp": "2022-07-13 16:33:20",
      "score": 1,
      "num_children": 0,
      "author": 238736,
      "replies": []
    },
    {
      "id": "ig0dlxj",
      "text": "This should be on all news, considering SCOTUS. They are so full of self hate they become the worst. The more we expose the better. For their sake as well.",
      "timestamp": "2022-07-13 16:33:23",
      "score": 1,
      "num_children": 0,
      "author": 242458,
      "replies": []
    },
    {
      "id": "ig0ennp",
      "text": "JLP is a fuckin idiot",
      "timestamp": "2022-07-13 16:40:03",
      "score": 1,
      "num_children": 0,
      "author": 337264,
      "replies": []
    },
    {
      "id": "ig0fn34",
      "text": "I'm shocked. Shocked, I say.",
      "timestamp": "2022-07-13 16:46:15",
      "score": 1,
      "num_children": 0,
      "author": 243723,
      "replies": []
    },
    {
      "id": "ig0foyl",
      "text": "The funniest accusation was JLP allegedly stroking Hake's (another far-right loon) head while he was wrapped in a blanket like a burrito. Hake Burrito is now my favorite pair of words.",
      "timestamp": "2022-07-13 16:46:35",
      "score": 1,
      "num_children": 0,
      "author": 380062,
      "replies": []
    },
    {
      "id": "ig0ftj7",
      "text": "They become what they hate the most! Karma is delightful.",
      "timestamp": "2022-07-13 16:47:23",
      "score": 1,
      "num_children": 0,
      "author": 14904,
      "replies": []
    },
    {
      "id": "ig0g2mb",
      "text": "This dude is and always will be a piece of shit",
      "timestamp": "2022-07-13 16:48:59",
      "score": 1,
      "num_children": 0,
      "author": 278903,
      "replies": []
    },
    {
      "id": "ig0gmdt",
      "text": "Wait I always thought this guy way a meme, in what world is he one of the most popular far right pastors?!",
      "timestamp": "2022-07-13 16:52:24",
      "score": 1,
      "num_children": 0,
      "author": 300242,
      "replies": []
    },
    {
      "id": "ig0gvar",
      "text": "He allegedly had sex with hak which if you didn't know is one of the most DieHard Christian fascist on  YouTube. He has a pure disgust for women, which probably explains why he's gay",
      "timestamp": "2022-07-13 16:53:58",
      "score": 1,
      "num_children": 0,
      "author": 359635,
      "replies": []
    },
    {
      "id": "ig0hniq",
      "text": "AMAZING!",
      "timestamp": "2022-07-13 16:58:53",
      "score": 1,
      "num_children": 0,
      "author": 78506,
      "replies": []
    },
    {
      "id": "ig0i50g",
      "text": "\"yea me and jesse were fucking for like 10 years. proof? what? no.... he's... sneaky\"",
      "timestamp": "2022-07-13 17:01:56",
      "score": 1,
      "num_children": 0,
      "author": 105793,
      "replies": []
    },
    {
      "id": "ig0j1lb",
      "text": "Projection lol",
      "timestamp": "2022-07-13 17:07:46",
      "score": 1,
      "num_children": 0,
      "author": 154944,
      "replies": []
    },
    {
      "id": "ig0jaki",
      "text": "I'd never heard of this guy and watched him interview Hasan Piker. Absolutely crazy. [https://www.youtube.com/watch?v=JOYQY3rtXt4](https://www.youtube.com/watch?v=JOYQY3rtXt4)",
      "timestamp": "2022-07-13 17:09:21",
      "score": 1,
      "num_children": 0,
      "author": 387046,
      "replies": []
    },
    {
      "id": "ig0jwpn",
      "text": "Takes one to know one!",
      "timestamp": "2022-07-13 17:13:18",
      "score": 1,
      "num_children": 0,
      "author": 38573,
      "replies": []
    },
    {
      "id": "ig0kaos",
      "text": "And yet no one is surprised. As per fucking usual, it's always the ones who yell the loudest.",
      "timestamp": "2022-07-13 17:15:52",
      "score": 1,
      "num_children": 0,
      "author": 91314,
      "replies": []
    },
    {
      "id": "ig0kod2",
      "text": "Never underestimate the power of a total hypocrite.",
      "timestamp": "2022-07-13 17:18:19",
      "score": 1,
      "num_children": 0,
      "author": 92152,
      "replies": []
    },
    {
      "id": "ig0kpb0",
      "text": "Maybe he and Ted Haggard can run off together to go do meth and sex in the woods and stop bothering everyone and you know, just be themselves and happy.",
      "timestamp": "2022-07-13 17:18:29",
      "score": 1,
      "num_children": 0,
      "author": 347478,
      "replies": []
    },
    {
      "id": "ig0kra5",
      "text": "He's also the stupidest man, besides Trump, I've ever heard speak. Child-like intelligence.",
      "timestamp": "2022-07-13 17:18:49",
      "score": 1,
      "num_children": 0,
      "author": 279060,
      "replies": []
    },
    {
      "id": "ig0kvf1",
      "text": "I'm like 90% certain that dude has brain damage.",
      "timestamp": "2022-07-13 17:19:33",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig0ky1o",
      "text": "Oh no, he got seduced by Satan... Is what this will be played as, then in a year he will be back because sinners are forgiven, right?",
      "timestamp": "2022-07-13 17:20:00",
      "score": 1,
      "num_children": 0,
      "author": 324895,
      "replies": []
    },
    {
      "id": "ig0mu0f",
      "text": "He’s a pastor. At this point, the behavior is assumed.",
      "timestamp": "2022-07-13 17:32:06",
      "score": 1,
      "num_children": 0,
      "author": 301054,
      "replies": []
    },
    {
      "id": "ig0neuk",
      "text": "Im still convinced he darkens his skin to look blacker. It just looks like hes always wearing grease paint.",
      "timestamp": "2022-07-13 17:35:47",
      "score": 1,
      "num_children": 0,
      "author": 399168,
      "replies": []
    },
    {
      "id": "ig0og65",
      "text": "Not in a million years would I have guessed. Shocked\n\nPedantic post - not sure accused is the right word, doesn’t that imply wrong doing?",
      "timestamp": "2022-07-13 17:42:24",
      "score": 1,
      "num_children": 0,
      "author": 200670,
      "replies": []
    },
    {
      "id": "ig0ok5p",
      "text": "Jesse Lee Peterson has to be educationally subnormal of some kind. Listening to a black man unironically defend police brutality against his own race means he has to be mentally challenged in some way.",
      "timestamp": "2022-07-13 17:43:07",
      "score": 1,
      "num_children": 0,
      "author": 147260,
      "replies": []
    },
    {
      "id": "ig0p8ut",
      "text": "You have not been paying attention.",
      "timestamp": "2022-07-13 17:47:29",
      "score": 1,
      "num_children": 0,
      "author": 348259,
      "replies": []
    },
    {
      "id": "ig0pjc6",
      "text": "These guys are like Gus Fring: huge drug dealer, pillar of the community. They're all hiding in plain sight.",
      "timestamp": "2022-07-13 17:49:22",
      "score": 1,
      "num_children": 0,
      "author": 234405,
      "replies": []
    },
    {
      "id": "ig0q7gg",
      "text": "He definitely is a vers bottom",
      "timestamp": "2022-07-13 17:53:41",
      "score": 1,
      "num_children": 0,
      "author": 71565,
      "replies": []
    },
    {
      "id": "ig0qe5l",
      "text": "“Manoshere”. Sounds gay to me",
      "timestamp": "2022-07-13 17:54:55",
      "score": 1,
      "num_children": 0,
      "author": 81830,
      "replies": []
    },
    {
      "id": "ig0qmh2",
      "text": "Lol, how could 10 years long gay relationship go unnoticed, especially if the guy is openly homophobic and a priest",
      "timestamp": "2022-07-13 17:56:25",
      "score": 1,
      "num_children": 0,
      "author": 2204,
      "replies": []
    },
    {
      "id": "ig0r93o",
      "text": "So this is the normal now all these politicians passing anti gay laws just to make themselves feel better and hide their true selves. Smh I would imagine they use their political power to make things better and enjoy who they really are?",
      "timestamp": "2022-07-13 18:00:27",
      "score": 1,
      "num_children": 0,
      "author": 188635,
      "replies": []
    },
    {
      "id": "ig0rppb",
      "text": "He literally said he doesn’t sin. Like he does not sin ever since he as saved. HAHA",
      "timestamp": "2022-07-13 18:03:28",
      "score": 1,
      "num_children": 0,
      "author": 57714,
      "replies": []
    },
    {
      "id": "ig0rt8e",
      "text": "I'm loving this fash-on-fash infighting.",
      "timestamp": "2022-07-13 18:04:07",
      "score": 1,
      "num_children": 0,
      "author": 263359,
      "replies": []
    },
    {
      "id": "ig0t7qh",
      "text": ">\"I've never witnessed this level of extreme hypocrisy and fraud before.\"\n\nThen you havent been paying attention :)  Its practically a game to for religious conservatives to one up each other on hypocrisy and fraud.",
      "timestamp": "2022-07-13 18:13:19",
      "score": 1,
      "num_children": 0,
      "author": 146103,
      "replies": []
    },
    {
      "id": "ig0u8fl",
      "text": "Out them. Out every single of these assholes who partake in the same activity in private but then they publicly condemn",
      "timestamp": "2022-07-13 18:20:04",
      "score": 1,
      "num_children": 0,
      "author": 273910,
      "replies": []
    },
    {
      "id": "ig0usq6",
      "text": "Because, of course he did",
      "timestamp": "2022-07-13 18:23:44",
      "score": 1,
      "num_children": 0,
      "author": 215329,
      "replies": []
    },
    {
      "id": "ig0vzkq",
      "text": "My base assumption is that people like this are projecting/self-loathing. Anyone surprised by this hasn't been paying attention... happens all the time.",
      "timestamp": "2022-07-13 18:31:29",
      "score": 1,
      "num_children": 0,
      "author": 391935,
      "replies": []
    },
    {
      "id": "ig0w0os",
      "text": "You know I'm not even surprised pastors and churches in general are very hypocrite and tried to hide the abuse that they have committed through history\n\nIn all religions not only Christianity",
      "timestamp": "2022-07-13 18:31:42",
      "score": 1,
      "num_children": 0,
      "author": 53041,
      "replies": []
    },
    {
      "id": "ig0wvht",
      "text": "Wait...\"you've never witnessed...blah, blah, blah\".\n\nThey don't seem to watch right wing US shenanigans very often? Do they?",
      "timestamp": "2022-07-13 18:37:10",
      "score": 1,
      "num_children": 0,
      "author": 345769,
      "replies": []
    },
    {
      "id": "ig0wwah",
      "text": "A lot of people hate because it’s truly who they are. Periodt!",
      "timestamp": "2022-07-13 18:37:19",
      "score": 1,
      "num_children": 0,
      "author": 278109,
      "replies": []
    },
    {
      "id": "ig0xjf8",
      "text": "As a queer person, stories like this always make me so sad and angry, because it's *never* an excuse for that person's followers to actually examine their beliefs. Instead, they just go, \"See? The gays are so messed up they even hate themselves!\" \n\nEverything sucks. I'd like to be done now.",
      "timestamp": "2022-07-13 18:41:26",
      "score": 1,
      "num_children": 0,
      "author": 340297,
      "replies": []
    },
    {
      "id": "ig0xrty",
      "text": "What do you mean this is unheard of? It happens all the time. It's either some member of a church being found out as homosexual after years of anti-LGBTQ behaviour, or their found to be a pedophile nothing new in the land of religion unfortunately.",
      "timestamp": "2022-07-13 18:42:58",
      "score": 1,
      "num_children": 0,
      "author": 97410,
      "replies": []
    },
    {
      "id": "ig0xv94",
      "text": "This guy is pure entertainment",
      "timestamp": "2022-07-13 18:43:35",
      "score": 1,
      "num_children": 0,
      "author": 234000,
      "replies": []
    },
    {
      "id": "ig0yq4e",
      "text": "First time interacting with christians?",
      "timestamp": "2022-07-13 18:49:04",
      "score": 1,
      "num_children": 0,
      "author": 385743,
      "replies": []
    },
    {
      "id": "ig0zkrh",
      "text": "If true it would just stack up there with more shit that doesn’t surprise me anymore. \n\nSelf-hating is their lifestyle and all.",
      "timestamp": "2022-07-13 18:54:32",
      "score": 1,
      "num_children": 0,
      "author": 363962,
      "replies": []
    },
    {
      "id": "ig10t8c",
      "text": "\"I've never witnessed this level of extreme hypocrisy and fraud before.\"\n\n&#x200B;\n\n&#x200B;\n\n\"a mass of religious hypocrites\"\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nthe person must be blind as a bat.",
      "timestamp": "2022-07-13 19:02:28",
      "score": 1,
      "num_children": 0,
      "author": 109610,
      "replies": []
    },
    {
      "id": "ig10wgi",
      "text": "Lmao this is old news, a year ago he literally had a gay porn video in his Twitter likes one day. Lemme see if I can find a thread about it.\n\nEdit : [here’s](https://www.reddit.com/r/thedavidpakmanshow/comments/jj9ml8/amazin_antilgbt_jesse_lee_peterson_caught_liking/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) a link from a different sub. \n\nNo idea if that like is still up, but I can confirm that it was real.",
      "timestamp": "2022-07-13 19:03:03",
      "score": 1,
      "num_children": 0,
      "author": 254130,
      "replies": []
    },
    {
      "id": "ig11jc5",
      "text": "Really? I feel like we see this level of hypocrisy and fraud all the time from the conservatives/anti-gay/anti-lgbtq crowd all the time.",
      "timestamp": "2022-07-13 19:07:04",
      "score": 1,
      "num_children": 0,
      "author": 174353,
      "replies": []
    },
    {
      "id": "ig11rs9",
      "text": "One name Ted Haggard",
      "timestamp": "2022-07-13 19:08:38",
      "score": 1,
      "num_children": 0,
      "author": 251397,
      "replies": []
    },
    {
      "id": "ig125a3",
      "text": "He's always had that \"Pulse shooter\" vibe about him.",
      "timestamp": "2022-07-13 19:11:05",
      "score": 1,
      "num_children": 0,
      "author": 314577,
      "replies": []
    },
    {
      "id": "ig12i7o",
      "text": "If you all thought Trump, MTG, Boebert and Walker sound like they’re brain damaged then try listening to Jesse Lee Peterson or James Hake for more than 2 minutes. Their debates are on YouTube.",
      "timestamp": "2022-07-13 19:13:24",
      "score": 1,
      "num_children": 0,
      "author": 199338,
      "replies": []
    },
    {
      "id": "ig13fhe",
      "text": "We've been catching these assholes in rest stop bathrooms for decades. I'm not saying that every homophobe is gay, but it's telling.",
      "timestamp": "2022-07-13 19:19:22",
      "score": 1,
      "num_children": 0,
      "author": 214587,
      "replies": []
    },
    {
      "id": "ig13pvu",
      "text": "It seems that this hypocrisy is part of the fundamental breakdown of Christian’s understanding of LGBT issues. Simply put, these Christians have chosen to not indulge their homosexual tendencies because GOD, and are angry and repressed want to force others to suffer as they have their entire lives.",
      "timestamp": "2022-07-13 19:21:10",
      "score": 1,
      "num_children": 0,
      "author": 36573,
      "replies": []
    },
    {
      "id": "ig13z70",
      "text": "This dude can barely speak recognizable English. Seriously.",
      "timestamp": "2022-07-13 19:22:49",
      "score": 1,
      "num_children": 0,
      "author": 54280,
      "replies": []
    },
    {
      "id": "ig140yu",
      "text": "Jesse sounds like a girls name so it's not really gay now is it 🤔",
      "timestamp": "2022-07-13 19:23:07",
      "score": 1,
      "num_children": 0,
      "author": 318070,
      "replies": []
    },
    {
      "id": "ig144nf",
      "text": "Beta!",
      "timestamp": "2022-07-13 19:23:46",
      "score": 1,
      "num_children": 0,
      "author": 128683,
      "replies": []
    },
    {
      "id": "ig14yn5",
      "text": "Kinda a lot of hearsay in this article...",
      "timestamp": "2022-07-13 19:29:07",
      "score": 1,
      "num_children": 0,
      "author": 244050,
      "replies": []
    },
    {
      "id": "ig151b9",
      "text": "Wonder what Steven Bonnell has to say about this?",
      "timestamp": "2022-07-13 19:29:36",
      "score": 1,
      "num_children": 0,
      "author": 5824,
      "replies": []
    },
    {
      "id": "ig15h9m",
      "text": "Every accusation is an admission.  Projection is a way of life for conservatives.",
      "timestamp": "2022-07-13 19:32:29",
      "score": 1,
      "num_children": 0,
      "author": 358276,
      "replies": []
    },
    {
      "id": "ig15vhm",
      "text": "\"I've never witnessed this level of extreme hypocrisy and fraud before.\"\n\n\\- Was going to introduce him to Tucker Carlson...\n\nMaybe not *sexual* hypocrisy (that we know of - *yet*), but hypocrisy and fraud IS hypocrisy and fraud...",
      "timestamp": "2022-07-13 19:35:02",
      "score": 1,
      "num_children": 0,
      "author": 174957,
      "replies": []
    },
    {
      "id": "ig15w8r",
      "text": "I can't imagine the self loathing hell that this man lives in.",
      "timestamp": "2022-07-13 19:35:10",
      "score": 1,
      "num_children": 0,
      "author": 376584,
      "replies": []
    },
    {
      "id": "ig15w8y",
      "text": "I am Jack's surprised face.",
      "timestamp": "2022-07-13 19:35:10",
      "score": 1,
      "num_children": 0,
      "author": 75840,
      "replies": []
    },
    {
      "id": "ig16cu4",
      "text": "hey, if this is the most hypocrisy they've ever seen from a religious person, it's the beginning of a long and informative journey",
      "timestamp": "2022-07-13 19:38:07",
      "score": 1,
      "num_children": 0,
      "author": 270473,
      "replies": []
    },
    {
      "id": "ig16eii",
      "text": "\"Are you a man or a liberal you can't be both\" was this him trying to flirt all along? 🤔",
      "timestamp": "2022-07-13 19:38:25",
      "score": 1,
      "num_children": 0,
      "author": 150216,
      "replies": []
    },
    {
      "id": "ig16mvn",
      "text": "Shocked Pikachu face",
      "timestamp": "2022-07-13 19:39:56",
      "score": 1,
      "num_children": 0,
      "author": 326159,
      "replies": []
    },
    {
      "id": "ig17cih",
      "text": "IMAX level projection!",
      "timestamp": "2022-07-13 19:44:32",
      "score": 1,
      "num_children": 0,
      "author": 390854,
      "replies": []
    },
    {
      "id": "ig17nef",
      "text": "BETA!",
      "timestamp": "2022-07-13 19:46:32",
      "score": 1,
      "num_children": 0,
      "author": 271329,
      "replies": []
    },
    {
      "id": "ig17zjs",
      "text": "Is he really \"one of the most popular\"? I thought it was meant to be viewed as unintentional comedy. I mean, he's slow, isn't he?",
      "timestamp": "2022-07-13 19:48:44",
      "score": 1,
      "num_children": 0,
      "author": 15341,
      "replies": []
    },
    {
      "id": "ig18m9o",
      "text": "A timeless classic",
      "timestamp": "2022-07-13 19:52:47",
      "score": 1,
      "num_children": 0,
      "author": 166529,
      "replies": []
    },
    {
      "id": "ig18pjf",
      "text": "What an odd cliche. Self-hatred of the highest order.",
      "timestamp": "2022-07-13 19:53:24",
      "score": 1,
      "num_children": 0,
      "author": 194640,
      "replies": []
    },
    {
      "id": "ig18qih",
      "text": "Of course",
      "timestamp": "2022-07-13 19:53:35",
      "score": 1,
      "num_children": 0,
      "author": 95499,
      "replies": []
    },
    {
      "id": "ig18yga",
      "text": "This mush mouth",
      "timestamp": "2022-07-13 19:55:01",
      "score": 1,
      "num_children": 0,
      "author": 129929,
      "replies": []
    },
    {
      "id": "ig19g67",
      "text": "I almost stopped reading after this gem:\n\n\"Peterson’s ideas about gender can be eccentric even by the standards of his compatriots, with Peterson claiming that a woman who orgasms during sex is somehow “becoming a man,” a practice he frowns upon.\"\n\nFYI, it doesn't get better.",
      "timestamp": "2022-07-13 19:58:13",
      "score": 1,
      "num_children": 0,
      "author": 238953,
      "replies": []
    },
    {
      "id": "ig1a77h",
      "text": "Christians love a bit of bum fun",
      "timestamp": "2022-07-13 20:03:03",
      "score": 1,
      "num_children": 0,
      "author": 390650,
      "replies": []
    },
    {
      "id": "ig1as4r",
      "text": "So pretty much most of the far right are gay. Just not the fabulous kind.",
      "timestamp": "2022-07-13 20:06:49",
      "score": 1,
      "num_children": 0,
      "author": 251619,
      "replies": []
    },
    {
      "id": "ig1baqe",
      "text": "If you're a grindr user you know how many closeted men are like this",
      "timestamp": "2022-07-13 20:10:10",
      "score": 1,
      "num_children": 0,
      "author": 136163,
      "replies": []
    },
    {
      "id": "ig1bdvp",
      "text": "Christians don't just hate others, they hate themselves. ThAtS gAwdS plAnZ fOUr Me!",
      "timestamp": "2022-07-13 20:10:43",
      "score": 1,
      "num_children": 0,
      "author": 381773,
      "replies": []
    },
    {
      "id": "ig1beel",
      "text": "Christians don't just hate others, they hate themselves. ThAtS gAwdS plAnZ fOUr Me!",
      "timestamp": "2022-07-13 20:10:49",
      "score": 1,
      "num_children": 0,
      "author": 381773,
      "replies": []
    },
    {
      "id": "ig1c5ul",
      "text": ">….Peterson claiming that a woman who orgasms during sex is somehow “becoming a man,” a practice he frowns upon.\n\nHates women so much that he doesn’t want them to climax.",
      "timestamp": "2022-07-13 20:15:47",
      "score": 1,
      "num_children": 0,
      "author": 329020,
      "replies": []
    },
    {
      "id": "ig1coca",
      "text": "Shit happens in churches all the time, xhristians are the most hung up on sex being sinful and therefore tend to be the most depraved about it.",
      "timestamp": "2022-07-13 20:19:06",
      "score": 1,
      "num_children": 0,
      "author": 43107,
      "replies": []
    },
    {
      "id": "ig1cym0",
      "text": "🤣",
      "timestamp": "2022-07-13 20:20:55",
      "score": 1,
      "num_children": 0,
      "author": 210702,
      "replies": []
    },
    {
      "id": "ig1d72q",
      "text": ">\"The Daily Beast was not able to substantiate the sexual allegations.\"\n\nCome on DB at least try to do some journalism.",
      "timestamp": "2022-07-13 20:22:25",
      "score": 1,
      "num_children": 0,
      "author": 81990,
      "replies": []
    },
    {
      "id": "ig1e0k0",
      "text": "Something tells me this has happened before….",
      "timestamp": "2022-07-13 20:27:47",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig1ekqi",
      "text": "Fucking of course he would be accused of something like this. This mouth breathing dolt would most likely find this to be the least of his improprieties.",
      "timestamp": "2022-07-13 20:31:22",
      "score": 1,
      "num_children": 0,
      "author": 365033,
      "replies": []
    },
    {
      "id": "ig1esme",
      "text": "Shocker, say it isn’t so.  /s",
      "timestamp": "2022-07-13 20:32:46",
      "score": 1,
      "num_children": 0,
      "author": 8568,
      "replies": []
    },
    {
      "id": "ig1f0z4",
      "text": "*“Whenever I see some Social Conservative from the Midwest Raging about the evils of homosexuality, I set my watch and wait patiently for the day he is found in a motel on his tired old knees, wallet empty, having grossly overpaid to give a blowjob to an Apache transvestite.”* - Christopher Hitchens",
      "timestamp": "2022-07-13 20:34:16",
      "score": 1,
      "num_children": 0,
      "author": 106713,
      "replies": []
    },
    {
      "id": "ig1f2jx",
      "text": "That's because he was raised by his mother! /s",
      "timestamp": "2022-07-13 20:34:33",
      "score": 1,
      "num_children": 0,
      "author": 46631,
      "replies": []
    },
    {
      "id": "ig1f3lf",
      "text": "\\*gasp\\*\n\n&#x200B;\n\n...not really...",
      "timestamp": "2022-07-13 20:34:45",
      "score": 1,
      "num_children": 0,
      "author": 86174,
      "replies": []
    },
    {
      "id": "ig1f6hp",
      "text": "Waht dah!",
      "timestamp": "2022-07-13 20:35:15",
      "score": 1,
      "num_children": 0,
      "author": 46631,
      "replies": []
    },
    {
      "id": "ig1fggs",
      "text": "But he was just researching the behaviors of the sinners!\n\n/s",
      "timestamp": "2022-07-13 20:37:04",
      "score": 1,
      "num_children": 0,
      "author": 33508,
      "replies": []
    },
    {
      "id": "ig1ghe0",
      "text": "> \"I've never witnessed this level of extreme hypocrisy and fraud before.\"\n\nPssh this is nothing on the hypocrisy meter.",
      "timestamp": "2022-07-13 20:43:43",
      "score": 1,
      "num_children": 0,
      "author": 380084,
      "replies": []
    },
    {
      "id": "ig1hoel",
      "text": "r/conservative is masterbating to this",
      "timestamp": "2022-07-13 20:51:35",
      "score": 1,
      "num_children": 0,
      "author": 83154,
      "replies": []
    },
    {
      "id": "ig1htro",
      "text": "Absolutely not surprised. The pastors and personalities making the biggest deal fighting gay rights are usually the ones that hate themselves for sucking dick in the bathroom. Never trust these hypocritical religious swine.",
      "timestamp": "2022-07-13 20:52:35",
      "score": 1,
      "num_children": 0,
      "author": 395597,
      "replies": []
    },
    {
      "id": "ig1htw1",
      "text": "This guy makes my skin crawl. \"Women only get raped because they dress like sluts\" kind of guy.",
      "timestamp": "2022-07-13 20:52:36",
      "score": 1,
      "num_children": 0,
      "author": 325999,
      "replies": []
    },
    {
      "id": "ig1hyb1",
      "text": "Thats actually pretty normal. Conservitives makw the best hypocrits.",
      "timestamp": "2022-07-13 20:53:24",
      "score": 1,
      "num_children": 0,
      "author": 317361,
      "replies": []
    },
    {
      "id": "ig1i966",
      "text": ">\"I've never witnessed this level of extreme hypocrisy and fraud before.\"\n\nWho is this quote from? As most people on this sub know that this is par for the course. This happens so often that when religious / political people scream about how disgusting sex is or homosexuals or they start calling everyone they disagree with a pedophile, people actually start taking bets over their downfall. \n\nUsually within a few months or years, the person is found out to have children outside of marriage, homosexual relationships or they participated in some form of non-consensual / statutory rape. It happens so often, people predict it, with no real knowledge of the person, and it comes true. It isn't a bug, it's a feature. It seems to be their default position and their phony 'disgust about all things sexual' is by design. \n\nBy talking about how 'disgusting' it is, this allows them to speak publicly about it and thus attract others with similar interests while simultaneously currying favor with the 'high moral standards' crowd.  In the end, it is just more of the same old religious hypocrisy that we have seen day after day, year after year for literally thousands of years. It's just more of the same old “Rules for thee but not for me”.",
      "timestamp": "2022-07-13 20:55:21",
      "score": 1,
      "num_children": 0,
      "author": 369404,
      "replies": []
    },
    {
      "id": "ig1iwqp",
      "text": "Guilty conscience mfs always run to christianity for easy-bake-oven forgiveness and the right-wing because right-wingers shower them with money as long as they're told what they want to hear.",
      "timestamp": "2022-07-13 20:59:43",
      "score": 1,
      "num_children": 0,
      "author": 68776,
      "replies": []
    },
    {
      "id": "ig1ix1m",
      "text": "> I've never witnessed this level of extreme hypocrisy\n\nGuy must not know many religious leaders.",
      "timestamp": "2022-07-13 20:59:46",
      "score": 1,
      "num_children": 0,
      "author": 255322,
      "replies": []
    },
    {
      "id": "ig1ix94",
      "text": "Pretty typical really… The louder they scream about it the more you can be assured they participated! So very churchy you got a love it.",
      "timestamp": "2022-07-13 20:59:49",
      "score": 1,
      "num_children": 0,
      "author": 115580,
      "replies": []
    },
    {
      "id": "ig1iyo4",
      "text": "The guy is hilarious. Pics or it didn’t happen.",
      "timestamp": "2022-07-13 21:00:05",
      "score": 1,
      "num_children": 0,
      "author": 388591,
      "replies": []
    },
    {
      "id": "ig1leqz",
      "text": "Isn't Jesse a girls name?",
      "timestamp": "2022-07-13 21:16:20",
      "score": 1,
      "num_children": 0,
      "author": 206935,
      "replies": []
    },
    {
      "id": "ig1mm0c",
      "text": "I am not in the least bit surprised.",
      "timestamp": "2022-07-13 21:24:24",
      "score": 1,
      "num_children": 0,
      "author": 149682,
      "replies": []
    },
    {
      "id": "ig1nr3w",
      "text": "Lol never ?",
      "timestamp": "2022-07-13 21:32:09",
      "score": 1,
      "num_children": 0,
      "author": 347682,
      "replies": []
    },
    {
      "id": "ig1qmfv",
      "text": "Amazin'  \n\n\nHe LOVE black ppl",
      "timestamp": "2022-07-13 21:51:41",
      "score": 1,
      "num_children": 0,
      "author": 234502,
      "replies": []
    },
    {
      "id": "ig1qrnr",
      "text": "This guy has a talent of making ANYONE seem smart in comparison. Fuckin hell the banana guy who said banana’s were God’s coke tabs was a class act when debating this shit stain of a person.",
      "timestamp": "2022-07-13 21:52:40",
      "score": 1,
      "num_children": 1,
      "author": 258015,
      "replies": [
        {
          "id": "ig1qunu",
          "text": "Along with being a huge homophobe, he hates women and atheists.",
          "timestamp": "2022-07-13 21:53:14",
          "score": 1,
          "num_children": 0,
          "author": 258015,
          "replies": []
        }
      ]
    },
    {
      "id": "ig1r6gq",
      "text": "I couldve fucking told you that, i see some of his videos trending on Facebook and i call this shit out every time I see it.",
      "timestamp": "2022-07-13 21:55:28",
      "score": 1,
      "num_children": 0,
      "author": 122807,
      "replies": []
    },
    {
      "id": "ig1rfmg",
      "text": "Who's surprised? Not me.\n\nBeta!",
      "timestamp": "2022-07-13 21:57:12",
      "score": 1,
      "num_children": 0,
      "author": 191382,
      "replies": []
    },
    {
      "id": "ig1rfnf",
      "text": "Isn't every one tired of being led by people who don't follow the same rules they preach? Aren't people tired of the hypocrisy? \n\nWhen are people going to learn that the people leading them to hate don't follow their own ideologies? These people don't believe what they're trying to sell you so you shouldn't either.",
      "timestamp": "2022-07-13 21:57:12",
      "score": 1,
      "num_children": 0,
      "author": 311130,
      "replies": []
    },
    {
      "id": "ig1rsfa",
      "text": "Those dudes are ALWAYS getting DL Birdsucks.",
      "timestamp": "2022-07-13 21:59:38",
      "score": 1,
      "num_children": 0,
      "author": 22700,
      "replies": []
    },
    {
      "id": "ig1sadh",
      "text": "These are NEVER surprising. In fact, at this point if people are Anti-LGBT and in any type of religious leadership I almost assume at least this much is going on at some point. It's just way too common.",
      "timestamp": "2022-07-13 22:03:01",
      "score": 1,
      "num_children": 0,
      "author": 362330,
      "replies": []
    },
    {
      "id": "ig1skkw",
      "text": "I'm shocked! /s",
      "timestamp": "2022-07-13 22:04:59",
      "score": 1,
      "num_children": 0,
      "author": 59659,
      "replies": []
    },
    {
      "id": "ig1szn4",
      "text": "The more hardcore and extreme they fight the more they are complicit in the shit they are preaching against.",
      "timestamp": "2022-07-13 22:07:55",
      "score": 1,
      "num_children": 0,
      "author": 239376,
      "replies": []
    },
    {
      "id": "ig1tays",
      "text": "This is always the case. The ones pointing fingers the most are the ones with the most to hide..",
      "timestamp": "2022-07-13 22:10:07",
      "score": 1,
      "num_children": 0,
      "author": 109615,
      "replies": []
    },
    {
      "id": "ig1th33",
      "text": "\"I've never witnessed this level of extreme hypocrisy and fraud before.\"\n\nUm, that's most Christians isn't it? Love thy neighbor, but the want to tar and feather any immigrant. Absolutely obsessed with guns and killing people.",
      "timestamp": "2022-07-13 22:11:20",
      "score": 1,
      "num_children": 0,
      "author": 2810,
      "replies": []
    },
    {
      "id": "ig1uk92",
      "text": "I'm remembering that moment when Vaush told Jesse he was very good looking for his age and I'm gonna bet he had to adjust his pants a bit.",
      "timestamp": "2022-07-13 22:19:01",
      "score": 1,
      "num_children": 0,
      "author": 165141,
      "replies": []
    },
    {
      "id": "ig1un0z",
      "text": "“I’ve never witnessed this level of extreme hypocrisy and fraud before.”  Then you haven’t been paying attention.",
      "timestamp": "2022-07-13 22:19:32",
      "score": 1,
      "num_children": 0,
      "author": 13286,
      "replies": []
    },
    {
      "id": "ig1uryn",
      "text": "Never seen this level of extreme hypocrisy and fraud before?\n\n[See:  Ted Haggard Is Completely Heterosexual](https://www.youtube.com/watch?v=HZmHC75FDqQ)",
      "timestamp": "2022-07-13 22:20:29",
      "score": 1,
      "num_children": 0,
      "author": 254853,
      "replies": []
    },
    {
      "id": "ig1uu4y",
      "text": "shocked I tell you shocked",
      "timestamp": "2022-07-13 22:20:54",
      "score": 1,
      "num_children": 0,
      "author": 44565,
      "replies": []
    },
    {
      "id": "ig1v32w",
      "text": "Projection at its finest",
      "timestamp": "2022-07-13 22:22:38",
      "score": 1,
      "num_children": 0,
      "author": 230021,
      "replies": []
    },
    {
      "id": "ig1vs52",
      "text": "\"Closeted hatemonger gets busted being a hypocrite\"\n\n\nA tale as old as time........\n\n\nSeriously, it's now the stereotype: the more you scream \"Gay is bad\", the more likely you bottom and love it.",
      "timestamp": "2022-07-13 22:27:30",
      "score": 1,
      "num_children": 0,
      "author": 203711,
      "replies": []
    },
    {
      "id": "ig1x0fj",
      "text": "I'm pretty sure he's legit mentally disabled",
      "timestamp": "2022-07-13 22:36:11",
      "score": 1,
      "num_children": 0,
      "author": 148349,
      "replies": []
    },
    {
      "id": "ig1xste",
      "text": "What is the pathology of this kind of behaviour? Why do so many of these outspoken fundamentalists end up getting exposed for being the very thing they preach against?",
      "timestamp": "2022-07-13 22:41:47",
      "score": 1,
      "num_children": 0,
      "author": 159539,
      "replies": []
    },
    {
      "id": "ig1y85d",
      "text": "\"I've never witnessed this level of extreme hypocrisy and fraud before.\"\n\nI have.",
      "timestamp": "2022-07-13 22:44:49",
      "score": 1,
      "num_children": 1,
      "author": 62550,
      "replies": [
        {
          "id": "ig1yr6b",
          "text": "It’s about on par for the course",
          "timestamp": "2022-07-13 22:48:39",
          "score": 1,
          "num_children": 0,
          "author": 373516,
          "replies": []
        }
      ]
    },
    {
      "id": "ig1y8jf",
      "text": "Forbidden fruit, nothing else.",
      "timestamp": "2022-07-13 22:44:54",
      "score": 1,
      "num_children": 0,
      "author": 319139,
      "replies": []
    },
    {
      "id": "ig1ya4r",
      "text": "Cock sucking asshole!",
      "timestamp": "2022-07-13 22:45:13",
      "score": 1,
      "num_children": 0,
      "author": 353555,
      "replies": []
    },
    {
      "id": "ig1yajm",
      "text": "Oh yes. I’m here for it. Wya Hasan",
      "timestamp": "2022-07-13 22:45:18",
      "score": 1,
      "num_children": 0,
      "author": 265860,
      "replies": []
    },
    {
      "id": "ig1yl7c",
      "text": "Self-Loathing is a requisite",
      "timestamp": "2022-07-13 22:47:26",
      "score": 1,
      "num_children": 0,
      "author": 309152,
      "replies": []
    },
    {
      "id": "ig1zdaz",
      "text": "AMAZIN",
      "timestamp": "2022-07-13 22:52:58",
      "score": 1,
      "num_children": 0,
      "author": 302565,
      "replies": []
    },
    {
      "id": "ig1zlcu",
      "text": "You know what catholic priest have been doing right?",
      "timestamp": "2022-07-13 22:54:33",
      "score": 1,
      "num_children": 0,
      "author": 8775,
      "replies": []
    },
    {
      "id": "ig1zpng",
      "text": "The manosphere sounds like an underground gay sex club.",
      "timestamp": "2022-07-13 22:55:25",
      "score": 1,
      "num_children": 0,
      "author": 349304,
      "replies": []
    },
    {
      "id": "ig2040e",
      "text": "Amazin.",
      "timestamp": "2022-07-13 22:58:19",
      "score": 1,
      "num_children": 0,
      "author": 218148,
      "replies": []
    },
    {
      "id": "ig20agr",
      "text": "> In the hyper-masculine right-wing internet community known as the “manosphere,” few figures loom larger than Jesse Lee Peterson.\n\nCan I go back in time three minutes so I can unread the word “manosphere”?",
      "timestamp": "2022-07-13 22:59:37",
      "score": 1,
      "num_children": 0,
      "author": 345077,
      "replies": []
    },
    {
      "id": "ig2134d",
      "text": "amazing!",
      "timestamp": "2022-07-13 23:05:20",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig218kc",
      "text": "So whoever was quoted as saying that hasn't been alive long, I take it? We've seen stories about guys like Peterson for years now. This sort of nonsense from people like him happens like all the time.",
      "timestamp": "2022-07-13 23:06:25",
      "score": 1,
      "num_children": 0,
      "author": 117064,
      "replies": []
    },
    {
      "id": "ig221v8",
      "text": "How unsurprising",
      "timestamp": "2022-07-13 23:12:18",
      "score": 1,
      "num_children": 0,
      "author": 92406,
      "replies": []
    },
    {
      "id": "ig22k82",
      "text": "If you are publicly anti gay and go to the trouble of making events out of it I automatically assume your into sucking dick and have a shame kink. I think the evidence over time agrees with me",
      "timestamp": "2022-07-13 23:16:02",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig2312d",
      "text": "Shocking...I tell you...shocking....time to ban christians",
      "timestamp": "2022-07-13 23:19:28",
      "score": 1,
      "num_children": 0,
      "author": 63876,
      "replies": []
    },
    {
      "id": "ig23j3k",
      "text": "BETA",
      "timestamp": "2022-07-13 23:23:07",
      "score": 1,
      "num_children": 0,
      "author": 91849,
      "replies": []
    },
    {
      "id": "ig23kvv",
      "text": "It’s always projection with these types…",
      "timestamp": "2022-07-13 23:23:29",
      "score": 1,
      "num_children": 0,
      "author": 182564,
      "replies": []
    },
    {
      "id": "ig24itn",
      "text": "I know how this goea. He says he's not gay just has worldly temptations of the carnal mind or some shit and says he's praying it away as with any addiction or temptation.",
      "timestamp": "2022-07-13 23:30:23",
      "score": 1,
      "num_children": 0,
      "author": 126069,
      "replies": []
    },
    {
      "id": "ig25pxr",
      "text": "A-may-zin!",
      "timestamp": "2022-07-13 23:39:09",
      "score": 1,
      "num_children": 0,
      "author": 372471,
      "replies": []
    },
    {
      "id": "ig25qo4",
      "text": "Someone link me to when Destiny gets on this cuz god damnnn this is gonna be good",
      "timestamp": "2022-07-13 23:39:18",
      "score": 1,
      "num_children": 0,
      "author": 269666,
      "replies": []
    },
    {
      "id": "ig2644z",
      "text": "*DJ Khalid voice*\n\nAnotha one.",
      "timestamp": "2022-07-13 23:42:03",
      "score": 1,
      "num_children": 0,
      "author": 321020,
      "replies": []
    },
    {
      "id": "ig26756",
      "text": "Did the guy provide any evidence of that 10 year relationship? Article says the daily breast couldn't back the claim with proof.",
      "timestamp": "2022-07-13 23:42:39",
      "score": 1,
      "num_children": 0,
      "author": 34301,
      "replies": []
    },
    {
      "id": "ig26b83",
      "text": "Gay men in denial can be the most vicious homo phoebes.",
      "timestamp": "2022-07-13 23:43:28",
      "score": 1,
      "num_children": 0,
      "author": 189765,
      "replies": []
    },
    {
      "id": "ig277hb",
      "text": "Knew it",
      "timestamp": "2022-07-13 23:49:59",
      "score": 1,
      "num_children": 0,
      "author": 2024,
      "replies": []
    },
    {
      "id": "ig27k03",
      "text": "Haha , whom ever yells the loudest is what again! I really hope this article is true.",
      "timestamp": "2022-07-13 23:52:33",
      "score": 1,
      "num_children": 0,
      "author": 69163,
      "replies": []
    },
    {
      "id": "ig2805h",
      "text": "He had to go into deep cover to understand his arguments more. Deep",
      "timestamp": "2022-07-13 23:55:54",
      "score": 1,
      "num_children": 0,
      "author": 18817,
      "replies": []
    },
    {
      "id": "ig2b3ln",
      "text": "So glad scandals are coming out about this douchebag. I cant stand him in literally every discussion/debate I've seen him in. He argues dishonestly and seems to try to get people to react emotional with his infamatory nonsense just so he can end up saying \"The left is emotional.\"\n\nTrash human being.",
      "timestamp": "2022-07-14 00:18:55",
      "score": 1,
      "num_children": 0,
      "author": 111999,
      "replies": []
    },
    {
      "id": "ig2bw4g",
      "text": "Can they please stop empowering that damn stereotype?",
      "timestamp": "2022-07-14 00:24:43",
      "score": 1,
      "num_children": 0,
      "author": 10217,
      "replies": []
    },
    {
      "id": "ig2d0cu",
      "text": "Amazin'",
      "timestamp": "2022-07-14 00:33:00",
      "score": 1,
      "num_children": 0,
      "author": 28452,
      "replies": []
    },
    {
      "id": "ig2fthe",
      "text": "I honestly couldn't believe it when I found out he was a real conservative mouthpiece. I thought it was some goofy over the top parody.\n\nI'm still not convinced but it's terrifying there are people that follow him and agree with the drivel that comes out of his mouth.",
      "timestamp": "2022-07-14 00:53:41",
      "score": 1,
      "num_children": 0,
      "author": 15389,
      "replies": []
    },
    {
      "id": "ig2g59q",
      "text": "derogatory stereo-types like 'uncle tom' exist for a reason",
      "timestamp": "2022-07-14 00:56:05",
      "score": 1,
      "num_children": 0,
      "author": 284549,
      "replies": []
    },
    {
      "id": "ig2g655",
      "text": "In some sense, I wouldn't be surprised if this was extreme trolling despite how much he deserves it. On the other hand, I wouldn't be surprised if this was completely legit",
      "timestamp": "2022-07-14 00:56:17",
      "score": 1,
      "num_children": 0,
      "author": 37279,
      "replies": []
    },
    {
      "id": "ig2gqpr",
      "text": "One side being accused of but never proven the other side actively being arrested for child porn, pedophilia and rape. Psychology 101. Point the finger and accuse to redirect attention away from yourself or your party. Lame",
      "timestamp": "2022-07-14 01:00:30",
      "score": 1,
      "num_children": 1,
      "author": 402533,
      "replies": [
        {
          "id": "igeuctb",
          "text": "STFU. Take an afternoon to read facts, not opinions or made up dribble like what you spew:  \n  \nList Of Convicted Republican Pedophiles: Feel free to research these people independently.\n\nRepublican anti-abortion activist Howard Scott Heldreth is a convicted child rapist in Florida.\n\nRepublican County Commissioner David Swartz pleaded guilty to molesting two girls under the age of 11 and was sentenced to 8 years in prison.\n\nRepublican judge Mark Pazuhanich pleaded no contest to fondling a 10-year old girl and was sentenced to 10 years probation.\n\nRepublican anti-abortion activist Nicholas Morency pleaded guilty to possessing child pornography on his computer and offering a bounty to anybody who murders an abortion doctor.\n\nRepublican legislator Edison Misla Aldarondo was sentenced to 10 years in prison for raping his daughter between the ages of 9 and 17.\n\nRepublican Mayor Philip Giordano is serving a 37-year sentence in federal prison for sexually abusing 8- and 10-year old girls.\n\nRepublican campaign consultant Tom Shortridge was sentenced to three years probation for taking nude photographs of a 15-year old girl.\n\nRepublican racist pedophile and United States Senator Strom Thurmond had sex with a 15-year old black girl which produced a child.\n\nRepublican pastor Mike Hintz, whom George W. Bush commended during the 2004 presidential campaign, surrendered to police after admitting to a sexual affair with a female juvenile.\n\nRepublican legislator Peter Dibble pleaded no contest to having an inappropriate relationship with a 13-year-old girl.\n\nRepublican Congressman Donald \"Buz\" Lukens was found guilty of having sex with a female minor and sentenced to one month in jail.\n\nRepublican fundraiser Richard A. Delgaudio was found guilty of child porn charges and paying two teenage girls to pose for sexual photos.\n\nRepublican activist Mark A. Grethen convicted on six counts of sex crimes involving children.\n\nRepublican activist Randal David Ankeney pleaded guilty to attempted sexual assault on a child.\n\nRepublican Congressman Dan Crane had sex with a female minor working as a congressional page.\n\nRepublican activist and Christian Coalition leader Beverly Russell admitted to an incestuous relationship with his step daughter.\n\nRepublican congressman and anti-gay activist Robert Bauman* was charged with having sex with a 16-year-old boy he picked up at a gay bar.\n\nRepublican Committee Chairman Jeffrey Patti was arrested for distributing a video clip of a 5-year-old girl being raped.\n\nRepublican legislative aide Howard L. Brooks* was charged with molesting a 12-year old boy and possession of child pornography.\n\nRepublican Senate candidate John Hathaway was accused of having sex with his 12-year old baby sitter and withdrew his candidacy after the allegations were reported in the media.\n\nRepublican preacher Stephen White*, who demanded a return to traditional values, was sentenced to jail after offering $20 to a 14-year-old boy for permission to perform oral sex on him.\n\nRepublican talk show host Jon Matthews pleaded guilty to exposing his genitals to an 11 year old girl.\n\nRepublican anti-gay activist Earl \"Butch\" Kimmerling was sentenced to 40 years in prison for molesting an 8-year old girl after he attempted to stop a gay couple from adopting her.\n\nRepublican Party leader Paul Ingram pleaded guilty to six counts of raping his daughters and served 14 years in federal prison.\n\nRepublican election board official Kevin Coan was sentenced to two years probation for soliciting sex over the internet from a 14-year old girl.\n\nRepublican politician Andrew Buhr* was charged with two counts of first degree sodomy with a 13-year old boy.\n\nRepublican politician Keith Westmoreland was arrested on seven felony counts of lewd and lascivious exhibition to girls under the age of 16 (i.e. exposing himself to children).\n\nRepublican anti-abortion activist John Allen Burt was charged with sexual misconduct involving a 15-year old girl.\n\nRepublican County Councilman Keola Childs* pleaded guilty to molesting a male child.\n\nRepublican activist John Butler was charged with criminal sexual assault on a teenage girl.\n\nRepublican candidate Richard Gardner admitted to molesting his two daughters.\n\nRepublican City Councilman Fred C. Smeltzer, Jr. pleaded no contest to raping a 15 year-old girl and served 6-months in prison.\n\nRepublican activist Parker J. Bena pleaded guilty to possession of child pornography on his home computer and was sentenced to 30 months in federal prison and fined $18,000.\n\nRepublican strategist and Citadel Military College graduate Robin Vanderwall* was convicted in Virginia on five counts of soliciting sex from boys and girls over the internet.\n\nRepublican businessman Jon Grunseth withdrew his candidacy for Minnesota governor after allegations surfaced that he went swimming in the nude with four underage girls, including his daughter.\n\nRepublican director of the \"Young Republican Federation\" Nicholas Elizondo molested his 6-year old daughter and was sentenced to six years in prison.\n\nRepublican benefactor of conservative Christian groups, Richard A. Dasen Sr., was charged with rape for allegedly paying a 15-year old girl for sex. Dasen, 62, who is married with grown children and several grandchildren, has allegedly told police that over the past decade he paid more than $1 million to have sex with a large number of young.\n\nRepublican state senator Ralph Shortey from Oklahoma admitted to being involved in sodomy with a 17 year old male prostitute and transporting child pornography.\n\nRepublican Speaker of the House Dennis Hastert in jail for the payments he made to cover up raping his wrestlers when he was a high school coach.\n\nRepublican Judge and campaign official Tim Nolan for President Donald Trump indicted for human trafficking and forcing a minors (9) to engage in sexual activity and giving alcohol to minors (results from the court pending).\n\nGOP: The party of Family Values",
          "timestamp": "2022-07-16 16:38:10",
          "score": 2,
          "num_children": 0,
          "author": 290715,
          "replies": []
        }
      ]
    },
    {
      "id": "ig2gqr8",
      "text": "Never experienced this kind of thing before. \n\nExcept for last week, I guess. \n\nOh and there were those 3 times last month.\n\nBut almost never before.",
      "timestamp": "2022-07-14 01:00:30",
      "score": 1,
      "num_children": 0,
      "author": 94604,
      "replies": []
    },
    {
      "id": "ig2hlra",
      "text": "[Haggard's Law strikes again!](https://rationalwiki.org/wiki/Haggard%27s_Law)",
      "timestamp": "2022-07-14 01:06:49",
      "score": 1,
      "num_children": 0,
      "author": 42557,
      "replies": []
    },
    {
      "id": "ig2idkq",
      "text": "just another day in Jesusville",
      "timestamp": "2022-07-14 01:12:36",
      "score": 1,
      "num_children": 0,
      "author": 163956,
      "replies": []
    },
    {
      "id": "ig2iyk6",
      "text": "I’ve always thought this dude was just fucked in the head. He just a self hating person. Not a surprise he’s a pedo.",
      "timestamp": "2022-07-14 01:16:57",
      "score": 1,
      "num_children": 1,
      "author": 217885,
      "replies": [
        {
          "id": "ig2joq3",
          "text": "He said he thinks white people are superior, while being black himself. He either really hates himself, or he likes the fame you get from being the token conservative black guy",
          "timestamp": "2022-07-14 01:22:19",
          "score": 1,
          "num_children": 0,
          "author": 39918,
          "replies": []
        }
      ]
    },
    {
      "id": "ig2j29l",
      "text": "I've never heard of him before, so I question how popular he really is.",
      "timestamp": "2022-07-14 01:17:44",
      "score": 1,
      "num_children": 0,
      "author": 154175,
      "replies": []
    },
    {
      "id": "ig2kan8",
      "text": "[Geez what a BETA!](https://youtu.be/VRq4I1a1iVw)",
      "timestamp": "2022-07-14 01:26:53",
      "score": 1,
      "num_children": 0,
      "author": 147211,
      "replies": []
    },
    {
      "id": "ig2kbkh",
      "text": "It’s just time for some bootilicious boys to start blackmailing all of them. But of course there is no original sin and it’s probably done plenty of times.",
      "timestamp": "2022-07-14 01:27:04",
      "score": 1,
      "num_children": 0,
      "author": 404647,
      "replies": []
    },
    {
      "id": "ig2l7eb",
      "text": "The two people in question are part of an organization that dislikes JLP. So almost guarantee to be fake. BETA!",
      "timestamp": "2022-07-14 01:33:42",
      "score": 1,
      "num_children": 0,
      "author": 327451,
      "replies": []
    },
    {
      "id": "ig2nz0s",
      "text": "I had an older lady tell me \"If you want to know the sins of a pastor pay attention to what he preaches against the most.\" I think of her every time I read about someone like him.",
      "timestamp": "2022-07-14 01:54:35",
      "score": 1,
      "num_children": 0,
      "author": 34930,
      "replies": []
    },
    {
      "id": "ig2oqgn",
      "text": "Amazin'!",
      "timestamp": "2022-07-14 02:00:24",
      "score": 1,
      "num_children": 0,
      "author": 292627,
      "replies": []
    },
    {
      "id": "ig2p1zp",
      "text": "As Jesse like to say, BETA!!",
      "timestamp": "2022-07-14 02:02:47",
      "score": 1,
      "num_children": 0,
      "author": 25570,
      "replies": []
    },
    {
      "id": "ig2pj3k",
      "text": "Well how else can he preach against homosexuality without trying it out to make sure it's evil first.",
      "timestamp": "2022-07-14 02:06:24",
      "score": 1,
      "num_children": 0,
      "author": 329313,
      "replies": []
    },
    {
      "id": "ig2pl8v",
      "text": "Yawn, par for the course anymore.",
      "timestamp": "2022-07-14 02:06:51",
      "score": 1,
      "num_children": 0,
      "author": 216528,
      "replies": []
    },
    {
      "id": "ig2q6lk",
      "text": "Wasnt there a republican (openly anti-LGBTQ+) in a wheelchair who recently got caught involved in homosexual acts at a party?",
      "timestamp": "2022-07-14 02:11:27",
      "score": 1,
      "num_children": 0,
      "author": 201564,
      "replies": []
    },
    {
      "id": "ig2q8lw",
      "text": "Clearly you haven’t read the history of the Catholic Church",
      "timestamp": "2022-07-14 02:11:54",
      "score": 1,
      "num_children": 0,
      "author": 113669,
      "replies": []
    },
    {
      "id": "ig2qjrs",
      "text": "At this point it is fair to assume every LGBTQ hater can be found with a cock in their mouth!",
      "timestamp": "2022-07-14 02:14:19",
      "score": 1,
      "num_children": 0,
      "author": 58428,
      "replies": []
    },
    {
      "id": "ig2r8dl",
      "text": "God brings good news to Jesse Lee Peterson's flock.",
      "timestamp": "2022-07-14 02:19:36",
      "score": 1,
      "num_children": 0,
      "author": 162680,
      "replies": []
    },
    {
      "id": "ig2rpjl",
      "text": "It’s always the loudest protestors who are secretly doing that shit",
      "timestamp": "2022-07-14 02:23:16",
      "score": 1,
      "num_children": 0,
      "author": 310757,
      "replies": []
    },
    {
      "id": "ig2rqei",
      "text": "Have they just not ever watched anything with Republicans in it? This doesn't even make the top 100 in hypocritical bullshit.",
      "timestamp": "2022-07-14 02:23:27",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig2st7b",
      "text": "Some of these people are homophobic because they are worried that they like the taste of cock and balls.",
      "timestamp": "2022-07-14 02:31:56",
      "score": 1,
      "num_children": 0,
      "author": 190871,
      "replies": []
    },
    {
      "id": "ig2t06p",
      "text": "You're next, Ben",
      "timestamp": "2022-07-14 02:33:28",
      "score": 1,
      "num_children": 0,
      "author": 356155,
      "replies": []
    },
    {
      "id": "ig2t5h6",
      "text": "And today in other news that isn't surprising in the slightest....",
      "timestamp": "2022-07-14 02:34:36",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig2vl3u",
      "text": "Never consider a Xian to be anything but either:  \nStupid  \nCrazy  \nEvil  \nBigoted  \nOr hypocritical  \n\n\nOr some combination thereof.",
      "timestamp": "2022-07-14 02:54:12",
      "score": 1,
      "num_children": 0,
      "author": 240558,
      "replies": []
    },
    {
      "id": "ig2vlk1",
      "text": "That shadow projection",
      "timestamp": "2022-07-14 02:54:18",
      "score": 1,
      "num_children": 0,
      "author": 5329,
      "replies": []
    },
    {
      "id": "ig2wz2w",
      "text": "This part is suspicious:\n\nRooney told The Daily Beast he doesn’t have emails, text messages, or recordings that could prove his allegations.\n\n“Jesse Lee Peterson is a very smart person, he’s a sly person,” Rooney said. “He’s not going to leave a lot of extraneous evidence out about what he does”\n\nIt’s tough to leave zero evidence over a 10 year affair",
      "timestamp": "2022-07-14 03:05:30",
      "score": 1,
      "num_children": 0,
      "author": 183275,
      "replies": []
    },
    {
      "id": "ig2xer1",
      "text": "I'm definitely not a jlp fan... though those interviews with destiny were entertaining... but everything is just allegation so far and nobody seems to have evidence. So we should reserve judgment",
      "timestamp": "2022-07-14 03:09:06",
      "score": 1,
      "num_children": 0,
      "author": 52202,
      "replies": []
    },
    {
      "id": "ig2xhon",
      "text": "This is extremely common. The ones making the biggest deal about being gay, are closet cases. Nobody else cares. \n\nGoogle University of North Carolina homophobia study.",
      "timestamp": "2022-07-14 03:09:48",
      "score": 1,
      "num_children": 0,
      "author": 290456,
      "replies": []
    },
    {
      "id": "ig2xkpc",
      "text": "O'MAZIN'!",
      "timestamp": "2022-07-14 03:10:30",
      "score": 1,
      "num_children": 0,
      "author": 285678,
      "replies": []
    },
    {
      "id": "ig2ygqt",
      "text": "Jesse Lee Peterson is one of those self hating black people. He is so fucking stupid, you get no pleasure making fun of him. I legit pity him because his brain is beyond fucked. \n\nThe hypocrisy obviously doesn’t surprise me though.",
      "timestamp": "2022-07-14 03:17:56",
      "score": 1,
      "num_children": 0,
      "author": 398946,
      "replies": []
    },
    {
      "id": "ig2ymlg",
      "text": "Blah blah blah…. Did he ask for forgiveness?",
      "timestamp": "2022-07-14 03:19:14",
      "score": 1,
      "num_children": 0,
      "author": 106374,
      "replies": []
    },
    {
      "id": "ig2yy4y",
      "text": "I think of this quote often:\n\n“Whenever I hear some bigmouth in Washington or the Christian heartland banging on about the evils of sodomy or whatever, I mentally enter his name in my notebook and contentedly set my watch. Sooner rather than later, he will be discovered down on his weary and well-worn old knees in some dreary motel or latrine, with an expired Visa card, having tried to pay well over the odds to be peed upon by some Apache transvestite.”\n\nChristopher Hitchens",
      "timestamp": "2022-07-14 03:21:51",
      "score": 1,
      "num_children": 0,
      "author": 273907,
      "replies": []
    },
    {
      "id": "ig2z24s",
      "text": "This guy is so evil",
      "timestamp": "2022-07-14 03:22:48",
      "score": 1,
      "num_children": 0,
      "author": 231094,
      "replies": []
    },
    {
      "id": "ig2z3x5",
      "text": "I, for one, am SHOCKED.",
      "timestamp": "2022-07-14 03:23:13",
      "score": 1,
      "num_children": 0,
      "author": 31320,
      "replies": []
    },
    {
      "id": "ig2zwaw",
      "text": "Most of these whack jobs are in the closet and they will never admit it for as long as they live.",
      "timestamp": "2022-07-14 03:29:56",
      "score": 1,
      "num_children": 0,
      "author": 131983,
      "replies": []
    },
    {
      "id": "ig2zwel",
      "text": "It’s witnessed all the time, in exactly the same fashion",
      "timestamp": "2022-07-14 03:29:57",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig30o1h",
      "text": "That flies right by hypocrisy and runs head on into mental illness",
      "timestamp": "2022-07-14 03:36:21",
      "score": 1,
      "num_children": 0,
      "author": 183503,
      "replies": []
    },
    {
      "id": "ig327yz",
      "text": "Welcome to the GQP.",
      "timestamp": "2022-07-14 03:49:51",
      "score": 1,
      "num_children": 0,
      "author": 81211,
      "replies": []
    },
    {
      "id": "ig34867",
      "text": "My first thought was “THAT dipshit is one of the most popular preachers?”",
      "timestamp": "2022-07-14 04:07:53",
      "score": 1,
      "num_children": 0,
      "author": 395013,
      "replies": []
    },
    {
      "id": "ig36nyh",
      "text": "Every fucking time.",
      "timestamp": "2022-07-14 04:30:49",
      "score": 1,
      "num_children": 0,
      "author": 390008,
      "replies": []
    },
    {
      "id": "ig3h920",
      "text": "Im not sure if this is just a power fetishist so he chose the party that is most easily manipulated or is this just some extreme self-hate display.\n\nA dream case study for psychology.",
      "timestamp": "2022-07-14 06:26:26",
      "score": 1,
      "num_children": 0,
      "author": 265068,
      "replies": []
    },
    {
      "id": "ig3hmd7",
      "text": "Yo dude, that's pretty racist! You can't say that!",
      "timestamp": "2022-07-14 06:31:06",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig3jr04",
      "text": "That’s amazin",
      "timestamp": "2022-07-14 06:57:59",
      "score": 1,
      "num_children": 0,
      "author": 320904,
      "replies": []
    },
    {
      "id": "ig3m0va",
      "text": "I hope he doesn't use that photo on Grindr.",
      "timestamp": "2022-07-14 07:27:47",
      "score": 1,
      "num_children": 0,
      "author": 996,
      "replies": []
    },
    {
      "id": "ig3m5lr",
      "text": "Oh an anti LGBT Christian turns out to be engaged in homosexual activities, who could have guessed...",
      "timestamp": "2022-07-14 07:29:32",
      "score": 1,
      "num_children": 0,
      "author": 333897,
      "replies": []
    },
    {
      "id": "ig3n1ez",
      "text": "When is it gonna end Robbie?",
      "timestamp": "2022-07-14 07:41:22",
      "score": 1,
      "num_children": 0,
      "author": 496,
      "replies": []
    },
    {
      "id": "ig3onyb",
      "text": "This extreme level of hypocrisy and fraud has been present in all aspects of Christianity for a very long time …. This is not new.\n\nThe GOP is on an entirely different level of extreme hypocrisy and fraud. \n\nWe’ve all witnessed this.",
      "timestamp": "2022-07-14 08:03:44",
      "score": 1,
      "num_children": 0,
      "author": 400802,
      "replies": []
    },
    {
      "id": "ig3p930",
      "text": "Look at a ministers sermons of a 12 month time. Whatever subject they preach against the most is usually what they are up to in secret.\n\nWhen my dad was an active minister it was also LGBT and truth of God. Later in life as an adult I would be selected to fix his PC from virus he contracted on twink websites more than once. Rev. Chuck Colson of the watergate scandal was his hero of course. I've always hated my dad, not because he was closeted but because he was a giant idiot who's entire personality was his religion.\n\nTruth of god is basically repeat specific promises from the bible and then guessing about how they might be fulfilled.\n\nMy dad was essentially the leader of a book club for a living but he also believed the low tech bread toaster MUST be unplugged when not in use or the house will burn down.\n\nSeriously, he is a complete dumbass who thought he could make a living telling others how to live. He only lasted 11 years until the kicked him out. I was already an adult in the military by then. What a joke. Pretty sure he is double digit IQ only.",
      "timestamp": "2022-07-14 08:11:48",
      "score": 1,
      "num_children": 0,
      "author": 178835,
      "replies": []
    },
    {
      "id": "ig3pclk",
      "text": "“I’ve never witnessed this level of hypocrisy” this happens every other week with these kinds of practitioners",
      "timestamp": "2022-07-14 08:13:12",
      "score": 1,
      "num_children": 0,
      "author": 188938,
      "replies": []
    },
    {
      "id": "ig3r3nt",
      "text": "Destiny vs Peterson debate 2022 would be fucking crazy right now.",
      "timestamp": "2022-07-14 08:37:30",
      "score": 1,
      "num_children": 0,
      "author": 252593,
      "replies": []
    },
    {
      "id": "ig3s2s2",
      "text": "Honestly I'm not fucking shocked",
      "timestamp": "2022-07-14 08:50:58",
      "score": 1,
      "num_children": 0,
      "author": 304756,
      "replies": []
    },
    {
      "id": "ig3s9tr",
      "text": "AMAZN",
      "timestamp": "2022-07-14 08:53:42",
      "score": 1,
      "num_children": 0,
      "author": 356444,
      "replies": []
    },
    {
      "id": "ig3sl45",
      "text": "I fucking knew it! He's a bottom 100%.",
      "timestamp": "2022-07-14 08:58:11",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig3tjo7",
      "text": "You forgot to start your post with “To nobody’s surprise”",
      "timestamp": "2022-07-14 09:11:28",
      "score": 1,
      "num_children": 0,
      "author": 213236,
      "replies": []
    },
    {
      "id": "ig3udbi",
      "text": "So you have never heard of plasters before? Strange.",
      "timestamp": "2022-07-14 09:22:53",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig3wj26",
      "text": "The amount of anti-gay politicians or prominent figures that turned out to be gay are so high I think it should just be assumed that anyone who shows abnormally above-average anti-gay sentiment should just be soon to be a closeted lgbt member.",
      "timestamp": "2022-07-14 09:52:12",
      "score": 1,
      "num_children": 0,
      "author": 413233,
      "replies": []
    },
    {
      "id": "ig3xqq3",
      "text": "Amazin'",
      "timestamp": "2022-07-14 10:08:26",
      "score": 1,
      "num_children": 0,
      "author": 356021,
      "replies": []
    },
    {
      "id": "ig3y153",
      "text": "Of course. Whenever I hear a preacher or politician go out of his way to disparage gays, I just automatically assume they are covering for their own gay nature. It's always only a matter of time before they get caught themselves.",
      "timestamp": "2022-07-14 10:12:16",
      "score": 1,
      "num_children": 0,
      "author": 342922,
      "replies": []
    },
    {
      "id": "ig3zks2",
      "text": "I find this sort of stuff very interesting. Why, out of all people, do the most conservative anti-lgbt people end up with a willy up their arse?  \nBy now, every time I see some pastor priest or whatever else on television being openly against gay people my first thought is \"He's definitely fucked a man hasn't he?\"",
      "timestamp": "2022-07-14 10:31:58",
      "score": 1,
      "num_children": 1,
      "author": 37573,
      "replies": [
        {
          "id": "ijfxah0",
          "text": "I think they don't get called out as long as they toe the line... it seems a weird way to live and is probably pretty unhealthy. I'm sure some ex-fundies will comment.",
          "timestamp": "2022-08-08 13:58:48",
          "score": 2,
          "num_children": 0,
          "author": 208069,
          "replies": []
        }
      ]
    },
    {
      "id": "ig40fgt",
      "text": "Well, Jesse? Did you have fun?",
      "timestamp": "2022-07-14 10:42:21",
      "score": 1,
      "num_children": 0,
      "author": 104261,
      "replies": []
    },
    {
      "id": "ig43eto",
      "text": "Did he just now meet a Republican?",
      "timestamp": "2022-07-14 11:16:38",
      "score": 1,
      "num_children": 0,
      "author": 245753,
      "replies": []
    },
    {
      "id": "ig43srv",
      "text": "Well we all know this is the worst kinda camouflage to hide that you're homosexual.",
      "timestamp": "2022-07-14 11:20:49",
      "score": 1,
      "num_children": 0,
      "author": 365470,
      "replies": []
    },
    {
      "id": "ig47d2l",
      "text": "amazin’",
      "timestamp": "2022-07-14 11:56:50",
      "score": 1,
      "num_children": 0,
      "author": 298454,
      "replies": []
    },
    {
      "id": "ig49xjf",
      "text": "Lol BETA!🤣",
      "timestamp": "2022-07-14 12:20:13",
      "score": 1,
      "num_children": 0,
      "author": 285364,
      "replies": []
    },
    {
      "id": "ig4b2mn",
      "text": "Jussie Smollett, the french actor is one of them???",
      "timestamp": "2022-07-14 12:29:51",
      "score": 1,
      "num_children": 0,
      "author": 112982,
      "replies": []
    },
    {
      "id": "ig4buyh",
      "text": "Well of course he's gay I mean he's apart of something called the manosphere where ita all man all the time",
      "timestamp": "2022-07-14 12:36:22",
      "score": 1,
      "num_children": 0,
      "author": 248755,
      "replies": []
    },
    {
      "id": "ig4e4p5",
      "text": "The level of self-hate with these hypocrites is mind boggling.",
      "timestamp": "2022-07-14 12:54:42",
      "score": 1,
      "num_children": 0,
      "author": 395957,
      "replies": []
    },
    {
      "id": "ig4ecr8",
      "text": " Ted Haggard was pretty bad as well",
      "timestamp": "2022-07-14 12:56:33",
      "score": 1,
      "num_children": 0,
      "author": 242450,
      "replies": []
    },
    {
      "id": "ig4fa24",
      "text": "Gay sex for me, but not for thee, I guess.",
      "timestamp": "2022-07-14 13:03:55",
      "score": 1,
      "num_children": 0,
      "author": 99055,
      "replies": []
    },
    {
      "id": "ig4fi9g",
      "text": "The call is *always* coming from inside the house",
      "timestamp": "2022-07-14 13:05:41",
      "score": 1,
      "num_children": 0,
      "author": 190935,
      "replies": []
    },
    {
      "id": "ig4fme3",
      "text": "Didn’t he have a debate with Jaclyn Glenn?",
      "timestamp": "2022-07-14 13:06:34",
      "score": 1,
      "num_children": 0,
      "author": 413146,
      "replies": []
    },
    {
      "id": "ig4fmww",
      "text": "It should be pretty obvious to anyone that watched his garbage for two seconds that JLP is an insane moron. His meager following demonstrates how utterly depraved and ridiculous the right wing can be. He is a disgrace to the human species.",
      "timestamp": "2022-07-14 13:06:41",
      "score": 1,
      "num_children": 0,
      "author": 165444,
      "replies": []
    },
    {
      "id": "ig4g6iq",
      "text": "Hmm. Posted about another pastor who does this, saying he is most likely a self-loathing homosexual, and got voted down.",
      "timestamp": "2022-07-14 13:10:57",
      "score": 1,
      "num_children": 1,
      "author": 45004,
      "replies": [
        {
          "id": "ijfvyes",
          "text": "It's important to shame the attitude and not the act.",
          "timestamp": "2022-08-08 13:49:11",
          "score": 1,
          "num_children": 0,
          "author": 208069,
          "replies": []
        }
      ]
    },
    {
      "id": "ig4jd6t",
      "text": "It’s ALWAYS a projection",
      "timestamp": "2022-07-14 13:35:13",
      "score": 1,
      "num_children": 0,
      "author": 209709,
      "replies": []
    },
    {
      "id": "ig4k6j9",
      "text": "Man needs help, not god.",
      "timestamp": "2022-07-14 13:41:17",
      "score": 1,
      "num_children": 0,
      "author": 265342,
      "replies": []
    },
    {
      "id": "ig4la75",
      "text": "Shocking….  Not really.  That dude is too much.  He seems literally mentally impaired when he talks (as if what he says isn’t enough to prove his dumbassness).",
      "timestamp": "2022-07-14 13:49:23",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ig4ob25",
      "text": "No surprise there...",
      "timestamp": "2022-07-14 14:11:01",
      "score": 1,
      "num_children": 0,
      "author": 391131,
      "replies": []
    },
    {
      "id": "ig54kr8",
      "text": "Yup. Happens. A lot.",
      "timestamp": "2022-07-14 15:57:14",
      "score": 1,
      "num_children": 0,
      "author": 56658,
      "replies": []
    },
    {
      "id": "ig5li5t",
      "text": "SCOTUS, take note: You just can’t stop gay-ness, and this is what happens when you try. Bunch of closeted manly men screaming about perversion and sin. It’s pathetic.",
      "timestamp": "2022-07-14 17:43:58",
      "score": 1,
      "num_children": 1,
      "author": 141662,
      "replies": [
        {
          "id": "ijfuvn9",
          "text": "I'm not sure if homosexuality is a nature or nurture sort of thing but trauma, stress, and the absence of one or more parents certainly doesn't help. It seems to me that the rise of alternative sexualities is likely a sign of some kind of parental or societal neglect. And/or perhaps it's nature saying we need to slow down this incessant breeding before we completely destroy the planet. Are there \\*actually\\* more LGBTQ+ people now or is it just more accepted? /Let the ultra-lib downvotes begin!",
          "timestamp": "2022-08-08 13:41:26",
          "score": 1,
          "num_children": 1,
          "author": 208069,
          "replies": [
            {
              "id": "ijfxuw7",
              "text": "There is no evidence for anything you said here. Everything we have points to homosexuality likely being biological, likely starting in the womb, possibly related to levels of hormone exposure there. It’s been around since the beginning of time. It’s not going anywhere. There is no cure. It is not a sickness. And it doesn’t harm society unless bigoted people act like it’s a problem.",
              "timestamp": "2022-08-08 14:02:52",
              "score": 1,
              "num_children": 0,
              "author": 141662,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ig62yf6",
      "text": "yuuuuuup it's always projection with this crowd. always always always projection.",
      "timestamp": "2022-07-14 19:34:50",
      "score": 1,
      "num_children": 0,
      "author": 124150,
      "replies": []
    },
    {
      "id": "ig99d9i",
      "text": "Never hears of this pastor ever. Popular?",
      "timestamp": "2022-07-15 12:41:11",
      "score": 1,
      "num_children": 0,
      "author": 121340,
      "replies": []
    },
    {
      "id": "il54t7n",
      "text": "I like Jordan Peterson to a point, but this is funny lmao",
      "timestamp": "2022-08-21 02:00:59",
      "score": 1,
      "num_children": 0,
      "author": 378417,
      "replies": []
    },
    {
      "id": "ilcwe37",
      "text": "Jesse Lee is a true man of God and a Christian... Obvious hit piece against a conservative ahead of the upcoming elections.  \n\n\nAnd btw, he owned Professor Dave, Destiny, and Hassanabi in debate (Hassan even admits it surprisingly)  \n\n\nAll you youngsters who think Jesse Lee is \"dumb\" and a \"misogynist\" you all cant understand him because you are too BEYDAH  \nBEYDAH MALES!  \n\n\nTake the red pill you feminist wussies - That cute, innocent victim thing doesnt work for you once you become an adult... Better toughen up and seek the truth now... BEYDAH",
      "timestamp": "2022-08-22 19:03:18",
      "score": 1,
      "num_children": 0,
      "author": 413530,
      "replies": []
    },
    {
      "id": "ig0svu9",
      "text": "On a side note, anti-LGBT is a broad therm. Im personally anti-LGBT but solely for the reason that it crams a lot of things together. Lesbians and Gays even have different situations and problems, while people add the many made up genders towards the whole thing. \n\nThe only thing they have in common, that their sexuality is uncommon and disliked in most non-western countries, but mostly its about stuff like queer/trans bathrooms instead of fighting for sexual freedom in countries where its not allowed",
      "timestamp": "2022-07-13 18:11:08",
      "score": -21,
      "num_children": 1,
      "author": 153289,
      "replies": [
        {
          "id": "ig12j91",
          "text": "\"I'm against LGBT because there's waaaaaaay too much going on.... What's that? What are the explicit problems I have with LGBT? Wellllllll, uhmmmmm, I like to leave that vague.... because...... reasons.\"\n\nI'm anti-anti-lgbt, because it's an entitled idiot that tries to impose their own morals on others for no stated reason other then their personal feeeeeeeeeeeeeeelings.",
          "timestamp": "2022-07-13 19:13:35",
          "score": 10,
          "num_children": 0,
          "author": 378776,
          "replies": []
        }
      ]
    },
    {
      "id": "ig27yxs",
      "text": "UHHH DUH-DOI",
      "timestamp": "2022-07-13 23:55:39",
      "score": -1,
      "num_children": 0,
      "author": 232615,
      "replies": []
    }
  ]
}