{
  "id": "w0e52w",
  "text": "The meaning of corruption...\n",
  "timestamp": "2022-07-16 11:05:39",
  "score": 4407,
  "subreddit": "t5_3fdcn",
  "num_children": 23,
  "author": 133955,
  "replies": [
    {
      "id": "igdqnb9",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-07-16 11:05:39",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "ige2ikp",
      "text": "How that entire clan is not in prison yet is beyond me.",
      "timestamp": "2022-07-16 13:06:04",
      "score": 113,
      "num_children": 1,
      "replies": [
        {
          "id": "igf7lc5",
          "text": "It's easy, they live in America and they have *money*.  That makes you an untouchable in the Christo fascist police states of America. :/",
          "timestamp": "2022-07-16 18:11:10",
          "score": 85,
          "num_children": 3,
          "author": 244510,
          "replies": [
            {
              "id": "igfe61d",
              "text": "Ours is a nation of lords, not laws.\n\nAlways was 👩‍🚀🌕🌍🔫",
              "timestamp": "2022-07-16 18:58:25",
              "score": 36,
              "num_children": 1,
              "author": 264568,
              "replies": [
                {
                  "id": "igfffgw",
                  "text": "And that's why it sucks for us atheists.  Fuck your god and your bible. (not \"you\" Uriel-238).  The Christian terror cult has been released after years of buildup and brainwashing.  God fuck America.",
                  "timestamp": "2022-07-16 19:07:30",
                  "score": 23,
                  "num_children": 1,
                  "author": 244510,
                  "replies": [
                    {
                      "id": "igfpjmp",
                      "text": "It's going to suck for everyone. Even the bottom tiers of the Protestant Evangelist parishes will find they are not pious enough or faithful enough not to be fed into the scapegoat machine.\n\nCapitalism is the only god. Fear of the Other is the shield that keeps it safe, and like any machine, it hungers for fuel.",
                      "timestamp": "2022-07-16 20:20:42",
                      "score": 17,
                      "num_children": 0,
                      "author": 264568,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "igg7ecp",
              "text": "Live in America, *are Republicans* and make money. Biden is a devout Catholic and is one of the most Republicanesque Democrats around, but is still a Democrat and look at where that's gotten him in Fox News world. They talk about the J-man all they want, but they'll vote Republican over Christian any day of the week.",
              "timestamp": "2022-07-16 22:34:36",
              "score": 3,
              "num_children": 0,
              "author": 329379,
              "replies": []
            },
            {
              "id": "igg5lyk",
              "text": "One might think they are rats.",
              "timestamp": "2022-07-16 22:20:55",
              "score": 1,
              "num_children": 0,
              "author": 235607,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "igea8ip",
      "text": "The Trump operation was about amassing as much graft as it could from the start. If Donnie avoids jail this may well be his biggest con job.",
      "timestamp": "2022-07-16 14:10:51",
      "score": 62,
      "num_children": 3,
      "author": 263957,
      "replies": [
        {
          "id": "igef70a",
          "text": "Trump would charge to let people walk by Ivana's casket if he could. I've never seen a bigger pathological family except maybe Ed Gein who made lampshades with his victims skin",
          "timestamp": "2022-07-16 14:49:00",
          "score": 41,
          "num_children": 1,
          "author": 331673,
          "replies": [
            {
              "id": "iggexoh",
              "text": "The Musks are coming in as strong contenders for the narcissistic billionaire championship belt.",
              "timestamp": "2022-07-16 23:34:07",
              "score": 6,
              "num_children": 0,
              "author": 44869,
              "replies": []
            }
          ]
        },
        {
          "id": "igfa1af",
          "text": "It will probably be one of the biggest con job in history. Talk about wolf in sheep clothing. How this inept pos has brainwashed almost half of the Americans is baffling.",
          "timestamp": "2022-07-16 18:28:44",
          "score": 10,
          "num_children": 0,
          "author": 26542,
          "replies": []
        },
        {
          "id": "igf94rp",
          "text": "The feds will never prosecute a former president for mere grift or political hijinx.  Fulton County, GA on the other hand, that case has legs.",
          "timestamp": "2022-07-16 18:22:10",
          "score": 4,
          "num_children": 0,
          "author": 185616,
          "replies": []
        }
      ]
    },
    {
      "id": "igf3d92",
      "text": "I love how republicans can get months of coverage off of hunter bidens crack addiction, but dems can't even be bothered to point out this blatant corruption from the gop side. \n\nCalls for Jareds arrest should have happened after his willfully botched covid response, yet here we are with even more corruption.",
      "timestamp": "2022-07-16 17:41:29",
      "score": 32,
      "num_children": 1,
      "author": 259310,
      "replies": [
        {
          "id": "iggzte1",
          "text": "This is fantastic point. Where’s the PR? Where’s the news machine?",
          "timestamp": "2022-07-17 02:30:24",
          "score": 3,
          "num_children": 0,
          "author": 28280,
          "replies": []
        }
      ]
    },
    {
      "id": "igdqrmt",
      "text": "Something something hunter biden.",
      "timestamp": "2022-07-16 11:07:03",
      "score": 94,
      "num_children": 2,
      "replies": [
        {
          "id": "igg4pyl",
          "text": "DO NOT FORGOT ABOUT THE EMAILS!!?!?!?!?!?!?!?!?!?!",
          "timestamp": "2022-07-16 22:14:00",
          "score": 11,
          "num_children": 1,
          "author": 86101,
          "replies": [
            {
              "id": "ighahcm",
              "text": "Buttery males",
              "timestamp": "2022-07-17 04:07:16",
              "score": 3,
              "num_children": 0,
              "author": 354897,
              "replies": []
            }
          ]
        },
        {
          "id": "igf87ie",
          "text": "Something, something, this is the way.",
          "timestamp": "2022-07-16 18:15:33",
          "score": -15,
          "num_children": 0,
          "author": 191542,
          "replies": []
        }
      ]
    },
    {
      "id": "igf41m4",
      "text": "\"But, but, muh hunter?\" \nRemember when reporters began uncovering the Trump kids' scandals, including their complicity in the Trump Charity fraud, and GOP members acted so outraged? \"You don't attack the president's children! That is horrible and so very like the Democrats to do!\" And then along came a laptop. A laptop was a brilliant move on the part of the Republican operative who created the conspiracy theory, I've got to hand it to them. They're able to claim anything and everything is on the hard drive. Hell, there could be information related to the JFK assassination, or pictures of Thomas Jefferson sleeping with Sally Hemmings, or, or, material that could lead to Hillary's arrest! You'll never hear Republicans stretch the limits of their brain cells like they do when they try to explain why Hunter needs to be locked up, \"like forever!\" And I'm always like, \"yeah, cool, so why did Kushner enter the Whitehouse and immediately start trying to establish a back channel for communication between Cheeto Mussolini and Putin? What was that about?\"",
      "timestamp": "2022-07-16 17:46:13",
      "score": 20,
      "num_children": 0,
      "author": 217460,
      "replies": []
    },
    {
      "id": "igdub2e",
      "text": "I completely missed that $2B payoff - anybody got a link to a good source on that?",
      "timestamp": "2022-07-16 11:46:26",
      "score": 68,
      "num_children": 1,
      "author": 163874,
      "replies": [
        {
          "id": "ige082z",
          "text": "[Report: Saudi Arabia Concluded Jared Kushner’s Investment Firm Was a Joke, Gave Him $2 Billion Anyway](https://www.vanityfair.com/news/2022/04/jared-kushner-saudi-arabia-2-billion-investment)  \n\n\n[How Did Jared Kushner Get $2 Billion From the Saudis?  Hint: It’s not because of his track record as an investor.](https://www.bloomberg.com/opinion/articles/2022-04-11/how-did-jared-kushner-get-2-billion-from-the-saudis)",
          "timestamp": "2022-07-16 12:45:12",
          "score": 73,
          "num_children": 0,
          "author": 83463,
          "replies": []
        }
      ]
    },
    {
      "id": "igdudb7",
      "text": "A Trumpster at work told me just the other day that Hunter's laptop absolutely proves that Joe Biden has committed multiple International crimes, and that this will be revealed soon.  \n\nGeeeez.......",
      "timestamp": "2022-07-16 11:47:06",
      "score": 62,
      "num_children": 3,
      "author": 271845,
      "replies": [
        {
          "id": "igduus1",
          "text": "Yuck. A QAnonmoron.",
          "timestamp": "2022-07-16 11:52:08",
          "score": 37,
          "num_children": 1,
          "author": 163874,
          "replies": [
            {
              "id": "ighkil8",
              "text": "A Qunt",
              "timestamp": "2022-07-17 05:55:51",
              "score": 2,
              "num_children": 0,
              "author": 280825,
              "replies": []
            }
          ]
        },
        {
          "id": "ige0ah0",
          "text": "If you read through the \"official\" narrative about that laptop and it doesn't scream \"complete fabrication\" I really don't know what to tell you. I'm not going to pull specifics out of my ass, but(t) the whole story just has so many logical leaps. Like the location of the shop, the owner, the contents of the laptop itself, whenever you try to take all of it and piece it together as an actual event that happened it completely falls apart. Hence why no real news channel would touch it. Something about actually requiring real information about stories so as to not be viciously mocked by the journalist community for reporting an outright fabricated story.",
          "timestamp": "2022-07-16 12:45:49",
          "score": 22,
          "num_children": 2,
          "author": 232326,
          "replies": [
            {
              "id": "igf1k0t",
              "text": "I honestly don't care if it's real or not. If it's real, charge hunter with whatever crimes. I don't fucking care. No one here worships Biden, if his kid did wrong, he should pay just like anyone else. But fuck me if you are going to convince me that it is a bigger problem than Trump and his kids grifting off of our government.",
              "timestamp": "2022-07-16 17:28:42",
              "score": 24,
              "num_children": 1,
              "author": 35603,
              "replies": [
                {
                  "id": "igfys12",
                  "text": "I care if it's real or not mainly because I'm beyond sick and fucking tired of living in this reality where people can just fucking claim whatever with no consequences, and there are unscrupulous \"news\" sources that will blast it out and folks won't even question it a bit.\n\nBut I 100% get what you mean-if a crime was suspected then investigate it and prosecute if there's adequate evidence. Nobody is above the law and especially not politicians and their families. They more than anybody must be held accountable. And indeed if hunter Biden should serve a jail sentence then each member of the turmp clan should serve one tenfold.",
                  "timestamp": "2022-07-16 21:28:26",
                  "score": 5,
                  "num_children": 0,
                  "author": 232326,
                  "replies": []
                }
              ]
            },
            {
              "id": "igf4qpf",
              "text": "It's always something \"about to happen any day\" with these people. Their blind faith is sickening. \n\n\"Any day now the Obamacare replacement plan will show how wrong you are\"\n\nAny day now the border wall will be paid for by mexico\"\n\n\"Any day now Trump's infrastructure plan will blow your socks off\"\n\n\"Any day now the overwhelming evidence of voter fraud will come out\"\n\n\"Any day now trump will be reinstated as president\"\n\n\"Any day now the Clintons will be arrested and hanged\"\n\n\"Any day now the revolution will start\"\n\n\"Any day now the storm will come for these democrat demons\"\n\nAnd they're wrong every single day that passes.",
              "timestamp": "2022-07-16 17:51:01",
              "score": 13,
              "num_children": 1,
              "author": 264785,
              "replies": [
                {
                  "id": "igf5va5",
                  "text": "Their blind faith is what they believe makes them virtuous.",
                  "timestamp": "2022-07-16 17:59:01",
                  "score": 9,
                  "num_children": 1,
                  "author": 130356,
                  "replies": [
                    {
                      "id": "igfz27m",
                      "text": "Gonna put on my tinfoil hat here and make the suggestion that the \"powers that be\" intentionally work to keep the population religious and also work with the most extreme religious groups specifically because it puts people in the mindset of blind faith and not questioning authority.",
                      "timestamp": "2022-07-16 21:30:39",
                      "score": 3,
                      "num_children": 2,
                      "author": 232326,
                      "replies": [
                        {
                          "id": "igg2qvu",
                          "text": "They think they have Godzilla properly leashed.",
                          "timestamp": "2022-07-16 21:58:45",
                          "score": 2,
                          "num_children": 0,
                          "author": 175380,
                          "replies": []
                        },
                        {
                          "id": "igfzg35",
                          "text": "It’s definitely considered by them to be an advantageous side effect. Some others are freedom to question an opponents “righteousness” and the freedom to judge anyone.",
                          "timestamp": "2022-07-16 21:33:39",
                          "score": 1,
                          "num_children": 0,
                          "author": 130356,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ighkhlj",
          "text": "Wild, baseless proclamations > facts",
          "timestamp": "2022-07-17 05:55:32",
          "score": 2,
          "num_children": 0,
          "author": 280825,
          "replies": []
        }
      ]
    },
    {
      "id": "igejqij",
      "text": "https://en.wikipedia.org/wiki/Appearance_of_corruption",
      "timestamp": "2022-07-16 15:22:32",
      "score": 3,
      "num_children": 0,
      "author": 18646,
      "replies": []
    },
    {
      "id": "igf9spp",
      "text": "Some people have respect for this criminals! These people are part of what is wrong with America at this moment in our lifes - I seen this admiration for criminal in other countries. The more crooked, the more corrupted but if you have MONEY - people tend to respect you!",
      "timestamp": "2022-07-16 18:27:01",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "igerhjj",
      "text": "But I don't like the laptop guy so it's worse therefore my people's bad stuff doesn't matter.",
      "timestamp": "2022-07-16 16:18:03",
      "score": 9,
      "num_children": 0,
      "author": 121412,
      "replies": []
    },
    {
      "id": "igfduh7",
      "text": "I still have hope that $2 Billion was poorly spent. But Putin hasn't been indicted for his murders either.",
      "timestamp": "2022-07-16 18:56:03",
      "score": 2,
      "num_children": 0,
      "author": 264568,
      "replies": []
    },
    {
      "id": "igeqsz1",
      "text": "Porque no los dos.",
      "timestamp": "2022-07-16 16:13:07",
      "score": 2,
      "num_children": 0,
      "author": 99900,
      "replies": []
    },
    {
      "id": "igeuy3y",
      "text": "I wonder what he's currently up to that a long, drawn out investigation will uncover 20 years from now.",
      "timestamp": "2022-07-16 16:42:16",
      "score": 2,
      "num_children": 0,
      "author": 375433,
      "replies": []
    },
    {
      "id": "igfa7f8",
      "text": "Can't both administrations be corrupt?",
      "timestamp": "2022-07-16 18:30:00",
      "score": 0,
      "num_children": 1,
      "author": 109804,
      "replies": [
        {
          "id": "igfdt6r",
          "text": "[removed]",
          "timestamp": "2022-07-16 18:55:48",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "igfxeba",
              "text": "they got attacked because both are obviously bad so bringing up a \"what about \\_\\_\\_\\_?\" seems like its a defense for the trump family, which why the fuck would u try to defend their actions?  \n\n\nand questions like \"cant both administrations be corrupt\"? yes bro obviously there are problems with both/ corruption in both but the severity is not the same  \n\n\nits like saying cancer is bad and then someone else being like yeah ok cancer is bad but what about aids? bro what",
              "timestamp": "2022-07-16 21:18:06",
              "score": 6,
              "num_children": 1,
              "author": 173323,
              "replies": [
                {
                  "id": "igg2hio",
                  "text": "[removed]",
                  "timestamp": "2022-07-16 21:56:44",
                  "score": -3,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "igg4pox",
                      "text": "[deleted]",
                      "timestamp": "2022-07-16 22:13:56",
                      "score": 6,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "igg6lfw",
                      "text": "ok call the laptop stuff bullshit, i dont know enough about it to speak on it  \n\n\nwhat im saying is that when you have a crime that is severe, and then in the thread someone is like yeah guys this crime is bad but what about this other one can we just acknowledge this other crime? like yeah theres zero doubt that both crimes happened so what is there to acknowledge?\n\njust pointing out that hunter biden did bad stuff too? ok thats fine to point out but read the room, my god\n\nit should be apparent that by saying \"but what about hunter\" is going to come off as a defense of the trumps  \n\n\nthere is nothing in the original post or anyone in the comments saying either group is innocent, so when you ask \"what about X\" its like ok what about it? you're bringing up a new topic in order to what, downplay the severity of the original topic? and if thats not the reason, its comes back to reading the room",
                      "timestamp": "2022-07-16 22:28:26",
                      "score": 3,
                      "num_children": 0,
                      "author": 173323,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "igge2ow",
      "text": "Every Republican: “Whataboutism”",
      "timestamp": "2022-07-16 23:27:20",
      "score": 1,
      "num_children": 0,
      "author": 137747,
      "replies": []
    },
    {
      "id": "iggghtt",
      "text": "Where did 640 come from",
      "timestamp": "2022-07-16 23:46:41",
      "score": 1,
      "num_children": 0,
      "author": 347682,
      "replies": []
    },
    {
      "id": "iggy17h",
      "text": "I mean, yea. The hypocrisy is apparent at minimum.",
      "timestamp": "2022-07-17 02:14:43",
      "score": 1,
      "num_children": 0,
      "author": 265752,
      "replies": []
    },
    {
      "id": "igh31hf",
      "text": "#Corruption comes in many colors, shapes and sizes...\n#Pretty much anyone who worked for Don or Republican \"leaders\" other than admin positions are corrupt.. if nothing other than morally...\n\n#... let's give a quick list if those yet to be held accountable...\n\n#McMitch, Scott Pruitt,  Mike Pompeo, Steven Mnuchin, Wilbur Ross, Ben Carson, Robert Wilkie, Mark Meadows, Andrew Wheeler, Rex Tillerson, Jeff Sessions, Ryan Zinke, Rick Perry, Betsy DeVos, Reince Priebus, Mick Mulvaney, William Barr, Elaine Chao, Steve Gannon, Jared Kushner, Sean Spicer, Michael Flynn, Ivanka Trump, Kellyanne Conway, Hope Hicks, Stephen Miller, Peter Navarro, Roger Stone, Sarah Huckabee Sanders....\n\n#... and the \"hits\" keep coming on and on and on and....\n\n#The American Fascist Party (~GOP~) is rotting from within and none can escape the disease...",
      "timestamp": "2022-07-17 02:58:53",
      "score": 1,
      "num_children": 0,
      "author": 291675,
      "replies": []
    },
    {
      "id": "igsluox",
      "text": "Can someone remind me why the Kashoggi thing was so important?  Seems like normal stuff (sadly) for Saudi.",
      "timestamp": "2022-07-19 16:12:44",
      "score": 1,
      "num_children": 0,
      "author": 75683,
      "replies": []
    },
    {
      "id": "igegf62",
      "text": "Yeah, the Trumps have commited corruption. Openly, and blatently.\n\nBut isn't it messed up that a man can smoke crack on camera, and not only NOT go to jail, but get a well paying job and live in life in comfort.\n He gets to dodge the draconian anti drug laws his father wrote, simply because that's his father.\n\nTwo things can be wrong at the same time, is all I'm saying.",
      "timestamp": "2022-07-16 14:58:07",
      "score": -27,
      "num_children": 5,
      "author": 143927,
      "replies": [
        {
          "id": "igehoqo",
          "text": "A man was chopped to death by the Saudis and Kushner got a $2b kickback. But you think Hunter Biden is more important?",
          "timestamp": "2022-07-16 15:07:27",
          "score": 20,
          "num_children": 0,
          "author": 200378,
          "replies": []
        },
        {
          "id": "igey994",
          "text": "Bro, I couldn’t give two fucks about Hunter. What is the obsession with this guy? I am only aware of his existence due to his detractors.",
          "timestamp": "2022-07-16 17:05:23",
          "score": 14,
          "num_children": 0,
          "author": 197265,
          "replies": []
        },
        {
          "id": "igekkat",
          "text": "Take your both sides bullshit and shove it you fascist sympathizer.",
          "timestamp": "2022-07-16 15:28:31",
          "score": 21,
          "num_children": 0,
          "author": 80825,
          "replies": []
        },
        {
          "id": "igekh7e",
          "text": "yes they both can be wrong and both are wrong, but they are not equal\n\nkilling and stealing are both wrong but they are not equal crimes\n\nhunter biden avoiding consequences because of connections is not the same as the numerous crimes and generally shitty things thier family has done while in office\n\ni've not heard one person say hunter biden shouldnt face consequences for his actions but we have a whole cult of people who hand wave away any and all negative comments about their favorite political figures",
          "timestamp": "2022-07-16 15:27:54",
          "score": 16,
          "num_children": 0,
          "author": 173323,
          "replies": []
        },
        {
          "id": "ighx9o9",
          "text": "Which law is broken there exactly? You're aware that plenty of people are recovering drug addicts and their existence isn't illegal in itself. We didn't vote for Hunter and Joe wasn't dumb enough to bring him on in the White house, so I'm pretty confused how this is meant as anything to do with politics in the first place.",
          "timestamp": "2022-07-17 08:43:16",
          "score": 2,
          "num_children": 0,
          "author": 68179,
          "replies": []
        }
      ]
    },
    {
      "id": "igffk7n",
      "text": "What a steaming load of absolute BS. The Trump family's corruption in no way diminishes the Biden family's corruption. It is the pinnacle of hypocrisy to excuse one persons bad actions by pointing to someone whose bad actions might be worse. Nobody ever dodged a murder conviction by claiming they weren't as bad as a serial killer.",
      "timestamp": "2022-07-16 19:08:28",
      "score": -9,
      "num_children": 1,
      "author": 250787,
      "replies": [
        {
          "id": "igg6sp7",
          "text": "What flavor was the Kool-Aid? You didn't just have a glass, you drank the whole fucking pitcher.",
          "timestamp": "2022-07-16 22:29:59",
          "score": 5,
          "num_children": 1,
          "author": 86101,
          "replies": [
            {
              "id": "igrd3va",
              "text": "They just raw dogged the powder mix. Didn't even add water",
              "timestamp": "2022-07-19 10:16:08",
              "score": 1,
              "num_children": 0,
              "author": 80825,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iggpqzx",
      "text": "My name is Mohammad Bin Salman and this is Jackass.",
      "timestamp": "2022-07-17 01:04:09",
      "score": 0,
      "num_children": 0,
      "author": 186459,
      "replies": []
    }
  ]
}