{
  "id": "w17mdb",
  "text": "Rule #1. The alt-right is always wrong\n",
  "timestamp": "2022-07-17 13:38:38",
  "score": 4454,
  "subreddit": "t5_3fdcn",
  "num_children": 17,
  "author": 219131,
  "replies": [
    {
      "id": "igilnua",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-07-17 13:38:39",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "igjtwp8",
      "text": "\"But it's a baby being killed, it's my duty to stop murder. That's everyone's business.\" - pro-birth motherfucker I was chatting with the other day. \n\nThey believe this shit to their souls. Now imagine you're an idiot who believes this. You'd feel compelled to stop a murder. That's why they won't budge.\n\nI hate these people.",
      "timestamp": "2022-07-17 19:09:28",
      "score": 75,
      "num_children": 3,
      "author": 328976,
      "replies": [
        {
          "id": "igl4iph",
          "text": "I try to remind them that murder requires criminal *intent* but they don't understand the words.",
          "timestamp": "2022-07-18 01:00:22",
          "score": 15,
          "num_children": 0,
          "author": 327969,
          "replies": []
        },
        {
          "id": "ign3j2a",
          "text": "It’s the same reason they tried to push a narrative saying masks were killing people… and then same with vaccines as well. You make your argument “it’s murder” and nobody can really argue with you.",
          "timestamp": "2022-07-18 13:42:01",
          "score": 5,
          "num_children": 0,
          "author": 395632,
          "replies": []
        },
        {
          "id": "ign3au3",
          "text": "Yet they have become completely numb to adults being murdered that they see daily on tv or online.",
          "timestamp": "2022-07-18 13:40:17",
          "score": 3,
          "num_children": 0,
          "author": 383450,
          "replies": []
        }
      ]
    },
    {
      "id": "igjovwz",
      "text": "At this point I'm pretty sure they are watching Handmaids tale with a notepad in their lap.",
      "timestamp": "2022-07-17 18:33:23",
      "score": 49,
      "num_children": 1,
      "author": 221709,
      "replies": [
        {
          "id": "igkmv6z",
          "text": "[>At this point I'm pretty sure they are watching Handmaids tale with a notepad in their lap.](https://imgur.com/E7W4NlK.jpg)",
          "timestamp": "2022-07-17 22:38:52",
          "score": 14,
          "num_children": 1,
          "author": 233187,
          "replies": [
            {
              "id": "igl5vjp",
              "text": "Looking over his [Twitter](https://twitter.com/RGreggKeller?t=xzVe1zLIXdQg8rxtD9s9vQ&s=09), that guy is something else.",
              "timestamp": "2022-07-18 01:11:32",
              "score": 4,
              "num_children": 0,
              "author": 143582,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "igjj5e8",
      "text": "What fresh hell is this? Forced-birth states refusing to let pregnant people leave?",
      "timestamp": "2022-07-17 17:52:38",
      "score": 137,
      "num_children": 3,
      "author": 222736,
      "replies": [
        {
          "id": "igjs5j5",
          "text": "If you are found to be pregnant you will get an ankle monitor and will have to get special permissions to leave the state. \n\nIf you escape and get an abortion, Any person or persons that helped you will be charged in the death of the clump of cells. \n\nThe Law will read \"Illegal Interstate travel of a pregnant person for the purposes of an abortion\" assisting is 1-2 years 20,000 fine the woman would be 1-5 years 50,000 fine.  if a vehicle was used, immediate suspension of license",
          "timestamp": "2022-07-17 18:56:46",
          "score": 53,
          "num_children": 3,
          "replies": [
            {
              "id": "igko2hc",
              "text": "The problem is, a woman of reproductive age can become pregnant at any point, so the logical conclusion is to put an ankle monitor on any woman who ovulates. I could totally see states requiring women to submit proof of negative pregnancy tests to avoid extra monitoring. It's truly terrifying",
              "timestamp": "2022-07-17 22:48:00",
              "score": 40,
              "num_children": 1,
              "author": 154171,
              "replies": [
                {
                  "id": "igt93ym",
                  "text": "It's time for your monthly menses check in at the state doctor's office!",
                  "timestamp": "2022-07-19 18:36:38",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "iglc3sh",
              "text": "Can states prohibit interstate travel? Sounds wrong.",
              "timestamp": "2022-07-18 02:02:41",
              "score": 27,
              "num_children": 3,
              "author": 218949,
              "replies": [
                {
                  "id": "iglhax7",
                  "text": "Yeah this whole situation feels a little bit off to me",
                  "timestamp": "2022-07-18 02:46:23",
                  "score": 16,
                  "num_children": 0,
                  "author": 97033,
                  "replies": []
                },
                {
                  "id": "iglprxa",
                  "text": "Well they can prohibit a lot of things already, As soon a person becomes a baby making machine and not a person.... yes they can.",
                  "timestamp": "2022-07-18 04:07:53",
                  "score": 12,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "igmjp0m",
                  "text": "With our current supreme court they could literally start up death camps for LGBT youth and get it OK'd",
                  "timestamp": "2022-07-18 10:26:18",
                  "score": 2,
                  "num_children": 0,
                  "author": 11235,
                  "replies": []
                }
              ]
            },
            {
              "id": "igmznz0",
              "text": "what state is this? where's the law? i wanna read it.",
              "timestamp": "2022-07-18 13:11:14",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "igjrgkx",
          "text": "TLDR: not something to actually worry about, but the sentiment is too true. \n\nHaven't heard of it, wouldn't be surprised if red states introduced the bills for it just to keep their anti-abortion base excited for midterms, but mass surveillance testing of women who travel out of state isn't something to fear.  \n\n1. It's unenforceable in practical terms. Logistically, financially, legally, it wouldn't work.  \n  \n2. The constitution explicitly bars states from restricting interstate travel, and undoing that would require a lot more than any configuration of the SCOTUS could deliver.  \n\n3. IANAL but the 4th amendment definitely covers the intrusive surveillance constituted by compulsory pregnancy tests before and after interstate travel.  \n\n4. Again, IANAL Title IX prohibits discrimination on the basis of sex. They ban abortion for both men and women, so even though it only affects people assigned women at birth, it's not 'discriminatory' in that sense. Forcing women exclusively to submit proof of pregnancy status is, fundamentally, discrimination on the basis of sex. Good luck convincing conservative dudes to allow laws that make them submit pregnancy tests.",
          "timestamp": "2022-07-17 18:51:48",
          "score": 71,
          "num_children": 7,
          "author": 170651,
          "replies": [
            {
              "id": "igkhayp",
              "text": "Yes but the constitution says whatever the council of 6 decides it does, so nothing else matters",
              "timestamp": "2022-07-17 21:57:31",
              "score": 43,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "igkh7oa",
              "text": "Ah, but you can make interstate travel with a MINOR illegal, and anything more complicated than a sperm and an egg with enough space for jesus between 'em counts as a taxpaying human being now.",
              "timestamp": "2022-07-17 21:56:50",
              "score": 24,
              "num_children": 0,
              "author": 389704,
              "replies": []
            },
            {
              "id": "igkoulj",
              "text": "\"Not something to actually worry about…\" Then again, placing a legal obligation on healthcare workers to withhold life-saving treatment from a patient seemed absurd a few weeks ago. \n\nBut now if a fetus is not viable and is endangering a woman's life, some states have ruled the pregnancy cannot be terminated because the fetus has a heartbeat.",
              "timestamp": "2022-07-17 22:53:55",
              "score": 27,
              "num_children": 1,
              "author": 110018,
              "replies": [
                {
                  "id": "igmau0g",
                  "text": "Important note: mostly when forced-birth people talk about a foetal \"heartbeat\" they are using very creative language. The cardiovascular system develops relatively late in gestation. What they mean is that there is a measurable, rhythmic electrical pulse. There isn't exactly a heart to be beating.\n\nWe must be careful about repeating their terminology, which is calculated to make the debate involve emotionally loaded (but medically inaccurate) words.",
                  "timestamp": "2022-07-18 08:23:17",
                  "score": 13,
                  "num_children": 2,
                  "author": 222736,
                  "replies": [
                    {
                      "id": "igmphyr",
                      "text": "Thank You. This is an important issue.",
                      "timestamp": "2022-07-18 11:35:40",
                      "score": 3,
                      "num_children": 0,
                      "author": 237862,
                      "replies": []
                    },
                    {
                      "id": "igo8sf5",
                      "text": "Thank you for the clarification. I'm still learning. What would be an appropriate way to express what's going on, instead of using \"fetal heartbeat\"?\n\nWould this work?\n\n\"…some states have ruled the pregnancy cannot be terminated because they claim fetus has a 'heartbeat,' a medically inaccurate term referring to electrical pulse as there is no recognizable heat to beat.\"\n\nAnd: I note that the use of a modifying phrase makes it too easy for someone quoting this language to clip it off, leaving the offensive term \"fetal heartbeat\" intact.",
                      "timestamp": "2022-07-18 18:21:23",
                      "score": 3,
                      "num_children": 0,
                      "author": 110018,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "igl0r8g",
              "text": "Yes, buuuut... I think we've established that the right has absolutely no respect for the rule of law and the constitution at all levels, from the lowest local alderman all the way up to the Supreme Court. Just because it's obvious that the Constitution shouldn't allow 24/7 monitoring of pregnant women doesn't mean the corrupt assholes currently besmirching the honor of our highest court wouldn't allow it in a second.",
              "timestamp": "2022-07-18 00:29:24",
              "score": 12,
              "num_children": 0,
              "author": 74588,
              "replies": []
            },
            {
              "id": "igljit8",
              "text": "A couple years ago my neighbor told me abortion not being legal at the Federal level in the United States was not something to actually worry about and she was wrong so I don't know who to trust anymore",
              "timestamp": "2022-07-18 03:05:58",
              "score": 8,
              "num_children": 1,
              "author": 285164,
              "replies": [
                {
                  "id": "ign2g9o",
                  "text": "Tbf it is still legal at the federal level, but your point is well taken. Reddit strangers like me are probably the worst choice to believe, haha",
                  "timestamp": "2022-07-18 13:33:38",
                  "score": 2,
                  "num_children": 0,
                  "author": 170651,
                  "replies": []
                }
              ]
            },
            {
              "id": "igmxmc1",
              "text": "How it works is that they put the law into place, wait until someone brings a lawsuit to challenge it, and then it rattles around the courts for several years. They can absolutely do what they're saying and just keep spinning the legal process out to destroy countless lives before it's overturned. If it is overturned. The Supreme Court doesn't have to decide anything, they can just decline to hear it. \n\nThey are accomplishing their goals and at this point it's ridiculously clear that \"The system will save us!\" isn't real.",
              "timestamp": "2022-07-18 12:53:48",
              "score": 2,
              "num_children": 1,
              "author": 163845,
              "replies": [
                {
                  "id": "ign3sky",
                  "text": "Yeah, like I said, I wouldn't be surprised if some states passed a law like this, but 1. They could never put it into action financially or logistically, and 2. The impact that a law like that would have on lives is precisely why there would be an injunction until the matter is decided. \n\nHell, the states that would pass something like that would depend on the injunction so that they can reap the performative benefits of passing the law without having to invest the money, time, and energy into implementing it. \n\n>They are accomplishing their goals and at this point it's ridiculously clear that \"The system will save us!\" isn't real.  \n  \nI agree. The system is designed to slow down change so that there are multiple election cycles to confirm voters actually want to continue in a certain direction.  \n\nAs for 'accomplishing their goals', the people leading the right have no ideology. They don't give a fuck about abortion, they just want to trick the voters that do into believing they're on the same page. The party itself will do the least amount of work for the most political gain - which here means pretending to care about abortion while redirecting the resources this kind of law would require to something even more sinister and pointed, like dismantling voting rights or codifying protections for extralegal police actions.",
                  "timestamp": "2022-07-18 13:44:02",
                  "score": 1,
                  "num_children": 1,
                  "author": 170651,
                  "replies": [
                    {
                      "id": "igo46v6",
                      "text": ">Yeah, like I said, I wouldn't be surprised if some states passed a law like this, but 1. They could never put it into action financially or logistically, \n\nThey could put it enough into effect that it would ruin people. It doesn't have to be sensible or well-run, it just has to be the pet project of someone high up. They just need to discourage people, make it a hassle, and have a law that will allow them to throw the book as hard as possible when they feel like it. \n\n>and 2. The impact that a law like that would have on lives is precisely why there would be an injunction until the matter is decided. \n>\n\nOr there wouldn't be. Tons of judges are corrupt. Plenty of things under Trump that should gotten an injunction didn't. Many of the people responsible for that are still judges. \n\n\n>Hell, the states that would pass something like that would depend on the injunction so that they can reap the performative benefits of passing the law without having to invest the money, time, and energy into implementing it. \n>\n\nMaybe, maybe not. They haven't been content with that so far. \n\n>>They are accomplishing their goals and at this point it's ridiculously clear that \"The system will save us!\" isn't real.  \n>  \n>I agree. The system is designed to slow down change so that there are multiple election cycles to confirm voters actually want to continue in a certain direction.  \n>\n>As for 'accomplishing their goals', the people leading the right have no ideology. They don't give a fuck about abortion, they just want to trick the voters that do into believing they're on the same page. \n\nPlenty of leaders on the right do, in fact, personally hate abortion. It's not like they indoctrinate the youth to hate abortion, then, when they become powerful, let them in on The Secret that they don't *actually* care about abortion. Plenty of people in power hate abortion, are actually racist, etc, etc. Every single politician is not being performative.\n\nAnd even if they were, what does it matter? If my neighbor set my house on fire it's absurd to tell me \"Eh, burning you alive isn't their real goal. They're actually trying to distract from a larger crime. Stop distracting us from the real problem with your burning house.\" Even if you're right and this is a distraction, the fires they're setting have to be taken seriously.\n\n>The party itself will do the least amount of work for the most political gain - which here means pretending to care about abortion while redirecting the resources this kind of law would require to something even more sinister and pointed, like dismantling voting rights or codifying protections for extralegal police actions.\n\nPlease explain the huge, huge amount of effort that have been put in so far, then. Why overturn Roe v. Wade? Under your theory, the easiest thing to do is just keep flogging it with their base but never actually overturn it because there goes their distraction. Instead they've spent decades and huge amounts of time and money getting us here.\n\nI'm so sick of this notion that the problem isn't the *Real* Problem™. Everything isn't a distraction from whatever the speaker's pet cause is. Absolutely voter suppression is important and needs to be stopped, but *so does this*.",
                      "timestamp": "2022-07-18 17:51:03",
                      "score": 1,
                      "num_children": 1,
                      "author": 163845,
                      "replies": [
                        {
                          "id": "igo7k0o",
                          "text": "I think we're losing sight of the fact that we're on the same side. We're both concerned about the same thing and want the same outcomes, we just have different ideas about how events will unfold from this point. \n\nNo offense intended by my comments, apologies if I presented my perspective differently. I tried to make it clear that it was just my limited and subjective opinion the circumstances.\n\nCheers.",
                          "timestamp": "2022-07-18 18:13:15",
                          "score": 1,
                          "num_children": 1,
                          "author": 170651,
                          "replies": [
                            {
                              "id": "igojyn3",
                              "text": "Well, are we on the same side? I get you're not trying to ban abortion, but I'm not sure you're affirmatively for it as a thing to fight for directly. \n\nThousands of women's lives are being destroyed, countless children are being born into homes that don't want them - homes that will abuse and kill them. Women are dying from ectopic pregnancies because hospitals have decided it's too expensive to be liable if the courts decide that count as an abortion. That's the state of things, and you're saying the people who did that are merely\n\n>pretending to care about abortion while redirecting the resources this kind of law would require to something even more sinister and pointed\n\nAs if what they've done isn't sinister and pointed enough. They're not merely killing women and children, no. There's also something *really* bad they're doing. \n\nYou said not to worry because even if they do it it won't last long enough to kill enough people to matter. *Even after they overturned Roe* you're still claiming we don't have to worry, they'll tucker themselves out. This really makes it seem like you consider abortion access a good thing, but not something to fight for in and of itself. That's not my side. That's a fairweather friend who expects my support but considers my reality a distraction. \n\nI see that attitude a lot from leftists on a wide variety of topics, and it really makes me worry if they're on my side in a way I can count on. The left has a very long history of punting on the rights of women and minorities because they're \"identity politics\" or a distraction from class issues or whatever, and it sucks.",
                              "timestamp": "2022-07-18 19:34:51",
                              "score": 1,
                              "num_children": 1,
                              "author": 163845,
                              "replies": [
                                {
                                  "id": "igp3o69",
                                  "text": "The fuck are you on about? I didn't say or imply any of that nonsense. \n\nI said that a hypothetical law is only hypothetical and is almost certain to remain hypothetical for the reasons I listed, so don't prioritize worrying about this hypothetical thing over the very, very real things that you listed. I NEVER said that overturning Roe was a minor issue or that it was overshadowed by anything else. But what the fuck do you propose to do to overturn the SCOTUS ruling? Either get Manchin and Synema to play ball with legislation or get fucked.\n\nThe number of assumptions and over reaches you just made is so ridiculous I'm tempted to think you're a troll. Either way, for the record, I am staunchly in favor of access to safe, legal, and confidential abortion services for all women, regardless of age, ethnicity, religion, marital status, state of residency, or any other characteristic.  \n\nThat's all I've got to say. Cheers.",
                                  "timestamp": "2022-07-18 21:44:55",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 170651,
                                  "replies": [
                                    {
                                      "id": "igp6lfg",
                                      "text": ">I said that a hypothetical law is only hypothetical and is almost certain to remain hypothetical for the reasons I listed, so don't prioritize worrying about this hypothetical thing over the very, very real things that you listed.\n\nNo, you did not say that we should prioritize things like the ectopic pregnancy issue. You said it's all a distraction while they do something \"more sinister,\" and defined that as things like voting rights or shielding cops. You didn't say word one about putting energy towards the current issues around abortion, you only declared that the Real Issue isn't abortion, it's cops and voting.\n\nFor the rest, I never thought you were anti-abortion, and I didn't say anything about changing the state of Roe v. Wade. I'm saying overturning it was, up until a few weeks ago, the canonical \"Calm down, we don't have to worry about it. They'll never do it.\" My point was they did it after all, they'll keep doing stuff we think they can't, and we need to wake up to that. \"They can't pull it off\" isn't safe anymore. It hasn't been for decades and I'm sorry people still can't see that. \n\nCheers.",
                                      "timestamp": "2022-07-18 22:04:54",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 163845,
                                      "replies": [
                                        {
                                          "id": "igpfp2c",
                                          "text": "Yo, there's a big difference between \"they can't overturn a judicial precedent\" (which is a single action that requires zero financial backing or political capital and is in the hands of people with lifetime appointments) and \"they can't survive crippling their state economies in order to try and magic a massive logistical and financial infrastructure into existence against enormous legal opposition on only state funding\". I have never in my life said the first. This whole discussion started because I pointed out the second. Everything else you're throwing at me is a straw man.\n\nI'm not advocating for anything. I just wanted to point out that the circumstances described in the OP are not reality. Shit like that is truly horrifying to contemplate, and a lot of people be needlessly anxious about something that Is. Not. Real. That's it.",
                                          "timestamp": "2022-07-18 23:09:21",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 170651,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "igmylq1",
              "text": "On point 3: Justice Thomas has already stated his intent to dismantle other related decisions that rely on the 4th amendment, do not rely on this.",
              "timestamp": "2022-07-18 13:02:14",
              "score": 1,
              "num_children": 0,
              "author": 15385,
              "replies": []
            }
          ]
        },
        {
          "id": "ih17s14",
          "text": "Conservative lobby groups are drafting laws that allow citizens to sue anyone who helps a pregnant woman have an abortion outside the state. So I think it makes taxi drivers/friends liable if they help pregnant women.",
          "timestamp": "2022-07-21 10:38:16",
          "score": 1,
          "num_children": 0,
          "author": 364122,
          "replies": []
        }
      ]
    },
    {
      "id": "igj2n6w",
      "text": "If you need or are interested in supporting reproductive rights, [I made a master post of pro-choice resources](https://docdro.id/s3OwS8u). Please comment if you would like to add a resource and spread this information on whatever social media you use.",
      "timestamp": "2022-07-17 15:51:52",
      "score": 54,
      "num_children": 0,
      "author": 168329,
      "replies": []
    },
    {
      "id": "igk2vvp",
      "text": "Excuse me? Wtf horrible news did I miss today?",
      "timestamp": "2022-07-17 20:13:48",
      "score": 10,
      "num_children": 1,
      "author": 203879,
      "replies": [
        {
          "id": "igm2ibf",
          "text": "Politicians advocating for making crossing state lines to get an abortion illegal",
          "timestamp": "2022-07-18 06:31:03",
          "score": 5,
          "num_children": 1,
          "author": 411185,
          "replies": [
            {
              "id": "igmji4f",
              "text": "Definitely in some handmaids tale flashback scene over here. Christ.",
              "timestamp": "2022-07-18 10:23:46",
              "score": 3,
              "num_children": 0,
              "author": 203879,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "igjp73o",
      "text": "Idiot and asshole seems redundant, like if you said MAGA asshole?",
      "timestamp": "2022-07-17 18:35:33",
      "score": 8,
      "num_children": 0,
      "author": 317995,
      "replies": []
    },
    {
      "id": "igkeqhv",
      "text": "Your papers, please!",
      "timestamp": "2022-07-17 21:38:37",
      "score": 7,
      "num_children": 1,
      "author": 18645,
      "replies": [
        {
          "id": "igmpi89",
          "text": "Love the game, hate the live action remake we seem to be living in though...",
          "timestamp": "2022-07-18 11:35:45",
          "score": 2,
          "num_children": 0,
          "author": 120002,
          "replies": []
        }
      ]
    },
    {
      "id": "iglbcb4",
      "text": "Stop being nice. Call them nazis. Alt right is not what they are. That is a keystroke.",
      "timestamp": "2022-07-18 01:56:28",
      "score": 6,
      "num_children": 0,
      "author": 186117,
      "replies": []
    },
    {
      "id": "iglhziw",
      "text": "Wow we should be carrying. We have the right to travel unmolested.",
      "timestamp": "2022-07-18 02:52:16",
      "score": 7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "igjilsc",
      "text": "Here's an idea:  We get a HUGE convoy of women traveling across a state border in the same place and absolutely overwhelm their resources.",
      "timestamp": "2022-07-17 17:48:42",
      "score": 25,
      "num_children": 1,
      "author": 319340,
      "replies": [
        {
          "id": "igk5z0o",
          "text": "The only thing that scares them more than a convoy of immigrants is a convoy of liberal women",
          "timestamp": "2022-07-17 20:35:41",
          "score": 12,
          "num_children": 1,
          "author": 167610,
          "replies": [
            {
              "id": "igk64r8",
              "text": "Then you're easily scared, as immigrant convoys are a boogie man made up by Republicans to keep you scared and on-topic.",
              "timestamp": "2022-07-17 20:36:50",
              "score": 1,
              "num_children": 0,
              "author": 319340,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "igkho77",
      "text": "In still dealing with my gym saying I owe them $125 dollars during Covid even though they were closed. And then my bank being charged that even though I didn't have the account anymore. 😒",
      "timestamp": "2022-07-17 22:00:17",
      "score": 3,
      "num_children": 0,
      "author": 258687,
      "replies": []
    },
    {
      "id": "igkakh7",
      "text": "Alt right sucks I bet they’re not so perfect sucks",
      "timestamp": "2022-07-17 21:08:24",
      "score": 2,
      "num_children": 0,
      "author": 143243,
      "replies": []
    },
    {
      "id": "igkookf",
      "text": "But the gym closing effects *them,* testing everyone woman effects *others*",
      "timestamp": "2022-07-17 22:52:37",
      "score": 2,
      "num_children": 0,
      "author": 181958,
      "replies": []
    },
    {
      "id": "iglpl63",
      "text": "Jo is once again spitting straight facts.",
      "timestamp": "2022-07-18 04:05:53",
      "score": 1,
      "num_children": 0,
      "author": 81607,
      "replies": []
    },
    {
      "id": "igjutoz",
      "text": "[removed]",
      "timestamp": "2022-07-17 19:16:06",
      "score": -10,
      "num_children": 4,
      "replies": [
        {
          "id": "igl4uqn",
          "text": "Who is she \"shilling\" for... *women??*",
          "timestamp": "2022-07-18 01:03:07",
          "score": 8,
          "num_children": 0,
          "author": 327969,
          "replies": []
        },
        {
          "id": "iglbb5q",
          "text": "I'd love to get paid for that, who's employing her and how do I apply?",
          "timestamp": "2022-07-18 01:56:12",
          "score": 4,
          "num_children": 0,
          "author": 84883,
          "replies": []
        },
        {
          "id": "igm2jqh",
          "text": "Found the Nazi",
          "timestamp": "2022-07-18 06:31:33",
          "score": 2,
          "num_children": 0,
          "author": 411185,
          "replies": []
        },
        {
          "id": "igmfkl2",
          "text": "[removed]",
          "timestamp": "2022-07-18 09:30:26",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "igkt3jy",
      "text": "I agree with the tweet but I’m getting tired of seeing this girl quite frankly…",
      "timestamp": "2022-07-17 23:27:05",
      "score": -6,
      "num_children": 0,
      "author": 46735,
      "replies": []
    }
  ]
}