{
  "id": "w54q0u",
  "text": "this is just true\n",
  "timestamp": "2022-07-22 07:53:31",
  "score": 549,
  "subreddit": "t5_2zaj2",
  "num_children": 11,
  "author": 109006,
  "replies": [
    {
      "id": "ih624qs",
      "text": "\"feminism is about equality\" \n\n\\-lie of the century",
      "timestamp": "2022-07-22 09:25:13",
      "score": 84,
      "num_children": 2,
      "author": 191113,
      "replies": [
        {
          "id": "ih6evua",
          "text": "Feminism is about superiority now",
          "timestamp": "2022-07-22 11:53:06",
          "score": 33,
          "num_children": 1,
          "replies": [
            {
              "id": "ih6f16w",
              "text": "Always has been",
              "timestamp": "2022-07-22 11:54:32",
              "score": 37,
              "num_children": 1,
              "author": 225194,
              "replies": [
                {
                  "id": "ih6wy3l",
                  "text": "🌎👨‍🚀🔫👨‍🚀",
                  "timestamp": "2022-07-22 14:15:28",
                  "score": 15,
                  "num_children": 2,
                  "author": 208875,
                  "replies": [
                    {
                      "id": "ih766eg",
                      "text": "Shots fired",
                      "timestamp": "2022-07-22 15:16:50",
                      "score": 7,
                      "num_children": 0,
                      "author": 287753,
                      "replies": []
                    },
                    {
                      "id": "ih7q8b4",
                      "text": "Hah! I get it",
                      "timestamp": "2022-07-22 17:25:08",
                      "score": 2,
                      "num_children": 0,
                      "author": 301064,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ih7vyq0",
          "text": "This isn’t feminism. This is just a gross idiot thinking that she has the right to other peoples’ bodies.",
          "timestamp": "2022-07-22 18:01:52",
          "score": -8,
          "num_children": 1,
          "author": 268083,
          "replies": [
            {
              "id": "ih80v43",
              "text": "You just don't get it.\n\nFeminism is the fact that she won't be in jail more than a few days, if she even gets to jail. Meanwhile a man that does that to a female team would be lucky to arrive alive to jail.\n\nAt this point, anyone who is a feminist just either doesn't really bother with the issue and does whatever everyone else does, or is just a fucking liar.",
              "timestamp": "2022-07-22 18:33:45",
              "score": 10,
              "num_children": 1,
              "author": 191113,
              "replies": [
                {
                  "id": "ih81lre",
                  "text": "I’m a feminist and I would throw her in jail in a heartbeat. That’s my point. I’ve worked professionally with male and female victims of abuse and assault for years now and all of my coworkers who are feminists would take the same stance. Sexual assault is sexual assault. Period. \n\nIf she didn’t get thrown in jail, feminism hasn’t succeeded at its goals. Misandry masquerading as feminism and patriarchal “men can’t be assaulted/he must have wanted it” societal norms have succeeded. You’re right that she should have gotten more consequences than she probably did. She and anyone who defended her are assholes.",
                  "timestamp": "2022-07-22 18:38:38",
                  "score": -2,
                  "num_children": 2,
                  "author": 268083,
                  "replies": [
                    {
                      "id": "ih8k2hz",
                      "text": "*The following is a very informed comment by Karen Straughan:*\n\nSo what you're saying is that you, a commenter using a username on an internet forum are the true feminist, and the feminists actually responsible for changing the laws, writing the academic theory, teaching the courses, influencing the public policies, and the massive, well-funded feminist organizations with thousands and thousands of members all of whom call themselves feminists... they are not \"real feminists\".\n\nThat's not just \"no true Scotsman\". That's delusional self deception.\n\nListen, if you want to call yourself a feminist, I don't care. I've been investigating feminism for more than 9 years now, and people like you used to piss me off, because to my mind all you were doing was providing cover and ballast for the powerful political and academic feminists you claim are just jerks. And believe me, they ARE jerks. If you knew half of what I know about the things they've done under the banner of feminism, maybe you'd stop calling yourself one.\n\nBut I want you to know. You don't matter. You're not the director of the Feminist Majority Foundation and editor of Ms. Magazine, Katherine Spillar, who said of domestic violence: \"Well, that's just a clean-up word for wife-beating,\" and went on to add that regarding male victims of dating violence, \"we know it's not girls beating up boys, it's boys beating up girls.\"\n\nYou're not Jan Reimer, former mayor of Edmonton and long-time head of Alberta's Network of Women's Shelters, who just a few years ago refused to appear on a TV program discussing male victims of domestic violence, because for her to even show up and discuss it would lend legitimacy to the idea that they exist.\n\nYou're not Mary P Koss, who describes male victims of female rapists in her academic papers as being not rape victims because they were \"ambivalent about their sexual desires\" (if you don't know what that means, it's that they actually wanted it), and then went on to define them out of the definition of rape in the CDC's research because it's inappropriate to consider what happened to them rape.\n\nYou're not the National Organization for Women, and its associated legal foundations, who lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male.\n\nYou're not the Florida chapter of the NOW, who successfully lobbied to have Governor Rick Scott veto not one, but two alimony reform bills in the last ten years, bills that had passed both houses with overwhelming bipartisan support, and were supported by more than 70% of the electorate.\n\nYou're not the feminist group in Maryland who convinced every female member of the House on both sides of the aisle to walk off the floor when a shared parenting bill came up for a vote, meaning the quorum could not be met and the bill died then and there.\n\nYou're not the feminists in Canada agitating to remove sexual assault from the normal criminal courts, into quasi-criminal courts of equity where the burden of proof would be lowered, the defendant could be compelled to testify, discovery would go both ways, and defendants would not be entitled to a public defender.\n\nYou're not Professor Elizabeth Sheehy, who wrote a book advocating that women not only have the right to murder their husbands without fear of prosecution if they make a claim of abuse, but that they have the moral responsibility to murder their husbands.\n\nYou're not the feminist legal scholars and advocates who successfully changed rape laws such that a woman's history of making multiple false allegations of rape can be excluded from evidence at trial because it's \"part of her sexual history.\"\n\nYou're not the feminists who splattered the media with the false claim that putting your penis in a passed-out woman's mouth is \"not a crime\" in Oklahoma, because the prosecutor was incompetent and charged the defendant under an inappropriate statute (forcible sodomy) and the higher court refused to expand the definition of that statute beyond its intended scope when there was already a perfectly good one (sexual battery) already there. You're not the idiot feminists lying to the public and potentially putting women in Oklahoma at risk by telling potential offenders there's a \"legal\" way to rape them.\n\nAnd you're none of the hundreds or thousands of feminist scholars, writers, thinkers, researchers, teachers and philosophers who constructed and propagate the body of bunkum theories upon which all of these atrocities are based.\n\nYou're the true feminist. Some random person on the internet.",
                      "timestamp": "2022-07-22 20:39:51",
                      "score": 11,
                      "num_children": 1,
                      "author": 347390,
                      "replies": [
                        {
                          "id": "ih8py60",
                          "text": "I appreciate the information. This is all worth saving and reviewing in depth. I had heard of some of these, but definitely not all of them, and I agree with you wholeheartedly. I’m NOT the true feminist, and I apologize if my comment made it seem like I believe I can singlehandedly wipe out all wrongdoing from the title. I’m well aware of the No True Scotsman concept, and I try to stay conscious of it, though I know that my personal approach as a random person on the internet doesn’t define feminism despite any efforts I may make in *any* direction. I do want to take time to respond though, because this topic matters to me. \n\nFeminism has been used to justify millions of small horrific actions, just like many philosophies have. Each of those people believe wholeheartedly, as much as I do or more, that their feminism is True Feminism. However, I believe that this proves that there IS no central definition of feminism that’s strong enough to wipe out all others, rather than believing that true feminism is awful because of those feminists in particular. \n\nI watch this group for perspective, for news, etc. I’m wholeheartedly against the same misandrist, exclusionary, unfair treatment that everyone here is, but I’m against that all while still identifying as a feminist. If we can’t let good feminism cross out bad feminism, we can’t allow the reverse either. I don’t join this group because I’m NOT antifeminist. I’m anti gender inequality, which (by many still-central definitions of feminism) I believe strengthens my feminist stance. Googling “why I am feminist” (yes, I know I don’t have the thorough list of sources you’ve provided, but I’m happy to go back and search some later) leads to a list of top results that almost all mention equality, rights for men to express emotions and traditionally ‘feminine’ traits, etc. Fuck the people who define it otherwise. Yes, I still have to be conscious as a feminist of not being, representing, or reminding people of them, but I’m not trashing an entire historically powerful, compassionate movement because of shitty extremists. Similarly, the valid antifeminist critiques shouldn’t be defined by the members of this subreddit who get violently anti women at moments, which I call out each time. The goal, at least for me, is equality. I think most on this thread would agree. that’s why I start the conversation and attempt to have the conversation as separated of feminist or antifeminist labels as possible. \n\nDoes that address your point?",
                          "timestamp": "2022-07-22 21:18:11",
                          "score": -1,
                          "num_children": 1,
                          "author": 268083,
                          "replies": [
                            {
                              "id": "ihl4ju4",
                              "text": "Not really, no. Particularly because men shouldn't be told when, how, or if they should express their emotions at all. While holding in emotions is certainly not healthy, it's important to remember that men do not express emotions the same way that women do. In fact, men will manifest entirely different emotions than women will given the exact same stimuli. Yet the male emotions and ways of expressing those emotions are demonized even by your brand of feminism; aggression, anger, frustration, and other traditionally masculine emotions, for example, are overwhelmingly considered \"bad\" when they're present in men (not in women, though). Violence (channeled appropriately), a focus on problem-solving instead of venting, doing something productive instead of focusing on the emotion, and other masculine approaches to handling and processing emotions are all seen as \"not helpful\" in the best of times, and \"toxic\" at the worst. This is despite the fact that it clearly isn't working for men. Some research suggests that up to 91% of men who commit suicide sought professional help, many of them seeking help the very day that they commit suicide. Yet psychotherapy and counseling - both fields *heavily* dominated by women, who use as their methods traditionally female emotional processing skills - clearly didn't help them.\n\nFeminism does not want men to be healthy men. It wants men to be like women. If you want to make your own definition of feminism, then make it so that men are free to handle their emotions in a way that is best for them; if you push for reproductive and parental rights for women, make it include men too (men do not currently possess these in most any country worldwide); make it include bodily autonomy for men (male genital mutilation is currently legal in most if not all countries; in the US men don't even have the right to their own semen; of course, male-only drafts are a thing in many countries, though not all, and some do conscript both), and let's not forget gender-neutral law, policy, practice, and criteria for statistics when it comes to abuse, sexual assault, and rape (men are raped by women using force-to-penetrate just about as often as women are raped by men using forced penetration, yet only women's rapes by men (and men raping other men) are counted in the statistics; assuming, of course, that men can even be raped or abused at all under the law; the US considers it possible for men to be raped, but only by other men; most other countries worldwide don't even consider *that* possible. This is, in many cases, the direct result of feminists, who have protested heavily against gender-neutral laws in India and Israel. And don't even get me *started* on the Duluth model of domestic abuse, which is still the main doctrine for abuse in police departments and courts in the US and many other countries worldwide.\n\nLook, at the end of the day, it doesn't matter how *you* define feminism. The overwhelming majority of people who are the thought leaders, philosophers, professors, lobbyists, politicians, activists, authors, and policymakers of feminism are rabid misandrists, and proud of it; in fact, it is nearly impossible to find one of the above who isn't. Whatever the general population - including you and I - thinks is irrelevant.\n\nFeminism has a very few good ideas, and to those I have no problem agreeing; however, from its beginnings in the 19th century it has been filled with misandry, female-supremacy, and rampant sexism. If you are anything, you are an egalitarian, not a feminist.",
                              "timestamp": "2022-07-25 15:12:28",
                              "score": 2,
                              "num_children": 0,
                              "author": 347390,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ih8a5w8",
                      "text": "Then fly back to your flock and see how well these great ideas you have are taken.",
                      "timestamp": "2022-07-22 19:34:39",
                      "score": 5,
                      "num_children": 1,
                      "author": 191113,
                      "replies": [
                        {
                          "id": "ih8lm5n",
                          "text": "What do you mean? This is a common discussion that I’ve had and the ideas are ALWAYS taken well. I’m trying to have an open conversation on all sides, because our opinions aren’t as different as we’ve ever been lead to believe. I get valuable things from this page, but some representations are flat out wrong.",
                          "timestamp": "2022-07-22 20:49:52",
                          "score": 0,
                          "num_children": 1,
                          "author": 268083,
                          "replies": [
                            {
                              "id": "ihapwat",
                              "text": "So when the domestic abuser Amber Heard finally got what she deserved this is what was going on in r/Feminism:\n\n[https://www.reddit.com/r/Feminism/comments/use16n/why\\_its\\_time\\_to\\_believe\\_amber\\_heard/](https://www.reddit.com/r/Feminism/comments/use16n/why_its_time_to_believe_amber_heard/) \n\n[https://www.reddit.com/r/Feminism/comments/v10rwt/the\\_deppheard\\_trial\\_is\\_monstrous\\_its\\_just\\_the/](https://www.reddit.com/r/Feminism/comments/v10rwt/the_deppheard_trial_is_monstrous_its_just_the/) \n\n[https://www.reddit.com/r/Feminism/comments/ut8zxr/what\\_exactly\\_did\\_amber\\_heard\\_do\\_wrong/](https://www.reddit.com/r/Feminism/comments/ut8zxr/what_exactly_did_amber_heard_do_wrong/) \n\nMeanwhile this is what everyone else thinks of you:\n\n[https://www.reddit.com/r/fuckthesepeople/comments/v17jwd/i\\_was\\_banned\\_from\\_rfeminism\\_for\\_saying\\_that\\_amber/](https://www.reddit.com/r/fuckthesepeople/comments/v17jwd/i_was_banned_from_rfeminism_for_saying_that_amber/) \n\nYeah I guess you're just the liar type feminist. Feel free to lie to your heart's content. You filthy liars are the reason **more than half of all the one-sided domestic abuse** is completely ignored because the victim is a man and the perpetrator a woman.",
                              "timestamp": "2022-07-23 07:39:04",
                              "score": 2,
                              "num_children": 0,
                              "author": 191113,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ih63ip2",
      "text": "Feminism nowadays is just about oppressing men for literally just existing.\nBack then it really was just for equal rights for women because back then they needed it. But now they have EVERYTHING and yet are still complaining!",
      "timestamp": "2022-07-22 09:43:42",
      "score": 47,
      "num_children": 5,
      "author": 358867,
      "replies": [
        {
          "id": "ih66c55",
          "text": "Except it wasn't good back then either.\n\nYou didn't read \"the declaration of sentiments\" or heard about the white feather campaign?",
          "timestamp": "2022-07-22 10:19:33",
          "score": 24,
          "num_children": 2,
          "replies": [
            {
              "id": "ih66gcd",
              "text": "It wasnt? Ugh i guess it only gets worse then...\nI assumed it was better back then because women were oppressed way more as far as i know.",
              "timestamp": "2022-07-22 10:20:56",
              "score": 8,
              "num_children": 1,
              "author": 358867,
              "replies": [
                {
                  "id": "ih6nwae",
                  "text": "1912-1914 they were literally doing terrorist attacks in England.\n\nAnd OG feminists were racist as heck.",
                  "timestamp": "2022-07-22 13:10:13",
                  "score": 15,
                  "num_children": 2,
                  "author": 180640,
                  "replies": [
                    {
                      "id": "ih77ak0",
                      "text": "Tbf like everyone was racist back then",
                      "timestamp": "2022-07-22 15:24:07",
                      "score": 2,
                      "num_children": 1,
                      "author": 352347,
                      "replies": [
                        {
                          "id": "ih911hs",
                          "text": "Finding a non racist person in the 1900s was like finding a free black man during the same time",
                          "timestamp": "2022-07-22 22:34:53",
                          "score": 2,
                          "num_children": 0,
                          "author": 310057,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ih77x90",
                      "text": "Aight didnt know, my apologies",
                      "timestamp": "2022-07-22 15:28:09",
                      "score": 1,
                      "num_children": 1,
                      "author": 358867,
                      "replies": [
                        {
                          "id": "ih7ahrd",
                          "text": "Nah cool. No need to apologize :)",
                          "timestamp": "2022-07-22 15:44:37",
                          "score": 1,
                          "num_children": 0,
                          "author": 180640,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ih8p3b4",
              "text": "The suffrage started because black men had the right to vote... So it started off with racism and now it's racism and men hating😁",
              "timestamp": "2022-07-22 21:12:32",
              "score": 1,
              "num_children": 0,
              "author": 207185,
              "replies": []
            }
          ]
        },
        {
          "id": "ih69wzj",
          "text": "Women weren’t oppressed back then any more than men were. Life was pretty bad for 99% of the population who didn’t have wealth and power, part of the “elite”. Same as it’s always been. Look at the life of coal miners or factory workers in the 1800’s and early 1900’s. Life was brutal with high rate of death in the workplace, subsistent wages, and really low standard of living. Women didn’t work these dangerous jobs because they were dangerous. Not many cushy office jobs or retail work going on. Now they point to this as oppression. \n\nSince the beginning of time women have had it easier than men, they live longer than men, less stress, and yet they view this as oppression because they compare todays society (built on the backs of men) to historical societies",
          "timestamp": "2022-07-22 11:01:49",
          "score": 19,
          "num_children": 2,
          "author": 313553,
          "replies": [
            {
              "id": "ih6fbri",
              "text": "They wanted to get rid of the golden handcuffs and now they are waking up to reality and dont like what they see so they enslave men.",
              "timestamp": "2022-07-22 11:57:23",
              "score": 6,
              "num_children": 0,
              "author": 225194,
              "replies": []
            },
            {
              "id": "ih6x9e2",
              "text": "This is actually one of my favorite subjects that I've written multiple papers on, and I can actually point you towards some really great literature from that time.\n\nI'll just give you the quick run down tho, and if you want me to elaborate further I can.\n\n>Women weren’t oppressed back then any more than men were\n\nDepends on the time period and location, but for the sake of simplicity we're going to focus on 18th-20th century Europe and America. It's true most people were living pretty shitty lives. Men had certain expectations and duties that they had to meet and they had limited options in what direction their life could go. The thing with that is, that's as little choices as men had, women at the time had a fraction of that. Men we're still seen as individuals and people, but women were mostly seen as possessions. \n\n\n>part of the “elite”.\n\nThis is where it gets interesting. Nobles around this time typically got their wealth from land ownership and renting it out to others. Noble women were not allowed to work. There were zero options for them, as no place would even consider hiring them. Their duty was to maintain the estate. They were not allowed to have money and were given very little independence. They were not allowed education. They were intentionally left out of education and taught as little as possible from a young age to keep them obedient and childlike. Of course some women went out of their way to learn anyways and would have the men they knew sneak them books and other materials when they went to college. They are also expected to maintain just enough knowledge of small dainty skills to keep them attractive for potential suitors, but they weren't supposed to practice enough to be good at it. Pretty much everything around their raising was revolves around selling them off to a man someday, sometimes with the girl as young as 14 and the man around 30-40. Noble women did have one option to make money if they could pull it off. They could write and publish either under a pseudonym or their husbands name and have a meager amount to keep for themselves.\n\nAround the 17-1800s we start to see a rise of the middle class. There was now a growing middle group as a result of gaining wealth through trades, services, and products rather than through land ownership. This resulted in a common theme of arranged marriages between a noble family with no money, and a wealthy family with no status to bring status and wealth to both families. This new middle class makes it harder to draw the distinction between poor and noble and we now have upper class ideals spreading into middle class families, meaning fewer women were allowed to work. These middle class men despite having their own crushing responsibilities and hardships, had many job options, education options, and ways to climb the ladder. For middle class women, their only use is to get married into a decent family and die having their 11th child. Where then husband would then move on to find the next young wife after losing the person he loved and cared for.\n\n>Women didn’t work these dangerous jobs because they were dangerous.\n\nNow let's move onto the lower class women. From the very beginning of the existence of class distinctions, lower/working class women have always worked. They didn't have the option not to. Their families would not survive and they had no hope of moving up the ladder. These women worked incredibly low paying sometimes dangerous jobs. They worked on factories, farms, in the fields, as nannies, as house servants, seamstresses, weavers, cooks, launderers, livestock handlers, gardeners and so many more. They would also die after having many children.\n\nThe thing all of these women had in common regardless of class status was they were not allowed to have money of their own, they were not allowed any day in their government whether it be local or on a larger scale, they were not allowed education, they were not allowed to vote, they were not allowed to leave abusive marriages unless they almost died, they could not fight for their country so some snuck in disguised as men and the rest did whatever they could to help back home, they couldn't own land, and over all they had very few choices and options for their lives, even less than the already low choices for men at the time.\n\n\nOf course these are all generalizations formed from recorded trends, documents, and firsthand experience passed throughout the centuries. I hope you find this as fascinating as I did as I just love history.\n\n\n>Since the beginning of time women have had it easier than men, they live longer than men, less stress\n\nVery very much not true. Men and women have faced hardships at every century, the human race has screwed itself over countless times. But to ignore history would be an injustice. We should be advocating for the injustices of men and women instead of putting down the experiences of others.",
              "timestamp": "2022-07-22 14:17:37",
              "score": -2,
              "num_children": 1,
              "replies": [
                {
                  "id": "ih80fgh",
                  "text": "Quite a long post so I probably won’t hit all your points and I’m only focusing on the 19th and 20th century as before that was a completely different era entirely, but it seems like you’re mistaking a disproportionate representation for oppression or lack of opportunity. For example, while a majority of women did not attend college in the 1800’s and 1900’s, it didn’t mean they didn’t have to right to. In 1870, approximately 9k women attended colleges and universities, making up roughly 20% of students. This number grew to almost 500k by 1930, a little less than half of all students. And again this was mostly an upperclass institution as less than 5% of the population attended college at the turn of the century. Before the 18th century, college was unheard of, male or female unless you were wealthy, and Only 1-2% attended college. Literacy rates for both boys and girls for primary education were also within a few percentage points of each other through the 19th and 20th centuries. \n\nAs for working, nothing barred women from working during the 19th and 20th century, (not sure about pre 1800, I’m sure jobs were very limited) however their job prospects were low. They were mainly employed as midwife’s, nursing, teaching, cooks, nannies, and servants. While they also worked in factories and some even in coal mines, this was a very small percentage of the women work force. In the upper class, most women didn’t work because they didn’t have to. No oppression necessary, as most people today wouldn’t work if they didn’t have to either. \n\nThe men meanwhile worked the most dangerous jobs. These included construction, factories, mining, railroad work, fishing, farming, etc. These jobs typically precluded women, not because of oppression, but because they were dangerous and highly labor intensive. I believe the workplace death rate back then was somewhere around 70 out of every 1000 worker fatalities. In context, that’s around 3 out of every 1000 today. So while women did work in factories and even coal mines (they worked on the surface while men went into the mine), the majority of them lacked the physical strength and fortitude to perform these jobs. Same with the military. What’s ironic though about your position that women didn’t work these jobs because they were oppressed is the male to female ratio of these jobs had remained pretty much the same over the last 200 years even though they have more “choice”. Today men outnumber women in all mentioned fields while women outnumber men in teaching, healthcare, child care, and hospitality. \n\nAs far as women being wed and having children in their teenage years, this was common but not because they were oppressed. You have to remember the life expectancy up until the mid 19th century was only 30-40 years. This grew to the 50-60 range in the 20th century when’re you’ll find teenage pregnancies and the number of children being born also declined. So getting married at 14 or 15 was common as 1. Most families were very large especially in agrarian society due to the need for family labor to work the fields, so boys worked and women were married off for a man to support you 2. Women’s prime child birthing years were between 15 and 27 or so, so if you were to have a large family (which was seen as a good thing back then) you didn’t have the luxury to wait until you were 30 like today. Also, by your 30’s the chances of death due to child birth grew a lot and most people were dead by they 40’s and early 50’s. \n\nTo sum it up, your claim that men have had many more options than women is technically true (it’s like telling a child he could be anything he/she wants when he grows up) but not really practical or historically accurate. Most men did not go to college despite having the “option”, they more likely than not started working at a very young age doing the exact same work as his father. Education was for the upper class, man or woman. Women did start having children at a younger ages, but this was due to necessity/culture more than “oppression”. Women actually were happy with raising children and not slaving away 50-60 hours/week. This is seen in almost any animal species on earth as the male is typically the provider/protector and the female is the caregiver/nurturer. You can see this today in the jobs women and men tend to choose even today with so much “choice”",
                  "timestamp": "2022-07-22 18:30:54",
                  "score": 6,
                  "num_children": 0,
                  "author": 313553,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ih66mv2",
          "text": "That's because deep down inside, women want to be \"oppressed\" once more because, instinctively, they know that a man who allows her to do anything she wants cannot possibly care about her or truly love her.  It takes real men to do that... today's lack thereof being what she's *really* complaining about!",
          "timestamp": "2022-07-22 10:23:11",
          "score": 7,
          "num_children": 0,
          "author": 52442,
          "replies": []
        },
        {
          "id": "ih6jab3",
          "text": "It started as an anti black movement",
          "timestamp": "2022-07-22 12:32:49",
          "score": 3,
          "num_children": 0,
          "author": 19235,
          "replies": []
        },
        {
          "id": "ih8fqxy",
          "text": "Feminists going for equal rights back the day was no different than Hitler and the Nazis doing some good for Germany's fucked up economy before assembling his Third Reich...",
          "timestamp": "2022-07-22 20:11:31",
          "score": 1,
          "num_children": 0,
          "author": 354634,
          "replies": []
        }
      ]
    },
    {
      "id": "ih8ej8e",
      "text": "laws should change with time",
      "timestamp": "2022-07-22 20:03:27",
      "score": 3,
      "num_children": 0,
      "author": 120220,
      "replies": []
    },
    {
      "id": "ih82z2a",
      "text": "this shit drives me insane man how does everyone just let her get away with it",
      "timestamp": "2022-07-22 18:47:34",
      "score": 2,
      "num_children": 0,
      "author": 404983,
      "replies": []
    },
    {
      "id": "ih8fk0s",
      "text": "Lock her up",
      "timestamp": "2022-07-22 20:10:15",
      "score": 2,
      "num_children": 0,
      "author": 354634,
      "replies": []
    },
    {
      "id": "ih8hn3f",
      "text": "Did anything happen to her? Or was she just told to get off the field?",
      "timestamp": "2022-07-22 20:24:01",
      "score": 2,
      "num_children": 0,
      "author": 240081,
      "replies": []
    },
    {
      "id": "iham2lz",
      "text": "But but but society tells women that they have to do this because the patriarchy wins if you don’t.\nThey can’t have equality if they don’t inflict the same things on us that they don’t want to happen to them!\n\nObviously sarcasm. I’m sick of them “rationalizing” behavior like this by claiming men treated women like this in the past.\nRapists and wife beaters were ostracized and in some places put to death in a lot of parts of the word for a good part of history.",
      "timestamp": "2022-07-23 06:50:31",
      "score": 2,
      "num_children": 0,
      "author": 104276,
      "replies": []
    },
    {
      "id": "ih76mlz",
      "text": "Feminism started out as one movement, now it's, like, four or five. Some are toxic some are super wholesome.",
      "timestamp": "2022-07-22 15:19:47",
      "score": 2,
      "num_children": 1,
      "author": 141508,
      "replies": [
        {
          "id": "ih8pfky",
          "text": "Started out as racist. They demanded to vote after black men, they were okay with white rich and poor men being able to vote but when blacks after getting the right from finishing a war the white woman started suffrage...",
          "timestamp": "2022-07-22 21:14:48",
          "score": 3,
          "num_children": 0,
          "author": 207185,
          "replies": []
        }
      ]
    },
    {
      "id": "ih8w6dk",
      "text": "Chad",
      "timestamp": "2022-07-22 22:00:24",
      "score": 1,
      "num_children": 0,
      "author": 9803,
      "replies": []
    },
    {
      "id": "ih7yooj",
      "text": "Assuming this is true, why did all of those guys let her do that to them anyway? If they're all college or professional athletes I would expect them to be able to physically prevent her from assaulting them even if there was no security.",
      "timestamp": "2022-07-22 18:19:37",
      "score": -1,
      "num_children": 2,
      "author": 367226,
      "replies": [
        {
          "id": "ih8plim",
          "text": "She can then claim they physically assaulted her and have them thrown in jail.",
          "timestamp": "2022-07-22 21:15:53",
          "score": 8,
          "num_children": 0,
          "author": 249335,
          "replies": []
        },
        {
          "id": "ih8piet",
          "text": "Then they get sued by her for assaulting her...",
          "timestamp": "2022-07-22 21:15:19",
          "score": 6,
          "num_children": 0,
          "author": 207185,
          "replies": []
        }
      ]
    },
    {
      "id": "iiq9kjn",
      "text": "maybe if you would advocate for better feminism instead of saying that its stupid that problem could be fixed",
      "timestamp": "2022-08-03 02:11:59",
      "score": -1,
      "num_children": 1,
      "author": 281759,
      "replies": [
        {
          "id": "iiykten",
          "text": "The actual feminists do not advocate for better feminism, why do you think they would care about us 💀",
          "timestamp": "2022-08-04 19:58:08",
          "score": 1,
          "num_children": 0,
          "author": 283683,
          "replies": []
        }
      ]
    }
  ]
}