{
  "id": "w5favg",
  "text": "A Satanist got a Kansas school to rethink its anti-‘Satanism’ dress code | \"Banning Satanic students from wearing clothing that declares their faith, while allowing students of all other faiths to wear similar clothing, is an act of discrimination\"\n",
  "timestamp": "2022-07-22 16:48:27",
  "score": 19178,
  "subreddit": "t5_2qh2p",
  "num_children": 89,
  "author": 221311,
  "replies": [
    {
      "id": "ihatekf",
      "text": "Hello r/all, Welcome to r/atheism!\n\nPlease read our [Commandments](http://www.reddit.com/r/atheism/wiki/guidelines) and [FAQ](http://www.reddit.com/r/atheism/wiki/FAQ) before commenting. If you follow the rules and act civilly we can avoid a lot of bans. While everyone is welcome here, this sub is intended for atheists to discuss things of interest to us. This means that a wide variety of subjects are on-topic here. This is not a sub about just atheism.\n\nRemember: The mods do not choose which posts get voted up the frontpage. They remove the posts that violate the [Commandments](/r/atheism/w/guidelines); they don't police quality.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*",
      "timestamp": "2022-07-23 08:25:39",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "ih7rxqi",
      "text": "In the late 90's in my high school, they banned kids from wearing satanic shirts. Especially the very popular Marilyn Manson one with Satan on the front. But the religious kids could wear jesus shirts every day. So the stoners and freaks rose up, and fought the evil school board to get equality for all. It kinda worked. They banned all religion shirts period. We couldn't wear Satan shirts but they couldn't wear their sky daddy shirts either. Sometimes the weird kids win.",
      "timestamp": "2022-07-22 17:35:54",
      "score": 2448,
      "num_children": 31,
      "author": 406630,
      "replies": [
        {
          "id": "ih806lm",
          "text": "We need the same thing to happen on a national scale. Only now the stoners and freaks would instead be the atheists and the progressives.",
          "timestamp": "2022-07-22 18:29:17",
          "score": 770,
          "num_children": 7,
          "author": 283761,
          "replies": [
            {
              "id": "ih8g4gi",
              "text": "The two are the same",
              "timestamp": "2022-07-22 20:13:59",
              "score": 389,
              "num_children": 7,
              "author": 281338,
              "replies": [
                {
                  "id": "ih8gk13",
                  "text": "Now that I think about it, that makes sense.",
                  "timestamp": "2022-07-22 20:16:54",
                  "score": 151,
                  "num_children": 2,
                  "author": 283761,
                  "replies": [
                    {
                      "id": "ih9p1m4",
                      "text": "Can confirm am a stoner. Am an atheist.",
                      "timestamp": "2022-07-23 01:38:34",
                      "score": 129,
                      "num_children": 3,
                      "author": 24299,
                      "replies": [
                        {
                          "id": "ihb7si8",
                          "text": "I am an atheist. Not a stoner. But fully support legalisation. \n\nJust commenting to piss of the folks who think those supporting full drug legalisation just wanna get high.",
                          "timestamp": "2022-07-23 11:34:47",
                          "score": 30,
                          "num_children": 1,
                          "author": 232015,
                          "replies": [
                            {
                              "id": "ihd69dj",
                              "text": "Dudes for the legalation of hemp",
                              "timestamp": "2022-07-23 20:40:59",
                              "score": 1,
                              "num_children": 0,
                              "author": 359016,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ihaankk",
                          "text": "As an atheist stoner, I've also realized there are a lot of atheist stoners who also like soccer and cats. Do you like soccer and cats and want to be friends?",
                          "timestamp": "2022-07-23 04:44:01",
                          "score": 34,
                          "num_children": 4,
                          "author": 276933,
                          "replies": [
                            {
                              "id": "ihbmmql",
                              "text": "Are you me?",
                              "timestamp": "2022-07-23 13:55:25",
                              "score": 9,
                              "num_children": 1,
                              "author": 408349,
                              "replies": [
                                {
                                  "id": "ihdexoh",
                                  "text": "Wanna do play karate in the garage?",
                                  "timestamp": "2022-07-23 21:44:03",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 276933,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "ihbrbms",
                              "text": "Atheist and stoner, also love cats, we have 5! But do not watch or enjoy sports at all except occasionally wrestling (AEW, NJPW)  which is sports like but still not a sport because of the silliness. Also very, very liberal.",
                              "timestamp": "2022-07-23 14:32:14",
                              "score": 4,
                              "num_children": 0,
                              "author": 275757,
                              "replies": []
                            },
                            {
                              "id": "ihbsuly",
                              "text": "I love soccer, don’t mind cats",
                              "timestamp": "2022-07-23 14:43:50",
                              "score": 3,
                              "num_children": 0,
                              "author": 260740,
                              "replies": []
                            },
                            {
                              "id": "ii75cgx",
                              "text": "I would never claim to like soccer and I’m more of a dog person but sure we can be friends just don’t be too weird…maybe a little weird",
                              "timestamp": "2022-07-30 00:19:37",
                              "score": 2,
                              "num_children": 1,
                              "author": 24299,
                              "replies": [
                                {
                                  "id": "ii835yg",
                                  "text": "I like animals in general and if the world was normal itd be a very fucking boring place. Lets smoke, pet dogs and talk about weird shit all day!",
                                  "timestamp": "2022-07-30 05:14:25",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 276933,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "iha5mbb",
                          "text": "Freak-progressive reporting in as a non-stoner psuedo-theist",
                          "timestamp": "2022-07-23 03:56:19",
                          "score": 5,
                          "num_children": 1,
                          "author": 411270,
                          "replies": [
                            {
                              "id": "iha907a",
                              "text": "Rabid atheist, intersectional feminist, will fight for equality and bodily autonomy for all liberal here to work!",
                              "timestamp": "2022-07-23 04:28:00",
                              "score": 11,
                              "num_children": 0,
                              "author": 392672,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ih8tgoy",
                      "text": "I mean, there *are* progressive theists... my step dad's church got kicked out of the Southern Baptist Convention because they are progressive as *fuuuuuuuck* but they're not very common.",
                      "timestamp": "2022-07-22 21:41:50",
                      "score": 75,
                      "num_children": 3,
                      "author": 961,
                      "replies": [
                        {
                          "id": "ih93jw1",
                          "text": "Didn't Jimmy Carter quit his church because of their politics? And the Episcopalians and Unitarians seem pretty cool.\n\nI think believing in any gods is silly, but you can believe in silly things while also respecting other people and letting them live their lives.",
                          "timestamp": "2022-07-22 22:53:04",
                          "score": 66,
                          "num_children": 4,
                          "author": 92043,
                          "replies": [
                            {
                              "id": "ih99qcp",
                              "text": "Agreed. If all theists were those types, we wouldn't be here and could probably coexist fairly well.",
                              "timestamp": "2022-07-22 23:39:02",
                              "score": 43,
                              "num_children": 1,
                              "author": 283761,
                              "replies": [
                                {
                                  "id": "iha5vcu",
                                  "text": "Yeah she Swedish lutheran church (former state church) is very progressive. The vast majority of swedes are atheists but it is not like a major part of their identity and many stay affiliated with the church for traditions and preservation of old church buildings.",
                                  "timestamp": "2022-07-23 03:58:38",
                                  "score": 11,
                                  "num_children": 0,
                                  "author": 48632,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "ih9kx1l",
                              "text": "Can confirm this - I'm fully atheist and married to a Christian. But, I also know, she's definitely in the minority when it comes to open-minded and non-judgemental Christians...",
                              "timestamp": "2022-07-23 01:06:09",
                              "score": 10,
                              "num_children": 0,
                              "author": 1662,
                              "replies": []
                            },
                            {
                              "id": "ih9no54",
                              "text": "Unitarians can barely be called religious at all.  I checked out a local Unitarian church and their prescribed beliefs are almost non-existent except for a vague understanding that some kind of God concept exists.  They are pretty much atheists who aren't ready to give up some Christian aesthetics.",
                              "timestamp": "2022-07-23 01:27:49",
                              "score": 21,
                              "num_children": 2,
                              "author": 60556,
                              "replies": [
                                {
                                  "id": "ih9p1j2",
                                  "text": "I was a full member of a Unitarian church. I am/was openly atheist. Belief in the supernatural isn't always part of it. I would guess it varies a lot from church to church. There was also a Jewish couple that went through the membership process the same time I did. They just liked the way the Unitarians did things, but still considered themselves Jewish. Of the two Unitarian churches I went to services at, one was in what looked like a church and sort of reminded me of a Christian church service. The other took place in a very unique brutalist cement building and was essentially a community meeting with some songs and a short talk about some specific way to act decently.",
                                  "timestamp": "2022-07-23 01:38:33",
                                  "score": 18,
                                  "num_children": 2,
                                  "author": 40981,
                                  "replies": [
                                    {
                                      "id": "ihagajx",
                                      "text": "My sister, who is Unitarian, had some friends in her church who were Jews. They were light-heartedly referred to as \"Jewnitarians.\"",
                                      "timestamp": "2022-07-23 05:42:41",
                                      "score": 3,
                                      "num_children": 0,
                                      "author": 75505,
                                      "replies": []
                                    },
                                    {
                                      "id": "ihbxtmi",
                                      "text": "The idea of \"some kind of God concept\" is actually not in total opposition to atheism.  \"God\" could just be another word for the entirety of everything coupled with a general reverence for the universe we are part of.  Pantheism is really just a more poetic or pseudo-spiritual version of atheism.",
                                      "timestamp": "2022-07-23 15:20:18",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 60556,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "ih9s5sv",
                                  "text": "So, agnostic then? \n\nI know nothing of Unitarians, but this sounds agnostic.",
                                  "timestamp": "2022-07-23 02:03:15",
                                  "score": 3,
                                  "num_children": 1,
                                  "author": 231168,
                                  "replies": [
                                    {
                                      "id": "iha77m3",
                                      "text": "The Agnostic church is where we send our money to a folk singer who tells us he can talk to god, but we all know he's full of shit. And he's got our money.",
                                      "timestamp": "2022-07-23 04:10:57",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 294648,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "iht6lzy",
                              "text": "I wonder if there are any progressive missionary outposts in those baptist/evangelical areas? It might be easier to \"switch church\" to UU or Episcopalian and remain \"christian\" than to come out as an atheist in some areas? \n\nOr is that seen as equally bad by those people? Sorry for my ignorance, but having such religious extremism in your society is completely alien to me.",
                              "timestamp": "2022-07-27 04:08:35",
                              "score": 2,
                              "num_children": 1,
                              "author": 48632,
                              "replies": [
                                {
                                  "id": "ihtk673",
                                  "text": "Do you have a moment to talk about our slightly less nutters lord and savior?\n\nSeriously, though, I think the community of the church can be very important to a lot of people so an alternative that keeps that going might work.",
                                  "timestamp": "2022-07-27 06:32:30",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 92043,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ih8u773",
                          "text": "Yeah I include people like that church when I say progressives. \n\nIn the fight against fascism I don't discriminate against anyone who's willing to help against it, even if they're theists.",
                          "timestamp": "2022-07-22 21:46:52",
                          "score": 17,
                          "num_children": 0,
                          "author": 283761,
                          "replies": []
                        },
                        {
                          "id": "ihc0ez0",
                          "text": "> they are progressive as fuuuuuuuck but they're not very common.\n\nThat's because there is no money in progressiveism.  Its absurd how much reactionary religion is just cover for greed.  Our current problems were kicked off by fatcats funding anti-New Deal preachers.  Their backing is how Billy Graham rose to prominence.",
                          "timestamp": "2022-07-23 15:39:11",
                          "score": 1,
                          "num_children": 0,
                          "author": 70746,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ih8kg8d",
                  "text": "Hey! I resemble that remark.",
                  "timestamp": "2022-07-22 20:42:19",
                  "score": 12,
                  "num_children": 1,
                  "author": 89720,
                  "replies": [
                    {
                      "id": "ih8udbp",
                      "text": "Lol like it or not, us Atheists are freaks in the eyes of many theists and conservatives",
                      "timestamp": "2022-07-22 21:48:00",
                      "score": 9,
                      "num_children": 0,
                      "author": 283761,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iha8j94",
                  "text": "Not me",
                  "timestamp": "2022-07-23 04:23:26",
                  "score": -1,
                  "num_children": 0,
                  "author": 190910,
                  "replies": []
                },
                {
                  "id": "ihae7qc",
                  "text": "Not entirely, some became incels",
                  "timestamp": "2022-07-23 05:20:18",
                  "score": -1,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "ih9elnh",
                  "text": "Tis what we have become.",
                  "timestamp": "2022-07-23 00:16:53",
                  "score": 0,
                  "num_children": 0,
                  "author": 5681,
                  "replies": []
                },
                {
                  "id": "ih9ie9d",
                  "text": "Present 🙋‍♂️",
                  "timestamp": "2022-07-23 00:46:25",
                  "score": 0,
                  "num_children": 0,
                  "author": 371731,
                  "replies": []
                },
                {
                  "id": "ih9vvsn",
                  "text": "Ehhhhhh I know atheist Republicans.",
                  "timestamp": "2022-07-23 02:33:12",
                  "score": 0,
                  "num_children": 1,
                  "author": 114502,
                  "replies": [
                    {
                      "id": "ihalrrn",
                      "text": "I mean all republican politicians are really atheist otherwise they wouldn’t be going directly against everything they are told is the right thing to do in the Bible. \n\nWhat floors me is how f$&king clueless people that vote for these truly evil (every definition fits to use that word) greedy, soul sucking pigs. And don’t even get me started about how involved the churches are in turning our government into a fascist theocracy.",
                      "timestamp": "2022-07-23 06:46:52",
                      "score": 2,
                      "num_children": 0,
                      "author": 229469,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ih90x97",
              "text": "It's literally illegal to be in public office as an atheist where I live soooo.....",
              "timestamp": "2022-07-22 22:34:03",
              "score": 25,
              "num_children": 5,
              "author": 172308,
              "replies": [
                {
                  "id": "ih95va3",
                  "text": "“No religious Test shall ever be required as a Qualification to any Office or public Trust under the United States\"\n\nU.S. Constitution, Article VI\n\nRun for office anyway.",
                  "timestamp": "2022-07-22 23:10:05",
                  "score": 47,
                  "num_children": 1,
                  "author": 168621,
                  "replies": [
                    {
                      "id": "ih962aj",
                      "text": "Constitution is just another piece of paper the American Taliban wipes their asses with now that they control SCOTUS.",
                      "timestamp": "2022-07-22 23:11:31",
                      "score": 54,
                      "num_children": 0,
                      "author": 172308,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ih9a30d",
                  "text": "Where is this?",
                  "timestamp": "2022-07-22 23:41:42",
                  "score": 4,
                  "num_children": 1,
                  "author": 61329,
                  "replies": [
                    {
                      "id": "ih9bny6",
                      "text": "8 states in the confederate south.  Illegal laws, but still on the books.\n\nAnd considering this SC... probably not illegal for long.",
                      "timestamp": "2022-07-22 23:54:00",
                      "score": 11,
                      "num_children": 1,
                      "author": 81898,
                      "replies": [
                        {
                          "id": "ihas7j2",
                          "text": "Arkansas, Maryland, Mississippi, North Carolina, Pennsylvania, South Carolina, Tennessee and Texas\n\nMaryland and Pennsylvania are not typically considered Confederate South",
                          "timestamp": "2022-07-23 08:09:25",
                          "score": 6,
                          "num_children": 0,
                          "author": 347780,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ih9oba2",
                  "text": "If you are talking about USA then the law that prevents you from running is null qnd void. I live in NC where it's legitimately in the state constitution. I could still run legally as an atheist due to the fact that freedom of religion is also freedom From religion and renders that particular article null and void",
                  "timestamp": "2022-07-23 01:32:51",
                  "score": 3,
                  "num_children": 1,
                  "author": 132962,
                  "replies": [
                    {
                      "id": "ih9r8zx",
                      "text": "Constitution also protects the right to privacy, SCOTUS doesn't give a fuck. To actually run I would have to run, the be barred from running, then field months or years of legal battles,etc.  So to run as an atheist, you need a war chest to run your campaign and then a warchest to fight the legal battle. You're DOA.",
                      "timestamp": "2022-07-23 01:56:06",
                      "score": 1,
                      "num_children": 2,
                      "author": 172308,
                      "replies": [
                        {
                          "id": "ihbhoxb",
                          "text": "It would at least be hard for SCOTUS to claim the Constitution doesn't say anything about religion like they do for privacy.\n\nOf course they could just say \"the founding fathers meant christianity because they were christians\".\n\nSCOTUS isn't in the business of actually interpreting the law. They're legislating a christian theocracy.",
                          "timestamp": "2022-07-23 13:13:22",
                          "score": 4,
                          "num_children": 0,
                          "author": 343879,
                          "replies": []
                        },
                        {
                          "id": "ihal3ub",
                          "text": "No I'm saying that if the basis is religious there is already tried and true doctrine in place where they can't even test you for being religious or not. The battle is over and it's solidly settled law and precedent",
                          "timestamp": "2022-07-23 06:38:49",
                          "score": 1,
                          "num_children": 0,
                          "author": 132962,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ihccmmc",
                  "text": "So, you need to take the office to court to force them to eliminate that mandatory theist demand.   I would never use a bible to make any vow.  Demand your right to be atheist.  And get into office and make bank!  Hopefully help some people while at it!  Anonymous\\_Otters for President?",
                  "timestamp": "2022-07-23 17:06:08",
                  "score": 1,
                  "num_children": 0,
                  "author": 347901,
                  "replies": []
                },
                {
                  "id": "ihfgexl",
                  "text": "It's actually not, all such local and state laws have been declared unconstitutional.  So it may be written down in a local law, but it cannot be legally enforced.\n\nhttps://en.wikipedia.org/wiki/Torcaso_v._Watkins",
                  "timestamp": "2022-07-24 09:18:32",
                  "score": 0,
                  "num_children": 0,
                  "author": 401220,
                  "replies": []
                }
              ]
            },
            {
              "id": "ihbhfol",
              "text": "Problem is that this requires courts that behave in good faith.\n\nSCOTUS is a christian theocratic organization, so they'd have no issues with banning all religious attire except Jesus shit.",
              "timestamp": "2022-07-23 13:11:02",
              "score": 3,
              "num_children": 0,
              "author": 343879,
              "replies": []
            },
            {
              "id": "ih9vmda",
              "text": "Present!",
              "timestamp": "2022-07-23 02:31:05",
              "score": 2,
              "num_children": 0,
              "author": 124945,
              "replies": []
            },
            {
              "id": "iha7hts",
              "text": "It’s the same picture.",
              "timestamp": "2022-07-23 04:13:38",
              "score": 2,
              "num_children": 0,
              "author": 203944,
              "replies": []
            },
            {
              "id": "ihb0rzj",
              "text": "The weird kids run a full spectrum of identity and belief. There are a bunch that won’t agree with us on the surface but could happily, productively co-govern with us if we stop treating politics as a competitive, zero-sum game.",
              "timestamp": "2022-07-23 10:06:51",
              "score": 1,
              "num_children": 0,
              "author": 182412,
              "replies": []
            },
            {
              "id": "ihbc4dr",
              "text": "Hi freak stoner atheist here 💅🏽",
              "timestamp": "2022-07-23 12:20:45",
              "score": 1,
              "num_children": 0,
              "author": 338956,
              "replies": []
            }
          ]
        },
        {
          "id": "ih893qx",
          "text": "When I was in high school, I was one of the religious freaks. Me and my friends met every day before school and held a prayer all together before school started. It was in a common area, so very much seen by all the other kids. A group of satanists/pagans/atheists started holding “coven meetings” in the same area at the same time, and after the second day they were told by school admin they needed to stop. When I found out, I was livid. I waited for almost an hour to talk to the vice principal about how unfair it was. “If we can pray, so can they” was the gist of what I said. He called some of the kids from the other group in and told them that I’d advocated on their behalf and they could resume their morning meetings. I told them I believed in separation of church and state, and their rights were more important than my personal thoughts about their beliefs. Whenever I went back to visit my hometown, I’d run into one or two of those folks and they remembered that moment. The Christian friends I had? They were annoyed with me at first and reacted poorly, which was the beginning of my slide away from faith. I haven’t spoken to any of the Christian group in over twenty years. Fucking hypocrites.",
          "timestamp": "2022-07-22 19:27:41",
          "score": 211,
          "num_children": 2,
          "author": 1634,
          "replies": [
            {
              "id": "ih96ksg",
              "text": "You're a badass. I wish more Christians were like you.",
              "timestamp": "2022-07-22 23:15:19",
              "score": 59,
              "num_children": 3,
              "author": 397737,
              "replies": [
                {
                  "id": "ih9djiu",
                  "text": "That was a long time ago, I hope I can live up to that badassery again someday. Thank you, and happy cake day!",
                  "timestamp": "2022-07-23 00:08:34",
                  "score": 11,
                  "num_children": 1,
                  "author": 1634,
                  "replies": [
                    {
                      "id": "ih9xoov",
                      "text": "Woah! You're the first person to ever wish me cake day! Thanks!",
                      "timestamp": "2022-07-23 02:47:54",
                      "score": 8,
                      "num_children": 0,
                      "author": 397737,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ih977b6",
                  "text": "If they were, there would be a lot fewer atheists, I think. I wonder if the zealots know how many turn away from their naked hypocrisy.",
                  "timestamp": "2022-07-22 23:19:57",
                  "score": 46,
                  "num_children": 5,
                  "author": 124167,
                  "replies": [
                    {
                      "id": "ih9mih3",
                      "text": "I'd get kicked out of religion classes for \"asking too many questions\" and it was \"testing other kid's faith\". I'd sit alone in the hall for an hour while the classes were going on and think about it all. Why they never wanted me to ask questions or answer them. Religion classes are literally the reason I'm an atheist. Oh, and they wouldn't let my sister finish her confirmation classes because she was goth. That's when my mom finally told me I didn't have to go to religion classes anymore. Good ol' Louisiana catholics. Biggest hypocrites ever.",
                      "timestamp": "2022-07-23 01:18:46",
                      "score": 49,
                      "num_children": 1,
                      "author": 332241,
                      "replies": [
                        {
                          "id": "ih9msvb",
                          "text": "When a state calls their counties *parishes* it's possible they're a little into the god stuff, yeah.",
                          "timestamp": "2022-07-23 01:20:59",
                          "score": 19,
                          "num_children": 2,
                          "author": 124167,
                          "replies": [
                            {
                              "id": "ih9o9og",
                              "text": "Yup. I hate it here. Can't wait to get out. I'm really glad my mom stopped forcing the religion thing after what they did to my sister, though. They always treated us differently because we were poor. They even shamed my mom from not giving money on Sundays. A catholic church that has millions of dollars in their accounts. While my mom and dad were barely scraping enough money together to feed us.",
                              "timestamp": "2022-07-23 01:32:31",
                              "score": 14,
                              "num_children": 0,
                              "author": 332241,
                              "replies": []
                            },
                            {
                              "id": "iha2ogl",
                              "text": "Damn, I never thought of it that way?  Makes sense to me though.",
                              "timestamp": "2022-07-23 03:30:14",
                              "score": 4,
                              "num_children": 0,
                              "author": 346794,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ih990il",
                      "text": "People say viruses sometimes mutate to be less deadly, because if they kill their hosts too quickly, they won't have time to spread.\n\nI bet memes are like that. Religions will be forced to moderate if global society continues to liberalize. There are always some die-hards who are all-or-nothing fundamentalists, but religion the meta-being would always rather evolve than go extinct.\n\nThe Satanic Temple is already a saner, leftier branch of Satanism than Church of Satan was.",
                      "timestamp": "2022-07-22 23:33:34",
                      "score": 8,
                      "num_children": 2,
                      "author": 55006,
                      "replies": [
                        {
                          "id": "ih9a7cm",
                          "text": "I believe it's more of a survivorship bias thing actually - as less-devout people peel off from radicalizing congregations, they become more radical by default, since the only people who stay are more radical than the people who leave. But then the \"moderates\" are suddenly a little too left of the congregation's median and begin to feel uncomfortable .... \n\nThere are some that avoid this sort of radicalization spiral but most Christian denominations find it hard to turn away from the unbridled zeal and energy that the Remainders bring to their organizations. The most hardcore/zealous of their flock tend to be the ones they can't do without, since they're running Sunday school, organizing choirs, and running the food banks as their Mission from God. The pastors and priests sure as shit aren't.",
                          "timestamp": "2022-07-22 23:42:38",
                          "score": 9,
                          "num_children": 0,
                          "author": 124167,
                          "replies": []
                        },
                        {
                          "id": "iha30db",
                          "text": "As a member of the satanic temple myself,  I have to agree completely.",
                          "timestamp": "2022-07-23 03:33:08",
                          "score": 1,
                          "num_children": 0,
                          "author": 346794,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iha4v3h",
                      "text": "That is assuming that atheists are only atheists out of spite for the religious. I don't believe in god because it's a stupid thing to believe. I would still think being religious is stupid and bordering on mental illness even if the Christians were nice and stayed in their lane.",
                      "timestamp": "2022-07-23 03:49:31",
                      "score": 17,
                      "num_children": 1,
                      "author": 34506,
                      "replies": [
                        {
                          "id": "ihacb46",
                          "text": "A fair point - I would say it's that extremist beliefs prompt one to reconsider your beliefs as a habit, and that tends to lead one away from organized religion rather quickly.",
                          "timestamp": "2022-07-23 05:00:33",
                          "score": 7,
                          "num_children": 0,
                          "author": 124167,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iha4c3l",
                      "text": "What? You think people are atheist just because Christians suck?",
                      "timestamp": "2022-07-23 03:44:49",
                      "score": 6,
                      "num_children": 2,
                      "author": 44135,
                      "replies": [
                        {
                          "id": "ihb58qn",
                          "text": "It's more that realizing how much other Christians suck is often a catalyst for Christians to reexamine their own beliefs. It's not the reason I'm an atheist today, but it definitely sped up the process.",
                          "timestamp": "2022-07-23 11:04:35",
                          "score": 2,
                          "num_children": 0,
                          "author": 77857,
                          "replies": []
                        },
                        {
                          "id": "ihacgec",
                          "text": "Some are, yeah. The suckage makes them give up on the whole thing. \n\nPlenty of atheists who get there through different routes (I imagine many ex-Muslims have a rather different view of Christianity) but it's not zero, either.",
                          "timestamp": "2022-07-23 05:02:01",
                          "score": 1,
                          "num_children": 1,
                          "author": 124167,
                          "replies": [
                            {
                              "id": "ihb1u5d",
                              "text": "I'd say very few. Even if other Christians suck, if you think God is the only thing going to save you you'll stay in the religion.",
                              "timestamp": "2022-07-23 10:21:08",
                              "score": 0,
                              "num_children": 0,
                              "author": 44135,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ihbm040",
                      "text": ">If they were, there would be a lot fewer atheists,\n\nGood actions by people of a religion doesnt change the fact atheists dont believe in god. So no, there wouldnt be \"a lot fewer atheists\"",
                      "timestamp": "2022-07-23 13:50:17",
                      "score": 1,
                      "num_children": 0,
                      "author": 245647,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iha8pwr",
                  "text": "I think most good Christians eventually turn into atheists or take a more general spirituality approach, after they can no longer continue to make excuses about how hateful their ideology is.",
                  "timestamp": "2022-07-23 04:25:13",
                  "score": 6,
                  "num_children": 0,
                  "author": 196495,
                  "replies": []
                }
              ]
            },
            {
              "id": "ihap8vw",
              "text": "Legendary.",
              "timestamp": "2022-07-23 07:30:41",
              "score": 1,
              "num_children": 0,
              "author": 124036,
              "replies": []
            }
          ]
        },
        {
          "id": "ih8htmp",
          "text": "I bet the Christians then cried religious persecution.",
          "timestamp": "2022-07-22 20:25:11",
          "score": 21,
          "num_children": 1,
          "author": 219148,
          "replies": [
            {
              "id": "ih96jq3",
              "text": "That’s what Christians do best.",
              "timestamp": "2022-07-22 23:15:06",
              "score": 15,
              "num_children": 1,
              "author": 393716,
              "replies": [
                {
                  "id": "iha7xib",
                  "text": "If they can’t find any, they just make it up.\n\n“There is a war on CHRISTMAS!”\n\n“Umm..no there isn’t and never has been. What are you on about”",
                  "timestamp": "2022-07-23 04:17:47",
                  "score": 2,
                  "num_children": 0,
                  "author": 84742,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ih8yli5",
          "text": "Satanists don't worship Satan. They're just trying to get sky daddy shirts banned. This is a W, even though it's a L for Marilyn Manson.",
          "timestamp": "2022-07-22 22:17:29",
          "score": 18,
          "num_children": 2,
          "author": 207216,
          "replies": [
            {
              "id": "ih9f08t",
              "text": "What do you call someone who believes in Satan?\nChristian.",
              "timestamp": "2022-07-23 00:20:05",
              "score": 25,
              "num_children": 1,
              "author": 57004,
              "replies": [
                {
                  "id": "ihbz6lv",
                  "text": "Truth.",
                  "timestamp": "2022-07-23 15:30:13",
                  "score": 1,
                  "num_children": 0,
                  "author": 274281,
                  "replies": []
                }
              ]
            },
            {
              "id": "ihahy9s",
              "text": "I still bought the shirts. What do you think was my undershirt? As soon as I was off campus I'd rip my schoolshirt off to aim my 'Satanic' shirt at the cross. That habit lasted 3 weeks b/c a certain someone narcd on me b/c their mom found a Rancid shirt. It's not even the same thing!!!",
              "timestamp": "2022-07-23 06:01:24",
              "score": 1,
              "num_children": 0,
              "author": 66072,
              "replies": []
            }
          ]
        },
        {
          "id": "ih7zwnm",
          "text": "After watching Stranger Things I realized that I missed out on a lot by ignoring the weird kids. Now I have a weird kid and she’s going to burn down the patriarchy if it’s the last thing she does.",
          "timestamp": "2022-07-22 18:27:28",
          "score": 78,
          "num_children": 2,
          "author": 236643,
          "replies": [
            {
              "id": "ihamm13",
              "text": "You had the chance to get with a girl that has telekinetic abilities and you blew it.",
              "timestamp": "2022-07-23 06:57:13",
              "score": 3,
              "num_children": 1,
              "author": 390756,
              "replies": [
                {
                  "id": "ihanxqi",
                  "text": "Clearly!!",
                  "timestamp": "2022-07-23 07:13:41",
                  "score": 1,
                  "num_children": 0,
                  "author": 236643,
                  "replies": []
                }
              ]
            },
            {
              "id": "ih8x8ab",
              "text": "Just as long as she doesn't burn down the school.\n\nI guess maybe just wait until she learns about metaphors before doing anything drastic. (Not sure how old she is...)",
              "timestamp": "2022-07-22 22:07:45",
              "score": 3,
              "num_children": 1,
              "author": 278722,
              "replies": [
                {
                  "id": "iha2rqq",
                  "text": "She’s 12; she gets it.",
                  "timestamp": "2022-07-23 03:31:02",
                  "score": 2,
                  "num_children": 0,
                  "author": 236643,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ih96l45",
          "text": "Not a religious thing but we had a stupid club at our school called SADD club. It stood for Students Against Destructive Decisions and for some reason they were in charge of the talent show.\n\nEvery year they'd try to stop my friends and I from playing any Metal music because 'it was angry', mind you this was a student run club and not a teacher on a power trip. We gave them lyrics and none of our songs we wanted to cover talked about drugs or booze. The first year we let the girl in charge censor parts of Painkiller by Judas Priest...she didn't like the word killer. We eventually all had to talk to the principal about it and thankfully he was on our side. After that we played heavier and heavier songs until our senior year we almost had 4 different bands of mostly the same people. I played a song by The Faceless and the one by Chimaira",
          "timestamp": "2022-07-22 23:15:23",
          "score": 11,
          "num_children": 0,
          "author": 89256,
          "replies": []
        },
        {
          "id": "ih7y0tb",
          "text": "Sounds like the weird kids forced a draw.",
          "timestamp": "2022-07-22 18:15:21",
          "score": 72,
          "num_children": 6,
          "author": 59942,
          "replies": [
            {
              "id": "ih804ap",
              "text": "Better than the alternative of religious oppression.",
              "timestamp": "2022-07-22 18:28:53",
              "score": 67,
              "num_children": 1,
              "author": 253406,
              "replies": [
                {
                  "id": "ih808ya",
                  "text": "Indeed.\n\nI'll take a weird kid over a glassy-eyed religious zealot any day of the week.",
                  "timestamp": "2022-07-22 18:29:43",
                  "score": 34,
                  "num_children": 0,
                  "author": 59942,
                  "replies": []
                }
              ]
            },
            {
              "id": "ih8328p",
              "text": "I don't know - forcing the god-boys to hide their stuff so others wouldn't have to look at it anymore sounds more satisfying.",
              "timestamp": "2022-07-22 18:48:08",
              "score": 19,
              "num_children": 0,
              "author": 189674,
              "replies": []
            },
            {
              "id": "ih86pju",
              "text": "Sometimes a draw is a win. Like in Rocky.",
              "timestamp": "2022-07-22 19:12:01",
              "score": 9,
              "num_children": 0,
              "author": 133464,
              "replies": []
            },
            {
              "id": "ih96pqm",
              "text": "The general response to challenges of that sort is \"Well if we have to share then we're taking our ball and going home. If we can't be the only ones having fun then no one can!\"",
              "timestamp": "2022-07-22 23:16:20",
              "score": 3,
              "num_children": 0,
              "author": 325866,
              "replies": []
            },
            {
              "id": "ihbz9fd",
              "text": "A forced draw from the underdog is win.",
              "timestamp": "2022-07-23 15:30:48",
              "score": 2,
              "num_children": 0,
              "author": 274281,
              "replies": []
            },
            {
              "id": "ih8hffa",
              "text": "Not really a draw because nobody is really a Satanist.  Satanism and the Church of Satan  really only serve as a weapon against policies that seek to use the false equality of our \"religious freedom\"  as an excuse to violate the Establishment Clause of the US Constitution.  So when they say \"Oh, its ok that we have a pastor giving prayers in school because people of any faith are free to come and give a prayer!\", the Satanists are just Atheists that show up to expose the hypocrisy and fight against the sneaking creep of theocracy.",
              "timestamp": "2022-07-22 20:22:37",
              "score": 6,
              "num_children": 3,
              "author": 23635,
              "replies": [
                {
                  "id": "ih8rb53",
                  "text": "You're ignoring theistic Satanists, such as Temple of Set (a Church of Satan offshoot) and the Luciferians. It's totally possible to be a theistic Satanist. I may be wrong, but I -think- Temple of the Vampire is also Satanic.",
                  "timestamp": "2022-07-22 21:27:10",
                  "score": 8,
                  "num_children": 1,
                  "author": 66004,
                  "replies": [
                    {
                      "id": "ih8wim4",
                      "text": "They're also ignoring atheistic Satanists for whom Satanism is a religious identity.",
                      "timestamp": "2022-07-22 22:02:45",
                      "score": 7,
                      "num_children": 0,
                      "author": 345655,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ih8wepn",
                  "text": "Hi, I'm one of the Satanists who you say doesn't exist.",
                  "timestamp": "2022-07-22 22:02:00",
                  "score": 9,
                  "num_children": 0,
                  "author": 345655,
                  "replies": []
                },
                {
                  "id": "ih8lkw3",
                  "text": "TST's Satanism is a nontheistic religion - yes, they're atheists, but they take the symbol of Satan very seriously as a representation of genuinely deeply held beliefs in bodily autonomy, intellectual freedom, etc.  They have a ritual structure (seen as community-building theatre and therapy rather than as literal supernaturalism), a set of tenets, a body of art and literature etc.  \n\nIf they were a bunch of atheists \\*pretending\\* to be a religion they'd be laughed out of court as fast as the Flying Spaghetti Monster.",
                  "timestamp": "2022-07-22 20:49:39",
                  "score": 20,
                  "num_children": 0,
                  "author": 259560,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ih9h8gb",
          "text": "I was gonna upvote but this comment is at 666 and that seems appropriate :]",
          "timestamp": "2022-07-23 00:37:27",
          "score": 6,
          "num_children": 0,
          "author": 305522,
          "replies": []
        },
        {
          "id": "ih8hi2w",
          "text": "This story made me happy.",
          "timestamp": "2022-07-22 20:23:07",
          "score": 4,
          "num_children": 1,
          "author": 230200,
          "replies": [
            {
              "id": "ihuhcpj",
              "text": "why that's horrible",
              "timestamp": "2022-07-27 12:58:54",
              "score": 0,
              "num_children": 1,
              "author": 314008,
              "replies": [
                {
                  "id": "ihv94de",
                  "text": "So you think that you should be able to wear one religious garb but not another?",
                  "timestamp": "2022-07-27 16:09:15",
                  "score": 1,
                  "num_children": 0,
                  "author": 230200,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ih8rj0u",
          "text": "That’s the whole point of separating church and state. It is the logical correct answer.",
          "timestamp": "2022-07-22 21:28:41",
          "score": 4,
          "num_children": 0,
          "author": 274046,
          "replies": []
        },
        {
          "id": "ih9pg7y",
          "text": "This needs to be a movie",
          "timestamp": "2022-07-23 01:41:48",
          "score": 2,
          "num_children": 0,
          "author": 410653,
          "replies": []
        },
        {
          "id": "ih9vxyc",
          "text": "In 1997, I did that for my High School.\nThere was a prayer group every morning out near the flag… I asked the office where I could hold my satanic prayers…. \n\nAll prayers were stopped. Lol",
          "timestamp": "2022-07-23 02:33:40",
          "score": 2,
          "num_children": 0,
          "author": 311006,
          "replies": []
        },
        {
          "id": "ih9wopf",
          "text": "It would have been funnier if you got a shirt of Jesus being tortured to death on the cross in graphic detail like a death metal band album art out of protest.",
          "timestamp": "2022-07-23 02:39:44",
          "score": 2,
          "num_children": 0,
          "author": 380485,
          "replies": []
        },
        {
          "id": "iha1djn",
          "text": "I'm sure you have a million responses like this already but that's exactly the point of the church of Satan. To contradict dumb religious laws the country over. Well done you and your pals cos that religious nonsense shouldn't ever fly in a state school.",
          "timestamp": "2022-07-23 03:18:55",
          "score": 2,
          "num_children": 0,
          "author": 244229,
          "replies": []
        },
        {
          "id": "iha1hl9",
          "text": "It’s a beautiful day when the weird kids get a victory especially in a world that values normalcy above all else",
          "timestamp": "2022-07-23 03:19:53",
          "score": 2,
          "num_children": 0,
          "author": 69421,
          "replies": []
        },
        {
          "id": "ihacwzi",
          "text": "As someone not from the US it blows my mind people actually buy and wear shirts with Jesus on them",
          "timestamp": "2022-07-23 05:06:41",
          "score": 2,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ihajb9t",
          "text": "Reminded me of the time in hs when the stoners beat the jocks at basketball during lunch and my buddy ran around yelling ‘The stoners beat the jocks!!’. Fuckin’ 90s, man.",
          "timestamp": "2022-07-23 06:17:15",
          "score": 2,
          "num_children": 0,
          "author": 352904,
          "replies": []
        },
        {
          "id": "ihap0l2",
          "text": "That’s the way it should be.",
          "timestamp": "2022-07-23 07:27:38",
          "score": 2,
          "num_children": 0,
          "author": 146698,
          "replies": []
        },
        {
          "id": "ihb7e9a",
          "text": "Overall the weird kids usually win, the popular jocks join the local police force and beat the shit out of their families",
          "timestamp": "2022-07-23 11:30:16",
          "score": 2,
          "num_children": 0,
          "author": 85134,
          "replies": []
        },
        {
          "id": "ihb86s6",
          "text": "That's awesome, fuck I wish we would come together and eliminate religion all together.",
          "timestamp": "2022-07-23 11:39:18",
          "score": 2,
          "num_children": 0,
          "author": 358502,
          "replies": []
        },
        {
          "id": "ihbc0cp",
          "text": "That's an acceptable outcome. Maybe even preferred depending on your viewpoint.",
          "timestamp": "2022-07-23 12:19:40",
          "score": 2,
          "num_children": 0,
          "author": 216152,
          "replies": []
        },
        {
          "id": "ih8nl5d",
          "text": " \nIt was baphomet, not Satan",
          "timestamp": "2022-07-22 21:02:39",
          "score": 2,
          "num_children": 1,
          "author": 39250,
          "replies": [
            {
              "id": "ih94txs",
              "text": "You're right it was baphomet. The school administration couldn't tell the difference. They saw Satan everywhere.",
              "timestamp": "2022-07-22 23:02:23",
              "score": 2,
              "num_children": 1,
              "author": 406630,
              "replies": [
                {
                  "id": "ih96txc",
                  "text": "That's how I learned about baphomet. It did have tiddies and a dick tho lol. This girl ratted me out about another Manson shirt that had the word fuck on it. Worst part is it was her shirt I was wearing.",
                  "timestamp": "2022-07-22 23:17:11",
                  "score": 3,
                  "num_children": 0,
                  "author": 39250,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ih8r005",
          "text": "I think that's what they were probably going for.",
          "timestamp": "2022-07-22 21:25:05",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ih99vzt",
          "text": "I had a patch on my backpack when I was a teen for the band Alkaline Trio. Their first album was called Goddamnit, so that's what the patch said. A teacher called me out and I felt it was ridiculous. I covered the Goddamnit part with tape that said \"Jesus Loves You\", because everyone knew that wasn't what the patch said, but apparently it is totally acceptable in a public school.",
          "timestamp": "2022-07-22 23:40:15",
          "score": 1,
          "num_children": 0,
          "author": 339785,
          "replies": []
        },
        {
          "id": "ih9gw12",
          "text": "Sky daddy lol",
          "timestamp": "2022-07-23 00:34:47",
          "score": 1,
          "num_children": 0,
          "author": 89736,
          "replies": []
        },
        {
          "id": "ihalgmv",
          "text": "I hate this “solution”. They can’t tolerate “others” so they pretend to tolerate none. It’s weak minded bullshit.",
          "timestamp": "2022-07-23 06:43:07",
          "score": 1,
          "num_children": 0,
          "author": 83753,
          "replies": []
        },
        {
          "id": "ihbkqio",
          "text": "That's the best outcome",
          "timestamp": "2022-07-23 13:39:43",
          "score": 1,
          "num_children": 0,
          "author": 20494,
          "replies": []
        },
        {
          "id": "ihdaorf",
          "text": "Wait, but the religious kids didn't win, though.",
          "timestamp": "2022-07-23 21:13:27",
          "score": 1,
          "num_children": 0,
          "author": 15037,
          "replies": []
        },
        {
          "id": "ih9isot",
          "text": "Do you want school uniforms?  Cause this is how you get school uniforms.\n\nNot that there's anything wrong with school uniforms.",
          "timestamp": "2022-07-23 00:49:29",
          "score": -2,
          "num_children": 0,
          "author": 349079,
          "replies": []
        },
        {
          "id": "ih98fw3",
          "text": "The weird kids didn'r win. They got their skydad shirts taken away",
          "timestamp": "2022-07-22 23:29:19",
          "score": -1,
          "num_children": 0,
          "author": 125000,
          "replies": []
        },
        {
          "id": "iit4gba",
          "text": "Manson is a punk ass bitch though so there’s that.",
          "timestamp": "2022-08-03 17:38:26",
          "score": 0,
          "num_children": 0,
          "author": 379566,
          "replies": []
        }
      ]
    },
    {
      "id": "ih7si5u",
      "text": "Just waiting for USSC to rule on “legitimate” and “illegitimate” religions.",
      "timestamp": "2022-07-22 17:39:32",
      "score": 397,
      "num_children": 5,
      "author": 296471,
      "replies": [
        {
          "id": "ih7ubn6",
          "text": "Good thing the Bible clearly recognizes Satan. Can't deny his existence and still revel in your sky buddy.",
          "timestamp": "2022-07-22 17:51:15",
          "score": 242,
          "num_children": 3,
          "author": 338854,
          "replies": [
            {
              "id": "ih8h2ps",
              "text": "Sure you can, most Christians do exactly that.",
              "timestamp": "2022-07-22 20:20:21",
              "score": 38,
              "num_children": 2,
              "author": 272324,
              "replies": [
                {
                  "id": "ih917zz",
                  "text": "...who are these \"most Christians\" who deny the existence of Satan?",
                  "timestamp": "2022-07-22 22:36:12",
                  "score": 26,
                  "num_children": 1,
                  "author": 172308,
                  "replies": [
                    {
                      "id": "ih93191",
                      "text": "They deny his existence when it's beneficial to them. Otherwise satan is only a threat to bad people which in their minds, they're far from.",
                      "timestamp": "2022-07-22 22:49:17",
                      "score": 12,
                      "num_children": 1,
                      "author": 272324,
                      "replies": [
                        {
                          "id": "ih94f1i",
                          "text": "Who?  What are you talking about? I've never seen a Christian literally deny the existence of Satan... it's a fundamental Christian belief. Lot you can trash about Christians, but this is a bizarre and inaccurate allegation.",
                          "timestamp": "2022-07-22 22:59:24",
                          "score": 17,
                          "num_children": 3,
                          "author": 172308,
                          "replies": [
                            {
                              "id": "ih9a5rt",
                              "text": "I grew up catholic and went to catholic school up until high school. My parents work for a church. I've been around plenty of Christians. It's not that they deny satan outright, but sure as fuck don't think about satan. It's more willful ignorance.\n\nEdit: it's okay to not understand this lol, if you replied to me at all trying to argue that's incredibly pathetic 😂",
                              "timestamp": "2022-07-22 23:42:17",
                              "score": -16,
                              "num_children": 5,
                              "author": 272324,
                              "replies": [
                                {
                                  "id": "ih9rk3z",
                                  "text": "You're just refusing to acknowledge reality and twisting logic to confirm your objectively false belief. You know, like religious people do.",
                                  "timestamp": "2022-07-23 01:58:34",
                                  "score": 10,
                                  "num_children": 1,
                                  "author": 172308,
                                  "replies": [
                                    {
                                      "id": "ihbss6q",
                                      "text": "Also argues his beliefs but then saying anyone who posts a counter argument is pathetic, like religious people demanding you just shut up, listen, and agree with everything they say.",
                                      "timestamp": "2022-07-23 14:43:20",
                                      "score": 4,
                                      "num_children": 0,
                                      "author": 376268,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "ih9ldpz",
                                  "text": "Ok, you completely went back on what you originally said. And, just so you're aware, they DEFINITELY talk about Satan. I was raised Christian until I became atheist, trust me, the devil is mentioned a LOT.\n\nAlso, it can be used as a major crutch for Christians too. This is the worst one - like a pastor raping a 10 year old and being like, \"oohhh yeah, the devil took over me, I couldn't do anything about it\".\n\nEdited: Clarity, although it could be written better, I just woke up...",
                                  "timestamp": "2022-07-23 01:09:50",
                                  "score": 7,
                                  "num_children": 0,
                                  "author": 1662,
                                  "replies": []
                                },
                                {
                                  "id": "ih9rp2i",
                                  "text": "Also, I was raised Catholic too, they're fucking obsessed with Satan and his influence.",
                                  "timestamp": "2022-07-23 01:59:38",
                                  "score": 8,
                                  "num_children": 0,
                                  "author": 172308,
                                  "replies": []
                                },
                                {
                                  "id": "ih9jzjz",
                                  "text": "[deleted]",
                                  "timestamp": "2022-07-23 00:58:52",
                                  "score": 15,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "ih9ljg3",
                                      "text": "\"THEY DENY HIS EXISTENCE!\"\n\n\"It's not that they deny him....\"",
                                      "timestamp": "2022-07-23 01:11:07",
                                      "score": 8,
                                      "num_children": 0,
                                      "author": 1662,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "ihbsjqt",
                                  "text": "You’ve already replied twice to this guy arguing and now you say if someone replies to you arguing it’s pathetic?\n\nThis has big elementary school tag “TIMES! TIMES! You can’t tag me I’m on times!” Energy",
                                  "timestamp": "2022-07-23 14:41:33",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 376268,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "ihdc4zo",
                              "text": "Lately, Christian churches, especially evangelical ones, have been preaching that basically everyone goes to heaven and that the devil doesn't have any real power. It's honestly a desperate play to retain numbers in their congregation since so many are leaving and they're having a hard time recruiting younger people.",
                              "timestamp": "2022-07-23 21:23:57",
                              "score": 1,
                              "num_children": 0,
                              "author": 15037,
                              "replies": []
                            },
                            {
                              "id": "ihbbray",
                              "text": "So my thought here is that he kind of became irrelevant to modern Christians. Originally when God was super benevolent he had to have an adversary who was the reason everything went bad. You could blow bad things on Satan, now that God himself is supposed to be feared rather than loved, based on what “God himself” says in his book. Now that God is scary there’s no need for a second scary entity so they kind of ignore him.",
                              "timestamp": "2022-07-23 12:17:09",
                              "score": 0,
                              "num_children": 0,
                              "author": 199695,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ih9nfbc",
                  "text": "I think you meant to say most Christian’s don’t think about the possibility of eternal damnation directed at themselves.",
                  "timestamp": "2022-07-23 01:25:52",
                  "score": 5,
                  "num_children": 0,
                  "author": 222781,
                  "replies": []
                }
              ]
            },
            {
              "id": "ihb8ldx",
              "text": "The Bible has a recipe for an abortion cocktail lol. They neither read nor understand their Bible.",
              "timestamp": "2022-07-23 11:43:46",
              "score": 1,
              "num_children": 0,
              "author": 413233,
              "replies": []
            },
            {
              "id": "ihbdolh",
              "text": "Take your fake news right out the door there before we stone you to death.",
              "timestamp": "2022-07-23 12:36:10",
              "score": 1,
              "num_children": 0,
              "author": 187620,
              "replies": []
            }
          ]
        },
        {
          "id": "ih7tatv",
          "text": "I feel like eventually they're going to rule that a religion must have a supernatural component. Goodbye 'problem secular people with strongly held beliefs.'\n\nEdit. Spelling",
          "timestamp": "2022-07-22 17:44:37",
          "score": 35,
          "num_children": 6,
          "author": 206771,
          "replies": [
            {
              "id": "ih809ax",
              "text": "That would be so bizarre. Your deeply held belief is only valid if the narrative is completely full of holes.",
              "timestamp": "2022-07-22 18:29:47",
              "score": 46,
              "num_children": 1,
              "author": 236643,
              "replies": [
                {
                  "id": "ih8cyh0",
                  "text": "Just replace Satanism with Pastafarianism and you’re good to go",
                  "timestamp": "2022-07-22 19:53:01",
                  "score": 30,
                  "num_children": 2,
                  "author": 352141,
                  "replies": [
                    {
                      "id": "ih90mci",
                      "text": "All hail his noodly appendages",
                      "timestamp": "2022-07-22 22:31:54",
                      "score": 13,
                      "num_children": 1,
                      "author": 76657,
                      "replies": [
                        {
                          "id": "ih91w49",
                          "text": "R'amen.",
                          "timestamp": "2022-07-22 22:41:01",
                          "score": 19,
                          "num_children": 0,
                          "author": 51978,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ih99xfe",
                      "text": "They're the second foundation :)",
                      "timestamp": "2022-07-22 23:40:33",
                      "score": 3,
                      "num_children": 0,
                      "author": 254853,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ih812af",
              "text": "I suppose the answer to that is “I’m a devout Christian who believes my faith should be kept out of schools, government, medical care, etc.” \n\nHow do you prove the veracity of a deeply held religious belief?",
              "timestamp": "2022-07-22 18:35:03",
              "score": 26,
              "num_children": 1,
              "author": 116159,
              "replies": [
                {
                  "id": "ih88yh4",
                  "text": "Easy, prove that the supernatural exists.  No wait... the other thing.  \"Impossible\"",
                  "timestamp": "2022-07-22 19:26:44",
                  "score": 2,
                  "num_children": 0,
                  "author": 298168,
                  "replies": []
                }
              ]
            },
            {
              "id": "ih88gyq",
              "text": "I think they'll just go with \"historical precedent\" again.",
              "timestamp": "2022-07-22 19:23:33",
              "score": 8,
              "num_children": 1,
              "author": 401337,
              "replies": [
                {
                  "id": "ih9fjjk",
                  "text": "At this point, it seems they are just ruling based on their personal beliefs and not too concerned with precedents anymore..",
                  "timestamp": "2022-07-23 00:24:14",
                  "score": 9,
                  "num_children": 0,
                  "author": 40993,
                  "replies": []
                }
              ]
            },
            {
              "id": "ih8lg79",
              "text": "I mean, they couldn't ban theistic Satanism. Which, while naturally off-putting to atheists, is pretty cool in its own way.",
              "timestamp": "2022-07-22 20:48:48",
              "score": 4,
              "num_children": 0,
              "author": 986,
              "replies": []
            },
            {
              "id": "ihbx4rc",
              "text": "As a silver lining, that might piss off the scientologists.",
              "timestamp": "2022-07-23 15:15:16",
              "score": 3,
              "num_children": 0,
              "author": 181137,
              "replies": []
            },
            {
              "id": "ihbeccb",
              "text": "Not all that hard to add that. \"I believe Satan's real and guides my actions.\"",
              "timestamp": "2022-07-23 12:42:32",
              "score": 2,
              "num_children": 0,
              "author": 248202,
              "replies": []
            }
          ]
        },
        {
          "id": "ih7v72y",
          "text": "And I'm pretty sure you just hit the nail on the head.",
          "timestamp": "2022-07-22 17:56:52",
          "score": 9,
          "num_children": 0,
          "author": 297085,
          "replies": []
        },
        {
          "id": "ih90uc0",
          "text": "SCOTUS",
          "timestamp": "2022-07-22 22:33:28",
          "score": 2,
          "num_children": 1,
          "author": 70344,
          "replies": [
            {
              "id": "ih9ezem",
              "text": "Goddammit im dumb. Thank you for correcting me.",
              "timestamp": "2022-07-23 00:19:54",
              "score": 2,
              "num_children": 1,
              "author": 296471,
              "replies": [
                {
                  "id": "ih9f90k",
                  "text": "Not dumb, just mistaken. Thank you for accepting the correction graciously. I always prefer to be corrected, but some people get bent out of shape.",
                  "timestamp": "2022-07-23 00:21:58",
                  "score": 1,
                  "num_children": 0,
                  "author": 70344,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ihaayoo",
          "text": "You know, due to the bias in the past decade to 2, this is not a far-fetched assumption. To which, is very sad, that they have gotten to this point...",
          "timestamp": "2022-07-23 04:47:05",
          "score": 1,
          "num_children": 0,
          "author": 169305,
          "replies": []
        }
      ]
    },
    {
      "id": "ih7mfwm",
      "text": "It's always been \"Freedom for me but not for ye.\"",
      "timestamp": "2022-07-22 17:00:57",
      "score": 1594,
      "num_children": 10,
      "author": 90581,
      "replies": [
        {
          "id": "ih89fro",
          "text": "Hail Satan brother",
          "timestamp": "2022-07-22 19:29:52",
          "score": 381,
          "num_children": 7,
          "author": 165062,
          "replies": [
            {
              "id": "ih8dmjq",
              "text": "Ave Satanas frater",
              "timestamp": "2022-07-22 19:57:27",
              "score": 144,
              "num_children": 2,
              "author": 90581,
              "replies": [
                {
                  "id": "ih98byq",
                  "text": "Mene Mene Tekal!\n\nSatana! Satana!",
                  "timestamp": "2022-07-22 23:28:30",
                  "score": 20,
                  "num_children": 1,
                  "author": 173153,
                  "replies": [
                    {
                      "id": "ih9a559",
                      "text": "Probatus es in statera, et inventus es minus habens.",
                      "timestamp": "2022-07-22 23:42:10",
                      "score": 6,
                      "num_children": 1,
                      "author": 90581,
                      "replies": [
                        {
                          "id": "ih9crxl",
                          "text": "Semper fidelis tyrannosaurus.",
                          "timestamp": "2022-07-23 00:02:36",
                          "score": 19,
                          "num_children": 0,
                          "author": 296896,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ih9el7k",
                  "text": "Hail Sithis",
                  "timestamp": "2022-07-23 00:16:47",
                  "score": 6,
                  "num_children": 0,
                  "author": 40993,
                  "replies": []
                }
              ]
            },
            {
              "id": "ih8wp0m",
              "text": "Hail yourselves!",
              "timestamp": "2022-07-22 22:03:59",
              "score": 38,
              "num_children": 4,
              "author": 336255,
              "replies": [
                {
                  "id": "ih90hiz",
                  "text": "Megustalations!",
                  "timestamp": "2022-07-22 22:30:57",
                  "score": 13,
                  "num_children": 1,
                  "author": 135791,
                  "replies": [
                    {
                      "id": "ih9ctl1",
                      "text": "Hail meeee",
                      "timestamp": "2022-07-23 00:02:57",
                      "score": 10,
                      "num_children": 0,
                      "author": 330842,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ih8xhoa",
                  "text": "Hail Dubs!",
                  "timestamp": "2022-07-22 22:09:35",
                  "score": 10,
                  "num_children": 2,
                  "author": 165062,
                  "replies": [
                    {
                      "id": "ih925d3",
                      "text": "Hail Meatloaf!",
                      "timestamp": "2022-07-22 22:42:52",
                      "score": 11,
                      "num_children": 1,
                      "author": 26896,
                      "replies": [
                        {
                          "id": "ih9ergz",
                          "text": "Hail Mary! 🏈 \n\nLol",
                          "timestamp": "2022-07-23 00:18:11",
                          "score": 1,
                          "num_children": 0,
                          "author": 40993,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ih94cn1",
                      "text": "Hail a cab",
                      "timestamp": "2022-07-22 22:58:53",
                      "score": 10,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ih9g3mg",
                  "text": "HAIL MEEEE!!!",
                  "timestamp": "2022-07-23 00:28:38",
                  "score": 4,
                  "num_children": 0,
                  "author": 295302,
                  "replies": []
                },
                {
                  "id": "ih9er37",
                  "text": "Hail yeah!",
                  "timestamp": "2022-07-23 00:18:06",
                  "score": 1,
                  "num_children": 0,
                  "author": 59585,
                  "replies": []
                }
              ]
            },
            {
              "id": "ih8ma13",
              "text": "Hail hail",
              "timestamp": "2022-07-22 20:54:10",
              "score": 11,
              "num_children": 1,
              "author": 161534,
              "replies": [
                {
                  "id": "ih8u5yy",
                  "text": "🤘",
                  "timestamp": "2022-07-22 21:46:37",
                  "score": 10,
                  "num_children": 0,
                  "author": 382829,
                  "replies": []
                }
              ]
            },
            {
              "id": "ih96bbq",
              "text": "Sail hatan!",
              "timestamp": "2022-07-22 23:13:21",
              "score": 8,
              "num_children": 1,
              "author": 149524,
              "replies": [
                {
                  "id": "ih9bjrd",
                  "text": "Sell hightan, buy lowtan",
                  "timestamp": "2022-07-22 23:53:05",
                  "score": 3,
                  "num_children": 0,
                  "author": 195565,
                  "replies": []
                }
              ]
            },
            {
              "id": "ih98j8i",
              "text": "Hail Caesar?",
              "timestamp": "2022-07-22 23:30:00",
              "score": 3,
              "num_children": 1,
              "author": 22634,
              "replies": [
                {
                  "id": "ihei790",
                  "text": "Hail Hydra!",
                  "timestamp": "2022-07-24 02:54:29",
                  "score": 2,
                  "num_children": 0,
                  "author": 407907,
                  "replies": []
                }
              ]
            },
            {
              "id": "ih9wido",
              "text": "Long live the metaphorical Satan!",
              "timestamp": "2022-07-23 02:38:17",
              "score": 2,
              "num_children": 0,
              "author": 404668,
              "replies": []
            },
            {
              "id": "ih93fv2",
              "text": "https://youtu.be/SGW4MgV_bok",
              "timestamp": "2022-07-22 22:52:14",
              "score": 1,
              "num_children": 0,
              "author": 80801,
              "replies": []
            }
          ]
        },
        {
          "id": "ih86sas",
          "text": "\"Rules for thee but not for me.\"",
          "timestamp": "2022-07-22 19:12:32",
          "score": 73,
          "num_children": 1,
          "author": 51966,
          "replies": [
            {
              "id": "ih8rcuc",
              "text": "It’s never been what OP said!",
              "timestamp": "2022-07-22 21:27:30",
              "score": 7,
              "num_children": 0,
              "author": 274046,
              "replies": []
            }
          ]
        },
        {
          "id": "ih8vnbg",
          "text": "The entire point is to deny the *other* they want to dominate over the rights and freedoms they themselves wish to hoard. [The hypocrisy is a feature, not a bug of Christian fascism.](https://imgur.com/kjW8Sas)",
          "timestamp": "2022-07-22 21:56:45",
          "score": 15,
          "num_children": 0,
          "author": 251994,
          "replies": []
        },
        {
          "id": "ih8n2dq",
          "text": ">It’s exactly how these board meetings ought to work, and yet, it feels like a major victory.\n\n...\n\n>And now kids will be able to wear Satanic clothing in Hays, Kansas as well.\n\nI don't know man, seems like they realized they created a policy that violated the rules for everyone and backed off after getting this perspective. I'm not saying it's good those rules were ever in place but let's give some credit where is due that these people saw the contradiction in their logic and made it right. This kind of thing is going to happen again and we should all hope it gets solved this easily and honestly.",
          "timestamp": "2022-07-22 20:59:18",
          "score": 65,
          "num_children": 3,
          "author": 74586,
          "replies": [
            {
              "id": "ih93edd",
              "text": "A common alternative (and much worse) outcome is introduction of convoluted new rules that are not obviously for the purpose of discrimination but have that effect, anyway. \n\nFor example, my previous county commission switched from having Christian prayers at the beginning of meetings to having prayers given by leaders of local religious congregations who apply to do the prayer and get some number of supporting signatures. The result: instead of commissioners praying, Christian preachers were brought in to pray.",
              "timestamp": "2022-07-22 22:51:56",
              "score": 33,
              "num_children": 1,
              "author": 134514,
              "replies": [
                {
                  "id": "ih97vbx",
                  "text": "That's where you offer to lead the group in a satanic prayer.\n\nMight I suggest\n\n\"Howdy doody Satan, come on in and have a cup of tea\"",
                  "timestamp": "2022-07-22 23:24:59",
                  "score": 27,
                  "num_children": 2,
                  "author": 163521,
                  "replies": [
                    {
                      "id": "ih9cj47",
                      "text": "They won’t be able to get enough supporting votes",
                      "timestamp": "2022-07-23 00:00:43",
                      "score": 8,
                      "num_children": 1,
                      "author": 289806,
                      "replies": [
                        {
                          "id": "ihbpyjb",
                          "text": "The dead will sign to support their lord.",
                          "timestamp": "2022-07-23 14:21:47",
                          "score": 1,
                          "num_children": 0,
                          "author": 261658,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ihbq0pl",
                      "text": "We don't want Captain Howdy anywhere near us!",
                      "timestamp": "2022-07-23 14:22:15",
                      "score": 1,
                      "num_children": 0,
                      "author": 261658,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ih94ksw",
              "text": "na, they’ll just have a drab standard dress code and allow no symbols/logos/iconography. which to be fair is much simpler, if a bit boring.",
              "timestamp": "2022-07-22 23:00:33",
              "score": 7,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ih9zdbi",
              "text": ">...let's give some credit where is due that these people saw the contradiction in their logic and made it right. \n\nThey likely spent two minutes googling how court cases with Satanists typically turn out and realized they'd lose their ass. \n\nLet's not get crazy with giving these people credit.",
              "timestamp": "2022-07-23 03:01:55",
              "score": 3,
              "num_children": 1,
              "author": 121379,
              "replies": [
                {
                  "id": "ihavkkp",
                  "text": "Maybe? I'm not sure what this is supposed to mean exactly. Even if they googled it and learned they'd lose, it still means the system is still working as intended. Which means they were encouraged to honestly adjudicate this issue for themselves. I'm finding it difficult to be outraged by this.",
                  "timestamp": "2022-07-23 08:55:19",
                  "score": 1,
                  "num_children": 0,
                  "author": 74586,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ih8f9xy",
          "text": "the Y in Ye is a holdover from when the thorn character was part of the alphabet. So wherever you see something like \"Ye\" as in \"Ye old\" whatever on a sign, it's pronounced, *The*.",
          "timestamp": "2022-07-22 20:08:23",
          "score": 25,
          "num_children": 6,
          "author": 376584,
          "replies": [
            {
              "id": "ih8geu3",
              "text": "The letter thorn looks like a p or a b, but the bump is in the very middle,and is still used in the Icelandic alphabet. The reason it was phased out in English is because the first mechanical printing press was made by a German, who's alphabet lacked the letter thorn, so \"Y\" was used as an alternate.",
              "timestamp": "2022-07-22 20:15:56",
              "score": 23,
              "num_children": 1,
              "author": 291986,
              "replies": [
                {
                  "id": "ih98oaq",
                  "text": "> The letter thorn looks like a p or a b, but the bump is in the very middle\n\nIt's in Unicode\n\nhttps://en.wikipedia.org/wiki/Thorn_(letter)\n\n> Thorn or þorn (Þ, þ)",
                  "timestamp": "2022-07-22 23:31:02",
                  "score": 6,
                  "num_children": 0,
                  "author": 55006,
                  "replies": []
                }
              ]
            },
            {
              "id": "ih8hfg6",
              "text": "Þe olðen dæiġ",
              "timestamp": "2022-07-22 20:22:37",
              "score": 6,
              "num_children": 0,
              "author": 90581,
              "replies": []
            },
            {
              "id": "ih8n17h",
              "text": "Actually, the \"ye\" in the post you are responding to is the plural form of \"thou\" and pronounced \"ye\", not \"the.\"",
              "timestamp": "2022-07-22 20:59:05",
              "score": 13,
              "num_children": 1,
              "author": 184769,
              "replies": [
                {
                  "id": "ih8qn08",
                  "text": "Same thing. It's not Y it's TH. As pointed out elsewhere. It's because the printers didn't have the thorn symbol so they used Y instead.",
                  "timestamp": "2022-07-22 21:22:42",
                  "score": -8,
                  "num_children": 1,
                  "author": 376584,
                  "replies": [
                    {
                      "id": "ih8td3n",
                      "text": "/r/confidentlyincorrect\n\nNo, it's not.  \"Ye\" the pronoun was never spelled with thorn, it was originally spelled \"ge.\"  The use of \"ye\" as a spelling for \"the\" is due to a later misunderstanding of the thorn character.  It has nothing to do with the archaic second person plural pronoun \"ye\" as used in the phrase \"hear ye, hear ye\" or the carol \"Come All Ye Faithful.\"",
                      "timestamp": "2022-07-22 21:41:10",
                      "score": 13,
                      "num_children": 1,
                      "author": 184769,
                      "replies": [
                        {
                          "id": "ih8ysx4",
                          "text": "Okay, then.",
                          "timestamp": "2022-07-22 22:18:57",
                          "score": -3,
                          "num_children": 0,
                          "author": 376584,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ih9nfk0",
              "text": "That “ye” corresponds to modern “the”, not the pronoun “ye”, which originally used a velar sound and was written “ge”.",
              "timestamp": "2022-07-23 01:25:55",
              "score": 2,
              "num_children": 0,
              "author": 289259,
              "replies": []
            },
            {
              "id": "ih9ekhu",
              "text": "So ye is the same as thee?",
              "timestamp": "2022-07-23 00:16:38",
              "score": 1,
              "num_children": 1,
              "author": 124547,
              "replies": [
                {
                  "id": "iha89ma",
                  "text": "No, there are two “ye”s. One corresponds to the modern “the” and was pronounced as such, and the other was the plural counterpart to “thou”. “You” was similarly the plural counterpart to “thee”, but they later all converged to “you”.",
                  "timestamp": "2022-07-23 04:20:54",
                  "score": 2,
                  "num_children": 0,
                  "author": 289259,
                  "replies": []
                }
              ]
            },
            {
              "id": "ih94605",
              "text": "We did pronounce it like that. Not sure why you assumed we didn't.",
              "timestamp": "2022-07-22 22:57:31",
              "score": -1,
              "num_children": 0,
              "author": 254810,
              "replies": []
            }
          ]
        },
        {
          "id": "ih8apqv",
          "text": "Ye olde freedom.",
          "timestamp": "2022-07-22 19:38:16",
          "score": 2,
          "num_children": 0,
          "author": 257471,
          "replies": []
        },
        {
          "id": "ih8zpe0",
          "text": "It's always about the majority seeing having to care about the minority as a burden or an attack on the majority.\n\nHumans don't want to worry about any more than they have to (thinking is expensive ). Those fearful of change and 'others' will  be the ones most reactive. \n\nLoss aversion as well. \n\nUnderstandable but not justifiable.",
          "timestamp": "2022-07-22 22:25:20",
          "score": 2,
          "num_children": 0,
          "author": 340507,
          "replies": []
        },
        {
          "id": "ih9klmo",
          "text": "It’s like in America you guys can’t have a thought experiment and work that through to its conclusion.\n\nInstead you run the real experiment on the dumbest shit just so you can all argue about whether the experiment counts or not, because you don’t like the person doing it.",
          "timestamp": "2022-07-23 01:03:42",
          "score": 1,
          "num_children": 0,
          "author": 95260,
          "replies": []
        },
        {
          "id": "ihaatmh",
          "text": "Yep. I’m just surprised that they cared to change the policy. I’d figured they would be unashamed in their brazen behavior.",
          "timestamp": "2022-07-23 04:45:42",
          "score": 1,
          "num_children": 0,
          "author": 169305,
          "replies": []
        },
        {
          "id": "ihax02s",
          "text": "For yeezus",
          "timestamp": "2022-07-23 09:15:01",
          "score": 1,
          "num_children": 0,
          "author": 77504,
          "replies": []
        }
      ]
    },
    {
      "id": "ih80qxi",
      "text": "Have you seen the yard signs with Bible verses written in Arabic? (White lettering on black background.) Neighbors scream that ISIS has invaded their town. I love it because it's intentionally provocative.",
      "timestamp": "2022-07-22 18:32:59",
      "score": 277,
      "num_children": 5,
      "author": 285706,
      "replies": [
        {
          "id": "ih8wenq",
          "text": "I would love one that says “Free ammo and barbecue for y’all” but in Arabic",
          "timestamp": "2022-07-22 22:02:00",
          "score": 94,
          "num_children": 1,
          "author": 404999,
          "replies": [
            {
              "id": "ih92ns4",
              "text": "Sounds oddly threatening. \"I will shoot and cook you\"",
              "timestamp": "2022-07-22 22:46:33",
              "score": 43,
              "num_children": 2,
              "author": 226579,
              "replies": [
                {
                  "id": "ih98u9c",
                  "text": "Sounds like a party.",
                  "timestamp": "2022-07-22 23:32:16",
                  "score": 17,
                  "num_children": 0,
                  "author": 81989,
                  "replies": []
                },
                {
                  "id": "ihawwf6",
                  "text": "I burst out laughing at this, thank you!!",
                  "timestamp": "2022-07-23 09:13:36",
                  "score": 4,
                  "num_children": 0,
                  "author": 234277,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ih8v43e",
          "text": "Where can I buy some????",
          "timestamp": "2022-07-22 21:53:03",
          "score": 16,
          "num_children": 0,
          "author": 123165,
          "replies": []
        },
        {
          "id": "ihab8iq",
          "text": "I have [this t-shirt](https://www.drehall.com/upload/goods/a/75/aff3436c4870a87107aa8684a25022c344.jpg) which produces the same effect. It's the Lord's Prayer (Our Father, ...).",
          "timestamp": "2022-07-23 04:49:48",
          "score": 15,
          "num_children": 0,
          "author": 205043,
          "replies": []
        },
        {
          "id": "ih9bkwn",
          "text": "Probably wouldn't even need to go that far. just do it in Hebrew or Greek and they won't be able to tell the difference. Then you can claim to be an fundamentalist to the extreme and only accept the bible in it's originally written language.\n\nBeat them at their own game.",
          "timestamp": "2022-07-22 23:53:19",
          "score": 45,
          "num_children": 0,
          "author": 70713,
          "replies": []
        },
        {
          "id": "ihbnqho",
          "text": "حب جارك كما تحب نفسك\n\n&nbsp;\n\nMatthew 22:39, for the curious",
          "timestamp": "2022-07-23 14:04:16",
          "score": 3,
          "num_children": 0,
          "author": 155543,
          "replies": []
        }
      ]
    },
    {
      "id": "ih7rs27",
      "text": "Christians are so privileged yet think they're the ones being oppressed.",
      "timestamp": "2022-07-22 17:34:54",
      "score": 848,
      "num_children": 15,
      "author": 230822,
      "replies": [
        {
          "id": "ih7sl6l",
          "text": "They think not being able to force their religion on others is a form of oppression. They think Freedom of Religion means that they are free to force their religion down people's throats.",
          "timestamp": "2022-07-22 17:40:04",
          "score": 418,
          "num_children": 2,
          "author": 126565,
          "replies": [
            {
              "id": "ih7wsr4",
              "text": "They fully believe that they have the god given and constitutional duty to \"bring America back to God.\" Neither document says any such thing. Just like abortion. The punishment for a woman accused of cheating on her husband was a forced attempted abortion performed by the priest. If scripture said that was a baby then why would God kill the baby for no reason but not the adulterous woman? There is no word there considering this thing growing inside of her as being anything other than something that may be removed if she cheated.",
              "timestamp": "2022-07-22 18:07:20",
              "score": 114,
              "num_children": 4,
              "author": 230822,
              "replies": [
                {
                  "id": "ih819si",
                  "text": "I thought that if the abortion worked that would 'prove' infidelity and the woman would be stoned to death soon after.",
                  "timestamp": "2022-07-22 18:36:25",
                  "score": 20,
                  "num_children": 2,
                  "author": 189674,
                  "replies": [
                    {
                      "id": "ih8zd1l",
                      "text": "Right but that's the people, not god killing the adulterous woman",
                      "timestamp": "2022-07-22 22:22:54",
                      "score": 3,
                      "num_children": 0,
                      "author": 230822,
                      "replies": []
                    },
                    {
                      "id": "ih81vkb",
                      "text": "They are pro two lifes!  Well sort of.  I will say that it is a good way to get ones marriage annulled.  Knock her up and say she cheated.  Church be like, “Yep.  Let this shithole of a man reset and try again.  We’ll help officially conduct the resetting.”",
                      "timestamp": "2022-07-22 18:40:25",
                      "score": 0,
                      "num_children": 0,
                      "author": 390303,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ih8bpfr",
                  "text": "Trying to find logic in religion will blow your brain up.  The whole book is non-sense.  The concept of a god in the way they portray it is about as realistic as Santa.",
                  "timestamp": "2022-07-22 19:44:48",
                  "score": 17,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ih90uh1",
                      "text": "I was a Christian when I went to prison. I truly felt that God wanted me to change my life and read his word. Maybe even become a preacher. So I got involved in daily bible study and actually started to read the book. It didn't take long before I just could not believe any of it was real",
                      "timestamp": "2022-07-22 22:33:29",
                      "score": 17,
                      "num_children": 1,
                      "author": 230822,
                      "replies": [
                        {
                          "id": "ih95mem",
                          "text": "Jail house religion is very easy to fall into.  Glad you saw through it.",
                          "timestamp": "2022-07-22 23:08:14",
                          "score": 10,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "iha1zcs",
                              "text": "As a Christian, I am PROUD of you for not falling for \"scare tactics\" like that <3 Bibles and religious texts should NOT be allowed in prisons, that is taking advantage of a vulnerable population.",
                              "timestamp": "2022-07-23 03:24:07",
                              "score": 2,
                              "num_children": 0,
                              "author": 408587,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ih9ft8i",
                  "text": "Now I finally understand TFG's campaign slogan. Making America \"Great\" apparently means making it a theocratic hellhole.",
                  "timestamp": "2022-07-23 00:26:21",
                  "score": 3,
                  "num_children": 1,
                  "author": 40993,
                  "replies": [
                    {
                      "id": "ihbjzo8",
                      "text": "A white, theocratic hellhole. They yearn for the 50s when they were making \"In God We Trust\" our national motto. \"Out of Many One\" was too inclusive for them",
                      "timestamp": "2022-07-23 13:33:23",
                      "score": 3,
                      "num_children": 0,
                      "author": 230822,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iha1vdh",
                  "text": "If we are going off \"historical precedent\" than we should keep in mind that plenty of Godly, Christian women calmly had abortions prior to the late 19th century. What changed? Well, women becoming more independent and forming identities AWAY from men, men taking over the \"woman's sphere\" of women's health (think: midwifery and such), AND the fear of immigrants outbreeding native born American white women. Does any of that sound familiar today? Hmm....",
                  "timestamp": "2022-07-23 03:23:10",
                  "score": 3,
                  "num_children": 0,
                  "author": 408587,
                  "replies": []
                }
              ]
            },
            {
              "id": "ihav14f",
              "text": "Religion is like a penis. It's nice to have one and fine to be proud of. Don't whip it out in public or shove it down someone else's throat. And definitely not in front of children!",
              "timestamp": "2022-07-23 08:47:52",
              "score": 2,
              "num_children": 0,
              "author": 33269,
              "replies": []
            }
          ]
        },
        {
          "id": "ih82c4l",
          "text": "Yeah, I'm so sick of the victim complex of these people. \"The most oppressed group are white, Christian males!11!1!\"",
          "timestamp": "2022-07-22 18:43:24",
          "score": 35,
          "num_children": 1,
          "author": 273470,
          "replies": [
            {
              "id": "ih8qvh2",
              "text": "You take a 20-25 year old white Christian male who has had all of his romantic advances rejected, and you get a **very** easy target to radicalize.\n\nHe already can be made to believe things that are not true. He has little attachment. He's angry. And he sees people who have all of the things he wants. He's looking for a reason why his life sucks.\n\nAlong comes a group of people who start lying to him and telling him none of his failings are his fault. That it's all <insert group here>'s fault. And you've got a radical racist/misogynist asshole.\n\nThat line of reasoning does **NOT** take a lot of push either. It can happen basically overnight.",
              "timestamp": "2022-07-22 21:24:15",
              "score": 23,
              "num_children": 3,
              "author": 91861,
              "replies": [
                {
                  "id": "iha2ee2",
                  "text": "See the 1950s, the \"golden era\" of America where any white male with a working pulse could waltz down to a local factory and make enough money to support a family of five. The only reason THAT was possible was the rest of the civilized world was a smoldering crater of hellish barren landscape, women and the minorities were \"kept in their place,\" and companies could only effectively buy and sell in the United States. Oh, and they were heavily taxed too, in fact a LOT of the American middle class was spurred on by massive government investments in education and infrastructure. Of course, the second companies realized they could automate and outsource most of the economy and the rest of the sane world got saner and caught up to America, then there was no need for the white male anymore. So what happened with white males? Did they point a finger at corrupt politicians or corporate CEOS for the falling out of the American middle class? Nah, they just blamed women and minorities. Sigh.",
                  "timestamp": "2022-07-23 03:27:45",
                  "score": 11,
                  "num_children": 0,
                  "author": 408587,
                  "replies": []
                },
                {
                  "id": "ih8zqif",
                  "text": "It's an ages old recruiting tactic",
                  "timestamp": "2022-07-22 22:25:34",
                  "score": 5,
                  "num_children": 0,
                  "author": 230822,
                  "replies": []
                },
                {
                  "id": "ih97k10",
                  "text": "TBH, you can probably take \"white\" and/or \"Christian\" out of that description and it's still true.\n\nThe second and third paragraphs sound like they're straight from a description of recruiting tactics by almost any radical organization on Earth.",
                  "timestamp": "2022-07-22 23:22:38",
                  "score": 3,
                  "num_children": 1,
                  "author": 43361,
                  "replies": [
                    {
                      "id": "ih9ei1q",
                      "text": "Religion really helps along the whole \"can be made to believe things that aren't true\"\n\nAnd while yes, totally an age old tactic, this is the most relevant to the US currently.",
                      "timestamp": "2022-07-23 00:16:06",
                      "score": 1,
                      "num_children": 0,
                      "author": 91861,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ih87qrm",
          "text": "To the privileged, equality feels like oppression.",
          "timestamp": "2022-07-22 19:18:48",
          "score": 29,
          "num_children": 1,
          "author": 393371,
          "replies": [
            {
              "id": "ih8v0ws",
              "text": "Came here to say this.  Yup.",
              "timestamp": "2022-07-22 21:52:26",
              "score": 3,
              "num_children": 0,
              "author": 123165,
              "replies": []
            }
          ]
        },
        {
          "id": "ih8z8pm",
          "text": "I was riding home from church with mom and aunt. The preacher had gage thanks that school prayer was back. I was explaining how incredibly wrong it was and that no this wasn't the truth.\n\nThey (late 60s) actually said that Satanists have more rights than Christians.\n\nMy first hold my beer moment...\n\n  \n\n\nOh yeah. It is Hail Satan on our currency. It's in Satan we trust on police vehicles. We pass how many Satanists churches?\n\nSeriously, in your day to day life, where is Hail Satan?\n\nI kept going about where I see Christian ideology in my day to day life.\n\nHold my fucking keg...\n\n  \n\n\nThankfully they did stop acting like victims and admitted that they liked it better when they prayed in school and I said I liked all the religions to have the same RIGHT.",
          "timestamp": "2022-07-22 22:22:02",
          "score": 8,
          "num_children": 1,
          "author": 240006,
          "replies": [
            {
              "id": "ih91xc3",
              "text": "I had a similar conversation with my dad. It was over the Baphomet statue I think. He's all, that's not right. I was able to make him admit that Christians are shoving their religion down everyone's throats since he felt just one statue was Satanists doing the same. I also convinced him that these Christian displays are often something that Jesus wouldn't like. Jesus didn't want people virtue signaling and graven images are against the 10 commandments.",
              "timestamp": "2022-07-22 22:41:17",
              "score": 6,
              "num_children": 1,
              "author": 230822,
              "replies": [
                {
                  "id": "ihbkhem",
                  "text": "...except for the version of the 10 commandments that was rewritten by the Catholics.  See, the Catholic church considers itself as having authority greater than & above the Bible-- this is official doctrine and they are clear & open about it.\n\nProtestants used to give Catholics a lot of grief about this, until they started doing the same shit.  The main difference is that they lie about it and keep trying to pretend that's not what they're doing.  It's quite possibly the most internally inconsistent religious ideology on the planet at this point.  Just pure hypocrisy and post-hoc justification in the most stupid assed, myopic, self centered ways possible.",
                  "timestamp": "2022-07-23 13:37:34",
                  "score": 2,
                  "num_children": 0,
                  "author": 18615,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ih8k444",
          "text": "When you've been privileged to your whole life, equality feels like oppression",
          "timestamp": "2022-07-22 20:40:09",
          "score": 7,
          "num_children": 0,
          "author": 342179,
          "replies": []
        },
        {
          "id": "ih8c9wz",
          "text": "When you're accustomed to privilege, equality feels like oppression.",
          "timestamp": "2022-07-22 19:48:31",
          "score": 12,
          "num_children": 0,
          "author": 240039,
          "replies": []
        },
        {
          "id": "ih95pbp",
          "text": "After being privileged, equality feels like oppression.",
          "timestamp": "2022-07-22 23:08:51",
          "score": 3,
          "num_children": 1,
          "author": 162449,
          "replies": [
            {
              "id": "ihbjnoi",
              "text": "Its a bit understandable, but one has to see through the emotion of it and accept that it is right. Most people operate mostly on emotion tho and can't get past it.",
              "timestamp": "2022-07-23 13:30:33",
              "score": 1,
              "num_children": 0,
              "author": 230822,
              "replies": []
            }
          ]
        },
        {
          "id": "ih9btdn",
          "text": "One of their worst traits.",
          "timestamp": "2022-07-22 23:55:10",
          "score": 3,
          "num_children": 0,
          "author": 10136,
          "replies": []
        },
        {
          "id": "ih87z6d",
          "text": "They think they are…",
          "timestamp": "2022-07-22 19:20:20",
          "score": 2,
          "num_children": 1,
          "author": 117602,
          "replies": [
            {
              "id": "ih900ls",
              "text": "They're all in the lion's den and it's all our fault",
              "timestamp": "2022-07-22 22:27:35",
              "score": 1,
              "num_children": 0,
              "author": 230822,
              "replies": []
            }
          ]
        },
        {
          "id": "ih93q0j",
          "text": "Persecution is mother's milk to Christians.  Any other religions have as their primary symbol of worship a man beaten to death and nailed to a cross?  And then are told to \"be like him\"?",
          "timestamp": "2022-07-22 22:54:18",
          "score": 2,
          "num_children": 1,
          "author": 356842,
          "replies": [
            {
              "id": "ihbiuir",
              "text": "Xactly!",
              "timestamp": "2022-07-23 13:23:32",
              "score": 1,
              "num_children": 0,
              "author": 230822,
              "replies": []
            }
          ]
        },
        {
          "id": "ih9xrdf",
          "text": "There are Muslims who claim oppression in Pakistan and Hindus who claim being oppressed in India - its just as infuriating there.\n\nThe main thing that unites them to christian shitheads here is social conservatism. \n\nThey genuinely think that the law not coddling them and punishing others is oppression. They will not stop until they have a religious ethnostate. It worked in Pakistan and it is successfully a disaster. It is being fostered in India. They are getting big wins in America.",
          "timestamp": "2022-07-23 02:48:30",
          "score": 2,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iha1n15",
          "text": "They're basically the only group that can openly HARRASS people in public loudly and boldly and actually get away with it. No other religious group is awarded that kind of privilege n this country and they have the GALL to claim \"PeRSeCuTIoN.\"",
          "timestamp": "2022-07-23 03:21:10",
          "score": 2,
          "num_children": 1,
          "author": 408587,
          "replies": [
            {
              "id": "ihbktc7",
              "text": "I always think back to that christian woman defacing a billboard in broad daylight. Since God tells them to do these things, it's ok. Since they are the majority, they get away with it or light sentences. Just as I'm sure many J6 traitors are getting lighter sentences because they are white and they more than likely are Christians. Belonging to a church is a mitigating factor in sentencing. I know, because I've used it on a few occasions myself.",
              "timestamp": "2022-07-23 13:40:21",
              "score": 1,
              "num_children": 1,
              "author": 230822,
              "replies": [
                {
                  "id": "ihmq3pc",
                  "text": "Exactly, just like in Muslim countries like Malaysia where when crimes are committed against non-Muslims, there's a collective \"shrug\" as those people aren't of the \"proper\" background to investigate. If you're the majority of some race, ethnic group, religion, etc. you can get away with a LOT more than a minority.",
                  "timestamp": "2022-07-25 21:18:22",
                  "score": 2,
                  "num_children": 0,
                  "author": 408587,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ih89iqu",
          "text": "Especially the white ones \n\nKaren is just as bad as the n word you know",
          "timestamp": "2022-07-22 19:30:26",
          "score": 1,
          "num_children": 2,
          "author": 165062,
          "replies": [
            {
              "id": "ih90fxo",
              "text": "Karen is nowhere near as bad as the n word. People aren't whipping white women making them work for nothing and stealing her children for the same life while calling her Karen. Karen is also a nickname earned by shitty actions while the n word is given for something the person has no control over.",
              "timestamp": "2022-07-22 22:30:38",
              "score": 8,
              "num_children": 1,
              "author": 230822,
              "replies": [
                {
                  "id": "ih91cqk",
                  "text": "Are you sure? Because one is Karen and the other we can’t say, therefore Karen is worse",
                  "timestamp": "2022-07-22 22:37:09",
                  "score": 0,
                  "num_children": 1,
                  "author": 165062,
                  "replies": [
                    {
                      "id": "ih92w85",
                      "text": "I think you got it backwards",
                      "timestamp": "2022-07-22 22:48:16",
                      "score": 3,
                      "num_children": 1,
                      "author": 230822,
                      "replies": [
                        {
                          "id": "ih94arl",
                          "text": "Ehhhh he’s getting the joke!",
                          "timestamp": "2022-07-22 22:58:31",
                          "score": 5,
                          "num_children": 1,
                          "author": 165062,
                          "replies": [
                            {
                              "id": "ihbiyqa",
                              "text": "I was hoping but these days, you never know",
                              "timestamp": "2022-07-23 13:24:35",
                              "score": 1,
                              "num_children": 0,
                              "author": 230822,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ihatyvm",
              "text": "Karen, please.",
              "timestamp": "2022-07-23 08:33:24",
              "score": 2,
              "num_children": 1,
              "author": 71465,
              "replies": [
                {
                  "id": "ihc5370",
                  "text": "This made my day, LoL 😂",
                  "timestamp": "2022-07-23 16:12:29",
                  "score": 2,
                  "num_children": 0,
                  "author": 321454,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ih9b775",
          "text": "Well, as the saying goes - when you're used to priviledge, then equality feels like oppression.",
          "timestamp": "2022-07-22 23:50:20",
          "score": 1,
          "num_children": 0,
          "author": 284431,
          "replies": []
        },
        {
          "id": "ihuhi61",
          "text": "the best comment 👏👏👏",
          "timestamp": "2022-07-27 13:00:06",
          "score": 1,
          "num_children": 0,
          "author": 314008,
          "replies": []
        }
      ]
    },
    {
      "id": "ih86rac",
      "text": "Article says: \"the board discussed the issue and it became clear some of the members just hadn’t considered the implications of that statement:\"\n\nNo shit Sherlock! The religious  among other sectors of society have no concept of Critical Thinking 😆",
      "timestamp": "2022-07-22 19:12:20",
      "score": 160,
      "num_children": 2,
      "author": 55588,
      "replies": [
        {
          "id": "ih8py92",
          "text": "There was a tweet on black people Twitter that just highlighted this shit. Some person having legitimate cognitive dissonance between critically questioning their religion (which they openly admitted would lead to leaving their faith) or just feigning ignorance. \n\nCritical thinking is literally the enemy of religion. Once you take the dive into questioning it, there's nothing there to back up the horseshit claims from sky daddy's man-made book.",
          "timestamp": "2022-07-22 21:18:12",
          "score": 57,
          "num_children": 2,
          "author": 343033,
          "replies": [
            {
              "id": "ih8xq6r",
              "text": "I remember when I was about 12, I started learning about different world religions. I started asking questions to my uncle, who is a preacher. He shut me down immediately and said that “knowledge was the gateway to evil.” It wasn’t long after that I completely abandoned Christianity. I guess he was right!",
              "timestamp": "2022-07-22 22:11:16",
              "score": 39,
              "num_children": 4,
              "author": 327870,
              "replies": [
                {
                  "id": "ih8zd4a",
                  "text": "As silly as it sounds, mine was the pastor's inability to explain how it was that dinosaurs existed millions of years ago, but humans were created on day 7, which was only some few thousand years ago. He said the bible didn't specify how long gods days of creation were 🙄",
                  "timestamp": "2022-07-22 22:22:54",
                  "score": 23,
                  "num_children": 1,
                  "author": 343033,
                  "replies": [
                    {
                      "id": "ihboh39",
                      "text": "The lazy apologetic claims that dinosaurs are fake - just another of satan's tricks...",
                      "timestamp": "2022-07-23 14:10:11",
                      "score": 1,
                      "num_children": 0,
                      "author": 155543,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iha2jtp",
                  "text": "So proud of you for making your OWN decision :)\n\nNever let others pressure you into faith!\\~",
                  "timestamp": "2022-07-23 03:29:06",
                  "score": 2,
                  "num_children": 0,
                  "author": 408587,
                  "replies": []
                },
                {
                  "id": "ihbodc5",
                  "text": ">  remember when I was about 12, I started learning about different world religions. \n\nThat plus thinking about the implications of \"one true religion\" claims got me on the path towards atheism.",
                  "timestamp": "2022-07-23 14:09:21",
                  "score": 2,
                  "num_children": 0,
                  "author": 155543,
                  "replies": []
                },
                {
                  "id": "ihcao0m",
                  "text": "My thing was that  \n1. Adam and Eve literally spoke with God  \n2. Noah and his family literally spoke with God  \n3. A whole bunch of other religions popped up despite the fact that the only living ancestors of all humanity knew and spoke with the \"one true God\" personally  \n\n\nHow does that work?",
                  "timestamp": "2022-07-23 16:52:04",
                  "score": 2,
                  "num_children": 0,
                  "author": 356941,
                  "replies": []
                }
              ]
            },
            {
              "id": "iha0jga",
              "text": "Religion has always just been lay philosophy sans logic and a good community if you're lucky.",
              "timestamp": "2022-07-23 03:11:49",
              "score": 1,
              "num_children": 0,
              "author": 387054,
              "replies": []
            }
          ]
        },
        {
          "id": "ih8xp9g",
          "text": "The report implied that anti-Satanist items in school dress codes were implemented at the request of Satanists",
          "timestamp": "2022-07-22 22:11:04",
          "score": -3,
          "num_children": 1,
          "author": 250009,
          "replies": [
            {
              "id": "ih8znur",
              "text": "That doesn't even make sense,\nI believe the Satanists wanted the anti-satanist dress code changed to include other religions in the dress code.",
              "timestamp": "2022-07-22 22:25:02",
              "score": 2,
              "num_children": 1,
              "author": 55588,
              "replies": [
                {
                  "id": "ih95y98",
                  "text": "The report does indeed imply it. They do so by stating an example from a different school where a Satanist board member encouraged anti-Satanist language be included in their policies\n\nI'm sure they do want all religion banned from school, that doesn't argue against them using a strategy of getting Satanism banned, then complaining",
                  "timestamp": "2022-07-22 23:10:41",
                  "score": -2,
                  "num_children": 1,
                  "author": 250009,
                  "replies": [
                    {
                      "id": "ih9bskd",
                      "text": "The article does not say that Satanists wanted anti- satanist items in the dress code. They are working to remove anti-satanist item already in the dress code.",
                      "timestamp": "2022-07-22 23:55:00",
                      "score": 2,
                      "num_children": 1,
                      "author": 55588,
                      "replies": [
                        {
                          "id": "ih9eqcp",
                          "text": "The excerpt of the part I'm referring to, bolding is mine\n\n>It’s not the first time something like this has happened either. Last October, the Rose Tree Media School District in Pennsylvania made a very similar change to a dress code that banned anything “Satanic in nature.” **That only happened because a local Satanist urged the school board to make that change.**",
                          "timestamp": "2022-07-23 00:17:56",
                          "score": -2,
                          "num_children": 1,
                          "author": 250009,
                          "replies": [
                            {
                              "id": "ih9gldu",
                              "text": "Yes , the dress code banned anything \"Satanic in nature\" and they \"changed\" it at the behest of a local Satanist.\nRead it carefully.",
                              "timestamp": "2022-07-23 00:32:30",
                              "score": 2,
                              "num_children": 0,
                              "author": 55588,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ih7w318",
      "text": "I live in Kansas\nFuck the bible belt",
      "timestamp": "2022-07-22 18:02:40",
      "score": 109,
      "num_children": 4,
      "author": 173692,
      "replies": [
        {
          "id": "ih8d4fc",
          "text": "Kansas gave us FSM. ramen.",
          "timestamp": "2022-07-22 19:54:07",
          "score": 34,
          "num_children": 0,
          "author": 74255,
          "replies": []
        },
        {
          "id": "ih889b0",
          "text": "To use a Sam Kinison phrase, you’re in one of the notches in the bible belt.",
          "timestamp": "2022-07-22 19:22:09",
          "score": 17,
          "num_children": 1,
          "author": 189163,
          "replies": [
            {
              "id": "ih9a5xc",
              "text": "Sam was raised pentecostal. I'm so happy he got out and was able to [share his talent with us](https://youtu.be/GYgAhA-3WMk) for a short amount of time.",
              "timestamp": "2022-07-22 23:42:19",
              "score": 4,
              "num_children": 0,
              "author": 252849,
              "replies": []
            }
          ]
        },
        {
          "id": "ih94mfh",
          "text": "And fuck commas too?",
          "timestamp": "2022-07-22 23:00:52",
          "score": 4,
          "num_children": 0,
          "author": 313602,
          "replies": []
        },
        {
          "id": "iha55a0",
          "text": "We really need more satanic temples",
          "timestamp": "2022-07-23 03:52:03",
          "score": 1,
          "num_children": 0,
          "author": 238702,
          "replies": []
        }
      ]
    },
    {
      "id": "ih8qx21",
      "text": "When I was in highschool I knew a guy who was wiccan (I might be wrong though). He had a beautiful and large grimoire that he made himself that had his personal writings and spells. It was amazing and looked like something out of a movie or an RPG.\n\nWell one day. He came in to class without his grimoire which was out of character because he had it every day.  We asked him where it was and he said that the office took it and said he was no longer allowed to bring it to school because someone complained.\n\nThe ONLY reason he was able to get it back was because a Christian used his religious privilege to go to the office and say something along the lines of \"if that student can't bring their book then I shouldn't be able to brink my bible. Either you let him bring his book or everyone leaves their bibles at home, including teachers\"\n\nThe office listened to the student thankfully but it sucks that another student had to use their religious privilege to get a student to have their own freedoms when the office wouldn't listen to him.",
      "timestamp": "2022-07-22 21:24:32",
      "score": 81,
      "num_children": 4,
      "author": 70802,
      "replies": [
        {
          "id": "ih98sou",
          "text": "Props to that Christian student.  THAT’S the kind of decency everyone should aspire to.",
          "timestamp": "2022-07-22 23:31:56",
          "score": 58,
          "num_children": 2,
          "author": 223685,
          "replies": [
            {
              "id": "ih9o0up",
              "text": "Dollars to donuts he won’t be Christian for long.",
              "timestamp": "2022-07-23 01:30:35",
              "score": 21,
              "num_children": 0,
              "author": 300654,
              "replies": []
            },
            {
              "id": "ih9rc7d",
              "text": "He was the first apostle for the Grimoire's message",
              "timestamp": "2022-07-23 01:56:47",
              "score": 1,
              "num_children": 0,
              "author": 113280,
              "replies": []
            }
          ]
        },
        {
          "id": "iha09a6",
          "text": "That is precisely how people can and just use their privilege to stand up for others. It is sad it has to happen, but being an ally is very powerful if you do it well.",
          "timestamp": "2022-07-23 03:09:26",
          "score": 13,
          "num_children": 0,
          "author": 325370,
          "replies": []
        },
        {
          "id": "ihakomk",
          "text": "I'm sure that Christian was just being a good dude, but if I was a true-blue believer in the supernatural, I'd want to be on the good side of the kid who possessed the Necronomicon, too.",
          "timestamp": "2022-07-23 06:33:42",
          "score": 2,
          "num_children": 0,
          "author": 373002,
          "replies": []
        },
        {
          "id": "ihbztg2",
          "text": "Banning a student's *personal writings*?\n\nThat's offensive on many levels.  I kept a lot of notebooks full of terrible writing when I was a teenager, and I'd hate to think the only reason I didn't have them confiscated was that they were cheap looking.",
          "timestamp": "2022-07-23 15:34:51",
          "score": 1,
          "num_children": 0,
          "author": 181137,
          "replies": []
        }
      ]
    },
    {
      "id": "ih7qpbo",
      "text": "Funny how the right never considers how their bullshit can turn around and bite them in the ass.",
      "timestamp": "2022-07-22 17:28:06",
      "score": 189,
      "num_children": 3,
      "author": 276330,
      "replies": [
        {
          "id": "ih7z38u",
          "text": "Conservatives lack of imagination is their most consistent achilles.",
          "timestamp": "2022-07-22 18:22:12",
          "score": 91,
          "num_children": 1,
          "author": 203937,
          "replies": [
            {
              "id": "ihbphed",
              "text": "They don't even insult their political opponents for what those opponents are actually doing - they simply project the nefarious shit they themselves are doing onto their opponents.",
              "timestamp": "2022-07-23 14:18:12",
              "score": 3,
              "num_children": 0,
              "author": 155543,
              "replies": []
            }
          ]
        },
        {
          "id": "ih8ay85",
          "text": "If they could apply alternative viewpoints to their own religion and position, they wouldn't be Christians.  \n\nSince the outsider test for faith is one of the best attacks on religion, the Christian brain is pretty much required to not understand it at all.",
          "timestamp": "2022-07-22 19:39:50",
          "score": 39,
          "num_children": 1,
          "author": 257471,
          "replies": [
            {
              "id": "iha2m4a",
              "text": "As a Christian, 100% agree <3",
              "timestamp": "2022-07-23 03:29:40",
              "score": 0,
              "num_children": 1,
              "author": 408587,
              "replies": [
                {
                  "id": "ihabs3r",
                  "text": "https://tenor.com/view/fry-futurama-suspicious-squint-gif-15326860",
                  "timestamp": "2022-07-23 04:55:14",
                  "score": 2,
                  "num_children": 1,
                  "author": 377730,
                  "replies": [
                    {
                      "id": "ihaccyz",
                      "text": "I'm a socially awkward weirdo who can't fit in anywhere haha!",
                      "timestamp": "2022-07-23 05:01:04",
                      "score": 1,
                      "num_children": 0,
                      "author": 408587,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ih8yanm",
          "text": "Which is funny considering that they love to make \"slippery-slope\" arguments.",
          "timestamp": "2022-07-22 22:15:20",
          "score": 10,
          "num_children": 1,
          "author": 374155,
          "replies": [
            {
              "id": "ihac08j",
              "text": "\"If you ban malicious communications *[a UK term for death threats]*, pretty soon you'll be banning all free speech!\" - my conservative step-mom",
              "timestamp": "2022-07-23 04:57:30",
              "score": 5,
              "num_children": 0,
              "author": 377730,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ih8egj6",
      "text": "Back in 10th grade, I was called to the office during one of my classes. I was a good kid and never got into trouble, so I had no idea what it could be about. Well, apparently somebody had an issue with my Motley Crue shirt that had a large pentagram. I was told to turn it inside-out, which I did.\n\nAs soon as I left the office, I switched it back and didn’t hear anything more about it. \n\nI wish I had my current attitude and knowledge back then to argue my point and not cave so easily.",
      "timestamp": "2022-07-22 20:02:57",
      "score": 63,
      "num_children": 2,
      "author": 142996,
      "replies": [
        {
          "id": "ih97sft",
          "text": "I had a teacher yelling blasphemy at me because my Master of Puppets t-shirt had the track listing, and one of the songs was Leper Messiah.",
          "timestamp": "2022-07-22 23:24:24",
          "score": 22,
          "num_children": 1,
          "author": 103782,
          "replies": [
            {
              "id": "ihdy4rv",
              "text": "Such a great album. And what a puppet your teacher was. They never see the irony.  I was pretty unassuming in high school.  I got away with lots if shirts others wouldn't have. Like the gnr shirt with slash wearing a shit happens t shirt and my absolute (vodka) Daytona shirt and my suicidal tendencies shirt.... all I wanted was a pepsi and she wouldn't give it to me. Not related to my clothing,  but I did get referred to guidance for being a satan worshipper.",
              "timestamp": "2022-07-24 00:11:11",
              "score": 1,
              "num_children": 0,
              "author": 260458,
              "replies": []
            }
          ]
        },
        {
          "id": "ih9gcfz",
          "text": "I wore a pentagram necklace in high school because I guess I thought it was cool. It was also made of a soft metal that I figured out I could use as a pencil if I forgot one. \n\nPeople who saw it kept asking if I was Jewish and I had to keep pointing out that it was a five pointed star and not a six pointed star. But then I had to explain that yes, I was also Jewish. Also, Satan is a figure from Judaism anyway.",
          "timestamp": "2022-07-23 00:30:33",
          "score": 14,
          "num_children": 1,
          "author": 341310,
          "replies": [
            {
              "id": "ihdyaxr",
              "text": "My BFF and I had metal ones. She heated hers up and burnt it into her arm. We both ended up getting referred to guidance for satan worshipping!",
              "timestamp": "2022-07-24 00:12:34",
              "score": 1,
              "num_children": 0,
              "author": 260458,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ih7y0cw",
      "text": "hail satan!",
      "timestamp": "2022-07-22 18:15:16",
      "score": 57,
      "num_children": 2,
      "author": 375412,
      "replies": [
        {
          "id": "ih96nke",
          "text": "Ave Satanas!",
          "timestamp": "2022-07-22 23:15:53",
          "score": 12,
          "num_children": 1,
          "author": 392513,
          "replies": [
            {
              "id": "ihbtbfg",
              "text": "Have a banana!",
              "timestamp": "2022-07-23 14:47:17",
              "score": 2,
              "num_children": 0,
              "author": 44547,
              "replies": []
            }
          ]
        },
        {
          "id": "ih8p7gl",
          "text": "Hail yourself!",
          "timestamp": "2022-07-22 21:13:17",
          "score": 21,
          "num_children": 1,
          "author": 75033,
          "replies": [
            {
              "id": "ih8qfv2",
              "text": "Hail Gein!",
              "timestamp": "2022-07-22 21:21:22",
              "score": 8,
              "num_children": 1,
              "author": 238635,
              "replies": [
                {
                  "id": "ih9geoz",
                  "text": "Megustalations",
                  "timestamp": "2022-07-23 00:31:02",
                  "score": 7,
                  "num_children": 0,
                  "author": 186870,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ih8c48y",
      "text": "We need atheists on school boards. Have kids? Want them to have a future? Join!",
      "timestamp": "2022-07-22 19:47:30",
      "score": 51,
      "num_children": 1,
      "author": 242458,
      "replies": [
        {
          "id": "ih8e1xv",
          "text": "I'm in. How do I apply to join a school board? I'm an atheist engineer with experience in project management and leadership positions. Would that help at all?",
          "timestamp": "2022-07-22 20:00:17",
          "score": 21,
          "num_children": 1,
          "author": 279786,
          "replies": [
            {
              "id": "ih9298k",
              "text": "Your qualifications would serve only to have your brain turned inside out listening to the logic. I briefly considered it, but I already have a full time job and don’t need a second one that pays a $200 stipend twice a year.",
              "timestamp": "2022-07-22 22:43:39",
              "score": 12,
              "num_children": 1,
              "author": 200594,
              "replies": [
                {
                  "id": "ihawa1f",
                  "text": "The evangelicals and other crazies are not on those boards for the money, but to exert their influence.",
                  "timestamp": "2022-07-23 09:05:02",
                  "score": 4,
                  "num_children": 0,
                  "author": 48152,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ih959ac",
      "text": "The Satanist should also plan to pray at the 50 yard line during games now that it is constitutionally protected lol",
      "timestamp": "2022-07-22 23:05:30",
      "score": 27,
      "num_children": 0,
      "author": 6503,
      "replies": []
    },
    {
      "id": "ih98jyl",
      "text": "I got a hat made that says “Fuck your God” but was told I can’t wear it at work because of the language so now I’m wearing one that says “Hail Satan” and they can’t say shit and I know it’s pissing them off even more than the first hat",
      "timestamp": "2022-07-22 23:30:08",
      "score": 20,
      "num_children": 1,
      "author": 362413,
      "replies": [
        {
          "id": "ihaxhq2",
          "text": "XD",
          "timestamp": "2022-07-23 09:21:45",
          "score": 2,
          "num_children": 0,
          "author": 297726,
          "replies": []
        }
      ]
    },
    {
      "id": "ih8b8ox",
      "text": "Hear, hear and Hail Satan! I’m a card carrying member!",
      "timestamp": "2022-07-22 19:41:44",
      "score": 18,
      "num_children": 1,
      "author": 311582,
      "replies": [
        {
          "id": "ih9n9tk",
          "text": "I’m waiting on my TST card. Got the shirt today!",
          "timestamp": "2022-07-23 01:24:41",
          "score": 6,
          "num_children": 1,
          "author": 257459,
          "replies": [
            {
              "id": "ih9ptnv",
              "text": "I’m wondering if I can wear one on a plane? Hoping it’s a non issue but who knows?",
              "timestamp": "2022-07-23 01:44:46",
              "score": 4,
              "num_children": 2,
              "author": 311582,
              "replies": [
                {
                  "id": "ihbhetc",
                  "text": "You can wear one on a plane.  There was a flap about that a few years ago when some American Airlines flight attendants told a woman she had to change her \"Hail Satan\" t-shirt or she wouldn't be allowed on the plane.  That story made international news and American Airlines publicly apologized to her.",
                  "timestamp": "2022-07-23 13:10:48",
                  "score": 3,
                  "num_children": 0,
                  "author": 178902,
                  "replies": []
                },
                {
                  "id": "ih9zth9",
                  "text": "Why not? The 1A applies, in the US at least",
                  "timestamp": "2022-07-23 03:05:40",
                  "score": 2,
                  "num_children": 0,
                  "author": 257459,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ih8sdke",
      "text": "In high school in I think 05 or 06 I was sent home for wearing an ozzfest shirt that had ozzy in a crown of thorns with \"the passion of the ozz\" written on it. Wish I had a cool part 2 of the story that sounds like \"an then everybody clapped\" moment but nope, mom threw the shirt away just so I can't cause another ruckus.",
      "timestamp": "2022-07-22 21:34:27",
      "score": 12,
      "num_children": 1,
      "author": 120181,
      "replies": [
        {
          "id": "ih97efa",
          "text": "I guess I should be lucky that my school never gave a shit about my metal shirts. I looked like a typical death metal fan, camo cargo pants and a Slayer, Death, COB, Nile, JFAC or Bolt thrower shirt",
          "timestamp": "2022-07-22 23:21:26",
          "score": 4,
          "num_children": 1,
          "author": 89256,
          "replies": [
            {
              "id": "ih9aipq",
              "text": "I mainly just wore jeans and plain shirts the graphic shirts I did and still do wear are 90% concert Ts. Freakers ball, ozzfest, family values, etc found a Woodstock '99 with Fred durst face printed on the front at goodwill I rocked for awhile.",
              "timestamp": "2022-07-22 23:45:04",
              "score": 1,
              "num_children": 0,
              "author": 120181,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ih8at2p",
      "text": "Hail satan",
      "timestamp": "2022-07-22 19:38:53",
      "score": 10,
      "num_children": 0,
      "author": 319604,
      "replies": []
    },
    {
      "id": "ih8s0ar",
      "text": "Hail Satan, y’all.",
      "timestamp": "2022-07-22 21:31:56",
      "score": 10,
      "num_children": 0,
      "author": 391251,
      "replies": []
    },
    {
      "id": "ih8pwg4",
      "text": "It just occurred to me that the christians have become the bad guys as far as being on the wrong side of history supporting a criminal president and trying to actively take away people's rights.\n\nThe satanists have really been stepping up their game with their good deeds lately. Just sayin'.",
      "timestamp": "2022-07-22 21:17:53",
      "score": 23,
      "num_children": 2,
      "author": 410694,
      "replies": [
        {
          "id": "ih95k11",
          "text": "Always have been",
          "timestamp": "2022-07-22 23:07:44",
          "score": 19,
          "num_children": 1,
          "author": 338700,
          "replies": [
            {
              "id": "ih9nf9d",
              "text": "Everyone expects the Inquisition",
              "timestamp": "2022-07-23 01:25:52",
              "score": 7,
              "num_children": 0,
              "author": 257459,
              "replies": []
            }
          ]
        },
        {
          "id": "iha1rfn",
          "text": "Are you familiar with an institution commonly known as the Papacy, founded around 300ACE, which presided over multiple historical events including (but not even remotely limited to) around 400 years of invading, pillaging, and burning a foreign region of the world because the people there had the wrong version of the Papacy's favorite book?",
          "timestamp": "2022-07-23 03:22:13",
          "score": 7,
          "num_children": 0,
          "author": 9527,
          "replies": []
        }
      ]
    },
    {
      "id": "ih860k8",
      "text": "♬ We've only just begun ♬",
      "timestamp": "2022-07-22 19:07:27",
      "score": 8,
      "num_children": 0,
      "author": 361556,
      "replies": []
    },
    {
      "id": "ih90ics",
      "text": "I see this as an absolute win for secularism. You Yanks could use more of those these days.",
      "timestamp": "2022-07-22 22:31:07",
      "score": 8,
      "num_children": 0,
      "author": 409404,
      "replies": []
    },
    {
      "id": "ih93f09",
      "text": "God bless the Satanism",
      "timestamp": "2022-07-22 22:52:04",
      "score": 6,
      "num_children": 0,
      "author": 299089,
      "replies": []
    },
    {
      "id": "ih8g5fh",
      "text": "Xtians believe that religious freedom **ONLY** applies to them and every one else shoudl just **STFU** and accept it or else be accused of prejudice and persecution...xtianty the cult of Death, Sexism, Rape, Paedophile's  and Gaslighting",
      "timestamp": "2022-07-22 20:14:10",
      "score": 16,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ih85985",
      "text": "Hadn't heard of the similar event in PA.  I have worked for that school district in the past and it's quite local so seeing they had the same dress code issue was a shock.",
      "timestamp": "2022-07-22 19:02:28",
      "score": 4,
      "num_children": 0,
      "author": 268307,
      "replies": []
    },
    {
      "id": "ih866hm",
      "text": "Tit for tat motherfuckers.",
      "timestamp": "2022-07-22 19:08:32",
      "score": 4,
      "num_children": 0,
      "author": 353820,
      "replies": []
    },
    {
      "id": "ih890k3",
      "text": "Good for them. They are doing the good work.",
      "timestamp": "2022-07-22 19:27:06",
      "score": 5,
      "num_children": 0,
      "author": 287580,
      "replies": []
    },
    {
      "id": "ih9c7m2",
      "text": "Good sue the pedophile Christianity declare it a jihadist cult",
      "timestamp": "2022-07-22 23:58:16",
      "score": 5,
      "num_children": 0,
      "author": 354036,
      "replies": []
    },
    {
      "id": "ih9h3ai",
      "text": "I feel like this would be a really good change, and I feel like people don't understand that we're not sacrificing goats on our table and we're not evil people",
      "timestamp": "2022-07-23 00:36:20",
      "score": 5,
      "num_children": 0,
      "author": 304922,
      "replies": []
    },
    {
      "id": "ihaaqli",
      "text": "When I went to HS in the early 90s, we had no real dress code. There were kids wearing ripped jeans, t-shirts with beer/cigarettes on them, leather jackets with chains (one kid had a Damn Skinny Puppy jacket), multi-colored hair, piercing, etc. And you know what? We got through the day just fine. No one was distracted, there were no fights over appearance, etc. \n\nI think student appearance isn't a big deal until adults make it a big deal with these codes and bans that they deem of such high importance. \n\nWhy not just stick to teaching the three Rs and quit worrying about student appearance?",
      "timestamp": "2022-07-23 04:44:51",
      "score": 5,
      "num_children": 0,
      "author": 271506,
      "replies": []
    },
    {
      "id": "ih8nmac",
      "text": "Thank God for the Satanists.",
      "timestamp": "2022-07-22 21:02:51",
      "score": 12,
      "num_children": 0,
      "author": 75102,
      "replies": []
    },
    {
      "id": "ih8twqt",
      "text": "Good for them. Hail Satan!!",
      "timestamp": "2022-07-22 21:44:52",
      "score": 4,
      "num_children": 0,
      "author": 91478,
      "replies": []
    },
    {
      "id": "ih94lse",
      "text": "No change has *actually* been implemented yet according to the article, just scheduled to be put to a vote. But based on how the article is worded, I’m cautiously optimistic.",
      "timestamp": "2022-07-22 23:00:44",
      "score": 4,
      "num_children": 0,
      "author": 339017,
      "replies": []
    },
    {
      "id": "ih9gs9e",
      "text": "Wait until the Pastafarians show up.",
      "timestamp": "2022-07-23 00:33:59",
      "score": 5,
      "num_children": 1,
      "author": 8744,
      "replies": [
        {
          "id": "ihaxlhk",
          "text": "I'm sorry but hearing pastafarian for the first time I imagined a pasta worshipping cult.",
          "timestamp": "2022-07-23 09:23:12",
          "score": 3,
          "num_children": 1,
          "author": 297726,
          "replies": [
            {
              "id": "ihaxzwv",
              "text": "Look up Church of the Flying Spaghetti Monster. And yes, it’s an official religion.",
              "timestamp": "2022-07-23 09:28:50",
              "score": 2,
              "num_children": 1,
              "author": 8744,
              "replies": [
                {
                  "id": "ihbnhgk",
                  "text": "That's not just a meme? Damn.",
                  "timestamp": "2022-07-23 14:02:17",
                  "score": 3,
                  "num_children": 1,
                  "author": 297726,
                  "replies": [
                    {
                      "id": "ihdpqvx",
                      "text": "😅 IKR",
                      "timestamp": "2022-07-23 23:04:31",
                      "score": 1,
                      "num_children": 0,
                      "author": 8744,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ihaoa4o",
      "text": "Back in my…sophomore or junior year in high school the columbine school shooting happened. So, back story, we got a new vice principal. She was ex navy, very biased on who she favored and who she didn’t. If you weren’t part of sports you were not worthy. Shorts 2 cm too short, you need to change, etc. So I was friends with the resident goths of the school. They were all nice and chill. She hated them. The theory is that she started a rumor that they were going to shoot up the school and blow it up on the last day. Now one of the “head goths” laughed at this rumor (because it was going around the school before the end of the year and he was a senior). He was like where am I getting all this money? He had a car that he paid for himself, paid for his insurance and had quit his job at arbys like a month or so prior in preparation for college. So, small town, all the officers were there, with dogs, a couple of officers from the next town over and all the cop cars (like 5 of them). The school had banned wearing black clothing (which sucked for the theater kids because if we had TEC rehearsal or a show we had to have our all black clothing to change in to instead of just wearing it to class).\nSo on the last day ALL the goths wore head to toe white with crosses on and shit. She was super pissed and of course nothing happened. She was such a bitch. Really she should have worried about the rednecks. They had to ban gun racks in vehicles because someone had one and their rifle went off and shattered a car window in the parking lot.",
      "timestamp": "2022-07-23 07:18:06",
      "score": 4,
      "num_children": 0,
      "author": 36743,
      "replies": []
    },
    {
      "id": "ih9lgpd",
      "text": "Bold of you to use the words \"think\" and \"Kansas\" in the same sentence.",
      "timestamp": "2022-07-23 01:10:29",
      "score": 14,
      "num_children": 0,
      "author": 108814,
      "replies": []
    },
    {
      "id": "ih8zuym",
      "text": "This is the way to fight this nonsense, but it could backfire.",
      "timestamp": "2022-07-22 22:26:28",
      "score": 3,
      "num_children": 1,
      "replies": [
        {
          "id": "ih90e9b",
          "text": "How",
          "timestamp": "2022-07-22 22:30:18",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "ih90jxx",
              "text": "It could put a target on the backs of secular folks.",
              "timestamp": "2022-07-22 22:31:26",
              "score": 0,
              "num_children": 2,
              "replies": [
                {
                  "id": "ihbcuhz",
                  "text": "This is related to a policy that specifically banned satanic imagery. removing that policy is a win for everyone.",
                  "timestamp": "2022-07-23 12:28:03",
                  "score": 2,
                  "num_children": 0,
                  "author": 216611,
                  "replies": []
                },
                {
                  "id": "ihbto8i",
                  "text": "Khmer rouge style?",
                  "timestamp": "2022-07-23 14:49:56",
                  "score": 1,
                  "num_children": 0,
                  "author": 238702,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ih97ej8",
      "text": "We will see how their new policy is implemented.  \n\nDon't color me surprised if they figure out how to target different religions without being Overton.\n\nWhite Nat-c's will spend ungodly (literally) amounts of money and time in stuff like this",
      "timestamp": "2022-07-22 23:21:28",
      "score": 3,
      "num_children": 0,
      "author": 243846,
      "replies": []
    },
    {
      "id": "ih9ceb6",
      "text": "I disagree with your shirt Sir but I'll fight to the death your right to wear it! This needs to be said and or heard thousands of times more that it is.",
      "timestamp": "2022-07-22 23:59:42",
      "score": 3,
      "num_children": 0,
      "author": 390685,
      "replies": []
    },
    {
      "id": "ihagn0s",
      "text": "Satanist’s doing the lords work…. Again.",
      "timestamp": "2022-07-23 05:46:30",
      "score": 3,
      "num_children": 0,
      "author": 384316,
      "replies": []
    },
    {
      "id": "ihakj1e",
      "text": "Sort of off-topic, but I'm still baffled at how certain hair colors can be prohibited.  How is a dye-job more distracting than a bowl-cut?  When I was in high school, a dude came to school after trying to shave his fully-grown hair with a straight-razor; his whole head was covered in scrapes and cuts and scabs between patches of hair.  Yet there was a girl with pink hair yanked from class once and I guess forced to dye it black.\n\nUtter madness to me.",
      "timestamp": "2022-07-23 06:31:51",
      "score": 3,
      "num_children": 0,
      "author": 373002,
      "replies": []
    },
    {
      "id": "ihblxca",
      "text": "It’s funny to me how the people who are “constitutional scholars” when it comes to 2nd amendment are completely blind to the concept and universality of the 1st",
      "timestamp": "2022-07-23 13:49:39",
      "score": 3,
      "num_children": 1,
      "author": 314783,
      "replies": [
        {
          "id": "ihc3sf2",
          "text": "This exactly.",
          "timestamp": "2022-07-23 16:03:16",
          "score": 1,
          "num_children": 0,
          "author": 371395,
          "replies": []
        }
      ]
    },
    {
      "id": "ihbt1aw",
      "text": "Good.  You want christianity in school, get ready for satanism and islam.  Can’t discriminate.  All or nothing, bitches.",
      "timestamp": "2022-07-23 14:45:12",
      "score": 3,
      "num_children": 0,
      "author": 369090,
      "replies": []
    },
    {
      "id": "ih8qn3p",
      "text": "This is why my flying spaghetti monster hoodie kicked ass; nobody questioned the meaning, just admired its beauty in confusion.",
      "timestamp": "2022-07-22 21:22:43",
      "score": 6,
      "num_children": 0,
      "author": 205590,
      "replies": []
    },
    {
      "id": "ih9q44q",
      "text": "I like the way France handles this by not allowing students to display any religious symbolism on clothing or jewelry while on school grounds. I also would support public school uniforms like they have in Britain to solve this problem.",
      "timestamp": "2022-07-23 01:47:05",
      "score": 2,
      "num_children": 0,
      "author": 391350,
      "replies": []
    },
    {
      "id": "ihac4n2",
      "text": "Hail SATAN!",
      "timestamp": "2022-07-23 04:58:45",
      "score": 2,
      "num_children": 0,
      "author": 392595,
      "replies": []
    },
    {
      "id": "ihaeta0",
      "text": "Hays is nowheresville, but you can get an unbelievable steak up the street at Meridy’s in Russell.",
      "timestamp": "2022-07-23 05:26:34",
      "score": 2,
      "num_children": 0,
      "author": 304041,
      "replies": []
    },
    {
      "id": "ihaghnp",
      "text": "Sue Sue sue.....get a nice payday",
      "timestamp": "2022-07-23 05:44:53",
      "score": 2,
      "num_children": 0,
      "author": 270906,
      "replies": []
    },
    {
      "id": "ihb4vk5",
      "text": "Satanist to the rescue yet again",
      "timestamp": "2022-07-23 11:00:10",
      "score": 2,
      "num_children": 0,
      "author": 359635,
      "replies": []
    },
    {
      "id": "ihbsb3q",
      "text": "well done satanists, one religion that i actually admire",
      "timestamp": "2022-07-23 14:39:42",
      "score": 2,
      "num_children": 1,
      "author": 116442,
      "replies": [
        {
          "id": "iidmbm3",
          "text": "[deleted]",
          "timestamp": "2022-07-31 13:11:53",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "iidmydu",
              "text": "oh no i don't believe in any gods whatsoever, and no i also don't buy that satan is a real thing, however i do share the same sentiment as those satanists in terms of protecting personal and individual freedom, i also like some of their satanic statements even though they are man-made still",
              "timestamp": "2022-07-31 13:17:36",
              "score": 0,
              "num_children": 1,
              "author": 116442,
              "replies": [
                {
                  "id": "iidnejq",
                  "text": "[deleted]",
                  "timestamp": "2022-07-31 13:21:34",
                  "score": 0,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iido8ej",
                      "text": "oh my actual/real name is very islamic, i don't really like to be associated with islam since their teachings are so authoritative, atheistic satanism on the other hand adopts the idea of individual and personal freedom whilst still maintaining that satan is not real, the name Beelzebub is more of a thing i took for myself to stop people irl from thinking that I'm a muslim (I don't take western names since they associate me with christianity), yes I don't believe in satan as a real thing however i do agree with some of their ideals that are primarily focused on personal freedom, i abandon all other ideas that are authoritarian from them, so... atheists not believing satan? true, atheists won't ever agree with the ideals of atheistic satanis? not true",
                      "timestamp": "2022-07-31 13:28:47",
                      "score": 0,
                      "num_children": 0,
                      "author": 116442,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ihc59p3",
      "text": "bro wtf why the hell are you satanic? are you praying to the devil or some shit",
      "timestamp": "2022-07-23 16:13:47",
      "score": 2,
      "num_children": 0,
      "author": 214255,
      "replies": []
    },
    {
      "id": "ih8812g",
      "text": "Now they have enough time to organize everyone to drive the family out of town.",
      "timestamp": "2022-07-22 19:20:40",
      "score": 5,
      "num_children": 0,
      "author": 363557,
      "replies": []
    },
    {
      "id": "ih7rhtf",
      "text": "Satanism doesn't involve faith. Satanists don't believe in the supernatural or any gods.",
      "timestamp": "2022-07-22 17:33:06",
      "score": -57,
      "num_children": 15,
      "author": 306760,
      "replies": [
        {
          "id": "ih7sw6t",
          "text": "Organized religion doesn't require any belief in the supernatural or god(s). They're basically like fruity little clubs.",
          "timestamp": "2022-07-22 17:42:00",
          "score": 55,
          "num_children": 0,
          "author": 344031,
          "replies": []
        },
        {
          "id": "ih7sotx",
          "text": "True, but shouldn’t satanists be allowed to express their their principles and wear their symbology the same as any other religion, faith, credo, or ideology?  I’m sure you agree given your clarification of most adherents of satanism not being theists, but I think it’s important that atheists and satanists be allowed to express their ideas and chosen symbols the same as theists. While I’m just an skeptical agnostic theist who doesn’t feel the need to publicly display that to the world and does’t really have a symbol to express that, I should be allowed to if I decide to or adopt/create a symbol that expresses it.",
          "timestamp": "2022-07-22 17:40:42",
          "score": 33,
          "num_children": 0,
          "author": 367371,
          "replies": []
        },
        {
          "id": "ih7vvr6",
          "text": "Depends on the type of Satanist. Satanic Temple adherents don't have faith.\n\nEDIT: I am just talking about faith - belief without evidence. Not about whether they believe in a literal Satan. OP is the one who said Satanists don't believe in any gods.\n\nEDIT 2: No, I'm talking about Faith (https://en.wikipedia.org/wiki/Faith#Epistemological_validity):\n\n> Religious people often think of faith as confidence based on a perceived degree of warrant,[4][5] while others who are more skeptical of religion tend to think of faith as simply belief without evidence.\n\nWhile it might be more complicated than belief without evidence, it is certainly confidence without the kind of reliable evidence other means of thinking represent. Though faith is sometimes also simply defined as:\n\n> complete trust or confidence in someone or something.\n\n> strong belief in God or in the doctrines of a religion, based on spiritual apprehension rather than proof.\n\n(Google and https://languages.oup.com/google-dictionary-en)\n\nOr (https://www.merriam-webster.com/dictionary/faith):\n\n> a(1): belief and trust in and loyalty to God\n\n> (2): belief in the traditional doctrines of a religion\n\n> b(1): firm belief in something for which there is no proof\n\n> clinging to the faith that her missing son would one day return\n\n> (2): complete trust",
          "timestamp": "2022-07-22 18:01:20",
          "score": 21,
          "num_children": 4,
          "author": 64183,
          "replies": [
            {
              "id": "ih7y7r2",
              "text": "And I certainly don't have faith in people Doing The Right Thing. Let's not any of us depend upon faith for anything important.",
              "timestamp": "2022-07-22 18:16:35",
              "score": 10,
              "num_children": 1,
              "author": 250569,
              "replies": [
                {
                  "id": "ih7yczw",
                  "text": "Of course. Faith is an unreliable epistemology. It's false and at times dangerous.",
                  "timestamp": "2022-07-22 18:17:31",
                  "score": 12,
                  "num_children": 0,
                  "author": 64183,
                  "replies": []
                }
              ]
            },
            {
              "id": "ih809hy",
              "text": "Sure I do! I have faith that the successes of science and reason will someday allow for a better, more humane future, unshackled from the destruction wrought by greed that we see today. And trust me, that belief requires a **loooooooooot** of faith anymore.",
              "timestamp": "2022-07-22 18:29:49",
              "score": 10,
              "num_children": 0,
              "author": 203937,
              "replies": []
            },
            {
              "id": "ih81yun",
              "text": "Neither does the Church of Satan. The only people who believe in a literal Satan are christians.",
              "timestamp": "2022-07-22 18:41:01",
              "score": 6,
              "num_children": 0,
              "author": 189674,
              "replies": []
            },
            {
              "id": "ih8y9le",
              "text": "> I am just talking about faith - belief without evidence.\n\nYou're talking about one specific type of faith: blind faith.",
              "timestamp": "2022-07-22 22:15:08",
              "score": 4,
              "num_children": 0,
              "author": 345655,
              "replies": []
            }
          ]
        },
        {
          "id": "ih8ebqi",
          "text": ">Satanism doesn't involve faith. Satanists don't believe in the supernatural or any gods.\n\nSo?",
          "timestamp": "2022-07-22 20:02:04",
          "score": 9,
          "num_children": 0,
          "author": 365038,
          "replies": []
        },
        {
          "id": "ih82o98",
          "text": "You should look up the definition of religion, and what the IRS considers a religion.",
          "timestamp": "2022-07-22 18:45:35",
          "score": 6,
          "num_children": 0,
          "author": 62,
          "replies": []
        },
        {
          "id": "ih890gs",
          "text": "Exactly, I have faith in the existence of reality even if my experience is only a group of senses my body uses to navigate through what we call life. My faith is that religion and governments have controlled people throughout history and limited their freedoms. My faith teaches that we deserve body autonomy and the choice to live how we want as long as it does no harm to others.",
          "timestamp": "2022-07-22 19:27:05",
          "score": 6,
          "num_children": 0,
          "author": 55143,
          "replies": []
        },
        {
          "id": "ih8kv6b",
          "text": "So why ban Satanist clothing ?",
          "timestamp": "2022-07-22 20:45:01",
          "score": 5,
          "num_children": 0,
          "author": 162814,
          "replies": []
        },
        {
          "id": "ih8l0h3",
          "text": "/r/lostredditors \n\nYou're singing our song.",
          "timestamp": "2022-07-22 20:45:58",
          "score": 5,
          "num_children": 0,
          "author": 243723,
          "replies": []
        },
        {
          "id": "ih8uxvx",
          "text": "Neither does Buddhism. \n\nReligion is more than just variations on Christianity.",
          "timestamp": "2022-07-22 21:51:52",
          "score": 3,
          "num_children": 0,
          "author": 338748,
          "replies": []
        },
        {
          "id": "ih8cvdo",
          "text": "I do",
          "timestamp": "2022-07-22 19:52:26",
          "score": 2,
          "num_children": 0,
          "author": 38985,
          "replies": []
        },
        {
          "id": "ih8y1jb",
          "text": "A lot of people use \"faith\" as a synonym for religion. They probably shouldn't, though.\n\nIt's fine to have faith. You have faith in all sorts of things. When you walk out your front door, you have faith that the ground outside is solid and not an illusion that you will plummet through to your death.\n\nFaith based on knowledge and experience is good. Faith based on superstition is problematic.",
          "timestamp": "2022-07-22 22:13:31",
          "score": 2,
          "num_children": 0,
          "author": 345655,
          "replies": []
        },
        {
          "id": "ih99m43",
          "text": "How could you possibly prove that?",
          "timestamp": "2022-07-22 23:38:08",
          "score": 2,
          "num_children": 0,
          "author": 103452,
          "replies": []
        },
        {
          "id": "ih9oz0b",
          "text": "Satanists believe that they are their own god.",
          "timestamp": "2022-07-23 01:37:59",
          "score": 2,
          "num_children": 0,
          "author": 330444,
          "replies": []
        },
        {
          "id": "ihheges",
          "text": "What's with the downvotes?",
          "timestamp": "2022-07-24 19:14:07",
          "score": 1,
          "num_children": 0,
          "author": 306760,
          "replies": []
        },
        {
          "id": "ih81qaw",
          "text": "[removed]",
          "timestamp": "2022-07-22 18:39:28",
          "score": -13,
          "num_children": 1,
          "replies": [
            {
              "id": "ih8fj8h",
              "text": "The no-true-Scotsman fallacy. Look it up. And then stop using it.",
              "timestamp": "2022-07-22 20:10:07",
              "score": 8,
              "num_children": 1,
              "author": 278461,
              "replies": [
                {
                  "id": "ih8hdj2",
                  "text": "The Satan worshipper has a point. Satanism has been about following the occult regarding Satan, up until the 90’s or so from my perspective. New Satanists are really just Atheists or Agnostics.",
                  "timestamp": "2022-07-22 20:22:17",
                  "score": -1,
                  "num_children": 2,
                  "author": 302102,
                  "replies": [
                    {
                      "id": "ih8vrtk",
                      "text": "I mean, just because you’ve been steeped in satanic panic doesn’t mean modern Satanism hasn’t been around since 1969. https://www.vox.com/platform/amp/culture/22358153/satanic-panic-ritual-abuse-history-conspiracy-theories-explained",
                      "timestamp": "2022-07-22 21:57:37",
                      "score": 8,
                      "num_children": 0,
                      "author": 338748,
                      "replies": []
                    },
                    {
                      "id": "ih9xrgb",
                      "text": "Satanism wasn't a real thing before the early 70s. It was a boogeyman and a way for the occasional preacher's kid to act out. Satanists worshiping a literal Satan has never had currency in the US.",
                      "timestamp": "2022-07-23 02:48:31",
                      "score": 3,
                      "num_children": 0,
                      "author": 318636,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ih82psg",
      "text": "Beautiful",
      "timestamp": "2022-07-22 18:45:52",
      "score": 1,
      "num_children": 0,
      "author": 311290,
      "replies": []
    },
    {
      "id": "ih8dd6p",
      "text": "*laughs in Nelson*",
      "timestamp": "2022-07-22 19:55:44",
      "score": 1,
      "num_children": 0,
      "author": 157740,
      "replies": []
    },
    {
      "id": "ih8mxmf",
      "text": "It's either \"good for all\" or \"not good for anyone.\"",
      "timestamp": "2022-07-22 20:58:27",
      "score": 1,
      "num_children": 0,
      "author": 281448,
      "replies": []
    },
    {
      "id": "ih8y7un",
      "text": "Boom!",
      "timestamp": "2022-07-22 22:14:47",
      "score": 1,
      "num_children": 0,
      "author": 259477,
      "replies": []
    },
    {
      "id": "ih8ydx9",
      "text": "Car",
      "timestamp": "2022-07-22 22:15:59",
      "score": 1,
      "num_children": 0,
      "author": 140895,
      "replies": []
    },
    {
      "id": "ih92xgq",
      "text": "School board member seemed pretty level headed about it.",
      "timestamp": "2022-07-22 22:48:31",
      "score": 1,
      "num_children": 0,
      "author": 174961,
      "replies": []
    },
    {
      "id": "ih9bby2",
      "text": "Let's gooooo!",
      "timestamp": "2022-07-22 23:51:22",
      "score": 1,
      "num_children": 0,
      "author": 247860,
      "replies": []
    },
    {
      "id": "ih9dlhg",
      "text": "Their arguments are always spot on! 😎",
      "timestamp": "2022-07-23 00:09:01",
      "score": 1,
      "num_children": 0,
      "author": 116043,
      "replies": []
    },
    {
      "id": "ih9eukc",
      "text": "I assumed that their response to someone bringing up a law who wasn't Christian was them sticking their fingers in their ears and going \"LA LA LA CAN'T HEAR YOU AND THEREFORE CANNOT LEGISLATE ANYTHING LA LA LA\" really loud. Instead, they go to the trouble of pretending to consider their complaints for a moment! That must be that \"southern hospitality\" they're famous for!",
      "timestamp": "2022-07-23 00:18:51",
      "score": 1,
      "num_children": 0,
      "author": 175090,
      "replies": []
    },
    {
      "id": "ih9jjhn",
      "text": "\"They do good work in Kansas.\"",
      "timestamp": "2022-07-23 00:55:21",
      "score": 1,
      "num_children": 0,
      "author": 68786,
      "replies": []
    },
    {
      "id": "ih9qkae",
      "text": "Mission Viejo HS had a diablo (devil) mascot and the cartoon devil was removed and replaced with a Bulldog named Diablo. That is discrimination too.",
      "timestamp": "2022-07-23 01:50:38",
      "score": 1,
      "num_children": 1,
      "author": 147768,
      "replies": [
        {
          "id": "ih9y510",
          "text": "The high school I went to was built on land donated by the guy who owned red devil paint, and as a result, our mascot was the red Devil.  Yes, students tried to change it in my senior year. No it didn’t work. I wonder if they’re still the red Devils.\n\nEdit: yes, they are, and the school newspaper is now called the devils advocate! I don’t think it was back when I was there, but that’s pretty awesome.",
          "timestamp": "2022-07-23 02:51:33",
          "score": 6,
          "num_children": 2,
          "author": 244328,
          "replies": [
            {
              "id": "iha2l2s",
              "text": "That’s the best name for a paper",
              "timestamp": "2022-07-23 03:29:25",
              "score": 3,
              "num_children": 1,
              "author": 219783,
              "replies": [
                {
                  "id": "iha3oif",
                  "text": "I guess all assignments are due on the devils due date.",
                  "timestamp": "2022-07-23 03:39:00",
                  "score": 1,
                  "num_children": 0,
                  "author": 244328,
                  "replies": []
                }
              ]
            },
            {
              "id": "ihbe5ur",
              "text": "My school newspaper was The Optimist. Vomit.",
              "timestamp": "2022-07-23 12:40:49",
              "score": 1,
              "num_children": 0,
              "author": 286151,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ih9z4lq",
      "text": "Is that not the most obvious violation of the Free Exercise Clause?",
      "timestamp": "2022-07-23 02:59:54",
      "score": 1,
      "num_children": 0,
      "author": 215712,
      "replies": []
    },
    {
      "id": "iha00g6",
      "text": "Good",
      "timestamp": "2022-07-23 03:07:17",
      "score": 1,
      "num_children": 0,
      "author": 214903,
      "replies": []
    },
    {
      "id": "iha1du8",
      "text": "LMFAO..",
      "timestamp": "2022-07-23 03:18:59",
      "score": 1,
      "num_children": 0,
      "author": 313665,
      "replies": []
    },
    {
      "id": "iha9jhj",
      "text": "How do Satanists dress?",
      "timestamp": "2022-07-23 04:33:06",
      "score": 1,
      "num_children": 0,
      "author": 184663,
      "replies": []
    },
    {
      "id": "ihalhux",
      "text": "\"the kids are alright!\"",
      "timestamp": "2022-07-23 06:43:31",
      "score": 1,
      "num_children": 0,
      "author": 334604,
      "replies": []
    },
    {
      "id": "ihatuor",
      "text": "Them Satanic rascals are at it again!\n\nEdit: Ooh, good band name.",
      "timestamp": "2022-07-23 08:31:51",
      "score": 1,
      "num_children": 0,
      "author": 271239,
      "replies": []
    },
    {
      "id": "ihav7lk",
      "text": "Hail satan",
      "timestamp": "2022-07-23 08:50:17",
      "score": 1,
      "num_children": 0,
      "author": 305621,
      "replies": []
    },
    {
      "id": "ihb8hh8",
      "text": "Hail Satan.",
      "timestamp": "2022-07-23 11:42:36",
      "score": 1,
      "num_children": 0,
      "author": 413233,
      "replies": []
    },
    {
      "id": "ihbggpv",
      "text": "It is.\n\nIts amazing how the right wing Evangelicals, the Republicans Party don’t seem to understands that concept…\n\nBut what really bothers me is…They understand just fine they just think their religion gives them exemptions and privileges. “Hah! Stupid Satan worshipers, he’s evil…oh look that’s cute that person over there thinks Mohamed is the prophet. I need to go tell them both about Jesus “\n\n“Oh Good morning Susan, ah ‘Jesus is lord’ what a lovely t-shirt, Amen, Amen Susan…”\n\n“Mr Harrison, Thomas has Satan is rad shirt on…”\n\n“What!? Disgusting, the devil is evil! He’s just trying to mock us Susan because we know Jesus and the truth”",
      "timestamp": "2022-07-23 13:02:20",
      "score": 1,
      "num_children": 0,
      "author": 83006,
      "replies": []
    },
    {
      "id": "ihbkpqx",
      "text": "Isn't that the wrong fight, though? No god, no Satan. Fighting for Satanic representation is really fighting for Christian representation, or really religious representation. \n\nOur is this a free speech fight?",
      "timestamp": "2022-07-23 13:39:32",
      "score": 1,
      "num_children": 1,
      "author": 35543,
      "replies": [
        {
          "id": "iheh87h",
          "text": "You can't just ban all fictional characters. Discussing stories is what we do. I'm not gonna start actually referring to Voldemort as \"you-know-who.\" \n\nIf you want to ban religious figures or imagery only, I'm gonna need that precise definition of \"religion,\" a thing that already famous for eluding precise definitions.",
          "timestamp": "2022-07-24 02:46:17",
          "score": 1,
          "num_children": 0,
          "author": 327378,
          "replies": []
        }
      ]
    },
    {
      "id": "ihbmuji",
      "text": "Correct",
      "timestamp": "2022-07-23 13:57:11",
      "score": 1,
      "num_children": 0,
      "author": 139119,
      "replies": []
    },
    {
      "id": "ihbp2wz",
      "text": "I remember I couldn't even get away with wearing a Slayer shirt in HS",
      "timestamp": "2022-07-23 14:15:03",
      "score": 1,
      "num_children": 0,
      "author": 215998,
      "replies": []
    },
    {
      "id": "ihbq06q",
      "text": "It’s Kansas.  No one’s going to change shit.",
      "timestamp": "2022-07-23 14:22:08",
      "score": 1,
      "num_children": 0,
      "author": 139904,
      "replies": []
    },
    {
      "id": "ihbyyyn",
      "text": "Uniforms force people to relate to one another with their own ideas.",
      "timestamp": "2022-07-23 15:28:39",
      "score": 1,
      "num_children": 0,
      "author": 297974,
      "replies": []
    },
    {
      "id": "ihbzpb1",
      "text": "Just wear the school uniform so you're  all the same",
      "timestamp": "2022-07-23 15:34:01",
      "score": 1,
      "num_children": 0,
      "author": 174676,
      "replies": []
    },
    {
      "id": "ihe79z5",
      "text": "How about no religious clothing at all? I don’t think I want my kid seeing hail satan at school or being told he has to believe in blah blah religion",
      "timestamp": "2022-07-24 01:24:42",
      "score": 1,
      "num_children": 1,
      "author": 64133,
      "replies": [
        {
          "id": "ihegw8o",
          "text": "I think that's kinda the point.",
          "timestamp": "2022-07-24 02:43:28",
          "score": 1,
          "num_children": 0,
          "author": 318636,
          "replies": []
        }
      ]
    },
    {
      "id": "ik5il6a",
      "text": "The Satanic Temple are not Satanists. They are a political organization that seeks attention on the coattails of Satanism.\n\nLeave us out of it.",
      "timestamp": "2022-08-13 17:40:46",
      "score": 1,
      "num_children": 0,
      "author": 338753,
      "replies": []
    },
    {
      "id": "ihbiv9b",
      "text": "Come do that in Eastern Europe, no amount of degenerates can protect you.",
      "timestamp": "2022-07-23 13:23:43",
      "score": -2,
      "num_children": 0,
      "author": 311706,
      "replies": []
    },
    {
      "id": "ih7z62e",
      "text": "they're posers though",
      "timestamp": "2022-07-22 18:22:42",
      "score": -48,
      "num_children": 2,
      "replies": [
        {
          "id": "ih842no",
          "text": "they are, thats the point",
          "timestamp": "2022-07-22 18:54:43",
          "score": 16,
          "num_children": 0,
          "author": 90900,
          "replies": []
        },
        {
          "id": "ih8gkkq",
          "text": "How is that different from any other religion lol",
          "timestamp": "2022-07-22 20:17:00",
          "score": 15,
          "num_children": 0,
          "author": 77213,
          "replies": []
        }
      ]
    },
    {
      "id": "ih9cku3",
      "text": "for a place called Atheism you all sure do like posting about Satanism here....maybe a rename is in order?",
      "timestamp": "2022-07-23 00:01:05",
      "score": -34,
      "num_children": 3,
      "author": 179024,
      "replies": [
        {
          "id": "ih9ibqc",
          "text": "This is because Satanism is one of the largest atheistic religions in the US! It helps that it's certainly one of the strongest advocates for religious freedom and equity on the local level there, something atheists as a whole stand to benefit from.\n\nChanging the sub name would be like changing the theism subreddit to just Christianity. Way to ignore the irreligious (a)theists!",
          "timestamp": "2022-07-23 00:45:52",
          "score": 20,
          "num_children": 0,
          "author": 409723,
          "replies": []
        },
        {
          "id": "ih9zp17",
          "text": "Satan was invented by the same men who made up god. Watching Christians lose their shit over the mythical creatures of their own creation is funny, that's why atheists bring it up. No atheists believe in Satan.",
          "timestamp": "2022-07-23 03:04:37",
          "score": 7,
          "num_children": 0,
          "author": 24079,
          "replies": []
        },
        {
          "id": "iha0ew6",
          "text": "\"The mission of The Satanic Temple, a religious organization, is to encourage benevolence and empathy among all people, reject tyrannical authority, advocate practical common sense, oppose injustice, and undertake noble pursuits.\"",
          "timestamp": "2022-07-23 03:10:45",
          "score": 5,
          "num_children": 0,
          "author": 177324,
          "replies": []
        }
      ]
    },
    {
      "id": "ih9qkcl",
      "text": "If you call yourself an atheist but support satanism ur a fucjing idiot",
      "timestamp": "2022-07-23 01:50:39",
      "score": -36,
      "num_children": 5,
      "author": 382485,
      "replies": [
        {
          "id": "ih9x2hu",
          "text": "i think you may mistakenly believe that satanism = theistic satanism\n\ndo some googling, friend",
          "timestamp": "2022-07-23 02:42:50",
          "score": 8,
          "num_children": 0,
          "author": 221937,
          "replies": []
        },
        {
          "id": "ih9znya",
          "text": "Modern day Satanism, especially The Satanic Temple, is about humanism, not the christian \"devil.\"  Pretty much everyone knows that... except, apparently, you.\n\n\"The mission of The Satanic Temple, a religious organization, is to encourage benevolence and empathy among all people, reject tyrannical authority, advocate practical common sense, oppose injustice, and undertake noble pursuits.\"",
          "timestamp": "2022-07-23 03:04:23",
          "score": 11,
          "num_children": 0,
          "author": 177324,
          "replies": []
        },
        {
          "id": "ihaptpe",
          "text": "Most satanist don't believe in satan. Christians believe in satan. Just fucking google before making dumb comments, kiddo.",
          "timestamp": "2022-07-23 07:38:08",
          "score": 5,
          "num_children": 0,
          "author": 127883,
          "replies": []
        },
        {
          "id": "ihax8sn",
          "text": "As a Christian I think you’re the fucking idiot who doesn’t let others worship what they want in peace dipshit. I support all religions to be freely worshipped!!!",
          "timestamp": "2022-07-23 09:18:22",
          "score": 2,
          "num_children": 0,
          "author": 279660,
          "replies": []
        },
        {
          "id": "ihbwxex",
          "text": "Why is there always one of you in the comments. A quick google on a topic you know nothing about would have prevented this embarrassing statement.",
          "timestamp": "2022-07-23 15:13:47",
          "score": 1,
          "num_children": 0,
          "author": 190792,
          "replies": []
        }
      ]
    },
    {
      "id": "ihak2gx",
      "text": "[removed]",
      "timestamp": "2022-07-23 06:26:14",
      "score": -21,
      "num_children": 1,
      "replies": [
        {
          "id": "ihbm15o",
          "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
          "timestamp": "2022-07-23 13:50:30",
          "score": 1,
          "num_children": 0,
          "author": 136356,
          "replies": []
        }
      ]
    },
    {
      "id": "iha6b8g",
      "text": "Wait a second! I thought this was atheism not satanism. You should not believe in satam if youre an atheist, right? If you dont believe in satan why call it satanism?",
      "timestamp": "2022-07-23 04:02:36",
      "score": -17,
      "num_children": 2,
      "author": 70009,
      "replies": [
        {
          "id": "iha6s57",
          "text": "Satanists don't believe in Satan",
          "timestamp": "2022-07-23 04:06:59",
          "score": 17,
          "num_children": 1,
          "author": 268206,
          "replies": [
            {
              "id": "ihdl5kq",
              "text": "Exactly dosent that seem silly to call yourself a satanist then? Its all asthetic to piss off your parents lol really probably the easiest \"religion\" to write off because its self admitted as not one. Satanism the non religious religon lol its like saying your a nazi when you're not a nazi, well whats the point of calling yourself a nazi to piss people off? You dont think that is transparent? \n\nHowever if he did exist and their was a satanic religion they still would say he isnt real because if he exists he cannot function while people kow he is real. So really it dosent matter what you say it can be interpreted as evil or dumb as fuck. Have a blast! I think its hilarious.",
              "timestamp": "2022-07-23 22:29:27",
              "score": 0,
              "num_children": 0,
              "author": 70009,
              "replies": []
            }
          ]
        },
        {
          "id": "ihbe2b6",
          "text": "To trigger people. Looks like it worked again.",
          "timestamp": "2022-07-23 12:39:53",
          "score": 4,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "ih8puy6",
      "text": "Now we need to create a new religion called \"gang related\"",
      "timestamp": "2022-07-22 21:17:37",
      "score": -16,
      "num_children": 0,
      "author": 66360,
      "replies": []
    },
    {
      "id": "ihb1eez",
      "text": "They should have kept the ban. Religion and Datan is two different things",
      "timestamp": "2022-07-23 10:15:20",
      "score": -6,
      "num_children": 0,
      "author": 325629,
      "replies": []
    }
  ]
}