{
  "id": "w6lqpg",
  "text": "Seriously, shut the fuck up.\n",
  "timestamp": "2022-07-24 03:16:51",
  "score": 612,
  "subreddit": "t5_2zaj2",
  "num_children": 24,
  "replies": [
    {
      "id": "ihf04rb",
      "text": "Agreed. Shut the fuck up.",
      "timestamp": "2022-07-24 05:48:07",
      "score": 43,
      "num_children": 0,
      "author": 304158,
      "replies": []
    },
    {
      "id": "ihepyqb",
      "text": "Masculine characteristics are sexy .",
      "timestamp": "2022-07-24 04:03:52",
      "score": 26,
      "num_children": 0,
      "author": 91706,
      "replies": []
    },
    {
      "id": "ihes5lt",
      "text": "Bitch really thinks she can teach me(a man)how to be masculine",
      "timestamp": "2022-07-24 04:24:41",
      "score": 56,
      "num_children": 1,
      "author": 407015,
      "replies": [
        {
          "id": "il5fj22",
          "text": "I find it funny how men think women controlled masculinity from the previous centuries",
          "timestamp": "2022-08-21 03:31:05",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ihevndo",
      "text": "You can be certain a woman's definition of masculinity is only to her benefit and advantage, never yours...",
      "timestamp": "2022-07-24 04:59:36",
      "score": 54,
      "num_children": 0,
      "author": 207855,
      "replies": []
    },
    {
      "id": "ihfc0dw",
      "text": "Yeah they never really quite get to that point of logic when they’re talking about appropriation and how a man can never understand what it’s like to be a woman.",
      "timestamp": "2022-07-24 08:18:04",
      "score": 13,
      "num_children": 0,
      "author": 104276,
      "replies": []
    },
    {
      "id": "ihfpzea",
      "text": "Don't care about how they like you, care about how you like yourself",
      "timestamp": "2022-07-24 11:26:38",
      "score": 7,
      "num_children": 1,
      "author": 356196,
      "replies": [
        {
          "id": "ihg29hp",
          "text": "Preach",
          "timestamp": "2022-07-24 13:30:07",
          "score": 5,
          "num_children": 1,
          "replies": [
            {
              "id": "ihh81cv",
              "text": "Ok",
              "timestamp": "2022-07-24 18:28:42",
              "score": 4,
              "num_children": 0,
              "author": 356196,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ihh5dmf",
      "text": "I know right! Anything starting with “If you where A real man…” you know it’s bullshit",
      "timestamp": "2022-07-24 18:10:01",
      "score": 8,
      "num_children": 0,
      "author": 285864,
      "replies": []
    },
    {
      "id": "ihf8gxq",
      "text": "Hey I’m in that group lol\n\nIt’s actually a pretty chill place 95% of the time",
      "timestamp": "2022-07-24 07:31:20",
      "score": 8,
      "num_children": 0,
      "author": 403255,
      "replies": []
    },
    {
      "id": "ihg23x6",
      "text": "what difines a man should be a observation rather than a list of requirements",
      "timestamp": "2022-07-24 13:28:48",
      "score": 6,
      "num_children": 0,
      "author": 27702,
      "replies": []
    },
    {
      "id": "iheog06",
      "text": "Good one",
      "timestamp": "2022-07-24 03:49:47",
      "score": 19,
      "num_children": 0,
      "author": 329902,
      "replies": []
    },
    {
      "id": "ihh0vfs",
      "text": "Yeah but I also think that when it comes to an individual man's masculinity, no one, male or female, should comment on it",
      "timestamp": "2022-07-24 17:38:53",
      "score": 5,
      "num_children": 1,
      "author": 42408,
      "replies": [
        {
          "id": "ihhpa9y",
          "text": "Agreed.",
          "timestamp": "2022-07-24 20:30:04",
          "score": 3,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ihi1xfj",
      "text": "Femcel right there lol",
      "timestamp": "2022-07-24 21:58:20",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ihf8nwf",
      "text": "The entire notion of 'masculinity' is total nonsense. What is 'masculine' in one part of the world might not be in others. What is expected of a man from Java is not what is expected of a man from Australia. Things like hunting, bushcrafting, tanning hides, etc., which are typically considered 'masculine' in the Western world is just a unisex task for folks in third-world countries. In this similar vein, what is a 'woman'? What 'woman' is in the Sub-Saharan regions is not what 'woman' is in America. \n\n'What is a man?!' asks Dracula. 'A miserable little pile of harmful and oppressive stereotypes that need a major overhaul.'",
      "timestamp": "2022-07-24 07:33:51",
      "score": 13,
      "num_children": 1,
      "replies": [
        {
          "id": "ihfd2h8",
          "text": "Being a man or woman begins and ends with having male or female gametes while belonging to the homo genus.",
          "timestamp": "2022-07-24 08:32:22",
          "score": 15,
          "num_children": 1,
          "author": 48705,
          "replies": [
            {
              "id": "ihfd939",
              "text": "No. Being MALE or FEMALE does. Being a 'man' or a 'woman' is shaped by a myriad of things.",
              "timestamp": "2022-07-24 08:34:53",
              "score": 1,
              "num_children": 2,
              "replies": [
                {
                  "id": "ihffwdh",
                  "text": "Your overcomplicating a simple categorization and applying biased correlation. Male and Female are non specific terms for all species.",
                  "timestamp": "2022-07-24 09:11:18",
                  "score": 10,
                  "num_children": 1,
                  "author": 48705,
                  "replies": [
                    {
                      "id": "ihfgbrz",
                      "text": "The world is complex. 'Male' and 'female' is not always applicable to 'all species', as you claim, and even in those cases wherein it applies, there are complexities as to what it is or what it entails. If you have a problem with trans-people, why not just say it outright in plainspeak and not attempt to disguise bigotry as flawed 'logic' that doesn't hold up to any proper scrutiny?",
                      "timestamp": "2022-07-24 09:17:19",
                      "score": -6,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ihfhits",
                          "text": "Not all species reproduce through sex, thereby making the categorization inapplicable to some, The traits that are common to the sexes are generally correlative particularly in our genus.",
                          "timestamp": "2022-07-24 09:34:11",
                          "score": 9,
                          "num_children": 1,
                          "author": 48705,
                          "replies": [
                            {
                              "id": "ihfi28h",
                              "text": "I am not arguing against the validity of sex as it applies to genus homo. But genus homo is not comprised EXCLUSIVELY of their sex, nor is their sex the sum total of their being. Being that humans are complex creatures, to 'essentialise' a person's being exclusively through sex alone, and to debate over the 'validity' of various iterations of human identity is not only blatantly reductionist / sexist, but it is an excellent exercise at bigotry disguising itself as 'concern' or 'rationality'. 100 years ago, the same argument was held for whether or not non-Caucasoid humans were 'human'. Nowadays, the sights are turned to whether or not 'transgenders' are 'human', 'real' or 'sound of mind'. If their lives don't interfere with your capacity to go about your day unimpeded, and if they do not infringe on your own rights and privileges, why should you give so many fucks about what they are, aren't, or should be?",
                              "timestamp": "2022-07-24 09:41:45",
                              "score": -1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "ihfkvog",
                                  "text": "You seem to be confused as I've repeatedly stated that sex doesn't speak to anything outside of what gametes your body is intended to produce. While failing to realize your operating under the same logical fallacies that helped rationalize the very things you claim to be against. I'm not against trans people, however the reality is that we cannot change our sex/gender currently. If anything there should be support for the gene therapy to make it so that we can actually transition people in more than superficial and half-assed ways. Though if they still would like to go with the available surgery/therapy then that's their choice and their right. Your a deluded, self-aggrandizing, idiot attempting to pretend as if your imagination is reality and that somehow helps people. Your attempting to attach personality standards and other correlatives to sex and pretending as if we have the capability of changing sex. Your the one attempting to muddy the water by overcomplicating the topic and continuing to act as if I'm arguing something that I've repeatedly demonstrated is irrelevant to the topic at hand and that in much of this I agree with you on. Sex is relative to your identity but it is just one facet that correctly dealing with is almost entirely subjective.",
                                  "timestamp": "2022-07-24 10:21:15",
                                  "score": 3,
                                  "num_children": 1,
                                  "author": 48705,
                                  "replies": [
                                    {
                                      "id": "ihfncid",
                                      "text": "Why don't you spell it out clearer? No matter how much you deny your transphobia, it's all over the place with self-contradictory statements like 'I am not against trans people,' doubled-down with 'you're a [they] are a deluded, self-aggrandising, idiot attempting to pretend as if your [their] imagination is reality'. Why don't you just say what you really mean and quit all of the bollocks? You're plain as day. \n\nCurrent medical science CAN and DOES have the capacity to change one's physical appearance to better conform to one's psychological sense of personhood. Medical science has been doing that since the early 1950s. What you are insisting upon is that for a trans person to be 'real' or 'valid' they must likewise be able to change their BIOLOGICAL SEX, and are further insinuating that they (trans people) are somehow 'deluded' or are 'in denial' of the REALITY of biological sex. The first imposition is preposterous and currently medically impossible (like you said), and the second is an outright fallacy (because they are very well aware of the reality of biological sex. If that shit were not in any way 'real', their attempts to transition OUT of that sex and its associated aspects wouldn't even manifest itself). Why don't you say what you really mean? 'The only time I will ever consider trans people to be 'real' is when they are nothing short of the biological sex they 'claim' to be'? They can be all sorts of 'unreal' to you because of arbitrary parameters YOU yourself set up. But you are neither judge, jury, nor executioner to have the last say on their lives or their 'realness'. You're like a pet owner playing at being a licensed veterinarian.\n\nAs for 'muddying the waters', I cannot expect any less of an interpretation from someone who is obviously not in any way capable of understanding the complexities of gender-identity / gender-presentation / sociological manifestations of gender identity because they're nothing more than a bigoted sophist masquerading as a 'logician'. \n\nFor the record, I am not transgender, so you identifying me as belonging to that minority group is a grave assumption. What I AM is an anthropologist and a long-time volunteer / aid in one of the few clinics in my part of Southeast Asia which specialises in gender / gender transition; so between your reductionist opinions that you're trying to pass off as 'logic' and my experience, I most certainly DO KNOW what the bloody hell I am talking about because I deal with this minority group on a regular basis, along with individuals with credentials, exposure, expertise and work-experience that even I would be in awe of. What are you? A keyboard activist with a personal peeve?",
                                      "timestamp": "2022-07-24 10:54:06",
                                      "score": 1,
                                      "num_children": 2,
                                      "replies": [
                                        {
                                          "id": "ihig9u0",
                                          "text": "r/iamverysmart",
                                          "timestamp": "2022-07-24 23:45:19",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 100166,
                                          "replies": []
                                        },
                                        {
                                          "id": "ihfpud6",
                                          "text": "I am a reductionist; that's actually a compliment rather than the insult you seem to think it is. My pet peeve is people like you who think generalized oversimplifications are reality. Who are arguing a sex/gender version of race realism and espousing irrational talking points that have won you social brownie points in your echo chamber; While ignoring my statements and continue to attempt to deny the current substantiated objective reality by intentionally manipulating the subjective nature of communication in order to claim I'm claiming something I've stated I'm not. While assuming that I must be lying and believe things I stated I don't believe.",
                                          "timestamp": "2022-07-24 11:24:57",
                                          "score": 4,
                                          "num_children": 0,
                                          "author": 48705,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ihfftie",
                  "text": "man\r  \n/man/\r\r  \nnoun\r  \n1.\r  \nan adult male human being.\n\nwom·an\r  \n/ˈwo͝omən/\r  \n\rnoun\r  \nan adult female human being.",
                  "timestamp": "2022-07-24 09:10:11",
                  "score": 4,
                  "num_children": 1,
                  "author": 48705,
                  "replies": [
                    {
                      "id": "ihfg24d",
                      "text": "That applies to language / linguistics, but doesn't cover anthropology or history. Your highly reductionist and infantile 'reasoning' fails to encompass the complexity of human identities and is nothing more than an attempt to disguise blatant transphobia as 'logic'.",
                      "timestamp": "2022-07-24 09:13:30",
                      "score": 0,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "ihfgw09",
                          "text": "It's not transphobia. I'm not opposed to body modification however I don't support deluding them and feeding them false sexist propaganda. You clearly don't understand informed consent in medical contexts. Human identities have correlative relations with sex/gender, however Being a Man or being a Woman says nothing about who you are or what you should be. It only describes your Genus and Sex Role. A man can be \"feminine\" and a woman can be \"masculine\" and as long as they do so in constructive ethical ways there's nothing wrong with that. Body modification is a choice people can make that they have the right to and should continue to do so, however your deluded if you believe that that changes your sex. That's a problem we've yet to solve, that likely requires gene therapy. You have no Idea of just how sexist your being believing that it's rational to judge one based on their born characteristics. Not realizing that this same rationality justifies racism, ableism and many other -isms.",
                          "timestamp": "2022-07-24 09:25:14",
                          "score": 3,
                          "num_children": 1,
                          "author": 48705,
                          "replies": [
                            {
                              "id": "ihfhal1",
                              "text": "Are you a registered psychologist or in any capability a doctor which specialises in the field gender / gender dysphoria / behavioural psychology? Or are you in any capacity an anthropologist who has spent a significant period of time studying how identity varies / exists in various complexities throughout a number of different cultures? Could you perhaps be an historian with a background on people and their views of sexuality, gender, and gender relations / dynamics / presentation? Are in any way whatsoever an authority on the field of human identity and its manifestations, or are you just someone with an elementary opinion on matters who believes their opinions to be inviolable truths? If you are any of the former three, then by all means defend your reductionist 'logic' with facts from current medical science, or history, or anthropological studies. If you are the latter, then your words are wind.",
                              "timestamp": "2022-07-24 09:31:00",
                              "score": 1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "ihfhytb",
                                  "text": "Ohh yes the standard ad hominem attempt that doesn't argue against any of my statement and rather attempts to belittle and disregard my person while relying on the vague, subjective nature of language rather than the objective concept we are discussing while continuing to beg the question.",
                                  "timestamp": "2022-07-24 09:40:27",
                                  "score": 5,
                                  "num_children": 1,
                                  "author": 48705,
                                  "replies": [
                                    {
                                      "id": "ihfiapg",
                                      "text": "Not at all. I am asking you for your credentials on the subject matter in the same vein that if you argued physics or surgery against a physicist or a surgeon, when you are neither of those professions, then all of your opinions are ultimately worth less than dog shit. \n\nSo, are you IN ANY CAPACITY WHATSOEVER someone who specialises in any of the fields which deal with matters like gender identity / manifestation of gender in society / dynamics and complexity of gender roles in society / someone who works in healthcare specialising in that specific demographic of people and their healthcare / medical needs?",
                                      "timestamp": "2022-07-24 09:45:02",
                                      "score": 2,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ihfh9s1",
                          "text": "I'm literally arguing that your body doesn't justify a judgment on your personality and ethics. If you want to castrate yourself and have breast implants and go through hormonal therapy that's your right, however it should be explained to you that much of that is superficial and what the actual symptoms the hormonal therapy and removal of one of your primary hormonal glands will have while ensuring that your are of sound mind.",
                          "timestamp": "2022-07-24 09:30:41",
                          "score": 3,
                          "num_children": 1,
                          "author": 48705,
                          "replies": [
                            {
                              "id": "ihfhn1f",
                              "text": "And you believe that there are no current-day parameters which ensure that individuals who undertake gender-transition and whatever other surgeries they may opt for are of sound mind why? Do you work for / are affiliated with / directly associated with clinics which address these matters directly? If so, could you point out exactly which clinics / hospitals have broken the law by not following parameters to ensure that people who undertake gender transition are 100% of sound mind so they can be held accountable for medical malpractice? If you are not, then you are unaware of the stringent parameters set out by the medical industry to ascertain that such an undertaking is not open to 'just anyone', especially not to individuals whose sanity might be in question?",
                              "timestamp": "2022-07-24 09:35:47",
                              "score": 1,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ihf0lgl",
      "text": "Dude dodged the bullet...",
      "timestamp": "2022-07-24 05:53:22",
      "score": 4,
      "num_children": 0,
      "author": 323533,
      "replies": []
    },
    {
      "id": "ihep0sg",
      "text": "It's currently a fairly pointless and arbitrary term? I mean there might be a good reason to create a utopian ideal definition of masculinity and femininity but to actually force and expect those behaviors from a particular sex is toxic, biased nonsense. If a women wants to be masculine then she should be allowed and taught how to be properly masculine just as a man should and the same goes for a man that wants to be feminine.",
      "timestamp": "2022-07-24 03:55:07",
      "score": 9,
      "num_children": 0,
      "author": 48705,
      "replies": []
    },
    {
      "id": "iheuonm",
      "text": "There's a problem with this stance. If it's true, *we* have no say on what it means to be *feminine* and we definitely have opinions on *that* topic.",
      "timestamp": "2022-07-24 04:49:40",
      "score": 6,
      "num_children": 1,
      "author": 211250,
      "replies": [
        {
          "id": "iheus70",
          "text": "No, I'm 100% fine with not having an opinion on what's feminine.  What would I know?\n\nAll we know is our masculine preferences for women, and that's different.  Women should be talking about their feminine preferences for men instead of saying this or that isn't \"real\" masculinity.",
          "timestamp": "2022-07-24 04:50:40",
          "score": 7,
          "num_children": 2,
          "replies": [
            {
              "id": "ihews9x",
              "text": "Okay; define those terms, why it's related to sex and why sexes should be autocratically held to different cognitive standards without regard for their wants and goals.",
              "timestamp": "2022-07-24 05:11:29",
              "score": 1,
              "num_children": 1,
              "author": 48705,
              "replies": [
                {
                  "id": "ihex7yb",
                  "text": "Your gender expression is emergent, so you can have a relationship with your manhood without necessarily needing a bunch of ideas and concepts about masculinity as a guiding paradigm.  Those concepts would always be an abstraction, whereas your own masculinity is deeply intimate to your lived experience.\n\nYet, when you engage with the opposite sex, you don't have any emergent experience of being a woman, so having some random concept your thinking mind invented is all you have to go on.  Why not allow yourself to have no conception and just trust that their gender expression is just as emergent and mysterious as your own?\n\nLike I said, you can have preferences.   You know when a woman is masculine;  That's enough to turn you off of them.  You don't have to go and project your own uninformed conception of femininity onto them;  You'll never know what it's like to be a woman, so you'll only ever know femininity as some baseless idea through the vantage of your emergent masculinity.\n\nAnd that's the same shit these women are doing:  Inventing an uninformed idea of masculinity through the vantage of their emergent femininity.\n\nAs much as you don't need another man to tell you what it means to be a man in order to be a man, no woman needs another woman to tell her what it means to be a woman in order to be a woman.  Even less so across gender lines.",
                  "timestamp": "2022-07-24 05:16:06",
                  "score": 5,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "iheyb50",
                      "text": "I agree with this, though I'd say that it leads to the terms to being vague to the point of uselessness and perpetuating the stereotypes that there is 1 defined, correct way of being a man or woman and demonstrates your lack of empathy skills which is deconstructing your own experience to reengineer a rough concept of a communicated experience of another.",
                      "timestamp": "2022-07-24 05:27:53",
                      "score": 2,
                      "num_children": 1,
                      "author": 48705,
                      "replies": [
                        {
                          "id": "iheyfcp",
                          "text": "Nah man, the only part of you that feels like it needs to have a solid conception of the other gender is the part that feels like having that knowledge would lend you a degree of *control*.\n\nThat sense of needing to have one up on the 'other' is insecurity, and it is actively sabotaging your masculinity.\n\nYou just be you as much as you can, and everything else falls into place.  You don't have to act from a place of insecurity.\n\nEDIT: For equal measure, women feeling like they need to have a good idea about what masculinity is or \"should be\" is also feminine insecurity (not trusting men to just be what they are/needing to have control through some kind of understanding), and by the same principle, that surely sabotages their femininity as well.  Don't you agree?",
                          "timestamp": "2022-07-24 05:29:09",
                          "score": 3,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ihf1o8g",
                              "text": "I'm not sure why your insinuating a deterministic intent behind the desire to understand another's experience while dismissing any other potential constructive intents. You Sex/Gender says nothing about who you are or who you should be personality wise. It's simply a categorization dependent on what form of gametes you have in sexual reproduction in our species.",
                              "timestamp": "2022-07-24 06:05:53",
                              "score": -4,
                              "num_children": 1,
                              "author": 48705,
                              "replies": [
                                {
                                  "id": "ihflgvw",
                                  "text": "No, since we are hard-wired to act in different ways with shared traits and behaviours.",
                                  "timestamp": "2022-07-24 10:29:20",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 258564,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ihig20m",
                      "text": ">You'll never know what it's like to be a woman, so you'll only ever know femininity as some baseless idea through the vantage of your emergent masculinity.\r  \n\r\n\nThis is well-written and intelligent, but it's completely disconnected from reality. I don't need to be a computer to understand how a computer functions. Senses and logic are sufficient.",
                      "timestamp": "2022-07-24 23:43:37",
                      "score": 0,
                      "num_children": 0,
                      "author": 100166,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ihgse7x",
              "text": "But I don't think she was talking about \"real\" masculinity at all??\n\nShe was talking about the social norms on masculinity that are bullshit?\n\nThings like \"men don't cry\" \"boys should like sports\" or \"real men look muscular\". \n\nPlease explain why that's a bad thing?",
              "timestamp": "2022-07-24 16:39:38",
              "score": -1,
              "num_children": 0,
              "author": 172624,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ihf25z4",
      "text": "so i am at the levedl of drunk tyhat I tried to hit likwe 5 times",
      "timestamp": "2022-07-24 06:11:44",
      "score": 4,
      "num_children": 0,
      "author": 107944,
      "replies": []
    },
    {
      "id": "ihg1j5t",
      "text": "So men cannot say what is feminine?",
      "timestamp": "2022-07-24 13:23:49",
      "score": 3,
      "num_children": 1,
      "author": 203845,
      "replies": [
        {
          "id": "ihg855r",
          "text": "Men can say what is or isn't masculine; Isn't that enough?\n\nIt's a disservice to put masculinity in a box and argue about it.  Same with femininity.\n\nYou know your preferences.  They may or may not coincide with \"femininity\", but just knowing your preferences is most important.",
          "timestamp": "2022-07-24 14:16:04",
          "score": 5,
          "num_children": 1,
          "replies": [
            {
              "id": "ihgrdo0",
              "text": "No it's not, because you're posting here to judge a woman using the word masculinity, saying she can't have an opinion on that and she needs to shut up.\n\nSo answer the question: men cannot say what's feminine?",
              "timestamp": "2022-07-24 16:32:37",
              "score": -3,
              "num_children": 0,
              "author": 172624,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ihfcy4c",
      "text": "masculinity and femininity dont exist and it's just utter bullshit that demonises men and infantilises women. get rid of that shit.",
      "timestamp": "2022-07-24 08:30:44",
      "score": 2,
      "num_children": 0,
      "author": 330647,
      "replies": []
    },
    {
      "id": "ihh26x2",
      "text": "this is fucking stupid cuz by logic y’all get no opinion on what’s feminine.",
      "timestamp": "2022-07-24 17:47:56",
      "score": 1,
      "num_children": 1,
      "author": 145377,
      "replies": [
        {
          "id": "ihhp8vz",
          "text": "Having an opinion on what's feminine is stupid.  Having preferences for what kind of women you like is fine.\n\nMost men's conception of femininity is just based on what is or isn't in alignment with their sense of their own masculinity anyway.  The basis is still on masculinity, but you're putting this \"should\" or \"shouldn't\" label on the feminine as if you knew anything about the feminine.",
          "timestamp": "2022-07-24 20:29:48",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "ihim49e",
              "text": "i think a humans perceptive ability to empathize and think critically gives everyone a somewhat valid opinion on something even if they don’t directly live under constant influence of said affliction. i think a white guy and share his opinions on racial topics, same with a women being able to state her ideals on masculinity. omitting someones opinion simply because they don’t directly live under a term is ridiculous.",
              "timestamp": "2022-07-25 00:31:21",
              "score": 1,
              "num_children": 0,
              "author": 145377,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ihifx4u",
      "text": "I mean she was asking the question, not giving an answer, and I'm pretty sure she was meaning to say \"what things are men told they need to apply to themselves in order to be considered men, which is clearly bollocks?\" Surely that's actually positive recognition that nobody should be defining anyone else's masculinity.",
      "timestamp": "2022-07-24 23:42:34",
      "score": 1,
      "num_children": 0,
      "author": 286037,
      "replies": []
    },
    {
      "id": "ii2x4o0",
      "text": "🤣🤣🤣",
      "timestamp": "2022-07-29 03:20:22",
      "score": 1,
      "num_children": 0,
      "author": 94109,
      "replies": []
    },
    {
      "id": "ihfzrgg",
      "text": "Yes surely ignoring their opinions is the best way to get them to like you",
      "timestamp": "2022-07-24 13:08:00",
      "score": -3,
      "num_children": 1,
      "author": 247289,
      "replies": [
        {
          "id": "ihg2dt8",
          "text": "Ironically... yes.",
          "timestamp": "2022-07-24 13:31:07",
          "score": 4,
          "num_children": 1,
          "replies": [
            {
              "id": "ihgiz54",
              "text": "This right here? This is why things aren’t working out for you. Listen to people if you want them to like you, that’s a basic fact of social interaction romantic or otherwise.",
              "timestamp": "2022-07-24 15:33:41",
              "score": -2,
              "num_children": 1,
              "author": 247289,
              "replies": [
                {
                  "id": "ihgjtve",
                  "text": "You don't factor in the fact that people can have chauvinistic and abusive expectations and/or that they may not even understand themselves due to being buried in social constructionism.\n\nThings are working out for me.  You don't get to tell me what my circumstances are.\n\nI hope you're short GME, you dumb cuck.",
                  "timestamp": "2022-07-24 15:39:46",
                  "score": 4,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ihfz5pj",
      "text": "Wow just stumbled upon one of the most toxic subreddits out there. You boys having fun? Not sure if you guys are, so much salt and butthurt.\n\nGrow up lads, feminism is great for men too, you guys are just uncomfortable with “feelings” and shit.",
      "timestamp": "2022-07-24 13:02:27",
      "score": -13,
      "num_children": 4,
      "author": 260774,
      "replies": [
        {
          "id": "ihg2f6w",
          "text": "I hope she sees this, bro.",
          "timestamp": "2022-07-24 13:31:27",
          "score": 10,
          "num_children": 1,
          "replies": [
            {
              "id": "ihg2zmc",
              "text": "lol I hope YOU see it. It must be exhausting to be trying be this “manly” all the time 😂 chill out, love your life, stop trying so hard to look badass, it doesn’t work.",
              "timestamp": "2022-07-24 13:35:56",
              "score": -9,
              "num_children": 1,
              "author": 260774,
              "replies": [
                {
                  "id": "ihnrle5",
                  "text": "I am like the opposite of manly.... but fuck your sexist hate movement. Feminism belongs in the trash",
                  "timestamp": "2022-07-26 01:46:18",
                  "score": 1,
                  "num_children": 0,
                  "author": 217413,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ihgz9j2",
          "text": "What has feminism done that is good for men?\n\nI can make a list of ways it hurt men.(take changing divorce laws for 1 example)",
          "timestamp": "2022-07-24 17:27:38",
          "score": 4,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ihhq55o",
          "text": "Provide one single real example of how feminism is great for men.",
          "timestamp": "2022-07-24 20:36:03",
          "score": 3,
          "num_children": 0,
          "author": 136516,
          "replies": []
        },
        {
          "id": "ihh87wh",
          "text": "\"you boys having fun\" Hell yhea bro",
          "timestamp": "2022-07-24 18:29:57",
          "score": 2,
          "num_children": 0,
          "author": 405112,
          "replies": []
        }
      ]
    }
  ]
}