{
  "id": "w84br4",
  "text": "This is why we need to expand the Supreme Court!\n",
  "timestamp": "2022-07-25 23:57:20",
  "score": 5222,
  "subreddit": "t5_3fdcn",
  "num_children": 40,
  "author": 219131,
  "replies": [
    {
      "id": "ihncyb5",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-07-25 23:57:21",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "ihoen8i",
      "text": "They forgot to add that the court has also decided that innocence should have no bearing on your punishment.",
      "timestamp": "2022-07-26 05:00:30",
      "score": 183,
      "num_children": 3,
      "author": 653,
      "replies": [
        {
          "id": "ihond09",
          "text": "This one is nuts",
          "timestamp": "2022-07-26 06:39:12",
          "score": 75,
          "num_children": 0,
          "author": 104683,
          "replies": []
        },
        {
          "id": "ihppj61",
          "text": "Why would an innocent person be punished? I'm confused",
          "timestamp": "2022-07-26 13:43:08",
          "score": 42,
          "num_children": 2,
          "author": 406467,
          "replies": [
            {
              "id": "ihprod4",
              "text": "Here's the context: \n\n* https://www.thedailybeast.com/the-supreme-court-just-said-in-in-shinn-v-ramirez-that-evidence-of-innocence-is-not-enough\n* https://www.washingtonpost.com/politics/2022/05/23/supreme-court-ineffective-counsel-postconviction-appeals/\n\nBefore the ruling, this was a problem, which John Oliver covers: https://www.youtube.com/watch?v=kpYYdCzTpps\n\nThe latest SCOTUS ruling cements this problem and ***guarantees*** innocent people wrongly convicted of a crime by a corrupt state's AG have no way to appeal to the federal government for help. Even if there is de-facto evidence of your innocence, if the state just decides to shrug it off (which most of the limp dick fragile ego AGs do), you cannot get out of prison. \n\nSCOTUS has forced the federal government to look the other way. What this *really* means is that states can imprison anyone for any reason. Even having a constitutionally invalid trial (ineffective counsel) is not enough to save you anymore. If Texas, for instance, wants to execute you, ***they are going to execute you whether you are guilty or not***. We now live in a country of kangaroo courts and the federal government is powerless to help you.",
              "timestamp": "2022-07-26 13:58:53",
              "score": 120,
              "num_children": 1,
              "author": 169109,
              "replies": [
                {
                  "id": "ihpu3pl",
                  "text": "\n>the federal government is powerless to help you.\n\nExcellent commentary but I would rephrase this to \"is being prevented from helping you.\"",
                  "timestamp": "2022-07-26 14:16:21",
                  "score": 67,
                  "num_children": 0,
                  "author": 297086,
                  "replies": []
                }
              ]
            },
            {
              "id": "ihqqraz",
              "text": "There's this thing called \"Ineffective assistance of council\", it's for when your lawyer fucks up, or backstabs you, or does something that means you didn't get a fair shot at your original trial.\n\nIn a situation like that, where you lose what should have been a good case because your lawyer didn't do their job, you would hire a new lawyer, file an appeal saying \"my first lawyer fucked up so bad that I deserve a new trial because with a good lawyer the outcome would have been different\" and go from there. Happens sometimes.\n\nThis was a case like that. The man was innocent of the crime he was accused, the lawyer didn't care, didn't ask the prosecutor about the evidence the guy had that proved his innocence, and the guy was found guilty.\n\nShould be a pretty easy case for an appeal. Obviously the justice system got this wrong because of a bad lawyer, this is what appeals are for. \n\nWell the supreme court decided no. If your FIRST lawyer doesn't bring up evidence that proves your innocence, that's on you, there's no appeals. Appeals courts will only look at decisions and procedure, not facts, so fuck you and die for having a bad lawyer the first time. \"Innocence is not enough\" of a reason to bring in new facts to an appeal *about a case where your lawyer didn't bring up facts*.",
              "timestamp": "2022-07-26 17:48:15",
              "score": 23,
              "num_children": 1,
              "author": 2475,
              "replies": [
                {
                  "id": "ihrnt1z",
                  "text": "Shocking that the Supreme Court is ruling in favor of something that will help keep poor people in prison. Public defender didn't give a fuck and now you lost your case? Maybe you should've thought about that before you were born poor.",
                  "timestamp": "2022-07-26 21:19:11",
                  "score": 3,
                  "num_children": 0,
                  "author": 406467,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ihquyph",
          "text": "This shit is fucked. I'm so tired of cops and the court. They know deep down what they do is wrong. But they lack the agency to do anything about it. Rules is rules, even if the downfall of our species is a direct result.\n\nFuck da po'lice",
          "timestamp": "2022-07-26 18:15:07",
          "score": 11,
          "num_children": 0,
          "author": 72456,
          "replies": []
        }
      ]
    },
    {
      "id": "ihnu0qe",
      "text": "Also forced the government to fund religious schools",
      "timestamp": "2022-07-26 02:04:13",
      "score": 290,
      "num_children": 1,
      "author": 357917,
      "replies": [
        {
          "id": "ihnvhi6",
          "text": "This is a big one. You don't see (let's say Islamic schools) getting government grants. If one religious school gets one, they all should. The first amendment also forbids having an official state sponsored religion, but they're well on the way to turning that over for state sponsored Christian nationalism.",
          "timestamp": "2022-07-26 02:14:57",
          "score": 183,
          "num_children": 1,
          "author": 264785,
          "replies": [
            {
              "id": "ihojqvy",
              "text": ">  If one religious school gets one, they all should. \n\nSeparate but equal round two.",
              "timestamp": "2022-07-26 05:55:48",
              "score": 65,
              "num_children": 0,
              "author": 89813,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iho2x96",
      "text": "they didnt just make prayer in school legal\n\nthey made punishing students who dont pray along legal",
      "timestamp": "2022-07-26 03:12:59",
      "score": 168,
      "num_children": 1,
      "author": 86643,
      "replies": [
        {
          "id": "ihot59g",
          "text": "Can you give me proof of that?\n\nEdit: ask for proof, get downvoted. Fucking geniuses. I wanted to learn more.",
          "timestamp": "2022-07-26 07:54:13",
          "score": 14,
          "num_children": 2,
          "author": 329061,
          "replies": [
            {
              "id": "ihou3q2",
              "text": "the case wasnt just about prayer he sued because he was fired for punishment of the students not the prayer itself\n\nthe right wing though foghorned the prayer part only\n\nbasicly he benched players who didnt pray with him",
              "timestamp": "2022-07-26 08:07:04",
              "score": 81,
              "num_children": 1,
              "author": 86643,
              "replies": [
                {
                  "id": "ihoyojh",
                  "text": "Just like Jesus would do. Actually if we are talking christians it’s been a while since their last genocide. They are due to start another one.",
                  "timestamp": "2022-07-26 09:09:28",
                  "score": 45,
                  "num_children": 0,
                  "author": 278242,
                  "replies": []
                }
              ]
            },
            {
              "id": "ihp2y4n",
              "text": "Literally the supreme court",
              "timestamp": "2022-07-26 10:06:32",
              "score": 23,
              "num_children": 0,
              "author": 359182,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ihneoke",
      "text": "Overturned Miranda rights? When and how?",
      "timestamp": "2022-07-26 00:10:06",
      "score": 104,
      "num_children": 3,
      "author": 345140,
      "replies": [
        {
          "id": "ihnmec7",
          "text": "It's also illegal in AZ now to film an officer at close range now - I forget the terminology 8ft I think, but ya know police aren't exactly gonna pull out a tape measure.  That was more the great Gov. Doug Douchey",
          "timestamp": "2022-07-26 01:07:32",
          "score": 151,
          "num_children": 2,
          "author": 340506,
          "replies": [
            {
              "id": "ihp6p0n",
              "text": "They will just walk closer to you making you within 8 feet.",
              "timestamp": "2022-07-26 10:52:40",
              "score": 43,
              "num_children": 1,
              "author": 319660,
              "replies": [
                {
                  "id": "ihqarpz",
                  "text": "Exactly the problem.",
                  "timestamp": "2022-07-26 16:07:09",
                  "score": 18,
                  "num_children": 0,
                  "author": 122377,
                  "replies": []
                }
              ]
            },
            {
              "id": "ihotb8o",
              "text": "That sounds like it could make sense if it were applied ethically but you know it won’t be.",
              "timestamp": "2022-07-26 07:56:26",
              "score": -30,
              "num_children": 0,
              "author": 340356,
              "replies": []
            }
          ]
        },
        {
          "id": "ihnqe1v",
          "text": "They didn’t overturn Miranda rights they just made it impossible to file a civil claim against an officer for not reading you your Miranda rights.",
          "timestamp": "2022-07-26 01:37:16",
          "score": 99,
          "num_children": 3,
          "author": 255677,
          "replies": [
            {
              "id": "ihojo95",
              "text": "So, if you're not read your rights you have no recourse? That doesn't seem like a meaningful difference. Or do we just have the sue the state instead?",
              "timestamp": "2022-07-26 05:54:57",
              "score": 47,
              "num_children": 3,
              "author": 89813,
              "replies": [
                {
                  "id": "ihoqcpr",
                  "text": ">So, if you're not read your rights you have no recourse?\n\nYou can get everything you said prior to being mirandized removed from the record",
                  "timestamp": "2022-07-26 07:17:07",
                  "score": 28,
                  "num_children": 1,
                  "author": 364178,
                  "replies": [
                    {
                      "id": "ihouubf",
                      "text": "But like in the case this was about, even if you plead guilty because of that evidence against you, and the guilty verdict remains even in light of your miranda rights being violated, then you have no recourse against the officer that submitted the evidence against you.",
                      "timestamp": "2022-07-26 08:16:57",
                      "score": 12,
                      "num_children": 1,
                      "author": 231260,
                      "replies": [
                        {
                          "id": "ihpsf8g",
                          "text": "It's all part of the bigger agenda to 100% absolve cops of all culpability in the course of doing their jobs. \n\nStates want a force of attack dogs who are unafraid of consequences, and don't have to think or respect anyone's rights when doing their job.",
                          "timestamp": "2022-07-26 14:04:22",
                          "score": 7,
                          "num_children": 0,
                          "author": 169109,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ihpenyk",
                  "text": "So they didn't explicitly overturn it, but they practically did.",
                  "timestamp": "2022-07-26 12:14:17",
                  "score": 6,
                  "num_children": 0,
                  "author": 368373,
                  "replies": []
                },
                {
                  "id": "ihojv7i",
                  "text": "Correct. No repercussions.",
                  "timestamp": "2022-07-26 05:57:14",
                  "score": 11,
                  "num_children": 1,
                  "author": 255677,
                  "replies": [
                    {
                      "id": "ihok6yg",
                      "text": "A law with no repercussions might as well not exist. They overturned miranda rights.",
                      "timestamp": "2022-07-26 06:01:04",
                      "score": 42,
                      "num_children": 0,
                      "author": 89813,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ihohtf5",
              "text": "Yeah they removed civil liability from the cops themselves",
              "timestamp": "2022-07-26 05:33:59",
              "score": 12,
              "num_children": 1,
              "author": 51074,
              "replies": [
                {
                  "id": "ihph1kh",
                  "text": "Which I s odd. Given they are “civil servants”.",
                  "timestamp": "2022-07-26 12:35:31",
                  "score": 3,
                  "num_children": 0,
                  "author": 255677,
                  "replies": []
                }
              ]
            },
            {
              "id": "ihote0d",
              "text": "Which shouldn’t be that big of a deal. If you’re not mirandized than what you’ve said after arrest just isn’t admissible. There’s no damage after that. Why would you be entitled to compensation?",
              "timestamp": "2022-07-26 07:57:28",
              "score": -6,
              "num_children": 1,
              "author": 340356,
              "replies": [
                {
                  "id": "ihp08ec",
                  "text": "That is some incredible faith you have in the legal system.",
                  "timestamp": "2022-07-26 09:30:26",
                  "score": 19,
                  "num_children": 0,
                  "author": 339156,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ihnq0ws",
          "text": "The when is in their last term and the how is because the current court are partisan hacks. \nhttps://www.reuters.com/legal/government/us-supreme-courts-miranda-decision-further-guts-150-year-old-civil-rights-law-2022-06-27/",
          "timestamp": "2022-07-26 01:34:36",
          "score": 31,
          "num_children": 0,
          "author": 88789,
          "replies": []
        }
      ]
    },
    {
      "id": "ihpws04",
      "text": "Or hear me out. Abolish it",
      "timestamp": "2022-07-26 14:34:58",
      "score": 16,
      "num_children": 1,
      "author": 265394,
      "replies": [
        {
          "id": "ihqh8js",
          "text": "Well, we don't need to abolish it, we just need to strip them of their undemocratic power. 9 **unelected** people shouldn't get to decide the laws in the country even against the will of the people. They need to be relegated to an advisory body like most supreme courts are in *reasonable* countries.",
          "timestamp": "2022-07-26 16:48:14",
          "score": 8,
          "num_children": 0,
          "author": 262430,
          "replies": []
        }
      ]
    },
    {
      "id": "ihqqxzd",
      "text": "Don't forget what's next in the Supreme Court agenda:\r  \n\r  \n6) allow state legislatures to rig elections\r  \n7) repealing gay marriage\r  \n8) allow states to outlaw contraceptives\r  \n9) allow states to regulate sex acts between consenting adults",
      "timestamp": "2022-07-26 17:49:26",
      "score": 13,
      "num_children": 0,
      "author": 102429,
      "replies": []
    },
    {
      "id": "iho0f5w",
      "text": "How about we get rid of it instead? It's one of the least democratic parts of the federal government in the US... And that's really saying something",
      "timestamp": "2022-07-26 02:52:52",
      "score": 79,
      "num_children": 2,
      "author": 218457,
      "replies": [
        {
          "id": "ihogiey",
          "text": "Practically speaking, expanding the Supreme Court is light years easier than eliminating SCOTUS. Expansion can be done by simple legislation, eliminating SCOTUS would take a constitutional amendment.",
          "timestamp": "2022-07-26 05:20:00",
          "score": 54,
          "num_children": 2,
          "author": 195998,
          "replies": [
            {
              "id": "ihp71fh",
              "text": "What about 20 year term limits.\n\nI don't understand why anyone need to be doing that job for more than 20 years.\n\nEspecially since none are starting in their early 20s.",
              "timestamp": "2022-07-26 10:56:35",
              "score": 20,
              "num_children": 1,
              "author": 319660,
              "replies": [
                {
                  "id": "ihpt4v4",
                  "text": "Not commenting on the wisdom of that kind of change but doing away with lifetime appointments would also require a constitutional amendment since lifetime appointments are in Article III. \n\nHonestly this whole situation could have been avoided if RBG retired when Obama asked her to.\n\nEDIT: Forgot to mention, I personally feel that the Democrats were negligent in protecting abortion access. The Pro-Life Republicans and Federalist Society have publicly stated that they were gunning for Roe v Wade the moment it was decided. In the last 50 years Democrats in Congress could have removed abortion cases from the Supreme Court’s appellate jurisdiction at any point, again by simple legislation. Thereby locking in Roe v Wade.",
                  "timestamp": "2022-07-26 14:09:30",
                  "score": 14,
                  "num_children": 1,
                  "author": 195998,
                  "replies": [
                    {
                      "id": "ihrwaiz",
                      "text": "But you can change their *roles* without a constitutional amendment. People have proposed giving a Justice a reduced role working with lower courts after a certain term. They'd be Supreme Court Justices still, just with Tier 2 responsibilities. The Constitution doesn't spell out any individual justice's powers with specificity.",
                      "timestamp": "2022-07-26 22:15:52",
                      "score": 0,
                      "num_children": 1,
                      "author": 110853,
                      "replies": [
                        {
                          "id": "ihs3bx2",
                          "text": "Do you have a link to that proposal? It sounds like it would violate Article III section 1 in a couple of ways. \n\nAlso wouldn’t it be simpler to just expand the number of justices on the court?",
                          "timestamp": "2022-07-26 23:05:18",
                          "score": 1,
                          "num_children": 0,
                          "author": 195998,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ihp4xnr",
              "text": "Or revolution",
              "timestamp": "2022-07-26 10:31:46",
              "score": 3,
              "num_children": 1,
              "author": 94634,
              "replies": [
                {
                  "id": "ihpt7uk",
                  "text": "Let me know when that kicks off. \n\nEmphasis on “practically speaking.”",
                  "timestamp": "2022-07-26 14:10:05",
                  "score": 3,
                  "num_children": 0,
                  "author": 195998,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ihpj26f",
          "text": "The problem isn’t that it’s not democratic. In fact, the problem is that it’s partisan. You must make it properly meritocratic and not presented and voted upon by politicians, but instead by law knowledgeable peers.",
          "timestamp": "2022-07-26 12:52:23",
          "score": 6,
          "num_children": 1,
          "author": 146856,
          "replies": [
            {
              "id": "ihqox4a",
              "text": "Honestly, I wouldn’t be opposed to adding a requirement to appointment to the supreme court be that you have already served 10 years on a federal bench somewhere. You’d then have 10 years of rulings to evaluate their character on.\n\nThat doesn’t sound too exclusionary and would ensure that at least the people nominated are already judges, rather than trump or W just appointing wives of lobbyists that helped them get elected. It won’t stop the turtle from packing the federal bench though.",
              "timestamp": "2022-07-26 17:36:37",
              "score": 3,
              "num_children": 1,
              "author": 106478,
              "replies": [
                {
                  "id": "ihrmqne",
                  "text": "It should probably be the board of ethics of some law schools that appoint them and that board should be democratically elected by holders of a degree in law. Then it’s not a partisan issue but a meritocratic issue instead.",
                  "timestamp": "2022-07-26 21:12:13",
                  "score": 2,
                  "num_children": 0,
                  "author": 146856,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ihoaag2",
      "text": "actually they did this in like a month",
      "timestamp": "2022-07-26 04:17:33",
      "score": 18,
      "num_children": 1,
      "author": 259102,
      "replies": [
        {
          "id": "ihogocz",
          "text": "Judicial sessions run for a year but they release most of their decisions in June. They released all of these decisions in a month but all of those cases have been going on since October.",
          "timestamp": "2022-07-26 05:21:43",
          "score": 11,
          "num_children": 1,
          "author": 412819,
          "replies": [
            {
              "id": "ihqpo6a",
              "text": "Ah good to know!",
              "timestamp": "2022-07-26 17:41:21",
              "score": 3,
              "num_children": 0,
              "author": 259102,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ihoxr6z",
      "text": "But the dems have tried nothing and are all out of ideas…. And for some reason like it that way.",
      "timestamp": "2022-07-26 08:56:46",
      "score": 16,
      "num_children": 0,
      "author": 163673,
      "replies": []
    },
    {
      "id": "iho1i23",
      "text": "They didn’t overturn Miranda and they didn’t make gun control illegal.  The Supreme Court has been awful, but spreading ignorance is what the alt right does, it benefits no one and emboldens them when people on the other side do the same thing.\n\nEdit: also they didn’t make abortion illegal, that is not something within their power, they made it so the states could, which is still awful.",
      "timestamp": "2022-07-26 03:01:23",
      "score": 36,
      "num_children": 4,
      "author": 60856,
      "replies": [
        {
          "id": "ihpsqu0",
          "text": "They removed any civil recourse for Miranda violations. No civil recourse makes it easier to get away with violations since the good old boys in blue dont have to worry about being sued for fucking with your rights. \n\nAlso this mostly impacts the poor once again. Republicans like to fuck with them. \n\nWe are talking semantics on abortion. Overturning almost immediately makes abortion illegal or extremely limited in half the country. They knew that would be the result of the ruling. \n\n\nGun control options for states are more limited. This one has potential to severely limit states from adding any restrictions to gun purchases depending how how it’s applied to tangential cases.",
          "timestamp": "2022-07-26 14:06:41",
          "score": 12,
          "num_children": 0,
          "author": 278242,
          "replies": []
        },
        {
          "id": "ihoojls",
          "text": "Exactly - pretty much everything in this tweet is framed misleadingly. It's infuriating. Bring any of these points up with a conservative and they can simply reject everything on the basis all the points are factually incorrect. And they would not only be right, it would also allow them to avoid engaging with the underlying issues. Shit is bad enough, we don't have to bend the truth to make things seem worse.",
          "timestamp": "2022-07-26 06:53:58",
          "score": 14,
          "num_children": 1,
          "author": 215074,
          "replies": [
            {
              "id": "ihpytd0",
              "text": "Makes you wonder if these sort of things are deliberately created in such a way to confuse that sort of discourse.",
              "timestamp": "2022-07-26 14:48:49",
              "score": 3,
              "num_children": 0,
              "author": 257694,
              "replies": []
            }
          ]
        },
        {
          "id": "ihoovh2",
          "text": "They just enabled it and It just had the exact same effect in many places that are their ideological allies...",
          "timestamp": "2022-07-26 06:58:08",
          "score": 2,
          "num_children": 1,
          "author": 255506,
          "replies": [
            {
              "id": "iht489g",
              "text": "Yeah. I subscribe to this sub too, I do not agree with the decision.  It was wrong.  It was ignorant.  But I’m against ignorance and ignorant ass posts like this is not how you defeat ignorance.  It embolden ignorance.  We should be the side of truth.  Not further bullshit.",
              "timestamp": "2022-07-27 03:47:24",
              "score": 2,
              "num_children": 0,
              "author": 60856,
              "replies": []
            }
          ]
        },
        {
          "id": "ihoqu0d",
          "text": "[deleted]",
          "timestamp": "2022-07-26 07:23:27",
          "score": 0,
          "num_children": 1,
          "replies": [
            {
              "id": "ihoup1f",
              "text": "Miranda, is about providing information about rights (right to remain silent and right to an attorney) to people before a custodial interrogation so that evidence obtained in violation of these 5th amendment rights cannot be used against them at trial.  Potential civil litigation was never particularly relevant to Miranda.",
              "timestamp": "2022-07-26 08:14:58",
              "score": 0,
              "num_children": 1,
              "author": 60856,
              "replies": [
                {
                  "id": "ihoytlb",
                  "text": "It is about recourse. Removing instances where you can sue or hold an officer accountable for not following the rules makes it more likely they will break those rules in the future.",
                  "timestamp": "2022-07-26 09:11:26",
                  "score": 4,
                  "num_children": 1,
                  "author": 278242,
                  "replies": [
                    {
                      "id": "ihpnum9",
                      "text": "Does not change the fact that this tweet is ignorant, directly false and pushing ignorance is what the alt right does.\n\nAlso if they break the rule, the evidence is excluded, that’s the point of the rule, Miranda never created a private right of action.",
                      "timestamp": "2022-07-26 13:30:28",
                      "score": 0,
                      "num_children": 1,
                      "author": 60856,
                      "replies": [
                        {
                          "id": "ihpp3wv",
                          "text": "Ok your previous comment is shit and the tweet is shit. We both agree.\n\n\nAlso it’s almost universally agreed that this weakens Miranda rights since there will be no risk of civil litigation caused by a failure of an officer to mirandize someone.",
                          "timestamp": "2022-07-26 13:39:59",
                          "score": 1,
                          "num_children": 1,
                          "author": 278242,
                          "replies": [
                            {
                              "id": "ihppfx1",
                              "text": "The fuck is wrong with my comment?  Accurately explaining what the Supreme Court decision in Miranda is about and explaining that the recent Supreme Court ruling is about a tangentially related issue is shit?  The fuck is your problem?",
                              "timestamp": "2022-07-26 13:42:28",
                              "score": 1,
                              "num_children": 1,
                              "author": 60856,
                              "replies": [
                                {
                                  "id": "ihpri9x",
                                  "text": "You still keep downplaying the impact of the Miranda decision. Less recourse=more frequent abuse. This will disproportionately impact the poor like overturning roe v wade. Poor people don’t have money to fight Miranda cases.",
                                  "timestamp": "2022-07-26 13:57:38",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 278242,
                                  "replies": [
                                    {
                                      "id": "ihpsg0o",
                                      "text": "I didn’t downplay shit.  I’m an attorney and believe our 5th amendment rights are important.  In Vega, they shot down a potential claim that a failure to mirandize does not provide a basis for a 1983 claim.  I didn’t agree with the decision, I just explained it because people should understand our actual body of law.",
                                      "timestamp": "2022-07-26 14:04:31",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 60856,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ihnpuar",
      "text": "They didn't make gun control illegal. They removed a single portion of one regulation on obtaining a concealed carry permit for handguns in one state. Gun control in NY is still there and it is still strong, other states were not impacted.\n\nIt might be used as precedent to make future changes, but for now saying that they \"made gun control illegal\" is *extremely* misleading.",
      "timestamp": "2022-07-26 01:33:15",
      "score": 22,
      "num_children": 1,
      "author": 412819,
      "replies": [
        {
          "id": "iho92os",
          "text": "I agree with your statement, but I wanted to correct one point: the supreme court decision does indeed impact every state that has a \"may issue\" law for Concealed Carry Licensing, striking those laws down as well. Now, I don't personally see this as a bad thing, quite the contrary, but it is nevertheless an interesting development and I am curious about what the long-term results will be.",
          "timestamp": "2022-07-26 04:06:07",
          "score": 15,
          "num_children": 1,
          "author": 285567,
          "replies": [
            {
              "id": "ihofu4z",
              "text": "I’ve seen people say that it has and that it has not struck down all “may issue” statutes and I’m not sure which is correct after reading the verdict. I don’t think any states have responded about legislative change after the decision and NY immediately amended their handgun laws to be even more strict, so the case at this point seems to not even have an immediate effect.",
              "timestamp": "2022-07-26 05:12:55",
              "score": 3,
              "num_children": 0,
              "author": 412819,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ihpi28z",
      "text": "Most of the rw weirdos on the SC were appointed by popular vote losers. W and orange especially",
      "timestamp": "2022-07-26 12:44:06",
      "score": 2,
      "num_children": 0,
      "author": 63319,
      "replies": []
    },
    {
      "id": "ihqmyix",
      "text": "Who gives a shit about being moderate? Go balls out and pulverize these fascistic dickheads.",
      "timestamp": "2022-07-26 17:24:13",
      "score": 2,
      "num_children": 0,
      "author": 341327,
      "replies": []
    },
    {
      "id": "ihqu7io",
      "text": "What are Biden's reasons for not expanding the court? There are 13 appellate courts, there used to be nine hence 9 justices. It makes sense to have 13 to parallel the lower courts. The GOP would do it. What is his rationale?",
      "timestamp": "2022-07-26 18:10:11",
      "score": 2,
      "num_children": 0,
      "author": 327284,
      "replies": []
    },
    {
      "id": "ihoz3e1",
      "text": "If it's this easy for fascists to enact third-world authoritarian practices then the idea of Checks and Balances is clearly not functioning. The whole thing needs rebuilt.",
      "timestamp": "2022-07-26 09:15:09",
      "score": 6,
      "num_children": 0,
      "author": 303540,
      "replies": []
    },
    {
      "id": "ihonuwh",
      "text": "Just FYI, I'd like to see some justices impeached. You pick the three.",
      "timestamp": "2022-07-26 06:45:22",
      "score": 2,
      "num_children": 1,
      "author": 337777,
      "replies": [
        {
          "id": "ihqjg4n",
          "text": "Coney-Barrett, Kavanaugh, and Thomas.",
          "timestamp": "2022-07-26 17:01:56",
          "score": 3,
          "num_children": 0,
          "author": 331605,
          "replies": []
        }
      ]
    },
    {
      "id": "ihoonn5",
      "text": "...and gutted union rights.",
      "timestamp": "2022-07-26 06:55:25",
      "score": 2,
      "num_children": 0,
      "author": 32321,
      "replies": []
    },
    {
      "id": "ihnd4s3",
      "text": "can I get links for 2, 4, and 5?",
      "timestamp": "2022-07-25 23:58:42",
      "score": 2,
      "num_children": 2,
      "author": 297960,
      "replies": [
        {
          "id": "ihnpvrd",
          "text": "Because other people don't want to be helpful:\n\nhttps://www.theguardian.com/commentisfree/2022/jun/28/kennedy-v-bremerton-supreme-court-prayer-public-schools-football-coach\n\nhttps://www.reuters.com/legal/government/us-supreme-courts-miranda-decision-further-guts-150-year-old-civil-rights-law-2022-06-27/\n\nhttps://www.npr.org/2022/06/30/1103595898/supreme-court-epa-climate-change",
          "timestamp": "2022-07-26 01:33:33",
          "score": 23,
          "num_children": 0,
          "author": 130062,
          "replies": []
        },
        {
          "id": "ihng7h2",
          "text": "Google.com\nGoogle.com\nGoogle.com\n\nMaybe search the 10 or so most recent USSC decisions, they’re all there",
          "timestamp": "2022-07-26 00:21:31",
          "score": 2,
          "num_children": 1,
          "author": 24952,
          "replies": [
            {
              "id": "ihnldiq",
              "text": "This!\n\nEvery contrarian wants the sub to be their personal research librarian.",
              "timestamp": "2022-07-26 01:00:05",
              "score": 6,
              "num_children": 1,
              "author": 219131,
              "replies": [
                {
                  "id": "ihqa1dj",
                  "text": "I'm not going to claim Google is hard to use, but the rule of discourse is generally that the person making the claim (or repeating the claim) has the responsibility to back up the claim with evidence.\n\n\"Google it\" is not evidence of your claim. It's also a great way to have your claim dismissed entirely, since Google will give them results that also say the opposite of what you're saying, if they click on Fox News or OAN or something. \n\nIf you don't want to be asked to back up your claims, don't make claims.",
                  "timestamp": "2022-07-26 16:02:29",
                  "score": -1,
                  "num_children": 2,
                  "author": 259764,
                  "replies": [
                    {
                      "id": "ihrvqmk",
                      "text": "But this is the internet, sir! I have a *RIGHT* to make as many claims as I wish, no matter how truthful, and it is the reader’s responsibility to verify and back up my claims, *NOT* mine!\n\n/s\n\nNot saying this post is false, but we should be better than the alt-right and back up our statements with sources, at least when asked to do so.",
                      "timestamp": "2022-07-26 22:12:02",
                      "score": 2,
                      "num_children": 1,
                      "author": 127409,
                      "replies": [
                        {
                          "id": "ihs1w9g",
                          "text": "Exactly. Make an argument, and then drop a couple links so people can learn more about what you're saying. \n\nBut that's not as low-effort as just sharing a meme like this is Facebook, so I get it.",
                          "timestamp": "2022-07-26 22:55:02",
                          "score": 2,
                          "num_children": 0,
                          "author": 259764,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ihs6cob",
                      "text": "Stating the gists of several Supreme Court cases isn’t really a claim.",
                      "timestamp": "2022-07-26 23:28:45",
                      "score": 0,
                      "num_children": 0,
                      "author": 24952,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ihpbqv5",
      "text": "They haven't made gun control illegal yet. If they did they would only make gun control illegal for some people. Remember that the right-wing wants you disarmed.",
      "timestamp": "2022-07-26 11:46:39",
      "score": 2,
      "num_children": 0,
      "author": 164023,
      "replies": []
    },
    {
      "id": "ihol4l6",
      "text": "Our political system is broken, so how do we reverse the work of koch / murdoch / trump over the purposefully undereducated masses in red states? \n\nHere's a big start to the how:\n\n**Tier 1:**\n* Automatic voter registration at 18\n* Mail in ballots offered to every American\n* National voting holiday\n* Have polling places accessible at every college, high school, prison, and elderly home\n* Publicly funded elections with hard caps\n* Ban political advertising until a tight window near elections, and then guarantee a basic block of equal air time and print space to every eligible nominee (agreed upon threshold for eligibility)\n\n**Tier 2:**\n* Implement ranked choice voting nationally\n* Expand the supreme court and end lifetime appointments\n* Allow reformed felons to vote\n* Proportional representation\n* Overturn citizens united\n\n**Tier 3:**\n* Expand the Congress (including statehood for D.C. and Puerto Rico)\n* Get rid of the electoral college\n* Meaningfully reform or outright end lobbying\n* Introduce a 21st century fairness doctrine remedy that reforms the broken \"news\" networks currently run as entertainment vehicles and not information delivery systems.",
      "timestamp": "2022-07-26 06:12:05",
      "score": 2,
      "num_children": 2,
      "author": 75760,
      "replies": [
        {
          "id": "ihoyywa",
          "text": "Campaign finance reform was just shot down in the senate. It included more reporting requirements as well. Guess which party sat on party lines and voted against it?",
          "timestamp": "2022-07-26 09:13:28",
          "score": 2,
          "num_children": 1,
          "author": 278242,
          "replies": [
            {
              "id": "ihq2m64",
              "text": "Fucking green party... Every time!",
              "timestamp": "2022-07-26 15:14:13",
              "score": 1,
              "num_children": 0,
              "author": 75760,
              "replies": []
            }
          ]
        },
        {
          "id": "ihonnin",
          "text": "Do you seriously believe that if we had a national voter holiday that people would actually go vote? Right now, employers have to allow employees time off specifically to vote. Polls are open 13 hours a day on election day, plus most places have some form of early voting. In addition, vote by mail is also a thing in most places.\n\nI understand that voting holidays seem to work in other countries, but I seriously believe that in the US a voting holiday would mean sales at department stores and car dealerships and people taking four day weekends.",
          "timestamp": "2022-07-26 06:42:45",
          "score": -4,
          "num_children": 2,
          "author": 336680,
          "replies": [
            {
              "id": "ihozaq2",
              "text": "Enabling mail in voting and a holiday would increase turn out. Give people 30 days of mail in plus a holiday or keep polls open for an entire week. Even though places are required to give time off its can be really inconvenient for people. \n\nSome states are only required to give one hour and if you are not working during an hour the polls are open that may count. People still may have kids to pickup or other events which prevent voting as well.\n\nSome states make getting absentee ballots harder than they should be.",
              "timestamp": "2022-07-26 09:17:54",
              "score": 6,
              "num_children": 1,
              "author": 278242,
              "replies": [
                {
                  "id": "ihq1c6c",
                  "text": "If you look at [this record](https://sos.oregon.gov/elections/Documents/Voter_Turnout_History_General_Election.pdf) of voter turn out in Oregon it shows that voter turn out has not changed significantly in over 60 years. For presidential elections, there’s about an 80% turnout, and in non-presidential general elections, about 70%. [This timeline](https://www.multco.us/elections/brief-history-vote-mail-oregon) of how Oregon move to vote by mail shows the process ramping up over about 10 years, with no corresponding change in voter turn out during that period.\n\nCalifornia has a much lower voter turnout, in the 30 to 50% range, even in very popular (Obama) or highly controversial (Trump/Clinton) elections. One difference is that in California you are automatically registered to vote if you’re a citizen and get a drivers license or DMV ID card. In Oregon, registration is an independent process, so people with no interest in voting would likely not be registered.",
                  "timestamp": "2022-07-26 15:05:40",
                  "score": 1,
                  "num_children": 0,
                  "author": 336680,
                  "replies": []
                }
              ]
            },
            {
              "id": "ihq2dtt",
              "text": "The department store sales and car dealership bbqs are actually part of the point. It's partially about the time to do it, but a big part is awareness. Plenty of people don't have time/energy to consider voting actively - so we give then the time And we sistine then with the message. A holiday in general means things like more TV programming, more curriculum at schools, more signage on billboards and yes, even more flyers for sales that mention this voting holiday\n\n  \n\n\nYou've heard the old adage of, \"why does coca cola advertise when they are number one? They're number one BECAUSE they advertise.\"\n\n  \n\n\nIt's the reason someone like trump had traction, repetition and exposure. Humans are simple, programmable things. Many saw trump in a shitty suit on shitty TV set for years saying, \"im a real golden business boy!!!\" And after time, enough people forgot he's actually, demonstrably, the single biggest loser in history when it comes to personal wealth. He fails at everything, even things most people can't fail at like casinos. But the repetition and exposure made all that go away because the average human is simple.\n\n  \n\n\nRegardless of your politics, we all need to vote. A voting holiday would help that in a myriad ways and the impact will only grow over time. Yes we need it, we need it yesterday.",
              "timestamp": "2022-07-26 15:12:40",
              "score": 2,
              "num_children": 1,
              "author": 75760,
              "replies": [
                {
                  "id": "ihq3w2z",
                  "text": "Well, it doesn’t have to start on a national level. If one state could be convinced to try it, and if they saw a jumping turnout, that would sort of prove your point.\n\nI guess a general election might not be affected in the way I see it. Not many people would want to travel at the beginning of November because they’d be traveling at the end for Thanksgiving. And it’s not like it’s a great time to go hiking or tramping around some other city. The primary though, in the spring or early summer, I just see people going out of town and not bothering.\n\nWhat I would really like to say is more voter registration drives. Stacy Adams did something really important. Maybe what we need is a fleet of like 10 motorhomes to just drive around rural communities and register people to vote.\n\nThe other thing that bothers me, is everybody on the right bitches about unsafe elections and brings up the lack of ID cards. And everyone on the left says that getting ID cards is a hardship for some people, which I totally agree. But nobody ever brings up all the other things that are much harder to do without ID cards. How about a big ID card movement? How many people are limited in their ability to go to school, apply for jobs, open a bank account, rent an apartment, get a cell phone, because they can’t prove that they’re who they say they are. And how many people are held back in life because of this, and how many children can’t move out of poverty because their parents are hampered this way?",
                  "timestamp": "2022-07-26 15:22:32",
                  "score": 1,
                  "num_children": 0,
                  "author": 336680,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ihoezre",
      "text": "It's a good thing we may be able to overturn their decisions again in 20 to 40 years /s",
      "timestamp": "2022-07-26 05:04:06",
      "score": 1,
      "num_children": 0,
      "author": 170238,
      "replies": []
    },
    {
      "id": "ihpiqyt",
      "text": "Expanding the court is just pouring a glass of water on a arsonist. You’re not even addressing the actual problem and even if you were, your measures are negligible.",
      "timestamp": "2022-07-26 12:49:51",
      "score": 1,
      "num_children": 0,
      "author": 146856,
      "replies": []
    },
    {
      "id": "ihou4ma",
      "text": "How about we just remove the Republican appointees from it?\n\nOne way or another.",
      "timestamp": "2022-07-26 08:07:24",
      "score": 0,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ihoi12r",
      "text": "The Supreme Court let the trail of tears happen but somehow now their decisions are suddenly of some effect? The intention is always to oppress, anything else is and always has been optics for them",
      "timestamp": "2022-07-26 05:36:15",
      "score": 0,
      "num_children": 0,
      "author": 9162,
      "replies": []
    },
    {
      "id": "ihoo2rt",
      "text": "This is why bad faith ideologues need to be yeeted from positions of power.",
      "timestamp": "2022-07-26 06:48:10",
      "score": 0,
      "num_children": 0,
      "author": 119473,
      "replies": []
    },
    {
      "id": "ihp0b20",
      "text": "Anyone mind explaining to me the miranda rights one?",
      "timestamp": "2022-07-26 09:31:25",
      "score": 1,
      "num_children": 0,
      "author": 187584,
      "replies": []
    },
    {
      "id": "ihpamp6",
      "text": "So we toss out trump because he’s ‘too far right’ yet we don’t even fucking look at half the Supreme Court???",
      "timestamp": "2022-07-26 11:35:28",
      "score": 1,
      "num_children": 1,
      "author": 142010,
      "replies": [
        {
          "id": "ihpby2h",
          "text": "Supreme court isn't elected, they're appointed for life.",
          "timestamp": "2022-07-26 11:48:33",
          "score": 6,
          "num_children": 1,
          "author": 164023,
          "replies": [
            {
              "id": "ihpg7zw",
              "text": "And somehow we don’t take issue with that",
              "timestamp": "2022-07-26 12:28:19",
              "score": 2,
              "num_children": 2,
              "author": 142010,
              "replies": [
                {
                  "id": "ihptcqt",
                  "text": "Its even more fucked when you see that mitt Romney fucked Obama out of an appointment because of some made up tradition he wanted to uphold by refusing to call a vote on Obama nomination. He then changed his mind on election year nominees getting votes when RBG died. Trump got a third Supreme Court nomination that he should not have had.",
                  "timestamp": "2022-07-26 14:11:04",
                  "score": 3,
                  "num_children": 1,
                  "author": 278242,
                  "replies": [
                    {
                      "id": "ihqifzk",
                      "text": "I thought that was McConnell not Romney. Either way, it was just another horseshit move to obstruct President Scaryblackguy at every opportunity.",
                      "timestamp": "2022-07-26 16:55:42",
                      "score": 1,
                      "num_children": 1,
                      "author": 331605,
                      "replies": [
                        {
                          "id": "ihr0e12",
                          "text": "You are right. I was tired and fucked up which corrupt senator it was.",
                          "timestamp": "2022-07-26 18:50:04",
                          "score": 1,
                          "num_children": 0,
                          "author": 278242,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ihph0sz",
                  "text": "Plenty of people do, what can anyone do about it?",
                  "timestamp": "2022-07-26 12:35:20",
                  "score": 3,
                  "num_children": 0,
                  "author": 164023,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ihqtvv0",
      "text": "\"made gun control illegal\"\n\nNo, they didn't. They struck down a New York law that could very easily be used to discriminate against minorites.",
      "timestamp": "2022-07-26 18:08:05",
      "score": 1,
      "num_children": 0,
      "author": 58589,
      "replies": []
    },
    {
      "id": "ihqw9c4",
      "text": "Can someone provide context for the gun thing? I know which ruling but I still don’t understand t application of it preventing gun control regulation",
      "timestamp": "2022-07-26 18:23:26",
      "score": 1,
      "num_children": 0,
      "author": 266843,
      "replies": []
    },
    {
      "id": "ihqzuot",
      "text": "I wish there was a set of 2-4 SCOTUS’s that we elected. We could hold elections for 2 of them one years and then a couple years later elect the others so that there’s a cohort that are changing every several years like Senators. And the elected justices would have 5-9 year terms. I feel like having some elected Justices would help balance the power and put more control in the hands of the people.",
      "timestamp": "2022-07-26 18:46:40",
      "score": 1,
      "num_children": 0,
      "author": 10817,
      "replies": []
    },
    {
      "id": "ihrba62",
      "text": "I believe they are LUCKY if all we do is expand the court. \n\nI’ve never seen such bullshit, and I’m just waiting for the chance to abolish the Supreme Court and the senate and the electoral college and send all of these motherfuckers to criminal trials.\n\nI absolutely live for this now, for the rest of my life. I want to see them brought to heel.",
      "timestamp": "2022-07-26 19:59:25",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ihrf2oi",
      "text": "DON'T EXPAND IT. ABOLISH IT.",
      "timestamp": "2022-07-26 20:23:19",
      "score": 1,
      "num_children": 0,
      "author": 291293,
      "replies": []
    },
    {
      "id": "ihrrtbq",
      "text": "We should abolish the court entirely",
      "timestamp": "2022-07-26 21:45:32",
      "score": 1,
      "num_children": 0,
      "author": 130826,
      "replies": []
    },
    {
      "id": "ihrw6xf",
      "text": "LMAO! They have done none of those things. Hyperbole lives rent free in your head.",
      "timestamp": "2022-07-26 22:15:11",
      "score": 1,
      "num_children": 0,
      "author": 35543,
      "replies": []
    },
    {
      "id": "ihryrv4",
      "text": "I’d rather abolish such an undemocratic institution",
      "timestamp": "2022-07-26 22:33:06",
      "score": 1,
      "num_children": 0,
      "author": 176707,
      "replies": []
    },
    {
      "id": "ihs5s9u",
      "text": "So if i want to make something illegal. And the thing should be good. Then i should be in the SC you say. Interesting",
      "timestamp": "2022-07-26 23:24:38",
      "score": 1,
      "num_children": 0,
      "author": 108653,
      "replies": []
    },
    {
      "id": "ihosx0q",
      "text": "Honestly the partisan legislature should have no say in the political composition of justices and instead the census should be more frequent and should record the general public’s political opinions on major issues with the Supreme Court’s composition based solely on the census data. This would in turn remove partisan politics from the court and would make it far more representative of the will of the people.\n\nAdditionally the power of the court should be massively checked & reduced as currently the court is easily the most powerful branch of government as it has the power to set in stone or demolish any law they see fit.",
      "timestamp": "2022-07-26 07:51:10",
      "score": -1,
      "num_children": 0,
      "author": 237924,
      "replies": []
    },
    {
      "id": "iho9sbr",
      "text": "Agreed, but how the hell are we going to do that with the filibuster in place?",
      "timestamp": "2022-07-26 04:12:45",
      "score": 0,
      "num_children": 0,
      "author": 327114,
      "replies": []
    },
    {
      "id": "ihodwwe",
      "text": "Have the courts decide if judicial review is stated in the Constitution.",
      "timestamp": "2022-07-26 04:52:59",
      "score": 0,
      "num_children": 0,
      "author": 125526,
      "replies": []
    }
  ]
}