{
  "id": "wc3jxa",
  "text": "Today’s reality; fake accusations are on the rise…\n",
  "timestamp": "2022-07-30 18:06:56",
  "score": 722,
  "subreddit": "t5_2zaj2",
  "num_children": 28,
  "replies": [
    {
      "id": "iiaipmp",
      "text": "Sadly, I think this is a sensible idea even if it does seem at first to be an extreme measure. There is a relentless war on men and masculinity and minimising interactions and contact is clearly not enough; self-protection and reliable documentation are necessary - without which a female is more likely to be believed of an accusation towards a male, rather than vice-versa. Women are innocent until proven guilty; men are guilty until proven innocent. \n\nWhat I would like to know is *why* are so many fake accusations on the rise? What is the root of these lies and motivations?",
      "timestamp": "2022-07-30 19:21:09",
      "score": 65,
      "num_children": 3,
      "author": 244331,
      "replies": [
        {
          "id": "iiehdpv",
          "text": "Em... Feminists being gravely offended on men, seeing that men are backing away from them but wanting to squeeze whatever they can from them?",
          "timestamp": "2022-07-31 17:02:45",
          "score": 8,
          "num_children": 0,
          "author": 394886,
          "replies": []
        },
        {
          "id": "iid1hlq",
          "text": "No.\n\nThe study was based on 2,643 sexual assault cases, of these, police classified 8% as false reports based on police judgement, and the rate was 2.5% when determined using official criteria for false reports.\n\nhttps://www.abc.net.au/triplej/programs/hack/false-rape-allegations-myths/13281852\n\nhttps://www.nsvrc.org/sites/default/files/2012-03/Publications_NSVRC_Overview_False-Reporting.pdf",
          "timestamp": "2022-07-31 09:01:53",
          "score": -13,
          "num_children": 2,
          "author": 267855,
          "replies": [
            {
              "id": "iidbxph",
              "text": "5% are proved to be false, this doesn't mean it's only 5%. SA is so vague that some women think that touching of shoulder by men can be this.",
              "timestamp": "2022-07-31 11:23:44",
              "score": 23,
              "num_children": 1,
              "author": 204222,
              "replies": [
                {
                  "id": "iidie4o",
                  "text": "And? Not all actual rapes are proven, what’s your point.",
                  "timestamp": "2022-07-31 12:34:52",
                  "score": -5,
                  "num_children": 2,
                  "author": 267855,
                  "replies": [
                    {
                      "id": "iidimw7",
                      "text": "You think just because 5% are proven to be false then 95% are true. Like you said some actual bad things can't be proven and those don't go to this 5%, but in majority of cases that are to vauge to say it was true or false",
                      "timestamp": "2022-07-31 12:37:18",
                      "score": 10,
                      "num_children": 1,
                      "author": 204222,
                      "replies": [
                        {
                          "id": "iiditf4",
                          "text": "No, I don’t believe that. There’s a difference between maliciously false rape accusations and misunderstandings.",
                          "timestamp": "2022-07-31 12:39:06",
                          "score": -6,
                          "num_children": 2,
                          "author": 267855,
                          "replies": [
                            {
                              "id": "iidj48h",
                              "text": "Ofc, because you have to believe all women",
                              "timestamp": "2022-07-31 12:42:00",
                              "score": 9,
                              "num_children": 1,
                              "author": 204222,
                              "replies": [
                                {
                                  "id": "iidj6i4",
                                  "text": "I never said that.",
                                  "timestamp": "2022-07-31 12:42:37",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 267855,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "iieds68",
                              "text": "What a privilege women have since Men have 0 room for error when it comes to “misunderstandings”",
                              "timestamp": "2022-07-31 16:37:43",
                              "score": 7,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iiee2op",
                                  "text": "That’s how crimes work. Everything can be twisted in court.",
                                  "timestamp": "2022-07-31 16:39:47",
                                  "score": 0,
                                  "num_children": 0,
                                  "author": 267855,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iief4vw",
                      "text": "The point is that the number of false accusations are likely to be higher since not all false accusations are proven to be false. That said it’s obvious from your tone and dismissive of this fact that you simply do not care that men’s lives are being destroyed every day by false accusations.",
                      "timestamp": "2022-07-31 16:47:11",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iiefpfa",
                          "text": "It’s not something you have to worry about on a day to day basis, what you should worry about is some guy raping you because there’s a wayyyyyy bigger chance of that happening.\n\nhttps://www.independent.co.uk/voices/gang-rape-trial-ayia-napa-false-accusation-sexual-assault-cyprus-israel-a9131796.html",
                          "timestamp": "2022-07-31 16:51:07",
                          "score": -3,
                          "num_children": 1,
                          "author": 267855,
                          "replies": [
                            {
                              "id": "iieha0b",
                              "text": "That is like saying, you have a much higher chance of dying from heart disease so we are not going to worry or address the 2% chance of you dying from COVID. \n\nI do not understand why people like you believe that by addressing an issue that men face that it replaces and diminishes issues that women face (which is doesn’t). This is same exact issue that the Asian community faces when it comes to racism and violence towards them. People believe we can’t address hate towards Asian community because it distracts from addressing hate towards the black community.",
                              "timestamp": "2022-07-31 17:02:02",
                              "score": 3,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iiemflo",
                                  "text": "I do believe mens issues are valid and should be addressed. What I’m saying is, putting a body cam on yourself is blowing it out of proportion.",
                                  "timestamp": "2022-07-31 17:38:05",
                                  "score": 0,
                                  "num_children": 1,
                                  "author": 267855,
                                  "replies": [
                                    {
                                      "id": "iir30uc",
                                      "text": "It seems blown out of proportion until YOUR brother, son or male friend is falsely accused. Even if a man is proven innocent his entire life and reputation is ruined.",
                                      "timestamp": "2022-08-03 06:52:29",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 119296,
                                      "replies": [
                                        {
                                          "id": "iir6zzf",
                                          "text": "Statistically it would still be blown out of proportion. It’s still terrible that it happens it’s just rare.",
                                          "timestamp": "2022-08-03 07:43:07",
                                          "score": 0,
                                          "num_children": 1,
                                          "author": 267855,
                                          "replies": [
                                            {
                                              "id": "iira09k",
                                              "text": "I wasn't talking about statistics, that's not even a concern when a loved ones life is being ruined. However, you say \"statistically it would be blown out of proportion\" without even providing me any US statistics.",
                                              "timestamp": "2022-08-03 08:23:01",
                                              "score": 1,
                                              "num_children": 2,
                                              "author": 119296,
                                              "replies": [
                                                {
                                                  "id": "iirg6a9",
                                                  "text": "https://www.channel4.com/news/factcheck/factcheck-men-are-more-likely-to-be-raped-than-be-falsely-accused-of-rape\n\nhttps://www.abc.net.au/triplej/programs/hack/false-rape-allegations-myths/13281852\n\nhttps://www.nsvrc.org/sites/default/files/2012-03/Publications_NSVRC_Overview_False-Reporting.pdf\n\nhttps://www.police.vic.gov.au/sites/default/files/2019-01/FINAL-factsheet-for-web-Challenging-Misconceptions.pdf",
                                                  "timestamp": "2022-08-03 09:46:24",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 267855,
                                                  "replies": [
                                                    {
                                                      "id": "iithlit",
                                                      "text": "One of the articlesyou sent me said it best. \n>\"Undoubtedly, there will be other cases of false allegations being made where there was not enough evidence to bring a prosecution of wasting police time or perverting the course of justice. But we don’t have data to quantify\"\n\nAlso, the article from triplej seems extremely bias and tries to excuse women who falsely accuse men. \n \nMother's wanting to protect their sons, sisters wanting to protect their brothers isn't overreacting. It's very obvious you've never had someone you care about be falsely accused but even if a boy/man has a false allegation that's not prosecuted, it follows him forever and he's always branded a rapist with his life effectively ruined.",
                                                      "timestamp": "2022-08-03 19:06:05",
                                                      "score": 2,
                                                      "num_children": 1,
                                                      "author": 119296,
                                                      "replies": [
                                                        {
                                                          "id": "iiw0ayp",
                                                          "text": "Plane crashes are rare, but they’re still terrible. I’m not downplaying the severity of it I’m saying tha5 it doesn’t happen so much that you need a body cam.\n\nYou’re right I don’t know anyone but when I was 15 I knew at least 10 girls who got raped and never reported it to the cops.",
                                                          "timestamp": "2022-08-04 07:37:43",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 267855,
                                                          "replies": [
                                                            {
                                                              "id": "iiwge73",
                                                              "text": "Even air planes have black boxes to record what happens in the event of a crash. Actually they have two. One records pilots conversions and announcements, the other is to record to help reconstruct what happend with the plane leading up to the crash. Are you suggesting planes should do away with these because plane crashes are rare? \n\n\nI was certain you didnt, by the time I was 13 I knew at least 5 girls who falsely accused younger men and a few boys of rape. 2 of the girls had the audacity to openly brag that they were never raped but wanted to ruin their reputation. At least one was cheating on their boyfriend and when the boyfriend found out, she claimed the boy she was cheating with raped her.",
                                                              "timestamp": "2022-08-04 11:06:47",
                                                              "score": 2,
                                                              "num_children": 1,
                                                              "author": 119296,
                                                              "replies": [
                                                                {
                                                                  "id": "iiwz419",
                                                                  "text": "No? I literally stated that it was terrible that implies people shouldn’t get away with it.\n\nI mean if they’re younger men (I’m assuming that’s 18+) sleeping with 13 year olds it is statutory rape.\n\nThey sound like terrible people and I hope they get punishment they deserve.",
                                                                  "timestamp": "2022-08-04 13:49:14",
                                                                  "score": 0,
                                                                  "num_children": 1,
                                                                  "author": 267855,
                                                                  "replies": [
                                                                    {
                                                                      "id": "iiwzhql",
                                                                      "text": "Do you not know how to read? Obviously not, didn't say any men slept with a 13 year old.",
                                                                      "timestamp": "2022-08-04 13:51:57",
                                                                      "score": 2,
                                                                      "num_children": 1,
                                                                      "author": 119296,
                                                                      "replies": [
                                                                        {
                                                                          "id": "iiwztl8",
                                                                          "text": "Sorry not everyone can be native English speakers.",
                                                                          "timestamp": "2022-08-04 13:54:21",
                                                                          "score": 0,
                                                                          "num_children": 1,
                                                                          "author": 267855,
                                                                          "replies": [
                                                                            {
                                                                              "id": "iix05nx",
                                                                              "text": "You seem to be just fine at it when you think you're proving a point.",
                                                                              "timestamp": "2022-08-04 13:56:43",
                                                                              "score": 2,
                                                                              "num_children": 1,
                                                                              "author": 119296,
                                                                              "replies": [
                                                                                {
                                                                                  "id": "iix0d6v",
                                                                                  "text": "Spelling and reading comprehension are two different things.",
                                                                                  "timestamp": "2022-08-04 13:58:11",
                                                                                  "score": 1,
                                                                                  "num_children": 1,
                                                                                  "author": 267855,
                                                                                  "replies": [
                                                                                    {
                                                                                      "id": "iix0lg0",
                                                                                      "text": "That has absolutely nothing to do with the comment I made. Stop trying to change the subject.",
                                                                                      "timestamp": "2022-08-04 13:59:49",
                                                                                      "score": 2,
                                                                                      "num_children": 1,
                                                                                      "author": 119296,
                                                                                      "replies": [
                                                                                        {
                                                                                          "id": "iix0w4r",
                                                                                          "text": "Okay, let’s try this.\n\nYour anecdotal evidence doesn’t mean whole lot nor does mine. I’m simply talking from a statical standpoint.",
                                                                                          "timestamp": "2022-08-04 14:01:51",
                                                                                          "score": 1,
                                                                                          "num_children": 1,
                                                                                          "author": 267855,
                                                                                          "replies": [
                                                                                            {
                                                                                              "id": "iix1hhi",
                                                                                              "text": "I wasn't making that argument, I said it's not blown out of proportion for mothers to want to protect their sons from awful girls who want to ruin their life. \n\nYou then brought up airplanes and proved my point that it's not overblown. \n\nThanks, have a good day.",
                                                                                              "timestamp": "2022-08-04 14:06:02",
                                                                                              "score": 2,
                                                                                              "num_children": 0,
                                                                                              "author": 119296,
                                                                                              "replies": []
                                                                                            }
                                                                                          ]
                                                                                        }
                                                                                      ]
                                                                                    }
                                                                                  ]
                                                                                }
                                                                              ]
                                                                            }
                                                                          ]
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                },
                                                {
                                                  "id": "iirgkc3",
                                                  "text": "They AUS statistics.",
                                                  "timestamp": "2022-08-03 09:51:34",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 267855,
                                                  "replies": [
                                                    {
                                                      "id": "iithudc",
                                                      "text": "Which is not where this conversation was about.",
                                                      "timestamp": "2022-08-03 19:07:49",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 119296,
                                                      "replies": [
                                                        {
                                                          "id": "iiw0dhi",
                                                          "text": "Cmon, AUS and the US are close to the same, both English speaking, western first world countries.",
                                                          "timestamp": "2022-08-04 07:38:41",
                                                          "score": 0,
                                                          "num_children": 0,
                                                          "author": 267855,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "iide7sp",
              "text": "In most jurisdictions about the same percentage are proven true as are proven false. Anyone arguing that the 80%+ of cases reported to the police that don't have enough evidence to prove if they are true or false, plus all the public accusations that are not made to the police are all true is either horribly ignorant or horribly disingenuous.",
              "timestamp": "2022-07-31 11:50:25",
              "score": 4,
              "num_children": 1,
              "author": 65062,
              "replies": [
                {
                  "id": "iidih1d",
                  "text": "That doesn’t mean they’re maliciously false accusations. And I’d like to see a source.",
                  "timestamp": "2022-07-31 12:35:39",
                  "score": 1,
                  "num_children": 1,
                  "author": 267855,
                  "replies": [
                    {
                      "id": "iidlqov",
                      "text": "Look at the western world false accusation rates - 2-8% proven false depending on jurisdiction. Look at the western world conviction rates for cases reported to the police - 1-9% depending on jurisdiction. It doesn't matter if the false accusation is malicious or not  Your life is destroyed either way.  Both rape and false rape accusations are horrible. We don't need to pretend they aren't.",
                      "timestamp": "2022-07-31 13:06:31",
                      "score": 5,
                      "num_children": 1,
                      "author": 65062,
                      "replies": [
                        {
                          "id": "iidm6al",
                          "text": "I never said they weren’t horrible, i was saying y’all were blowing it out of proportion.",
                          "timestamp": "2022-07-31 13:10:31",
                          "score": 1,
                          "num_children": 1,
                          "author": 267855,
                          "replies": [
                            {
                              "id": "iidmm2s",
                              "text": "\"Less than 10% of rape accusations are true. You're blowing rape as a problem out of proportion.\"\n\nSounds kinda dismissive and asshole-ish, no?",
                              "timestamp": "2022-07-31 13:14:30",
                              "score": 2,
                              "num_children": 1,
                              "author": 65062,
                              "replies": [
                                {
                                  "id": "iidn4u5",
                                  "text": "https://www.nsvrc.org/sites/default/files/publications_nsvrc_factsheet_media-packet_statistics-about-sexual-violence_0.pdf, one in five women will be raped in their lifetime. So less than 10% sounds weird. But then again rape is the most underreported crime.",
                                  "timestamp": "2022-07-31 13:19:13",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 267855,
                                  "replies": [
                                    {
                                      "id": "iidnmaa",
                                      "text": "\"But 90% aren't proven true, so they are false.\"\n\nSounds kinda demissive, no?\n\n\nAround here, we know those \"rape\" statistics feminists repeatedly quote are based on Mary Koss's sexist bigoted methodologies and exclude nonconsensual envelopment of a penis as rape.\n\nShe is a world renowned expert on sexual violence. This is her methodology:\n\n> > Although consideration of male victims is within the scope of the legal statutes, it is important to restrict the term rape to instances where male victims were penetrated by offenders. It is inappropriate to consider as a rape victim a man who engages in unwanted sexual intercourse with a woman.\n\n\n[NISVS 2010](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf) showed that in the past 12 months, 1.1% of men were made to penetrate and 1.1% of women were raped. Look at Table 2.1 and 2.2 on pages 18 and 19 respectively.\n\n[NISVS 2011](https://www.cdc.gov/mmwr/pdf/ss/ss6308.pdf) showed that in the past 12 months, 1.7% of men were made to penetrate and 1.6% of women were raped. Look at Table 1 on page 5.\n\n[NISVS 2012](https://www.cdc.gov/violenceprevention/pdf/NISVS-StateReportBook.pdf) showed that in the past 12 months, 1.7% of men were made to penetrate and 1.0% of women were raped. Look at Table A.1 and A.5 on pages 217 and 222 respectively.\n\n[NISVS 2015](https://www.cdc.gov/violenceprevention/pdf/2015data-brief508.pdf) showed that in the past 12 months, 0.7% of men were made to penetrate and 1.2% of women were raped. Look at Table 1 and 2 on page 15 and 16 respectively\n\n\n\nVaries a bit from year to year, but pretty even overall. In both cases the four year annual percentages add up to five. The numbers for perpetrators vary a little from year to year too. Something like 79-84% of made to penetrate (nonconsensual envelopment) victims are victimized by women. Something like 96-99% of rape (nonconsensual penetration) victims are victimized by men. So in the 2010s, it averages out that a typical year has about 60% men and 40% women as perpetrators of nonconsensual sex outside prisons rather than the 99/1 ratio typically discussed.\n\nAgain, in 2010s about equal victims and 60/40 perpetrator split between the sexes when talking about *nonconsensual sex* rather than narrowly defined rape.\n\nIf you don't like the CDC surveying victims...\n\nhttps://www.scientificamerican.com/article/sexual-victimization-by-women-is-more-common-than-previously-known cites among other things an academic study of perpetrators.\n\n> A recent study of youth found, strikingly, that females comprise 48 percent of those who self-reported committing rape or attempted rape at age 18-19.\n\nor\n\nhttps://www.theatlantic.com/science/archive/2016/11/the-understudied-female-sexual-predator/503492/ cites a NIH study that includes self reported perpetrators.\n\n> National Epidemiologic Survey on Alcohol and Related Conditions found in a sample of 43,000 adults little difference in the sex of self-reported sexual perpetrators. Of those who affirmed that they had ‘ever forced someone to have sex with you against their will,’ 43.6 percent were female and 56.4 percent were male.”\n\nBoth those articles are really informative and shocking to people who have just been listening to the narrative.",
                                      "timestamp": "2022-07-31 13:23:25",
                                      "score": 5,
                                      "num_children": 2,
                                      "author": 65062,
                                      "replies": [
                                        {
                                          "id": "iidvxwi",
                                          "text": ">Mary Koss's sexist bigoted methodologies and exclude nonconsensual envelopment of a penis as rape.\n\nhttps://m.soundcloud.com/889-wers/male-rape\n\nThere's a bit in there about 3/4 through where Mary Koss is asked about male victims of female perps, scoffs at the idea that that can even happen and when given a case where a man is drugged into compliance dubs it not to be rape, but merely unwanted contact.",
                                          "timestamp": "2022-07-31 14:29:43",
                                          "score": 4,
                                          "num_children": 0,
                                          "author": 229549,
                                          "replies": []
                                        },
                                        {
                                          "id": "iidnyg0",
                                          "text": "That (NISVIS) was with sexual partners, that a whole different story.",
                                          "timestamp": "2022-07-31 13:26:22",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 267855,
                                          "replies": [
                                            {
                                              "id": "iidoely",
                                              "text": "Baloney. The 1 in 5 statistic comes from it! That is the source data for your link! The stats aren't based on relationship with who raped/made to penetrate.  Besides, the overwhelming majority of both men and women are raped by their SO, not random rapists jumping out of bushes in the night so your argument would still be crap even if not misinformed.",
                                              "timestamp": "2022-07-31 13:30:13",
                                              "score": 4,
                                              "num_children": 1,
                                              "author": 65062,
                                              "replies": [
                                                {
                                                  "id": "iidpffa",
                                                  "text": "I know most people get raped by people they know but it doesn’t have to be their SO.",
                                                  "timestamp": "2022-07-31 13:38:55",
                                                  "score": 2,
                                                  "num_children": 0,
                                                  "author": 267855,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iiaztkv",
          "text": "First you would need to show that fake accusations ARE on the rise. I mean, are they? Do you have any sources to show that? Is there even a way to show this at all?",
          "timestamp": "2022-07-30 21:27:19",
          "score": -33,
          "num_children": 1,
          "author": 237947,
          "replies": [
            {
              "id": "iib1rc7",
              "text": "Look at how many women jumped on the #metoo bandwagon hoping to destroy men's lives and careers. Believe all women? What *all* of them? The Weinstein thing was a public display of centuries of passive aggression. What better way to destroy a man's life than with a false accusation?\n\nMore recently the Amber Heard trial showed unsubstantiated claims of domestic abuse, with Heard being the actual abuser now currently bankrupt from losing the trial.",
              "timestamp": "2022-07-30 21:41:50",
              "score": 26,
              "num_children": 1,
              "author": 244331,
              "replies": [
                {
                  "id": "iib2tah",
                  "text": "That doesn't answer my question at all. So, I'm guessing no, you don't know if they're on the rise?",
                  "timestamp": "2022-07-30 21:49:42",
                  "score": -22,
                  "num_children": 1,
                  "author": 237947,
                  "replies": [
                    {
                      "id": "iib3brv",
                      "text": "Right, okay. Believe all women. All of them. But, simultaneously disbelieve all men.\n\nIncidentally, I looked at yout profile. You are clearly just causing trouble so I suspect you are just another maladjusted spiteful mutant. I noticed also you asked the askedfeminist subreddit a question about work in relation to a man and have no SO to ask. Which doesn't surprise me. Which brand of wine and cat food do you purchase? Whatever your answer I will try my best to believe you.",
                      "timestamp": "2022-07-30 21:53:36",
                      "score": 14,
                      "num_children": 1,
                      "author": 244331,
                      "replies": [
                        {
                          "id": "iib4cz5",
                          "text": "I didn't say that did I? I asked do you know for sure or have any proof that false accusations are on the rise, which is something that you stated. You clapped back with metoo. Just because there was a social movement to allow people (women and men) to speak out about the sexual harassment and sexual assault they suffered, doesn't in any way prove that false allegations are on the rise. Just admit you made that up, I'm guessing you want it to be true, but you don't know, do you?\n\n\nEdit: pretty pathetic to block someone just because they questioned something you wrote, so you're obviously not commenting in good faith.\nAnd your little edit is even sadder. To answer your question, I like pinot grigio wine and beer also, and I don't have any cats, I actually love cats and would love to have one, but I work long hours and can't give enough time or attention to a pet.. What's your excuse for being a childish asshole? Oh, you probably are a child, right?\n\n\n\nEdit: to the crimson fckr 94 below :\n\n\n\nYou've also blocked me, there's nothing more pathetic than someone who replies to you then immediately blocks you so you can't reply back. Scared you'll get exposed for your ignorance eh? How childish. \nAnyway, here's the reply I was planning to leave for the comment below:\n\n\n\nBut the claim was that false accusations are on the rise. For that, you would have to have reliable statistics from say, 10 years ago, 20 years ago, and today, and actually be able to see an upward trend. All those stories you listed are terrible but they don't prove that false accusations are on the rise, they may just, for example, prove that false accusations are on the media's radar more than before and so being reported more. Do you see what I mean?",
                          "timestamp": "2022-07-30 22:01:36",
                          "score": -9,
                          "num_children": 5,
                          "author": 237947,
                          "replies": [
                            {
                              "id": "iib8ykg",
                              "text": "I'll give you proof. Bill Cosby was accused by multiple women of sexual assault. Was he guilty? Yes, and rightfully punished. But several women's accusations were proven to be false.\n\nAmber Heard accused Johnny Depp of domestic abuse. She still parades around as a \"victim\" and many people still believe her, despite the fact that her lies were uncovered and she was found guilty of slander.\n\nDuke University's men's lacrosse team. 3 players and one coach had their reputations and lives ruined because one girl falsely accused the players of sexual assaulting her at a party they weren't even at.\n\nUniversity of Virginia. An entire fraternity house was vandalized and dismantled due to a false rape allegation. The truth came out because \"Jackie's\" friends noticed holes in her story and her behaviour (refusing to report it to the police, not seeking medical help).\n\nA 17 year old boy was accused by a female of sexual assault, but her claim was proven false. Even though he was proven innocent, he couldn't recover from the ire of the public and committed suicide. His mother later committed suicide following his death \n\nThese are just examples in an almost 20 year timespan, with many more that didn't make national headlines.",
                              "timestamp": "2022-07-30 22:37:38",
                              "score": 14,
                              "num_children": 0,
                              "author": 407303,
                              "replies": []
                            },
                            {
                              "id": "iib51x5",
                              "text": "Bye Karen.",
                              "timestamp": "2022-07-30 22:07:00",
                              "score": 11,
                              "num_children": 0,
                              "author": 244331,
                              "replies": []
                            },
                            {
                              "id": "iic4vyl",
                              "text": "Clearly I didn't block you if I'm responding to you. Now we can all see your ability to assume first and inability to rationalize later. Get bent, mate",
                              "timestamp": "2022-07-31 02:57:24",
                              "score": 3,
                              "num_children": 0,
                              "author": 407303,
                              "replies": []
                            },
                            {
                              "id": "iibphzk",
                              "text": "Bro you just missed his entire point ☠️",
                              "timestamp": "2022-07-31 00:50:25",
                              "score": 1,
                              "num_children": 0,
                              "author": 267542,
                              "replies": []
                            },
                            {
                              "id": "iim4iaf",
                              "text": ">All those stories you listed are terrible but they don't prove that false accusations are on the rise, they may just, for example, prove that false accusations are on the media's radar more than before and so being reported more.\n\nIf false allegations are on the media's radar more than before and are being reported on more than before, THEN FALSE ALLEGATIONS ARE ON THE RISE, YOU UNSWALLOWED CUMSHOT",
                              "timestamp": "2022-08-02 07:03:43",
                              "score": 1,
                              "num_children": 0,
                              "author": 407303,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iiagjmg",
      "text": "Good idea. Too bad this won't work everywhere since some areas have two-party consent laws for recording and no woman would ever consent to being recorded.",
      "timestamp": "2022-07-30 19:05:20",
      "score": 66,
      "num_children": 1,
      "author": 347422,
      "replies": [
        {
          "id": "iiaiftc",
          "text": "Then don't interact with them. In America any public place can be recorded the only time it would be an issue is in private.",
          "timestamp": "2022-07-30 19:19:14",
          "score": 44,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iiai48b",
      "text": "Men aren't safe anywhere.",
      "timestamp": "2022-07-30 19:16:52",
      "score": 51,
      "num_children": 2,
      "replies": [
        {
          "id": "iiak1vv",
          "text": "Well, perhaps it depends on your lifestyle, where you work and who you interact with socially and professionally.  I think it's good to exercise caution and be aware  at all times though. Essentially it's about the spaces we are in, the behaviours and actions of ourselves as individuals and the careful choice of our words. All about self-awareness and gauging a situation before anything potentially messy can arise. \n\nPersonally, I avoid social situations involving alcohol (I no longer drink) because it impairs judgement severely in some cases.",
          "timestamp": "2022-07-30 19:30:52",
          "score": 11,
          "num_children": 1,
          "author": 244331,
          "replies": [
            {
              "id": "iianmm3",
              "text": "I drink with friends I know I can trust. But not with women anymore. I think this is the whole thing: now we have to watch our backs because it's common sense between some women that men worth less than shit.",
              "timestamp": "2022-07-30 19:57:13",
              "score": 12,
              "num_children": 1,
              "replies": [
                {
                  "id": "iiary8s",
                  "text": "[removed]",
                  "timestamp": "2022-07-30 20:28:59",
                  "score": 8,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "iiau7wh",
                      "text": "I don't think their problem is the lack of a father. But your description of the situation in the relationship between men and women is precise.",
                      "timestamp": "2022-07-30 20:45:23",
                      "score": 8,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iiavm27",
                          "text": "A mother with a radical feminist ideology can indoctrinate a daughter more easily without a father figure around. The perfect scapegoat - all men are bad. All men must be punished. Take this idea to the corporate workplace and you have 'boss bitch' types who believe they are superior to men. Feminism has mutated into this. \n\nLook at how the media portrays men and fathers as 'deadbeat dads.' But, don't forget...women are the eternal victims.",
                          "timestamp": "2022-07-30 20:55:50",
                          "score": 9,
                          "num_children": 1,
                          "author": 244331,
                          "replies": [
                            {
                              "id": "iiaw2k7",
                              "text": "This is a very specific situation. Today single mothers may be feminazists but this wasn't always the case. The problem isn't the lack of fathers. The problem is the lack of contact with men.",
                              "timestamp": "2022-07-30 20:59:17",
                              "score": 3,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iiax9vu",
                                  "text": "A lack of stable, meaningful relationships with men perhaps. Feminists will play the independent, strong woman card to procure high body-counts - they are having sexual activity and contact with many men, digitally, physically.  \n\nGender norms are entirely unique and different with this wave of feminism. You now have women being masculine, openly stating they are in their masculine frame; competing in the workplace like men, interacting and having no-strings sex like men. This is a complete role reversal, we are asking ourselves as a society 'what is a woman?'",
                                  "timestamp": "2022-07-30 21:08:24",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 244331,
                                  "replies": [
                                    {
                                      "id": "iiaxkn2",
                                      "text": "Perfect. I wouldn't put it in better terms.",
                                      "timestamp": "2022-07-30 21:10:39",
                                      "score": 2,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "iiaz01v",
                                          "text": "I strongly believe radical feminism is a contributing factor to the decline and inevitable collapse of Western civilization. Similar things happened in Rome; homosexuality being socially acceptable, an abundance of low-hanging resources such as food and access to medicines, a movement similar to feminism whereby women are pedestalized and allowed political views, a decrease in general population IQ. Emasculation of men, too.",
                                          "timestamp": "2022-07-30 21:21:09",
                                          "score": 3,
                                          "num_children": 1,
                                          "author": 244331,
                                          "replies": [
                                            {
                                              "id": "iiazcjs",
                                              "text": "I wouldn't talk about population IQ... But it seems like a proper approach.",
                                              "timestamp": "2022-07-30 21:23:45",
                                              "score": 2,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "iib0dm3",
                                                  "text": "People worship celebrity culture. What further evidence do you need?\n\nWoke is the religion which has replaced Christianity. A Norwegion feminist has recently been jailed for three years for saying men can't be lesbians - I have to wonder if this woke ideology is somehow flawed",
                                                  "timestamp": "2022-07-30 21:31:27",
                                                  "score": 3,
                                                  "num_children": 1,
                                                  "author": 244331,
                                                  "replies": [
                                                    {
                                                      "id": "iib4yjp",
                                                      "text": "First: you may speak of a decrease in general population IQ today. But for sure, you can’t speak of a decrease in general population IQ in the Roman Empire’s fall.\n\nSecond: The Roman Empire didn’t work the same way modern societies do. You can’t just talk about the performance of societies while looking at the overall quality of the population. It isn’t like one society is doing better than another just because their output has more of this or more of that.\n\nThird: the \"decrease in general population IQ\" and the \"worship of celebrities\" are consequences of a set of factors. Not only feminism. I don’t know if they could have been avoided. But they would not have been as bad if the United States had not neglected public education, for example. This whole cultural crisis could be understood by different perspectives that don’t take feminism as a key factor. For example, we could understand it as the normal and logical continuation of the mass culture of the XX century’s last decades.",
                                                      "timestamp": "2022-07-30 22:06:16",
                                                      "score": 2,
                                                      "num_children": 0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iiht76b",
                      "text": "Feminism isn't synonymous with women. Criticize the ideology. Don't hate a gender.",
                      "timestamp": "2022-08-01 11:20:37",
                      "score": 3,
                      "num_children": 0,
                      "author": 40076,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iid1odq",
          "text": "Yes, they are.\n\nThe study was based on 2,643 sexual assault cases, of these, police classified 8% as false reports based on police judgement, and the rate was 2.5% when determined using official criteria for false reports.\n\nhttps://www.abc.net.au/triplej/programs/hack/false-rape-allegations-myths/13281852\n\nhttps://www.nsvrc.org/sites/default/files/2012-03/Publications_NSVRC_Overview_False-Reporting.pdf",
          "timestamp": "2022-07-31 09:04:32",
          "score": -3,
          "num_children": 0,
          "author": 267855,
          "replies": []
        }
      ]
    },
    {
      "id": "iibi0ma",
      "text": "False accusations are on the rise because they’re no consequences. If girls and women knew that a false accusation of rape would garner the same sentence as a man convicted of rape plus a hefty fine then false accusations would plummet.",
      "timestamp": "2022-07-30 23:49:52",
      "score": 31,
      "num_children": 2,
      "author": 304888,
      "replies": [
        {
          "id": "iid1mz7",
          "text": "Individuals suspected of making a false accusation of rape may be charged with the civil crime of \"wasting police time\" or the criminal charge of \"Perverting the Course of Justice\". Over a five-year period ending in 2014, a total of 109 women were prosecuted for crimes related to making false accusations of rape. \n\nhttps://en.wikipedia.org/wiki/False_accusation_of_rape",
          "timestamp": "2022-07-31 09:04:00",
          "score": 1,
          "num_children": 1,
          "author": 267855,
          "replies": [
            {
              "id": "iiej98l",
              "text": "I have never seen a woman go to jail for a false accusation.",
              "timestamp": "2022-07-31 17:15:54",
              "score": 6,
              "num_children": 1,
              "author": 400790,
              "replies": [
                {
                  "id": "iiemhr3",
                  "text": "Anecdotal evidence doesn’t mean a whole lot.",
                  "timestamp": "2022-07-31 17:38:30",
                  "score": 0,
                  "num_children": 0,
                  "author": 267855,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iid2stq",
          "text": "Actively falsely accusing someone of a crime with the hopes of them being punished for it is already illegal, it's really easy to win a defamation of character case if someone falsely accuses you of rape. However, defamation of character cases cannot take place when a rape accusation cannot be proven to be either true or false, in that case neither party would be punished.\n\nSending someone to jail for life because of a defamation of character case is just not in line with the severity of the crime, but you can definitely and should definitely receive money as well as public apologies from the accuser.",
          "timestamp": "2022-07-31 09:20:03",
          "score": -1,
          "num_children": 1,
          "author": 182746,
          "replies": [
            {
              "id": "iieah8f",
              "text": "Sure... Have we ever seen a woman go to jail because of a false acusation? Women even face the same jail time as men for molesting a child, and you want to talk about the law as if there wasn't a strong bias in favor of women?!  \nDo us a favor. Get your feminist garbage and get lost. We don't need your bullshit.",
              "timestamp": "2022-07-31 16:14:24",
              "score": 6,
              "num_children": 1,
              "replies": [
                {
                  "id": "iig9we9",
                  "text": "Jemma Beale, 10 years for false accusations in 2017 amongst others. It's really not that hard to use the internet and find cases of people being jailed or punished for false rape accusations lol.\n\nPolice sexually assault over 120 woman each year in America alone. Women do receive about 25% shorter sentences for the same crimes, and it should not be that way. Women are also assaulted twice as often by jail guards, no one should be assaulted by guards. You cannot pick 1 metric to decide the entire law and jail system is biased towards women.\n\nIf you did you'd have to admit the entire system is racist too entirely because white men receive 25% shorter sentences than black men for the same crimes with the same criminal records.\n\nThere's no garbage here, just facts that you're too scared to accept. You're welcome to go actually read up on this topic before you try argue on it again?",
                  "timestamp": "2022-08-01 01:00:01",
                  "score": 0,
                  "num_children": 0,
                  "author": 182746,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iibb5di",
      "text": "Be good practice dealing with police, too",
      "timestamp": "2022-07-30 22:54:45",
      "score": 8,
      "num_children": 0,
      "author": 5933,
      "replies": []
    },
    {
      "id": "iiaonx9",
      "text": "Her account on Twitter was suspended",
      "timestamp": "2022-07-30 20:04:58",
      "score": 17,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iicq4fo",
      "text": "Lol even if you have video evidence that you didn’t do shit it doesn’t matter. If the woman _feeeeels_ like she was raped, you’re guilty.",
      "timestamp": "2022-07-31 06:30:43",
      "score": 9,
      "num_children": 1,
      "author": 254345,
      "replies": [
        {
          "id": "iid1rx0",
          "text": "No.\n\nThe study was based on 2,643 sexual assault cases, of these, police classified 8% as false reports based on police judgement, and the rate was 2.5% when determined using official criteria for false reports.\n\nhttps://www.abc.net.au/triplej/programs/hack/false-rape-allegations-myths/13281852\n\nhttps://www.nsvrc.org/sites/default/files/2012-03/Publications_NSVRC_Overview_False-Reporting.pdf",
          "timestamp": "2022-07-31 09:05:50",
          "score": -1,
          "num_children": 0,
          "author": 267855,
          "replies": []
        }
      ]
    },
    {
      "id": "iib9rlv",
      "text": "This is a bit extreme and gives of the same vibes as feminist who say similar stuff about men. But I get the point. Men who are in abusive relationships should record everything bc or else they are basicly fucked.",
      "timestamp": "2022-07-30 22:43:57",
      "score": 9,
      "num_children": 0,
      "author": 373922,
      "replies": []
    },
    {
      "id": "iicsw2w",
      "text": "Men aren't safe in any country that follows democracy. Not just Amercia.",
      "timestamp": "2022-07-31 07:06:02",
      "score": 8,
      "num_children": 0,
      "author": 5390,
      "replies": []
    },
    {
      "id": "iie7z7y",
      "text": "This is a deep exaggeration and only perpetuates weak males.  \n\nLet’s actually look at statistics.  Women are vastly the abused and murdered",
      "timestamp": "2022-07-31 15:56:38",
      "score": 3,
      "num_children": 0,
      "author": 408699,
      "replies": []
    },
    {
      "id": "iiaso6j",
      "text": "Set up a hidden webcam in your room",
      "timestamp": "2022-07-30 20:34:08",
      "score": 13,
      "num_children": 1,
      "author": 299121,
      "replies": [
        {
          "id": "iid1shh",
          "text": "That’s illegal.",
          "timestamp": "2022-07-31 09:06:03",
          "score": 1,
          "num_children": 2,
          "author": 267855,
          "replies": [
            {
              "id": "iidkob3",
              "text": "Really depends where, I can't come up with a lot of countries where this is illegal.",
              "timestamp": "2022-07-31 12:56:43",
              "score": 6,
              "num_children": 2,
              "author": 34455,
              "replies": [
                {
                  "id": "iii8az2",
                  "text": "I’ll speak for the USA….this is 1,000% illegal.  You can’t secretly record people in private….especially in areas where they have a reasonable expectation of privacy, like bedrooms, bathrooms, changing rooms, etc.  That applies even if it’s your own residence.  If someone is there with you, and you’re recording, you would have to let them explicitly know up-front.",
                  "timestamp": "2022-08-01 13:40:32",
                  "score": 2,
                  "num_children": 2,
                  "author": 317887,
                  "replies": [
                    {
                      "id": "iiuhgws",
                      "text": "This is actually false. You can and have the right to set up a camera in your own home. Especially in bedrooms/baby rooms, living rooms or study rooms. It's where most assault/theft happens. It has also saved many people their lives from a violent/abusive partner or housemate. You don't have to inform a potential crimedoer of a camera. Even if they also live in the same house. I've read waay too many entitled roommate stories where a roommate goes apeshit but then the OP shows camera recorder to the police and bam. \n\nAlso it works nicely against abusive babysitters/pet sitters or family members. K",
                      "timestamp": "2022-08-03 23:21:47",
                      "score": 1,
                      "num_children": 1,
                      "author": 231375,
                      "replies": [
                        {
                          "id": "iiwxfvm",
                          "text": "This is not correct.  Even if it’s your own residence, if you have people over and they’re in an area where someone would have a reasonable expectation of privacy (like a bathroom, bedroom, or changing room), you cannot secretly film them.  I know this for a 100% fact.",
                          "timestamp": "2022-08-04 13:36:57",
                          "score": 1,
                          "num_children": 0,
                          "author": 317887,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "iiicw0s",
                      "text": "Damn that's fucked. And... Weirdly unprosecutable ? Google records you non-stop and there's no issue meaning there shouldn't be for end-users. Sounds like a weird law, IDK of any other country that does this.",
                      "timestamp": "2022-08-01 14:14:51",
                      "score": 0,
                      "num_children": 0,
                      "author": 34455,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iidky51",
                  "text": "Filming people having sex without them knowing. I’m pretty sure that illegal in a lotta places.",
                  "timestamp": "2022-07-31 12:59:19",
                  "score": 2,
                  "num_children": 1,
                  "author": 267855,
                  "replies": [
                    {
                      "id": "iifq4b3",
                      "text": "I wasn't really thinking of recording sexual stuff, just mundane things. Having a call recorder on the ready really helped Johnny Depp, for example.",
                      "timestamp": "2022-07-31 22:21:46",
                      "score": 2,
                      "num_children": 1,
                      "author": 34455,
                      "replies": [
                        {
                          "id": "iihc3kj",
                          "text": "That wouldn’t help a whole lot in court. People can be nice one minute and rape the other.",
                          "timestamp": "2022-08-01 07:26:46",
                          "score": 0,
                          "num_children": 1,
                          "author": 267855,
                          "replies": [
                            {
                              "id": "iiid32z",
                              "text": "Well if the owner of the camera gets raped then this is evidence and on the owner.",
                              "timestamp": "2022-08-01 14:16:17",
                              "score": 1,
                              "num_children": 0,
                              "author": 34455,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "iiejkna",
              "text": "Still a better charge than false rape charges",
              "timestamp": "2022-07-31 17:18:06",
              "score": 1,
              "num_children": 0,
              "author": 299121,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iicc8u9",
      "text": "Watch the amounts of body cams that ‘turn themselves off’ before a date",
      "timestamp": "2022-07-31 04:01:28",
      "score": 5,
      "num_children": 0,
      "author": 191937,
      "replies": []
    },
    {
      "id": "iicxoxy",
      "text": "I mean the fact that as soon as Metoo started, several women started accusing actors just for some extra fame or attention m. \nMany of them were found to be liars with evidence, so imagine the number of them who were just smart enough to do a good lie. And thats in hollywood, your average run of the mill girl would do awful things just to stand out a little bit with a rape story.",
      "timestamp": "2022-07-31 08:09:49",
      "score": 4,
      "num_children": 0,
      "author": 389850,
      "replies": []
    },
    {
      "id": "iidnbph",
      "text": "I survived a sexual assault case. I was falsely accused. Even though I was found to be innocent… my life has hit a new time low. I’ll be okay and I’m trying my best to put my life back together.",
      "timestamp": "2022-07-31 13:20:53",
      "score": 4,
      "num_children": 0,
      "author": 6837,
      "replies": []
    },
    {
      "id": "iicmiys",
      "text": "Still wouldn't be enough, especially with colleges. There have been documented cases where they would refused to view evidence that would exonerate the man accused. It's far less messy for them just to assume their guilt and expell them than face the prospect of siding with a male student accused of rape.",
      "timestamp": "2022-07-31 05:47:08",
      "score": 2,
      "num_children": 0,
      "author": 373772,
      "replies": []
    },
    {
      "id": "iie7paq",
      "text": "America...ONLY,,, fuck come here (United Kingdom) and you will see the shit morning & evening",
      "timestamp": "2022-07-31 15:54:42",
      "score": 2,
      "num_children": 0,
      "author": 397262,
      "replies": []
    },
    {
      "id": "iicig2u",
      "text": "It’s a good idea if both genders can wear them in public places; then jackasses committing crimes can be caught and prosecuted",
      "timestamp": "2022-07-31 05:02:26",
      "score": 3,
      "num_children": 1,
      "author": 273881,
      "replies": [
        {
          "id": "iidl2sh",
          "text": "Also given women more pepper spray / tasers, too. This has the advantage of having a chance to avoid assaults.",
          "timestamp": "2022-07-31 13:00:30",
          "score": 2,
          "num_children": 1,
          "author": 34455,
          "replies": [
            {
              "id": "iidz5uf",
              "text": "Men should also be carrying small defense made items as well. It’s just normalized for women because they’re taught to expect and fear assault.",
              "timestamp": "2022-07-31 14:53:29",
              "score": 2,
              "num_children": 1,
              "author": 273881,
              "replies": [
                {
                  "id": "iiejmpu",
                  "text": "Rigth... You talk like if feminists would accept a men acting in self-defense.",
                  "timestamp": "2022-07-31 17:18:31",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iiexv2d",
                      "text": "Because those weapons are for self defense it would (should) be more accepted, if one gender can do it then both should have the opportunity",
                      "timestamp": "2022-07-31 18:57:50",
                      "score": 4,
                      "num_children": 1,
                      "author": 273881,
                      "replies": [
                        {
                          "id": "iif0n22",
                          "text": "What you are saying here is reasonable, but I have no sign that feminists would accept that a man act in self-defense. That's the problem. There is no point in walking with a self-defense tool if no one will ever accept that you may act in self-defense. Feminism doesn't care about facts; it wants to give women the best situation possible, bypassing what would be fair and at the expense of men's rights.",
                          "timestamp": "2022-07-31 19:17:37",
                          "score": 3,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "iif28eh",
                              "text": "I understand your anger at extremist pushing for male oppression, but you also need to understand that the mindset of thinking all feminists are bad and will never except change is just as bad for a movement like this. I don’t like playing this card, but I am a feminist, I believe men should be given equal opportunities in areas of oppression just like women.",
                              "timestamp": "2022-07-31 19:29:03",
                              "score": 0,
                              "num_children": 1,
                              "author": 273881,
                              "replies": [
                                {
                                  "id": "iif6ie9",
                                  "text": "Look, I don't have to accept that your movement is open to men or to change. I spent the last 7 years talking with feminists and trying to build bridges. And every time a man's perception got into the talk, the answer was to silence him. I remember a time when I asked a girl what the main opinions were on a specific topic in a closed feminist community on Facebook, with the authentic interest of understanding her perception to adequate myself. I didn't care about the group itself; it was more about talking to her, because she was a friend. And she wouldn't talk about anything that had been discussed there. See? We were even denied silent listening. And now... you, a feminist, are here, in an ati-feminist group... Being treated as a human being.\n\nSo let's keep things clear. I have no bond of political or existencial loyalty with you. And I don't have to offer you anything but the fundamental right to not suffer physical violence. I don't have to offer your movement any support, because I don't have to offer any support to a movement incapable of accepting my mere free existence. I don't have to deal with you like there was consensus about our peaceful coexistence because in the past years your movement cut all the channels of communication it could with us and is still disturbing communication between men and women. Whether you are or are not a feminist is irrelevant, because we are not talking about you. We are talking about the conditions for men to live. You won't be around every time a man needs help and understanding, and your political movement is denying men's conditions to talk about their issues. You won't change the perverse way feminism works against men just because you are the \"good girl.\"\n\nIt's funny to see a feminist argue after the past 7 years that \"she believes in equality\". Your movement accepts no exceptions from men. There are no \"good guys\" except the ones who agreed to keep their mouths shut. You are so quick to demand responsibility from individual males for the actions of other males, as if we were an organized demographic. And now I have to \"accept\" you as a \"different feminist\", considering that feminism is a political field with expression in political parties, universities, social movements, social networks, and systematic thinking? Wake up. You girls burned the bridges. I have no reason to accept your feminism as real or as relevant.",
                                  "timestamp": "2022-07-31 19:59:55",
                                  "score": 2,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "iif7q3e",
                                      "text": "I literally wasn’t asking for loyalty? I was offering advice about generalizing a group. You talk about rights of being a feminist in this sub being treated as human but I’ve met so many examples telling me to vanish, kill myself, or that I am nothing but a man hater. So you degrading me by undermining my ability to reach out and understand your perspective is being just as bad as those you despise. \n\nAlso, I hate saying I’m apart of that group because there is immediate bias Towards me, which is fine because it happens to you on other subs, but maybe try and understand that acting like people being jerks isn’t going to solve anything but add more hate. You’re just two sides of the same coin.",
                                      "timestamp": "2022-07-31 20:08:38",
                                      "score": 2,
                                      "num_children": 2,
                                      "author": 273881,
                                      "replies": [
                                        {
                                          "id": "iif8l65",
                                          "text": "Is a feminist offering advice about generalizing a group? Is that a joke? You have no right to talk to any man about generalizing groups. Feminists for the last decade have been \"degrading\" men and \"undermining their ability to reach out and understand their perspective\".\n\nAnd the whole thing to me isn't about being a jerk to you. My point is that I'm not in a debate with feminism anymore. I don't care anymore about what feminists have to say. I won't wait for feminists to resolve what is a healthy male human being anymore. That's the point. People like me just don't care anymore about feminism. And I'm not being a jerk to you. I'm being honest, that is what I'm doing.",
                                          "timestamp": "2022-07-31 20:14:48",
                                          "score": 2,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "iifbqu8",
                                              "text": "Wow, immediately judging me in a generalization over as an individual? What happened to this sub treating me as a human? I bet you would get \npissed if a someone ignored you off of a group you can identify with, it’s harsh to see people act like the feminists they hate.",
                                              "timestamp": "2022-07-31 20:37:23",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 273881,
                                              "replies": [
                                                {
                                                  "id": "iifcz6l",
                                                  "text": "You came here. I'm not some kind of woke sub talking about feminism. And grow up. You are on a discussion defending feminism on an anti-feminism sub. What did you expect? Flowers? Kisses? Being treated as a pop singer on a show? And none of your publications have been erased and you haven't been baned. This is far more what any male protester, like me, would get in any feminist sub.",
                                                  "timestamp": "2022-07-31 20:46:13",
                                                  "score": 2,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "iifdxdk",
                                                      "text": "I’d appreciate if you stopped putting words in my mouth especially when assuming I came onto this sub expecting civility or calm debates. I came to see a new perspective and to add to my own so I don’t create a one sided opinion. Telling me I came here onto a sub to appreciate being able to enter a debate but to grow up if I want my voice to be heard is a considerably childish outtake, especially when that voice is something you’re fighting for onto the modern world. I haven’t broken any rules of this sub, I haven’t degraded anyone on this sub, and I have shown a lot of restraint when being insulted. Could most your protestors who have been banned say the same? \n\nFurthermore, and on a serious note, how do you expect to be taken seriously if you only discuss your views with people who agree with you? Staying huddled in a sub building on hate without allowing for much else seems a lot like most extremists groups posted here.",
                                                      "timestamp": "2022-07-31 20:53:03",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 273881,
                                                      "replies": [
                                                        {
                                                          "id": "iigowiz",
                                                          "text": "I see you don't understand what I'm trying to say. What do I get for stopping putting words in your mouth since I can't assume feminists won't do it with me? I have to take care of myself and I don't have any reason to act like feminists give a shit about me. You see... It isn't about you or me. It is about the bad conditions for two people like us to talk about themselves. People like me can't just assume feminists talk in good faith anymore...  \nAnd I understand the importance of talking with people who think differently than me. I used to do this with feminists. But with time... With some talks... Was easy to understand that feminism isn't about justice, fairness, or equality...",
                                                          "timestamp": "2022-08-01 03:06:45",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "replies": [
                                                            {
                                                              "id": "iigpiys",
                                                              "text": "If a feminist puts words in your mouth then defend yourself, don’t do it to me for no reason. I don’t get why you say it isn’t about you or I, because it is, we both represent individuals struggling from group stereotypes. \n\nYou have reasons to think feminists give a shit, you’re ducking talking to one. You’re just shutting yourself off because you feel too hurt to bridge a gap, which is understandable, but maybe you shouldn’t complain when a feminist does the same.",
                                                              "timestamp": "2022-08-01 03:12:25",
                                                              "score": 1,
                                                              "num_children": 1,
                                                              "author": 273881,
                                                              "replies": [
                                                                {
                                                                  "id": "iigsofa",
                                                                  "text": "First, I will defend myself because I stopped giving a shit about what feminism says. The guys I know who continue to provide feminists with the relevance they seek do not defend themselves, and tell me it is wrong to defend yourself from a feminist.\n\nSecond, you feminists and wokes need to start to understand and talk about society as a population and not as individuals. I'm talking about the objective conditions for men to talk about themselves. It isn't about you, it isn't about me, and if you don't get it, you shouldn't be talking about social issues.\n\nThird, I'm not shutting myself. I'm looking for spaces free of feminists, like this group, to talk freely about society. And I don't really care if feminists are shutting themselves because I don't care about feminists. But let's understand one thing here. I didn't make the situation of the public debate about the sexes and genders what it is now. People like me are giving up talking with feminists and how feminists talk because of how feminists deal with them. In the past 8 years, you had everything. Feminists had the monopoly on the moral judgement of social issues in political debates. I know this because I was a leftist who gave you the support you required of us. So if feminists are shutting themselves, it isn't because of me.",
                                                                  "timestamp": "2022-08-01 03:41:37",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "replies": [
                                                                    {
                                                                      "id": "iii2idi",
                                                                      "text": "I’m just going to have to disagree with you, for so many reasons… however you don’t seem to be worth the debate if you don’t care about individuals in a group despite talking about how you are affected, imply bias based on a generalization, and try to shut down a conversation on the detail of sexes, genders, and “wokes” (a term to that is considered offensive btw, but I doubt you care). \n\nHope you find a reason not to be shut off from the world and not to only seek a space where no differs from your opinion on this subject. Laters dude.",
                                                                      "timestamp": "2022-08-01 12:52:58",
                                                                      "score": 1,
                                                                      "num_children": 0,
                                                                      "author": 273881,
                                                                      "replies": []
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "iifbrln",
                                          "text": "Did you ever see how feminists talk about the identity of feminism and women and how this is put to us? Where I live, men can't say if a woman is or isn't a sane feminist. We can't say if a girl is a feminist or not. We can't talk about the kinds of feminists there are. We can't talk about what kind of feminist an individual feminist is. What is the logical result of these conditions on men? One of them is that men will start generalizing feminists.",
                                          "timestamp": "2022-07-31 20:37:32",
                                          "score": 1,
                                          "num_children": 0,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iib0aze",
      "text": "A body camera is a recording device lol…",
      "timestamp": "2022-07-30 21:30:54",
      "score": 2,
      "num_children": 0,
      "author": 382431,
      "replies": []
    },
    {
      "id": "iibizpo",
      "text": "Alot of other places too. Uk and India for instance that I know of clearly. I think sweeden and france too. Bound to be more.\n\nNot specifically false acc but general misandry which is even encouraged by the goverments.",
      "timestamp": "2022-07-30 23:57:49",
      "score": 2,
      "num_children": 1,
      "author": 268260,
      "replies": [
        {
          "id": "iid1qh2",
          "text": "No.\n\nThe study was based on 2,643 sexual assault cases, of these, police classified 8% as false reports based on police judgement, and the rate was 2.5% when determined using official criteria for false reports.\n\nhttps://www.abc.net.au/triplej/programs/hack/false-rape-allegations-myths/13281852\n\nhttps://www.nsvrc.org/sites/default/files/2012-03/Publications_NSVRC_Overview_False-Reporting.pdf\n\n\nIndividuals suspected of making a false accusation of rape may be charged with the civil crime of \"wasting police time\" or the criminal charge of \"Perverting the Course of Justice\". Over a five-year period ending in 2014, a total of 109 women were prosecuted for crimes related to making false accusations of rape.\n\nhttps://en.wikipedia.org/wiki/False_accusation_of_rape",
          "timestamp": "2022-07-31 09:05:19",
          "score": -1,
          "num_children": 1,
          "author": 267855,
          "replies": [
            {
              "id": "iid2i8a",
              "text": "The sources for the second one are ranging from 2002 to 2010.\n\nIn the first source, if we are going to believe the \"assumed\" statistic of 5%, even then less than half are getting consequences for it, and thats just the start because its not specified what kind of consequence. It could range from anywhere including a couple months prison time or some mundane shit like that. Not to mention even if the claim is proven false the man's social life is already halfway down the drain.\n\nFurthermore why do you comment simply \"no\" as if I claimed false sexual assault claims are the only problem with the countries. In Sweeden and France similar things are happening where gender quotas in universities and political circles respectively are being only enforced until it doesn't favour women anymore and then its being dropped without so much as a word.",
              "timestamp": "2022-07-31 09:15:55",
              "score": 4,
              "num_children": 1,
              "author": 268260,
              "replies": [
                {
                  "id": "iid2yyq",
                  "text": "The second had references from 2018. \n\nOfc there’s a difference between maliciously false allegations and misunderstandings. \n\n\nIt’s the same with rape, some of them get very little time\n\n\nI do think some countries like Sweden are a bit too pro women.",
                  "timestamp": "2022-07-31 09:22:23",
                  "score": 2,
                  "num_children": 0,
                  "author": 267855,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iibrcin",
      "text": "Thank you Laura Loomer. She has a lot of guts by saying this because she has been accused of horrible things I'm sure she didn't do.",
      "timestamp": "2022-07-31 01:05:20",
      "score": 2,
      "num_children": 1,
      "author": 397761,
      "replies": [
        {
          "id": "iid1x85",
          "text": "So don’t believe all women unless they side with you? Y’all were pretty quick to judge heard when she wasn’t judged by a judge. (Which I agree she is a terrible person but my point still stands).",
          "timestamp": "2022-07-31 09:07:51",
          "score": 2,
          "num_children": 1,
          "author": 267855,
          "replies": [
            {
              "id": "iidho10",
              "text": "Here’s a quick fact, people get banned from feminism subs for being in literally any sub they don’t like but yet you are here being a feminist on r/antifeminists \nYet you get no bans. Where the hell are the mods",
              "timestamp": "2022-07-31 12:27:32",
              "score": 2,
              "num_children": 1,
              "author": 29793,
              "replies": [
                {
                  "id": "iidioid",
                  "text": "I’m not breaking any rules.",
                  "timestamp": "2022-07-31 12:37:45",
                  "score": 3,
                  "num_children": 1,
                  "author": 267855,
                  "replies": [
                    {
                      "id": "iigw6ns",
                      "text": "It was just an example. \nThere aren’t even any rules here that ban you if you disagree \nFeminist subs ban you if you don’t believe that all men should die and we should all give women ownership of the world.",
                      "timestamp": "2022-08-01 04:15:56",
                      "score": 6,
                      "num_children": 1,
                      "author": 29793,
                      "replies": [
                        {
                          "id": "iigw97e",
                          "text": "Also this is a anti feminist sub why are you even here",
                          "timestamp": "2022-08-01 04:16:39",
                          "score": 2,
                          "num_children": 1,
                          "author": 29793,
                          "replies": [
                            {
                              "id": "iihd9bs",
                              "text": "Y’all are here to debunk feminism I’m here to debunk y’all. I don’t want to live in an echo chamber so I’m discussing with people who disagree with me.",
                              "timestamp": "2022-08-01 07:43:07",
                              "score": 1,
                              "num_children": 0,
                              "author": 267855,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iid1exa",
      "text": "No.\n\nThe study was based on 2,643 sexual assault cases, of these, police classified 8% as false reports based on police judgement, and the rate was 2.5% when determined using official criteria for false reports. \n\nhttps://www.abc.net.au/triplej/programs/hack/false-rape-allegations-myths/13281852\n\nhttps://www.nsvrc.org/sites/default/files/2012-03/Publications_NSVRC_Overview_False-Reporting.pdf",
      "timestamp": "2022-07-31 09:00:50",
      "score": 0,
      "num_children": 2,
      "author": 267855,
      "replies": [
        {
          "id": "iidh64w",
          "text": "Statistics based off what women say? Great idea.\n\nWhy not make a statistic about how many sexual encounters women had during their life? \n\nNow do you think it will be 100% accurate, or will be several billion off",
          "timestamp": "2022-07-31 12:22:20",
          "score": 8,
          "num_children": 1,
          "author": 90329,
          "replies": [
            {
              "id": "iidilr9",
              "text": "If you read it you would know it was a judge who decided whether it was rape or not.",
              "timestamp": "2022-07-31 12:36:59",
              "score": 3,
              "num_children": 1,
              "author": 267855,
              "replies": [
                {
                  "id": "iii0d10",
                  "text": "And as we all know judges are 100% correct and not biased on any way, shape or form, right?",
                  "timestamp": "2022-08-01 12:33:53",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iii0ilh",
                      "text": "They’re the best we have, you can use that argument with all crimes.",
                      "timestamp": "2022-08-01 12:35:17",
                      "score": 1,
                      "num_children": 0,
                      "author": 267855,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iii13ra",
          "text": "Isn't the conviction rate about 2.5%? So 2.5% are 100% false and 2.5% are 100% true, so there are about as many false cases as there are true cases.\n\nhttps://www.rainn.org/statistics/criminal-justice-system",
          "timestamp": "2022-08-01 12:40:36",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "iii1g3f",
              "text": "At this rate taping you butt shut is a better prevention than a body cam https://www.independent.co.uk/voices/gang-rape-trial-ayia-napa-false-accusation-sexual-assault-cyprus-israel-a9131796.html.",
              "timestamp": "2022-08-01 12:43:40",
              "score": 1,
              "num_children": 1,
              "author": 267855,
              "replies": [
                {
                  "id": "iii1n8n",
                  "text": "I'm not sure how taping my butt shut is going to help me if I get falsely accused, but I'll keep that in mind.",
                  "timestamp": "2022-08-01 12:45:27",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iii1t6z",
                      "text": "My point was you should be more scared of being raped than being falsely accused.",
                      "timestamp": "2022-08-01 12:46:56",
                      "score": 1,
                      "num_children": 1,
                      "author": 267855,
                      "replies": [
                        {
                          "id": "iii8zb1",
                          "text": "Both are legitimate fears, but sure i guess.",
                          "timestamp": "2022-08-01 13:45:41",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iief9ul",
      "text": "Not only in America, need it here in India too.\n\nAnd it's not a joke, it's literally the truth, there are infinite such cases can't even tell.",
      "timestamp": "2022-07-31 16:48:10",
      "score": 1,
      "num_children": 0,
      "author": 380753,
      "replies": []
    },
    {
      "id": "iibmf5h",
      "text": "Me when I spread misinformation",
      "timestamp": "2022-07-31 00:25:50",
      "score": 0,
      "num_children": 0,
      "author": 215357,
      "replies": []
    },
    {
      "id": "iibx0of",
      "text": "This is fucking stupid.  There is no war on men.  Just be a decent person and everything will be just fine, unless you get caught in a mass shooting maybe.",
      "timestamp": "2022-07-31 01:52:10",
      "score": -12,
      "num_children": 1,
      "author": 279333,
      "replies": [
        {
          "id": "iicygu6",
          "text": ">Just be a decent person and everything will be just fine\n\nI mean, Johnny Depp seems like a decent guy, and he almost got his life ruined. If a famous and rich man can almost get his life ruined, imagine what it's like for an average man who doesn't have the fame and money that Johnny did.",
          "timestamp": "2022-07-31 08:20:29",
          "score": 8,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iie33v9",
      "text": "That must be the dumbest shit I have ever head in my entire live lmao",
      "timestamp": "2022-07-31 15:21:57",
      "score": 1,
      "num_children": 0,
      "author": 307267,
      "replies": []
    },
    {
      "id": "iie5k3o",
      "text": "I teach part-time at a major university to mostly (almost always) female students (obviously not by choice - that’s just who enrolls in the course). Every time I meet with a student in private, I keep the door open and record the conversation on my iPhone to defend myself if necessary.",
      "timestamp": "2022-07-31 15:39:34",
      "score": 1,
      "num_children": 0,
      "author": 97765,
      "replies": []
    },
    {
      "id": "ipbqolk",
      "text": "I propose a new idea. The new idea is that the severity of the punishment of the false accusation should be equal in severity to the severity of the punishment of the falsely alleged \"crime\". Add to that a monthly monetary restitution equal in magnitude to the **potential** monetary losses incurred on the affected party under a circumstance where the accusations would have been true.",
      "timestamp": "2022-09-21 13:04:25",
      "score": 1,
      "num_children": 0,
      "author": 215406,
      "replies": []
    },
    {
      "id": "iicmx0g",
      "text": "or just teach him not to be a asshole.. is it that hard?",
      "timestamp": "2022-07-31 05:51:38",
      "score": -13,
      "num_children": 4,
      "replies": [
        {
          "id": "iicolio",
          "text": "Just teach women not to make false accusations, is it that hard?",
          "timestamp": "2022-07-31 06:11:56",
          "score": 18,
          "num_children": 1,
          "author": 294229,
          "replies": [
            {
              "id": "iie0rnw",
              "text": "[deleted]",
              "timestamp": "2022-07-31 15:05:02",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "iie121p",
                  "text": "Ok, fair enough. I agree.",
                  "timestamp": "2022-07-31 15:07:07",
                  "score": 2,
                  "num_children": 1,
                  "author": 294229,
                  "replies": [
                    {
                      "id": "iie18cd",
                      "text": "sorry hon.. heads hurting.. just deleted comment. Not got the energy to start it today. But yes.. BOTH genders need to learn how to behave. Period.",
                      "timestamp": "2022-07-31 15:08:23",
                      "score": 0,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "iiehacj",
                          "text": "No \"both genders\", I think you mean both sexes, are blamed for the problems feminism brought...",
                          "timestamp": "2022-07-31 17:02:06",
                          "score": 2,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "iiehv2c",
                              "text": "well considering neither gender has been raised right.. we have a generation of plebes on our hands now.. so... here we are.",
                              "timestamp": "2022-07-31 17:06:03",
                              "score": 0,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iiekvzz",
                                  "text": "Why don't you go to your feminazi groups and talk about \"common fault\"? It's funny how this kind of comment shows up in groups made by men trying to understand their situation. This kind of comment would never be accepted in a feminist group. The moment we give ourselves the opportunity to build our understanding of our sex from our perspective, we still have to deal with the ideological bullshit made by lying women to don't awnser by their acts. I bet you feel empowered, right? Bringing the \"reason\" to a group of people who are struggling to understand their situation and who can't talk in public common spaces due to your ideological bullshit. Typical feminazi... Silence those who disagree, blame men who are unable to defend themselves, and speak alone in search of men who are unable to respond as if it were a debate between equals.",
                                  "timestamp": "2022-07-31 17:27:13",
                                  "score": 2,
                                  "num_children": 1,
                                  "replies": [
                                    {
                                      "id": "iigsu92",
                                      "text": "You do realize... That I am doing this just to piss people like you off and get a reaction outta you right?   \nhonestly. you wanna take away my power? Stop reacting.",
                                      "timestamp": "2022-08-01 03:43:08",
                                      "score": 0,
                                      "num_children": 2,
                                      "replies": [
                                        {
                                          "id": "iigsxw7",
                                          "text": "Get lost.",
                                          "timestamp": "2022-08-01 03:44:05",
                                          "score": 2,
                                          "num_children": 0,
                                          "replies": []
                                        },
                                        {
                                          "id": "iigt36w",
                                          "text": "The more you blither on up on your soap box to make your point.. the more satisfied i am. :D",
                                          "timestamp": "2022-08-01 03:45:30",
                                          "score": 0,
                                          "num_children": 1,
                                          "replies": [
                                            {
                                              "id": "iigtc84",
                                              "text": "Ok, feminazi. Do whatever you want. It's easy to show how immature you are if you just act like some kind of Reddit's Amber Heard, shitting all over the place...",
                                              "timestamp": "2022-08-01 03:47:53",
                                              "score": 2,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "iigu4hf",
                                                  "text": "Which one of us is name calling and all angry.. I haven't called you anything bad, said anything nasty to you cept saying you blither on.   \nI've not called you names. I've not used any bad words or compared you to bad people... You have done all of this to me.. yet I am the immature one. Because I said you blither on a soap box.   \n Ok Zoomer.",
                                                  "timestamp": "2022-08-01 03:55:23",
                                                  "score": 2,
                                                  "num_children": 1,
                                                  "replies": [
                                                    {
                                                      "id": "iigu9m8",
                                                      "text": "I don't read anything a feminazi writes that is longer than 3 lines. And isn't like you would nothing more productive than shitting someone's bed.",
                                                      "timestamp": "2022-08-01 03:56:49",
                                                      "score": 2,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "iiguen1",
                                                          "text": "ok Plebe",
                                                          "timestamp": "2022-08-01 03:58:14",
                                                          "score": 2,
                                                          "num_children": 1,
                                                          "replies": [
                                                            {
                                                              "id": "iigumzu",
                                                              "text": "Nice... A quiet feminazi is a good object.",
                                                              "timestamp": "2022-08-01 04:00:31",
                                                              "score": 2,
                                                              "num_children": 1,
                                                              "replies": [
                                                                {
                                                                  "id": "iigusvm",
                                                                  "text": "Ok CHILD",
                                                                  "timestamp": "2022-08-01 04:02:08",
                                                                  "score": 2,
                                                                  "num_children": 1,
                                                                  "replies": [
                                                                    {
                                                                      "id": "iigv8dv",
                                                                      "text": "Well... better than being cannon fodder for a political movement to support a millionaire in his 30s who shits on his partner's bed.",
                                                                      "timestamp": "2022-08-01 04:06:24",
                                                                      "score": 2,
                                                                      "num_children": 1,
                                                                      "replies": [
                                                                        {
                                                                          "id": "iigvd0m",
                                                                          "text": "Bleh.. your getting boring.. G'night Kiddo.. you been a gas but your running outta good insults.   \nSleep tight.",
                                                                          "timestamp": "2022-08-01 04:07:42",
                                                                          "score": 2,
                                                                          "num_children": 0,
                                                                          "replies": []
                                                                        }
                                                                      ]
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iicyk0l",
          "text": "Teach women to not make false accusations, is it that hard?",
          "timestamp": "2022-07-31 08:21:39",
          "score": 10,
          "num_children": 1,
          "replies": [
            {
              "id": "iieho9r",
              "text": "It's too much to ask a feminist to not lie.",
              "timestamp": "2022-07-31 17:04:45",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "iidc8jc",
          "text": "So for you men being asshole is doing SA?",
          "timestamp": "2022-07-31 11:27:24",
          "score": 2,
          "num_children": 0,
          "author": 204222,
          "replies": []
        },
        {
          "id": "iigw75r",
          "text": "lol wot",
          "timestamp": "2022-08-01 04:16:04",
          "score": 1,
          "num_children": 0,
          "author": 20986,
          "replies": []
        }
      ]
    }
  ]
}