{
  "id": "we9553",
  "text": "Something to think about\n",
  "timestamp": "2022-08-02 11:24:57",
  "score": 4129,
  "subreddit": "t5_3fdcn",
  "num_children": 16,
  "author": 398010,
  "replies": [
    {
      "id": "iimogdh",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-08-02 11:24:57",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "iimvwh8",
      "text": "whenever someone says the confederates arent racist please tell them to read the cornerstone speech by the vice president of the confederate states",
      "timestamp": "2022-08-02 12:36:14",
      "score": 141,
      "num_children": 3,
      "author": 86643,
      "replies": [
        {
          "id": "iine32h",
          "text": "When someone says \"the confederates aren't racists\" please remind *yourself* that they say wrong things on purpose.  \n\nUntil you are convinced that the person you are talking to gives a single unadulterated fuck about truth, \"telling them to read\" any goddamned thing isn't going to do anything other than validate their malicious dishonesty.",
          "timestamp": "2022-08-02 14:50:12",
          "score": 107,
          "num_children": 1,
          "author": 215411,
          "replies": [
            {
              "id": "iio2yrs",
              "text": "Yep. \n\n“The CW was about States’ rights and economics!!!”\n\n“Yeah. They wanted the right to own other human beings on the basis of their race and to exploit them for cheap labor/play things/torture toys”\n\nI mean they probably will disagree with something like “well *my* ancestors didn’t own slaves!” As if that absolves the entire Confederacy",
              "timestamp": "2022-08-02 17:25:01",
              "score": 39,
              "num_children": 2,
              "author": 395070,
              "replies": [
                {
                  "id": "iio7y63",
                  "text": ">\"well my ancestors didn’t own slaves!\"\n\nIt also didn't matter if they did own slaves because they benefited from a social and economical consequence of slavery.",
                  "timestamp": "2022-08-02 17:56:01",
                  "score": 22,
                  "num_children": 0,
                  "author": 111864,
                  "replies": []
                },
                {
                  "id": "iiq5dse",
                  "text": "> “well *my* ancestors didn’t own slaves!” \n\n\"Well that just makes it even more pathetic that you're fighting for a system that kept your family poor because free labor 'stole your jobs' and kept your wages low while justifying your poverty because 'slaves have it worse, at least...'\"\n\nIt's basically like someone arguing \"Hey, man! Monarchy was great! My ancestors loved being peasants with no political power getting used and abused non-stop!\"\n\nLike... How does that make you want it back? Doesn't that just make you look like a chump with Stockholm Syndrome for an abusive relationship?",
                  "timestamp": "2022-08-03 01:40:30",
                  "score": 13,
                  "num_children": 0,
                  "author": 10670,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iinblv3",
          "text": "Jeez. Thank you for that. Fucking crazy",
          "timestamp": "2022-08-02 14:33:55",
          "score": 11,
          "num_children": 0,
          "author": 157444,
          "replies": []
        },
        {
          "id": "iioidmy",
          "text": "\"The South faught over states rights\" ad nauseam.",
          "timestamp": "2022-08-02 19:01:43",
          "score": 3,
          "num_children": 0,
          "author": 330390,
          "replies": []
        }
      ]
    },
    {
      "id": "iimv29s",
      "text": "\"Those who make peaceful revolution impossible make violent revolution inevitable.\" - Martin Luther King, Jr.\n\n*Edit: I misattributed to MLK when it was actually JFK. In any case, I miss leaders like both. They may have been flawed men but they were also great.",
      "timestamp": "2022-08-02 12:28:54",
      "score": 67,
      "num_children": 2,
      "author": 306111,
      "replies": [
        {
          "id": "iindchz",
          "text": "It really boils my blood when conservatives quote or reference MLK. Like the same people saying BLM are \"domestic terrorist\" are the same kinds of people that said MLK was leading a bunch of criminals \"burning down cities\".",
          "timestamp": "2022-08-02 14:45:25",
          "score": 32,
          "num_children": 1,
          "author": 218723,
          "replies": [
            {
              "id": "iinjzhf",
              "text": "I hope my using the quote didn't come across as flippant. Opining for peaceful protest is really whining for an ineffective opposition against blatant injustice, and is also a mischaracterization of the overwhelmingly peaceful BLM protests. What I find most exhausting is how faithless Christian nationalists argue. They neither support Christianity nor the ideals of our nation. They are fascists.",
              "timestamp": "2022-08-02 15:28:22",
              "score": 12,
              "num_children": 1,
              "author": 306111,
              "replies": [
                {
                  "id": "iinmavc",
                  "text": "no I wasn't saying you're one of them, but it just reminded me of the GOP politicians using MLK's words to attack BLM.",
                  "timestamp": "2022-08-02 15:42:56",
                  "score": 7,
                  "num_children": 1,
                  "author": 218723,
                  "replies": [
                    {
                      "id": "iinrh5x",
                      "text": "Turns out I misattributed the quote anyway.",
                      "timestamp": "2022-08-02 16:14:48",
                      "score": 3,
                      "num_children": 0,
                      "author": 306111,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iinqf37",
          "text": "That quote was from a JFK speech.",
          "timestamp": "2022-08-02 16:08:16",
          "score": 4,
          "num_children": 1,
          "author": 122377,
          "replies": [
            {
              "id": "iinrcbp",
              "text": "Thanks, my Google-foo is weak.",
              "timestamp": "2022-08-02 16:13:59",
              "score": 3,
              "num_children": 0,
              "author": 306111,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iina39u",
      "text": "White people when their team wins a championship.",
      "timestamp": "2022-08-02 14:23:38",
      "score": 21,
      "num_children": 0,
      "author": 21964,
      "replies": []
    },
    {
      "id": "iind2j3",
      "text": "\"Why can't they protest in a way that doesn't inconvenience people. Like good 2nd class citizens!? You're supposed to take your oppression up with your congressperson.\" \n\n \\-Some Conservative",
      "timestamp": "2022-08-02 14:43:37",
      "score": 16,
      "num_children": 1,
      "author": 218723,
      "replies": [
        {
          "id": "iio75n1",
          "text": "Right before going and invading the capitol",
          "timestamp": "2022-08-02 17:51:05",
          "score": 10,
          "num_children": 0,
          "author": 364573,
          "replies": []
        }
      ]
    },
    {
      "id": "iimwon1",
      "text": "Virginia still has a highway named after Jefferson Davis.",
      "timestamp": "2022-08-02 12:42:59",
      "score": 15,
      "num_children": 1,
      "author": 285050,
      "replies": [
        {
          "id": "iio5y7k",
          "text": "[deleted]",
          "timestamp": "2022-08-02 17:43:36",
          "score": 7,
          "num_children": 2,
          "replies": [
            {
              "id": "iio8u8u",
              "text": "No, but it's telling, much like the confederate statues.",
              "timestamp": "2022-08-02 18:01:37",
              "score": 8,
              "num_children": 0,
              "author": 285050,
              "replies": []
            },
            {
              "id": "iiplwii",
              "text": "We can bicker and infight about what is and isn’t important all day. “Abortion is irrelevant when Black people are indiscriminately murdered by police.” “The murders of Black people, while regrettable, distract from the REAL issue of climate change and its health impact on the global population.” Etc etc etc.\n\nAt the end of the day, it’s ALL class struggle. There is no justice without economic justice. Fascism and nationalism are about elevating white interests above POC, male domination above female autonomy, and on and on. Racism, sexism, ableism, anti-LGBT bias, all of it is and always has been about convincing one group of working class that their meager rights are threatened by another group of the working class, so that the two groups fight about crumbs while ignoring the ruling class hoarding most of the cake.\n\nI get where you’re coming from. You’re both right. The names of streets *do* matter, because they continue to lend credence and government sanction of traitors who literally started a war. What our government does and says, matters. People look to our government for moral guidance. If you need an example of this, look up pre- and post-Obergefell polls concerning same sex marriage. If our government implicitly condones the behavior of Jefferson Davis by honoring him with streets (or highways!) named after him, it continues to endorse the ideals he espoused while drafting teenagers to die so they could *possibly someday own another person*. It wasn’t hard to convince poor white folks to fight to protect what little they had, by telling them that they could lose it—and having an entire underclass of people living as property to prove it.",
              "timestamp": "2022-08-02 23:18:19",
              "score": 4,
              "num_children": 0,
              "author": 320699,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iin4hfo",
      "text": "They should have kept peacefully protesting the British. If they couldn't get their freedom with words they did not deserve it.\n\ns/ obviously",
      "timestamp": "2022-08-02 13:44:04",
      "score": 15,
      "num_children": 0,
      "author": 394476,
      "replies": []
    },
    {
      "id": "iip7hwx",
      "text": "\\*White people when they were *worried* that they weren't going to get to keep slaves.\n\nAlways remember they started the war before Lincoln made any decision on slavery.",
      "timestamp": "2022-08-02 21:41:09",
      "score": 9,
      "num_children": 1,
      "author": 290404,
      "replies": [
        {
          "id": "iip9248",
          "text": "Nearly 20 percent of Trump’s supporters say freeing the slaves was a bad idea",
          "timestamp": "2022-08-02 21:51:15",
          "score": 6,
          "num_children": 1,
          "author": 393271,
          "replies": [
            {
              "id": "iipm6gj",
              "text": "Nearly 50% of *liberal men* say feminism has done more harm than good.",
              "timestamp": "2022-08-02 23:20:16",
              "score": 1,
              "num_children": 1,
              "author": 320699,
              "replies": [
                {
                  "id": "iirerqe",
                  "text": "What's your point and please provide citations or go somewhere else to troll",
                  "timestamp": "2022-08-03 09:27:42",
                  "score": 1,
                  "num_children": 2,
                  "author": 393271,
                  "replies": [
                    {
                      "id": "iitozpi",
                      "text": "I'm not trying to troll, and I didn't intend for it to come off that way.  I'm saying that propaganda changes people from rational to irrational.  Give me a moment - I will find the study.  Here is one that addressed global attitudes toward feminism: [https://www.ipsos.com/en-dk/one-three-men-believe-feminism-does-more-harm-good](https://www.ipsos.com/en-dk/one-three-men-believe-feminism-does-more-harm-good)",
                      "timestamp": "2022-08-03 19:56:40",
                      "score": 1,
                      "num_children": 0,
                      "author": 320699,
                      "replies": []
                    },
                    {
                      "id": "iitq0mc",
                      "text": "OK! I found it. It's about halfway down the page.  Results are broken down by age, political alignment (Republican leaning/Democratic leaning), and gender.\n\n[https://www.splcenter.org/news/2022/06/01/poll-finds-support-great-replacement-hard-right-ideas#gender](https://www.splcenter.org/news/2022/06/01/poll-finds-support-great-replacement-hard-right-ideas#gender)\n\nI believe you when you say that Trump supporters are literally pro-slavery!  My intent wasn't to derail you, but I can see how it may have felt that way.  I was trying to demonstrate that we have a long way to go in this country and we have slid back pretty far on progressive beliefs about human rights, including equality for women or POC.  I suspect the cause for that is the proliferation of propaganda.  Hopefully that clears things up a bit.  Thank you for requesting the source - I'm glad to have found it so I can bookmark it again.",
                      "timestamp": "2022-08-03 20:03:35",
                      "score": 1,
                      "num_children": 1,
                      "author": 320699,
                      "replies": [
                        {
                          "id": "iittpnw",
                          "text": "same team \n\n:)",
                          "timestamp": "2022-08-03 20:29:05",
                          "score": 2,
                          "num_children": 1,
                          "author": 393271,
                          "replies": [
                            {
                              "id": "iiuga6w",
                              "text": "Yessssss.",
                              "timestamp": "2022-08-03 23:12:54",
                              "score": 1,
                              "num_children": 0,
                              "author": 320699,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iine5mt",
      "text": "Please remember that they say wrong things on purpose.",
      "timestamp": "2022-08-02 14:50:40",
      "score": 7,
      "num_children": 0,
      "author": 215411,
      "replies": []
    },
    {
      "id": "iip73bj",
      "text": "Hell, Jan 6th wasn't exactly a 'peaceful protest'.\n\nConservatives have _never_ taken things going even a hair against them peacefully, but oh do they expect it of everyone else.",
      "timestamp": "2022-08-02 21:38:30",
      "score": 3,
      "num_children": 0,
      "author": 16816,
      "replies": []
    },
    {
      "id": "iipxgy5",
      "text": "Conservatism is opposed in its very DNA to democratic self rule. The Civil War never ended, these people are exactly the same as they have always been. Trump just unlocked the cage.",
      "timestamp": "2022-08-03 00:42:25",
      "score": 3,
      "num_children": 0,
      "author": 250495,
      "replies": []
    },
    {
      "id": "iins2kt",
      "text": "Ironic isn’t it. Acting like thugs when they get treated like shit.",
      "timestamp": "2022-08-02 16:18:27",
      "score": 3,
      "num_children": 0,
      "author": 63987,
      "replies": []
    },
    {
      "id": "iip3hww",
      "text": "Love this",
      "timestamp": "2022-08-02 21:15:11",
      "score": 2,
      "num_children": 0,
      "author": 104898,
      "replies": []
    },
    {
      "id": "iio5nok",
      "text": "320,000 white people died fighting for black slaves to be freed, jackass. Americans, both black and white, came together to fight slavery against white southern slaveholders and paid a heavy price for it.",
      "timestamp": "2022-08-02 17:41:48",
      "score": -10,
      "num_children": 4,
      "author": 385011,
      "replies": [
        {
          "id": "iioj1ox",
          "text": "So did free blacks soldiers.",
          "timestamp": "2022-08-02 19:06:05",
          "score": 11,
          "num_children": 1,
          "author": 330390,
          "replies": [
            {
              "id": "iiskybn",
              "text": "Yes, approximately 40,000 African Americans died fighting against the south. But I acknowledged that both black and white Americans came together to fight evil. The evil is slavery, and racism, not white people. People of all skin colors are fighting those evils still.",
              "timestamp": "2022-08-03 15:34:01",
              "score": 1,
              "num_children": 1,
              "author": 385011,
              "replies": [
                {
                  "id": "iitbyoj",
                  "text": "I know it's not all, just like I get extremely offended when some racist sonavabitch generalizes the entire \"black community\" as uneducated criminals and thugs. It pisses me off because I'm my own individual. So I kinda see where you're coming from.",
                  "timestamp": "2022-08-03 18:28:12",
                  "score": 1,
                  "num_children": 0,
                  "author": 330390,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iipy9qr",
          "text": "No one should have had to die for that cause. It’s a good thing they were willing to but The fact that not even just 1 person but 320k people died is sickening it shouldn’t haven even been a debate let alone a war should have just been everyone agreeing to end slavery",
          "timestamp": "2022-08-03 00:48:21",
          "score": 2,
          "num_children": 0,
          "author": 413332,
          "replies": []
        },
        {
          "id": "iioalgv",
          "text": "I'm curious as to why you felt you had to point that out?",
          "timestamp": "2022-08-02 18:12:34",
          "score": 8,
          "num_children": 2,
          "author": 402410,
          "replies": [
            {
              "id": "iipbvdf",
              "text": "Because good people will fight for the greater good and they don’t care about skin tone. While they could have worded their comment better, they’re simply stating that whites and blacks worked together for commons goals back then too.",
              "timestamp": "2022-08-02 22:09:27",
              "score": 5,
              "num_children": 1,
              "author": 275790,
              "replies": [
                {
                  "id": "iipdva7",
                  "text": "I think you're reacting to this in an oddly specific way; if you knew the 320,000 fought against slavery, per your comment, and you knew that there were white people who defended slavery, why not make the same logical assumption about it being \"not all white people\" supporting slavery? This is especially unusual with white people still making up 70% of America as of the 2020 census - if they're the default, the statement in the meme feels like only those who are trying to either play apologist for the racists in the meme who were called out or trying to obfuscate the bias in how \"riots\" are perceived by that majority would feel called out.",
                  "timestamp": "2022-08-02 22:22:36",
                  "score": 1,
                  "num_children": 0,
                  "author": 402410,
                  "replies": []
                }
              ]
            },
            {
              "id": "iislmxj",
              "text": "Most people understand that what is evil is slavery and racism, not white skin. But some people might need to be reminded of this from time to time.",
              "timestamp": "2022-08-03 15:38:24",
              "score": 1,
              "num_children": 1,
              "author": 385011,
              "replies": [
                {
                  "id": "iisp2re",
                  "text": "I'd hope that that would lead to a conversation about [race is a myth](https://www.youtube.com/watch?v=VnfKgffCZ7U), or [why white fragility - that is, being raised in whiteness rather than as something like Irish, Italian, or other ethnic backgrounds -  is a means of passively perpetuating white supremacy](https://www.youtube.com/watch?v=wjHg65JORi8)",
                  "timestamp": "2022-08-03 16:00:10",
                  "score": 1,
                  "num_children": 0,
                  "author": 402410,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iipmkkk",
          "text": "Did you take it personally when they said, “white people?” Were they talking about you? Were you alive in 1860? No? Settle down.\n\nI get that you feel personally attacked because you’re white and you have that in common with the confederacy, but bro. Not everything is about you, personally. Chill.",
          "timestamp": "2022-08-02 23:23:05",
          "score": -1,
          "num_children": 0,
          "author": 320699,
          "replies": []
        }
      ]
    },
    {
      "id": "iinayep",
      "text": "While I agree with the sentiment, the wording is race baiting. \n\nShould say confederates, racists, traitors, idk anything else.\n\nAnd idk if you know this, but the majority of the north army were white.",
      "timestamp": "2022-08-02 14:29:31",
      "score": -13,
      "num_children": 1,
      "author": 65603,
      "replies": [
        {
          "id": "iioj9mn",
          "text": "I kind of agree that the wording should have been different but you and I both get the point.",
          "timestamp": "2022-08-02 19:07:32",
          "score": 6,
          "num_children": 0,
          "author": 330390,
          "replies": []
        }
      ]
    },
    {
      "id": "iisjj5p",
      "text": "Someone pls explain that none of those people are alive anymore😭😂",
      "timestamp": "2022-08-03 15:24:51",
      "score": 1,
      "num_children": 0,
      "author": 153587,
      "replies": []
    }
  ]
}