{
  "id": "wepzcb",
  "text": "The irony\n",
  "timestamp": "2022-08-02 23:03:51",
  "score": 588,
  "subreddit": "t5_2zaj2",
  "num_children": 17,
  "author": 227220,
  "replies": [
    {
      "id": "iiqv1kl",
      "text": "I’ve talked to a lot of woman and military members about this topic because it’s very sensitive but very simple. Females have been proven to be unable to function in high pressure situations, like being shot at and fighting for their very lives as Males. There has been a plethora of Tests done by multiple organisations including most military’s into the stress response in both sexes. \n\nThere is also strength which is a large issue. The avg kit carried by modern soldiers is bloody heavy, the avg kit will have Ammo, Medical, MRE’s and a plethora of other items along with the Heavy body armour and the 7 pound gun they’re carrying around at all times.  Males on average are naturally stronger than females meaning the avg Female is gona have a hard time with a standard load out being between 60-100 pounds depending on their loadout and position .  It’s Biology, this is why Females are better suited to support rolls where there is less stress and no 80 pound kit on their back allowing them to function better and use their skills. It’s not sexism or discrimination it’s biology, both sexes where designed for different roll’s.",
      "timestamp": "2022-08-03 05:19:14",
      "score": 26,
      "num_children": 4,
      "author": 291894,
      "replies": [
        {
          "id": "iiratpn",
          "text": "Yeah \n\nI do think that their are benifits to have some females in a front line position \n\nLike 80/20 \n\nbut very specialised\n\nAnd they have to be hard as nails\n\nNo lowering the standard because they can’t pass\n\nYou either pass or you don’t\n\nIf you pass and you get a uniform, it gives a level of trust to other soldiers that they can rely on you\n\nif you taint the military like that, you don’t function\n\nthe Vikings had women as soldiers, they were great\n\nA women can train to become atleast what a weak man is \n\nand combine that with knowledge and skill, youre good to go\n\nPut them in a high specialised position similar to the horse piece in Chess\n\nIt’s mostly covering and creating pressure, or sitting in an unorthodox location to surprise someone \n\nthat’s how it needs to be done\n\nThen let the queens and castles take the attention away\n\nTankmen need to really small while also capable of running a tank\n\nPilots the same\n\nThese can all be done by women",
          "timestamp": "2022-08-03 08:34:06",
          "score": 12,
          "num_children": 1,
          "author": 227220,
          "replies": [
            {
              "id": "iirb91t",
              "text": "I completely agree, there are some females you there who are tough as nails. There are some girls I play rugby with who could probably take me in a fight and handle themselves amazing when around the 130 kg or 280 pound dudes we train with.  Modern military’s lowering standards so some woman and people who don’t fit the criteria can get in is a massive issue for western military’s.  Feminists groups need to understand that the military is male centred not because it’s inherently sexist but because that’s how it’s been built and that’s how it can function the best of its ability and females can be part of it two but even an above average female will struggle in the front line of the military.",
              "timestamp": "2022-08-03 08:39:50",
              "score": 7,
              "num_children": 1,
              "author": 291894,
              "replies": [
                {
                  "id": "iirgx83",
                  "text": "Here’s an idea\n\nLet’s say we want to destabilise a country, what would you do?\n\nI would take advantage of the obesity rates of America and somehow lower the standard for becoming a policeman\n\nMake some individuals feel like they need to use ranged weapons more often \n\nAnd create a counter culture that points this out and creates distrust in the police \n\nProbably sparked by black peoples hate for police in the 80s90s, a country that I don’t know of\n\nSaw an opportunity\n\nThen white women tagged along looking for an easy pay check from evil white men\n\nWhich they perceived (as an entity as a whole), as their ex that just broke up with them\n\nthen maybe discredit the U.S. Militaries credibility by mixing in sub-par soldiers\n\nI want to suggest China or Russia or maybe even both\n\nwith China’s introduction of TikTok, I think it may be correct",
                  "timestamp": "2022-08-03 09:56:17",
                  "score": 2,
                  "num_children": 1,
                  "author": 227220,
                  "replies": [
                    {
                      "id": "iiri0nc",
                      "text": "My god you are insane, that sounds as stupid as the media being flooded with articles about the gender pay gap and how all white people are the spawn of Satan creating Class, sexual and race warfare while governments slowly and slowly pass laws removing rights of their own citizens. You truely are delusional.",
                      "timestamp": "2022-08-03 10:10:37",
                      "score": 4,
                      "num_children": 1,
                      "author": 291894,
                      "replies": [
                        {
                          "id": "iiwiv1c",
                          "text": "Maybe \n\nI just present ideas though\n\nDoesn’t always mean they’re true\n\nBut it gives you’re mind a chance to think outside of the box\n\nDelusion is just acting on stupid ideas \n\nYou can have many and choose the best",
                          "timestamp": "2022-08-04 11:32:45",
                          "score": 2,
                          "num_children": 0,
                          "author": 227220,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iirpb0l",
          "text": "I think it is less about her being unable to deal stress and more about the fact that she is much more venerable to for example rape. She probably takes a much bigger risk. From what I have heard a woman who gets raped can’t say anything bc the men in the group will go into full blown revenge mode and she will jeopardise everything by doing so .\n\nIn war women get raped bc that it how you exercise power over the other side. It is very effective to “take someone else’s woman” and rape her.\n\nBut there have been some evidence to show that women might make better officiers.",
          "timestamp": "2022-08-03 11:34:41",
          "score": 0,
          "num_children": 1,
          "author": 373922,
          "replies": [
            {
              "id": "iitrlgg",
              "text": "The only part of that sentence that makes sense was the part about female officers, I’ve met a few female officers in my time around military personal.\n\nBut everything else you said, I’m sorry but it is Bull. \n\nYou are true that in some military’s rape is a issue, but those arnt western military which all have a zero tolerance policy as they all take it extremely seriously.  I know all of this because my sister has gone down the feminist rabbit hole and when we used to have military personal over or be at events with them my sister would usually ask gender roll and woman in the military type questions which actually gave my a decent amount of Answers for these types of situations. \n\nBut in western military’s eg, US, US, CA, AUS, NZ ect if a member of the armed forces even attempts such an act they will be immediately dishonerly  discharge escorted out by the MP to the authorities for charges to be pressed.  I have no idea about how non western countries would handle this situation but I’m guessing in places like China, Russia, turkey or most non western countries from what I have reached on this topic are not open about how they deal with Rape inside their military most likely protruding to them not being a safe place for woman.\n\nThere where a few Rape scandals in the 60’s and 70’s but due to there bearly any woman in the military at that time they where mostly Man on Man. \n\nAs stated in my first comment there are a multiple of reasons the military is not suited to most woman, stress reaction, physical and biological barriers and more.  I’ve talked to one woman who dropped out of basic training after about a week and I talked about it with her at a function a few years back and after she ranted on about how bad basic was and how it treated her she said that from what she saw in basic was the the military had one good thing and that was equality, they treated everyone like Shit no matter who you where, if you where a man, woman, other or even the son of a high rank you where all treated like shit and she said that was why she dropped out.  \n\nThe military does all that crap to prepare you for situations where emotions and feelings need to go out the window so you can actually stay alive and the negative techniques they use to prepare you for deadly situations is just not an appeal for most woman.",
              "timestamp": "2022-08-03 20:14:32",
              "score": 0,
              "num_children": 1,
              "author": 291894,
              "replies": [
                {
                  "id": "iiw4ln1",
                  "text": "[deleted]",
                  "timestamp": "2022-08-04 08:36:05",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iiw5xdd",
                      "text": "I was talking about women getting raped in war, which is a fact it is a psychological thing. Where there is war women get raped, bc the men are under heavy stress and pressure. We know that is true, that is just a fact we can’t get around studies have been done it. There have been Women in military on the front line getting captured and then raped by the opposing side, to then be “thrown back” bc it creates chaos. It is a “strategy” that has been used since the dawn of mankind to provoke and as revenge. You kidnap the opposing sides women and rape them, it is a form of “psychological torture” in a sense bc kidnapping and raping the other sides women effectively gets to the men. It makes the men more impulsive in their decision making and they will wanna seek revenge. It is psychology. \n\n\nAlso having a 0 tolerance about rape doesn’t stop it from happening? You need to read my comment properly here. There is absolutely a higher risk getting raped as a woman in the military. I didn’t say the military doesn’t give a shit about it or had a feminist agenda. Or that women get treated more like shit that the men. But honestly I think it is hard to deny that women take a higher risk. \n\nI was pointing towards that I can def see how if a woman gets raped in military, she could possibly jeopardise everything by talking loudly about what happend while they are in active “duty” so to speak. It doesn’t matter after the fact, but I could def see how they would want her not talking about it to the other men in the group about it and keep it “under the radar” to not stir anything up.\n\nMy boyfriend did military training in Israel and he said if a woman ends up getting raped she can’t talk about it while being on a mission. It will be dealt with, I didn’t say it isn’t dealt with. But her talking about it mid mission IS a risk for everyone in the group, bc it stresses out the men who are already in a stressful situation. So they become more likely to get less focused on the goal and become more impulsive. It creates chaos within the circle bc men ultimately wanna protect the women around them, especially if they are working in military they probably have a very close bond.",
                      "timestamp": "2022-08-04 08:54:11",
                      "score": 1,
                      "num_children": 0,
                      "author": 373922,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iiw2qrc",
          "text": "[deleted]",
          "timestamp": "2022-08-04 08:10:36",
          "score": 0,
          "num_children": 1,
          "replies": [
            {
              "id": "iiw2sgw",
              "text": "Nah, that’s just you.",
              "timestamp": "2022-08-04 08:11:16",
              "score": 1,
              "num_children": 0,
              "author": 291894,
              "replies": []
            }
          ]
        },
        {
          "id": "ijdembv",
          "text": ">Females have been proven to be unable to function in high pressure situations, like being shot at and fighting for their very lives as Males. There has been a plethora of Tests done by multiple organisations including most military’s into the stress response in both sexes.\n\nDo you have the sources on that?",
          "timestamp": "2022-08-07 23:06:18",
          "score": 0,
          "num_children": 1,
          "author": 54,
          "replies": [
            {
              "id": "ijdle8e",
              "text": "If you want any more just ask and I will provide them. these are all done with some quick research. \r  \n\r  \n\r  \n\r  \ns on Job Functioning of Military Men and Women. Armed Forces & Society, 27(3), 397–417. [https://doi.org/10.1177/0095327x0102700304](https://doi.org/10.1177/0095327x0102700304) \r  \n“Health research in the past decade has shown that women consistently report higher levels of stress and depressive symptoms than men, whereas disorders associated with substance abuse are more common in men. For example, rates of depression among women are at least twofold higher than among men”\r  \n\r  \n\r  \nVogt, D., Vaughn, R., Glickman, M., Drainoni, M.-L., Elwy, R., & Eisen, S. (2011). Gender Differences in Combat-Related Stressors and Their Association With Postdeployment Mental Health in a Nationally Representative Sample of U.S. OEF/OIF Veterans Mark Schultz. Journal of Abnormal Psychology, 120(4), 797–806. [https://www.ptsd.va.gov/professional/articles/article-pdf/id36638.pdf](https://www.ptsd.va.gov/professional/articles/article-pdf/id36638.pdf) \r  \n\r  \n\r  \n” In a sample of infantry and combat support service members women were significantly more likely than men to screen positive for general mental health problems when exposure to combat was low (17% compared to 9%),”\r  \n\r  \n\r  \nTarrasch, R., Lurie, O., Yanovich, R., & Moran, D. (2011). Psychological aspects of the integration of women into combat roles. Personality and Individual Differences, 50(2), 305–309. [https://doi.org/10.1016/j.paid.2010.10.014](https://doi.org/10.1016/j.paid.2010.10.014) \r  \n“ A sample of 450 Israeli Defense Forces (IDF) soldiers participated in the study during their four-month military basic training (BT). The subjects completed trait and state personality questionnaires and underwent medical examinations. Female soldiers in both combat and non-combat units displayed higher stress levels than male soldiers.”",
              "timestamp": "2022-08-07 23:58:05",
              "score": 1,
              "num_children": 1,
              "author": 291894,
              "replies": [
                {
                  "id": "ikco89v",
                  "text": "interesting stuff. If you have more sources on hand then I'll give them a read after I finish these,",
                  "timestamp": "2022-08-15 06:23:30",
                  "score": 1,
                  "num_children": 0,
                  "author": 54,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iiqewcc",
      "text": "To answer the question from the deleted post. I think another aspect is that poverty is a big incentive for people to join the military and women are more able and more likely to explore certain alternatives.\n\nBoth men and women could take out student loans to fund their higher education journey. However women are more likely to do that than men.\n\nAlso a poor woman could be a stripper, waitress or bartender and profit off her looks and sexuality to escape poverty. A man could do the same as well but the threshold is higher for men than women. A woman would mostly just need to be young and in shape while a man would need to be young, in shape and attractive to get similar results.",
      "timestamp": "2022-08-03 02:53:00",
      "score": 42,
      "num_children": 1,
      "author": 179179,
      "replies": [
        {
          "id": "iiqgff3",
          "text": "Yeah military is a man’s stripper job\n\nIt’s a job that just uses you’re body for money\n\nNo prior skills, just a meat product\n\nIt’s a job for those that don’t value their life or reputation \n\nsuicide without dying",
          "timestamp": "2022-08-03 03:05:04",
          "score": 34,
          "num_children": 1,
          "author": 227220,
          "replies": [
            {
              "id": "iis2bmf",
              "text": "Thats a good way of putting it\n\nBut what about hermaphrodites like me? Any idea how wed function in the military?",
              "timestamp": "2022-08-03 13:27:26",
              "score": 6,
              "num_children": 2,
              "author": 138295,
              "replies": [
                {
                  "id": "iisg7yh",
                  "text": "hahaha, you'd be well treated in the navy",
                  "timestamp": "2022-08-03 15:03:17",
                  "score": 5,
                  "num_children": 1,
                  "author": 72860,
                  "replies": [
                    {
                      "id": "iisgs89",
                      "text": "Any specific reason? Idk much about the army and navy and military and all of that stuff sooo I wouldnt know if you were tryna point at a specific reason",
                      "timestamp": "2022-08-03 15:06:58",
                      "score": 2,
                      "num_children": 1,
                      "author": 138295,
                      "replies": [
                        {
                          "id": "iisizli",
                          "text": "Nope just saying Navy is gay...",
                          "timestamp": "2022-08-03 15:21:21",
                          "score": 8,
                          "num_children": 1,
                          "author": 207185,
                          "replies": [
                            {
                              "id": "iisj468",
                              "text": "Lmfao",
                              "timestamp": "2022-08-03 15:22:11",
                              "score": 3,
                              "num_children": 0,
                              "author": 138295,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iiucvr7",
                  "text": "since you refer to yourself as a hermaphrodite openly , this is an anonymous network and you're a men's rights supporter, I'm just curious since that is very rare to be physically intersex (not just mentally/neuralogically or genotypically like most) and you seem to not identify male or female , what your birth biology was, what you choose, how it developed post puberty, and how it's shaped your opinion on the trans movement and mra issues. might be better for a dm but don't want to spam you lol",
                  "timestamp": "2022-08-03 22:47:29",
                  "score": 2,
                  "num_children": 1,
                  "author": 157495,
                  "replies": [
                    {
                      "id": "iiwrbpn",
                      "text": "Check DMs",
                      "timestamp": "2022-08-04 12:49:13",
                      "score": 1,
                      "num_children": 0,
                      "author": 138295,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iiq2rby",
      "text": "As a woman in the military, there are a few reasons it’s a male dominated industry. \n1) most girls don’t grow up thinking I want to be in the army \n2) the standards for the military I’m in, whilst they’re lower for females compared to males, they’re still high standards and not every woman can meet them\n3) even if they do meet those standards that doesn’t mean they’ll make it through rigorous training, a lot of women I knew in my course dropped out\n4) the military is not actually all that family friendly and depending on who it is they may eventually get to the point where they come to a cross roads and need to chose between career and family",
      "timestamp": "2022-08-03 01:21:13",
      "score": 90,
      "num_children": 5,
      "author": 303672,
      "replies": [
        {
          "id": "iiqd7ch",
          "text": "I totally agree with you. I was trying to get recruited for the airforce when I was 20, I was already really fit, I used to do a lot of outdoor activities, material arts and cycling. Plus I took my health very seriously throughout my teens. I did better than all the women in the fitness tests and was up there with some of the men, but those men weren't that fit (like really unfit) and the other men that were just as fit as I was, they still out did me and were far more physically stronger. No matter how hard I train, I will never be as strong as the other fit men. \n\nI decided to opt out, because I started having doubts about myself and I don't think have the mentality like the rest of them, even though the female recruiter reckons I would've made a good FP or MP just because of my fitness, but I really highly doubt it and I'm a really sensitive person, lol. I felt stupid for trying in the first place.\n\nWhat bothers me, which I didn't realize at the time for the fitness/physical test... they only require 7 push ups for the women and the rest of the tests were also very minimum for a woman. One of the ladies there was overweight, she didn't even do 7 push ups, but still passed. Wtf. She was recruiting for a logistics operator, but I thought you had to have the required fitness for all trades in the airforce? Beats me. \n\nAnyway, this is the NZ airforce and to be fair, there's a lot of women that dominate the logistics operator side and it's extremely toxic. I can't remember meeting a single male Sgt. Majority of them were women. My ex partner and 4 other men were bullied by the women in that workplace, 2 of them tried to commit suicide, that's including my ex partner... I still get nightmares about it.",
          "timestamp": "2022-08-03 02:39:51",
          "score": 20,
          "num_children": 1,
          "replies": [
            {
              "id": "iiqe2tb",
              "text": "Sadly that’s not an uncommon situation in the sense that there are women who create a toxic environment. I don’t know if it’s insecurity about being a female and wanting to prove a point but to belittle and bully other members because of their gender be it a male or female is just screwed up.\n\nAs for being sensitive, in my opinion it’s actually a good thing depending on the role. Emotional sensitivity is needed depending on the engagement we’re in.",
              "timestamp": "2022-08-03 02:46:40",
              "score": 12,
              "num_children": 1,
              "author": 303672,
              "replies": [
                {
                  "id": "iiqi6u3",
                  "text": "Neither do I, it could be a possibility it's to do with insecurity. I've only met some of these women once and I have to admit, I was worried for my ex partner at the time. He was very shut off, even after the attempt to end himself, he would not explain anything to me whenever I asked \"is there anything else that happened?\" I could tell he was hiding something. My ex partner was 6ft 3 tall and very handsome, he's also never been the type to let women push him around and he was an anti feminist. I keep fearing he was sexually harassed or something and too embarrassed/worried to tell me 😢 I couldn't help him which caused the break up. I know it was years ago, but it stings so much. Sorry for the rant, I know I need to get these feelings sorted out.\n\nAw thanks, I hope you're right, I do feel like I somewhat missed out on something and I still have a 2nd chance to be recruited. I just need to sort myself out first. I'll make sure to look into it more for next time and hopefully find a trade that's more beneficial. Thank you for your reply.",
                  "timestamp": "2022-08-03 03:19:35",
                  "score": 9,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iiqb0dk",
          "text": "not to sound like a complete ignorant, but are women deployed into recon or scout or attack ops on the field in the dirt , dust and mud in the open for days like men as we see on TV? If they do how do they deal with menstruation when it happens ?",
          "timestamp": "2022-08-03 02:22:54",
          "score": 7,
          "num_children": 2,
          "author": 153989,
          "replies": [
            {
              "id": "iiqc3yf",
              "text": "Look I’m not in a combat role so I’m unsure but I believe that we do have women who deploy as members of infantry. Like women even in support roles are on the ground getting down and dirty pulling their weight. A lot of us in a field environment will chose to skip periods so as to not have to deal with menstruation otherwise you have to bag it and carry it until the rubbish drop.",
              "timestamp": "2022-08-03 02:31:24",
              "score": 6,
              "num_children": 2,
              "author": 303672,
              "replies": [
                {
                  "id": "iir0ad9",
                  "text": "How does one chose to skip periods?",
                  "timestamp": "2022-08-03 06:18:48",
                  "score": 5,
                  "num_children": 1,
                  "author": 153989,
                  "replies": [
                    {
                      "id": "iir0mh3",
                      "text": "Contraceptive pills. You just go onto taking the next lot instead of having the sugar pills and your period. Sometimes the stress/high level of activity compared to food also means that your periods late",
                      "timestamp": "2022-08-03 06:22:43",
                      "score": 6,
                      "num_children": 0,
                      "author": 303672,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iirbmcz",
                  "text": "I never considered how that would go down tbh\n\nBut in that environment, you usually have like 5-10 injuries you’re worried about that you just don’t have time to deal with\n\nyou only really notice at the end of the day",
                  "timestamp": "2022-08-03 08:44:52",
                  "score": 2,
                  "num_children": 0,
                  "author": 227220,
                  "replies": []
                }
              ]
            },
            {
              "id": "iiqbwqt",
              "text": "Yeah that’s a factor\n\nThey don’t allow women on submarines a believe because of that\n\nthey could probably manage themselves, but bad timing can completely ruin a mission \n\nnot to mention if it’s a mixed team, men are more likely to save the women, even if it’s too dangerous to do so\n\nMost men won’t let a women die\n\nBut they can consider letting a man die for the better cause\n\nalso men having relationships with women is not good \n\nBut that can be summed up to men not being able to keep their dicks in their pants\n\nI think women can be really good in the military if in the correct role\n\nsnipers, tank, pilots, crewmen/women, medical, food\n\nThere’s so many roles that fit well\n\nBut we can’t go on pretending that women are exactly like men\n\nthat idea is going the get people killed",
              "timestamp": "2022-08-03 02:29:51",
              "score": 11,
              "num_children": 0,
              "author": 227220,
              "replies": []
            }
          ]
        },
        {
          "id": "iiq8ta2",
          "text": "Yeah even for men it’s really difficult\n\nI’m generally healthy but it takes a long time to get fit enough to withstand training like that\n\nwether or not Women CANT do it\n\nI don’t think that’s the case\n\nWith enough training anyone can do anything",
          "timestamp": "2022-08-03 02:06:11",
          "score": 12,
          "num_children": 1,
          "author": 227220,
          "replies": [
            {
              "id": "iiqdrjq",
              "text": "> with enough training anyone can do anything\n\nTotally delusional statement. \n\nThis sort of crap should have been left behind with Santa Claus and the Easter Bunny.\n\nCan a short person be 'trained' into being an NBA player?\n\nCan a women be 'trained' into beating a male heavyweight boxer?\n\nWe all have limitations. Recognising yours is a key to success. \n\nDon't let 'untrue' limitations be imposed upon you by anyone, particularly yourself.",
              "timestamp": "2022-08-03 02:44:12",
              "score": 16,
              "num_children": 2,
              "author": 237689,
              "replies": [
                {
                  "id": "iiqfdpe",
                  "text": "You’re right\n\nThere’s physical limitation\n\nbut 90% of every difficult task is mental \n\nyou gotta push through\n\nthat’s why I’m so confused about why women aren’t is Esports as much\n\nit’s not psychical demanding, but men still dominate\n\nEspecially in FPS’s \n\nYou could sum that up to men being more able to think strategically in a war like environment \n\nWhich is another reason why the military is mostly men\n\nI think the environment men create, encourages improvement whilst women create openness and security \n\nNature/Nurture Ying/Yang",
                  "timestamp": "2022-08-03 02:56:48",
                  "score": 7,
                  "num_children": 3,
                  "author": 227220,
                  "replies": [
                    {
                      "id": "iiqnyk0",
                      "text": "It’s wild how some people get offended when they hear motivation isn’t it? Lol \n\nThat I think is the greatest harm that has been done to society. These dangerous mind alterations caused by the societal dictations that keep being forced is doing more than limiting speech. It is altering mindsets, perspectives.\n\nThe wild thing is nowadays, imagination and drive is really all anyone needs. But yet this might also be the reason why some people are offended by optimistic views.\n\nMore failed opportunities is only viewed as more failures by some. While others are blown away that the opportunities were available at all. \n\nBut yep, enough training anyone can do anything. Including raising one’s IQ even. I’m so glad science finally admitted to that lol",
                      "timestamp": "2022-08-03 04:09:18",
                      "score": 5,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "iiqoy2m",
                          "text": "Yeah iv noticed that aswell\n\nI can feel really dumb some days \n\nThen I’m a complete genius \n\nit seems to fluctuate \n\nbut I can always just decide to miss opportunities to be “smart” or I can take all that I can find",
                          "timestamp": "2022-08-03 04:18:28",
                          "score": 3,
                          "num_children": 1,
                          "author": 227220,
                          "replies": [
                            {
                              "id": "iiqs0ri",
                              "text": "The same thing happens to me. It has a physical sensation almost, literally feeling brain fog. Then if I’m ventilated I’m sharp as a razor.\n\nI got to thinking about it and I think emotional state limits our thoughts because they may be unrelated. Mindset is different with fight or flight vs the mind numbing sensation of love for instance. \n\nI started paying closer attention to the instant mental resources available to me in different moods. And tried linking helpful thought processes to break away from excess leisure or whatever the goal is. It’s having interesting results.",
                              "timestamp": "2022-08-03 04:47:59",
                              "score": 2,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "iiqsbfv",
                                  "text": "Yeah exactly the same here\n\nHave you noticed this happening to others around you?",
                                  "timestamp": "2022-08-03 04:50:51",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 227220,
                                  "replies": [
                                    {
                                      "id": "iiqtjf7",
                                      "text": "You’re the first that I’ve met that can relate actually lol but I have noticed others that decline compared to how they use to be. Just a constant fog. \n\nHow many people have you noticed doing this?\n\nOr do you mean as a result of your vibe? I notice that.",
                                      "timestamp": "2022-08-03 05:03:19",
                                      "score": 2,
                                      "num_children": 2,
                                      "replies": [
                                        {
                                          "id": "iiqvzrk",
                                          "text": "> vibe\n\nThat’s a good word\n\nIt’s 1000 theories all intertwined \n\nBut yes iv also noticed decline aswell \n\nBut iv also noticed the opposite \n\nThe last week has been completely different \n\nYou just get that feeling\n\nmy scientific hypothesis would be that people like us were isolated in our own internet bubble and the algorithm has finally allowed us to meet\n\nwether or not my ideas and your ideas I believe you may have are true though\n\nI’m not sure but I have a thoery for everything just in case it becomes useful",
                                          "timestamp": "2022-08-03 05:29:30",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 227220,
                                          "replies": [
                                            {
                                              "id": "iiqxs5q",
                                              "text": "That’s a frustrating problem isn’t it? 1000 theories mixing. Having a great idea that was born from the acknowledgment of several other ideas. Then as you’re trying to explain the great idea, the reality that the person you’re telling has never considered the initial ideas that make the great idea great in the first place lol nothing to do at that point besides turn the quick convo into a lecture or just stop short lol \n\nI like how you just made the internet algorithm poetic in a way lol but that is a solid point. I bet the IT department is getting yelled at now lol \n\nDo you notice if you’re energetic others around you become the same? Anger seems to be very contagious as well.",
                                              "timestamp": "2022-08-03 05:49:33",
                                              "score": 2,
                                              "num_children": 2,
                                              "replies": [
                                                {
                                                  "id": "iir9fey",
                                                  "text": "YES \n\nyou’ve just made my whole year make a little more sense\n\nmy bird would passively pickup on my emotions and imitate them\n\nBut in a polar fashion where we would be cycling around each other; orbit, sorta like Tom and Jerry \n\nIf I’m not Tom, he was Tom \n\nI spend a lot of my days with him\n\nWhen I’m angry, sad, frustrated\n\nHe would imitate me \n\n>",
                                                  "timestamp": "2022-08-03 08:15:18",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "author": 227220,
                                                  "replies": []
                                                },
                                                {
                                                  "id": "iira5pz",
                                                  "text": "With that also YES XD\n\nIt hard to explain a large concept to someone that’s never considered it\n\nAnd if you seek out people within that area, even then they might not share your interests or ideas\n\nI feel alien to every industry\n\nI haven’t found an effective way of logging my “discoveries” or ideas\n\nbut it’s like I’m reverse engineering over-washed terms that have been used so much\n\nIt also feels like the internet just got an update\n\nLike the flow of the ‘meta river’ is a flow of data and dictates where we all end up\n\n* what server is most efficient \n* what you’re placed into when ‘logging in’ wether that’s a game or even social media, entertainment\n*what videos/content you might view, the people you subsequently meet as a result, e.g. today\n\nthis is then made more complex with, video recommendation I.e. YouTube, YouTube Shorts, TikTok \n\nAnd because of the fast pace swiping of videos, it’s required/resulted in a faster and more efficient managing system \n\nThere’s streams/currents you can get pulled into\n\nif you’re aware of them, you can kinda steer it",
                                                  "timestamp": "2022-08-03 08:25:02",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 227220,
                                                  "replies": [
                                                    {
                                                      "id": "iit4hza",
                                                      "text": "Alien to every industry resonates with me pretty well lol \n\nI think the cause is that the vast majority memorize other people’s unique thoughts rather than exploring their own. \n\nEven people with master degrees. Which you’d think by then they’d know enough to feel comfortable in exploring the topic of their studies freely, but no. They just come back to what they were taught when I bring up a new concept in their field lol \n\nIt’s essentially exploring the dark when covering ideas not made mainstream knowledge. And a lot of people are afraid of the dark\n\nFor a while I would record my thoughts but then I never listened to them lol these days I just make super condensed notes in hella folders within folders. Then the condensed notes just help me remember if I forget \n\nYeah I try not to login to YouTube unless I feel compelled to comment. Clear my cookies also so then YouTube is fresh and my searches are more accurate",
                                                      "timestamp": "2022-08-03 17:38:45",
                                                      "score": 2,
                                                      "num_children": 0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "iiqw797",
                                          "text": "I think a part of it is that we MAY be correct but to assume everything will slot into place afterwards isn’t realistic\n\nNo one has anything 100% \n\nThey’re always wrong, or correct until proven otherwise\n\nI get this surge of flow state/infinite knowledge \n\nBut it’s finite \n\nAnd isn’t a result of your vast intellect, but a result of consistent exposure to the correct opportunities",
                                          "timestamp": "2022-08-03 05:31:46",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 227220,
                                          "replies": [
                                            {
                                              "id": "iiqy993",
                                              "text": "Yeah I’ve never believed destiny to control everything for this reason. Effort to expose yourself to a potential destiny I do believe in however. If someone is destined to be a hero but instead chooses isolation they might miss the boat \n\nSo absolutely perspective will dictate your outcome. Every opportunity is a new platform but some people are afraid of heights. They’re also afraid of being alone so they will tell others not to climb lol",
                                              "timestamp": "2022-08-03 05:55:02",
                                              "score": 2,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "iirbypk",
                                                  "text": "\n\nexactly\n\nMaybe you could think of success as a literal vertical ascension \n\nOr a metaphysical snakes and ladders\n\nIv noticed a fear of progression",
                                                  "timestamp": "2022-08-03 08:49:31",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 227220,
                                                  "replies": [
                                                    {
                                                      "id": "iit4w2p",
                                                      "text": "Yeah the higher you climb, the more you can see. Every achievement opens up new platforms to leap to\n\nJust like how it’s hard to explain the 1000 theories mixed. They just aren’t on the same platform",
                                                      "timestamp": "2022-08-03 17:41:16",
                                                      "score": 2,
                                                      "num_children": 0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "iiqrte0",
                          "text": "It’s easy to see behaviour like that and apply it to a group of people but we all do it\n\nwe avoid potential conflict that may indicate inadequacies \n\nor get offended by comments we interpret as insults \n\nthat’s why unstable people like us don’t have positions of power \n\nbecause if we were given it, we would make rules that would be detrimental \n\nlook at what happened when we gave feminists too much power\n\nFor the first half from 2005-2015 it was alright\n\nBut after the Gay marriage trend, we just said “we get it, just ask and we will give you whatever you want”\n\nThey saw that, and kept asking \n\nJust to see how far they can go\n\nthey started out as activists with a just cause, but once they convinced everyone that they need power, they saw oppertunities and they took it\n\nBecoming corrupted\n\nNow the head of Feminism is run by completely different people with different intentions \n\nBut they hold up this act of pure intent",
                          "timestamp": "2022-08-03 04:45:56",
                          "score": 2,
                          "num_children": 1,
                          "author": 227220,
                          "replies": [
                            {
                              "id": "iiqtdrr",
                              "text": "Have you ever considered what would happen if positive mental disorders were handed out? You just reminded me of this\n\nSay someone were diagnosed with confidence. But then they say your type of confidence is short bursts, or maybe it is lingering. Then they help you identify what areas of life you are specifically confident and so on. Confidence is just an example\n\nBut then everyone would be focused on what they can do vs what they cannot. If someone is diagnosed they learn everything about it. I wonder how much of this is known already and put to use. Perhaps these extreme groups are attempting to cultivate something far from their advertised goals. \n\nSo there are multiple layers. The people in protected groups are allowed these heightened rights simply for an alteration into vulnerability of perspectives. \n\nI traced the trends I could remember starting from when participation awards began and it seems like breeding a generation of narcissism is the goal. Narcissists will be very focused on something important to them. They will push for everyone to bend to them and love power. Heightened rights. And all the other poisonous traits of narcissism that are enforced in feminism, pride, blm, etc",
                              "timestamp": "2022-08-03 05:01:43",
                              "score": 3,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "iiqttvm",
                                  "text": "Yeah I sorta understand your idea\n\nI had a similar idea, but I assumed it was a bi product of something else\n\ndo you believe this could be on purpose?\n\nI have a bunch of ideas on how the internet and social media is a hyper curated stream of content and adapts to the person watching\n\nthere’s so many implications to this because you could theoretically control a population \n\nOnly if you filter everyone in the correct catagories",
                                  "timestamp": "2022-08-03 05:06:20",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 227220,
                                  "replies": [
                                    {
                                      "id": "iiqun9f",
                                      "text": "That’s an interesting theory. So let’s say someone showcases i mindset then the algorithm would guess their personality and then prioritize info that would lead them down a different thought process.\n\nLike a prescription. Someone is patriotic by a different standard for example and so they should see content that would plant a reverse thought process. A seed thought but also direct info to stimulate a mental rabbit hole. \n\nIs that what you mean?",
                                      "timestamp": "2022-08-03 05:14:58",
                                      "score": 3,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "iiqwp33",
                                          "text": "YES exactly\n\nstuff like that\n\nYou can do ANYTHING with a live adaptation like that\n\nyou could create allot of good or allot of bad using this tool\n\niv noticed allot of bad but cannot prove it, but iv started to see some good aswell\n\nespecially as of late, it’s been encouraging me to do better\n\nI use ‘it’ but it’s a sort of entity that functions on its own\n\nLike we’re the cells inside a body or an ant in a colony 🐜, and we’re following the pheromones \n\nJust simple things that have implications \n\nwe choose our role wether it’s a worker or a stem cell\n\nand we do it as perfectly as we can\n\nany deviation that isn’t regulated could be unique behaviour and isn’t healthy for a functioning “entity”\n\nSo it has to be eradicated to prevent mix up\n\nI.e cancer\n\nAnts also have a similar function where a certain smell tells the colony that someone has died\n\nThey deal with that dead ant \n\nit’s functions like this that link all the potential worlds we can wake up in",
                                          "timestamp": "2022-08-03 05:37:17",
                                          "score": 2,
                                          "num_children": 2,
                                          "author": 227220,
                                          "replies": [
                                            {
                                              "id": "iiqy19d",
                                              "text": "Look into psychology... you will find your answers there.",
                                              "timestamp": "2022-08-03 05:52:26",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 147755,
                                              "replies": [
                                                {
                                                  "id": "iirb5fu",
                                                  "text": "What should I start with?",
                                                  "timestamp": "2022-08-03 08:38:26",
                                                  "score": 2,
                                                  "num_children": 1,
                                                  "author": 227220,
                                                  "replies": [
                                                    {
                                                      "id": "iisx5n7",
                                                      "text": "The subconscious, and how to manipulate it.",
                                                      "timestamp": "2022-08-03 16:51:18",
                                                      "score": 2,
                                                      "num_children": 1,
                                                      "author": 147755,
                                                      "replies": [
                                                        {
                                                          "id": "iiwj1ba",
                                                          "text": "Iv started to recently \n\nJust small changes over time\n\nIs there a direct way of doing so? Like a technique \n\nAny links?",
                                                          "timestamp": "2022-08-04 11:34:30",
                                                          "score": 2,
                                                          "num_children": 1,
                                                          "author": 227220,
                                                          "replies": [
                                                            {
                                                              "id": "ij09jp3",
                                                              "text": "I'm still figuring that out, myself. Sorry.",
                                                              "timestamp": "2022-08-05 03:11:28",
                                                              "score": 2,
                                                              "num_children": 2,
                                                              "author": 147755,
                                                              "replies": [
                                                                {
                                                                  "id": "ij37vw7",
                                                                  "text": "I may be better off\n\nNot atm\n\nI didn’t have any information for you\n\nbut iv made some progresss",
                                                                  "timestamp": "2022-08-05 18:50:08",
                                                                  "score": 2,
                                                                  "num_children": 0,
                                                                  "author": 227220,
                                                                  "replies": []
                                                                },
                                                                {
                                                                  "id": "ij383va",
                                                                  "text": "You gotta surf the possible choices you can make throughout the day/year/lifetime\n\nGlide through the best options you can think about\n\nDon’t care about what others are thinking about\n\nThat’s the key \n\nDon’t care\n\nJust do",
                                                                  "timestamp": "2022-08-05 18:51:33",
                                                                  "score": 2,
                                                                  "num_children": 0,
                                                                  "author": 227220,
                                                                  "replies": []
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "iiqzliu",
                                              "text": "I played with a thought experiment once that led me to some more interesting thoughts. \n\nWhat if every day were a new dimension. The choices you make before going to sleep determining what dimension we wake up in. \n\nIn this theoretical existence you’d have to consider that everyone is living their own life but we share this life. Some are closer to the same dimension as you and others are far distant. \n\nThen a whole flood of new ideas came to me lol \n\nI like “entity” I’ve always referred to it as “the collective mind” \n\nI use to work at a telemarketing place that accidentally showcased an interesting interaction \n\nIt was robocalls, pre recorded but we would control the calls with a keyboard. 2-4 calls at a time per person.\n\nMe and some friends noticed that all the calls would be screaming people and suddenly hella buyers that were chill. The lead source was not updated either\n\nSo it made me wonder if there were a link of sorts. Somehow the nation would switch moods together and over the process of an hour\n\nI then came across a study that says emotion changes the molecular structure of water. So the “bad vibes” is now scientifically measured. We are 70% water. \n\nIt could be that people are very receptive and in abundance. This was 10 years ago when things were chill. There’s clearly something going on that is difficult to explain beyond the internet trash, but it may be directly related. \n\nMass bad news would cause a mass of one emotion and could spread like a wave",
                                              "timestamp": "2022-08-03 06:10:35",
                                              "score": 1,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "iire5es",
                                                  "text": "I haven’t applied that last idea to a society as a whole \n\nIv come to conclusions similar to Christianity in that regard\n\nThere’s like an energy, I’ll settle with Good and Bad for now\n\nthere’s an ongoing battle for who wins that day\n\nIt’s like there’s a football match going on above us and there’s one for each person \n\nand it comes in huge waves\n\nThat span over a week or month\n\n*Day by Day/Night by Night: I think, my theory (literally today) \n\nWas that when you go to sleep, you go to another persons body/experience and they take you’re place or another person instead (depending on how many polygons this complex structure is)\n\nBut it’s sorta compacted, so: \n\nDay 1: What feels like my original body\n\nDay 2: Someone else\n\nDay 3: Someone else\n\n…\n\nDay 12: Original body\n\nBut instead of it being 12 days In the future\n\nit’s still only your second day, from where you left off\n\nAnd all of you’re dreams are lingering memories of your travels\n\nMy theory upon what’s above is that this is to teach us  as individuals that you may or may not make the choices you think you may make \n\nlet’s say you judged a person today, and they made a mistake that you feel you wouldn’t of made\n\nYou may have a new experience where you’re put in a similar situation to experience what it is like\n\nOr to May even prove yourself correct in your judgment\n\nThis may result in a change as to your position within the universe\n\nmaybe you find yourself stuck in a loop with no progression and the one thing you need to do to complete it, is the simplest things in life\n\nNot necessarily if youre good or bad or not\n\nBut willing to be nice even if it makes you look awkward \n\nPutting your phone down once a while\n\njust simple stuff",
                                                  "timestamp": "2022-08-03 09:19:24",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 227220,
                                                  "replies": [
                                                    {
                                                      "id": "iitvs79",
                                                      "text": "It really does feel like that right? Being a different person. \n\nThe times in anger when I say something I wouldn’t have said otherwise led me to noticing the difference in mental resources under different emotions \n\nI just can’t help but strive for a way to control these transitions. \n\nInteresting though, I had deja vu while reading this lol I think deja vu plays it’s part in this thought experiment of different people and different dimensions \n\nI like to think of deja vu as a signal you’re going the right way to one of your optional destinies. I always like the head feeling deja vu causes lol sometimes I’ll get deja vu of a thought lately. This is new and interesting \n\nBut yeah there’s for sure a good and bad going on\n\nThe saddest thing I think is meeting someone with great potential but they choose to aggressively hold others back instead. I call them the fallen \n\nI must say though, it is very interesting meeting you. You’re the closest in wave length and ground covered to my thoughts that I have met",
                                                      "timestamp": "2022-08-03 20:43:34",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "iird1ng",
                                  "text": "I re read this, and I’m getting a clearer image of what you mean\n\nSo you’re idea is that pampering our entire generation was a 20-40 year plan?\n\nthat’s honestly pretty cool, I never thought of that\n\nyeah I think it’s possible\n\nbut what’s their game here?\n\nmaybe there’s an unrecorded dialogue between others countries that just isn’t within our reach\n\nmaybe there was a second Cold War without our knowledge\n\nand there was a need to breed a high amount of specific individuals \n\nDid they design this scheme with technology in mind\n\nOr is it a happy accident that these abilities we have now, can be used it that way\n\n> “AI diagnoses”\n\nThat’s an amazing way of putting it\n\nThis idea has been lingering around my mind for a long time \n\nyeah it could and maybe is already diagnosing/categorising people \n\nBut is only utilising the data for content recommendation \n\n it could be linked up with mechanical devices within our body, to effectively inform a medical section of the government, the physical state of everyone’s bodies and then use that data to further predict the spread of Covid and similar disease\n\nLet’s just say, if that IS to be implemented in the future\n\nWould they tell everyone?\n\nor would at-least try and setup the infrastructure before hand?",
                                  "timestamp": "2022-08-03 09:04:16",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 227220,
                                  "replies": [
                                    {
                                      "id": "iit9wsy",
                                      "text": "Yeah it’s a long con for sure. Gotta breed the mindset that will back the desired change in a landslide approach \n\nRetracing the slipperyslope of it all, chaos theory etc. it honestly seems biblically motivated. \n\nIt’s just another layer to overthrow traditional western governments. This would be the puppets goal but the source of inspiration for this idea and the underlying result it is causing seems to be riddled with evil intent. A massive misdirection \n\nThe funny thing about technology development is the limiting factors lol if there were not influences of power we would be far more advanced than we are. Patents are FAR more expensive than they use to be as well\n\nSo I don’t believe technological advancements are a focus, except for limiting them. Just as your idea with the algorithm applies, so does what people do in their day to day life\n\nThe numbing aspect of social media has amazing benefits for someone wanting lemmings so why not bring in virtual reality and augmented reality? But then notice how oculus was purchased by FB. Immersed social media would have a greater impact\n\nMechanical components in our bodies would be unnecessary really. When there is already a predictable human nature, just careful planning drawn from data mining is all that is required\n\nPain or pleasure is how the mind and world works. Some people will go to amazing lengths to achieve pleasure and avoid pain. Even hinder themselves. If you can alter the meanings of pain and pleasure then you just need to sit back and wait\n\nAlso with documentation of thoughts. I just have rabbit holes of folders within folders that lead to condensed notes that will remind me of the concept if I forget\n\nI made detailed recordings and notes for a while but I noticed how much of a waste of time that was as time progressed. I’d look back and notice a flawed thought because I was on a different platform now. Probably the re-engineering you speak of\n\nTry condensed notes. Most of my ideas just stay in my Memory Palace. If you don’t know what that is, check it out. You can go beyond storing memories in drawers etc but can store memories in emotions if you like. I spent some time storing memories in other memories lol",
                                      "timestamp": "2022-08-03 18:14:29",
                                      "score": 1,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iiqjhy7",
                      "text": "> but 90% of every difficult task is mental\n\nSure, but 'mental' only sorts out those that meet the \"physical limitations\" of whatever it is. ie.. Of all the tall guys in the NBA only the mentally tough can become stars.\n\n> that’s why I’m so confused about why women aren’t is Esports as much\n\nDon't be confused, you answered yourself 2 sentences later :-) ... \"men being more able to think strategically\"\n\nThere's no difference in IQ between men and women and yet the very best female chess players don't score in the top 50? of men players. We 'think' differently.\n\n> Nature/Nurture Ying/Yang\n\nThat's the absolute crux of all the bullshit currently infecting the western world. We ARE different!",
                      "timestamp": "2022-08-03 03:30:25",
                      "score": 2,
                      "num_children": 2,
                      "author": 237689,
                      "replies": [
                        {
                          "id": "iiqmnzh",
                          "text": "You’re honestly the first person that iv talked to that is GENUINLY in the middle\n\nit sucks that the only ppl you talk to are on polar ends of the spectrum\n\nhalf of the population can’t even extrapolate their experiences",
                          "timestamp": "2022-08-03 03:57:39",
                          "score": 1,
                          "num_children": 1,
                          "author": 227220,
                          "replies": [
                            {
                              "id": "iiqq0dq",
                              "text": "\n<shrug> There's nothing 'special' about me. I do have some traits that apparently aren't 'normal' tho.\n\n- Facts and Logic trumps 'feelings' everytime. \n\n- Brutal honesty with myself and only a little less 'brutal' with others.\n\n- Being wrong is a requirement of becoming right. \n\n- New facts can easily change my opinion.\n\n- Sexism, Racism, etc are all fuckin stupid.\n\n\nLOL.. most people find me very fuckin annoying... LOL... <shrug> fuck'em..\n\n\nnb: based on your other question and just in case... bullet points are a leading - and a space..  :-)",
                              "timestamp": "2022-08-03 04:28:28",
                              "score": 1,
                              "num_children": 3,
                              "author": 237689,
                              "replies": [
                                {
                                  "id": "iiqqh2d",
                                  "text": "Yeah I need to get better at portraying my ideas and thoughts\n\nI’m always trying to get better though, but I still try and conform to the standard for each social media",
                                  "timestamp": "2022-08-03 04:32:57",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 227220,
                                  "replies": []
                                },
                                {
                                  "id": "iiqqloi",
                                  "text": "The last 2 weeks has been a HUGE learning experience \n\nAnd it seems others have also gone through the same thing\n\nI have allot of psychotic ideas, most of them extremely elaborate And hard to explain\n\nBut I feel things going on that are seperate to me\n\nIt’s weird",
                                  "timestamp": "2022-08-03 04:34:11",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 227220,
                                  "replies": [
                                    {
                                      "id": "iir937r",
                                      "text": "> The last 2 weeks has been a HUGE learning experience\n\nSo 2 weeks of winning!! Excellent.\n\n> It’s weird\n\nLOL, couldn't 'weird' be described as 'normal for a few'?",
                                      "timestamp": "2022-08-03 08:10:40",
                                      "score": 1,
                                      "num_children": 2,
                                      "author": 237689,
                                      "replies": [
                                        {
                                          "id": "iirfvp3",
                                          "text": "Sort of winning\n\nIt’s a balancing rope",
                                          "timestamp": "2022-08-03 09:42:30",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 227220,
                                          "replies": []
                                        },
                                        {
                                          "id": "iirg9m2",
                                          "text": "Idk, I use the term weird \n\nBut I just mean change \n\nThere’s been allot of differing sensations lately\n\nI like have an extra sense\n\nI try and shut delusions down, and I’m really good at managing the anxiety \n\nBut the headspace allowed for amazing ideas \n\nbut it can be taxing\n\nI don’t share my ideas anymore until today\n\nIv found a few people who are my intellectual soulmates Per-say\n\nthis feeling implies massive change\n\nBut not of it has been visible to me\n\nWe have been isolated from everything\n\nUsually once I get this feeling, something different happens \n\nIv been getting these feelings since 2020 but I ignored them cos I was still learning what everything meant and didn’t wanna jump to conclusions \n\nI slowly worked my way in took everything as a grain of salt\n\nonly when things flesh together, I maybe vocalise my ideas\n\nI’m too scared of being called crazy or other names\n\nBecause I can overlook obvious things\n\nbut I only explore an idea if it seems viable",
                                          "timestamp": "2022-08-03 09:47:38",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 227220,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "iiqqt0f",
                                  "text": "I’m exactly the same\n\nlike exactly\n\nI see allot of potential in people so I can’t help but be brutally honest \n\nbut being stuck in a bubble of where everyone is lying to themselves is hard\n\nYou believe that there’s not even a need to improve and that you’re just perfect \n\nIt’s been said allot, but I’m only just now feeling it fully",
                                  "timestamp": "2022-08-03 04:36:09",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 227220,
                                  "replies": [
                                    {
                                      "id": "iir90mx",
                                      "text": "> I see allot of potential in people so I can’t help but be brutally honest\n\nSooo, you're being helpful right?... I bet ya get a lot of love for that.. lol\n\n> everyone is lying to themselves is hard\n\nA lot of people conflate their 'self worth' with their 'opinion' and so anything that shows them to be wrong about any bloody thing is converted into you calling them a worthless person <shrug> so you're obviously a prick.. lol\n \nI just don't talk to these people.",
                                      "timestamp": "2022-08-03 08:09:42",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 237689,
                                      "replies": [
                                        {
                                          "id": "iirfkvs",
                                          "text": "I feel the need to inform \n\nLike I’m on the titanic that knows about the iceberg \n\nBut everyone’s too high to do anything or even pay attention \n\nAnd there’s a select group that also know but they’ve given up trying also",
                                          "timestamp": "2022-08-03 09:38:33",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 227220,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "iiqmpqn",
                          "text": "How do you quote like that?",
                          "timestamp": "2022-08-03 03:58:05",
                          "score": 1,
                          "num_children": 1,
                          "author": 227220,
                          "replies": [
                            {
                              "id": "iiqnh10",
                              "text": "Umm, do you mean how I 'quote' what you said?\n\nput a > and a space before the words.",
                              "timestamp": "2022-08-03 04:04:53",
                              "score": 1,
                              "num_children": 1,
                              "author": 237689,
                              "replies": [
                                {
                                  "id": "iiqoq3v",
                                  "text": "> thank you",
                                  "timestamp": "2022-08-03 04:16:22",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 227220,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "iirpy0d",
                      "text": "Yeah, but I also think women kind of know military is much harder on them. Women are so much more vulnerable in war. Women in war get raped and there have been numerous of accounts of women who have battled on the front line who have ended up kidnapped by the opposing side. Then they rape them and “throw them back”, bc they know it will create chaos to the group. The men go into full blown revenge mode if a woman in a pluton gets raped, which is why she is told not to say anything about it.\n\nEverywhere there is war women and children get raped all over the place.  \n\nLike shit is brutal in war. And from all the stories I Have heard about women getting raped in military I really cannot say it appeals to me",
                      "timestamp": "2022-08-03 11:41:03",
                      "score": 1,
                      "num_children": 0,
                      "author": 373922,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iiquwfe",
                  "text": "You seem a little delusional yourself, mate.",
                  "timestamp": "2022-08-03 05:17:43",
                  "score": 0,
                  "num_children": 0,
                  "author": 62540,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iiqkivw",
          "text": "They think they can be equal to men even biologically speaking since even male animals are prone to fight and protect the female. It’s just a natural masculine trait, an instinct. I’m curious of the other comments, too bad she deleted the post though..",
          "timestamp": "2022-08-03 03:39:03",
          "score": 2,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iirjj29",
          "text": "I grew up as a man in a very female-dominated world. They always tried to make me hate military stuff, tanks, helicopters, wargear and guns. But I was always fascinated by this stuff. It's not that girls don't grow up that way, it's that they don't have the biological predisposition to like this kind of stuff like men do. Sure, there might be exceptions, but most boys love tanks, helicopters, spaceships, even stuff like powerplants. \n\nI talked to a friend of mine recently, who works in a powerplant and well, he said the exact same thing. \n\nAnd even tho I am stuying political science, war and conflict is still the most fascinating aspect of this field.",
          "timestamp": "2022-08-03 10:29:55",
          "score": 1,
          "num_children": 0,
          "author": 69862,
          "replies": []
        }
      ]
    },
    {
      "id": "iipl81c",
      "text": "Wtf ? Anyone to tell those idiots that it's okay if men and women are different?? Its what makes them men and women like, why does it bother them so much that men are better at certains things than women ? As far as i know when its women doing things better than men everyone cheers",
      "timestamp": "2022-08-02 23:13:29",
      "score": 30,
      "num_children": 3,
      "author": 200588,
      "replies": [
        {
          "id": "iiq93v8",
          "text": "Yeah and they humiliate the man that underperformed \n\nCreating and incentive to be better then women\n\nThat maybe creates the idea that men ARE better then women, but it’s just that they have more at stake if they aren’t better then them",
          "timestamp": "2022-08-03 02:08:26",
          "score": 10,
          "num_children": 0,
          "author": 227220,
          "replies": []
        },
        {
          "id": "iiqedbz",
          "text": "Because not everyone is reasonable. Some take it for what it is and understand each sex has their unique strengths and weaknesses. They understand that this doesn’t make one sex superior to the other and they also understand and respect the existence of outliers.\n\nOther people(and these are the types that get the most attention because they’re sensationalist). Take things too far and make bold claims that certain gendered strengths are the “truly important” ones and  they use that to make arguments for gendered supremacy. Then it starts a petty battle and argument about which sex is worse. Which is more needed etc. And then you get extremists who start advocating for female subjugation and eradication of the “disagreeable ones” or for culling the male sex as a whole. \n\nSo whenever you bring this thing up people get triggered because they expect the conversation to devolve into a bid for sex supremacy.",
          "timestamp": "2022-08-03 02:48:55",
          "score": 2,
          "num_children": 0,
          "author": 179179,
          "replies": []
        },
        {
          "id": "ijcztco",
          "text": "Serious question, what was actually said in this post that you found so offensive? Unless I’m missing something, OP posted a screenshot of him making comments where he claimed that (essentially) pointing out physical differences between men and women is no longer allowed and (I guess?) would get you cancelled or whatever. Him getting yelled at by feminists didn’t actually happen in the post, he’s just claiming it would. It’s just like a persecution fetish thing he’s doing.",
          "timestamp": "2022-08-07 21:21:43",
          "score": 1,
          "num_children": 1,
          "author": 25081,
          "replies": [
            {
              "id": "ijd06os",
              "text": "This not related entirely to the post, i used it to make a point for what i understood of it",
              "timestamp": "2022-08-07 21:24:13",
              "score": 1,
              "num_children": 1,
              "author": 200588,
              "replies": [
                {
                  "id": "ijd1ap2",
                  "text": "Oh, okay. I think it's always best to take posts like these with a grain of salt. It's very easy for stuff like this to radicalize people, which is especially silly when (like OP here) there isn't actually anything negative happening, just some dude pretending like he's being persecuted in an effort to nudge people in a certain direction ideologically.",
                  "timestamp": "2022-08-07 21:31:49",
                  "score": 1,
                  "num_children": 1,
                  "author": 25081,
                  "replies": [
                    {
                      "id": "ijd1qz2",
                      "text": "It's just that it's okay to be different people don't need to make it a competition between men and women. Only stupid people could comclude that women are weak because they don't go military as much as men",
                      "timestamp": "2022-08-07 21:34:55",
                      "score": 1,
                      "num_children": 1,
                      "author": 200588,
                      "replies": [
                        {
                          "id": "ijd30zp",
                          "text": "I 100% agree. I'd be willing to bet that the percentage of people that think everything has to be a competition between men and women is very, very small, and probably pretty even split between men and women. You'd probably find yourself much more happy if you ignored that small, vocal, minority than allowing them to take up any of your head-space. Trust me, it can be VERY unhealthy to dwell on stuff like that. It just leads to isolation, depression, and rage.",
                          "timestamp": "2022-08-07 21:43:39",
                          "score": 2,
                          "num_children": 1,
                          "author": 25081,
                          "replies": [
                            {
                              "id": "ijd3qwc",
                              "text": "I have a cloud for that, it's super useful to only care about me",
                              "timestamp": "2022-08-07 21:48:29",
                              "score": 1,
                              "num_children": 0,
                              "author": 200588,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iiqbaii",
      "text": "Honestly in my experience living in the rural Midwest, most guys around here are more likely to be poor/broke and have a lack of employment options, they see the signing bonuses, and think this is their only opportunity to escape poverty...",
      "timestamp": "2022-08-03 02:25:05",
      "score": 7,
      "num_children": 0,
      "author": 307687,
      "replies": []
    },
    {
      "id": "iiqv1df",
      "text": "Because men are conditioned to believe brutal physical labor in harsh deadly environments will make us worthy of existing.",
      "timestamp": "2022-08-03 05:19:11",
      "score": 6,
      "num_children": 1,
      "author": 107944,
      "replies": [
        {
          "id": "iirij4i",
          "text": "Or money",
          "timestamp": "2022-08-03 10:17:23",
          "score": 2,
          "num_children": 0,
          "author": 324853,
          "replies": []
        }
      ]
    },
    {
      "id": "iisrdxi",
      "text": "Nobody should be forced to join the military",
      "timestamp": "2022-08-03 16:14:45",
      "score": 3,
      "num_children": 0,
      "author": 208507,
      "replies": []
    },
    {
      "id": "iipws0c",
      "text": "Lol. Im sure the bigots had their faces steaming red after reading that which completely proves the point.",
      "timestamp": "2022-08-03 00:37:13",
      "score": 7,
      "num_children": 0,
      "author": 304158,
      "replies": []
    },
    {
      "id": "iiqvpjk",
      "text": "Lol the stinking hypocrisy",
      "timestamp": "2022-08-03 05:26:23",
      "score": 2,
      "num_children": 0,
      "author": 65777,
      "replies": []
    },
    {
      "id": "iirasej",
      "text": "Ah but they realize the truth though lol",
      "timestamp": "2022-08-03 08:33:36",
      "score": 2,
      "num_children": 1,
      "author": 209077,
      "replies": [
        {
          "id": "iirggef",
          "text": "+1 poison damage \n\nXD",
          "timestamp": "2022-08-03 09:50:08",
          "score": 2,
          "num_children": 0,
          "author": 227220,
          "replies": []
        }
      ]
    },
    {
      "id": "iis3id3",
      "text": "And that's why no woman has won the TV show \"Alone\" yet.",
      "timestamp": "2022-08-03 13:36:15",
      "score": 2,
      "num_children": 0,
      "author": 177093,
      "replies": []
    },
    {
      "id": "iiqrlzi",
      "text": "\"Correct\" lel",
      "timestamp": "2022-08-03 04:43:55",
      "score": 1,
      "num_children": 0,
      "author": 297686,
      "replies": []
    },
    {
      "id": "iitv0op",
      "text": "Spoiler for any feminism sub i.e. how to be a biased idiot who views everything through a biased lens i.e. how to be a feminist:\n\n* If a man or men in general suffer from something worse, it's caused by men or their fault.\n\n* If a woman or women in general suffer from something worse, it's caused by society, ultimately men, or a man's fault.\n* If a man or men in general have any good quality or have earned something, it's caused by their privilege\n* If a woman or women in general have any good quality or have earned something, it's because they're better at something and have earned it.",
      "timestamp": "2022-08-03 20:38:15",
      "score": 1,
      "num_children": 0,
      "author": 76887,
      "replies": []
    },
    {
      "id": "iiu9l3h",
      "text": "I have no military experience, but I know my actions and response to a situation of close quarter combat or even hand to hand fighting would be different against a male or female enemy, does anyone else feel that way?",
      "timestamp": "2022-08-03 22:22:55",
      "score": 1,
      "num_children": 0,
      "author": 227523,
      "replies": []
    },
    {
      "id": "iivqz6r",
      "text": "Where I grew up, women don't join the military because they aren't conscripted, easy.",
      "timestamp": "2022-08-04 05:43:08",
      "score": 1,
      "num_children": 0,
      "author": 126706,
      "replies": []
    },
    {
      "id": "iirj6xf",
      "text": "Yeah um, thats not why.",
      "timestamp": "2022-08-03 10:25:43",
      "score": -1,
      "num_children": 1,
      "author": 330647,
      "replies": [
        {
          "id": "iisbuuz",
          "text": "?",
          "timestamp": "2022-08-03 14:34:41",
          "score": 2,
          "num_children": 1,
          "author": 23205,
          "replies": [
            {
              "id": "iisx1oh",
              "text": "That is not why women join the militarry less",
              "timestamp": "2022-08-03 16:50:37",
              "score": -1,
              "num_children": 0,
              "author": 330647,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iitr6ze",
      "text": "It's simply because of biology...men are stronger than women in general. Also by extension they _need_ to be stronger to be considered \"manly\" so even average men are pushed to be physically strong.\n\n Its normal for a man to join the army. It's something out of the ordinary for a women. \n\nIt's the same with education (atleast in my country). Men are expected to be Engineers and people will think less of them if they take any feminine careers like literature, arts... females have a _choice_ (some are even discouraged). They are not expected to have high paying jobs so they don't feel pressured to take up engineering.",
      "timestamp": "2022-08-03 20:11:42",
      "score": 0,
      "num_children": 0,
      "author": 74776,
      "replies": []
    }
  ]
}