{
  "id": "wg0881",
  "text": "Pro-life my ass\n",
  "timestamp": "2022-08-04 12:39:26",
  "score": 4076,
  "subreddit": "t5_3fdcn",
  "num_children": 30,
  "author": 398010,
  "replies": [
    {
      "id": "iiwq5aa",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-08-04 12:39:26",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "iiwwbca",
      "text": "\"I'm so sad the majority of our citizens think differently and we can't impose our will on them anymore.\"",
      "timestamp": "2022-08-04 13:28:28",
      "score": 232,
      "num_children": 1,
      "author": 103727,
      "replies": [
        {
          "id": "iiwzlwr",
          "text": "Except they will.",
          "timestamp": "2022-08-04 13:52:48",
          "score": 77,
          "num_children": 1,
          "author": 220697,
          "replies": [
            {
              "id": "iixyw54",
              "text": "They can’t, as far as I’m aware. The ballot measure also prevents the legislature from circumventing the voters on this issue.\n\nEdit: comment below explains that abortion is actually enshrined in the state constitution and a direct vote was the only way to change it.",
              "timestamp": "2022-08-04 17:41:02",
              "score": 33,
              "num_children": 2,
              "author": 9871,
              "replies": [
                {
                  "id": "iiy0vwy",
                  "text": "Yeah in this case it's binding because abortion in enshrined in the state constitution and the only way to change the constitution is via direct ballot. This was the attempt to un-enshrine it and it failed miserably - there's basically nothing they can now do because passing laws that will immediately violate the state constitution is pointless, and they're not going to be able to amend it any time soon given the clear voter antipathy to their bullshit.",
                  "timestamp": "2022-08-04 17:53:12",
                  "score": 33,
                  "num_children": 1,
                  "author": 257537,
                  "replies": [
                    {
                      "id": "iiz5f04",
                      "text": "Couldn't they pull a Texas and try to let people sue like, everybody having anything to do with abortion?",
                      "timestamp": "2022-08-04 22:13:29",
                      "score": 6,
                      "num_children": 2,
                      "author": 354168,
                      "replies": [
                        {
                          "id": "iiz7da1",
                          "text": "No, because Texas constitution allows them to make it illegal.\n\nThey couldn't pass a law making it illegal in Kansas, regardless of the enforcement mechanism (state or personal lawsuit) because the constitution of the state says they can't make it illegal.",
                          "timestamp": "2022-08-04 22:26:51",
                          "score": 7,
                          "num_children": 0,
                          "author": 257537,
                          "replies": []
                        },
                        {
                          "id": "iiz5rnl",
                          "text": "Gotta get the law passed, plus the suing could probably be argued as infringing on the state constitution",
                          "timestamp": "2022-08-04 22:15:53",
                          "score": 1,
                          "num_children": 0,
                          "author": 49871,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iizgi1g",
                  "text": "Words on paper do not stop the fucking fascists.",
                  "timestamp": "2022-08-04 23:32:09",
                  "score": 1,
                  "num_children": 0,
                  "author": 215411,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iiwvx4a",
      "text": "Conservative policies lead to millions of excess deaths *I sleep* \n\nHealthcare is kept legal that actually saves lives and just doesn’t punish people for terminating an unwanted fetus *real shit*",
      "timestamp": "2022-08-04 13:25:28",
      "score": 109,
      "num_children": 0,
      "author": 54022,
      "replies": []
    },
    {
      "id": "iiwztcf",
      "text": "George Carlin said it best: \"They want live babies so they can grow up to be dead soldiers\"",
      "timestamp": "2022-08-04 13:54:18",
      "score": 91,
      "num_children": 1,
      "author": 209694,
      "replies": [
        {
          "id": "ij0jz00",
          "text": "I wish he was still around, to talk about this. Though now that I think of it, part of me is glad he didn’t live to see this. I miss my parents every day, but I’m also glad they don’t have to see this.",
          "timestamp": "2022-08-05 04:45:57",
          "score": 7,
          "num_children": 0,
          "author": 45990,
          "replies": []
        }
      ]
    },
    {
      "id": "iiww9y7",
      "text": "It’s about control. Sanctity of life bullshit",
      "timestamp": "2022-08-04 13:28:10",
      "score": 46,
      "num_children": 1,
      "author": 289553,
      "replies": [
        {
          "id": "ij0jp8z",
          "text": "They are not pro-life, they’re pro-birth. The second the baby is born they don’t give two shits.",
          "timestamp": "2022-08-05 04:43:14",
          "score": 8,
          "num_children": 0,
          "author": 45990,
          "replies": []
        }
      ]
    },
    {
      "id": "iiwx9sm",
      "text": "It was never about life, it was always about control.",
      "timestamp": "2022-08-04 13:35:41",
      "score": 44,
      "num_children": 1,
      "author": 19281,
      "replies": [
        {
          "id": "ij0jl40",
          "text": "Yes. I’m in no danger of getting pregnant and I live in a blue state, but they don’t want women to have reproductive rights. OVER THEIR OWN BODIES. We can’t be trusted, apparently, Fuckers. And more people who aren’t straight white wealthy Republicans are going to lose theirs. So that’s why I have a white-hot rage and cry much more than usual.",
          "timestamp": "2022-08-05 04:42:06",
          "score": 6,
          "num_children": 0,
          "author": 45990,
          "replies": []
        }
      ]
    },
    {
      "id": "iix3fxn",
      "text": "“Pro-life” has always meant exactly one thing: anti-abortion/pro-forced birth.\n\nThese “I thought you were pro-life?” zingers that reference any issue other than abortion are not and have never been dunks, because they wrongly attribute more meaning to the term than those who use it do.\n\nThis is the equivalent of someone who thinks socialism is “when the government does stuff” saying to an actual socialist who wants the government not to do something, “I thought you were a socialist?” It’s not a valid accusation of hypocrisy; it’s a fundamental misunderstanding of terms.",
      "timestamp": "2022-08-04 14:19:38",
      "score": 34,
      "num_children": 2,
      "author": 145313,
      "replies": [
        {
          "id": "iixt3kp",
          "text": "Iabortion is marketed as killing babies and as murder. It's easier to be against 'baby murder' and then not be for quality of life or reduce suffering. \n\n'Baby murder' gets an emotional reaction and cuts off the ability to think through the larger problem and the complex moral and ethical problems that may actually get people to work together on solving social issues. \n\nIf presented in a factual and good faith manner, I think most would actually agree with keeping with pro choice and working toward things that would reduce suffering and actually reduce the number of abortions(which banning won't),  while preserving bodily autonomy.",
          "timestamp": "2022-08-04 17:04:39",
          "score": 14,
          "num_children": 2,
          "author": 340507,
          "replies": [
            {
              "id": "iiy4uaz",
              "text": "[Most people already do favor some degree of abortion rights.](https://www.vox.com/policy-and-politics/23167397/abortion-public-opinion-polls-americans) I would expect that most of those people would also be willing to support policies that we know would *actually* reduce the number abortions, as you suggest.\n\nProblem #1 is that where we are now, messaging isn’t really the issue. Abortion rights were stripped as the culmination of a decades-long organizational effort by a fanatical minority to explicitly subvert democracy. As we just saw in Kansas (a deep red state), if abortion rights were actually put up to a vote, they would likely be upheld. Most people already know where they stand on the issue, but even if we persuaded everyone who was still open to changing their mind, that wouldn’t change the fact that said fanatical minority still holds the necessary power.\n\nProblem #2 is that, for the “true believers” who will remain opposed to abortion no matter what, it’s not *just* about abortion, and it never has been. There is an entire constellation of interlocking beliefs, the most central, of course, being a belief in God, and the accompanying moral conviction of answering to a “higher power.” Among those is an opposition to contraception (because sex is for making babies) and opposition to anything beyond abstinence-only sex education (because premarital sex is sinful, and thus children don’t need to learn about it), both of which are policies that would reduce abortions by reducing unwanted/unplanned pregnancies.\n\nIn summary, I think you’re right that most people would be willing to work together on actually effective policies to reduce abortions, if that’s something they care about. At the same time, we got to where we are *in spite of* that willingness, because a fanatical minority of people who are *unwilling* were able to seize the power to make those decisions.",
              "timestamp": "2022-08-04 18:17:47",
              "score": 11,
              "num_children": 0,
              "author": 145313,
              "replies": []
            },
            {
              "id": "ij0t01n",
              "text": "I'm going to quote something I wrote a little while back.\n\n> Please note, I'm going to be talking a lot about the people driving the movements, not necessarily the people in them.  Please try and keep this in mind before taking too much offense.\n> \n> The pro forced birth movement has had nothing at all to do with being in favor of life, at least not for the last couple of decades.  It's a nice tag line, who would be opposed to life?  Who would want to murder a child?\n> \n> But the simple fact of the matter is that the politics of the movement have, again, for decades, done nothing but cause more death, pain, and misery.\n> \n> Every single time that there has been a choice between supporting measures that would actually reduce the number of abortions, or instead supporting measures that would increase the number of abortions, they have chosen to support increasing the number of abortions.\n> \n> We can look at states like Colorado that have had major successes in improving the lives of everyone involved, while drastically cutting the number of abortions.  The policies work, they make sense, they are supported by the vast majority of experts in the field.\n> \n> It's straight forward stuff, like providing accurate, comprehensive, inclusive, sex ed in schools.  Like making birth control options available to everyone, and not requiring parental approval for someone old enough to be making other choices about their body to get it.\n> \n> This also has a number of other significant benefits, like increasing reporting of sexual abuse and reducing the incidents of sexual abuse.\n> \n> But the exact same people that have been claiming to be pro life, have also taken one look at that, and decided that no, they don't want to 'condone immoral behavior'.  They say that they see abortion as murder, and yet acknowledging that teenagers have sex every day is somehow just as bad?\n> \n> Waiting for people to be on their death bed to get care, even when everyone involved knows that there is exactly zero chance of a viable child ever being produced, and that the mother is almost guaranteed to die without care, is supposed to be pro life?\n> \n> And the exact same people, when it's a matter of an airborne disease that had already killed hundreds of thousands of people in this country alone, and which went on to kill so many more, abruptly screamed 'my body, my choice' about _wearing a mask_?\n> \n> This is supposed to be pro life?\n> \n> If this was about saving lives, they would have, at _any_ point, actually done something to try and actually save some.  Instead, they have taken steps that they _knew_ would result in more deaths.\n> \n> You can argue about when a group of cells becomes a person, you can argue about at what point it is _okay_ to force someone to risk their life for someone else, you can argue about innocence, but don't call those people pro life, because they have never shown the slightest sign of wanting to keep people alive.",
              "timestamp": "2022-08-05 06:25:38",
              "score": 1,
              "num_children": 1,
              "author": 16816,
              "replies": [
                {
                  "id": "ij24thf",
                  "text": "The background is largely political and knowing it can serve an effective motivator. \n\nAgain it's not about keeping people alive, it's about the feeling of actively killing them. \n\nI think it's important to understand how people seem to think about it. \n\nTaking the action of abortion   is seen as murder.  \n\nNot supporting that person and not giving them what they need to survive is not murder to them, even if it results in death. \n\nThey may believe taking care of your self and family is your responsibility.\nObviously that is simplistic and  this is shown to be harmful to society (crime and poverty)\n\nThinking about the complexity of these things is fatiguing, and that's partly why lot of people turn to the relatively  simple answers of religion. \n\nIt's kind of like the trolley problem where people would rather take no action and let people die than actively take an action that causes someone to die(even when it saves more people). \n\nBasically from what I understand the position is basically (not my position):\n\nAbortion is an action and to them that is murder \n\nSupporting the child is the responsibility of the parent/family, not society. \n\nThis has nothing to do with those using it for political gain.",
                  "timestamp": "2022-08-05 14:39:06",
                  "score": 1,
                  "num_children": 1,
                  "author": 340507,
                  "replies": [
                    {
                      "id": "ij3fjb5",
                      "text": "This may apply to the followers, but...\n\nThe politicians driving the movement?  They have _actively_, repeatedly, taken actions that have increased the number of abortions, that have increased the number of dead mothers, and that have increased the number of dead infants.",
                      "timestamp": "2022-08-05 19:39:28",
                      "score": 1,
                      "num_children": 1,
                      "author": 16816,
                      "replies": [
                        {
                          "id": "ij3u1ib",
                          "text": "I would never argue the people using this for political gain are doing so in any food faith. Plenty of evidence to show conservative right was not against abortion until they saw it was strategically useful as a wedge issue.",
                          "timestamp": "2022-08-05 21:14:44",
                          "score": 1,
                          "num_children": 0,
                          "author": 340507,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iizh5vs",
          "text": "The fascists know they're lying.  The fascists have always known they were lying.  The contradictions are intentional, the hypocrisy is proudly performed.\n\nEvery single person who has ever imagined they \"trapped\" a fascist in one of their lies is simply a person who never got it through their goddamned skulls that the fascists say wrong things on purpose, and that every single second they kept trying to \"argue\" with that fascist was a second they were helping the fascist spread their message and destroy the very foundations of discourse.\n\nPeople need to stop letting the fascists lie to their faces.  There need to be consequences, immediate and personal, against anyone who does this to you.  These should be something like:\n\n>\"No, Dad, you can't see your grandchildren.  Why?  Because *you're a fucking fascist*.  When you stop being a fucking fascist, and when you stop lying to my face and *start* to care about truth, maybe I'll trust you with supervised visits.  Until then, I'm not letting my kids think it's OK to do or say the things you do, and YES I'm going to tell them exactly why grandpa can't come around any more.\"\n\n>\"Get your shit together.  Until then, we're not family any more. <click>\"",
          "timestamp": "2022-08-04 23:37:03",
          "score": 6,
          "num_children": 0,
          "author": 215411,
          "replies": []
        }
      ]
    },
    {
      "id": "iiwyvi7",
      "text": "If you need or are interested in supporting reproductive rights, [I made a master post of pro-choice resources](https://docdro.id/s3OwS8u). Please comment if you would like to add a resource and spread this information on whatever social media you use.",
      "timestamp": "2022-08-04 13:47:31",
      "score": 22,
      "num_children": 0,
      "author": 168329,
      "replies": []
    },
    {
      "id": "iixf6wo",
      "text": "God I wish the GOP actually fought to preserve the \"sanctity of life\" on any other issue.\n\nIf they were really proportional people just with different priorities, we wouldn't find them implementing policies that hurt or kill people and laughing it off with \"deal with it,\" while digging in their feet over an embryo smaller than a grain of rice.",
      "timestamp": "2022-08-04 15:36:55",
      "score": 14,
      "num_children": 0,
      "author": 150427,
      "replies": []
    },
    {
      "id": "iixgfoa",
      "text": "Dude of course realizes that the majority (nearly 60% in what is usually a red state) voted no, right?",
      "timestamp": "2022-08-04 15:44:50",
      "score": 9,
      "num_children": 0,
      "author": 392603,
      "replies": []
    },
    {
      "id": "iixbvjg",
      "text": "\"and many Kansans\"..um no... the vote tally says otherwise (silent majority strikes again)",
      "timestamp": "2022-08-04 15:15:31",
      "score": 10,
      "num_children": 0,
      "author": 154171,
      "replies": []
    },
    {
      "id": "iixqgoy",
      "text": "Conservatwats wanted to make it to where the state could decide to ban abortion. But they seem to not like it anymore, now that some states are starting to say yes to abortion rights and bodily autonomy. They were hoping for states to have the right to BAN bodily rights, not protect them.\n\n\"Oh no! The consequenses of my actions!\"",
      "timestamp": "2022-08-04 16:48:15",
      "score": 6,
      "num_children": 0,
      "author": 286521,
      "replies": []
    },
    {
      "id": "iiy2gl4",
      "text": "Remember, Conservatives are not about protecting life at all.\n\nThey're about making people suffer.",
      "timestamp": "2022-08-04 18:02:52",
      "score": 7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iiyc3zh",
      "text": "GOP = mean, lying, hypocrites. Thank goodness Kansans came out to vote for REAL   \n values and decency!",
      "timestamp": "2022-08-04 19:03:22",
      "score": 7,
      "num_children": 1,
      "author": 345843,
      "replies": [
        {
          "id": "ij0kgcz",
          "text": "I second that.",
          "timestamp": "2022-08-05 04:50:48",
          "score": 1,
          "num_children": 0,
          "author": 45990,
          "replies": []
        }
      ]
    },
    {
      "id": "iiwzajz",
      "text": "Many Kansans, but not most LOL Cheers to democracy",
      "timestamp": "2022-08-04 13:50:31",
      "score": 17,
      "num_children": 0,
      "author": 275984,
      "replies": []
    },
    {
      "id": "iixnl7e",
      "text": "You have to read the words he said, he doesn't care about life, only the \"sanctity\" of it",
      "timestamp": "2022-08-04 16:30:11",
      "score": 5,
      "num_children": 0,
      "author": 280825,
      "replies": []
    },
    {
      "id": "iixoehe",
      "text": "\"For Republicans, it's much the same with vets as it is with fetuses: they claim to care about you while you're in--but once you're out, you're on your own.\"",
      "timestamp": "2022-08-04 16:35:18",
      "score": 6,
      "num_children": 0,
      "author": 115910,
      "replies": []
    },
    {
      "id": "iiy1ryz",
      "text": "If words could never express, why are you typing ?\n\nThe hot air spews non-stop from these idiots....",
      "timestamp": "2022-08-04 17:58:41",
      "score": 3,
      "num_children": 0,
      "author": 37307,
      "replies": []
    },
    {
      "id": "iiy2da3",
      "text": "\"Value Them Both\" eat my entire ass, dude",
      "timestamp": "2022-08-04 18:02:19",
      "score": 2,
      "num_children": 0,
      "author": 39869,
      "replies": []
    },
    {
      "id": "iiylqa8",
      "text": "Sorry, only zygotes that can be exploited to end women's freedom count as \"life\" to these death cultists. They say they're \"Pro-life\", but that's just a lie. They'd perform every abortion any woman in the country ever wanted or needed personally in exchange for women not having the right to vote.",
      "timestamp": "2022-08-04 20:03:49",
      "score": 2,
      "num_children": 0,
      "author": 121565,
      "replies": []
    },
    {
      "id": "iizgee7",
      "text": "Remember that they say wrong things on purpose.  Remember that the hypocrisy is intentional, and proudly performed.  Remember that the cruelty is the point.",
      "timestamp": "2022-08-04 23:31:25",
      "score": 2,
      "num_children": 0,
      "author": 215411,
      "replies": []
    },
    {
      "id": "ij0dpt1",
      "text": "In the words of Dr. Marshall's favourite President regarding veterans, \"they knew what they signed up for.\"",
      "timestamp": "2022-08-05 03:47:12",
      "score": 2,
      "num_children": 0,
      "author": 138261,
      "replies": []
    },
    {
      "id": "ij0gdd9",
      "text": "No healthcare, no living wages,pollution and wars are GREAT!But we need more poors to supply the military and prisons,soo,,, PRO-LIFE!",
      "timestamp": "2022-08-05 04:11:19",
      "score": 2,
      "num_children": 0,
      "author": 121844,
      "replies": []
    },
    {
      "id": "iiyx6un",
      "text": "Probably the same dude who gets his mistress on the next flight to Denver, Chicago or San Francisco/Oakland en route to the nearest Planned Parenthood when he knocks her up.",
      "timestamp": "2022-08-04 21:19:04",
      "score": 1,
      "num_children": 0,
      "author": 42530,
      "replies": []
    },
    {
      "id": "iiz7onj",
      "text": "perhaps you should listen to the will of the people despite the fact that it opposes your beliefs and stop trying to fucking enforce your shit onto everyone",
      "timestamp": "2022-08-04 22:29:02",
      "score": 1,
      "num_children": 0,
      "author": 30102,
      "replies": []
    },
    {
      "id": "iizeh1x",
      "text": "So the minority lost to the majority because the masses didn't want what a few ppl were trying to push on everyone. The ppl spoke so shut the fuck up and stop pushing your religious backed beliefs on everyone else! Ppl have a right to choose their own paths, im a male and i believe women have a right to their own choices. Women in healthy relationships dont normally choose to get an abortion without their partners opinion when its not medically needed. Ppl are idiots. \n\nLike fuck America let me legally smoke weed. How does that bother you if i smoke weed?.",
      "timestamp": "2022-08-04 23:17:24",
      "score": 1,
      "num_children": 0,
      "author": 207866,
      "replies": []
    },
    {
      "id": "ij15ibv",
      "text": "The sanctity of forced birth is what he’s trying to preserve",
      "timestamp": "2022-08-05 09:09:37",
      "score": 1,
      "num_children": 0,
      "author": 104107,
      "replies": []
    },
    {
      "id": "ij1k1rk",
      "text": "He is currently looking the other way. It needs to be said louder.",
      "timestamp": "2022-08-05 11:59:33",
      "score": 1,
      "num_children": 0,
      "author": 311223,
      "replies": []
    },
    {
      "id": "iiww8q4",
      "text": "[removed]",
      "timestamp": "2022-08-04 13:27:55",
      "score": -31,
      "num_children": 2,
      "replies": [
        {
          "id": "iiwyas6",
          "text": "It’s not a deflection. Cohen is pointing out that Roger Marshall doesn’t give a shit about “protecting the sanctity of life.”",
          "timestamp": "2022-08-04 13:43:20",
          "score": 27,
          "num_children": 0,
          "author": 179199,
          "replies": []
        },
        {
          "id": "iiwxaov",
          "text": "How is this deflection?",
          "timestamp": "2022-08-04 13:35:52",
          "score": 19,
          "num_children": 0,
          "author": 54667,
          "replies": []
        }
      ]
    },
    {
      "id": "ij0d0h5",
      "text": "No member of the forced-birth cult has ever cared about any living thing, and none of them ever will.  That is an absolute, immutable law of the universe.",
      "timestamp": "2022-08-05 03:41:02",
      "score": 0,
      "num_children": 0,
      "author": 184569,
      "replies": []
    }
  ]
}