{
  "id": "wgb9xd",
  "text": "TIFU I thought a cute guy was ghosting me....only to find out I was actually ghosting him.\nI was at a party two weeks ago, where I only knew two people. when in walks this guy who immediately gave me this really big smile and I thought he was so gorgeous. We ended up talking in the same circle and he introduces himself. We start chatting and quickly find the circle around us has disappeared and it is just us. \n\nHe is so smart, his smile is outrageously cute, and I love how he seems laser focused on me instead of one of the many attractive women that have now joined the party and are talking about their cool Raya dates. \n\nAs the night wore on, I found myself talking to various different groups, but, each time this guy would appear again and we'd end up just talking to each other again. Someone who neither of us knew came up and said we made an attractive couple, and I realized somehow in the span of two hours we were already acting like a couple. It wasn't just being sexually attracted to him, I felt so comfortable around him and he was so attentive to my needs. \n\nI told him offhand I had allergies to the dog at the party. Hours later when I started sneezing he immediately knew why and moved us outside. His smile was the thing that immediately caught my attention but it was the thoughtfulness that made it so at the end of the night, we catch an Uber home together and end up kissing. Before the Uber drops him off I give him my number. \n\nSunday comes, don't hear from him. Ok, ok, I get it, we both got home at 4am and I too just want to sleep the day away. \n\nMonday comes. Silence. \n\nTuesday, even more silence. I know I've read how it is \"uncool\" to text a girl immediately because you want to seem super cool and wanted, but we're both in our mid-thirties and, I hoped, realized these mind games are bullshit. If you like someone, text them when you can. Life is too short to be with people half-interested in you. \n\nWednesday comes and I'm a mixture of angry and over it and insecure all at the same time. How dare he lead me on like this! ...Well, I guess I'm glad I only wasted one night on this asshole....was I not pretty enough? All these thoughts raced through my head and coalesced into me typing his name and work place into Google to see if I can find him. \n\nTurns out, he was incredibly easy to find. I was planning on just looking at him because I missed his face, but I accidentally clicked the link that brought me to his LinkedIn page. Yikes! Now he'll know that I stalked him which made me feel even worse. >.< I probably looked crazy. \n\nWelp, since I was already on his page I guess I'd look at where he had worked. Maybe he wasn't really interesting and I'd feel better about him ghosting me. \n\nNope, turns out he is not only very smart but also humble because his resume listed a dozen different cool jobs, impressive schools he's attended, things he's worked on. Great, I probably wasn't impressive enough for him. -_- \n\nNot thirty minutes later he friends me on LinkedIn, but seems surprised that I was reaching out. He had evidently texted me that night, and again the next day, only to not hear anything back. I had ghosted him. \n\nAnd this is how we found out my fuck up. When I gave him my number, turns out I was off by a digit. Turns out, tipsy me isn't so great at typing or proofreading. \n\nIf I hadn't been a creepy LinkedIn stalker, it could have been months, if ever, before we would have seen each other again. Right now we're laughing about it and setting up our first real date. Wish me luck Reddit!\n\nTL;DR Thought a cute guy was ghosting me. Turns out, I gave him the wrong number. Fixed my fuck up by using my cyber stalking skills, and now we're going on a date!",
  "timestamp": "2022-08-04 20:26:42",
  "score": 34694,
  "subreddit": "t5_2to41",
  "num_children": 330,
  "author": 85543,
  "replies": [
    {
      "id": "iiyxx9d",
      "text": "Can’t believe sliding into someone’s linkedin DMs actually worked",
      "timestamp": "2022-08-04 21:23:49",
      "score": 14284,
      "num_children": 30,
      "author": 3191,
      "replies": [
        {
          "id": "iizeork",
          "text": "That's why I include skills like listening, back rubs, and long walks on the beach in my LinkedIn profile",
          "timestamp": "2022-08-04 23:18:57",
          "score": 5004,
          "num_children": 11,
          "author": 59262,
          "replies": [
            {
              "id": "iizhc4e",
              "text": "I know you're being sarcastic, but you'd be surprised how often stuff like that pops up on r/LinkedInLunatics",
              "timestamp": "2022-08-04 23:38:21",
              "score": 1320,
              "num_children": 10,
              "author": 68627,
              "replies": [
                {
                  "id": "iizmcuh",
                  "text": "The stuff there is amazingly cringey. Agree?",
                  "timestamp": "2022-08-05 00:15:29",
                  "score": 340,
                  "num_children": 5,
                  "author": 108749,
                  "replies": [
                    {
                      "id": "iiznvnr",
                      "text": "Here I go.",
                      "timestamp": "2022-08-05 00:26:50",
                      "score": 216,
                      "num_children": 2,
                      "author": 62863,
                      "replies": [
                        {
                          "id": "ij0cypi",
                          "text": "It's been 3 hours. OP got murdered.",
                          "timestamp": "2022-08-05 03:40:36",
                          "score": 89,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ij0ihcz",
                              "text": "It got so bad I had to quit reddit for a while.",
                              "timestamp": "2022-08-05 04:31:15",
                              "score": 61,
                              "num_children": 2,
                              "author": 62863,
                              "replies": [
                                {
                                  "id": "ij24c32",
                                  "text": "I hope you got back to the #Grind and focused on building your #GrowthMindset. Wake up at 5am. Eat a raw egg. Workout. Meditate. Then jump back into Reddit to hustle #Hustle hustle. Sleep at 3am and start again! Never stop growing! \n\n<Random selfie of me sitting in front of an unstarted zoom meeting at home at night>",
                                  "timestamp": "2022-08-05 14:35:50",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 108749,
                                  "replies": [
                                    {
                                      "id": "ik886n4",
                                      "text": "Yes I started a great  new routine . Wake up shower , get dressed n find a random and have nasty sex with! Give a few work on me then do it all over! Great workout",
                                      "timestamp": "2022-08-14 07:31:29",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 391723,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "ij118zc",
                                  "text": "Poor OP. Sometimes I feel like I can still hear his voice. 😔",
                                  "timestamp": "2022-08-05 08:12:00",
                                  "score": 23,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ij03768",
                          "text": "Scream my lungs out",
                          "timestamp": "2022-08-05 02:21:02",
                          "score": 43,
                          "num_children": 1,
                          "author": 276425,
                          "replies": [
                            {
                              "id": "ij0dows",
                              "text": "To try to get to you",
                              "timestamp": "2022-08-05 03:46:59",
                              "score": 24,
                              "num_children": 1,
                              "author": 41960,
                              "replies": [
                                {
                                  "id": "ij0evdv",
                                  "text": "You are my only one",
                                  "timestamp": "2022-08-05 03:57:41",
                                  "score": 20,
                                  "num_children": 2,
                                  "author": 197653,
                                  "replies": [
                                    {
                                      "id": "ij0hemc",
                                      "text": "r/redditsings",
                                      "timestamp": "2022-08-05 04:20:59",
                                      "score": 7,
                                      "num_children": 0,
                                      "author": 211050,
                                      "replies": []
                                    },
                                    {
                                      "id": "ij12k04",
                                      "text": "I let goooooo",
                                      "timestamp": "2022-08-05 08:29:25",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 292438,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ij08rm2",
                      "text": "\"Thoughts?\"",
                      "timestamp": "2022-08-05 03:04:54",
                      "score": 9,
                      "num_children": 0,
                      "author": 26204,
                      "replies": []
                    },
                    {
                      "id": "ij0l7m5",
                      "text": "Ok I just went down the rabbit hole for about 20 minutes.  Yeah, a lot of it is cringey but what I find way more cringey is a group dedicated to shitting all over others that are just living their lives and expressing themselves regardless of how cringey others might find it.  Half the posts I read I'm like *yeah...and?*...I just don't see the big deal.",
                      "timestamp": "2022-08-05 04:58:39",
                      "score": 23,
                      "num_children": 1,
                      "author": 260750,
                      "replies": [
                        {
                          "id": "ij0mu0p",
                          "text": "There are a few different types in my opinion. You have the clearly absurd ones totally unaware of what they're saying (e.g. life is easy just get a 10m loan from your parents), the attention seekers (e.g. \"work is hard\" and a random picture of them in a bikini on a beach), the corporate shills (e.g. the #hustle culture crap), and the influencers (e.g. \"Thoughts?\", \"Agree?\" At the end of the post trying to get engagement for the algorithm to spread their crap).\n\nPersonally, I think most of them are toxic. LinkedIn started as a professional networking site and you have people acting very unprofessionally, and/or advocate for unhealthy work/life balance, or just outright posting opinions that don't belong in your workplace (e.g. politics). And to make it worse it's all under the thin veneer of \"business speak\". \n\nLike, I don't know, if you don't see the appeal maybe you're not the target audience. Or maybe you can post about the #Hustle and #Struggle on LinkedIn after you find #Success. Thoughts?",
                          "timestamp": "2022-08-05 05:15:46",
                          "score": 28,
                          "num_children": 2,
                          "author": 108749,
                          "replies": [
                            {
                              "id": "ij0ne3p",
                              "text": "ok yeah, I get it...your examples are pretty gross but I'm kinda like why even waste time basking in how cringey all these people are?",
                              "timestamp": "2022-08-05 05:21:46",
                              "score": 9,
                              "num_children": 1,
                              "author": 260750,
                              "replies": [
                                {
                                  "id": "ij1anva",
                                  "text": "Because I like to laugh at shit, it’s not time wasted if I’m amused",
                                  "timestamp": "2022-08-05 10:17:50",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 233718,
                                  "replies": [
                                    {
                                      "id": "ij1p9lz",
                                      "text": "I think the point here is it's not dissimilar to rooting through a turd for an undigested kernel of corn.",
                                      "timestamp": "2022-08-05 12:45:33",
                                      "score": 3,
                                      "num_children": 3,
                                      "author": 354745,
                                      "replies": [
                                        {
                                          "id": "ij2c3xw",
                                          "text": "Honestly that probably describes 95% of Reddit...",
                                          "timestamp": "2022-08-05 15:27:04",
                                          "score": 4,
                                          "num_children": 1,
                                          "author": 65920,
                                          "replies": [
                                            {
                                              "id": "ij4ir6x",
                                              "text": "The desire to be mature is still a childish ambi-oh shit, wrong thread",
                                              "timestamp": "2022-08-06 00:16:33",
                                              "score": 2,
                                              "num_children": 0,
                                              "author": 354745,
                                              "replies": []
                                            }
                                          ]
                                        },
                                        {
                                          "id": "ij1s0wt",
                                          "text": "It’s what you make it. Are there mad folk on LinkedIn? For sure. Do they post some unhinged shit? Definitely. Is it funny? Mostly, yeah. \n\nIt doesn’t really have to be be deeper than that. You don’t have to look very hard to see the mad shit. I have to have it for work; it’s baffling and strange and I’d never choose to have it myself, but at least it’s amusing.",
                                          "timestamp": "2022-08-05 13:07:35",
                                          "score": 3,
                                          "num_children": 0,
                                          "author": 233718,
                                          "replies": []
                                        },
                                        {
                                          "id": "ij2mof6",
                                          "text": "You're on a subreddit where people are rooting through their own shit and *sharing* the corn. \n\nYou just gotta figure out which way you'd prefer it presented to you is all. Do you wanna see how it's made? Or do you want the pretty plated product?",
                                          "timestamp": "2022-08-05 16:34:53",
                                          "score": 3,
                                          "num_children": 1,
                                          "author": 57528,
                                          "replies": [
                                            {
                                              "id": "ij4ivba",
                                              "text": "I guess we never stopped to ask wherevthe popcorn we ate came from",
                                              "timestamp": "2022-08-06 00:17:26",
                                              "score": 3,
                                              "num_children": 0,
                                              "author": 354745,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "ik88c51",
                              "text": "Totally AWARE AND THERE LIVES SEEM TO BE APART OF MINE AND THEY SEEM TO B BLASTING IT ON THE MOUNTAINS FOR HELLS. SAKE",
                              "timestamp": "2022-08-14 07:33:28",
                              "score": 1,
                              "num_children": 0,
                              "author": 391723,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ij3blqn",
                      "text": "This comment kinda makes me wanna look now🤣🤣",
                      "timestamp": "2022-08-05 19:14:03",
                      "score": 2,
                      "num_children": 0,
                      "author": 314226,
                      "replies": []
                    },
                    {
                      "id": "ij0al42",
                      "text": "I love the collective acknowledgement that when there's a link on Reddit, people will click it. I am one of those people.",
                      "timestamp": "2022-08-05 03:20:19",
                      "score": 1,
                      "num_children": 0,
                      "author": 273045,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ij00p0k",
                  "text": "I’m retired for 4 years now and I might create a LinkedIn profile with these characteristics just for funsies.",
                  "timestamp": "2022-08-05 02:02:05",
                  "score": 35,
                  "num_children": 1,
                  "author": 404741,
                  "replies": [
                    {
                      "id": "ij0rrku",
                      "text": "Author | Speaker | Futurist | Though Leader",
                      "timestamp": "2022-08-05 06:11:05",
                      "score": 12,
                      "num_children": 1,
                      "author": 227034,
                      "replies": [
                        {
                          "id": "ij3ip42",
                          "text": "| Influenzer",
                          "timestamp": "2022-08-05 19:59:48",
                          "score": 2,
                          "num_children": 0,
                          "author": 360880,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iizkqbd",
                  "text": "Ooh new sub!",
                  "timestamp": "2022-08-05 00:03:25",
                  "score": 70,
                  "num_children": 0,
                  "author": 218037,
                  "replies": []
                },
                {
                  "id": "iizuzsq",
                  "text": "And I just found the subreddit that is going to tell me everything I need to put on my profile.",
                  "timestamp": "2022-08-05 01:19:54",
                  "score": 20,
                  "num_children": 0,
                  "author": 356247,
                  "replies": []
                },
                {
                  "id": "ij080rp",
                  "text": "A subreddit I never knew I needed exists. LOL",
                  "timestamp": "2022-08-05 02:58:45",
                  "score": 6,
                  "num_children": 0,
                  "author": 71872,
                  "replies": []
                },
                {
                  "id": "ij08flb",
                  "text": "Oh my gosh, thank you for this! I was unaware this was a thing! You know that weird math problem thing about porn and if you google something anything there is a porn about it? There's totally a reddit about it.",
                  "timestamp": "2022-08-05 03:02:06",
                  "score": 4,
                  "num_children": 1,
                  "author": 8941,
                  "replies": [
                    {
                      "id": "ij2ylz6",
                      "text": "Rule 34: If it exists, there is porn of it. No exceptions.\n\nYou're referring to the rules of the internet:\n\n[https://tvtropes.org/pmwiki/pmwiki.php/Main/RulesOfTheInternet#:\\~:text=Shout-Out%3A%20Many%20rules%20of%20the%20internet%20are%20references%2C,states%20%22nothing%20is%20sacred%22.%20It%27s%20effectively%20an%20anti-shoutout](https://tvtropes.org/pmwiki/pmwiki.php/Main/RulesOfTheInternet#:~:text=Shout-Out%3A%20Many%20rules%20of%20the%20internet%20are%20references%2C,states%20%22nothing%20is%20sacred%22.%20It%27s%20effectively%20an%20anti-shoutout).",
                      "timestamp": "2022-08-05 17:50:43",
                      "score": 1,
                      "num_children": 0,
                      "author": 411421,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iizwly1",
                  "text": "My mum is an HR mananger and she tells me all the time about people being per erts or just straight up hitting on her via Linkin.\n\nIt is not that type of so isl media site guys!!!",
                  "timestamp": "2022-08-05 01:31:54",
                  "score": 6,
                  "num_children": 0,
                  "author": 153068,
                  "replies": []
                },
                {
                  "id": "ij0a8k9",
                  "text": "Thx for linking that sub Its some quality content.",
                  "timestamp": "2022-08-05 03:17:22",
                  "score": 2,
                  "num_children": 0,
                  "author": 392950,
                  "replies": []
                },
                {
                  "id": "ij0kkri",
                  "text": "Thank you for the new sub!",
                  "timestamp": "2022-08-05 04:52:03",
                  "score": 2,
                  "num_children": 0,
                  "author": 308230,
                  "replies": []
                },
                {
                  "id": "ij1dpo5",
                  "text": "Oh you wonderful person. Thank you for opening up my mind to a completely new world of degeneracy!",
                  "timestamp": "2022-08-05 10:54:23",
                  "score": 2,
                  "num_children": 0,
                  "author": 147414,
                  "replies": []
                }
              ]
            },
            {
              "id": "iizhcvm",
              "text": "Downsides: a lot of recruiters offering you low paid lifeguard jobs?",
              "timestamp": "2022-08-04 23:38:30",
              "score": 33,
              "num_children": 1,
              "author": 291179,
              "replies": [
                {
                  "id": "ij0i215",
                  "text": "Three states away...",
                  "timestamp": "2022-08-05 04:27:07",
                  "score": 8,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "iizhqgi",
              "text": "Throw holding hands in there.",
              "timestamp": "2022-08-04 23:41:16",
              "score": 7,
              "num_children": 0,
              "author": 183241,
              "replies": []
            },
            {
              "id": "iizt0c9",
              "text": "Username checks out",
              "timestamp": "2022-08-05 01:05:08",
              "score": 1,
              "num_children": 0,
              "author": 284881,
              "replies": []
            },
            {
              "id": "iizwgtd",
              "text": "Yeah, I have listening and cunnilingus on mine.",
              "timestamp": "2022-08-05 01:30:50",
              "score": 1,
              "num_children": 0,
              "author": 66249,
              "replies": []
            },
            {
              "id": "ij06xv0",
              "text": "Don’t forget in include a profile pic of a monster condom, which you use for your magnum dong.",
              "timestamp": "2022-08-05 02:50:05",
              "score": 1,
              "num_children": 1,
              "author": 207872,
              "replies": [
                {
                  "id": "ik88gft",
                  "text": "Long and hits the spot every time but diameter can use a pump or two",
                  "timestamp": "2022-08-14 07:34:57",
                  "score": 1,
                  "num_children": 0,
                  "author": 391723,
                  "replies": []
                }
              ]
            },
            {
              "id": "ij0tqrj",
              "text": "Ah I spilt my drink laughing bro nice",
              "timestamp": "2022-08-05 06:34:43",
              "score": 1,
              "num_children": 0,
              "author": 397205,
              "replies": []
            },
            {
              "id": "ij0voq1",
              "text": "Would you like to endorse your coworker for his skills at: Fellatio ?",
              "timestamp": "2022-08-05 06:59:10",
              "score": 1,
              "num_children": 0,
              "author": 395418,
              "replies": []
            },
            {
              "id": "ij147m9",
              "text": "Don't forget backrubs without the implication of sex after.",
              "timestamp": "2022-08-05 08:51:52",
              "score": 1,
              "num_children": 0,
              "author": 291151,
              "replies": []
            },
            {
              "id": "ij38zcv",
              "text": "Should read: Long stalks on LinkedIn",
              "timestamp": "2022-08-05 18:57:09",
              "score": 1,
              "num_children": 0,
              "author": 6168,
              "replies": []
            },
            {
              "id": "imsmqke",
              "text": "30 year olds never cease to amaze me",
              "timestamp": "2022-09-02 13:36:11",
              "score": 1,
              "num_children": 0,
              "author": 332163,
              "replies": []
            }
          ]
        },
        {
          "id": "iizv0o0",
          "text": "This might be the first time head hunting has actually worked.",
          "timestamp": "2022-08-05 01:20:04",
          "score": 68,
          "num_children": 1,
          "author": 57136,
          "replies": [
            {
              "id": "ij00xjv",
              "text": "I see what you did there.",
              "timestamp": "2022-08-05 02:03:50",
              "score": 18,
              "num_children": 0,
              "author": 33452,
              "replies": []
            }
          ]
        },
        {
          "id": "iizjuou",
          "text": "She meant business, when it came to the guy.",
          "timestamp": "2022-08-04 23:56:51",
          "score": 30,
          "num_children": 1,
          "author": 183241,
          "replies": [
            {
              "id": "iizrxog",
              "text": "This",
              "timestamp": "2022-08-05 00:57:16",
              "score": -1,
              "num_children": 0,
              "author": 399398,
              "replies": []
            }
          ]
        },
        {
          "id": "iizn6dm",
          "text": "I asked my husband out on his LinkedIn lol",
          "timestamp": "2022-08-05 00:21:35",
          "score": 26,
          "num_children": 4,
          "author": 300009,
          "replies": [
            {
              "id": "ij081ce",
              "text": "I once asked a girl out by fax to her office. And she faxed back “no”.",
              "timestamp": "2022-08-05 02:58:53",
              "score": 57,
              "num_children": 2,
              "author": 367814,
              "replies": [
                {
                  "id": "ij14kir",
                  "text": "When was this? ‘93?",
                  "timestamp": "2022-08-05 08:56:52",
                  "score": 4,
                  "num_children": 1,
                  "author": 249793,
                  "replies": [
                    {
                      "id": "ij1e3l7",
                      "text": "‘95!",
                      "timestamp": "2022-08-05 10:58:49",
                      "score": 7,
                      "num_children": 0,
                      "author": 367814,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ij0hhi4",
                  "text": "Damn! At least she took the time to answer?",
                  "timestamp": "2022-08-05 04:21:41",
                  "score": 26,
                  "num_children": 1,
                  "author": 14662,
                  "replies": [
                    {
                      "id": "ij13vic",
                      "text": "Or their coworker at least.",
                      "timestamp": "2022-08-05 08:47:18",
                      "score": 2,
                      "num_children": 1,
                      "author": 39709,
                      "replies": [
                        {
                          "id": "ij2oo6n",
                          "text": "Oh… that makes me sad. Definitely something I would do for a coworker, it would drive me crazy thinking about some guy sitting by the fax machine waiting for a reply.",
                          "timestamp": "2022-08-05 16:47:36",
                          "score": 1,
                          "num_children": 0,
                          "author": 14662,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ij09qle",
              "text": "My friend asked his current gf of a couple years out on LinkedIn as well, lol",
              "timestamp": "2022-08-05 03:13:07",
              "score": 5,
              "num_children": 0,
              "author": 147805,
              "replies": []
            },
            {
              "id": "ij1l55k",
              "text": "This is apparently not that uncommon, I know a few people who met on LinkedIn. A friend of mine met his wife on LinkedIn as well while he was scouting for clients for potential clients.",
              "timestamp": "2022-08-05 12:09:37",
              "score": 2,
              "num_children": 0,
              "author": 393270,
              "replies": []
            },
            {
              "id": "ij0yvgb",
              "text": "It's different if you're a girl.",
              "timestamp": "2022-08-05 07:40:23",
              "score": 1,
              "num_children": 0,
              "author": 113929,
              "replies": []
            }
          ]
        },
        {
          "id": "iizx1j5",
          "text": "I once found a purse with a phone and wallet still in it, along a bike path. They person had a business card  that matched the driver’s license, so I knew where they worked. I was able to connect on LinkedIn and arrange to get it back to them a few days later.",
          "timestamp": "2022-08-05 01:35:08",
          "score": 21,
          "num_children": 3,
          "author": 37898,
          "replies": [
            {
              "id": "ij0k2fr",
              "text": "I found a wallet with ID in it and found the guy on LinkedIn. Reached out to him and thanked me profusely for returning the wallet bc it had a letter his grandfather wrote him right before he died :/",
              "timestamp": "2022-08-05 04:46:54",
              "score": 18,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ij1ln3z",
              "text": "I once lost my wallet, with cash and IDs and bank cards. A couple of weeks later, it showed up in my mail box. No note, return address or any other means of contacting the good Samaritan who was kind enough to mail it back to me intact. I truly hope the universe paid them back ten-fold",
              "timestamp": "2022-08-05 12:14:10",
              "score": 2,
              "num_children": 0,
              "author": 393270,
              "replies": []
            },
            {
              "id": "ij10hjp",
              "text": "Stalker",
              "timestamp": "2022-08-05 08:01:49",
              "score": 0,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "iizedy4",
          "text": "It helps if you're a girl and you've already met in person and had some kind of chemistry .",
          "timestamp": "2022-08-04 23:16:46",
          "score": 145,
          "num_children": 3,
          "author": 401597,
          "replies": [
            {
              "id": "ij0llij",
              "text": ">It helps if you're a girl \n\nAfter reading your comment I reread the post but imagining it as a guy. It reminded me of something I'd read on a niceguy or neckbeard subreddit. \n\nI originally thought it was a cute story but now I don't lol. I think people are thinking it's a nice story because the end justified the means.",
              "timestamp": "2022-08-05 05:02:38",
              "score": 10,
              "num_children": 1,
              "author": 406526,
              "replies": [
                {
                  "id": "ik88m3t",
                  "text": "And girls with penises",
                  "timestamp": "2022-08-14 07:37:00",
                  "score": 1,
                  "num_children": 0,
                  "author": 391723,
                  "replies": []
                }
              ]
            },
            {
              "id": "ij05cou",
              "text": "And already French kissed and LARPed Titanic all in the span of a dinner party",
              "timestamp": "2022-08-05 02:37:37",
              "score": 23,
              "num_children": 0,
              "author": 32973,
              "replies": []
            },
            {
              "id": "ij020qa",
              "text": "The first one doesn’t help. Tinder has the nerds chasing the hot girls, but on LinkedIn it’s the other way around. Stop throwing job offers at me, the fact that you’re pretty doesn’t make me want to work minimum wage.",
              "timestamp": "2022-08-05 02:12:05",
              "score": 75,
              "num_children": 3,
              "author": 184115,
              "replies": [
                {
                  "id": "ij0li4g",
                  "text": "Lmao this right here",
                  "timestamp": "2022-08-05 05:01:40",
                  "score": 2,
                  "num_children": 0,
                  "author": 406660,
                  "replies": []
                },
                {
                  "id": "ij09mlj",
                  "text": "Fucking mood",
                  "timestamp": "2022-08-05 03:12:10",
                  "score": 26,
                  "num_children": 0,
                  "author": 399,
                  "replies": []
                },
                {
                  "id": "ij14gtl",
                  "text": "Bonuses and perks of the job, might even get a raise.",
                  "timestamp": "2022-08-05 08:55:25",
                  "score": 1,
                  "num_children": 0,
                  "author": 369710,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iizqteq",
          "text": "Lol I wouldn't see it for months.",
          "timestamp": "2022-08-05 00:48:54",
          "score": 16,
          "num_children": 0,
          "author": 213886,
          "replies": []
        },
        {
          "id": "iizws8n",
          "text": "I’ve had just as much action from LinkedIn dms as tinder and bumble combined.",
          "timestamp": "2022-08-05 01:33:13",
          "score": 7,
          "num_children": 1,
          "author": 51195,
          "replies": [
            {
              "id": "ij12cd1",
              "text": "Soo.. none?",
              "timestamp": "2022-08-05 08:26:31",
              "score": 4,
              "num_children": 1,
              "author": 309590,
              "replies": [
                {
                  "id": "ij1ixof",
                  "text": "Hold on. Let me calculate the ratio. \n\nHmm, calculator just keeps showing NaN.",
                  "timestamp": "2022-08-05 11:48:53",
                  "score": 2,
                  "num_children": 0,
                  "author": 51195,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iizvn9e",
          "text": "[deleted]",
          "timestamp": "2022-08-05 01:24:41",
          "score": 29,
          "num_children": 1,
          "replies": [
            {
              "id": "ij10key",
              "text": "When I smile it just looks creepy",
              "timestamp": "2022-08-05 08:02:52",
              "score": 2,
              "num_children": 0,
              "replies": []
            }
          ]
        },
        {
          "id": "iizj8rk",
          "text": "[deleted]",
          "timestamp": "2022-08-04 23:52:18",
          "score": 38,
          "num_children": 6,
          "replies": [
            {
              "id": "iizk274",
              "text": "It's a premium feature. You can see a list of people that view you.",
              "timestamp": "2022-08-04 23:58:25",
              "score": 114,
              "num_children": 2,
              "author": 220453,
              "replies": [
                {
                  "id": "ij0lm9d",
                  "text": "The notifications are a free feature, using anon mode is premium",
                  "timestamp": "2022-08-05 05:02:51",
                  "score": 31,
                  "num_children": 0,
                  "author": 406660,
                  "replies": []
                },
                {
                  "id": "ij0miwl",
                  "text": "That's so creepy",
                  "timestamp": "2022-08-05 05:12:23",
                  "score": -8,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "ij0uhb2",
                      "text": "It's a job recruitment site primarily, you would want to know who is checking your profile.",
                      "timestamp": "2022-08-05 06:43:54",
                      "score": 15,
                      "num_children": 1,
                      "author": 372610,
                      "replies": [
                        {
                          "id": "ij19gjb",
                          "text": "if they want something they would contact you. bothering someone because they looked at your profile is creepy i don't give a shit",
                          "timestamp": "2022-08-05 10:02:25",
                          "score": -3,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ij0usnh",
                      "text": "Not really. Why should you be free to stalk somebody's profile on a job recruitment site",
                      "timestamp": "2022-08-05 06:47:55",
                      "score": 4,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iizk2ph",
              "text": "Yep that sends out a notification. \n\nYou can turn on \"private mode\" or something, but that works two ways - it won't tell who's viewing your profile, and it won't alert others if you've viewed their profile.\n\nOf course, like real life, you can bypass all this by paying money.",
              "timestamp": "2022-08-04 23:58:32",
              "score": 28,
              "num_children": 0,
              "author": 183241,
              "replies": []
            },
            {
              "id": "iizlbbn",
              "text": "The other comments are half right. With premium, you can browse privately but still see who looks at your profile. Otherwise, it shows you what you show others. If your views alert the people you look at, you get alert when people look at your profile (as long as their setting allows) Kind of confusing, but you must have it on private, so nothing to worry about.\n\nPro tip: Keep it on public, but switch to private when you're \"stalking someone\", then switch back after. Best of both worlds.",
              "timestamp": "2022-08-05 00:07:46",
              "score": 23,
              "num_children": 0,
              "author": 67448,
              "replies": []
            },
            {
              "id": "iizke4r",
              "text": "If you have LinkedIn premium, you get a notification when your profile is viewed and who viewed it unless they are viewing it in \"anonymous\" mode.",
              "timestamp": "2022-08-05 00:00:53",
              "score": 49,
              "num_children": 3,
              "author": 263919,
              "replies": [
                {
                  "id": "iizz25x",
                  "text": "This wasnt even a premium feature before",
                  "timestamp": "2022-08-05 01:49:51",
                  "score": 19,
                  "num_children": 1,
                  "author": 388956,
                  "replies": [
                    {
                      "id": "ij019nv",
                      "text": "You still get a summary notification on non-premium, and it will SOMETIMES show who viewed your profile, but usually it just tells you what field or company the viewer works in, rather than who they are specifically.",
                      "timestamp": "2022-08-05 02:06:22",
                      "score": 24,
                      "num_children": 1,
                      "author": 263919,
                      "replies": [
                        {
                          "id": "ij0513m",
                          "text": "That depends on the viewer's profile settings. If they're set to private it won't show their name but they also can't see who viewed their profile. If it's public it will show their name and they can also see who viewed their profile.",
                          "timestamp": "2022-08-05 02:35:08",
                          "score": 10,
                          "num_children": 0,
                          "author": 21094,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ij0u23f",
                  "text": "But how would that work if I don't even have an account on LinkedIn?",
                  "timestamp": "2022-08-05 06:38:38",
                  "score": 1,
                  "num_children": 1,
                  "author": 36866,
                  "replies": [
                    {
                      "id": "ij0whdk",
                      "text": "Lot of times, it requires you to make an account to view the person’s profile.",
                      "timestamp": "2022-08-05 07:09:16",
                      "score": 3,
                      "num_children": 0,
                      "author": 99232,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ij1hq95",
                  "text": "I didn't think anyone outside of IT used LinkedIn.  Even worse people are paying money for a premium version? Lol",
                  "timestamp": "2022-08-05 11:37:02",
                  "score": 1,
                  "num_children": 0,
                  "author": 257937,
                  "replies": []
                }
              ]
            },
            {
              "id": "iizz092",
              "text": "It works like that. I freaked out when I visited this ex co-worker profile and he suddenly shared to everyone we're working with how I visited his profile. (He had a crush on me lol)",
              "timestamp": "2022-08-05 01:49:28",
              "score": 2,
              "num_children": 0,
              "author": 388956,
              "replies": []
            },
            {
              "id": "ij1acfi",
              "text": "You can see who look at your profile when you’re premium, similar to Facebook telling you here is a new friend suggestion when that person actually looked at your profile.",
              "timestamp": "2022-08-05 10:13:46",
              "score": 1,
              "num_children": 0,
              "author": 407108,
              "replies": []
            }
          ]
        },
        {
          "id": "ij08qgv",
          "text": "Ask my now wife. We knew each other for 10 years, stopped talking for 3, I quit Facebook, she changed cell phones. I was in a relationship and she LinkedIn messaged me. It was all over from there.",
          "timestamp": "2022-08-05 03:04:38",
          "score": 4,
          "num_children": 0,
          "author": 24987,
          "replies": []
        },
        {
          "id": "iizzwpo",
          "text": "Worked for me once too. Met a guy in a casino, he was there for a work conference. We had a great night hanging out. Didn’t exchange numbers. Found him on linked in through his company page knowing his first name and we were able to connect.",
          "timestamp": "2022-08-05 01:56:16",
          "score": 2,
          "num_children": 0,
          "author": 16649,
          "replies": []
        },
        {
          "id": "iizo5m6",
          "text": "This would be deemed creepy as hell if the genders were swapped.",
          "timestamp": "2022-08-05 00:28:53",
          "score": -2,
          "num_children": 3,
          "author": 74937,
          "replies": [
            {
              "id": "iizt0vh",
              "text": "Would it though? The one being \"stalked\" sent the friend request. It was clearly a mutual thing.",
              "timestamp": "2022-08-05 01:05:15",
              "score": 33,
              "num_children": 0,
              "author": 311363,
              "replies": []
            },
            {
              "id": "ij007r0",
              "text": "Le Redditor: How can I make men the victim in this heartfelt story 🤔",
              "timestamp": "2022-08-05 01:58:32",
              "score": 20,
              "num_children": 2,
              "author": 42624,
              "replies": [
                {
                  "id": "ij0z1dp",
                  "text": "By making sure people who are gushing over it realize that this story is only \"wholesome\" when it's told one way. It would not be \"wholesome\" if the genders were flipped and we all know that.",
                  "timestamp": "2022-08-05 07:42:32",
                  "score": 3,
                  "num_children": 0,
                  "author": 202637,
                  "replies": []
                },
                {
                  "id": "ij0kknp",
                  "text": "I mean, it's more just acknowledging perceived creepiness, no?",
                  "timestamp": "2022-08-05 04:52:01",
                  "score": 1,
                  "num_children": 0,
                  "author": 54555,
                  "replies": []
                }
              ]
            },
            {
              "id": "iizyfod",
              "text": "Exactly. If he was weirded out by her looking him up and decided not meet up.\n\n“It’s ok we know you didn’t mean harm you had reason to try”\n\nGuy does it and girl decides no.\n\n“You should have known better she probably thought you were a stalker”. Women have to look out for weirdos 🤡",
              "timestamp": "2022-08-05 01:45:15",
              "score": -8,
              "num_children": 0,
              "author": 346795,
              "replies": []
            }
          ]
        },
        {
          "id": "ij0kavf",
          "text": "If a guy did this, the cops would be at his door.",
          "timestamp": "2022-08-05 04:49:16",
          "score": 1,
          "num_children": 0,
          "author": 335817,
          "replies": []
        },
        {
          "id": "iizz03w",
          "text": "This is my favorite kind of FU. Rooting for you two!",
          "timestamp": "2022-08-05 01:49:26",
          "score": 1,
          "num_children": 0,
          "author": 345465,
          "replies": []
        },
        {
          "id": "ij0flrj",
          "text": "Fucking really... I have a decently impressive job history and a resume made by professional writers I have a decade of experience and I get no bites off linked in. I've direct messaged and have premium. I still have no jobs!!!",
          "timestamp": "2022-08-05 04:04:20",
          "score": 1,
          "num_children": 1,
          "author": 229637,
          "replies": [
            {
              "id": "ij1ddo7",
              "text": "I can't remember ever actually making a LinkedIn account and haven't ever logged on to it but I keep getting these bloody emails from recruiters telling me they found my CV on LinkedIn.",
              "timestamp": "2022-08-05 10:50:33",
              "score": 2,
              "num_children": 0,
              "author": 225642,
              "replies": []
            }
          ]
        },
        {
          "id": "ij0fza9",
          "text": "You know what they say. Step 1 be attractive.",
          "timestamp": "2022-08-05 04:07:43",
          "score": 1,
          "num_children": 0,
          "author": 238170,
          "replies": []
        },
        {
          "id": "ij0g0na",
          "text": "Plot twist: she’s a LinkedIn recruiter and they’re setting up a job interview without discussing salary ranges.",
          "timestamp": "2022-08-05 04:08:04",
          "score": 1,
          "num_children": 0,
          "author": 298114,
          "replies": []
        },
        {
          "id": "ij0n1ku",
          "text": "I'm a guy and an old acquaintance did to me when she was back in town for a few months. She had to say what was up very explicitly because I thought she just wanted to say hi",
          "timestamp": "2022-08-05 05:18:04",
          "score": 1,
          "num_children": 0,
          "author": 170104,
          "replies": []
        },
        {
          "id": "ij0o2nu",
          "text": "'how to date in your thirties, apparently'",
          "timestamp": "2022-08-05 05:29:19",
          "score": 1,
          "num_children": 0,
          "author": 56563,
          "replies": []
        },
        {
          "id": "ij0sbdt",
          "text": "Please don’t give that company any dumber marketing ideas.",
          "timestamp": "2022-08-05 06:17:36",
          "score": 1,
          "num_children": 0,
          "author": 317952,
          "replies": []
        },
        {
          "id": "ij12hsn",
          "text": "Professional Deal maker",
          "timestamp": "2022-08-05 08:28:36",
          "score": 1,
          "num_children": 0,
          "author": 239540,
          "replies": []
        },
        {
          "id": "ij12w8p",
          "text": "What, that's crazy. People use LinkedIn?",
          "timestamp": "2022-08-05 08:34:04",
          "score": 1,
          "num_children": 0,
          "author": 253878,
          "replies": []
        },
        {
          "id": "ij141pi",
          "text": "That's how I got a girl's number. We have two kids and a house now. Wonder if she likes me or is just polite to ghost me.",
          "timestamp": "2022-08-05 08:49:37",
          "score": 1,
          "num_children": 0,
          "author": 97614,
          "replies": []
        },
        {
          "id": "ij177fm",
          "text": "I have a position that a great fit for you, a few actually",
          "timestamp": "2022-08-05 09:32:32",
          "score": 1,
          "num_children": 0,
          "author": 322814,
          "replies": []
        },
        {
          "id": "ij1ai03",
          "text": "I dunno man. She got pretty weird about the first date and went to stalking?\n\nThats not good behavior.",
          "timestamp": "2022-08-05 10:15:44",
          "score": 1,
          "num_children": 0,
          "author": 334123,
          "replies": []
        },
        {
          "id": "ij1h9ui",
          "text": "I do it all the time for professional stuff. I have a network of acquaintances in over 70 different countries that I leverage very often to stay up to date on my industry or to find people to hang out with when visiting a city.",
          "timestamp": "2022-08-05 11:32:33",
          "score": 1,
          "num_children": 0,
          "author": 152483,
          "replies": []
        },
        {
          "id": "ij1l1uu",
          "text": "Time to update yours mate. We have been trying to reach you...",
          "timestamp": "2022-08-05 12:08:47",
          "score": 1,
          "num_children": 0,
          "author": 57474,
          "replies": []
        },
        {
          "id": "ij3yso9",
          "text": "Bro this is a fucking RomCom right here.\n\nI can't wait for the next one.",
          "timestamp": "2022-08-05 21:47:28",
          "score": 1,
          "num_children": 0,
          "author": 393239,
          "replies": []
        },
        {
          "id": "ilemp4e",
          "text": "Shocker to me also!",
          "timestamp": "2022-08-23 02:31:38",
          "score": 1,
          "num_children": 0,
          "author": 151903,
          "replies": []
        }
      ]
    },
    {
      "id": "iiyy8jj",
      "text": "[removed]",
      "timestamp": "2022-08-04 21:25:51",
      "score": 5299,
      "num_children": 13,
      "replies": [
        {
          "id": "iiz74b9",
          "text": "Happy anniversary!",
          "timestamp": "2022-08-04 22:25:06",
          "score": 406,
          "num_children": 0,
          "author": 313868,
          "replies": []
        },
        {
          "id": "iizi03u",
          "text": "Happy anniversary! May you have many, many more years of married happiness!\n\nHope my future is as wholesome as yours.",
          "timestamp": "2022-08-04 23:43:15",
          "score": 78,
          "num_children": 0,
          "author": 173608,
          "replies": []
        },
        {
          "id": "iizmizo",
          "text": "Something similar happened to me and my now-fiancé as well! We matched on a dating app, decided to go on a first date on a specific day, and I gave him my phone number to set up the details…only I gave him the wrong number. I only noticed when the day of the date came and I checked the app to figure out what went wrong and why he ghosted me… turns out, I was off by a digit. He didn’t understand why I ghosted him when he tried texting 2-3 times. Luckily, it worked out for us and we’re getting married in less than a year. Good luck on the date, OP! Wishing you the best and maybe that this will be the beginning of your love story.",
          "timestamp": "2022-08-05 00:16:45",
          "score": 148,
          "num_children": 0,
          "author": 252901,
          "replies": []
        },
        {
          "id": "iizkytg",
          "text": "When not even meaning to play hard to get works. Works 60% of the time, every time.",
          "timestamp": "2022-08-05 00:05:11",
          "score": 22,
          "num_children": 0,
          "author": 81910,
          "replies": []
        },
        {
          "id": "iizcuaj",
          "text": "Thank you for my daily reminder to escalate with women no matter what! Rejection is liberating.",
          "timestamp": "2022-08-04 23:05:34",
          "score": 107,
          "num_children": 4,
          "author": 48642,
          "replies": [
            {
              "id": "iizfaxw",
              "text": "Be careful with that wood u/DICK_SIZED_TREE",
              "timestamp": "2022-08-04 23:23:26",
              "score": 67,
              "num_children": 0,
              "author": 83701,
              "replies": []
            },
            {
              "id": "ij00qo7",
              "text": "But please respect rejection my dudes and chicas. If they say no, it’s totally fine to say “right on, still think you’re an awesome person, peace out”.",
              "timestamp": "2022-08-05 02:02:26",
              "score": 26,
              "num_children": 0,
              "author": 321620,
              "replies": []
            },
            {
              "id": "ik88xyj",
              "text": "🅰️🅱️❤️❤️💙💙💜💜🧡💚💛💛💚💛💚💛💛💛💛💛💛💛",
              "timestamp": "2022-08-14 07:41:20",
              "score": 1,
              "num_children": 0,
              "author": 391723,
              "replies": []
            },
            {
              "id": "ij0yu60",
              "text": "Time to start stalking linkedin!",
              "timestamp": "2022-08-05 07:39:56",
              "score": 0,
              "num_children": 0,
              "author": 202637,
              "replies": []
            }
          ]
        },
        {
          "id": "iizh7ql",
          "text": "I’M NOT CRYING! I swear!",
          "timestamp": "2022-08-04 23:37:27",
          "score": 24,
          "num_children": 2,
          "author": 180671,
          "replies": [
            {
              "id": "iiznjrq",
              "text": "Sorry, but did you know that swans can be gay?",
              "timestamp": "2022-08-05 00:24:22",
              "score": 14,
              "num_children": 1,
              "author": 200856,
              "replies": [
                {
                  "id": "iizq0ty",
                  "text": "**what**",
                  "timestamp": "2022-08-05 00:42:55",
                  "score": 6,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iizqpqg",
                      "text": "You would know that reference if you were a Reddit bot!",
                      "timestamp": "2022-08-05 00:48:08",
                      "score": 12,
                      "num_children": 1,
                      "author": 131375,
                      "replies": [
                        {
                          "id": "ij1uzc8",
                          "text": ":(",
                          "timestamp": "2022-08-05 13:30:10",
                          "score": 2,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "iizktm0",
              "text": "I believe you. I am cutting onions over here",
              "timestamp": "2022-08-05 00:04:07",
              "score": 7,
              "num_children": 0,
              "author": 317170,
              "replies": []
            }
          ]
        },
        {
          "id": "iizefbs",
          "text": "Happy anniversary! Sweet story",
          "timestamp": "2022-08-04 23:17:03",
          "score": 15,
          "num_children": 0,
          "author": 83988,
          "replies": []
        },
        {
          "id": "iizoc8t",
          "text": "Happy Anniversary!",
          "timestamp": "2022-08-05 00:30:16",
          "score": 3,
          "num_children": 0,
          "author": 278961,
          "replies": []
        },
        {
          "id": "iizogm8",
          "text": "Is he still out of your league?",
          "timestamp": "2022-08-05 00:31:11",
          "score": 3,
          "num_children": 1,
          "author": 122857,
          "replies": [
            {
              "id": "iizp7ao",
              "text": "Oh, 100%. No question.",
              "timestamp": "2022-08-05 00:36:45",
              "score": 3,
              "num_children": 1,
              "author": 117897,
              "replies": [
                {
                  "id": "ij0mtqi",
                  "text": "Congrats my dude",
                  "timestamp": "2022-08-05 05:15:40",
                  "score": 2,
                  "num_children": 0,
                  "author": 122857,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iiztsax",
          "text": "God it really is adorable, I'm burning with envy",
          "timestamp": "2022-08-05 01:10:56",
          "score": 3,
          "num_children": 0,
          "author": 399821,
          "replies": []
        },
        {
          "id": "iizqyum",
          "text": "I was literally coming on here to say the same thing!\n\nThis is definitely the most wholesome NSFW I've ever read, as well.\n\nAlso, congratulations teslaguykc!!! May you have many more happy days.\n\nI also just celebrated a lengthy anniversary. We literally just celebrated 16 years and it was at that point that I told her how much of a piece of s*** I was in my twenties. \n\nWhen I cheated on her with her best friend; and now we're getting a divorce.\n\nC'est la vie!",
          "timestamp": "2022-08-05 00:50:03",
          "score": 4,
          "num_children": 1,
          "author": 344462,
          "replies": [
            {
              "id": "iizykln",
              "text": "Judging by your comments on porn subreddit posts that go back years, and you *literally just* celebrated 16 years, sounds like you being a piece of shit persisted beyond your twenties.",
              "timestamp": "2022-08-05 01:46:16",
              "score": 13,
              "num_children": 1,
              "author": 313709,
              "replies": [
                {
                  "id": "ij63z8y",
                  "text": "Actually, a lot of those posts were done by both of us.  We used to look together; most of the time before we would start, or I guess that's how we would start.\n\nSooo, nope, just a piece of shit in my twenties, like I said.![gif](emote|free_emotes_pack|grin)",
                  "timestamp": "2022-08-06 10:15:42",
                  "score": 1,
                  "num_children": 0,
                  "author": 344462,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ij0sk8r",
          "text": "I got my partner like this also. We were at a party together and a big group of people started dancing together. One by one people left but we two stayed and just kept dancing. We never spent a moment apart that night. As it came time to leave we tried to tell each other what our phone numbers where but we dumbasses never wrote anything down. So next morning I only new the guy's first name. I went to facebook and only found him because of mutual friends list. He didn't even have a profile picture. 10 years together and getting married next summer so it was a great night!",
          "timestamp": "2022-08-05 06:20:29",
          "score": 1,
          "num_children": 0,
          "author": 349064,
          "replies": []
        },
        {
          "id": "ij10kvf",
          "text": "A friend and I each thought the other was out of our league so even though we liked each other, we never said anything.  I tried so hard to work up the courage to say something but I didn't want to get rejected, so I just forgot about it and eventually ended up starting a relationship with someone else for about a year.  Very long story short: I reconnected with my friend after getting my shit together, remembered why I had liked her so much, and finally found the courage to let her know how I felt.  We've been married for nearly 14 years now.",
          "timestamp": "2022-08-05 08:03:02",
          "score": 1,
          "num_children": 0,
          "author": 355178,
          "replies": []
        }
      ]
    },
    {
      "id": "ij0092d",
      "text": "My wife and I met at a bar. We got to talking and lost track of time and everyone else. Hours went by and as her friends finally came to drag her away she wrote her phone number on my hand. My dumb ass didn’t think to write it down somewhere else so the next morning when I looked at the palm of my hand the numbers had smeared enough where I could only make out four of the seven clearly. \n\nSo I got to dialing. Took me a while but I finally got her. It took me long enough that she didn’t think I was going to call. It all worked out though. We’ve been together now for 31 years and married for 29.",
      "timestamp": "2022-08-05 01:58:49",
      "score": 212,
      "num_children": 2,
      "author": 240441,
      "replies": [
        {
          "id": "ij08wkp",
          "text": "Smeared your hand. Hee hee.",
          "timestamp": "2022-08-05 03:06:03",
          "score": 43,
          "num_children": 1,
          "author": 367814,
          "replies": [
            {
              "id": "ij09thc",
              "text": "Ok. That was funny.",
              "timestamp": "2022-08-05 03:13:47",
              "score": 12,
              "num_children": 0,
              "author": 240441,
              "replies": []
            }
          ]
        },
        {
          "id": "ij0caty",
          "text": "The determination is amazing!",
          "timestamp": "2022-08-05 03:34:48",
          "score": 10,
          "num_children": 1,
          "author": 102217,
          "replies": [
            {
              "id": "ij1ejoq",
              "text": "It certainly is",
              "timestamp": "2022-08-05 11:03:47",
              "score": 2,
              "num_children": 0,
              "author": 55332,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iiypkae",
      "text": "This story is straight up wholesome. Hope it works out. If it does you're going to have an *amazing* story to tell down the road.",
      "timestamp": "2022-08-04 20:29:40",
      "score": 2523,
      "num_children": 6,
      "author": 408867,
      "replies": [
        {
          "id": "iiythsn",
          "text": "Thank you so much! I hope it does! He’s so cute and so sweet. Thanks for the award!",
          "timestamp": "2022-08-04 20:55:07",
          "score": 880,
          "num_children": 2,
          "author": 85543,
          "replies": [
            {
              "id": "ij05jjb",
              "text": "Hopefully it works out and is the last time you have to exchange numbers with a guy :)\n\nPro tip for number exchange (coworker, New friend, anyone), have them text you right after you put it in. Fixes your problem and now you'll have their number too.",
              "timestamp": "2022-08-05 02:39:06",
              "score": 93,
              "num_children": 0,
              "author": 67312,
              "replies": []
            },
            {
              "id": "ij1ocy3",
              "text": ">Turns out, he was incredibly easy to find. I was planning on just looking at him because I missed his face, but I accidentally clicked the link that brought me to his LinkedIn page\n\nWhat link???\n\nHow did you find his linkedin, did you go back to a facebook event page or what? Asking because I've had this happen to me but I know you need a lead to be able to get a linkedin, even first and last names won't cut it.",
              "timestamp": "2022-08-05 12:38:00",
              "score": 1,
              "num_children": 1,
              "author": 274689,
              "replies": [
                {
                  "id": "ij1p6a1",
                  "text": "Probably googled his name",
                  "timestamp": "2022-08-05 12:44:47",
                  "score": 2,
                  "num_children": 2,
                  "author": 167555,
                  "replies": [
                    {
                      "id": "ij1q6vo",
                      "text": "Yep, I googled his name and where he worked.",
                      "timestamp": "2022-08-05 12:52:58",
                      "score": 2,
                      "num_children": 0,
                      "author": 85543,
                      "replies": []
                    },
                    {
                      "id": "ij1v0bs",
                      "text": "If his name is super unique, first name I doubt they exchange first and last. The OP's writing is a bit confusing!",
                      "timestamp": "2022-08-05 13:30:22",
                      "score": 1,
                      "num_children": 0,
                      "author": 274689,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "iizcrd7",
          "text": "Yes that’s a definitely a great “how we met” story.",
          "timestamp": "2022-08-04 23:04:59",
          "score": 64,
          "num_children": 0,
          "author": 15809,
          "replies": []
        },
        {
          "id": "ij1tk97",
          "text": "Playing a little fast and loose with the word \"amazing\" here.",
          "timestamp": "2022-08-05 13:19:27",
          "score": 5,
          "num_children": 1,
          "author": 81462,
          "replies": [
            {
              "id": "ik89asl",
              "text": "Ya playing it loose alright ! “that third time “ was wen AMAZING WAS.  Introduce into his descriptive vocab but actually 4 5 6 th where phenomenally AMAZING DAMN I MISS THAT HOLD HE HAD ON ME WEN HE WAS INSIDE ME . Mr L, P, W, Maintance???",
              "timestamp": "2022-08-14 07:46:03",
              "score": 1,
              "num_children": 0,
              "author": 391723,
              "replies": []
            }
          ]
        },
        {
          "id": "ij07nde",
          "text": "besides the not like the other girls energy",
          "timestamp": "2022-08-05 02:55:44",
          "score": 2,
          "num_children": 0,
          "author": 88035,
          "replies": []
        },
        {
          "id": "ij19m7u",
          "text": "I have a similar story, I was out on a Friday night with my friends who are a couple. We were pretty drunk and at the club, I felt like dancing so I looked around and picked a girl to dance with me. Being very drunk I started to dance really silly, like making awkward moves not taking myself seriously, she liked it and joined me! We didn't even chat or anything. After the song ended I thanked her and went back to my friends to chat.\n\nA couple moments later I feel taps on my shoulder and when I turn around it's her! She asks me if I have her phone and my autistic self thought she lost it, or maybe thinks I stole it during the dancing, so I start looking for it around the club... I saw her facepalm and push her phone in my hands to enter a number. So I did, but my drunken self put completely wrong number.\n\nHow do I know that? I met her again! In completely different club couple months later with different group of friends. We chatted and exchanged real numbers this time.\n\nUnfortunately nothing more came out of that, but still a funny memory to have.",
          "timestamp": "2022-08-05 10:04:27",
          "score": 1,
          "num_children": 0,
          "author": 290183,
          "replies": []
        },
        {
          "id": "ij3amnp",
          "text": "Nothing quite wholesome and amazing like stalking and blaming the other person for your mistake. Big simp energy",
          "timestamp": "2022-08-05 19:07:43",
          "score": 1,
          "num_children": 0,
          "author": 313051,
          "replies": []
        }
      ]
    },
    {
      "id": "iiythf6",
      "text": "Make sure you got the time right.",
      "timestamp": "2022-08-04 20:55:03",
      "score": 774,
      "num_children": 2,
      "author": 248895,
      "replies": [
        {
          "id": "iiytlv4",
          "text": "Lolololol I’m Really bad at this. I’ll definitely double check!",
          "timestamp": "2022-08-04 20:55:50",
          "score": 427,
          "num_children": 3,
          "author": 85543,
          "replies": [
            {
              "id": "iiyu1ix",
              "text": "Good luck.",
              "timestamp": "2022-08-04 20:58:39",
              "score": 46,
              "num_children": 0,
              "author": 248895,
              "replies": []
            },
            {
              "id": "iizaqsh",
              "text": "Don’t forget to update from the Julian calendar",
              "timestamp": "2022-08-04 22:50:36",
              "score": 24,
              "num_children": 0,
              "author": 183046,
              "replies": []
            },
            {
              "id": "iizi1wk",
              "text": "Manage the date so it culminates at your place sometime after noon or midnight, then you can make a comment like \"Just like last time, I'm gonna get you off by one.\"",
              "timestamp": "2022-08-04 23:43:36",
              "score": 46,
              "num_children": 0,
              "author": 189200,
              "replies": []
            }
          ]
        },
        {
          "id": "ij0zvvm",
          "text": "There's a British comedian who said \"I always give the girl my number rather than getting hers, so that if she calls, I know she likes me. But I always give her the wrong number so that if she doesn't call, I know the reason\"",
          "timestamp": "2022-08-05 07:53:37",
          "score": 2,
          "num_children": 0,
          "author": 79446,
          "replies": []
        }
      ]
    },
    {
      "id": "iizce8u",
      "text": "I’m so happy it worked out for you! \n\nI met my husband in a Waffle House. He was hammered and with his friends. I was with my friends, celebrating my birthday.  He made the drunk stagger to my table and loudly slurred I’m gonna marry you one day. I laughed and sent him away with let’s see if you remember in the morning.  Well as fate would have it I was moving and was selling a futon.  \n\nThe buyer was him.  He came and picked up and when I opened the door the look on my face was a mix of shock, horror and disgust.  But still he paid for the futon I at least needed to let him get it.  He was a completely different guy and he noticed we were reading the same book. Then he noticed we had similar tastes in movies and music.  He asked me out on a proper date later in the week.  I refused saying I was moving.  Well he came and helped me move, then bought pizza that night. After that I couldn’t say no to his offer of a proper date. \n\nI learned the night I met him he was at his buddy’s bachelor party and he never drinks so just a few drinks hit him hard.  He felt so embarrassed when he saw me at my house getting the futon.  He knew he made an ass of himself and thought the likelihood of running into me again was slim to none so he just was going to write it off as a learning lesson.  We just celebrated 7 years last weekend.  Sometimes things just work out how they are supposed to",
      "timestamp": "2022-08-04 23:02:24",
      "score": 457,
      "num_children": 7,
      "replies": [
        {
          "id": "iizwp4u",
          "text": "Damn, that was a great origin story. Feels like you getting together was really meant to be",
          "timestamp": "2022-08-05 01:32:34",
          "score": 51,
          "num_children": 0,
          "author": 98957,
          "replies": []
        },
        {
          "id": "iizq7ts",
          "text": "this sounds like the plot of a romance novel, congratulations to you and your husband!",
          "timestamp": "2022-08-05 00:44:22",
          "score": 93,
          "num_children": 1,
          "author": 253740,
          "replies": [
            {
              "id": "ij0tcau",
              "text": "Honestly, as an avid romance novel reader, all of these stories in the comments here are giving me LIFE 😍",
              "timestamp": "2022-08-05 06:29:51",
              "score": 23,
              "num_children": 2,
              "author": 214792,
              "replies": [
                {
                  "id": "ij0tqka",
                  "text": "it honestly gives me hope that this can happen in my own life",
                  "timestamp": "2022-08-05 06:34:39",
                  "score": 1,
                  "num_children": 1,
                  "author": 253740,
                  "replies": [
                    {
                      "id": "ij0yogj",
                      "text": "This is simultaneously sweet and shocking at how events happened, but I swear I'm like, this romantic comedy ain't happening to me.",
                      "timestamp": "2022-08-05 07:37:51",
                      "score": 1,
                      "num_children": 1,
                      "author": 347289,
                      "replies": [
                        {
                          "id": "ij4gfgl",
                          "text": "same, because i don't have the courage to even go up to people and shoot my shot and not pretty enough to be the target of shooting shots lol",
                          "timestamp": "2022-08-05 23:58:14",
                          "score": 1,
                          "num_children": 0,
                          "author": 253740,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ij1mhu7",
                  "text": "And depression",
                  "timestamp": "2022-08-05 12:21:47",
                  "score": 1,
                  "num_children": 1,
                  "author": 254558,
                  "replies": [
                    {
                      "id": "ij1v1ns",
                      "text": "One time I admitted over in r/romancebooks that I despair of ever finding my someone, and a well-meaning redditor reported me for >!self-harm risk!< 🤪",
                      "timestamp": "2022-08-05 13:30:38",
                      "score": 1,
                      "num_children": 1,
                      "author": 214792,
                      "replies": [
                        {
                          "id": "ij25u5u",
                          "text": "Classic reddit",
                          "timestamp": "2022-08-05 14:45:52",
                          "score": 2,
                          "num_children": 0,
                          "author": 254558,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ij01pzm",
          "text": "WHAT. You should seriously consider writing down more of the specific details. Even if just for yourselves years from now. That's entirely unbelievable.",
          "timestamp": "2022-08-05 02:09:50",
          "score": 50,
          "num_children": 0,
          "author": 281130,
          "replies": []
        },
        {
          "id": "ij0l2o3",
          "text": "He helped you move and then HE bought pizza ? Dude what's your problem, that's against the code.",
          "timestamp": "2022-08-05 04:57:14",
          "score": 3,
          "num_children": 0,
          "author": 209559,
          "replies": []
        },
        {
          "id": "ij1u4jb",
          "text": "What do you know, he *did* remember it in the morning",
          "timestamp": "2022-08-05 13:23:40",
          "score": 1,
          "num_children": 0,
          "author": 321291,
          "replies": []
        },
        {
          "id": "iljt3lw",
          "text": "Awww this is so cute! Totally made me tear up😭",
          "timestamp": "2022-08-24 03:38:36",
          "score": 1,
          "num_children": 0,
          "author": 66393,
          "replies": []
        },
        {
          "id": "imanz40",
          "text": "Bro was right all along damn",
          "timestamp": "2022-08-29 19:42:07",
          "score": 1,
          "num_children": 0,
          "author": 145240,
          "replies": []
        }
      ]
    },
    {
      "id": "iizhdy1",
      "text": "My brother Facebook stalked his dental hygienist and sent her a message but didn't get anything back. A month later his dental hygienist Facebook stalks him and when she goes to message him finds a message already there that didn't go to her inbox because of her privacy settings. They have a 2 year old now.",
      "timestamp": "2022-08-04 23:38:44",
      "score": 246,
      "num_children": 1,
      "author": 398948,
      "replies": [
        {
          "id": "ij0spbw",
          "text": "Is she from Carbondale?",
          "timestamp": "2022-08-05 06:22:06",
          "score": 15,
          "num_children": 1,
          "author": 375130,
          "replies": [
            {
              "id": "ij1fakt",
              "text": "Spent a week there once, god I hate that area.",
              "timestamp": "2022-08-05 11:11:58",
              "score": 2,
              "num_children": 0,
              "author": 276588,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iiyydt9",
      "text": "Well that’s a good story for the kids when you eventually get to the “how I met your father” stories",
      "timestamp": "2022-08-04 21:26:48",
      "score": 54,
      "num_children": 1,
      "author": 183301,
      "replies": [
        {
          "id": "ij0txoq",
          "text": "Met your mom last night",
          "timestamp": "2022-08-05 06:37:05",
          "score": 0,
          "num_children": 1,
          "author": 397205,
          "replies": [
            {
              "id": "ij18asn",
              "text": "Oh you were the micropenis she was complaining about this morning, something about least satisfying night of her life.",
              "timestamp": "2022-08-05 09:47:17",
              "score": 2,
              "num_children": 1,
              "author": 183301,
              "replies": [
                {
                  "id": "ij2cdaq",
                  "text": "Nah, last week, “brushes chip ok shoulder”",
                  "timestamp": "2022-08-05 15:28:44",
                  "score": 1,
                  "num_children": 0,
                  "author": 397205,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iiz6wif",
      "text": "Wait.  People can see who checked them on LinkedIn…. Fuuuuuu",
      "timestamp": "2022-08-04 22:23:36",
      "score": 135,
      "num_children": 6,
      "author": 238961,
      "replies": [
        {
          "id": "iizesmj",
          "text": "You can set your profile so they don’t see that, and then you don’t get to see who clicked on you.  It’s not a permanent/required feature",
          "timestamp": "2022-08-04 23:19:46",
          "score": 65,
          "num_children": 0,
          "author": 128580,
          "replies": []
        },
        {
          "id": "iiz8ru7",
          "text": "If you don't have a LinkedIn that is always signed in, I'm sure they don't see",
          "timestamp": "2022-08-04 22:36:43",
          "score": 11,
          "num_children": 0,
          "author": 911,
          "replies": []
        },
        {
          "id": "iizeewg",
          "text": "Oh thank god.  I have totally stalked a tinder date or two.",
          "timestamp": "2022-08-04 23:16:58",
          "score": 7,
          "num_children": 0,
          "author": 238961,
          "replies": []
        },
        {
          "id": "iizirpa",
          "text": "Just logout then go creeping, easy solution",
          "timestamp": "2022-08-04 23:48:49",
          "score": 40,
          "num_children": 2,
          "author": 293555,
          "replies": [
            {
              "id": "iizqhmd",
              "text": "It doesn't let you see the profile picture in some cases. I prefer to change the privacy option to anonymous.",
              "timestamp": "2022-08-05 00:46:26",
              "score": 17,
              "num_children": 0,
              "author": 332484,
              "replies": []
            },
            {
              "id": "iizj4ji",
              "text": "Reddit coming in clutch, making creeping easier for all of us!",
              "timestamp": "2022-08-04 23:51:26",
              "score": 11,
              "num_children": 0,
              "author": 238961,
              "replies": []
            }
          ]
        },
        {
          "id": "iizlhic",
          "text": "[deleted]",
          "timestamp": "2022-08-05 00:09:02",
          "score": 2,
          "num_children": 2,
          "replies": [
            {
              "id": "iizp4a8",
              "text": "It's a LinkedIn feature, but you can turn it off if you want.",
              "timestamp": "2022-08-05 00:36:07",
              "score": 7,
              "num_children": 0,
              "author": 39817,
              "replies": []
            },
            {
              "id": "iizrfu8",
              "text": "It sends a notification every time someone sees your profile",
              "timestamp": "2022-08-05 00:53:36",
              "score": 7,
              "num_children": 0,
              "author": 192397,
              "replies": []
            }
          ]
        },
        {
          "id": "ij354qt",
          "text": "so what im learning now is that linkedin stalking is a thing??? i can't even",
          "timestamp": "2022-08-05 18:32:30",
          "score": 2,
          "num_children": 1,
          "author": 152777,
          "replies": [
            {
              "id": "ij3mmfk",
              "text": "I had to!  Tinder Dude said he was a nanoscientist!! That’s a claim you gotta check.  I did.  He was.  It was the most intimidating CV I’ve ever seen!",
              "timestamp": "2022-08-05 20:25:25",
              "score": 2,
              "num_children": 1,
              "author": 238961,
              "replies": [
                {
                  "id": "ij3ok6m",
                  "text": "well in *that* case i'd probably do the same thing lol",
                  "timestamp": "2022-08-05 20:38:17",
                  "score": 1,
                  "num_children": 0,
                  "author": 152777,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iiyvdw4",
      "text": "This sounds suspiciously like how I met my husband. Party where he walked in, locked eyes and gave me a big smile, hours talking, people thinking we were a couple, etc. (Minus the ghosting but he did wait 4 days to call me. Jerk. ;)\n\n We've been married for 20 years. Just saying...",
      "timestamp": "2022-08-04 21:07:19",
      "score": 404,
      "num_children": 1,
      "author": 150933,
      "replies": [
        {
          "id": "iiz2ays",
          "text": "[deleted]",
          "timestamp": "2022-08-04 21:52:33",
          "score": 207,
          "num_children": 1,
          "replies": [
            {
              "id": "iiz3zd3",
              "text": "My wife never called me back. She worked odd hours and didn't want to make it seem like a booty call whenever she was finally free late at night. She ended up reaching out through a mutual friend a month or so later and we finally reconnected.\n\nBeen together for 19 years now",
              "timestamp": "2022-08-04 22:03:47",
              "score": 143,
              "num_children": 0,
              "author": 11270,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ij05rbc",
      "text": "This nearly happened to me... met someone on lavalife, seemed to really hit it off. Lots in common, lots of things to talk about, seemed witty/funny/cute/endearing so i gave her my email address, said let's connect off the site and get together!\n\nAbout a week goes by and I'm like... fuck I guess she found someone more interesting than me. Which was par for the course, i had gotten out of a long relationship and wasn't used to the new landscape of internet dating where everyone ghosts everyone as soon as someone with more promise/potential shows up. I hadn't even planned on messaging her because when I had logged on to lavalife and saw her message, i was actually there with the intent to delete my account and stop dating for a while, but i liked the stuff in her profile so much that i thought i'd let her be the last person i connect with and *then* I'll delete my account. It was more of the same ghosting crap, so I felt pretty bummed. \n\nThrowing caution to the wind though, because she did seem really nice, I reached out to say \"hey *just in case* here's my email address again, I haven't heard from you so if you DID email me maybe just copy/paste because there's this typo that you might make\" and sure enough, ***she had typed my email address wrong***.\n\nAnd thank god I reached out because she thought i was ignoring her and not getting back to her! How did it go? well we'll be married 5 years this year and we've got kids, a house, etc etc. So it has a very, very happy ending!",
      "timestamp": "2022-08-05 02:40:46",
      "score": 39,
      "num_children": 0,
      "author": 282980,
      "replies": []
    },
    {
      "id": "iiz8n7i",
      "text": "I (M) received a text apology from a guy because he pissed someone off. I told him no wrong number. \n\nA month later same thing happened. I told him again. He told me please quit the joke he would do anything for me. \n\nI took a selfie and asked if he was looking for me. \n\nNever heard back. 🥲🥲🥲",
      "timestamp": "2022-08-04 22:35:49",
      "score": 174,
      "num_children": 1,
      "author": 369442,
      "replies": [
        {
          "id": "iizogug",
          "text": "He knew you are way out of his league",
          "timestamp": "2022-08-05 00:31:14",
          "score": 70,
          "num_children": 0,
          "author": 81225,
          "replies": []
        }
      ]
    },
    {
      "id": "iizbw2t",
      "text": "Ghosting me, Ghosting you ahaaaaaaa",
      "timestamp": "2022-08-04 22:58:48",
      "score": 30,
      "num_children": 2,
      "author": 328691,
      "replies": [
        {
          "id": "iizi4px",
          "text": "🤣🤣🤣🤣 \n\nHow funny that I read this with the tune in my head!!",
          "timestamp": "2022-08-04 23:44:10",
          "score": 4,
          "num_children": 1,
          "author": 137927,
          "replies": [
            {
              "id": "ij23son",
              "text": "which tune",
              "timestamp": "2022-08-05 14:32:13",
              "score": 1,
              "num_children": 0,
              "author": 33775,
              "replies": []
            }
          ]
        },
        {
          "id": "ij0rhts",
          "text": "thanks for this :'D",
          "timestamp": "2022-08-05 06:07:56",
          "score": 1,
          "num_children": 0,
          "author": 251323,
          "replies": []
        }
      ]
    },
    {
      "id": "iizgg93",
      "text": "I can top this, unfortunately. \n\nI met a very attractive lady at a party. I was in an odd spot by this point, getting out of a 4 year long relationship (just after graduating high school) and wanted to remain single a while to center myself. I was always dating someone so i never really took time to address my own needs. \n\nBut this girl made that inner strength dry right up and i find myself speculating on just how far out of my league she might be. I finally get the confidence to talk to her a bit (because drinks and assorted unhealthy habits that you practice in college) and immediately kind of freeze up. \n\nI asked for her name, she tells me. And all my dumb little man brain thinks is to say \"your name is ____?\" Point to my brother, of the same name. \"His name is _____.\" Some friends then call me over to play pool and i just walk away, slightly panicked and just as stupid. \n\nNot only did i never tell her my name, never gave her my number, and none of my friends knew who she was because she hadnt hung out with our group before. So i did what any reasonable person does after possibly missing thier chance at thier dream partner: start looking on facebook. \n\nSo i start browsing friends of friends of people who dont even use facebook hoping to find her. The college page, in case she followed it there for some reason. Everywhere i could think. No dice. Until a few days later. She had the same idea and much more luck than i did, as it recommended me as a friend to her. Probably because of all the traffic i generated from trying to find her. \n\n3 botched, disasterous \"first dates\" behind us, and we have been together almost 7 years.",
      "timestamp": "2022-08-04 23:31:48",
      "score": 164,
      "num_children": 1,
      "author": 30647,
      "replies": [
        {
          "id": "ij0280b",
          "text": "What were the botched first date stories?",
          "timestamp": "2022-08-05 02:13:39",
          "score": 50,
          "num_children": 1,
          "author": 249316,
          "replies": [
            {
              "id": "ij04fc3",
              "text": "Too long for the origional, which was wordy enough lol. \n\nFirst disaster was going to our downtown area to a park. We have a relatively small, safe city comoared to larger ones. And our parks here are fairly spacious, with a bike/jogging path connecting a few of the smaller ones to the park kind of in the center. I decided to take her to one that was fairly remote, has a nice little waterfall, and a big rock overlooking a small pond. I enjoy standing on top of large rocks, and thought she would enjoy it too. \n\nWhat i did not realize is that not everyone, especially a gorgeous gal who prepped for a nice date in dainty shoes (not heels, but a nice, white cloth, lace shoe, like Toms), can just climb up hills and rocks like i do. And not after rain with shockingly deep mud puddles. So those shoes inevitably got ruined, stained forever when she stepped in said puddle. And ripped more of it shortly after. \n\nThus it was deemed not a great first date, and allowed me to try again. \n\nFirst date #2, i just got a sudden stomach bug and she offered to come take care of me instead. \n\nFirst date #3 was a two-fer. We started with ice cream, which was a mistake because she is lactose intolerant. And half way through not enjoying her ice cream while i enjoyed mine, i got a call from my mother. To remind me (it was new info for me, not a reminder) that it was our mothers day and what time i needed to be at her house. Which was very soon. And i had no gift. So we shopped for a gift in 25 mins and i left. \n\nAnd those are the infamous 3 first dates of disaster.",
              "timestamp": "2022-08-05 02:30:27",
              "score": 120,
              "num_children": 1,
              "author": 30647,
              "replies": [
                {
                  "id": "ij09e7u",
                  "text": "Wow. Not gunna lie, I'm surprised you guys went on a fourth date.",
                  "timestamp": "2022-08-05 03:10:12",
                  "score": 84,
                  "num_children": 1,
                  "author": 105199,
                  "replies": [
                    {
                      "id": "ij0cqh5",
                      "text": "No one was more suprised than me. The 4th date ended up going smashingly apparently, cuz here we are still.",
                      "timestamp": "2022-08-05 03:38:34",
                      "score": 63,
                      "num_children": 0,
                      "author": 30647,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iiyu737",
      "text": "Sounds like a film plot.\nI wish you the best.",
      "timestamp": "2022-08-04 20:59:40",
      "score": 24,
      "num_children": 0,
      "author": 6489,
      "replies": []
    },
    {
      "id": "ij05m6b",
      "text": "What are Raya dates?",
      "timestamp": "2022-08-05 02:39:41",
      "score": 20,
      "num_children": 2,
      "author": 309269,
      "replies": [
        {
          "id": "ij0kl7o",
          "text": "[Worse than you think](https://www.bustle.com/life/raya-dating-app-celebrities-exclusive)",
          "timestamp": "2022-08-05 04:52:10",
          "score": 10,
          "num_children": 2,
          "author": 352868,
          "replies": [
            {
              "id": "ij10zsm",
              "text": "Not sure what you assume others are thinking, but this is better than I thought.",
              "timestamp": "2022-08-05 08:08:33",
              "score": 2,
              "num_children": 0,
              "author": 355178,
              "replies": []
            },
            {
              "id": "ij233bg",
              "text": "I had no idea what to expect. Seems pretty damn stupid though lol",
              "timestamp": "2022-08-05 14:27:26",
              "score": 2,
              "num_children": 0,
              "author": 309269,
              "replies": []
            }
          ]
        },
        {
          "id": "ij1krmq",
          "text": "Glad I'm not the only one who didn't know. That app sounds like my personal hell.",
          "timestamp": "2022-08-05 12:06:09",
          "score": 5,
          "num_children": 0,
          "author": 390886,
          "replies": []
        }
      ]
    },
    {
      "id": "iiz8dit",
      "text": "Somewhat similar to how my fiancee and I got together.\n\nHad known her for a few years through a mutual friend, but we were never single or whatever at the same time when we ended up hanging out together. \n\nFinally were, and asked for her number. I wasn't officially dating anyone else, but had been spending time with someone else I thought that could be a possibility with.\n\nMade several mistakes, some innocent, over the course of a month or two because of that.\n\nShe finally flat out told me she was into me, and wanted to know what the deal was. I didn't know how to respond, until I found out later that day the 'someone else' wasn't going to happen for what should have been an obvious reason. Felt like an idiot.\n\nFinally set up our first date, at a brewery festival thing. It was awesome! Even randomly ran into a bunch of my other friends while there, and we end up hanging out with a bunch of them. \n\nWe get asked at one point by one of the couples there how long we'd been together. We laughed together when we said \"it's actually our first date!\"\n\nThat basically sealed it for me though, knew she could be it based on that question, and that I was an idiot for hemming and hawing until that point. 🤦",
      "timestamp": "2022-08-04 22:33:55",
      "score": 85,
      "num_children": 2,
      "author": 88689,
      "replies": [
        {
          "id": "ij0jy2m",
          "text": "What was the obvious reason? Please tell us more of your stories.",
          "timestamp": "2022-08-05 04:45:42",
          "score": 6,
          "num_children": 1,
          "author": 250195,
          "replies": [
            {
              "id": "ij1nq87",
              "text": "I was the 3rd wheel the whole time...",
              "timestamp": "2022-08-05 12:32:38",
              "score": 2,
              "num_children": 1,
              "author": 88689,
              "replies": [
                {
                  "id": "ij53hdg",
                  "text": "Wait so she had a partner and you were hoping for more? I guess you cut the losses well then",
                  "timestamp": "2022-08-06 03:05:00",
                  "score": 3,
                  "num_children": 1,
                  "author": 250195,
                  "replies": [
                    {
                      "id": "ij55sl7",
                      "text": "Exactly! Why I felt like an idiot.",
                      "timestamp": "2022-08-06 03:25:19",
                      "score": 0,
                      "num_children": 0,
                      "author": 88689,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ij0k7o7",
          "text": "Sorry if I'm incorrect, but it kind of reads like she was your second option.",
          "timestamp": "2022-08-05 04:48:23",
          "score": 4,
          "num_children": 2,
          "author": 5210,
          "replies": [
            {
              "id": "ij1guu4",
              "text": "I feel like the \"obvious reason\" was that he actually liked the current fiancee more? Maybe I'm overthinking it lmao",
              "timestamp": "2022-08-05 11:28:15",
              "score": 2,
              "num_children": 2,
              "author": 208708,
              "replies": [
                {
                  "id": "ij1hu9u",
                  "text": "I feel like that's just in hindsight. They didn't know how to respond, until they found out it wasn't going to happen with the other person.\n\nBut honestly who knows, maybe I'm overthinking it too.",
                  "timestamp": "2022-08-05 11:38:09",
                  "score": 3,
                  "num_children": 0,
                  "author": 5210,
                  "replies": []
                },
                {
                  "id": "ij1pblr",
                  "text": "Big part of it, yep!",
                  "timestamp": "2022-08-05 12:45:59",
                  "score": 1,
                  "num_children": 0,
                  "author": 88689,
                  "replies": []
                }
              ]
            },
            {
              "id": "ij1nk59",
              "text": "Definitely incorrect! \n\nOne of the 'mistakes' was thinking that talking with my now fiancee could be creating that impression in the opposite way you're implying.",
              "timestamp": "2022-08-05 12:31:09",
              "score": 1,
              "num_children": 1,
              "author": 88689,
              "replies": [
                {
                  "id": "ik8a1c9",
                  "text": "Rosa was option one and kept flirting till I wanted to know wat was up he didn’t know how respond but gave an answer like , I’m really attracted to you and just kept it on a clif hanger until another day I asked , can I just jump on it already !? N he said yes! With this beautiful smile.",
                  "timestamp": "2022-08-14 07:55:51",
                  "score": 2,
                  "num_children": 0,
                  "author": 391723,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "iiz2g6p",
      "text": "I would like an update when you guys marry !",
      "timestamp": "2022-08-04 21:53:30",
      "score": 20,
      "num_children": 0,
      "author": 383056,
      "replies": []
    },
    {
      "id": "iizvtzd",
      "text": "nice try linkedin PR department, but im not making an account.",
      "timestamp": "2022-08-05 01:26:04",
      "score": 16,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iizeslg",
      "text": "When being a stalker goes right 😂",
      "timestamp": "2022-08-04 23:19:45",
      "score": 14,
      "num_children": 0,
      "author": 172794,
      "replies": []
    },
    {
      "id": "iiz3sei",
      "text": "You guys will laugh about it in a couple years",
      "timestamp": "2022-08-04 22:02:28",
      "score": 12,
      "num_children": 0,
      "author": 89418,
      "replies": []
    },
    {
      "id": "iizfgg7",
      "text": "wow im so lonely",
      "timestamp": "2022-08-04 23:24:32",
      "score": 12,
      "num_children": 2,
      "author": 409721,
      "replies": [
        {
          "id": "ij1nq3i",
          "text": "Relatable my guy.",
          "timestamp": "2022-08-05 12:32:36",
          "score": 2,
          "num_children": 0,
          "author": 254558,
          "replies": []
        },
        {
          "id": "ilju9o6",
          "text": "Same I’m literally tearing up reading all these stories and anxiously thinking “will I ever get married”😭",
          "timestamp": "2022-08-24 03:48:51",
          "score": 1,
          "num_children": 0,
          "author": 66393,
          "replies": []
        }
      ]
    },
    {
      "id": "iiywdi7",
      "text": "Lovely story mate, hope it all works out!",
      "timestamp": "2022-08-04 21:13:45",
      "score": 9,
      "num_children": 0,
      "author": 401387,
      "replies": []
    },
    {
      "id": "iizcr0s",
      "text": "Why didn't you text him?",
      "timestamp": "2022-08-04 23:04:55",
      "score": 11,
      "num_children": 2,
      "author": 109660,
      "replies": [
        {
          "id": "iizlot2",
          "text": "I don’t think she had his number. She would’ve if she had his number. She says she gave him her number-not that they exchanged numbers.",
          "timestamp": "2022-08-05 00:10:32",
          "score": 19,
          "num_children": 0,
          "author": 309549,
          "replies": []
        },
        {
          "id": "iizk6cg",
          "text": "I had to scroll way too far for this. Op is hypocritical and immature based on her story in trying to say the guy was playing mind games when she made no effort to contact someone she clearly liked.",
          "timestamp": "2022-08-04 23:59:17",
          "score": -14,
          "num_children": 2,
          "author": 121370,
          "replies": [
            {
              "id": "ij07trm",
              "text": "She didn’t have his number",
              "timestamp": "2022-08-05 02:57:12",
              "score": 6,
              "num_children": 0,
              "author": 363544,
              "replies": []
            },
            {
              "id": "ij0cewr",
              "text": "You’re reading a bit far without realizing she couldn’t contact him.",
              "timestamp": "2022-08-05 03:35:46",
              "score": 5,
              "num_children": 1,
              "author": 102217,
              "replies": [
                {
                  "id": "ij117o9",
                  "text": "OP tried to accuse someone of playing mind games solely because OP believed they weren’t contacting them, and used the excuse of “we are in our thirties.” OP had that train of thought as outlined in their post. Wether they could or could not contact them, the guy simply could have lost interest the morning after. If OP really wanted to keep in contact with this person why didn’t they get their number at the time? Seems like they were trying to make the guy put in all the effort. EDIT: All that combined is what made me consider the OP as immature and hypocritical",
                  "timestamp": "2022-08-05 08:11:30",
                  "score": -3,
                  "num_children": 0,
                  "author": 121370,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ij0qz8m",
      "text": "This happened with my sister and her husband! They met at a party and spent the whole night hanging out and when she gave him her number she accidentally gave a mixture of her cellphone number and our parents landline. \n\n\nLater on she found out he was messaging one of her friends who had hosted the party and was pretty upset about it, little did she know he was trying to ask her friend for my sister's actual number but didn't want to be too forward and potentially rude to her friend. \n\n\nHe's one of the most stand-up guys I know and I'm so happy that they're together.",
      "timestamp": "2022-08-05 06:01:57",
      "score": 12,
      "num_children": 0,
      "author": 326971,
      "replies": []
    },
    {
      "id": "iiz5tla",
      "text": "Totally belongs in r/mademesmile",
      "timestamp": "2022-08-04 22:16:15",
      "score": 9,
      "num_children": 0,
      "author": 360594,
      "replies": []
    },
    {
      "id": "iiz5xh9",
      "text": " Same thing happened to me! I met my now husband right after I moved back to the states so I had a new number.  Tipsy me also gave the wrong number. BUT he was a bartender back then and easy to “bump into”. We just celebrated our 10th wedding anniversary!!",
      "timestamp": "2022-08-04 22:17:00",
      "score": 9,
      "num_children": 0,
      "author": 370659,
      "replies": []
    },
    {
      "id": "iiyzjgv",
      "text": "Super cute. UPDATE! UPDATE! UPDATE!",
      "timestamp": "2022-08-04 21:34:26",
      "score": 74,
      "num_children": 0,
      "author": 15025,
      "replies": []
    },
    {
      "id": "iiyyw5q",
      "text": "Good luck! I hope it works out for you🤞",
      "timestamp": "2022-08-04 21:30:11",
      "score": 9,
      "num_children": 0,
      "author": 260211,
      "replies": []
    },
    {
      "id": "iiyzvil",
      "text": "I'm so invested in your story. Please give updates in the future!",
      "timestamp": "2022-08-04 21:36:39",
      "score": 8,
      "num_children": 0,
      "author": 378939,
      "replies": []
    },
    {
      "id": "iizwccd",
      "text": "That's why it's best to send a text instead of giving a number. That way you can immediately verify the number is correct and both parties not only get each other's numbers, there's a text convo already created.",
      "timestamp": "2022-08-05 01:29:54",
      "score": 7,
      "num_children": 0,
      "author": 149044,
      "replies": []
    },
    {
      "id": "ij04ftn",
      "text": "\"Well, I guess I'm glad I only wasted one night on this asshole\"\n\nThis is such a sad sentence. \n\nYou were at a nice party, had a great evening, spent it with an awesome bloke. Why is it a wasted night if it does not end like a romcom? \n\nPeople, you are allowed to enjoy a date / meeting someone without it having to go somewhere. Just enjoy the moment, take sth from it instead of being sad if it doesn't work out. \n\nAlso the stalkee didn't owe you anything. He's not an asshole cause of your insecurities.",
      "timestamp": "2022-08-05 02:30:33",
      "score": 33,
      "num_children": 5,
      "author": 17718,
      "replies": [
        {
          "id": "ij0bmjm",
          "text": "[deleted]",
          "timestamp": "2022-08-05 03:29:06",
          "score": 14,
          "num_children": 1,
          "replies": [
            {
              "id": "ij0h8y9",
              "text": "Exactly. It's like the most normal thing for two people to not be compatible, why be so negative about it. You can still take away joy and experiences.",
              "timestamp": "2022-08-05 04:19:35",
              "score": 8,
              "num_children": 0,
              "author": 17718,
              "replies": []
            }
          ]
        },
        {
          "id": "ij0ymll",
          "text": "Yeah if this was an identical post with the genders flipped OP would be crucified as a neckbeard/niceguy.",
          "timestamp": "2022-08-05 07:37:11",
          "score": 5,
          "num_children": 0,
          "author": 202637,
          "replies": []
        },
        {
          "id": "ij27eyi",
          "text": "Some of my favorite memories come from extended interactions with strangers i never met again. I remember a really good conversation waiting for a flight to Utah from Arizona where this woman from Colorado was in town visiting family, and we talked in length about what makes the southwest such a beautiful place to live. \n\nTalked for a solid hour. That was it. It all started because she dropped a $20 at security i gave back to her. And then she bought me a coffee when she saw me waiting in line for one.",
          "timestamp": "2022-08-05 14:56:15",
          "score": 2,
          "num_children": 0,
          "author": 15617,
          "replies": []
        },
        {
          "id": "ij2k6r2",
          "text": "Exactly! It’s not even like being ghosted at a date, because the guy didn’t intend to meet up with her with romantic intentions. \n\nDrunkenly exchanging numbers? Maybe the dude woke up hungover, still hurting from his ex and realized he can’t date. \n\nMaybe it would be nice to text her and say that, but he doesn’t owe anything. \n\nThis reads with some SERIOUS red flags, mostly on her but maybe even a little with him. \n\nI mean, it could not be, I’m armchair psychology over here.",
          "timestamp": "2022-08-05 16:19:06",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "ij2xynt",
              "text": "\"This reads with some SERIOUS red flags, mostly on her but maybe even a little with him. \n\nI mean, it could not be, I’m armchair psychology over here.\"\n\nExactly, benefit of the doubt. \n\nOP most likely just expressed her feelings, sadness over a missed opportunity after meeting someone they hit it off with. That's also pretty normal to feel like that. Maybe they know it's stupid saying it like this, maybe it's tongue in cheek, maybe it's just hyperbole, maybe a joke we don't get. \n\nI just wanted to give my thoughts, we should try to take the positive out of meeting nice people, not mourn the missed hypothetical relationships. At least that's what I think, and try to do out there in the dating world. Lots of weird people out there, but also lots of awesome people we can engage with and learn from and grow through without necessarily mutually falling for one another. And if we lucky, some day someone we like also likes us and doesn't mind our flaws and quirks, we all want that, just like OP.",
              "timestamp": "2022-08-05 17:46:38",
              "score": 1,
              "num_children": 0,
              "author": 17718,
              "replies": []
            }
          ]
        },
        {
          "id": "ij0enfo",
          "text": "what is the point of this comment lol, what are you trying to say man",
          "timestamp": "2022-08-05 03:55:40",
          "score": -16,
          "num_children": 1,
          "replies": [
            {
              "id": "ij0gtdr",
              "text": "Not every interaction with someone is \"big love\" or \"they an asshole\". Getting to know someone and enjoying the time without it going somewhere serious / long term / anywhere at all can be beautiful as well.\n\nSince you have problems understanding this or lack reading comprehension, your dates may not necessarily feel the same way.",
              "timestamp": "2022-08-05 04:15:29",
              "score": 7,
              "num_children": 0,
              "author": 17718,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iiyzae8",
      "text": "Hooray for you OP! This story brightened my day!",
      "timestamp": "2022-08-04 21:32:46",
      "score": 7,
      "num_children": 0,
      "author": 295974,
      "replies": []
    },
    {
      "id": "iizvzi1",
      "text": "This happened to me in college. I met a cute girl at a bar who was the new bar tender. I gave her my number. Never heard anything. Next night my best friend tells me about this really cute new bartender he met. Ends up it was the same girl. She ends up becoming his girlfriend. After a couple months of them dating she asks me why I never texted her back. I’m like …..(????) Then while she and I were walking and talking it dawned on me that my drunk ass wrote either the wrong number or had illegible hand writing. I explained to her I never got the text and we both realized the mistake. He and her didn’t work out and I never saw her again haha.",
      "timestamp": "2022-08-05 01:27:14",
      "score": 7,
      "num_children": 0,
      "author": 386686,
      "replies": []
    },
    {
      "id": "ij0dtpz",
      "text": "This is very clearly a viral marketing ad campaign for LinkedIn. Good wholesome ad LinkedIn. Well done.",
      "timestamp": "2022-08-05 03:48:12",
      "score": 7,
      "num_children": 0,
      "author": 125207,
      "replies": []
    },
    {
      "id": "iiz3644",
      "text": "i so hope this is real and if it is i double hope things go really well for op and ghost dude",
      "timestamp": "2022-08-04 21:58:16",
      "score": 5,
      "num_children": 0,
      "author": 341470,
      "replies": []
    },
    {
      "id": "iiz3hzj",
      "text": "This is the kind of story you tell at your wedding lol",
      "timestamp": "2022-08-04 22:00:30",
      "score": 5,
      "num_children": 0,
      "author": 339455,
      "replies": []
    },
    {
      "id": "ij09anl",
      "text": "Ugghh.  This is the sappiest, Hallmark Channel, Cinderella spinoff, Tuesday night movie plot I've ever heard.  \n\nOtherwise,  I'm glad you two worked out it good luck to you both.",
      "timestamp": "2022-08-05 03:09:22",
      "score": 8,
      "num_children": 0,
      "author": 150582,
      "replies": []
    },
    {
      "id": "ij0r5sj",
      "text": "Wow Reddit is filled with cute stories recently! What a great change",
      "timestamp": "2022-08-05 06:04:04",
      "score": 6,
      "num_children": 0,
      "author": 308290,
      "replies": []
    },
    {
      "id": "ij0wj52",
      "text": "I have a similar story. Girl I matched with on OKCupid. Fun conversation. I gave her my number but she never texted me, so I thought she’d found something/someone better. \n\nAfter a week or so, I get a slightly disappointed  sounding message on OKC telling me off for never responding to her text. \n\nI check, no text (no SMS, no WhatsApp) and tell her that I don’t have anything from her. \n\nI ask for her number to text her and send off a message, which she receives. Turns out that when she copied my number from the OKC chat, she messed up a digit…\n\nI still tease her about this, 6 years later.",
      "timestamp": "2022-08-05 07:09:54",
      "score": 7,
      "num_children": 0,
      "author": 309570,
      "replies": []
    },
    {
      "id": "ij144l6",
      "text": "I once hooked up with a girl who for some reason decided to write my phone number on her arm instead of just entering it into her phone. She got a digit wrong so we lost contact, until I found her on facebook and gave her the correct number. That was 8 years ago and now she's my wife.",
      "timestamp": "2022-08-05 08:50:43",
      "score": 7,
      "num_children": 0,
      "author": 36495,
      "replies": []
    },
    {
      "id": "iizaj7t",
      "text": "This is my favorite kind of FU. Rooting for you two!",
      "timestamp": "2022-08-04 22:49:08",
      "score": 4,
      "num_children": 0,
      "author": 302629,
      "replies": []
    },
    {
      "id": "iizc530",
      "text": "Awwww\n\n\n*Throws phone out window*",
      "timestamp": "2022-08-04 23:00:34",
      "score": 5,
      "num_children": 0,
      "author": 101850,
      "replies": []
    },
    {
      "id": "iizp4u6",
      "text": "Lol in college I drunkenly gave someone my parents home number. Omg was that an embarrassing mess up.",
      "timestamp": "2022-08-05 00:36:14",
      "score": 5,
      "num_children": 0,
      "author": 276855,
      "replies": []
    },
    {
      "id": "iizvelb",
      "text": "You can tell this post was written by a woman based on the reaction to being ghosted",
      "timestamp": "2022-08-05 01:22:54",
      "score": 6,
      "num_children": 0,
      "author": 268920,
      "replies": []
    },
    {
      "id": "ij0d7s7",
      "text": "Year 1975: finds cute guys business card\n\nYear 1990: finds cute guys phone number in phone book\n\nYear 2004: finds cute guy on MySpace \n\nYear 2022: finds cute guy on LinkedIn by alerting him he that you looked at his page and he DMs you\n\nYear 2032: with neuralink we make connections across the globe and create thoughtfulorgasms on virtually literal blind dates",
      "timestamp": "2022-08-05 03:42:47",
      "score": 5,
      "num_children": 0,
      "author": 235191,
      "replies": []
    },
    {
      "id": "ij0rrgx",
      "text": "Ah this reminds me of a time I once accidentally gave a guy my dad's number while I was tipsy at a bar. Our numbers are also off by one digit. Saw the guy a week later by chance and figured out my error. It's shocking it took me that long to piece it together considering the afternoon after I met this guy my dad told me over the phone that a random number texted him to ask if he got home okay that morning. Didn't work out with me and the guy...",
      "timestamp": "2022-08-05 06:11:03",
      "score": 4,
      "num_children": 0,
      "author": 103384,
      "replies": []
    },
    {
      "id": "iiyyusd",
      "text": "Aww, you effed up right into a great “how we met” story. Good for you!",
      "timestamp": "2022-08-04 21:29:55",
      "score": 4,
      "num_children": 0,
      "author": 23818,
      "replies": []
    },
    {
      "id": "iizhvww",
      "text": "when you said you loved his smile, I kept thinking about [Lalo Salamanca's smile](https://www.reddit.com/r/betterCallSaul/comments/ul3p2x/everyone_is_tired_of_your_shitty_theories_but_im/?utm_medium=android_app&utm_source=share) , it is so lovely Lol",
      "timestamp": "2022-08-04 23:42:23",
      "score": 5,
      "num_children": 0,
      "author": 208322,
      "replies": []
    },
    {
      "id": "iiztzre",
      "text": "I think this is a great example of how valuable it is to just be honest about how you feel and act on it. It’s not stalking it’s interest. \n\nStalking is when someone clearly isn’t interested or you don’t even know them and you keep doing these things. \n\nBut actual pursuit of a relationship requires actually pursuit. It’s work and it’s ok. I’m glad you found a good connection. Good luck! 😊",
      "timestamp": "2022-08-05 01:12:29",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ij0h526",
      "text": "What is this /r/fanfic ?",
      "timestamp": "2022-08-05 04:18:34",
      "score": 5,
      "num_children": 0,
      "author": 185652,
      "replies": []
    },
    {
      "id": "ij0se4f",
      "text": "This post made me feel old.",
      "timestamp": "2022-08-05 06:18:30",
      "score": 4,
      "num_children": 0,
      "author": 4220,
      "replies": []
    },
    {
      "id": "ij1vmo5",
      "text": "He’s such an asshole for your screw up.",
      "timestamp": "2022-08-05 13:35:01",
      "score": 5,
      "num_children": 0,
      "author": 82187,
      "replies": []
    },
    {
      "id": "ij2dxwl",
      "text": "This is easily the cutest TIFU I've read and I hope you two have a good time with one another",
      "timestamp": "2022-08-05 15:38:57",
      "score": 4,
      "num_children": 0,
      "author": 4040,
      "replies": []
    },
    {
      "id": "ij2rk0h",
      "text": "Women☕",
      "timestamp": "2022-08-05 17:05:53",
      "score": 5,
      "num_children": 0,
      "author": 197717,
      "replies": []
    },
    {
      "id": "imbc9vs",
      "text": "The only reddit post where I was actually rooting for one of them annoying \"now we have been married for 300 years with 5 planets worth of grandchildren and a dog\" twist endings.\nHope you're getting there, OP.",
      "timestamp": "2022-08-29 22:39:34",
      "score": 4,
      "num_children": 0,
      "author": 20655,
      "replies": []
    },
    {
      "id": "iizle8u",
      "text": "Talks about being an adult and doesn’t play mind games.\n\nIs more insecure than a 12 year old lol",
      "timestamp": "2022-08-05 00:08:23",
      "score": 14,
      "num_children": 1,
      "author": 248730,
      "replies": [
        {
          "id": "ij3kfzr",
          "text": "Right? It reads like a teenager wrote it whilst they say they're 30 and \"know better\" than mind games. \n\nGotta love reddit praising stalking too, if a man did this shit everyone would be creeped out.",
          "timestamp": "2022-08-05 20:11:13",
          "score": 1,
          "num_children": 0,
          "author": 176215,
          "replies": []
        }
      ]
    },
    {
      "id": "iiz38lf",
      "text": "What I needed today.  Good luck and have fun!",
      "timestamp": "2022-08-04 21:58:44",
      "score": 3,
      "num_children": 0,
      "author": 255098,
      "replies": []
    },
    {
      "id": "iiz61sj",
      "text": "This is a great story and the kind of thing that happens in rom coms. I hope it works out for you.",
      "timestamp": "2022-08-04 22:17:49",
      "score": 3,
      "num_children": 0,
      "author": 266481,
      "replies": []
    },
    {
      "id": "iizbr5f",
      "text": "Yeah, I’m with everyone else: this is one of the more wholesome TIFUs I’ve ever read, and I’m rooting for you!",
      "timestamp": "2022-08-04 22:57:48",
      "score": 3,
      "num_children": 0,
      "author": 83350,
      "replies": []
    },
    {
      "id": "iizcrat",
      "text": "Can't people only see who viewed them on Link' if they pay for premium?  Somebody is fancy!",
      "timestamp": "2022-08-04 23:04:59",
      "score": 3,
      "num_children": 0,
      "author": 255930,
      "replies": []
    },
    {
      "id": "iizg3w6",
      "text": "Need to see the wedding pictures,",
      "timestamp": "2022-08-04 23:29:17",
      "score": 3,
      "num_children": 0,
      "author": 205816,
      "replies": []
    },
    {
      "id": "iizhmrt",
      "text": "I can’t wait to find this on best of Reddit updates",
      "timestamp": "2022-08-04 23:40:31",
      "score": 3,
      "num_children": 0,
      "author": 248721,
      "replies": []
    },
    {
      "id": "iizry14",
      "text": "Serious question….if you Google someone and look at their linked in but you aren’t logged in to your own linked in account, will they get a notification that it was you that checked out their profile? I recently looked at a guy Im interested in and I hope he doesn’t know i did. But if I wasn’t logged in, how would the site know it’s me?",
      "timestamp": "2022-08-05 00:57:21",
      "score": 3,
      "num_children": 1,
      "author": 302492,
      "replies": [
        {
          "id": "iiztg2x",
          "text": "If you are logged in or do it in incognito mode, linked in will not show them that you looked at their profile.",
          "timestamp": "2022-08-05 01:08:24",
          "score": 2,
          "num_children": 0,
          "author": 145476,
          "replies": []
        }
      ]
    },
    {
      "id": "iizwvry",
      "text": "This TIFU is cute af",
      "timestamp": "2022-08-05 01:33:58",
      "score": 3,
      "num_children": 0,
      "author": 164378,
      "replies": []
    },
    {
      "id": "ij04nmm",
      "text": "This is the beginning of love story. Anyway! Happy loving!",
      "timestamp": "2022-08-05 02:32:12",
      "score": 3,
      "num_children": 0,
      "author": 26890,
      "replies": []
    },
    {
      "id": "ij095fo",
      "text": "Great story",
      "timestamp": "2022-08-05 03:08:08",
      "score": 3,
      "num_children": 0,
      "author": 95051,
      "replies": []
    },
    {
      "id": "ij0l2cw",
      "text": "LinkedIn about to make an AD about this.",
      "timestamp": "2022-08-05 04:57:09",
      "score": 3,
      "num_children": 0,
      "author": 157626,
      "replies": []
    },
    {
      "id": "ij0y8kc",
      "text": "Goddamn has the word ghosting just been watered down to nothing huh",
      "timestamp": "2022-08-05 07:32:04",
      "score": 3,
      "num_children": 0,
      "author": 393350,
      "replies": []
    },
    {
      "id": "ij0yrvj",
      "text": "This is why you have them call or text you from their phone right away so you both know you have the correct number.",
      "timestamp": "2022-08-05 07:39:05",
      "score": 3,
      "num_children": 0,
      "author": 113929,
      "replies": []
    },
    {
      "id": "ij1juwg",
      "text": "Cybersecurity stalker? It worked so, a positive.",
      "timestamp": "2022-08-05 11:57:44",
      "score": 3,
      "num_children": 0,
      "author": 49326,
      "replies": []
    },
    {
      "id": "ij2orwn",
      "text": "You better invite us to the wedding.",
      "timestamp": "2022-08-05 16:48:16",
      "score": 3,
      "num_children": 0,
      "author": 195843,
      "replies": []
    },
    {
      "id": "iizhb2v",
      "text": "This is not what ghosting even is",
      "timestamp": "2022-08-04 23:38:08",
      "score": 18,
      "num_children": 1,
      "author": 72073,
      "replies": [
        {
          "id": "iizoyjr",
          "text": "What is it?",
          "timestamp": "2022-08-05 00:34:55",
          "score": -3,
          "num_children": 0,
          "author": 356012,
          "replies": []
        }
      ]
    },
    {
      "id": "ij0jcni",
      "text": "Happy for you it worked out but \"how dare he lead me on like this\"? you talked to him one night, a bit entitled he didn't owe you anything.",
      "timestamp": "2022-08-05 04:39:48",
      "score": 11,
      "num_children": 0,
      "author": 317778,
      "replies": []
    },
    {
      "id": "ij0a80v",
      "text": "Yeesh, this was hard to read.",
      "timestamp": "2022-08-05 03:17:14",
      "score": 4,
      "num_children": 2,
      "replies": [
        {
          "id": "ij0jwtm",
          "text": "Yeah, multiple red flags can do that to a story.",
          "timestamp": "2022-08-05 04:45:21",
          "score": 4,
          "num_children": 0,
          "author": 87136,
          "replies": []
        },
        {
          "id": "ij1btnx",
          "text": "I'm a little concerned with how many people find stalking to be wholesome.",
          "timestamp": "2022-08-05 10:32:12",
          "score": 1,
          "num_children": 0,
          "author": 109884,
          "replies": []
        }
      ]
    },
    {
      "id": "iize34r",
      "text": "Wait, LinkedIn shows people that viewed your profile?",
      "timestamp": "2022-08-04 23:14:38",
      "score": 3,
      "num_children": 1,
      "author": 22470,
      "replies": [
        {
          "id": "iizjrbg",
          "text": "yep",
          "timestamp": "2022-08-04 23:56:08",
          "score": 4,
          "num_children": 1,
          "author": 92296,
          "replies": [
            {
              "id": "iizjznr",
              "text": "Don't you need premium to see though?",
              "timestamp": "2022-08-04 23:57:53",
              "score": 1,
              "num_children": 1,
              "author": 22470,
              "replies": [
                {
                  "id": "iizofjo",
                  "text": "You can opt in to public viewing which alerts to you to being viewed by others with public view on. Or something along those lines",
                  "timestamp": "2022-08-05 00:30:58",
                  "score": 3,
                  "num_children": 0,
                  "author": 255801,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ij0hiho",
      "text": ">If you like someone, text them when you can. Life is too short to be with people half-interested in you.\n\nSo... Why didn't you text him? Did you not also have his number?",
      "timestamp": "2022-08-05 04:21:56",
      "score": 4,
      "num_children": 2,
      "author": 236474,
      "replies": [
        {
          "id": "ij0k7zq",
          "text": "In the story she gave hers but didn't say anything about getting his.",
          "timestamp": "2022-08-05 04:48:28",
          "score": 3,
          "num_children": 1,
          "author": 143426,
          "replies": [
            {
              "id": "ij0l8j4",
              "text": "Huh, I always give my number if someone gives me theirs.",
              "timestamp": "2022-08-05 04:58:54",
              "score": 1,
              "num_children": 1,
              "author": 236474,
              "replies": [
                {
                  "id": "ij0w5oz",
                  "text": "I should have definitely gotten his number as well! It was 4:00am, I had been drinking and was very tired because I’m not usually up that late.",
                  "timestamp": "2022-08-05 07:05:09",
                  "score": 2,
                  "num_children": 1,
                  "author": 85543,
                  "replies": [
                    {
                      "id": "ij2v9ee",
                      "text": "Haha, that's okay shit happens. Glad it worked out in the end!",
                      "timestamp": "2022-08-05 17:29:31",
                      "score": 1,
                      "num_children": 0,
                      "author": 236474,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ij0iveq",
          "text": "No?",
          "timestamp": "2022-08-05 04:35:06",
          "score": 0,
          "num_children": 0,
          "author": 46870,
          "replies": []
        }
      ]
    },
    {
      "id": "iiyxbl6",
      "text": "We expect a BORU post in a couple of weeks.",
      "timestamp": "2022-08-04 21:19:56",
      "score": 2,
      "num_children": 0,
      "author": 145941,
      "replies": []
    },
    {
      "id": "iiz7u5k",
      "text": "the most wholesome meet cute ! I love this! I am happy for you :-)",
      "timestamp": "2022-08-04 22:30:08",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iiz8faz",
      "text": "He will 100% see this post as well!",
      "timestamp": "2022-08-04 22:34:16",
      "score": 2,
      "num_children": 0,
      "author": 295983,
      "replies": []
    },
    {
      "id": "iize7x4",
      "text": "Wait, LinkedIn shows people that viewed your profile? Or is this guy paying for LinkedIn premium or something",
      "timestamp": "2022-08-04 23:15:34",
      "score": 2,
      "num_children": 0,
      "author": 22470,
      "replies": []
    },
    {
      "id": "iizf688",
      "text": "Wonderful story.  Hope it works out great for both of you.",
      "timestamp": "2022-08-04 23:22:27",
      "score": 2,
      "num_children": 0,
      "author": 282386,
      "replies": []
    },
    {
      "id": "iizfqh5",
      "text": "Pllllleeeeeaaaase update us after the date! This is the most wholesome thing I’ve ever read here. I hope your date goes amazingly OP!!",
      "timestamp": "2022-08-04 23:26:35",
      "score": 2,
      "num_children": 0,
      "author": 390583,
      "replies": []
    },
    {
      "id": "iizhm3o",
      "text": "That's why I always verify the number works if I'm ever receiving or giving mine out, just a quick text and you know you're good.",
      "timestamp": "2022-08-04 23:40:23",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iizlmrz",
      "text": "So if you look at a LinkedIn profile that person knows it?",
      "timestamp": "2022-08-05 00:10:07",
      "score": 2,
      "num_children": 2,
      "author": 85354,
      "replies": [
        {
          "id": "iizntm4",
          "text": "Yup. But the good news is that now you have a reason to reach out. Be bold! The worst they can say is no",
          "timestamp": "2022-08-05 00:26:24",
          "score": 1,
          "num_children": 0,
          "author": 401915,
          "replies": []
        },
        {
          "id": "iizqvks",
          "text": "If they pay for premium they know who looked, otherwise they just know that someone looked. That's at least how it was last I checked",
          "timestamp": "2022-08-05 00:49:21",
          "score": 1,
          "num_children": 0,
          "author": 367663,
          "replies": []
        }
      ]
    },
    {
      "id": "iiztwlw",
      "text": "Careful with you know....the pox",
      "timestamp": "2022-08-05 01:11:51",
      "score": 2,
      "num_children": 1,
      "author": 296814,
      "replies": [
        {
          "id": "ij048fk",
          "text": "Oh man, I laughed way too hard at this…",
          "timestamp": "2022-08-05 02:28:58",
          "score": 1,
          "num_children": 0,
          "author": 155426,
          "replies": []
        }
      ]
    },
    {
      "id": "iizv3hh",
      "text": "Japanese Light Novel title right here.",
      "timestamp": "2022-08-05 01:20:38",
      "score": 2,
      "num_children": 0,
      "author": 246001,
      "replies": []
    },
    {
      "id": "iizxzvx",
      "text": "You know we expect an up date now",
      "timestamp": "2022-08-05 01:42:01",
      "score": 2,
      "num_children": 0,
      "author": 213860,
      "replies": []
    },
    {
      "id": "ij00kfi",
      "text": "That’s so exciting and cute 🥹🥹🥹🥹",
      "timestamp": "2022-08-05 02:01:09",
      "score": 2,
      "num_children": 0,
      "author": 100438,
      "replies": []
    },
    {
      "id": "ij04k9n",
      "text": "The only thing you fucked up was giving him the wrong number. Looking him up worked out in the end.",
      "timestamp": "2022-08-05 02:31:29",
      "score": 2,
      "num_children": 0,
      "author": 193998,
      "replies": []
    },
    {
      "id": "ij088i5",
      "text": "Cute",
      "timestamp": "2022-08-05 03:00:29",
      "score": 2,
      "num_children": 0,
      "author": 304550,
      "replies": []
    },
    {
      "id": "ij08pww",
      "text": "Did the same. Have fun! Xo",
      "timestamp": "2022-08-05 03:04:30",
      "score": 2,
      "num_children": 0,
      "author": 401724,
      "replies": []
    },
    {
      "id": "ij08vdt",
      "text": "\"LinkedIn is not a dating site!\"\n\n- everyone on LinkedIn",
      "timestamp": "2022-08-05 03:05:46",
      "score": 2,
      "num_children": 0,
      "author": 361553,
      "replies": []
    },
    {
      "id": "ij0gc9l",
      "text": "I told you guys\nLinkedIn premium pays for itself!",
      "timestamp": "2022-08-05 04:11:02",
      "score": 2,
      "num_children": 0,
      "author": 329339,
      "replies": []
    },
    {
      "id": "ij0i6o5",
      "text": "One more lucky moment: you didn't disable the LinkedIn feature that notifies someone when you're viewing their profile.\n\nI won't say yay for happy endings, because that's premature. Instead, I'll simply hope the two of you will be sharing a multitude of happy endings in the near future!",
      "timestamp": "2022-08-05 04:28:23",
      "score": 2,
      "num_children": 0,
      "author": 44604,
      "replies": []
    },
    {
      "id": "ij0mbh9",
      "text": "Glad it turned out well. Have fun with the date!",
      "timestamp": "2022-08-05 05:10:09",
      "score": 2,
      "num_children": 0,
      "author": 146267,
      "replies": []
    },
    {
      "id": "ij0sijb",
      "text": "Sounds like you got lucky twice",
      "timestamp": "2022-08-05 06:19:56",
      "score": 2,
      "num_children": 1,
      "author": 413089,
      "replies": [
        {
          "id": "ij0sr12",
          "text": "Thrice if the date goes well",
          "timestamp": "2022-08-05 06:22:40",
          "score": 3,
          "num_children": 0,
          "author": 219250,
          "replies": []
        }
      ]
    },
    {
      "id": "ij0wrya",
      "text": "The night my (now) wife and I first kissed I have her my number, I was damn sure she was gonna text me cause... She kissed me, not the other way round. \n\nLike she full on lent in for the kiss, initiated it if you like. \n\nWell when I write a letter like i or a full stop I write them as smaller circles rather than a dot. Like a full stop circle. \n\nShe thought these were 0's... \n\nI gave her my iPhone to put her number into but she didn't know how to work them yet (this was iPhone 3g/3gs days). \n\nLuckily we saw each other the next day and well, the rest is history.\n\n(Yes, I did try find her on Facebook but her first name is spelt weird, thanks to my FIL...)",
      "timestamp": "2022-08-05 07:13:02",
      "score": 2,
      "num_children": 0,
      "author": 370024,
      "replies": []
    },
    {
      "id": "ij0wxig",
      "text": "Tread carefully OP. It could be nothing, or he could be setting you up for the dreaded GASLIGHT SUCCESIVE DOUBLE GHOST TECHNIQUE!!!!",
      "timestamp": "2022-08-05 07:15:01",
      "score": 2,
      "num_children": 0,
      "author": 63479,
      "replies": []
    },
    {
      "id": "ij10fvb",
      "text": "Enjoy your date :) He sounds like a good dude who really likes you.",
      "timestamp": "2022-08-05 08:01:11",
      "score": 2,
      "num_children": 0,
      "author": 155421,
      "replies": []
    },
    {
      "id": "ij11y51",
      "text": "This really should be a TIAFU - Today I Almost Fucked Up. lol\n\nHopefully things work out well for you two :)",
      "timestamp": "2022-08-05 08:21:15",
      "score": 2,
      "num_children": 0,
      "author": 232233,
      "replies": []
    },
    {
      "id": "ij15r9l",
      "text": "I did this with my girlfriend, gave her a completely wrong number for some unknown reason. We've been together 5 years now, I have to be very greatful she had a social media account.",
      "timestamp": "2022-08-05 09:13:01",
      "score": 2,
      "num_children": 0,
      "author": 58299,
      "replies": []
    },
    {
      "id": "ij163zl",
      "text": "I lost a guy's number for 6 weeks and felt awful for it as I was really into him. My hairdresser (where we met) managed to get his number for me and I apologized profusely once I text him. And now we're married!",
      "timestamp": "2022-08-05 09:17:47",
      "score": 2,
      "num_children": 0,
      "author": 329446,
      "replies": []
    },
    {
      "id": "ij17hbf",
      "text": "I think we can all agree that socializing is fucking hard.",
      "timestamp": "2022-08-05 09:36:11",
      "score": 2,
      "num_children": 0,
      "author": 151212,
      "replies": []
    },
    {
      "id": "ij1i20c",
      "text": "This is a great story to tell people when you're married (or together for a long time if you don't want to get married).",
      "timestamp": "2022-08-05 11:40:18",
      "score": 2,
      "num_children": 0,
      "author": 155581,
      "replies": []
    },
    {
      "id": "ij1q4ir",
      "text": ">Yikes! Now he'll know that I stalked him which made me feel even worse. >.< **I probably looked crazy.**\n\nEhmm...\n\n>Wednesday comes and I'm a mixture of angry and over it and insecure all at the same time. How dare he lead me on like this! ...**Well, I guess I'm glad I only wasted one night on this asshole....was I not pretty enough?** All these thoughts raced through my head and coalesced into **me typing his name and work place into Google to see if I can find him.**\n\nHahahahahaha\n\nGirl, you are crazy! but hey, at least you got the guy.",
      "timestamp": "2022-08-05 12:52:26",
      "score": 2,
      "num_children": 0,
      "author": 404020,
      "replies": []
    },
    {
      "id": "ij1wrvx",
      "text": "For the first time LinkedIn worked for the good of humanity.",
      "timestamp": "2022-08-05 13:43:29",
      "score": 2,
      "num_children": 0,
      "author": 222783,
      "replies": []
    },
    {
      "id": "ij26bpl",
      "text": "Where do I go to follow for updates on the impending nuptials?",
      "timestamp": "2022-08-05 14:49:05",
      "score": 2,
      "num_children": 0,
      "author": 239509,
      "replies": []
    },
    {
      "id": "ij2hu4q",
      "text": "you guys are getting married. All good marriages start with a fuck up.",
      "timestamp": "2022-08-05 16:03:54",
      "score": 2,
      "num_children": 1,
      "author": 263687,
      "replies": [
        {
          "id": "ij33kgb",
          "text": "But then again, so do all the bad ones, lol.",
          "timestamp": "2022-08-05 18:22:25",
          "score": 1,
          "num_children": 0,
          "author": 275567,
          "replies": []
        }
      ]
    },
    {
      "id": "ij2xd9c",
      "text": "And this kids, is how I met your father.",
      "timestamp": "2022-08-05 17:42:53",
      "score": 2,
      "num_children": 0,
      "author": 212467,
      "replies": []
    },
    {
      "id": "ij35ubz",
      "text": "If I ever had this many compliments I would probably be thrice divorced by now.",
      "timestamp": "2022-08-05 18:37:03",
      "score": 2,
      "num_children": 0,
      "author": 217755,
      "replies": []
    },
    {
      "id": "ij35y5t",
      "text": "I want my free award back if you guys aren’t getting married",
      "timestamp": "2022-08-05 18:37:45",
      "score": 2,
      "num_children": 0,
      "author": 72140,
      "replies": []
    },
    {
      "id": "ij39evu",
      "text": "Similar thing happened to my bf and me. But instead of my number being off by a digit, instead my phone wasn’t receiving his texts for some reason. Completely thought he was not interested, which made for an awkward night as we both were invited for movies at a mutual friends house. Few days later, I text him again as a last shot and he calls me. \n\nWe’ve been together for almost 6 years now. \n\nGood luck, OP! I hope it works out for y’all, please let us know how things go!",
      "timestamp": "2022-08-05 18:59:55",
      "score": 2,
      "num_children": 1,
      "author": 157839,
      "replies": [
        {
          "id": "ij3d7sb",
          "text": "It’s heartwarming to hear other mishap stories that went right! I shall update soon!",
          "timestamp": "2022-08-05 19:24:23",
          "score": 3,
          "num_children": 1,
          "author": 85543,
          "replies": [
            {
              "id": "im5b7kj",
              "text": "Is there an update now?",
              "timestamp": "2022-08-28 16:51:09",
              "score": 1,
              "num_children": 0,
              "author": 362173,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ij3iz5v",
      "text": "Had a one night stand with a coworker at a conference. The next morning, meet him at the coffee cart, where he tells me that he googled me and looked at my LinkedIn profile (cos I don’t have anything else public). I thought it was hilarious. \n\nThat was 8 years ago this month, and we’ve been married for 2 years. LinkedIn - making real connections!",
      "timestamp": "2022-08-05 20:01:35",
      "score": 2,
      "num_children": 0,
      "author": 101845,
      "replies": []
    },
    {
      "id": "ij3n2lp",
      "text": "THIS IS SO FUCKING CUTE!!!!! this reminds me of how i met my boyfriend ahhhhh i'm so happy for you two! i genuinely think this is the start of a beautiful relationship",
      "timestamp": "2022-08-05 20:28:22",
      "score": 2,
      "num_children": 0,
      "author": 30162,
      "replies": []
    },
    {
      "id": "ij3p10k",
      "text": "You made Newsweek.",
      "timestamp": "2022-08-05 20:41:22",
      "score": 2,
      "num_children": 0,
      "author": 38177,
      "replies": []
    },
    {
      "id": "ij6gfqf",
      "text": "LOL, it sounds like the plot of a romantic comedy.",
      "timestamp": "2022-08-06 12:40:19",
      "score": 2,
      "num_children": 0,
      "author": 77661,
      "replies": []
    },
    {
      "id": "ilb667m",
      "text": "girl that’s your future husband.",
      "timestamp": "2022-08-22 11:50:54",
      "score": 2,
      "num_children": 0,
      "author": 84702,
      "replies": []
    },
    {
      "id": "imwndai",
      "text": "We need an update!",
      "timestamp": "2022-09-03 09:16:56",
      "score": 2,
      "num_children": 0,
      "author": 260179,
      "replies": []
    },
    {
      "id": "ij0mk9n",
      "text": "[removed]",
      "timestamp": "2022-08-05 05:12:48",
      "score": 12,
      "num_children": 1,
      "replies": [
        {
          "id": "ij0y9e2",
          "text": "Literally just reverse the genders in this story and it immediately transforms from \"wholesome\" to \"neckbeard/niceguy\". Giant double standard. This is only acceptable because it is an attractive woman doing the pursuing.",
          "timestamp": "2022-08-05 07:32:22",
          "score": 9,
          "num_children": 0,
          "author": 202637,
          "replies": []
        }
      ]
    },
    {
      "id": "iiz1bfu",
      "text": "Isn't this the plot of \"The Others\" with Nicole Kidman?",
      "timestamp": "2022-08-04 21:46:04",
      "score": 6,
      "num_children": 1,
      "author": 264783,
      "replies": [
        {
          "id": "iizhbbo",
          "text": "What!? Lol",
          "timestamp": "2022-08-04 23:38:12",
          "score": 1,
          "num_children": 0,
          "author": 95730,
          "replies": []
        }
      ]
    },
    {
      "id": "ij0eiab",
      "text": "[removed]",
      "timestamp": "2022-08-05 03:54:22",
      "score": 4,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ij0zjqb",
      "text": "This is wholesome but I wonder would Reddit have taken as kindly if the genders would be reversed",
      "timestamp": "2022-08-05 07:49:08",
      "score": 3,
      "num_children": 0,
      "author": 54465,
      "replies": []
    },
    {
      "id": "ij0lo8r",
      "text": "A relationship based on stalking and obsession, this is bound to end well. /s  \n\n\nI'll be hoping for the best, but waiting for you on \"Twoxchromosomes\" when this doesn't work out. Swap the genders here, and tell me with a straight face this story is appropriate.",
      "timestamp": "2022-08-05 05:03:25",
      "score": 5,
      "num_children": 2,
      "author": 325094,
      "replies": [
        {
          "id": "ij0ybez",
          "text": "😂",
          "timestamp": "2022-08-05 07:33:07",
          "score": -1,
          "num_children": 0,
          "author": 202637,
          "replies": []
        },
        {
          "id": "ij3wtxi",
          "text": "Lol that is funny. People had a genuine connection and she just checked his public profile. This is probably why you are lonely and harassing people on reddit",
          "timestamp": "2022-08-05 21:33:48",
          "score": 0,
          "num_children": 0,
          "author": 245002,
          "replies": []
        }
      ]
    },
    {
      "id": "iiytwgc",
      "text": "Ooooh exciting! Good luck!",
      "timestamp": "2022-08-04 20:57:44",
      "score": 3,
      "num_children": 0,
      "author": 392560,
      "replies": []
    },
    {
      "id": "ij0qnny",
      "text": "Stalker",
      "timestamp": "2022-08-05 05:58:18",
      "score": 2,
      "num_children": 0,
      "author": 358311,
      "replies": []
    },
    {
      "id": "ij0yit2",
      "text": "Women ☕ /s",
      "timestamp": "2022-08-05 07:35:47",
      "score": 2,
      "num_children": 0,
      "author": 232996,
      "replies": []
    },
    {
      "id": "ij2jcah",
      "text": "I have a really similar story! I used to work as a bouncer. One night, a girl came up to me and started talking. The owner was beside me, so I needed to keep it short. She took my phone and added her number. Over the next several days I tried texting her, but never received a response. I found her on Facebook, liked a couple pictures. She eventually called me out and said something along the lines of, \"are you ever going to reach out or just keep looking my pictures?\". Turns out the number same gave me was one digit off. We've been dating for 6 years, have a daughter together, and are finally engaged. \n\nTLDR: Congrats on the future engagement OP!",
      "timestamp": "2022-08-05 16:13:39",
      "score": 2,
      "num_children": 0,
      "author": 147116,
      "replies": []
    },
    {
      "id": "ij0tt0s",
      "text": "Its interesting that the guy turned into an asshole for not calling back, if u made the effort of getting his number and call him instead this wouldnt happened",
      "timestamp": "2022-08-05 06:35:28",
      "score": 1,
      "num_children": 0,
      "author": 191033,
      "replies": []
    },
    {
      "id": "ij16mcb",
      "text": "Some girl who has a phone number different by one digit from mine keeps doing that to people and I end up having to explain myself. One lady (I think it was her relative) once claimed I stole the phone and berated me for what felt like half an hour. My point is, I hate you both :D",
      "timestamp": "2022-08-05 09:24:34",
      "score": 1,
      "num_children": 0,
      "author": 7294,
      "replies": []
    },
    {
      "id": "ij0p9yt",
      "text": "This is just absolutely wholesome story IP. I really hope the first date goes amazing. Good luck to you!!!",
      "timestamp": "2022-08-05 05:42:33",
      "score": 0,
      "num_children": 0,
      "author": 277942,
      "replies": []
    },
    {
      "id": "ij0e12g",
      "text": "Posts in TODAY I Fucked Up, are almost NEVER \"today\"",
      "timestamp": "2022-08-05 03:50:01",
      "score": -2,
      "num_children": 1,
      "author": 196142,
      "replies": [
        {
          "id": "ij3udc4",
          "text": "Just think about it as time I fucked up",
          "timestamp": "2022-08-05 21:16:58",
          "score": 1,
          "num_children": 0,
          "author": 245002,
          "replies": []
        }
      ]
    },
    {
      "id": "iizbzkx",
      "text": "\"Dozen of couple different jobs by 30\" ???\n\nThat's ... not a good start. I'd not hire someone that has 1 job ever year.",
      "timestamp": "2022-08-04 22:59:29",
      "score": -12,
      "num_children": 2,
      "author": 253881,
      "replies": [
        {
          "id": "iizeh49",
          "text": "Could've worked multiple jobs part time at some points. Might have taken on a few short term summer jobs when younger too. Also the poster said mid thirties (which probably means late thirties because of how people are lol).",
          "timestamp": "2022-08-04 23:17:25",
          "score": 1,
          "num_children": 0,
          "author": 401893,
          "replies": []
        },
        {
          "id": "iizhkcx",
          "text": "I'm sure you're hiring the best and the brightest with those very flexible standards",
          "timestamp": "2022-08-04 23:40:02",
          "score": -2,
          "num_children": 2,
          "replies": [
            {
              "id": "iizw2n2",
              "text": "I've interviewed 8 PHDs in the last 4 weeks, so... yes.",
              "timestamp": "2022-08-05 01:27:53",
              "score": -5,
              "num_children": 1,
              "author": 253881,
              "replies": [
                {
                  "id": "ij2h62u",
                  "text": "Yup. Bet none of them will work for you too. If they do, they'll hate you.",
                  "timestamp": "2022-08-05 15:59:38",
                  "score": 0,
                  "num_children": 1,
                  "author": 304674,
                  "replies": [
                    {
                      "id": "ij48zkw",
                      "text": "Keep justifying your own world.\n\nNo complaints so far and I've, unfortunately, promoted quite a few that have gone upwards and onwards and still gotten 'thank you's' from them.",
                      "timestamp": "2022-08-05 23:00:46",
                      "score": 1,
                      "num_children": 0,
                      "author": 253881,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ij0jv8r",
              "text": "the best and brightest stay at a job for a least a year ..",
              "timestamp": "2022-08-05 04:44:55",
              "score": -2,
              "num_children": 0,
              "author": 412753,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "iiyzlf5",
      "text": "This is what I choose to believe happened with every girl I ever gave my number to 😂👍",
      "timestamp": "2022-08-04 21:34:47",
      "score": 1,
      "num_children": 0,
      "author": 110503,
      "replies": []
    },
    {
      "id": "iiz77ik",
      "text": "I'm going to post this story on every 'LinkedIN is not a dating service' post I see.",
      "timestamp": "2022-08-04 22:25:44",
      "score": 1,
      "num_children": 0,
      "author": 281893,
      "replies": []
    },
    {
      "id": "iiz8ydu",
      "text": "Giving me false hope on a guy that ghosted me, rip. Cute story though!!",
      "timestamp": "2022-08-04 22:37:59",
      "score": 1,
      "num_children": 0,
      "author": 188556,
      "replies": []
    },
    {
      "id": "iizb3mf",
      "text": "Universe is taking you to the right timeline",
      "timestamp": "2022-08-04 22:53:06",
      "score": 1,
      "num_children": 0,
      "author": 219720,
      "replies": []
    },
    {
      "id": "iizba02",
      "text": "Sometimes the world turns and the sun shines on just the right place. Grab that luck and run with it.",
      "timestamp": "2022-08-04 22:54:21",
      "score": 1,
      "num_children": 0,
      "author": 256027,
      "replies": []
    },
    {
      "id": "iizbixs",
      "text": "Good luck!",
      "timestamp": "2022-08-04 22:56:10",
      "score": 1,
      "num_children": 0,
      "author": 375205,
      "replies": []
    },
    {
      "id": "iizbn3r",
      "text": "Nice try LinkedIn but no one is going to think of you as the new Tinder.",
      "timestamp": "2022-08-04 22:57:00",
      "score": 1,
      "num_children": 0,
      "author": 185567,
      "replies": []
    },
    {
      "id": "iizc09g",
      "text": "This is why I always take their phone and call myself or have them take their phone and call me, soooooo much easier.\n\nBut hey, this guy DEFINITELY likes you a lot if he did all that. You must have really made a great first impression.",
      "timestamp": "2022-08-04 22:59:37",
      "score": 1,
      "num_children": 0,
      "author": 186758,
      "replies": []
    },
    {
      "id": "iizc39j",
      "text": "Well that’s good",
      "timestamp": "2022-08-04 23:00:13",
      "score": 1,
      "num_children": 0,
      "author": 64966,
      "replies": []
    },
    {
      "id": "iizc4fu",
      "text": "I’m going to need a follow up post because this is adorable. I need this.",
      "timestamp": "2022-08-04 23:00:26",
      "score": 1,
      "num_children": 0,
      "author": 300344,
      "replies": []
    },
    {
      "id": "iizc75u",
      "text": "Plot twist in a few yrs- go to get married, she tells him the wrong date",
      "timestamp": "2022-08-04 23:00:58",
      "score": 1,
      "num_children": 0,
      "author": 302677,
      "replies": []
    },
    {
      "id": "iizc9v2",
      "text": "Best of luck!!!",
      "timestamp": "2022-08-04 23:01:30",
      "score": 1,
      "num_children": 0,
      "author": 82090,
      "replies": []
    },
    {
      "id": "iizd2el",
      "text": "YES YES YES OP this isn't a fuck up, it's fate. Have a great date you two! <3",
      "timestamp": "2022-08-04 23:07:12",
      "score": 1,
      "num_children": 0,
      "author": 289998,
      "replies": []
    },
    {
      "id": "iizdazd",
      "text": "Little bit of wholesome stalking never hurt anyone....\n\n  \n\n\nJokes aside, congrats! That's a great icebreaker lol",
      "timestamp": "2022-08-04 23:08:57",
      "score": 1,
      "num_children": 0,
      "author": 95031,
      "replies": []
    },
    {
      "id": "iizddrs",
      "text": "Yay! Date time!",
      "timestamp": "2022-08-04 23:09:30",
      "score": 1,
      "num_children": 0,
      "author": 353484,
      "replies": []
    },
    {
      "id": "iizdudw",
      "text": "My ignorance of LinkedIn telling you who’s looked at your profile, plus some not-so-secret stalking of a person, kicked off a relationship that led to me wife-ing that person. \n\nWe now have a cat, a dog, and a baby together. Good luck to you both and I am glad you stalked.",
      "timestamp": "2022-08-04 23:12:52",
      "score": 1,
      "num_children": 0,
      "author": 43042,
      "replies": []
    },
    {
      "id": "iize5px",
      "text": "Remember kids, give a call or text immediately when exchanging numbers",
      "timestamp": "2022-08-04 23:15:08",
      "score": 1,
      "num_children": 0,
      "author": 173089,
      "replies": []
    },
    {
      "id": "iizefo1",
      "text": "HAHAH I love thjs",
      "timestamp": "2022-08-04 23:17:07",
      "score": 1,
      "num_children": 0,
      "author": 273249,
      "replies": []
    },
    {
      "id": "iizg6w9",
      "text": "I love this. Good luck.",
      "timestamp": "2022-08-04 23:29:54",
      "score": 1,
      "num_children": 0,
      "author": 162526,
      "replies": []
    },
    {
      "id": "iizgbtx",
      "text": "I love this so much.",
      "timestamp": "2022-08-04 23:30:55",
      "score": 1,
      "num_children": 0,
      "author": 36702,
      "replies": []
    },
    {
      "id": "iizgfos",
      "text": "OP for real keep us updated. This is the most adorable thing I've seen on reddit in a long time, and 25% of my subreddits are puppies.",
      "timestamp": "2022-08-04 23:31:41",
      "score": 1,
      "num_children": 0,
      "author": 341019,
      "replies": []
    },
    {
      "id": "iizgs2e",
      "text": "Thoughts of a fool's kinda careless\n\nJust a fool waitin' on the wrong block",
      "timestamp": "2022-08-04 23:34:12",
      "score": 1,
      "num_children": 0,
      "author": 176787,
      "replies": []
    },
    {
      "id": "iizgtn2",
      "text": "When me and my partner got setup by our best friends (who were a couple), I was over at his place and went on a calm rant about how I'm thinking of starting to date again. My best friend's partner says \"You and Meg should date\" and we both shyly smiled and ignored the question.\nIt was five minutes later that she said \"we'll leave you two alone to get acquainted\" and within 3mins of getting closer and flirting, she took me to a more quiet place and we got acquainted.\nIt was afterwards that we started talking and I felt incredibly comfortable around her. She added me on facebook and my phone was dead, so I said I would do it in the morning.\n\nThe morning comes and she's getting in her car to go leave. She asks me if I accepted her friend request and I go \"no, I forgot\" and she took that as a \"no I won't\". I had to clarify that my adhd arse forgets things and that I would have seen it eventually and accepted straight away.\nThree weeks go by and she messages me, because my adhd arse forgot to hit the send button before I did some laundry or something, I thought she was ghosting me lmao.\nWe laughed about it on our first date, and we went from constantly getting acquainted to becoming best friends. I can tell her anything, and she has made me a better person.\n\nI hope everything works out for you OP",
      "timestamp": "2022-08-04 23:34:31",
      "score": 1,
      "num_children": 0,
      "author": 23092,
      "replies": []
    },
    {
      "id": "iizh7iv",
      "text": "Had a girl pull this exact thing on me. Lol we dated for a year plus, still buddies. Just didn't work out, good luck!",
      "timestamp": "2022-08-04 23:37:24",
      "score": 1,
      "num_children": 0,
      "author": 383707,
      "replies": []
    },
    {
      "id": "iizj1hv",
      "text": "My girlfriend and I did the same thing, I texted her IMMEDIATELY when we parted ways after she put her number in my phone. Nothing, nothing, nothing. Finally searched her on fb and thought, what the hell, worst case I get DOUBLE ghosted for being a creep. Nope, turns out she just fumbled her fingers when typing it in and was kicking herself lol.",
      "timestamp": "2022-08-04 23:50:49",
      "score": 1,
      "num_children": 0,
      "author": 339200,
      "replies": []
    },
    {
      "id": "iizjsy4",
      "text": "I'm gonna be the Debbie Downer and say that a good meet cute does not always mean a higher power is involved. I hope you genuinely enjoy and care about each other before things progress.\n\nAnd good luck!",
      "timestamp": "2022-08-04 23:56:29",
      "score": 1,
      "num_children": 0,
      "author": 51737,
      "replies": []
    },
    {
      "id": "iizjt5v",
      "text": "This is why, if you're actually interested, one of you actually calls or texts the other in person, to make sure both parties have the correct info.",
      "timestamp": "2022-08-04 23:56:32",
      "score": 1,
      "num_children": 0,
      "author": 299097,
      "replies": []
    },
    {
      "id": "iizkeyv",
      "text": "Aren't you just about to get married? You do an awful amount of posting in relation to getting married...\n\nAnd you got a prenup? Lamo",
      "timestamp": "2022-08-05 00:01:03",
      "score": 1,
      "num_children": 0,
      "author": 190192,
      "replies": []
    },
    {
      "id": "iizkj5k",
      "text": "This is so cute, I hope it goes well because this is an amazing story to tell others some day!",
      "timestamp": "2022-08-05 00:01:54",
      "score": 1,
      "num_children": 0,
      "author": 254041,
      "replies": []
    },
    {
      "id": "iizkyup",
      "text": "This is so cute!!! Awh!!",
      "timestamp": "2022-08-05 00:05:12",
      "score": 1,
      "num_children": 0,
      "author": 124165,
      "replies": []
    },
    {
      "id": "iizkzxh",
      "text": "Have done this myself before, usually am too mortified and just cut off all communication with the other person before I make a bigger fool of myself",
      "timestamp": "2022-08-05 00:05:25",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iiznflt",
      "text": "Hold up, you're going to well attended house parties that last until 4am in your mid 30s?!?!\n\nHow?!",
      "timestamp": "2022-08-05 00:23:31",
      "score": 1,
      "num_children": 0,
      "author": 159120,
      "replies": []
    },
    {
      "id": "iizngpt",
      "text": "Oof, thank god I dont have a linkdin. Ive done some creeping. that would be awkward lol",
      "timestamp": "2022-08-05 00:23:44",
      "score": 1,
      "num_children": 0,
      "author": 174591,
      "replies": []
    },
    {
      "id": "iizofb7",
      "text": "omg goodluck!!! this story is so cute!",
      "timestamp": "2022-08-05 00:30:54",
      "score": 1,
      "num_children": 0,
      "author": 37511,
      "replies": []
    },
    {
      "id": "iizojg1",
      "text": "LinkedIn is the WORST if you are trying to stalk - lol..but in this scenario, that was absolutely a perfect move!! Best of luck!!",
      "timestamp": "2022-08-05 00:31:47",
      "score": 1,
      "num_children": 0,
      "author": 227430,
      "replies": []
    },
    {
      "id": "iizonic",
      "text": "Why am I so invested in this?\n\nGo get him.",
      "timestamp": "2022-08-05 00:32:37",
      "score": 1,
      "num_children": 0,
      "author": 98003,
      "replies": []
    },
    {
      "id": "iizoumb",
      "text": "Time you delayed a happy result. No harm, no foul.",
      "timestamp": "2022-08-05 00:34:06",
      "score": 1,
      "num_children": 0,
      "author": 291477,
      "replies": []
    },
    {
      "id": "iizov31",
      "text": "You should listen to the song Expiration Dating by Future Teens. It's this story but in music form.",
      "timestamp": "2022-08-05 00:34:12",
      "score": 1,
      "num_children": 0,
      "author": 297379,
      "replies": []
    },
    {
      "id": "iizozwi",
      "text": "This actually happened to me with a now ex. She gave me the wrong number and saved it herself. We were drunk at the time one digit was off. \n\nThe person flirted with me as a joke for a hot minute (texting) and then told me I had the wrong number and wished me luck. An 8 was a 9 and I figured it out myself. \n\nSadly she did this with everyone and the dude let me know she was cheating a year later but hey. Made a solid rando text friend for the limited interaction.",
      "timestamp": "2022-08-05 00:35:13",
      "score": 1,
      "num_children": 0,
      "author": 113759,
      "replies": []
    },
    {
      "id": "iizp77m",
      "text": "That is an adorable story. Have fun on your date! I hope it works out in the long run - it seems like you are both into each other.",
      "timestamp": "2022-08-05 00:36:44",
      "score": 1,
      "num_children": 0,
      "author": 239101,
      "replies": []
    },
    {
      "id": "iizpbf6",
      "text": "This story is so similar to how me and my boo met 7 years ago! we’re tying the knot next month :)",
      "timestamp": "2022-08-05 00:37:36",
      "score": 1,
      "num_children": 0,
      "author": 103801,
      "replies": []
    },
    {
      "id": "iizple4",
      "text": "And this is why women should also take numbers haha",
      "timestamp": "2022-08-05 00:39:42",
      "score": 1,
      "num_children": 0,
      "author": 370074,
      "replies": []
    },
    {
      "id": "iizpwhd",
      "text": "This is kinda sweet actually lol",
      "timestamp": "2022-08-05 00:42:01",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iizqeej",
      "text": "need updates",
      "timestamp": "2022-08-05 00:45:45",
      "score": 1,
      "num_children": 0,
      "author": 281674,
      "replies": []
    },
    {
      "id": "iizqeo6",
      "text": "Sounds like today you scored. Good luck. Have fun!",
      "timestamp": "2022-08-05 00:45:48",
      "score": 1,
      "num_children": 0,
      "author": 168260,
      "replies": []
    },
    {
      "id": "iizqews",
      "text": "This is why you make sure they can text you, if this is a number you want to text.",
      "timestamp": "2022-08-05 00:45:51",
      "score": 1,
      "num_children": 0,
      "author": 174370,
      "replies": []
    },
    {
      "id": "iizr4kg",
      "text": "Cute story ! 🥰",
      "timestamp": "2022-08-05 00:51:14",
      "score": 1,
      "num_children": 0,
      "author": 112095,
      "replies": []
    },
    {
      "id": "iizrvfn",
      "text": "One of my best friends met his wife in a somewhat similar fashion. He met her at a club and had given her his number to call so he would have hers. He found out the next day his phone was dead in his pocket and he didn’t have her number.\n\nAfter an hour or so of telling him to just look her up on Facebook, including backup from my girlfriend at the time that if she was trying to call him she wanted him to have his number. He ended up finally doing it, they reconnected and now they just had their second kid and have been married for about 5 years. \n\nGood on you for your LinkedIn stalking, and best of luck to both of you!!",
      "timestamp": "2022-08-05 00:56:49",
      "score": 1,
      "num_children": 0,
      "author": 119479,
      "replies": []
    },
    {
      "id": "iizrvqp",
      "text": "You can disable people seeing that you visited their profile, for future reference. It's in privacy settings\n\nThe caveat is that you no longer are able to tell other than company&position of who has visited you, but really that's all the info you want anyway",
      "timestamp": "2022-08-05 00:56:53",
      "score": 1,
      "num_children": 0,
      "author": 28543,
      "replies": []
    },
    {
      "id": "iizrwz7",
      "text": "Reminds me of chatting with a guy all night, getting his number, then drunkenly deleting it instead of saving it 😒",
      "timestamp": "2022-08-05 00:57:08",
      "score": 1,
      "num_children": 0,
      "author": 13776,
      "replies": []
    },
    {
      "id": "iizs379",
      "text": "\"Accidentally\" clicked on his LinkedIn profile :P",
      "timestamp": "2022-08-05 00:58:25",
      "score": 1,
      "num_children": 1,
      "author": 347666,
      "replies": [
        {
          "id": "iizw0cv",
          "text": "Happened to me way too many times. All I want to check on my ex colleagues and school mates",
          "timestamp": "2022-08-05 01:27:25",
          "score": 1,
          "num_children": 0,
          "author": 283298,
          "replies": []
        }
      ]
    },
    {
      "id": "iizs5k0",
      "text": "Always text ur name to pretty girl as soon as u get her digits, she won't forget u and u know u got the right number (either on purpose or mistakenly)",
      "timestamp": "2022-08-05 00:58:54",
      "score": 1,
      "num_children": 0,
      "author": 144661,
      "replies": []
    },
    {
      "id": "iizsloi",
      "text": "Love it! It's incredible tho how easy it is for some people to find someone",
      "timestamp": "2022-08-05 01:02:11",
      "score": 1,
      "num_children": 0,
      "author": 401706,
      "replies": []
    },
    {
      "id": "iizsmla",
      "text": "What does that have to do with anything?",
      "timestamp": "2022-08-05 01:02:23",
      "score": 1,
      "num_children": 0,
      "author": 409711,
      "replies": []
    },
    {
      "id": "iizssj2",
      "text": "This is why whenever I get a girls number I text them immediately while they're still next to me. I've never understood the logic of waiting to talk to someone, if a pretty girl seems like she might be genuinely interested in me or is at least dtf then I'm trying to get that ball rolling asap",
      "timestamp": "2022-08-05 01:03:35",
      "score": 1,
      "num_children": 0,
      "author": 169164,
      "replies": []
    },
    {
      "id": "iizt356",
      "text": "Good luck girl. Hope it works out for both of you. 😁",
      "timestamp": "2022-08-05 01:05:42",
      "score": 1,
      "num_children": 0,
      "author": 173775,
      "replies": []
    },
    {
      "id": "iiztcow",
      "text": "LinkedIn = new tinder",
      "timestamp": "2022-08-05 01:07:41",
      "score": 1,
      "num_children": 0,
      "author": 398443,
      "replies": []
    },
    {
      "id": "iiztdhf",
      "text": "As it turned out, u/scifisquirrel really just wanted his nuts.  It was awkward.",
      "timestamp": "2022-08-05 01:07:51",
      "score": 1,
      "num_children": 0,
      "author": 369583,
      "replies": []
    },
    {
      "id": "iizuv6a",
      "text": "this will make an amazing story if things go further in the relationship",
      "timestamp": "2022-08-05 01:18:58",
      "score": 1,
      "num_children": 0,
      "author": 149430,
      "replies": []
    },
    {
      "id": "iizvn17",
      "text": "Stupid bitch 😭",
      "timestamp": "2022-08-05 01:24:37",
      "score": 1,
      "num_children": 0,
      "author": 73378,
      "replies": []
    },
    {
      "id": "iizvs5n",
      "text": "Update us when you guys are getting married!! Seems like it was meant to be!",
      "timestamp": "2022-08-05 01:25:42",
      "score": 1,
      "num_children": 0,
      "author": 279839,
      "replies": []
    },
    {
      "id": "iizvtju",
      "text": "> are talking about their cool Raya dates\n\nCan someone explain this? I seem to have gotten too old to keep up with what the young ones are doing these days.",
      "timestamp": "2022-08-05 01:25:59",
      "score": 1,
      "num_children": 0,
      "author": 187900,
      "replies": []
    },
    {
      "id": "iizw6gz",
      "text": "Yay, congrats! Will be a great story to tell your kids one day.",
      "timestamp": "2022-08-05 01:28:42",
      "score": 1,
      "num_children": 0,
      "author": 195322,
      "replies": []
    },
    {
      "id": "iizwj5r",
      "text": "This is adorable, good luck OP!",
      "timestamp": "2022-08-05 01:31:19",
      "score": 1,
      "num_children": 0,
      "author": 107276,
      "replies": []
    },
    {
      "id": "iizyd8k",
      "text": "Im squealing. Excited for u both",
      "timestamp": "2022-08-05 01:44:46",
      "score": 1,
      "num_children": 0,
      "author": 315696,
      "replies": []
    },
    {
      "id": "iizyeoc",
      "text": "How does one not, when given a phone number for the very first time, send a quick text message to said number therby the receiving party can confirm the text went to the right number and also they now have the sender's number????\n\nFricking rookies out there STILL not knowing how to play the game, i tells ya.",
      "timestamp": "2022-08-05 01:45:03",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iizylz4",
      "text": "This post is an ad for Raya",
      "timestamp": "2022-08-05 01:46:34",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iizz5bk",
      "text": "Now this is wholesome",
      "timestamp": "2022-08-05 01:50:31",
      "score": 1,
      "num_children": 0,
      "author": 153949,
      "replies": []
    },
    {
      "id": "iizzt7k",
      "text": "Raya dates 👀\n\nIsn’t that like rich people dating? 💎☠️",
      "timestamp": "2022-08-05 01:55:31",
      "score": 1,
      "num_children": 0,
      "author": 235883,
      "replies": []
    },
    {
      "id": "iizzxe1",
      "text": "I really wish you the best n you guys end up happy together .Good Luck 😁",
      "timestamp": "2022-08-05 01:56:24",
      "score": 1,
      "num_children": 0,
      "author": 56557,
      "replies": []
    },
    {
      "id": "ij00nek",
      "text": "He probably got really confused when he kept getting Kramer",
      "timestamp": "2022-08-05 02:01:45",
      "score": 1,
      "num_children": 0,
      "author": 119251,
      "replies": []
    },
    {
      "id": "ij01exq",
      "text": "You are required to post a follow up to this since it’s so damn cute!",
      "timestamp": "2022-08-05 02:07:29",
      "score": 1,
      "num_children": 0,
      "author": 364823,
      "replies": []
    },
    {
      "id": "ij01lgn",
      "text": "Good luck redditor hope you found your person",
      "timestamp": "2022-08-05 02:08:52",
      "score": 1,
      "num_children": 0,
      "author": 124768,
      "replies": []
    },
    {
      "id": "ij01prb",
      "text": ">\tI’m a mixture of angry and over it and insecure all at the same time\n\nDamn I wish I didn’t know this feeling so well.",
      "timestamp": "2022-08-05 02:09:47",
      "score": 1,
      "num_children": 0,
      "author": 261368,
      "replies": []
    },
    {
      "id": "ij01s5s",
      "text": "Good luck OP! May you find immense happiness with this person",
      "timestamp": "2022-08-05 02:10:18",
      "score": 1,
      "num_children": 0,
      "author": 73531,
      "replies": []
    },
    {
      "id": "ij026z4",
      "text": "The way I see it, It didn't work the way you meant it to but, the outcome was what you wanted though. Hope you two work out and have a happy life. Reading this whole thing actually puts a smile on my face.",
      "timestamp": "2022-08-05 02:13:26",
      "score": 1,
      "num_children": 0,
      "author": 237322,
      "replies": []
    },
    {
      "id": "ij02j7w",
      "text": "I almost didn't read this cause I could feel a bad ending coming. So glad it's a happy one!",
      "timestamp": "2022-08-05 02:16:03",
      "score": 1,
      "num_children": 0,
      "author": 334100,
      "replies": []
    },
    {
      "id": "ij034y3",
      "text": "Careful, this is exactly how my wife and I met 19 years ago 😁",
      "timestamp": "2022-08-05 02:20:34",
      "score": 1,
      "num_children": 0,
      "author": 29849,
      "replies": []
    },
    {
      "id": "ij03802",
      "text": "Ahhhh this is so cute. Reminds me of when I gave my ex the wrong number. Thought he was rude to ask for it then never text or call, lol. He managed to find me and call me out on not responding so I realized my mistake. We had a laugh about it and ended up dating for a year and are still friends.",
      "timestamp": "2022-08-05 02:21:13",
      "score": 1,
      "num_children": 0,
      "author": 293810,
      "replies": []
    },
    {
      "id": "ij039mg",
      "text": "LinkedIn DM date is so thirties",
      "timestamp": "2022-08-05 02:21:33",
      "score": 1,
      "num_children": 0,
      "author": 332088,
      "replies": []
    },
    {
      "id": "ij03i8z",
      "text": "Wtf is a Raya date?",
      "timestamp": "2022-08-05 02:23:23",
      "score": 1,
      "num_children": 0,
      "author": 279015,
      "replies": []
    },
    {
      "id": "ij03m3m",
      "text": "Wait. What?. People can tell if you looked at their profile on linkdin?",
      "timestamp": "2022-08-05 02:24:12",
      "score": 1,
      "num_children": 0,
      "author": 226508,
      "replies": []
    },
    {
      "id": "ij03q05",
      "text": "Well this is cool. Let me know what the update is.",
      "timestamp": "2022-08-05 02:25:02",
      "score": 1,
      "num_children": 0,
      "author": 222616,
      "replies": []
    },
    {
      "id": "ij03sbi",
      "text": "I’m really happy it worked out for you.",
      "timestamp": "2022-08-05 02:25:30",
      "score": 1,
      "num_children": 0,
      "author": 205477,
      "replies": []
    },
    {
      "id": "ij04fcx",
      "text": "The most wholesome part to me is that he immediately reached out in the first place, and then despite what he may have been thinking after being ghosted found her on LinkedIn and immediately reached out. Best of luck to you guys!",
      "timestamp": "2022-08-05 02:30:27",
      "score": 1,
      "num_children": 0,
      "author": 295329,
      "replies": []
    },
    {
      "id": "ij05scq",
      "text": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
      "timestamp": "2022-08-05 02:40:59",
      "score": 1,
      "num_children": 0,
      "author": 228165,
      "replies": []
    },
    {
      "id": "ij06grr",
      "text": "this was a cute and heart warming read. just pleasant",
      "timestamp": "2022-08-05 02:46:20",
      "score": 1,
      "num_children": 0,
      "author": 186541,
      "replies": []
    },
    {
      "id": "ij07k2h",
      "text": "Dude. I hope the date goes well!",
      "timestamp": "2022-08-05 02:55:00",
      "score": 1,
      "num_children": 0,
      "author": 144471,
      "replies": []
    },
    {
      "id": "ij07rv2",
      "text": "This sounds like one big ad for raya",
      "timestamp": "2022-08-05 02:56:46",
      "score": 1,
      "num_children": 0,
      "author": 105752,
      "replies": []
    },
    {
      "id": "ij08f19",
      "text": "Aaaawwwwee. I love this for you guys. Good luck!",
      "timestamp": "2022-08-05 03:01:58",
      "score": 1,
      "num_children": 0,
      "author": 261857,
      "replies": []
    },
    {
      "id": "ij08rr9",
      "text": "I used to be SO bad at saying no to people when they would ask for my number , that I decided to just swap the last digit and give them that instead. One day I gave a guy my number( I was into this one!) and accidentally changed the last digit out of habit. He texts the number and then sends me a snapchat message about how fucked up it was to give him a wrong number. Turns out, the person responded to him kind of pissed off because they kept receiving texts asking for a girl with my name. I was mortified. I dont know how many guys must have reached out to this poor man looking for me! I ended up texting this stranger, apologizing and never doing it again.\n\nPs- loved your story and how you described this man you met. Hoping you have the BEST first date EVER",
      "timestamp": "2022-08-05 03:04:56",
      "score": 1,
      "num_children": 0,
      "author": 189794,
      "replies": []
    },
    {
      "id": "ij09nwo",
      "text": "Oh you two are definitely gonna end up LinkedIN",
      "timestamp": "2022-08-05 03:12:29",
      "score": 1,
      "num_children": 0,
      "author": 367921,
      "replies": []
    },
    {
      "id": "ij0au2s",
      "text": "So this reminds me of something I did with LinkedIn. \n\nWhen I got my first adult job after college, I was on LinkedIn the one day. Seen this one girl who I thought was cute, hence why I added her. She had a mutual connection as that was a coworker at work who got me in there in the first place. My friend texts me a day or so later and says something in the context of “I was weird for adding her,” coming from her to him. \n\nA few months go by, and Im leaving work. I see my buddy coming with that girl beside him as she’s in a rush to catch the train. He briefly introduces me to her. \n\nA few weeks go by, and there’s a work lunch party. At the time I had finally started going to a barber to get my haircut professionally. Well at the party I notice her looking at me. Didn’t think much of it, but knew something was up. About a week or two after that party, she messages me on Skype out of the blue. We end up getting to know one another. \n\nNothing much came out of that until last year when we started hanging outside of work. By then I had moved on from the company. We met a couple times whether it was her and I or mutual friends who would join us. Things ended up changing around July 4th as she ended up meeting her current boyfriend at a party while I was away at a wedding I was in. \n\nI was bummed once I officially knew something was up weeks later after she met my friend and I late one night in the city. We still talk these days as just friends, but not as often as we once did. Sadly I’ll never really know how she felt about me as she was one of a select number of girls I’ve met in life who have had an interest in the stuff I do. Woe is me:/",
      "timestamp": "2022-08-05 03:22:23",
      "score": 1,
      "num_children": 1,
      "author": 386677,
      "replies": [
        {
          "id": "ij0fr31",
          "text": "Bummer",
          "timestamp": "2022-08-05 04:05:37",
          "score": 1,
          "num_children": 0,
          "author": 305528,
          "replies": []
        }
      ]
    },
    {
      "id": "ij0b87g",
      "text": "ouch linkedin",
      "timestamp": "2022-08-05 03:25:41",
      "score": 1,
      "num_children": 0,
      "author": 125992,
      "replies": []
    },
    {
      "id": "ij0du0d",
      "text": "Man, you are one talented writer. I don’t have any tips for advice for you (I’m way too old for that), but I just wanted you to know that your ability to write is appreciated.",
      "timestamp": "2022-08-05 03:48:16",
      "score": 1,
      "num_children": 0,
      "author": 199475,
      "replies": []
    },
    {
      "id": "ij0e2v2",
      "text": "Good luck! You deserve it <3",
      "timestamp": "2022-08-05 03:50:28",
      "score": 1,
      "num_children": 0,
      "author": 384750,
      "replies": []
    },
    {
      "id": "ij0ehgt",
      "text": "Sike. That s the wrong number",
      "timestamp": "2022-08-05 03:54:10",
      "score": 1,
      "num_children": 0,
      "author": 276585,
      "replies": []
    },
    {
      "id": "ij0g1cb",
      "text": "Good luck!!",
      "timestamp": "2022-08-05 04:08:15",
      "score": 1,
      "num_children": 0,
      "author": 383419,
      "replies": []
    },
    {
      "id": "ij0g26b",
      "text": "You LinkedIn recruiters need to get outside. Jeez.",
      "timestamp": "2022-08-05 04:08:28",
      "score": 1,
      "num_children": 0,
      "author": 298114,
      "replies": []
    },
    {
      "id": "ij0g4j7",
      "text": "Ladies, if a guy finds you multiple times in a party and kisses you, he's interested. We aren't complicated creatures, please stop thinking we're some genius \"player\" who is trying to get in your pants. We're mostly bumbling idiots who don't realize that the girl we kissed might be having trouble contacting us",
      "timestamp": "2022-08-05 04:09:04",
      "score": 1,
      "num_children": 0,
      "author": 341399,
      "replies": []
    },
    {
      "id": "ij0ihq9",
      "text": "My ex fiance accidentally gave me a wrong digit in the area code when we met. I could tell the area code was off so I changed it and I was right. Dated for a year and got engaged. Then she dumped me. I don't know if I regret correcting that digit or not, I feel like shit",
      "timestamp": "2022-08-05 04:31:21",
      "score": 1,
      "num_children": 0,
      "author": 268481,
      "replies": []
    },
    {
      "id": "ij0j8x0",
      "text": "Wholesome.",
      "timestamp": "2022-08-05 04:38:46",
      "score": 1,
      "num_children": 0,
      "author": 256038,
      "replies": []
    },
    {
      "id": "ij0jlq5",
      "text": "giving me false hope vibes",
      "timestamp": "2022-08-05 04:42:15",
      "score": 1,
      "num_children": 0,
      "author": 56178,
      "replies": []
    },
    {
      "id": "ij0kuqa",
      "text": "an actual meet-cute. nice.\n\nbest of luck, op.",
      "timestamp": "2022-08-05 04:54:55",
      "score": 1,
      "num_children": 0,
      "author": 206333,
      "replies": []
    },
    {
      "id": "ij0kx9c",
      "text": "I was in a kinda similar situation. I exchanged numbers with a classmate in University, they texted me the next day and someone else replied. They thought I gave them the wrong number, but when I messaged them a day later, they realized that they had read my number wrong. I have... not great handwriting and they thought my 4 was a 9. \n\nWe have been married for 8 years and have a kid now. \n\nAlways make sure you exchange numbers and not just give yours.",
      "timestamp": "2022-08-05 04:55:39",
      "score": 1,
      "num_children": 0,
      "author": 174253,
      "replies": []
    },
    {
      "id": "ij0l0z5",
      "text": "Good on you for being a creepy stalker and locking him in for a date! Nothing creepy about it if you guys had that sort of connection! Go and be happy you excellent little creep!",
      "timestamp": "2022-08-05 04:56:44",
      "score": 1,
      "num_children": 0,
      "author": 274609,
      "replies": []
    },
    {
      "id": "ij0l2ij",
      "text": "This is an ad for LinkedIn I'm convinced!",
      "timestamp": "2022-08-05 04:57:11",
      "score": 1,
      "num_children": 0,
      "author": 294635,
      "replies": []
    },
    {
      "id": "ij0lad6",
      "text": "Wait, if you are logged into LinkedIn and you merely look at someone's profile, they can tell ?",
      "timestamp": "2022-08-05 04:59:28",
      "score": 1,
      "num_children": 1,
      "author": 42460,
      "replies": [
        {
          "id": "ij0lheh",
          "text": "You can control this in your account's privacy settings, but by default - yes.",
          "timestamp": "2022-08-05 05:01:28",
          "score": 1,
          "num_children": 1,
          "author": 1551,
          "replies": [
            {
              "id": "ijcba86",
              "text": "well shit on me",
              "timestamp": "2022-08-07 18:34:04",
              "score": 1,
              "num_children": 0,
              "author": 42460,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ij0lj9b",
      "text": "Aw, bless. All best for the date!",
      "timestamp": "2022-08-05 05:02:00",
      "score": 1,
      "num_children": 0,
      "author": 1551,
      "replies": []
    },
    {
      "id": "ij0ln8x",
      "text": "Like oh my gawd.",
      "timestamp": "2022-08-05 05:03:08",
      "score": 1,
      "num_children": 0,
      "author": 320337,
      "replies": []
    },
    {
      "id": "ij0m4le",
      "text": "I love this story!!! Aaaaah love it!! Gotta love love man. Instant connection, lost by dumb mistake, brought together by sheer accident, fuck yeah!!",
      "timestamp": "2022-08-05 05:08:08",
      "score": 1,
      "num_children": 0,
      "author": 385195,
      "replies": []
    },
    {
      "id": "ij0naqs",
      "text": "Amazing. Good luck!",
      "timestamp": "2022-08-05 05:20:46",
      "score": 1,
      "num_children": 0,
      "author": 160116,
      "replies": []
    },
    {
      "id": "ij0nbv8",
      "text": "Oh my gosh. I hope the first date will turn out awesome. You seem like a good match. 🥺🤍",
      "timestamp": "2022-08-05 05:21:05",
      "score": 1,
      "num_children": 0,
      "author": 236261,
      "replies": []
    },
    {
      "id": "ij0nqib",
      "text": "Cyber stalking responsibly works! I met my fiance while she was working at the 4th of July fireworks. I didn't know her name, but I knew the company she worked for. Turns out their website has a page that lists their employees, which gave me her name, and from there I was able to message her on Facebook.\n\nSounds a bit creepy, but it worked! And I got one of my cousins to agree I wasn't being creepy before ever reaching out. She totally gets to be in the wedding.",
      "timestamp": "2022-08-05 05:25:33",
      "score": 1,
      "num_children": 0,
      "author": 189948,
      "replies": []
    },
    {
      "id": "ij0nulu",
      "text": "This sub is either r/ihavesex or r/gonnahavesex",
      "timestamp": "2022-08-05 05:26:50",
      "score": 1,
      "num_children": 0,
      "author": 216079,
      "replies": []
    },
    {
      "id": "ij0nwky",
      "text": "This reminds me of a similar situation I found myself in. Nearly the same scenario at a party. He walks in, we lock eyes, I dont temember anything else about that party. Lots of drink later He asks for my info before he leaves with his friend. I somehow royally screwed up typing my own phone number, but entered my EMAIL address perfectly fine. He was trying to text me for two days before he realized my email was there. \n\nThings didn't end up working out for us; that was 11 years ago.",
      "timestamp": "2022-08-05 05:27:27",
      "score": 1,
      "num_children": 0,
      "author": 330302,
      "replies": []
    },
    {
      "id": "ij0o47v",
      "text": "I actually super love this story. Sounds like the start of a great love story",
      "timestamp": "2022-08-05 05:29:48",
      "score": 1,
      "num_children": 0,
      "author": 126969,
      "replies": []
    },
    {
      "id": "ij0oap7",
      "text": "I can't believe grown ass adults still use \">.<\" in their sentences.\n\nEither way... congrats lol",
      "timestamp": "2022-08-05 05:31:43",
      "score": 1,
      "num_children": 0,
      "author": 255688,
      "replies": []
    },
    {
      "id": "ij0ocaz",
      "text": "Did you mention his Smile though",
      "timestamp": "2022-08-05 05:32:13",
      "score": 1,
      "num_children": 0,
      "author": 384819,
      "replies": []
    },
    {
      "id": "ij0ogz7",
      "text": "You put the effort in. This is real attraction, I wish the best to you guys.",
      "timestamp": "2022-08-05 05:33:39",
      "score": 1,
      "num_children": 0,
      "author": 148944,
      "replies": []
    },
    {
      "id": "ij0os6n",
      "text": "Happened once to my boy Eric and by Eric I mean me, I’m Eric and one time I got a digit wrong writing it in her phone, lmao",
      "timestamp": "2022-08-05 05:37:04",
      "score": 1,
      "num_children": 0,
      "author": 138765,
      "replies": []
    },
    {
      "id": "ij0oxva",
      "text": "Wholesome!! Hopefully it blossoms well",
      "timestamp": "2022-08-05 05:38:51",
      "score": 1,
      "num_children": 0,
      "author": 310695,
      "replies": []
    },
    {
      "id": "ij0oyi9",
      "text": "So happy for you’ll\nThis made me smile",
      "timestamp": "2022-08-05 05:39:03",
      "score": 1,
      "num_children": 0,
      "author": 5555,
      "replies": []
    },
    {
      "id": "ij0p6wr",
      "text": "Something similar happened to me with my bf of three years. I gave him my number casually while he was at work which I never do to people. Didn't hear back for almost a week, thought great, I need to find a new store to shop at. Turns out he had texted me but didn't text the right number. He thought I ghosted him and double checked the numbers. He was off by a digit.",
      "timestamp": "2022-08-05 05:41:38",
      "score": 1,
      "num_children": 0,
      "author": 167355,
      "replies": []
    },
    {
      "id": "ij0p7j0",
      "text": "omg we have like so much in common *twirls hair*",
      "timestamp": "2022-08-05 05:41:49",
      "score": 1,
      "num_children": 0,
      "author": 53986,
      "replies": []
    },
    {
      "id": "ij0q0uw",
      "text": "I didn’t know people could tell when others view their profile on there…Good thing I deleted my profile a while back!",
      "timestamp": "2022-08-05 05:50:56",
      "score": 1,
      "num_children": 0,
      "author": 263750,
      "replies": []
    },
    {
      "id": "ij0q8gu",
      "text": "Something similar happened between my wife and I when we first met. During college we found each other in an online dating site and hit it off pretty well. Turns out a week had passed before I reached out to her again, don't remember why but she loves bringing up this week of silence to people. I reached out to her again because my roommate at the time was threatening to assault me Florida man style with drugs.",
      "timestamp": "2022-08-05 05:53:20",
      "score": 1,
      "num_children": 0,
      "author": 301887,
      "replies": []
    },
    {
      "id": "ij0qit1",
      "text": "wholesome :) good luck for both of you <3",
      "timestamp": "2022-08-05 05:56:42",
      "score": 1,
      "num_children": 0,
      "author": 251323,
      "replies": []
    },
    {
      "id": "ij0tven",
      "text": "God this was so sweet. I wish you all the best!",
      "timestamp": "2022-08-05 06:36:18",
      "score": 1,
      "num_children": 0,
      "author": 172633,
      "replies": []
    },
    {
      "id": "ij0u2zr",
      "text": "GOOD LUCK GIRL",
      "timestamp": "2022-08-05 06:38:57",
      "score": 1,
      "num_children": 0,
      "author": 251073,
      "replies": []
    },
    {
      "id": "ij0usjx",
      "text": "Always. Confirm. Numbers.\nSend a quick test message.",
      "timestamp": "2022-08-05 06:47:53",
      "score": 1,
      "num_children": 0,
      "author": 86683,
      "replies": []
    },
    {
      "id": "ij0yndq",
      "text": "This is actually very adorable! Hope it goes a long way for both of you",
      "timestamp": "2022-08-05 07:37:28",
      "score": 1,
      "num_children": 0,
      "author": 380958,
      "replies": []
    },
    {
      "id": "ij0zkj6",
      "text": "pretty cute story",
      "timestamp": "2022-08-05 07:49:25",
      "score": 1,
      "num_children": 0,
      "author": 32579,
      "replies": []
    },
    {
      "id": "ij0zxks",
      "text": "Something like this almost happened with my wife when we first met. \nThis was in Japan where they used email on phones a lot, so she gave me her email address but spelled it wrong.\n\nWe had made plans to meet on sunday (met on friday). I texted to make sure it was still on and she didnt reply. \n\nJust in case I wemt anyways and she showed up. First thing she said was \"I messed up my email address didnt I?\"",
      "timestamp": "2022-08-05 07:54:17",
      "score": 1,
      "num_children": 0,
      "author": 301710,
      "replies": []
    },
    {
      "id": "ij10xd8",
      "text": "I mean.. I guess that is exactly why the function was added, but I never tought it would work in someones favor this way",
      "timestamp": "2022-08-05 08:07:38",
      "score": 1,
      "num_children": 0,
      "author": 409562,
      "replies": []
    },
    {
      "id": "ij110ca",
      "text": "UpdateMe!",
      "timestamp": "2022-08-05 08:08:46",
      "score": 1,
      "num_children": 0,
      "author": 286711,
      "replies": []
    },
    {
      "id": "ij110jk",
      "text": "Awesome.  Hopefully he doesn't have a cum jar.",
      "timestamp": "2022-08-05 08:08:51",
      "score": 1,
      "num_children": 0,
      "author": 355178,
      "replies": []
    },
    {
      "id": "ij11clg",
      "text": "The unlikely dating site LinkedIn",
      "timestamp": "2022-08-05 08:13:21",
      "score": 1,
      "num_children": 0,
      "author": 141084,
      "replies": []
    },
    {
      "id": "ij12ag9",
      "text": "Is he a contractor? Who’s been actually employed at a dozen different places?",
      "timestamp": "2022-08-05 08:25:50",
      "score": 1,
      "num_children": 0,
      "author": 275732,
      "replies": []
    },
    {
      "id": "ij13d3e",
      "text": " What is a Raya date?",
      "timestamp": "2022-08-05 08:40:21",
      "score": 1,
      "num_children": 0,
      "author": 222414,
      "replies": []
    },
    {
      "id": "ij13oim",
      "text": "So anyway, I couldn't offer him a full time position, but we are now friends with benefits. Including Healthcare.",
      "timestamp": "2022-08-05 08:44:37",
      "score": 1,
      "num_children": 0,
      "author": 217197,
      "replies": []
    },
    {
      "id": "ij1481n",
      "text": "This reminds me of calls I'd get as a phone whore.\n\nGuys would tell me shit happened that was just fantasy they wished would happen.",
      "timestamp": "2022-08-05 08:52:02",
      "score": 1,
      "num_children": 0,
      "author": 389489,
      "replies": []
    },
    {
      "id": "ij14sft",
      "text": "I always get them to call my number to make sure\n\nUnless I gave them the wrong number on purpose",
      "timestamp": "2022-08-05 08:59:56",
      "score": 1,
      "num_children": 0,
      "author": 357670,
      "replies": []
    },
    {
      "id": "ij15rjt",
      "text": "why was this post written like a wattpad story",
      "timestamp": "2022-08-05 09:13:07",
      "score": 1,
      "num_children": 0,
      "author": 283849,
      "replies": []
    },
    {
      "id": "ij16qip",
      "text": "But it's common practice when you give somebody your number, he calls you immediately to check if the number is correct and so you can have his number...",
      "timestamp": "2022-08-05 09:26:10",
      "score": 1,
      "num_children": 0,
      "author": 310491,
      "replies": []
    },
    {
      "id": "ij17ita",
      "text": "This is so cute and romantic and adorable! HAVE FUN ON THE DATE",
      "timestamp": "2022-08-05 09:36:46",
      "score": 1,
      "num_children": 0,
      "author": 82250,
      "replies": []
    },
    {
      "id": "ij18p7z",
      "text": "I once gave a girl who seemed interested my number and never heard from her, then the next time I wrote my number down I accidentally wrote my work area code with my personal number and immediately realized what must have happened and that I was an idiot.",
      "timestamp": "2022-08-05 09:52:35",
      "score": 1,
      "num_children": 0,
      "author": 1060,
      "replies": []
    },
    {
      "id": "ij1citp",
      "text": "I've been the guy in this situation before. I had the right number and sent a text to invite this girl I'd been talking to for a follow-up date but she didnt respond for a day and I found her response really weird and unrelated.\n\nI didn't text her again because I thought she was being rude and uninterested.\n\nTurns out my text message was never delivered to her and she walked up to me at a party crying and saying \"WHAT AM I NOT PRETTY ENOUGH OR SOMETHING?\"\n\nI was dumbfounded and figured out what had happened by talking to her, but I'd just contracted mononucleosis so I couldn't responsibly date or kiss anyone for several months.\n\nSometimes I wonder what that relationship would've been like - oh well!",
      "timestamp": "2022-08-05 10:40:32",
      "score": 1,
      "num_children": 0,
      "author": 373118,
      "replies": []
    },
    {
      "id": "ij1d6kq",
      "text": "Omg how cute. Please keep us posted on your first date and have fun!",
      "timestamp": "2022-08-05 10:48:17",
      "score": 1,
      "num_children": 0,
      "author": 158890,
      "replies": []
    },
    {
      "id": "ij1fl05",
      "text": "I hope this works out, I need to believe in something",
      "timestamp": "2022-08-05 11:15:08",
      "score": 1,
      "num_children": 0,
      "author": 313089,
      "replies": []
    },
    {
      "id": "ij1g3tn",
      "text": "Glad this had a happy ending!!! Best of luck, I hope all goes well!!",
      "timestamp": "2022-08-05 11:20:33",
      "score": 1,
      "num_children": 0,
      "author": 65438,
      "replies": []
    },
    {
      "id": "ij1meez",
      "text": "Kinda wanna see his smile now tbh",
      "timestamp": "2022-08-05 12:20:56",
      "score": 1,
      "num_children": 0,
      "author": 45173,
      "replies": []
    },
    {
      "id": "ij1oy50",
      "text": "That’s pretty cute, actually.",
      "timestamp": "2022-08-05 12:42:55",
      "score": 1,
      "num_children": 0,
      "author": 19759,
      "replies": []
    },
    {
      "id": "ij1p5jm",
      "text": "I just saw this movie in reverse on FreeVee. Love accidentally.",
      "timestamp": "2022-08-05 12:44:37",
      "score": 1,
      "num_children": 0,
      "author": 203889,
      "replies": []
    },
    {
      "id": "ij1q06y",
      "text": "How is it you ghosting him when you weren't even aware of it?",
      "timestamp": "2022-08-05 12:51:28",
      "score": 1,
      "num_children": 0,
      "author": 294548,
      "replies": []
    },
    {
      "id": "ij1rwl6",
      "text": "Good luck !",
      "timestamp": "2022-08-05 13:06:37",
      "score": 1,
      "num_children": 0,
      "author": 193991,
      "replies": []
    },
    {
      "id": "ij1s9jg",
      "text": "Yay, I'm glad you reconnected with him. Years later you'll look back at this incident and laugh and tell your kids (if you want any) about how you met their dad. Congrats and I wish the both of you many years of happiness.",
      "timestamp": "2022-08-05 13:09:28",
      "score": 1,
      "num_children": 0,
      "author": 205884,
      "replies": []
    },
    {
      "id": "ij14ocq",
      "text": "When I exchange phone numbers, I give them mine first, so they can call me right then. That way we both know we have the correct number and I can just store the caller's number.",
      "timestamp": "2022-08-05 08:58:20",
      "score": 1,
      "num_children": 0,
      "author": 233080,
      "replies": []
    },
    {
      "id": "ij1sast",
      "text": "Hopefully you guys get to know each other better. You'll never know better until then. I like how all of the likes are just about features and jobs than character, it will be an interesting date for sure.",
      "timestamp": "2022-08-05 13:09:44",
      "score": 1,
      "num_children": 0,
      "author": 274689,
      "replies": []
    },
    {
      "id": "ij1uag9",
      "text": "Wait LinkedIn tells you when you visit i people’s pages, that’s weird",
      "timestamp": "2022-08-05 13:24:55",
      "score": 1,
      "num_children": 0,
      "author": 239680,
      "replies": []
    },
    {
      "id": "ij1xzwj",
      "text": "My wife and I started the same way. She gave me her number wrong. Luckily the texts were marked undeliverable. Heard nothing from her for a few days. Found her on Facebook through mutual friends, and asked if it was intentional or an accident. Luckily she was still interested in the date we had discussed and waited to set up.",
      "timestamp": "2022-08-05 13:52:18",
      "score": 1,
      "num_children": 0,
      "author": 319152,
      "replies": []
    },
    {
      "id": "ij24s5o",
      "text": "Turn this around and we have a creep",
      "timestamp": "2022-08-05 14:38:52",
      "score": 1,
      "num_children": 0,
      "author": 7704,
      "replies": []
    },
    {
      "id": "ij25plp",
      "text": "That's the best LinkedIn ad I've ever seen.",
      "timestamp": "2022-08-05 14:45:03",
      "score": 1,
      "num_children": 0,
      "author": 36065,
      "replies": []
    },
    {
      "id": "ij25y4k",
      "text": "Ghostception.",
      "timestamp": "2022-08-05 14:46:36",
      "score": 1,
      "num_children": 0,
      "author": 220283,
      "replies": []
    },
    {
      "id": "ij281gg",
      "text": "Reminds me of when I was a freshman in college. I got this girls number at the end of the school year and I immediately lost my phone.\n\nFour years later I run into her after my car breaks down at a grocery store parking lot. I actually texted her for a week that time before I again lost my phone. I guess it was never meant to be",
      "timestamp": "2022-08-05 15:00:21",
      "score": 1,
      "num_children": 0,
      "author": 114058,
      "replies": []
    },
    {
      "id": "ij287gl",
      "text": "I hope this guy runs now that he knows op is a creepy cyber stalker",
      "timestamp": "2022-08-05 15:01:26",
      "score": 1,
      "num_children": 0,
      "author": 285421,
      "replies": []
    },
    {
      "id": "ij29311",
      "text": "That's such a cool story and probably the best TIFU I've ever read and it's amazingly wholesome! Glad it worked out for you both!",
      "timestamp": "2022-08-05 15:07:12",
      "score": 1,
      "num_children": 0,
      "author": 175670,
      "replies": []
    },
    {
      "id": "ij2ifcz",
      "text": "I'm following OP to get the update later lol",
      "timestamp": "2022-08-05 16:07:41",
      "score": 1,
      "num_children": 0,
      "author": 175570,
      "replies": []
    },
    {
      "id": "ij2iy9u",
      "text": "“I probably looked crazy”\n\nUh…”looked”? \n\nThis whole story is a massive red flag. “He’s so attentive to my needs”. You’ve known him for 2 hours! \n\nGive number after a drunken party and get extremely upset about not getting a response? That’s not even being ghosted after a date, that’s just rather normal…\n\nI’m not trying to be mean, but I’m curious what others think on this, this story sounds unhinged.",
      "timestamp": "2022-08-05 16:11:07",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ij2y154",
      "text": "Premium shit, this is.",
      "timestamp": "2022-08-05 17:47:04",
      "score": 1,
      "num_children": 0,
      "author": 89141,
      "replies": []
    },
    {
      "id": "ij390ve",
      "text": "Good luck!",
      "timestamp": "2022-08-05 18:57:25",
      "score": 1,
      "num_children": 0,
      "author": 398563,
      "replies": []
    },
    {
      "id": "ij3b6ky",
      "text": "I can’t wait for the update",
      "timestamp": "2022-08-05 19:11:19",
      "score": 1,
      "num_children": 1,
      "author": 384620,
      "replies": [
        {
          "id": "ij3cyo3",
          "text": "As soon as we go on a date I’ll update!",
          "timestamp": "2022-08-05 19:22:46",
          "score": 2,
          "num_children": 1,
          "author": 85543,
          "replies": [
            {
              "id": "ij3du5r",
              "text": "Good good this sound like the beginning of something real. 🤗🤗🤗",
              "timestamp": "2022-08-05 19:28:24",
              "score": 2,
              "num_children": 0,
              "author": 384620,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ij3gchu",
      "text": "you have to tell us what happens after !!!! good luck!!!",
      "timestamp": "2022-08-05 19:44:39",
      "score": 1,
      "num_children": 0,
      "author": 409037,
      "replies": []
    },
    {
      "id": "ij43776",
      "text": "Exact same situation happened to me in New york 2 weeks ago except I just never heard from her again after that night, I was secretly hoping that this story was going to reveal that girl I was looking for. Like every single detail was the exact same until the very end when you guys ended up together again. Thre myself a pity party for like 5 days till I eventually just tried to get over her. I rarely ever have an actual crush on someone and like 95% of the time I put the charm on we usually end up together. We had such a lovely time that ended in a small kiss and going our seperate ways. I guess at 2am she sent me a booty call but I was tired and wanted to have a nice date the next day. Next day every message I sent just went to \"unread\" and never heard from her again. Oh well",
      "timestamp": "2022-08-05 22:18:34",
      "score": 1,
      "num_children": 0,
      "author": 245002,
      "replies": []
    },
    {
      "id": "ij58cis",
      "text": "I have had instances like this but when it came to online. There are so many ways to easily accidentally give someone the wrong e-mail address, or username, or forget to add someone to your friends list or something like that. \n\nThen there is the fact I have come across people who have forgotten a password to their account and don't remember/have access to the e-mail associated with said account anymore and thus can't get back on it. Luckily for us we had more than 1 way of communicating so was able to find out and get their new account etc but some aren't so lucky. Though kinda stupid to set up an account on some IM service and not have the e-mail wrote down or something somewhere and just forget what it is. :S\n\nI have also experienced (though not anymore lol) someone disappearing for a long time only to have them come back and find out they were grounded from the internet by parents. I had one a long time ago who had over protective parents and if their brother got into trouble they both got grounded from the internet and thus would lost contact with them for sometimes months at a time. Luckily I didn't delete them off of the IM we used back then and eventually they came on one day and apologized for being gone so long. It then happened frequently enough that I knew just to wait to hear from them again. \n\nAlso my last ex a long time ago disappeared for like a month and found out it was cause of her internet being turned off. Though kinda annoying she didn't just go to a local library, or use a computer at a friends house to just send me a quick e-mail or something to let me know what was going on. \n\nThough that also caused problems in the future when adding someone to an IM and then they delete/block me after a while and some (even to this day) don't show/tell you that you have been deleted/blocked by them so you will wait around for months wondering what happened to said person. Thus why I always try to message someone before deleting them and just give them a short message that im deleting them so they don't sit there waiting for months wondering why I don't come back online for them. \n\nBeen deleted/blocked by so many just out of the blue with no rhyme or reasoning and without any warning which is quite annoying when you expect to chat with them more later only for later to never happen. So yeah ghosting stinks and even worse if it's done by accident cause then each other person could think the other one is a jerk and then you lose out on a possible friendship or more. \n\nI worry about that, thus when I meet someone who I hit it off with I try to add them to more than one thing, or find more than just one way to contact them just in case something happens like a glitch, or accidentally deleting them or your account getting hacked/shut down etc.",
      "timestamp": "2022-08-06 03:48:00",
      "score": 1,
      "num_children": 0,
      "author": 281021,
      "replies": []
    },
    {
      "id": "ij5qqnn",
      "text": "If it’s any consolation, I hit it off with a girl last night and I fucked up and put my number in her phone incorrectly. We ran into each other at a bar later and we hung out for a bit and made plans for tmrw night but she fucked up putting her number in my phone. It could always be worse 😊",
      "timestamp": "2022-08-06 07:10:07",
      "score": 1,
      "num_children": 0,
      "author": 287091,
      "replies": []
    },
    {
      "id": "ij623yd",
      "text": "You sure you messed up? You kinda made a \"HOW I MET YOUR MOTHER\" Story for your kids, if both y'all end up together",
      "timestamp": "2022-08-06 09:49:20",
      "score": 1,
      "num_children": 0,
      "author": 239546,
      "replies": []
    },
    {
      "id": "ij6w9nl",
      "text": "Still a better love story than twilight",
      "timestamp": "2022-08-06 14:49:48",
      "score": 1,
      "num_children": 1,
      "author": 320109,
      "replies": [
        {
          "id": "ij96ym2",
          "text": "Lollll very true!",
          "timestamp": "2022-08-07 01:02:26",
          "score": 1,
          "num_children": 0,
          "author": 85543,
          "replies": []
        }
      ]
    },
    {
      "id": "ijt292a",
      "text": "At least it had a happy ending. You'll laugh about it in the future for sure as that time you got a date on LinkedIn.",
      "timestamp": "2022-08-11 02:30:22",
      "score": 1,
      "num_children": 0,
      "author": 132712,
      "replies": []
    },
    {
      "id": "ikfry7p",
      "text": "33333 up votes, very cool 👍🏼",
      "timestamp": "2022-08-15 21:40:24",
      "score": 1,
      "num_children": 1,
      "author": 280080,
      "replies": [
        {
          "id": "ikfs43v",
          "text": "Lol, why thank you!",
          "timestamp": "2022-08-15 21:41:28",
          "score": 1,
          "num_children": 0,
          "author": 85543,
          "replies": []
        }
      ]
    },
    {
      "id": "ilzz1ch",
      "text": "Drunk you was sabotaging your chances! It’s a relief that it all worked out in the end though.",
      "timestamp": "2022-08-27 13:18:07",
      "score": 1,
      "num_children": 0,
      "author": 156351,
      "replies": []
    },
    {
      "id": "im2rdpb",
      "text": "I need an update. Are you guys married yet?",
      "timestamp": "2022-08-28 01:37:42",
      "score": 1,
      "num_children": 0,
      "author": 249563,
      "replies": []
    },
    {
      "id": "im5rxop",
      "text": "Love this soooo much! Can't wait to see updates and hear how the date went. The fact he didn't give up after one text either. That's rare.",
      "timestamp": "2022-08-28 18:44:59",
      "score": 1,
      "num_children": 0,
      "author": 353524,
      "replies": []
    },
    {
      "id": "im7evwt",
      "text": "I loved the happy ending ❤️.",
      "timestamp": "2022-08-29 02:02:27",
      "score": 1,
      "num_children": 0,
      "author": 126941,
      "replies": []
    },
    {
      "id": "in49d0n",
      "text": "Wait, LinkedIn shows who's looked at your profile?",
      "timestamp": "2022-09-04 23:31:03",
      "score": 1,
      "num_children": 0,
      "author": 364932,
      "replies": []
    },
    {
      "id": "in4nwey",
      "text": "Hey OP, any update?",
      "timestamp": "2022-09-05 01:24:51",
      "score": 1,
      "num_children": 0,
      "author": 198684,
      "replies": []
    },
    {
      "id": "inus6bz",
      "text": "Update?!",
      "timestamp": "2022-09-10 13:45:50",
      "score": 1,
      "num_children": 0,
      "author": 326397,
      "replies": []
    },
    {
      "id": "inycjg7",
      "text": "Any updates?!",
      "timestamp": "2022-09-11 05:47:12",
      "score": 1,
      "num_children": 0,
      "author": 93395,
      "replies": []
    },
    {
      "id": "io6v797",
      "text": "Please post an update! I am so glad everything worked out thus far!",
      "timestamp": "2022-09-12 23:54:15",
      "score": 1,
      "num_children": 0,
      "author": 300154,
      "replies": []
    },
    {
      "id": "iooz1wo",
      "text": "op, i NEED an update on you two",
      "timestamp": "2022-09-16 17:47:17",
      "score": 1,
      "num_children": 0,
      "author": 362041,
      "replies": []
    },
    {
      "id": "ij1umim",
      "text": "Now reverse this story and see if everyone has the same reaction to a guy stalking an online profile over a girl.",
      "timestamp": "2022-08-05 13:27:28",
      "score": -2,
      "num_children": 1,
      "author": 398124,
      "replies": [
        {
          "id": "ij1vg4m",
          "text": "NoW ReVeRsE tHiS sToRy AnD sEe If EvErYoNe HaS tHe SaMe ReAcTiOn To A gUy StAlKiNg An OnLiNe PrOfIlE oVeR a GiRl!!!\n\nSeriously, get fucked.",
          "timestamp": "2022-08-05 13:33:41",
          "score": 2,
          "num_children": 2,
          "author": 313727,
          "replies": [
            {
              "id": "ij38a7q",
              "text": "Guilty conscience?",
              "timestamp": "2022-08-05 18:52:40",
              "score": -1,
              "num_children": 0,
              "author": 398124,
              "replies": []
            },
            {
              "id": "ij2h241",
              "text": "Seriously. Some people just want to watch the world burn.",
              "timestamp": "2022-08-05 15:58:55",
              "score": 1,
              "num_children": 1,
              "author": 304674,
              "replies": [
                {
                  "id": "ij3wzbh",
                  "text": "The dude is probably sitting in his bunker just hating on the internet",
                  "timestamp": "2022-08-05 21:34:49",
                  "score": 1,
                  "num_children": 0,
                  "author": 245002,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ir02bgr",
      "text": "Aww this is a cute fuck up lol hope the date went well!",
      "timestamp": "2022-10-04 11:05:18",
      "score": 1,
      "num_children": 0,
      "author": 59755,
      "replies": []
    },
    {
      "id": "in34bfu",
      "text": "Sooooo.... Update?",
      "timestamp": "2022-09-04 18:31:44",
      "score": 1,
      "num_children": 0,
      "author": 358277,
      "replies": []
    },
    {
      "id": "ijeap9c",
      "text": "I'm trying to understand.. how was he an asshole? Say everything was correct. He lead you on? How????? He's also not allowed to change his mind? He was friendly the entire time.. Bruh. It amazing how feelings can be reality",
      "timestamp": "2022-08-08 03:22:29",
      "score": -1,
      "num_children": 0,
      "author": 241095,
      "replies": []
    },
    {
      "id": "imr9gyj",
      "text": "Any updates?! :)",
      "timestamp": "2022-09-02 04:26:18",
      "score": 1,
      "num_children": 0,
      "author": 320695,
      "replies": []
    },
    {
      "id": "iizr7du",
      "text": "So linkedin tells people when you visit their page... did not know that. Good. Cool. Cool cool cool. Gotta go die now.",
      "timestamp": "2022-08-05 00:51:48",
      "score": 1169,
      "num_children": 14,
      "author": 247651,
      "replies": [
        {
          "id": "ij0r7f9",
          "text": "oh no, buddy, what have you done?! :'D",
          "timestamp": "2022-08-05 06:04:35",
          "score": 117,
          "num_children": 1,
          "author": 251323,
          "replies": [
            {
              "id": "ij1bpg3",
              "text": "So that's why those tinder matches suddenly disappeared",
              "timestamp": "2022-08-05 10:30:45",
              "score": 56,
              "num_children": 0,
              "author": 294247,
              "replies": []
            }
          ]
        },
        {
          "id": "ij0l8bq",
          "text": "You can modify this in your parameters by making you anonymous when you go on someone page.",
          "timestamp": "2022-08-05 04:58:51",
          "score": 200,
          "num_children": 4,
          "author": 209559,
          "replies": [
            {
              "id": "ij1kxvd",
              "text": "If you aren’t signed in to your LinkedIn account when you view a page, does it come up with your email address or the name you’re logged into Google with?",
              "timestamp": "2022-08-05 12:07:45",
              "score": 20,
              "num_children": 1,
              "author": 86094,
              "replies": [
                {
                  "id": "ij1lmph",
                  "text": "No.\nBut LinkedIn usually prompts you pretty fast to log in if you want to use the website.\nBut you have time to stalk 1 person usually.",
                  "timestamp": "2022-08-05 12:14:04",
                  "score": 48,
                  "num_children": 1,
                  "author": 51759,
                  "replies": [
                    {
                      "id": "ij1mwrm",
                      "text": "Oh phew XD it usually lets me stalk in peace, apart from a header at the top of the page telling me to sign in?",
                      "timestamp": "2022-08-05 12:25:26",
                      "score": 5,
                      "num_children": 0,
                      "author": 86094,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ij2310g",
              "text": "Just to let you know, it may not say your name but it will say where you work if you are logged in.  Creepy ex co-worker looks at all our pages quarterly and thinks he is anonymous but we can see his employer \"Someone who works at INSERT COMPANY NAME HERE has viewed your profile\" and since that's the only person I know who works there we all collectively discuss how creepy he is",
              "timestamp": "2022-08-05 14:26:59",
              "score": 1,
              "num_children": 0,
              "author": 380868,
              "replies": []
            },
            {
              "id": "ij1pwjz",
              "text": "Please tell me more...",
              "timestamp": "2022-08-05 12:50:40",
              "score": 0,
              "num_children": 0,
              "author": 252503,
              "replies": []
            },
            {
              "id": "ij1ursq",
              "text": "HOW DO YOU DO THIS",
              "timestamp": "2022-08-05 13:28:34",
              "score": 0,
              "num_children": 0,
              "author": 191591,
              "replies": []
            }
          ]
        },
        {
          "id": "ij18htt",
          "text": "Do you not get regular notifications of other people viewing your profile though? \n\nYou might have had private mode turned on, which means the other person won’t see your name when you visit (it will just say “1 person viewed your profile”). But it also means you won’t be able to see other people’s names when they visit your page.",
          "timestamp": "2022-08-05 09:49:51",
          "score": 48,
          "num_children": 1,
          "author": 164870,
          "replies": [
            {
              "id": "ij1ut72",
              "text": "No one ever views my profile :(",
              "timestamp": "2022-08-05 13:28:52",
              "score": 3,
              "num_children": 0,
              "author": 191591,
              "replies": []
            }
          ]
        },
        {
          "id": "ij1ay9o",
          "text": "Fuck Google! I had searched about this and Google told me that linkedin doesn't tell people about the visitors, and then i stalked the hell out of students of my dream college like an ordinary aspirant. Good. Cool. Cool cool cool. Gotta go yeet myself off the cliff now.",
          "timestamp": "2022-08-05 10:21:25",
          "score": 31,
          "num_children": 1,
          "author": 120718,
          "replies": [
            {
              "id": "ij1m63w",
              "text": ">then i stalked the hell out of students of my dream college like an ordinary aspirant\n\nBeen there done that, on facebook tho. Didn't make it to my dream school sadly.",
              "timestamp": "2022-08-05 12:18:55",
              "score": 6,
              "num_children": 2,
              "author": 175909,
              "replies": [
                {
                  "id": "ij1w5bt",
                  "text": "Not that bad if it’s strangers. Much worse if it’s a person you actually know in person, and you’ve been on the page multiple times.",
                  "timestamp": "2022-08-05 13:38:54",
                  "score": 2,
                  "num_children": 0,
                  "author": 378501,
                  "replies": []
                },
                {
                  "id": "ij2g3ku",
                  "text": "Oh boy! That must have hurt:'(",
                  "timestamp": "2022-08-05 15:52:46",
                  "score": 2,
                  "num_children": 1,
                  "author": 120718,
                  "replies": [
                    {
                      "id": "ij2wyx9",
                      "text": "It stings a bit, but you know it is life and you don't get it all. You win some, and you lose some.",
                      "timestamp": "2022-08-05 17:40:20",
                      "score": 2,
                      "num_children": 0,
                      "author": 175909,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ij1pelm",
          "text": "On free LinkedIn you can be anonymous but then can’t see who visits your page. On paid LinkedIn you can be anonymous and see who visited your page.",
          "timestamp": "2022-08-05 12:46:41",
          "score": 4,
          "num_children": 0,
          "author": 48098,
          "replies": []
        },
        {
          "id": "ij1thct",
          "text": "Yeah, it does. So you should not use it for stalking. But it works both ways. That us, you will know which one have found you out",
          "timestamp": "2022-08-05 13:18:49",
          "score": 2,
          "num_children": 0,
          "author": 120068,
          "replies": []
        },
        {
          "id": "iizw5m8",
          "text": "Iirc, you need to pay for the pro version to see that info.",
          "timestamp": "2022-08-05 01:28:31",
          "score": 6,
          "num_children": 1,
          "author": 149044,
          "replies": [
            {
              "id": "ij0c6d0",
              "text": "I don’t have the pro version but receive email alerts of who visited?? Haven’t signed in for years though, so I’m not 100% sure. I private browse specifically for this just in case.",
              "timestamp": "2022-08-05 03:33:54",
              "score": 29,
              "num_children": 1,
              "author": 102217,
              "replies": [
                {
                  "id": "ij184hu",
                  "text": "Yeah the person above is half right - the free version does allow you to see who views your profile, but only if you allow others to see when you view theirs. If you turn on private browsing, others won’t see when you visit but you won’t see them when they visit either.\n\nThe pro version just allows you to bypass this; you can still see when people view yours, but they won’t see when you view theirs.",
                  "timestamp": "2022-08-05 09:44:57",
                  "score": 14,
                  "num_children": 1,
                  "author": 164870,
                  "replies": [
                    {
                      "id": "ij1chff",
                      "text": "Ah, thanks for the correction. I stopped using it because I had some companies calling me selling certification courses - and using citations from my work history to neg me into thinking I wasn't a strong enough job candidate without their courses.",
                      "timestamp": "2022-08-05 10:40:05",
                      "score": 1,
                      "num_children": 0,
                      "author": 149044,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ij1mqlk",
          "text": "Only if they have premium. Otherwise, it only tells you that x amount of people saw your profile\n\nObligatory ***\"Great; when HR stalks someone they are headhunters, but when I do, I'm a creep\"***",
          "timestamp": "2022-08-05 12:23:55",
          "score": 1,
          "num_children": 1,
          "author": 62203,
          "replies": [
            {
              "id": "ij1w8di",
              "text": "Nah, I don't have premium LinkedIn, and get alerts saying my profiles been viewed by xxx. Sometimes only gives partial details if a few have looked, as a teaser to get you to sign up for Premium to see the rest of the details.",
              "timestamp": "2022-08-05 13:39:32",
              "score": 1,
              "num_children": 0,
              "author": 161352,
              "replies": []
            }
          ]
        },
        {
          "id": "ij1sde2",
          "text": "It’ll be okay, Abed",
          "timestamp": "2022-08-05 13:10:18",
          "score": 1,
          "num_children": 0,
          "author": 92289,
          "replies": []
        },
        {
          "id": "ij1vvd8",
          "text": "It’s a payed feature to see who has looked at your profile",
          "timestamp": "2022-08-05 13:36:49",
          "score": 1,
          "num_children": 0,
          "author": 241335,
          "replies": []
        },
        {
          "id": "ij1yyz5",
          "text": "I had to email someone at work today but because I work in a very small team in a big company, I googled the name and clicked their LinkedIn. Only to realise that 1. I was logged in, and 2. It was the only guy in my team. His name is super common so I wasn’t sure. And now I’m wondering if he’ll know, because it wasn’t even current. Either way, yeesh.",
          "timestamp": "2022-08-05 13:59:11",
          "score": 1,
          "num_children": 0,
          "author": 175703,
          "replies": []
        },
        {
          "id": "ij1zpte",
          "text": "Anonymous browsing is your saviour x",
          "timestamp": "2022-08-05 14:04:22",
          "score": 1,
          "num_children": 0,
          "author": 87180,
          "replies": []
        },
        {
          "id": "ij20ayp",
          "text": "BROOO",
          "timestamp": "2022-08-05 14:08:28",
          "score": 1,
          "num_children": 0,
          "author": 284941,
          "replies": []
        },
        {
          "id": "ij22rjz",
          "text": "Nine nine!!",
          "timestamp": "2022-08-05 14:25:11",
          "score": 1,
          "num_children": 0,
          "author": 379614,
          "replies": []
        }
      ]
    },
    {
      "id": "ij1a45a",
      "text": "Yo this happened to me this week xD he's celebrating a year with his gf, rip",
      "timestamp": "2022-08-05 10:10:48",
      "score": 0,
      "num_children": 0,
      "author": 413515,
      "replies": []
    }
  ]
}