{
  "id": "wgtivm",
  "text": "More than 80% of women don’t want to work for women. Misogyny!\n",
  "timestamp": "2022-08-05 11:54:07",
  "score": 616,
  "subreddit": "t5_2zaj2",
  "num_children": 43,
  "author": 54170,
  "replies": [
    {
      "id": "ij1tnk9",
      "text": "They will still blame men for this.",
      "timestamp": "2022-08-05 13:20:09",
      "score": 193,
      "num_children": 5,
      "author": 391645,
      "replies": [
        {
          "id": "ij1x6my",
          "text": "They always do. They never establish the critical thinking to question their own created illusion, but rather love to play the emotional blame game on men, since logic is not their strength.",
          "timestamp": "2022-08-05 13:46:30",
          "score": 74,
          "num_children": 0,
          "author": 188440,
          "replies": []
        },
        {
          "id": "ij1uljf",
          "text": "\"Misogynist men fearful of the environment create a vacuum by being fired\"",
          "timestamp": "2022-08-05 13:27:15",
          "score": 33,
          "num_children": 0,
          "author": 412583,
          "replies": []
        },
        {
          "id": "ij67c9t",
          "text": "Yeah, internalized misogyny made women act like this. Not feminism. Not woman trying to undermine each other and push each other down in the workplace. No, it always has something to do with men.",
          "timestamp": "2022-08-06 11:00:53",
          "score": 8,
          "num_children": 0,
          "author": 243563,
          "replies": []
        },
        {
          "id": "ij3dkfm",
          "text": "I predict their stock response is Internalized Feminism",
          "timestamp": "2022-08-05 19:26:39",
          "score": 9,
          "num_children": 0,
          "author": 88045,
          "replies": []
        },
        {
          "id": "ij34bai",
          "text": "Why tho doesn’t make any sense anymore !",
          "timestamp": "2022-08-05 18:27:14",
          "score": 4,
          "num_children": 0,
          "author": 11233,
          "replies": []
        }
      ]
    },
    {
      "id": "ij24pr5",
      "text": "Yeah, my sister hates working with or for other women. Constantly complains about the back stabbing and snide remarks. I’ve never had a problems with women managers though, maybe it’s just a gender thing.",
      "timestamp": "2022-08-05 14:38:25",
      "score": 60,
      "num_children": 2,
      "author": 68774,
      "replies": [
        {
          "id": "ij5470w",
          "text": "Woman here - in my industry there is maybe 2% of women I'd work for. Most of them attract drama and bullshit and I much prefer a boring/drama free life. I've worked for exactly 3 women in the beauty industry and that was enough for me to decide I needed to be on my own and away from the backstabbing and bitchy comments.",
          "timestamp": "2022-08-06 03:11:16",
          "score": 19,
          "num_children": 0,
          "author": 350467,
          "replies": []
        },
        {
          "id": "ij25ess",
          "text": "Woman here. Me and my best friend would also have no problem working with or for women. No idea what this alleged study is on about, or what your sister is on about. I've known a few passive aggressive women, but they had nothing on my most recent male supervisor who let me go because the whole situation was miserable for all of us. My favorite mentor was a woman of color. I will probably end up working for a man, though, because I'm an EIT. The most recent position I interviewed for is led by a man. The pay would be a whole lot better than when I used to work for women.",
          "timestamp": "2022-08-05 14:43:04",
          "score": -33,
          "num_children": 3,
          "author": 354442,
          "replies": [
            {
              "id": "ij3l5wr",
              "text": "Oh I getcha, you and your friend are all women. Sorry, we didn't know",
              "timestamp": "2022-08-05 20:16:00",
              "score": 9,
              "num_children": 0,
              "author": 16832,
              "replies": []
            },
            {
              "id": "ij29g7t",
              "text": "Alleged study? there’s actually multiple studies, like she said. And your experience is anecdotal as you and your friend represent exactly 2 people. Also she said 80% so you are part of the 20%. You must understand the difference between your own personal experience/preference and those of the group as a whole.",
              "timestamp": "2022-08-05 15:09:36",
              "score": 34,
              "num_children": 2,
              "author": 313553,
              "replies": [
                {
                  "id": "ij2afag",
                  "text": "https://www.pewresearch.org/fact-tank/2013/12/16/who-men-and-women-prefer-as-their-co-workers/",
                  "timestamp": "2022-08-05 15:16:03",
                  "score": -7,
                  "num_children": 1,
                  "author": 354442,
                  "replies": [
                    {
                      "id": "ij2t3ip",
                      "text": "This was for preference on coworkers though not bosses. For people with preferences it was still more than 2-1 would rather work alongside men.",
                      "timestamp": "2022-08-05 17:15:49",
                      "score": 13,
                      "num_children": 1,
                      "author": 74697,
                      "replies": [
                        {
                          "id": "ij3anas",
                          "text": "I thought bosses were included.\n\nToday has been a truly horrible day. My energy levels are depleted. Normally I might go back and look, or apologize for not being clear enough.\n\nIf people with preferences are less than a quarter of the population, that matters. Anyway I didn't come here to fight, and I just had my whole life come crashing down in one day since I posted, so I can't handle chatting at all anymore. Don't mind me anymore. I guess I've gotta go.",
                          "timestamp": "2022-08-05 19:07:50",
                          "score": -5,
                          "num_children": 2,
                          "author": 354442,
                          "replies": [
                            {
                              "id": "ij4i3k1",
                              "text": "Lmao, so you are wrong/make a mistake and instead of owning up to it you say \"normally I would own up to it bla bla\" and then give tons excuses for why you don't and try to basically guilt trip the person you just argued with. This horribly manipulative strategy is something I often see women use in discussions/arguments when they are losing and it is super annoying, needs to be called out and shamed by society.",
                              "timestamp": "2022-08-06 00:11:19",
                              "score": 9,
                              "num_children": 1,
                              "author": 394121,
                              "replies": [
                                {
                                  "id": "ij4kfz3",
                                  "text": "No I said I won't even look because this is REDDIT and real life came up. To be clear that's what I said. I'm on the verge of being homeless. Don't fuck with me. Ok?",
                                  "timestamp": "2022-08-06 00:29:44",
                                  "score": -1,
                                  "num_children": 1,
                                  "author": 354442,
                                  "replies": [
                                    {
                                      "id": "ij50le4",
                                      "text": "I thought you had to go.",
                                      "timestamp": "2022-08-06 02:40:49",
                                      "score": 9,
                                      "num_children": 1,
                                      "author": 52671,
                                      "replies": [
                                        {
                                          "id": "ij50oem",
                                          "text": "I've got time for 3 sentences, especially if it doesn't involve research. Now bye.",
                                          "timestamp": "2022-08-06 02:41:29",
                                          "score": -1,
                                          "num_children": 1,
                                          "author": 354442,
                                          "replies": [
                                            {
                                              "id": "ij513eb",
                                              "text": "That was two.",
                                              "timestamp": "2022-08-06 02:44:57",
                                              "score": 4,
                                              "num_children": 0,
                                              "author": 52671,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "id": "ijezyg0",
                              "text": ">I thought bosses were included\n\nThey clearly aren't, and you should be embarrassed at such a gross oversight.",
                              "timestamp": "2022-08-08 08:06:01",
                              "score": 1,
                              "num_children": 0,
                              "author": 227146,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ij2a6gh",
                  "text": "Yes I understand my experience is anecdotal. I am prepared to be wrong, although of 2 people AND more in my life would find it unlikely to go against such a strong trend. Mostly I want real studies or even surveys- not some video. I even did my own cursory research and could not find a study promoting what you've said is a real trend. In fact, I found the opposite- that most people say they don't care.",
                  "timestamp": "2022-08-05 15:14:26",
                  "score": -8,
                  "num_children": 1,
                  "author": 354442,
                  "replies": [
                    {
                      "id": "ij51bvk",
                      "text": "Unfortunately my anecdotal experience has shown me that female managers are often bad at managing. Be it trying to be too domineering for no reason and micromanaging their staff out the door, or whether they just wanted to be everyone's friend and no issues at work, but would ignore issues and let shitty behavior fly because it was easier than confronting it and or upsetting anyone. I've had a lot of bad managers but some of the worst were women and the general issue was they wanted to treat their work places like a social playground. \n\nBut that's just my anecdotal experience.",
                      "timestamp": "2022-08-06 02:46:54",
                      "score": 6,
                      "num_children": 1,
                      "author": 1716,
                      "replies": [
                        {
                          "id": "ij51t0p",
                          "text": "I'm sure in some fields and places that definitely happens, often even. Wouldn't judge you for being skeptical. I'm done arguing on the other stuff. I had some emergencies come up and I'm no longer involving myself.",
                          "timestamp": "2022-08-06 02:50:50",
                          "score": -1,
                          "num_children": 0,
                          "author": 354442,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ijezsy1",
              "text": ">Me and my best friend would also have no problem working with or for women.\n\n'My best friend and I.'\n\n>No idea what this alleged study is on about, or what your sister is on about.\n\nMaybe you should try thinking harder, and then ask if you can't get it, before writing a snide comment",
              "timestamp": "2022-08-08 08:03:57",
              "score": 2,
              "num_children": 0,
              "author": 227146,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ij1kc8p",
      "text": "No surprise lmao",
      "timestamp": "2022-08-05 12:02:16",
      "score": 40,
      "num_children": 0,
      "author": 80437,
      "replies": []
    },
    {
      "id": "ij26xrk",
      "text": "It could be because female employees can't use certain tactics on female bosses like they can with male bosses (emotional and sexual tactics). Male bosses are probably more lenient to female employees than female bosses are.",
      "timestamp": "2022-08-05 14:53:06",
      "score": 82,
      "num_children": 2,
      "author": 36798,
      "replies": [
        {
          "id": "ij2guav",
          "text": "Yeah you are on the right track (I think). Women bosses treat their female employees as equals or even worse because the woman 'boss' had to work to get there.. sacrifice.. the business is on the line (profits/income) so no time to be 'friends' - it's about the $$ and value that you bring. Meanwhile, with men as bosses... the western men in general are very aware of not mis-treating women or giving them a reason to go to HR in these crazy times so they are OVERLY accommodating/lenient (some call it female privilege) so they don't risk their OWN job. Also, like you said... sexual and emotional tactics that benefit women in the work place environment (I am on my period so excuse me not working as hard today = acceptable and if you fire me or give me a warning then DISCRIMINATION!). Also.. women know that most men will sleep with them if given the chance.. so they dangle that carrot for benefits/easier time at work.. stringing them along and them being 'nicer' to them because they think they have a chance.\n\nImportant to note that this only really happens in 'office and white collar/professional' type settings with the companies/businesses who succumb to a lot of the woke/feminist stuff and who are more concerned about the PERCEPTION of the company rather than the business model and making money. They will forgo productivity/efficiency in order to be perceived as 'woke or pro-feminist' etc. Virtue signalling pretty much because they can afford to (not their company, not their profits and to an extent, the perception of the company matters in terms of income generated... or so they believe).\n\nThis doesn't happen in the vast majority of small businesses and in blue collar jobs, whether it be a man or woman running them because there is no time (and time = money) for virtual signalling and telling people how progressive you are with how many women you hire or what leadership roles they occupy... they simply don't have time for it/care for it since it's all about the $$ and whether you bring value or not (or else you will be woke and broke much sooner/much faster).",
          "timestamp": "2022-08-05 15:57:31",
          "score": 20,
          "num_children": 2,
          "author": 263708,
          "replies": [
            {
              "id": "ij4o3ys",
              "text": ">Women bosses treat their female employees as equals or even worse\n\nIt's typically that female bosses have favorites, women tend to form cliches.",
              "timestamp": "2022-08-06 00:59:12",
              "score": 8,
              "num_children": 1,
              "author": 238975,
              "replies": [
                {
                  "id": "ij4ov3c",
                  "text": "I agree with that.",
                  "timestamp": "2022-08-06 01:05:06",
                  "score": 4,
                  "num_children": 0,
                  "author": 263708,
                  "replies": []
                }
              ]
            },
            {
              "id": "ij30up5",
              "text": "Stats don’t back you up.",
              "timestamp": "2022-08-05 18:04:59",
              "score": -6,
              "num_children": 1,
              "author": 222966,
              "replies": [
                {
                  "id": "ij4dfmn",
                  "text": "stats on 'go woke go broke'? or stats on why 80% of women don't want to work for other women? \n\nThe post is about a stat in that '80% of women not wanting to work for women'. That statistic does not tell you WHY so this whole post/thread is people inputting their opinion as to 'why' in regards to a 'stat'. If you have studies that indicate why 80% of women don't want to work for other women, can you please share them?",
                  "timestamp": "2022-08-05 23:34:53",
                  "score": 4,
                  "num_children": 1,
                  "author": 263708,
                  "replies": [
                    {
                      "id": "ij65pbk",
                      "text": "The post isn’t even a “stat”, it’s an observation. The person who made the observation is very clear it’s a small sample size and wasn’t done with any rigour regarding how selection of statistics were calculated.",
                      "timestamp": "2022-08-06 10:39:31",
                      "score": 0,
                      "num_children": 2,
                      "author": 222966,
                      "replies": [
                        {
                          "id": "ij6xmgq",
                          "text": "Okay good point (it can be both... an observation based on a stat, albeit small sample size and anecdotal) ... and we are all here speculating and inputting our suggestions as to WHY?  This is literally... the whole thread lol.\n\nAnyway.. you said the stats don't back me up, can you guide me towards the stats that don't back me up? a study would be great but at this point, I'll settle for an article or a blog (lol).",
                          "timestamp": "2022-08-06 14:59:49",
                          "score": 2,
                          "num_children": 0,
                          "author": 263708,
                          "replies": []
                        },
                        {
                          "id": "ij73nsn",
                          "text": "... Who then goes on to give the source that *has* been tracking this for the last 60 years.",
                          "timestamp": "2022-08-06 15:43:05",
                          "score": 1,
                          "num_children": 0,
                          "author": 348010,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ij6aney",
          "text": "Bro have you met a working woman? Not everyone (in fact not most) are ok with acting like a sex doll for men. It's weird and creepy",
          "timestamp": "2022-08-06 11:40:33",
          "score": 0,
          "num_children": 1,
          "author": 68131,
          "replies": [
            {
              "id": "ij6dufq",
              "text": "What I mean by sexual tactics is flirting. And yes, I have met working women. Also, to you it's creepy, not to others though.",
              "timestamp": "2022-08-06 12:14:40",
              "score": 5,
              "num_children": 0,
              "author": 36798,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ij1p2av",
      "text": "what reason will they give? internalised mysogny?",
      "timestamp": "2022-08-05 12:43:52",
      "score": 41,
      "num_children": 1,
      "author": 380875,
      "replies": [
        {
          "id": "ij24ykr",
          "text": "Of course!",
          "timestamp": "2022-08-05 14:40:02",
          "score": 15,
          "num_children": 0,
          "author": 304941,
          "replies": []
        }
      ]
    },
    {
      "id": "ij2ik5m",
      "text": "Why am I not surprised this is free to air Australian morning news and channel 10 at that (the same network that has 'the project'). The other FTA networks are just as bad/the same too.\n\nSigh. No wonder Australia is so cucked/feminised. This is literally ALL that happens i.e. every segment/article/report is women = victims and men = bad guys. Not once is there any consideration or empathy towards mens/boys issues and commentary about men that is sympathetic and if there is the odd thing.. it's on shunned/demonised paid networks like sky news australia and made fun of/dismissed on the basis of it being 'crazy and farrrrr 'right''.\n\nR.I.P. Australia. At least in the U.S. you have a somewhat equal opposition to feminists/woke crap in the media (cnn vs fox news as an example). I'm not even saying I like fox news or the far right or whatever... I am saying it's EXTREMELY important to have at least an equal, crazy opposite view expressed in the mainstream to allow people to come to their own conclusions and eventually fall somewhere in the middle/most reasonable positions. When all you hear/see/is promoted is the woke/pro-feminist stuff... without the opposite or even a more 'reasonable view' of the issues... then it is just rational/logical to assume the population will succumb and follow what is seen as most 'normal or popular'. All humans are sheep for the most part.",
      "timestamp": "2022-08-05 16:08:34",
      "score": 13,
      "num_children": 0,
      "author": 263708,
      "replies": []
    },
    {
      "id": "ij27n1p",
      "text": "Most of the boss bitches don't understand that leadership doesn't equal  being an alpha asshole.\n\n\nP. S. I often hear woman complain about another female getting a job/position/ unfair treatment she thinks she should have gotten.\nNever heard a male comrade talk about it more than just a few sentences (except the Booze be speaking and even then rarely)",
      "timestamp": "2022-08-05 14:57:43",
      "score": 34,
      "num_children": 2,
      "author": 49030,
      "replies": [
        {
          "id": "ij2byee",
          "text": "Nailed it.  The whole girl boss culture is based on commanding and controlling.   Guess what though, it's the least effective leadership method.   It's the kind of leadership that people flee in droves and is only effective at the lowest level where unskilled labor dwells and there is a steady turnover anyways.",
          "timestamp": "2022-08-05 15:26:04",
          "score": 19,
          "num_children": 2,
          "author": 229348,
          "replies": [
            {
              "id": "ij355p1",
              "text": "Not even commanding. Demanding. Pouting, tantrums, and other childish delights.",
              "timestamp": "2022-08-05 18:32:40",
              "score": 7,
              "num_children": 0,
              "author": 224697,
              "replies": []
            },
            {
              "id": "ij2ifvb",
              "text": "\n\nYeah, whenever I took over group projects in \"Gymnasium\" (5th-12th grade - better version of \"Realschule\" (still possible to get highest degree, just takes one year longer)\nI often took lead and scheduled tasks to everyone fitting their skills.\nMyself I did personally less because I always was the 1. Person to talk to and do all tasks related to information, guidance, problem-solving (initiating).\nGuess what? All other leaders were male",
              "timestamp": "2022-08-05 16:07:47",
              "score": 1,
              "num_children": 0,
              "author": 49030,
              "replies": []
            }
          ]
        },
        {
          "id": "ij4wl58",
          "text": "very true",
          "timestamp": "2022-08-06 02:07:31",
          "score": 2,
          "num_children": 0,
          "author": 23871,
          "replies": []
        }
      ]
    },
    {
      "id": "ij1xhyd",
      "text": "''It is because of the patriarchy and the internalised misogyny.''   \nWe can't just accept that women are bad leaders. Both men and women dislike working for a woman.   \nI can see the random feminist jumping at my comment saying: ''bUT I kNOw a wOmAn wHO iS a gReAT lEaDeR!''   \nMe: ''Yeah, but as always, the exception does not make the rule.''",
      "timestamp": "2022-08-05 13:48:47",
      "score": 66,
      "num_children": 2,
      "author": 177632,
      "replies": [
        {
          "id": "ij3b9ua",
          "text": "The other interpretation is that women have advantages as well as disadvantages in the workplace. Working for a man has advantages for women, getting favorable treatment, using certain tactics, etc. so they prefer that. Working for another woman takes away those advantages and levels the playing field and takes away their ability to play on Easy Mode.",
          "timestamp": "2022-08-05 19:11:54",
          "score": 13,
          "num_children": 0,
          "author": 387812,
          "replies": []
        },
        {
          "id": "ij303e1",
          "text": "Any evidence that women are bad leaders? Data seems to tell the opposite \n\nhttps://www.forbes.com/sites/avivahwittenbergcox/2021/03/06/data-shows-women-make-better-leaders-who-cares/?sh=3c77b62e46be",
          "timestamp": "2022-08-05 18:00:09",
          "score": -14,
          "num_children": 1,
          "author": 222966,
          "replies": [
            {
              "id": "ij4vdms",
              "text": "Biased data. \"Who cares\" stupid data. It's like one of those research that says women are better drivers. One example is Finland during the covid crisis. The covid crisis there didn't get any better because of \"lack of leadership\". And why Forbes? It's like any other mainstream medias. They are run by narrative not truth. Also here,\n\nhttps://redd.it/hpds9c\n\nThe post above has some crunched numbers from European CDC data and it shows that:\n\n* In countries with high or very high development, the median death rate is 55/million in female-led countries (Barbados, Belgium, Bolivia, Denmark, Finland, Germany, Iceland, New Zealand, Norway, Serbia, Switzerland, Taiwan) and 28/million in male-led countries.\n* The median degree of government response is 75/100 in female-led countries and 81/100 in male-led countries.\n* The median time to any meaningful response is 13 days in female-led countries and 11 days in male-led counties.\n* Out of all countries, the median death rate is 52/million in female-led countries (Bangladesh plus the twelve mentioned before) and 9/million in male-led countries.",
              "timestamp": "2022-08-06 01:57:33",
              "score": 6,
              "num_children": 1,
              "author": 331535,
              "replies": [
                {
                  "id": "ij64n1h",
                  "text": "Wait… so Forbes is biased, whereas some random on Reddit isn’t? \n\nBtw- that’s entirely based on Covid data, which is hugely complicated. Population density, whether they were part of a continent, how they crunched numbers and how they reported are factors individual to each country and practically impossible to compare (example I know of: Belgium tracked Covid from ANY mention on death certificate and included deaths that were “likely”, from before there were even tests. That’s completely different to how most countries did it which is why their rate was so incredibly high.",
                  "timestamp": "2022-08-06 10:24:49",
                  "score": -3,
                  "num_children": 1,
                  "author": 222966,
                  "replies": [
                    {
                      "id": "ij689x6",
                      "text": "I realized that articles on Forbes are written by different people. Different people, different agenda. Some could or could not be biased. Just like some random on reddit may or may not be biased. My bad. I'm sorry about that. And Like you for example. You're biased. Don't you try to make excuses on the women leaders. The fact that Malaysia and Finland are almost the same size. But Malaysia is doing better even though the country has more population than Finland is saying a lot.\n\nAlso, I have been told that women are better workers,soldiers,police officers and some other things. How women leaders will never start a war. How women bosses and workers don't harass their male workers sexually. Only to found out that those are all bullshit.\n\nExamples:\n\n1. A New Study Reveals Queens Were MUCH More Warlike Than Kings https://www.ancient-origins.net/news-general/warlike-queens-0012861\n\n2. History Says That Female Leaders Are More Likely To Wage War Than Men\nhttps://www.eviemagazine.com/post/history-says-that-female-leaders-are-more-likely-to-wage-war-than-men\n\n3. Queen Ranavalona I: Most Murderous Woman in History https://www.historicmysteries.com/queen-ranavalona-i/\n\n4. Women workers are more mannered right? Meaning they won't bother people. Wrong. Take a look at this video. Men too get sexually harrased.\nhttps://youtu.be/2NQt8V2xnPM\n\n5. Since women are better workers. Then, why not just hire women only? This https://www.letsrun.com/forum/flat_read.php?thread=8638179\n\n6. Women soldiers are terrible https://youtu.be/URGhMw1u7MM\nhttps://youtu.be/FjwtdhpcUzw\nhttps://youtu.be/txX2S80Dt8k\n\n7.Female officers too are terrible. This guy explained it well https://youtu.be/gphzZqXL4-o\n\nAnd yes, long story short. Women leaders suck. Suck it up. It's a universal truth that even God accepts. Even if there are good women leaders. They are exceptions and are like 00.01%. **HARD TO FIND**.",
                      "timestamp": "2022-08-06 11:12:27",
                      "score": 7,
                      "num_children": 0,
                      "author": 331535,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ij5rvwl",
      "text": "I swear feminists hate each other and blame men for it lmao",
      "timestamp": "2022-08-06 07:25:26",
      "score": 6,
      "num_children": 0,
      "author": 403255,
      "replies": []
    },
    {
      "id": "ij296dl",
      "text": "I've been in the workforce for over 20 years now. In that time frame about 90% of my administrators were women.  of those 90% I would only choose to go back and work for one of them.   Only one had the skills of a very good manager, everyone else was generally more interested in exerting power and acting important.",
      "timestamp": "2022-08-05 15:07:49",
      "score": 15,
      "num_children": 1,
      "author": 229348,
      "replies": [
        {
          "id": "ij4lpp3",
          "text": "[deleted]",
          "timestamp": "2022-08-06 00:39:58",
          "score": 4,
          "num_children": 1,
          "replies": [
            {
              "id": "ij55g4x",
              "text": "Yup,  I work in a woke insurance giant.   Nothing is about merit.   They routinely let everyone know that women will be given preference in hiring.   I'm actually not sure how that's legal,  but ok.",
              "timestamp": "2022-08-06 03:22:18",
              "score": 6,
              "num_children": 0,
              "author": 229348,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ij2uv0m",
      "text": ">Don't try to understand women. Women understand women and they hate eachother --Al Bundy",
      "timestamp": "2022-08-05 17:26:59",
      "score": 12,
      "num_children": 0,
      "author": 303240,
      "replies": []
    },
    {
      "id": "ij3ad9p",
      "text": "Ong this is gonna be spun into it being men’s fault.",
      "timestamp": "2022-08-05 19:06:02",
      "score": 4,
      "num_children": 0,
      "author": 69429,
      "replies": []
    },
    {
      "id": "ij473rm",
      "text": "I am a man who has had plenty of bosses that were both men and women. This is all my own experiences so this is only my perspective. Now I want to say that I have both good bosses that were men and good bosses that were women that I liked so I am trying to be fair and equal in my assessment. I have also had terrible bosses that were both men and women.\n\nSo now that I have this out of the way, I am going to tell my experiences from an egalitarian lens and a true egalitarian lens. I have noticed that when it comes to having a man as a boss, things seem a bit easier to communicate issues because even when I'm not 100% clear in what I am saying, they're able to piece together what my thoughts much quicker. This means it's easier to get answers to my problems a lot faster too because male bosses are more likely to tell it to you straight with maybe some sugar coating so your feelings aren't hurt too much if the news isn't good. Also if a male boss is upset, I have learned that he'll yell or talk to you about about and the issue is done and resolved. You give the guy about a half-hour to maybe a full hour and he's calmed down and willing to talk to you with a normal tone.\n\nNow Female bosses are bit of different story. Their communication is clear but they don't always tell things to you straight and it gets annoying plus they often leave answers to questions very open ended that you're double guessing the answer in your head. Also when they are mad, you get yelled at and for the rest of the day, she's going to be pissed off at you. This can be hard to work with because it makes it hard to talk to her especially when I need something from her and she's upset at me to help out. I have seen female bosses go on power trips not because of their egos so much as their insecurities to prove themselves. This gets to be problematic because sometimes I need them to make a decision on something and they're too busy trying to think about the decision instead of just making the decision so we can move forward. However I will give female bosses some credit, like male bosses, they too can jump and get to work if we need help. It doesn't happen all the time but I have seem plenty of my female bosses get on the work floor and start working when we're short staffed.\n\nSo with that said, I still prefer male bosses simply because they're way less emotional in the workspace. I prefer a workplace where there is less emotions in the space especially from the upper management. I personally feel the emotions are what makes some the workplace drama even worse. I don't immediately write off female bosses but I admit I have more of an unconscious bias to be weary of their motives. I listen to the female bosses just as much as I listen to the male bosses but I know many female bosses feel like they need to prove themselves to be competent and not some kind of diversity promotion or diversity hire.",
      "timestamp": "2022-08-05 22:46:42",
      "score": 5,
      "num_children": 0,
      "author": 171580,
      "replies": []
    },
    {
      "id": "ij50m8j",
      "text": "Can confirm with multiple perspectives from friends, my mother and one from myself. The female supervisors my mother have had were typically catty, backstabbing, often bitchy or disgruntled if she needed to take time off to come pick me up for an appointment at school.\n\nFriends have stated that working under women was 10x's more miserable especially in the service industry.\n\nIn my perspective let me put it like this: Last month a new department supervisor sent an email to her section stating that she was pushing for a in-person return to office. She got 7 resignation letters within 3 hours, and I received 8 transfer request.",
      "timestamp": "2022-08-06 02:41:00",
      "score": 3,
      "num_children": 0,
      "author": 310129,
      "replies": []
    },
    {
      "id": "ij2j4bg",
      "text": "So instead of saying \"maybe women don't make the best leaders\"\n\nthe response will be \"how can we keep hitting our heads against the wall until we get the outcome that we want?\"",
      "timestamp": "2022-08-05 16:12:13",
      "score": 10,
      "num_children": 1,
      "author": 387997,
      "replies": [
        {
          "id": "ij30lfu",
          "text": "Where do you find stats that say that though? Every study points to the opposite \n\nhttps://www.forbes.com/sites/avivahwittenbergcox/2021/03/06/data-shows-women-make-better-leaders-who-cares/?sh=3c77b62e46be",
          "timestamp": "2022-08-05 18:03:20",
          "score": -6,
          "num_children": 1,
          "author": 222966,
          "replies": [
            {
              "id": "ij5mel6",
              "text": "I just want to try and understand here:\n\nPoint #1: Women leaders handled covid better - Did the NZ prime minister do a good job, or is it the fact that she runs an island country have something to do with it? There are thousands of variables that go into how \"well\" the pandemic was handled, I remember reading how this study was debunked once they accounted for confounding variables. I could easily say that more egalitarian countries are more first world, meaning better healthcare, meaning less deaths. \n\nPoint #2: Companies who have a better gender balance do better - How does this mean women are better leaders? It could have more to do with having a larger hiring pool. Which has always been the concept in egalitarian cultures. (There may be separate downsides though) \n\nPoint #3: Women are hired in the public sector - The public sector is notoriously useless are the opposite of a meritocracy. \n\n>despite the research pointing to the embarrassingly emotional, testosterone-driven relationship men have with risk.\n\nThis article is clearly biased.",
              "timestamp": "2022-08-06 06:15:14",
              "score": 3,
              "num_children": 1,
              "author": 387997,
              "replies": [
                {
                  "id": "ij65l3w",
                  "text": "I should have clarified that I don’t think there’s any real way to compare countries during Covid as there’s too many variables. \n\n#2: not sure what having a larger pool has to do with anything regarding women in leadership positions. Generally they’re comparing large Fortune 500 companies, so you’re just taking a random guess to try and prove your point. \n\n#3 is again an assumption based on nothing but opinion, and is hugely variable depending on the country. I don’t see any evidence saying “public sector is notoriously useless”, except capitalists who like to moan about “red tape”. “Red tape” is what keeps people safe. \n\nThe Forbes article is no more or less biased than OP’s original post. So if bias is something you want eliminated from statistics, you’d need to apply the same logic to a 1 minute clip where the speaker twice says her “research” is of a small sample size and more speculative than actual research.",
                  "timestamp": "2022-08-06 10:37:58",
                  "score": 0,
                  "num_children": 1,
                  "author": 222966,
                  "replies": [
                    {
                      "id": "ij8kp8s",
                      "text": "Agreed, the data is anything but conclusive at the moment\n\n2. The point I was making was how the wording was \"more gender balanced companies\" do better, which says nothing about woman in leadership",
                      "timestamp": "2022-08-06 22:05:02",
                      "score": 1,
                      "num_children": 0,
                      "author": 387997,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ij407ix",
      "text": "It’s cuz they’re their own worst enemy",
      "timestamp": "2022-08-05 21:57:16",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ij5uit9",
      "text": "Women are the hardest on women. Hands down.",
      "timestamp": "2022-08-06 08:01:27",
      "score": 3,
      "num_children": 0,
      "author": 181328,
      "replies": []
    },
    {
      "id": "ij39euh",
      "text": "This appears clearly polarizing in that these women are (generally speaking) split between those who are smart enough to understand why they (probably) shouldn't... and... those who are grade-A, fists-raised, 'you go girl', feminist hypocrites who will blame everything on everyone (mostly Male) rather than where the blame properly exists... their own choices in life... which, btw, is generally true for every other Earth-dwelling homo sapien.  But oh, no, not them... they float above the ground and are innately (and laughably) infallible.\n\nP.S.: I just noticed, poor fellow, the one lone male on the panel.  Brave soul.",
      "timestamp": "2022-08-05 18:59:54",
      "score": 2,
      "num_children": 0,
      "author": 279935,
      "replies": []
    },
    {
      "id": "ij4pe9o",
      "text": "Honestly every female boss I’ve had, had a major chip on their shoulder and wanted to prove themselves as better/equal to a man. But they only ever try to emulate the “hard” and “tough” aspects of a male boss. They usually just come across as arrogant.",
      "timestamp": "2022-08-06 01:09:20",
      "score": 2,
      "num_children": 0,
      "author": 195541,
      "replies": []
    },
    {
      "id": "ij264am",
      "text": "I think this is probably a combination of evolutionary psychology and social reasons.\n\nMen and women both naturally prefer certain things in their work environment.\n\nFor example, men prefer to work with beautiful women. It just makes you feel good being around them, even if you don't have a personal relationship. By the same token, women are naturally hypergamous, and there's something in them that enjoys having a male boss. Additionally, women naturally compare themselves to one another. This is probably the main reason that social media is causing women's levels of anxiety and depression to skyrocket, because the ability to compare and compete with other women has skyrocketed.\n\nHaving a female boss activates that same tendency to compare oneself and feel inferior.",
      "timestamp": "2022-08-05 14:47:44",
      "score": 3,
      "num_children": 2,
      "author": 304941,
      "replies": [
        {
          "id": "ij6pqf6",
          "text": "Waow. Some excellent generalising there.",
          "timestamp": "2022-08-06 14:00:09",
          "score": 1,
          "num_children": 0,
          "author": 139852,
          "replies": []
        },
        {
          "id": "ij30ga3",
          "text": "Men are hypogamous. That’s why they like younger women who aren’t as smart and don’t talk as much as they do.",
          "timestamp": "2022-08-05 18:02:25",
          "score": -6,
          "num_children": 0,
          "author": 222966,
          "replies": []
        }
      ]
    },
    {
      "id": "ij30ie9",
      "text": "Did any of you muppets listen to this? “My research was Anecdotal. Which means not actually based on anything.\n\nGo read a book and learn to become better people.",
      "timestamp": "2022-08-05 18:02:47",
      "score": 3,
      "num_children": 0,
      "author": 306443,
      "replies": []
    },
    {
      "id": "ij31nf0",
      "text": "Can Confirm; I work with a lot of Women under my Lead. And they are absolutely... *CATTY* with any other women who are their Leads or High Positions.\n\nThe only thing remotely \"misogynistic\" I've heard of, is that \"The Boss likes to hire these Women for Leadership Roles because it's his kink, because they're pretty or because he's had an affair with them.\"\n\nOf course these are just rumors spread by the working women, no real evidence that any of that is true.",
      "timestamp": "2022-08-05 18:10:10",
      "score": 4,
      "num_children": 0,
      "author": 98291,
      "replies": []
    },
    {
      "id": "ij22u01",
      "text": "No one said anything about misogyni in the video",
      "timestamp": "2022-08-05 14:25:39",
      "score": -3,
      "num_children": 1,
      "author": 141960,
      "replies": [
        {
          "id": "ij251f6",
          "text": "Because you didn't watch it long enough. Guaranteed they do.",
          "timestamp": "2022-08-05 14:40:34",
          "score": 10,
          "num_children": 0,
          "author": 304941,
          "replies": []
        }
      ]
    },
    {
      "id": "ij30w5c",
      "text": "100% having a female boss is a total nightmare compared to a female boss. I once got contracted to weld for a female boss. I walked in and asked who’s in charge? Then I heard “I am”. Turned around and I saw a blonde small framed women who didn’t waste any time telling me she was military. I said “I think there’s been a mistake.” And walked out. Already been through it a lot in life. Women who are in a masculine field watch you do your job which they know nothing about and try to knit pick your work for whatever reason pretending they understand what you’re doing. Simply because they feel like they should know since they’re in a male dominant field. \n\nI don’t do female bosses.",
      "timestamp": "2022-08-05 18:05:14",
      "score": 0,
      "num_children": 0,
      "author": 222118,
      "replies": []
    },
    {
      "id": "ij27h9z",
      "text": "I've been downvoted for just expressing a pretty non-inflammatory point of view here.\n\nHow about we start with a link to the actual study instead of a video? If anyone wants to flame and downvote me, why don't we start there? That way maybe you'll at least have some valid reason/proof to flame me instead of the fact you don't personally like my views.\n\nFeelings aren't facts, right?",
      "timestamp": "2022-08-05 14:56:40",
      "score": -8,
      "num_children": 1,
      "author": 354442,
      "replies": [
        {
          "id": "ij29f6y",
          "text": "Alright. I knew someone was going to blame me for not doing my own research, so I did a quick search. found this\n\n https://www.pewresearch.org/social-trends/2013/12/11/on-pay-gap-millennial-women-near-parity-for-now/\n\nhttps://www.pewresearch.org/fact-tank/2013/12/16/who-men-and-women-prefer-as-their-co-workers/\n\n\nSomewhere buried in there, apparently most people- men and women- say they don't care about the gender of their boss. Figured this sub might also enjoy the pay gap info as well. Well, you're welcome. I did my own research, and I now feel even better about calling BS.\n\nDamn, this is way too much. I really need to get a life.",
          "timestamp": "2022-08-05 15:09:25",
          "score": -3,
          "num_children": 0,
          "author": 354442,
          "replies": []
        }
      ]
    },
    {
      "id": "ij4mgtw",
      "text": "Why didn’t you play the whole thing? You’re preemptive offended. They didn’t say anything even feministic in this clip",
      "timestamp": "2022-08-06 00:46:00",
      "score": 0,
      "num_children": 0,
      "author": 25597,
      "replies": []
    },
    {
      "id": "ij2s4fy",
      "text": "Nah it's cuz female bosses are more likely to be undesirable compared to male bosses.",
      "timestamp": "2022-08-05 17:09:33",
      "score": 1,
      "num_children": 0,
      "author": 133108,
      "replies": []
    },
    {
      "id": "ij33rb2",
      "text": "Guess what Women! Me neither lol",
      "timestamp": "2022-08-05 18:23:40",
      "score": 1,
      "num_children": 1,
      "author": 11233,
      "replies": [
        {
          "id": "ij6j7uf",
          "text": "Finally something both sexes can agree on!!",
          "timestamp": "2022-08-06 13:05:33",
          "score": 1,
          "num_children": 0,
          "author": 260298,
          "replies": []
        }
      ]
    },
    {
      "id": "ij3ih4w",
      "text": "If a tree falls in the forest and there is nobody around to hear it, is the man still wrong?",
      "timestamp": "2022-08-05 19:58:21",
      "score": 1,
      "num_children": 0,
      "author": 116427,
      "replies": []
    },
    {
      "id": "ij461ah",
      "text": "I feel the same way !",
      "timestamp": "2022-08-05 22:38:55",
      "score": 1,
      "num_children": 0,
      "author": 372815,
      "replies": []
    },
    {
      "id": "ij5c3di",
      "text": "Registered Nurse (ugh!) who works in the auto repair field with sturdy resourceful women counterparts. I honestly deep-down feel bad for the women in the latter mentioned job because I've spent over a decade being subjected to the women who rule the former mentioned job.",
      "timestamp": "2022-08-06 04:23:35",
      "score": 1,
      "num_children": 0,
      "author": 160374,
      "replies": []
    },
    {
      "id": "ij5ez7d",
      "text": "Lol anything to justify your view I guess.  Even if it isn't backed.",
      "timestamp": "2022-08-06 04:52:25",
      "score": 1,
      "num_children": 0,
      "author": 225488,
      "replies": []
    },
    {
      "id": "ij5pgxm",
      "text": "Okay but why? I wish she had went into detail regarding those she asked into giving their reasons. I would've liked to hear if they were similar or varied.",
      "timestamp": "2022-08-06 06:53:39",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ij6vvqi",
      "text": "Women can be incredibly cruel to other women, like completely ruthless.",
      "timestamp": "2022-08-06 14:46:58",
      "score": 1,
      "num_children": 0,
      "author": 312519,
      "replies": []
    },
    {
      "id": "ij73qdy",
      "text": "I looked for the said study but couldn’t find it. Anybody have any luck?",
      "timestamp": "2022-08-06 15:43:34",
      "score": 1,
      "num_children": 0,
      "author": 27318,
      "replies": []
    },
    {
      "id": "ij87oek",
      "text": "The Milf hosting the show is Natarsha Belling.\n\nYou're welcome.",
      "timestamp": "2022-08-06 20:27:14",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ija7po7",
      "text": "It's unfortunate neither the interviewee nor apparently anyone here in the comments has actually looked at the Gallup data.\n\nUnless some significant shift away from the trend has happened in the past few years, as of 2017 almost equal percentages of women prefer to work for a male vs. female boss, with almost half (the most common response) being no preference either way.[1]\n\nDon't know which studies this woman is referring to, but the highest percentage of preference for a male boss among women respondents ever recorded by Gallup was 60%, and that was almost 50 years ago. It's been trending down ever since. Would really like to see the studies to determine the possible causes for the different results.\n\n[1]https://news.gallup.com/poll/222425/americans-no-longer-prefer-male-boss-female-boss.aspx",
      "timestamp": "2022-08-07 06:52:40",
      "score": 1,
      "num_children": 0,
      "author": 22786,
      "replies": []
    },
    {
      "id": "ijcvi3j",
      "text": "You know all those diversity training courses we take that go through things like unconscious bias? One thing that struck me about them recently is if you look at the examples provided in these courses, you almost never see examples where a straight white man is in the role of \"victim\" or person being incorrectly judged. \n\nHere's the thing I find sort of funny about this. If a straight white man is the boss, he understands others like him and these training courses help him bridge the gap with other groups because he has clear examples he's been given - the training helps him be a better boss. If by contrast the boss is a visible minority woman, the training helps her understand some people, but not all, and in a western country, she's probably going to have a fair number of straight white dudes working for her and a bunch of white women. My point is, these programs do not train visible minority women to wield power effectively and fairly as well as it does white men, which is clearly unintentional.",
      "timestamp": "2022-08-07 20:52:23",
      "score": 1,
      "num_children": 0,
      "author": 67572,
      "replies": []
    },
    {
      "id": "ij4e7lh",
      "text": "Once i heard a quote:\n\n\"I don't need to understand a woman. Women already do, and they hate each other\"",
      "timestamp": "2022-08-05 23:40:51",
      "score": 0,
      "num_children": 0,
      "author": 82368,
      "replies": []
    },
    {
      "id": "ij4ptar",
      "text": "I never try to understand women. Women understand women and they hate each other.",
      "timestamp": "2022-08-06 01:12:41",
      "score": 0,
      "num_children": 0,
      "author": 131295,
      "replies": []
    },
    {
      "id": "ij54wui",
      "text": "I am Jack’s Complete Lack of Surprise.\n\n\nSo what you’re *saying* is….Politics are better without too many women in it?",
      "timestamp": "2022-08-06 03:17:40",
      "score": 0,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ij57jq8",
      "text": "My Ex Wife hates working with and under women, seeing the bullying and political bullshit that women engage in so many times, reckons she has a far better life working for and with Men, all just get on with the job without the crap.",
      "timestamp": "2022-08-06 03:40:43",
      "score": 0,
      "num_children": 0,
      "author": 346335,
      "replies": []
    },
    {
      "id": "ij7pkfz",
      "text": "I’ve had only female bosses… I’ve been in female-dominated fields. They’re awesome. Women need to stop putting each other down… it’s a ridiculous stereotype and women bosses can be terrible or amazing, just like men.",
      "timestamp": "2022-08-06 18:15:35",
      "score": 0,
      "num_children": 0,
      "author": 295982,
      "replies": []
    }
  ]
}