{
  "id": "wi62go",
  "text": "Yeah, thank goodness for that...\n",
  "timestamp": "2022-08-07 03:38:05",
  "score": 3822,
  "subreddit": "t5_3fdcn",
  "num_children": 10,
  "author": 52387,
  "replies": [
    {
      "id": "ij9pfnv",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-08-07 03:38:05",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "ij9z7cr",
      "text": "Maybe we should start calling School Shooting \"Post-Natal Abortions\" and they may actually do something...\n\n...or the puny rests of their brains completely liquify... either way it would be a  win.",
      "timestamp": "2022-08-07 05:13:27",
      "score": 187,
      "num_children": 2,
      "author": 8211,
      "replies": [
        {
          "id": "ijalqpj",
          "text": "They know about the hypocrisy and they don't care.",
          "timestamp": "2022-08-07 10:03:50",
          "score": 64,
          "num_children": 1,
          "replies": [
            {
              "id": "ijao06s",
              "text": "But I want them openly and publicly state that they support PNA :)\n\nAt the very least it is possible to fracture their base and it's better when they beat themselves up than others.",
              "timestamp": "2022-08-07 10:35:16",
              "score": 21,
              "num_children": 1,
              "author": 8211,
              "replies": [
                {
                  "id": "ijc3rpo",
                  "text": "It won't fracture their base.\n\nFascists fall in line with whatever the current euphemism for \"the Jews\" is.",
                  "timestamp": "2022-08-07 17:43:09",
                  "score": 3,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ijat6qy",
          "text": "Yes this or Very Late Term Abortions",
          "timestamp": "2022-08-07 11:41:02",
          "score": 8,
          "num_children": 0,
          "author": 257952,
          "replies": []
        }
      ]
    },
    {
      "id": "ij9wu46",
      "text": "Pretty much.",
      "timestamp": "2022-08-07 04:48:44",
      "score": 23,
      "num_children": 0,
      "author": 265752,
      "replies": []
    },
    {
      "id": "ijaye44",
      "text": "They had their chance, and they squandered it. Of these “people” wanted to survive, they should’ve pulled themselves up by their bootstraps. Smh my head\n    \n>!/s!<",
      "timestamp": "2022-08-07 12:36:29",
      "score": 14,
      "num_children": 0,
      "author": 309275,
      "replies": []
    },
    {
      "id": "ijch2gl",
      "text": "Report had the gunman shooting most of the kids in the head. Which mean their heads exploded/decapitation from the lower jaw up.   \n\nThis is why they had to identify them by clothing items and DNA \n\nTHEY HAD NO HEADS",
      "timestamp": "2022-08-07 19:13:34",
      "score": 9,
      "num_children": 1,
      "replies": [
        {
          "id": "ijd3pf4",
          "text": "... I have no words.",
          "timestamp": "2022-08-07 21:48:13",
          "score": 3,
          "num_children": 0,
          "author": 186153,
          "replies": []
        }
      ]
    },
    {
      "id": "ijb6l88",
      "text": "Disturbing but accurate.",
      "timestamp": "2022-08-07 13:48:41",
      "score": 7,
      "num_children": 0,
      "author": 6297,
      "replies": []
    },
    {
      "id": "ijba1en",
      "text": "\"It was God's will.\"",
      "timestamp": "2022-08-07 14:15:37",
      "score": 5,
      "num_children": 0,
      "author": 104429,
      "replies": []
    },
    {
      "id": "ij9rxmg",
      "text": "I get and like the point but it’s it a bit messed up to draw all the kids dead bodies and then link it to a specific recent even",
      "timestamp": "2022-08-07 04:00:57",
      "score": -29,
      "num_children": 3,
      "author": 222090,
      "replies": [
        {
          "id": "ij9wyxb",
          "text": "I think shock value is what helps those with cognitive dissonance understand the significance of the event.",
          "timestamp": "2022-08-07 04:50:05",
          "score": 78,
          "num_children": 0,
          "author": 265752,
          "replies": []
        },
        {
          "id": "ij9w79c",
          "text": "I disagree, respectfully. Uvalde and the Roe reversal happened close enough to one another that one can't help but see the comparison.",
          "timestamp": "2022-08-07 04:42:10",
          "score": 94,
          "num_children": 1,
          "author": 52387,
          "replies": [
            {
              "id": "ij9wbyx",
              "text": "Once again I agree with the message but those kids were real people and it’s kinda messed up to just have their dead bodies there. The image wouldn’t have to be labeled and the message would still be just as impactful",
              "timestamp": "2022-08-07 04:43:29",
              "score": -29,
              "num_children": 1,
              "author": 222090,
              "replies": [
                {
                  "id": "ij9yh0h",
                  "text": "There's a dichotomy at play, in that the anti-choice crowd had zero issue with displaying photos of aborted fetuses to further their cause - at one point, I saw children holding 4-foot posters along Hollywood Boulevard - but it's considered poor taste to show the victims of yet another mass-shooting? Maybe those pictures need to be publicly displayed as well.\n\nEdit: I personally witnessed the Hollywood Boulevard stunt, back in 2002. The kids holding the posters were yelling \"Stop killing us\" and those posters were graphic, and whoever organized it gave zero shits about who saw the images.",
                  "timestamp": "2022-08-07 05:05:36",
                  "score": 65,
                  "num_children": 1,
                  "author": 52387,
                  "replies": [
                    {
                      "id": "ijbcrp9",
                      "text": "But the aborted fetuses aren’t people, and they sure as shit weren’t kids in school with names and parents. And just because some “pro-life” wack job is doing it - that doesn’t justify shit. The cartoon is in bad taste- and really doesn’t accomplish anything.",
                      "timestamp": "2022-08-07 14:36:01",
                      "score": -11,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ijjnjer",
                          "text": "Exactly what I’m saying",
                          "timestamp": "2022-08-09 05:47:09",
                          "score": 1,
                          "num_children": 0,
                          "author": 222090,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ijbhqka",
          "text": "Maybe they should go to conservative college campuses and set up a giant mural filled to the top with pictures of dead kids’ bodies that you have no choice to see every time you go to class\n\nYou know, like they do with pictures of abortions",
          "timestamp": "2022-08-07 15:11:51",
          "score": 12,
          "num_children": 0,
          "author": 219225,
          "replies": []
        }
      ]
    },
    {
      "id": "ijb3qqf",
      "text": "Using actual an actual event where real children were killed for some political cartoon is pretty fucked up. \n\nWhat good does this cartoon do?",
      "timestamp": "2022-08-07 13:25:43",
      "score": -44,
      "num_children": 1,
      "replies": [
        {
          "id": "ijb71u5",
          "text": "You know that’s like the point of politics right?\n\nIt affects real people? Real people die due to the decisions of those in power?\n\nThat’s like the entire point?",
          "timestamp": "2022-08-07 13:52:17",
          "score": 37,
          "num_children": 1,
          "author": 396213,
          "replies": [
            {
              "id": "ijbca0t",
              "text": "A cartoon drawing of someone’s dead and bloody child is disrespectful to both the child and the parent, and you cannot argue that it isn’t. This cartoon doesn’t accomplish anything other than pointing out the obvious and blatant hypocrisy of conservatives- which you don’t need a cartoon to do. Do you really think this cartoon is changing anyone’s mind about gun control or legal abortion access? The artist got his accolades, the OP got the upvotes, we all got a “chuckle” (or whatever was the point), all at the expense of dead children.",
              "timestamp": "2022-08-07 14:32:22",
              "score": -27,
              "num_children": 1,
              "replies": [
                {
                  "id": "ijcd71j",
                  "text": "Nobody is laughing about this, it's not designed to make you happy. The purpose is to keep events like this in the human perception, forcing us to not forget and keeping us on task for preventing them ever happening in the future. I'm tired of people pretending to care about the victims and their families while waiting for things to just \"blow over.\"",
                  "timestamp": "2022-08-07 18:47:01",
                  "score": 6,
                  "num_children": 1,
                  "author": 208849,
                  "replies": [
                    {
                      "id": "ijcgult",
                      "text": "I don’t know - I think reducing someone’s dead child to a scribbled cartoon for political points is in poor taste and accomplishes nothing.",
                      "timestamp": "2022-08-07 19:12:04",
                      "score": -2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ijcicqr",
                          "text": "If I ever die of a botched abortion or in a mass shooting or in any politically controversial sort of way, I fully support actual pictures of my dead body being used for \"for political points\" for the same reason Emmett Till's mother insisted on an open casket.  People need to see the consequences of who and what they vote for or support.  What's disrespectful to those kids and their parents is that those kids died at all.  I can't imagine giving a flying fuck about a cartoon when my child is dead.",
                          "timestamp": "2022-08-07 19:22:21",
                          "score": 4,
                          "num_children": 1,
                          "author": 3961,
                          "replies": [
                            {
                              "id": "ijck6y5",
                              "text": "I honestly don’t care if you agree with me and I’m clearly not in the majority here. Could the point have been made without the specific name of a school on it? You wouldn’t be mad if some artist drew your dead child as a shitty scribble? I personally think they deserve a little more respect. Do you really think this drawing changed anyones mind about gun control? \n\nGuns are fucking stupid and the 2nd amendment needs to be abolished.",
                              "timestamp": "2022-08-07 19:34:51",
                              "score": 0,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "ijcl8c2",
                                  "text": "No, I would not mind.  I would be too busy mourning my child.  I don't know if it changed anyone's mind.  It's possible it was viscerally disturbing enough to get through to somebody, though.  \n\nI'm sick of all the vapid concern for superficial shit like \"oh noes somebody drew a cartoon of a dead child.\"  It doesn't matter.  What's offensive is the *dead child.*  Fuck the tone policing bullshit.",
                                  "timestamp": "2022-08-07 19:41:59",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 3961,
                                  "replies": [
                                    {
                                      "id": "ijcw1lr",
                                      "text": "Really cool",
                                      "timestamp": "2022-08-07 20:56:06",
                                      "score": 1,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ije9x1m",
      "text": "I get it and I'm always super sad with any type of violence especially involving children, but we can't give up our guns. We are the last country to keep our guns and when our government eventually loses its shit and comes after its people (they've been going down that path in recent years) there is no one coming to help us and nowhere for us to run. If you think it's a good idea to give up our guns in the name of safety, please remember what the US government did to the Indians after they gave up their guns in the name of safety and protection and you can also look at what happened to the undesirables in Germany and the Soviet Union after they gave up their guns. It never ends up well for people, especially in times of an economic crisis. Why is the government pushing for gun control? It's not going to do much with the criminals with guns so why are they coming as our government has been trending towards totalitarianism little by little? \n\nIt also doesn't help that a lot of the left doesn't know dick about the guns they want to ban. Either ban them all from literally everyone even the government, police, and military, or don't ban them at all. Because if you do end up banning them it might not be you who is subjugated, but it might really be your grandkids or great-grandchildren. \n\nLastly, why does our IRS have so many fucking guns and ammunition? Why the hell do they need that?",
      "timestamp": "2022-08-08 03:15:40",
      "score": 0,
      "num_children": 0,
      "author": 286930,
      "replies": []
    }
  ]
}