{
  "id": "wptnpx",
  "text": "Democracy shall prevail\n",
  "timestamp": "2022-08-16 12:56:55",
  "score": 6460,
  "subreddit": "t5_3fdcn",
  "num_children": 18,
  "author": 194017,
  "replies": [
    {
      "id": "ikihwik",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-08-16 12:56:55",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "ikjbgv0",
      "text": "if you like the idea of elections, you can't vote Republican.",
      "timestamp": "2022-08-16 16:15:14",
      "score": 137,
      "num_children": 0,
      "author": 87302,
      "replies": []
    },
    {
      "id": "ikj87e4",
      "text": "Biden won 4 states by less than a percentage point. Another state by less than two percentage points.\n\nPut another way Biden won Georgia by 12,000 or .02% of the vote.",
      "timestamp": "2022-08-16 15:54:49",
      "score": 92,
      "num_children": 0,
      "author": 380886,
      "replies": []
    },
    {
      "id": "ikio0fi",
      "text": "The problem is this depends on it actually going to the people for a vote. Reminder that the GOP doesn't seem to believe that's how to approach the issue. Just yesterday, [\"West Virginia Gov. Jim Justice \\[...\\] rejected a suggestion by Democrats to let voters decide whether abortion should continue to be allowed in the state\"](https://abcnews.go.com/Health/wireStory/wva-governor-voters-decide-abortion-access-issue-88414713).\n\nWe need to vote them out, each and every one.",
      "timestamp": "2022-08-16 13:44:20",
      "score": 222,
      "num_children": 4,
      "author": 52386,
      "replies": [
        {
          "id": "ikipdwx",
          "text": "Yes, true, in most cases people don’t always have the ability to directly vote on abortion or other important issues. \n\nThis is more just a general reminder that yes, we do have power as individuals to come together and change things  (than specifically being a post *about* abortion)\n\nAnd yah it’s pretty clear Republicans understand participation in free and open elections DOES matter, that’s why they are so dedicated to suppressing it.",
          "timestamp": "2022-08-16 13:54:19",
          "score": 56,
          "num_children": 1,
          "author": 194017,
          "replies": [
            {
              "id": "ikizsrz",
              "text": "Where voting works, great.\n\nBut you need a plan for when it doesn't.",
              "timestamp": "2022-08-16 15:04:02",
              "score": 38,
              "num_children": 1,
              "replies": [
                {
                  "id": "ikj3a22",
                  "text": "Yup, and we need to resist on multiple fronts even when voting *does* work. \n\nFor example abortion or any human rights is also a social issue where public opinion affects de facto policy (e.g abortion may be legalized in a state but a certain community is close minded and drives the clinics/access away without actually forbidding them) changing the minds of the people can be just as effective or more than changing the laws on the books.",
                  "timestamp": "2022-08-16 15:24:23",
                  "score": 21,
                  "num_children": 0,
                  "author": 194017,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ikjb56d",
          "text": "It always goes to a vote. The GOP are in power because more people vote for them in those areas. Sure, there's gerrymandering to some extent, but at the end of the day voting matters a lot.\n\nA little factoid. Evangelicals vote way more than the national average. If the left voted at the rate the evangelicals do, Clinton would have won in 2016 and the supreme court would be stacked 6-3 with more liberal judges. In other words, Roe v Wade would still exist. \n\nSo make sure to vote.",
          "timestamp": "2022-08-16 16:13:11",
          "score": 27,
          "num_children": 1,
          "author": 317154,
          "replies": [
            {
              "id": "ikjpozg",
              "text": "[removed]",
              "timestamp": "2022-08-16 17:43:38",
              "score": 3,
              "num_children": 1,
              "replies": [
                {
                  "id": "ikkgwx9",
                  "text": "they can change the laws because they got the votes. the same way they can set gerrymandering lines and so on and so forth.\n\nVoting isnt a win once and then change everything, its a gradual change, and in states where liberals stay home and conservatives show up, the conservative party has allow further and further control until this point.\n\nin average only about 30-40% of a state eligible voters vote in local elections, in some special elections and primaries its as low as 8%.\n\nyes its the peoples fault.\n\nif you dont pay your bills one month because youre sick, and then next month you decide to not pay again because youre catching up, then next month youve caught up and then decide to not pay because you deserve a treat, and then so on and so on until they start sending you red notes, is that accurate to go \"look this month they sent me a notice to say they are gonna take my home if i dont pay the mortgage!, HOW UNFAIR!\"\n\nno its gradual incremental change until its too late to fix unless you go through even harder steps to make the fix.\n\nYou just got to suck it up and take your civic duty responsibility seriously. Because the bank isnt gonna listen to your sob stories or give your excuses valid or not any merit, they will take what they will take.",
                  "timestamp": "2022-08-16 20:37:26",
                  "score": 1,
                  "num_children": 1,
                  "author": 341138,
                  "replies": [
                    {
                      "id": "ikkldbk",
                      "text": "You're ignoring a centuries-long history of intentional disenfranchisement in order to blame victims.\n\nLow voter turnout is a result of a system that fails completely to represent the will of the people, and the end result of racist bad-faith actors rigging things to keep turnout low by making voting functionally impossible for large swaths of people.\n\nI agree that the highest possible turnout is better.\n\nThen let's get 100% automatic voter registration and mail in ballots to all automatically registered voters to ensure the highest possible turnout, yes?",
                      "timestamp": "2022-08-16 21:06:46",
                      "score": 14,
                      "num_children": 1,
                      "author": 10670,
                      "replies": [
                        {
                          "id": "ikklpv7",
                          "text": "yes we should but to get that you need to vote in progressive representatives who are willing to do that.\n\nThe voters are the people in charge. They ELECT who to represent them.\n\nYou can cry and bemoan that things are unfair, but kansas has shown if people show up, things can go the way the majority wants.\n\nYou seem to be under the impression that politicians need to change things for you to vote. no its that you need to vote for politicians to change.\n\nit goes back to paying your bills, or feeding yourself. Its something you do because its a neccesity to your survival. Hollywood has convinced many that politics is boring and should be ignored or left to old people, and thus old people kept voting and young people have very low turnout rates. \n\nEven in 2020 with mail in voting everywhere and people stuck at home not doing anything, there was still 100m voters who sat on their asses.\n\nthe responsibility lies with the voter. The need for politicians to get you enticed to come out and vote is not how the system should work and is not how it works. The politicians role is to entice you to vote for them. your role to vote remains regardless if the vote is between a horrible option and a bad option, you still need to make the decision and vote. thats your civic duty.",
                          "timestamp": "2022-08-16 21:09:06",
                          "score": -1,
                          "num_children": 0,
                          "author": 341138,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ikkh6p4",
          "text": "There are only 83 days until election day and only 40 percent vote in off year elections, so motivating voters this year can have big returns if you donate time and treasure to help to get people educated on the issues and to the polls.\n\nFor most communities you can research your local candidates, and find out how to contact and help their campaigns here:\nBallotpedia\nhttps://ballotpedia.org/Sample_Ballot_Lookup\n\nSearch out state and county parties too, and ask to help.\n\nYou can help nationally too, concentrating on key races for state offices around the country that will protect the vote and women's rights for the 2024 election:\nhttps://democrats.org/take-action/",
          "timestamp": "2022-08-16 20:39:15",
          "score": 5,
          "num_children": 0,
          "author": 81409,
          "replies": []
        },
        {
          "id": "ikj57dq",
          "text": "This was the very first thing that came to my mind. The GOP only learned to NEVER, EVER allow the voters to decide this directly. First you gerrymander, then you have those legislators vote on it. That’s how they’ll take away reproductive rights on the federal level, too.",
          "timestamp": "2022-08-16 15:36:13",
          "score": 12,
          "num_children": 1,
          "author": 80527,
          "replies": [
            {
              "id": "ikjbpvm",
              "text": "[removed]",
              "timestamp": "2022-08-16 16:16:49",
              "score": -6,
              "num_children": 2,
              "replies": [
                {
                  "id": "ikjfqjl",
                  "text": "You know, I read /u/formenonly's comment several times, and I couldn't find the place where they're \"convincing people not to vote\".  I think you might be being just a *tad* disingenuous in your response, here.",
                  "timestamp": "2022-08-16 16:41:32",
                  "score": 8,
                  "num_children": 1,
                  "author": 215411,
                  "replies": [
                    {
                      "id": "ikjr84l",
                      "text": "I think they're a bad faith actor, tbh\n\n**Edit:** Yep, u/ConspiracistsAreDumb self-identifies as \"Authoritarian Right\"",
                      "timestamp": "2022-08-16 17:53:13",
                      "score": 4,
                      "num_children": 2,
                      "author": 10670,
                      "replies": [
                        {
                          "id": "ikk40uc",
                          "text": "I.e. a nazi.",
                          "timestamp": "2022-08-16 19:13:59",
                          "score": 4,
                          "num_children": 0,
                          "author": 215411,
                          "replies": []
                        },
                        {
                          "id": "ikka15k",
                          "text": "Finally a use for PCM existing",
                          "timestamp": "2022-08-16 19:52:22",
                          "score": 4,
                          "num_children": 0,
                          "author": 176442,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ikjdjd8",
                  "text": "I vote in every election, even primaries and ballot propositions, so settle down. Secondly, the GOP doesn't need to gerrymander at the federal level. Seven states have one Representative: Alaska, Wyoming, Montana, North Dakota, South Dakota, Vermont, and Delaware. From those states alone we get 9 GOP senators and 5 Dems. The Senate is a fundamentally undemocratic institution. But a ton of our presidents have been Senators, so they're not going to change that system. But as these red states make themselves more and more uninhabitable, they can lose congresspeople, but they won't lose Senators. And without The Senate, you can't do anything, as Joe Manchin and Krysten Sinema constantly show us.",
                  "timestamp": "2022-08-16 16:27:56",
                  "score": 5,
                  "num_children": 0,
                  "author": 80527,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ikiqb79",
      "text": "Since we’re all here:\n\n\n[Are you registered to vote?](https://www.vote.org/am-i-registered-to-vote/)\n\n[When is your next election?](https://www.usa.gov/election-office)\n\n[Do you know where to vote?](https://www.vote.org/polling-place-locator/)\n\n[Can you vote absentee?](https://www.vote.org/absentee-voting-rules/)",
      "timestamp": "2022-08-16 14:01:00",
      "score": 41,
      "num_children": 0,
      "author": 75888,
      "replies": []
    },
    {
      "id": "ikkhgpc",
      "text": "Pro-Choice is not pro abortion. It is Choice… and you never know when you might need to make a choice based on innumerable issues in a personal life.",
      "timestamp": "2022-08-16 20:41:04",
      "score": 9,
      "num_children": 0,
      "author": 25055,
      "replies": []
    },
    {
      "id": "ikiou08",
      "text": "Voting does work.\n\nUnless of course you're a GOP supporter in which case you should absolutely boycott all future elections out of principle to own us libs.",
      "timestamp": "2022-08-16 13:50:20",
      "score": 50,
      "num_children": 1,
      "author": 244347,
      "replies": [
        {
          "id": "ikiqq57",
          "text": "“Voting doesn’t work! That’s why I’m trying to prevent access to elections, to save my constituents from wasting their time participating in a meaningless process! This is for your own good and for the good of the nation!”\n\n-\tsome lying GOP slimeball, probably.",
          "timestamp": "2022-08-16 14:03:57",
          "score": 20,
          "num_children": 0,
          "author": 194017,
          "replies": []
        }
      ]
    },
    {
      "id": "ikj1isu",
      "text": "[removed]",
      "timestamp": "2022-08-16 15:13:11",
      "score": 17,
      "num_children": 1,
      "replies": [
        {
          "id": "ikjc83r",
          "text": "I don't know how to communicate this... but when people disagree, voting is how we resolve it. People disagree on what things constitute rights. So you have to vote to resolve it. \n\nIf you'd like to propose a better system than democracy, go ahead. A big portion of the right already think getting rid of democracy in order to enact their agenda would be a good thing.",
          "timestamp": "2022-08-16 16:19:56",
          "score": -2,
          "num_children": 1,
          "author": 317154,
          "replies": [
            {
              "id": "ikje7th",
              "text": "[removed]",
              "timestamp": "2022-08-16 16:32:06",
              "score": 5,
              "num_children": 1,
              "replies": [
                {
                  "id": "ikjkncb",
                  "text": "I think the truth I somewhere down the middle. Yes rights shouldn’t be voted on they should just be. \n\nHowever that is just an ideal, in practice however, rights need to be defended and sometimes the law (which is what encodes rights) fails, as it did when Roe v wade was overturned. \n\nWhen rights are under attack, the first line of defense is voting, it’s not ideal, but then again the situation we are in isn’t either, it’s just the tool we use to defend rights. \n\nIf even voting fails, there are much deeper problems at play and that would be another conversation everyone would rather not have but that sadly we are being faced with.",
                  "timestamp": "2022-08-16 17:12:02",
                  "score": 0,
                  "num_children": 0,
                  "author": 100826,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ikk7gm7",
      "text": "pickles will prevail",
      "timestamp": "2022-08-16 19:35:56",
      "score": 3,
      "num_children": 0,
      "author": 235947,
      "replies": []
    },
    {
      "id": "ikkojfl",
      "text": "If you need or are interested in supporting reproductive rights, [I made a master post of pro-choice resources](https://docdro.id/s3OwS8u). Please comment if you would like to add a resource and spread this information on whatever social media you use.",
      "timestamp": "2022-08-16 21:28:09",
      "score": 3,
      "num_children": 0,
      "author": 168329,
      "replies": []
    },
    {
      "id": "ikiie6d",
      "text": "If you have lost faith in democracy then you have lost faith in our nation.",
      "timestamp": "2022-08-16 13:00:54",
      "score": 20,
      "num_children": 4,
      "author": 194017,
      "replies": [
        {
          "id": "ikit0pt",
          "text": "Yes *chad meme*",
          "timestamp": "2022-08-16 14:19:49",
          "score": 15,
          "num_children": 0,
          "author": 295292,
          "replies": []
        },
        {
          "id": "ikkbpn1",
          "text": "Yup. Both.",
          "timestamp": "2022-08-16 20:03:18",
          "score": 9,
          "num_children": 0,
          "author": 392461,
          "replies": []
        },
        {
          "id": "ikiwop5",
          "text": "Good... ?",
          "timestamp": "2022-08-16 14:44:22",
          "score": 13,
          "num_children": 0,
          "author": 368653,
          "replies": []
        },
        {
          "id": "ikinf3c",
          "text": "Aren't the republicans trying to pay for another vote? If so, this didn't really do anything when they can just pay for another vote time and again until they get the result they went",
          "timestamp": "2022-08-16 13:39:55",
          "score": 6,
          "num_children": 2,
          "author": 255067,
          "replies": [
            {
              "id": "ikinyy6",
              "text": "They are trying to pay for a recount which will fail because it was a blowout",
              "timestamp": "2022-08-16 13:44:02",
              "score": 13,
              "num_children": 1,
              "author": 181958,
              "replies": [
                {
                  "id": "ikioejy",
                  "text": "I hope you are correct",
                  "timestamp": "2022-08-16 13:47:14",
                  "score": 3,
                  "num_children": 0,
                  "author": 255067,
                  "replies": []
                }
              ]
            },
            {
              "id": "ikiojzu",
              "text": "They will lose a second time.\n\nhttps://apnews.com/article/kansas-to-recount-abortion-vote-by-hand-despite-big-margin-d303e1d4275ce6dc8730b9102ab820a9\n\nRepublican insistence on recounts and that every election is corrupt is just part of their larger strategy to get people to lose faith in the voting process.",
              "timestamp": "2022-08-16 13:48:21",
              "score": 5,
              "num_children": 1,
              "author": 194017,
              "replies": [
                {
                  "id": "ikiqlty",
                  "text": "The sad thing is the only people they are fooling with this plan is their own voters. Everybody else is going to vote regardless.",
                  "timestamp": "2022-08-16 14:03:06",
                  "score": 8,
                  "num_children": 1,
                  "author": 257913,
                  "replies": [
                    {
                      "id": "ikjfj9x",
                      "text": "I’m actually not sad about their voters skipping out on elections tbh.",
                      "timestamp": "2022-08-16 16:40:17",
                      "score": 2,
                      "num_children": 0,
                      "author": 80708,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ikkhj11",
      "text": "And don't let them keep yammering that \"Both sides are the same\".\nRespond by asking which Party wants the Government spying on you in your bedroom?",
      "timestamp": "2022-08-16 20:41:29",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ikjryr8",
      "text": "Watching the votes rise and fall on this post like it’s the NYSE",
      "timestamp": "2022-08-16 17:57:50",
      "score": 3,
      "num_children": 0,
      "author": 66587,
      "replies": []
    },
    {
      "id": "ikj3m8t",
      "text": "Fucking vote!!!!!",
      "timestamp": "2022-08-16 15:26:31",
      "score": 4,
      "num_children": 0,
      "author": 30298,
      "replies": []
    },
    {
      "id": "ikiya3e",
      "text": "[removed]",
      "timestamp": "2022-08-16 14:54:53",
      "score": 4,
      "num_children": 2,
      "replies": [
        {
          "id": "ikj17i6",
          "text": "[removed]",
          "timestamp": "2022-08-16 15:11:25",
          "score": 1,
          "num_children": 1,
          "replies": [
            {
              "id": "ikj6kga",
              "text": "Yeah, and Hitler was elected via popular vote so clearly elections are bad!!",
              "timestamp": "2022-08-16 15:44:35",
              "score": -1,
              "num_children": 1,
              "author": 194017,
              "replies": [
                {
                  "id": "ikj8ws3",
                  "text": "[removed]",
                  "timestamp": "2022-08-16 15:59:13",
                  "score": 0,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ikjb87s",
                      "text": ">than engaging the actual issue. \n\nwhat \"actual issue\", the strawman you built in your first comment?",
                      "timestamp": "2022-08-16 16:13:43",
                      "score": 6,
                      "num_children": 0,
                      "author": 194017,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ikjdjug",
          "text": "I disagree. I think it works pretty well. The problem you're running into is that other Americans mostly don't agree. So in the end you get politicians who don't agree. Especially today, when we're more polarized than at any point in the last 50 years. \n\nAmericans just aren't very left. Progressives are a minority, and economically left people are a minority. The only thing holding it all together right now is coalition building. \n\nI voted pro-choice in the Kansas primary. Let me tell you, pretty much everyone here supports some limits on abortion. It's not \"any abortion at any time\" over here. The reason the vote failed is because the law of the land right now is a moderate position. 22 weeks with exceptions for situations that threaten the life of the mother.",
          "timestamp": "2022-08-16 16:28:01",
          "score": 1,
          "num_children": 0,
          "author": 317154,
          "replies": []
        }
      ]
    },
    {
      "id": "ikkq71c",
      "text": "    user reports:\n    1: No Alt-Right/Nazis\n\nNo, I'm pretty sure that's people who discourage voting",
      "timestamp": "2022-08-16 21:39:17",
      "score": 2,
      "num_children": 0,
      "author": 353026,
      "replies": []
    },
    {
      "id": "ikj4f7h",
      "text": "[removed]",
      "timestamp": "2022-08-16 15:31:25",
      "score": -1,
      "num_children": 2,
      "replies": [
        {
          "id": "ikja5in",
          "text": "Well, the other side used Roe as well. Guns, God and Abortion.\n\nRoe went the way it did for many reasons, but the most direct was that Trump got 3 SC picks giving the supreme court a conservative supermajority.",
          "timestamp": "2022-08-16 16:06:57",
          "score": 7,
          "num_children": 1,
          "author": 380886,
          "replies": [
            {
              "id": "ikjd0c7",
              "text": "The number of people in this thread INSISITING that voting doesn't matter and \"it happened anyway\" is kinda ridiculous. I swear, the number of right-wingers cosplaying in leftist subs that are all TOTALLY real leftists insisting that letting Republicans win is better than compromising is absolutely absurd.\n\nThen again, these people are the same ones who swear Obama had a supermajority for two years and just conveniently ignore history.\n\nOr the voting records of both parties and how clearly one side stands up for human and civil rights while the other side doesn't.\n\nThey'll also bring up Manchin and Synema as though the Democrats are a lockstep organization like the Republicans where you toe the party line or get kicked out, which really shows their true colors, as the Democrats have been a big-tent party for many decades now, not a unified-front party. They can't even comprehend that the other side isn't exactly like themselves, and spew talking points as such.",
              "timestamp": "2022-08-16 16:24:40",
              "score": 9,
              "num_children": 0,
              "author": 116360,
              "replies": []
            }
          ]
        },
        {
          "id": "ikj67i0",
          "text": "[removed]",
          "timestamp": "2022-08-16 15:42:23",
          "score": -1,
          "num_children": 1,
          "replies": [
            {
              "id": "ikjg5ji",
              "text": "Do you think that would be the case if people had just decided to suck it up and vote for Hillary? Because I don’t.",
              "timestamp": "2022-08-16 16:44:07",
              "score": 1,
              "num_children": 0,
              "author": 80708,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikjhy4r",
      "text": "\"HilLaReEs jUsT aS bAd aS tRuMp gUyZz!\"",
      "timestamp": "2022-08-16 16:55:10",
      "score": -2,
      "num_children": 0,
      "author": 108122,
      "replies": []
    }
  ]
}