{
  "id": "wq3rer",
  "text": "Far more famous, main character paid higher = sexism\n",
  "timestamp": "2022-08-16 19:51:06",
  "score": 752,
  "subreddit": "t5_2zaj2",
  "num_children": 54,
  "author": 333306,
  "replies": [
    {
      "id": "ikkhs14",
      "text": "Let's talk about the gender gap in OF",
      "timestamp": "2022-08-16 20:43:08",
      "score": 300,
      "num_children": 7,
      "author": 349781,
      "replies": [
        {
          "id": "ikkjxh3",
          "text": "Lolllllllllll",
          "timestamp": "2022-08-16 20:57:16",
          "score": 63,
          "num_children": 0,
          "author": 333306,
          "replies": []
        },
        {
          "id": "ikli44y",
          "text": "Do  you have a moment after bible study to talk about how pornstars Johnny Sins and Danny D are definitely paid less than Lena Paul and Ava Addams?",
          "timestamp": "2022-08-17 01:01:47",
          "score": 41,
          "num_children": 0,
          "author": 288118,
          "replies": []
        },
        {
          "id": "ikkmmvp",
          "text": "Male models would like to have a word!",
          "timestamp": "2022-08-16 21:15:18",
          "score": 62,
          "num_children": 0,
          "author": 315345,
          "replies": []
        },
        {
          "id": "iklw6di",
          "text": "Woah, slow your roll! One of them is a lawyer, doctor, plumber, teacher and astronaut!",
          "timestamp": "2022-08-17 02:47:53",
          "score": 19,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iklq72e",
          "text": "And porn in general.",
          "timestamp": "2022-08-17 02:01:38",
          "score": 14,
          "num_children": 0,
          "author": 226658,
          "replies": []
        },
        {
          "id": "iknl926",
          "text": "Now that's a topic for discuss 😂",
          "timestamp": "2022-08-17 13:38:44",
          "score": 4,
          "num_children": 0,
          "author": 398803,
          "replies": []
        },
        {
          "id": "ikmsxld",
          "text": "To be fair, while I disagree with the existence if OF as a whole, the 'pay gap' on there is not a question of pay.\n\nIts the same thing with women's sports - its just about supply/demand.\n\nIf you want to point out the pay gap doesn't exist in sports you have to use that same logic on OF.",
          "timestamp": "2022-08-17 08:51:04",
          "score": 3,
          "num_children": 2,
          "author": 185,
          "replies": [
            {
              "id": "ikmtpgl",
              "text": "You conveniently pick up what suits you, and in those cases , laws of supply of demand or not justifying it, women always make a stink of it. I am not seeing men claiming they have to be more present and be paid more in OF, failing to see your point.\n\nNonetheless, to have more hard data and less subjectivity, let's choose Uber \"pay gap\" studies where it is advocate women should be paid 7% more than men because they drive less hours and take less risky behaviours. (i.e men should pay a subsidy to increase  women work rate per hour). What if guys demanded to be compensated for being biologically handicapped in OF?\n\n( IMO, as for \"supply and demand\"  and OF, men are \\*dumb\\* as hell. There is not lack of p\\*rn in the Internet, there has been uploaded to the Internet more than 50 years of porn. )",
              "timestamp": "2022-08-17 09:01:36",
              "score": 10,
              "num_children": 1,
              "author": 349781,
              "replies": [
                {
                  "id": "ikmu58z",
                  "text": "I'm not picking up 'what suits me'.\n\nI'm pointing out that the pay gap is non-existent in 90% of cases. In your example of using OF as an example, you are failing to take into account why women are paid so much more.\n\nIt's simple supply/demand economics. Men aren't paid as much for sexual content because there isn't much of a market for it.\n\nIn the same way, women's sports are less watched and so they are paid less for it. \n\nIt's not by choice, it's because you can't pay someone with money you don't have.",
                  "timestamp": "2022-08-17 09:07:37",
                  "score": 4,
                  "num_children": 2,
                  "author": 185,
                  "replies": [
                    {
                      "id": "ikp16aj",
                      "text": "And Bryce isn't as famous or in as high demand as homeboy. Didn't even know her name until this article lol. Same sitch.",
                      "timestamp": "2022-08-17 19:10:54",
                      "score": 3,
                      "num_children": 0,
                      "author": 117951,
                      "replies": []
                    },
                    {
                      "id": "ikmupuy",
                      "text": "90%? The pay gap is non-existent, it is a free capitalist market, not CCCP. Women just make a stink in the professions that suit them, and the others, they react as you are reacting.\n\noh, but there are 10% of cases where the narrative suits me, they are nice jobs. Maybe OF could suit the guys narrative side  too, privilege of making money without having a real job. Not really impressed.",
                      "timestamp": "2022-08-17 09:15:34",
                      "score": 7,
                      "num_children": 1,
                      "author": 349781,
                      "replies": [
                        {
                          "id": "ikmv6i0",
                          "text": "90% was a figure I estimated hastily. In reality, it's closer to 99%. There are examples of actual 'pay gaps' for both men and women, but it is certainly not a worldwide issue like many make it out to be.\n\nBesides, I am not really sure what your point is. Why would OF cater to men, when that's only 30-40% of their market?  Women make the majority of the money on OF, and that's not even a bad thing, if you take into account the bigger picture.\n\nReducing it down to \"x is paid more than y\" without looking at context just detracts from the issue, and is just a sloppy way of making a point.\n\nWomen are paid more for sexual content, men are paid more for sports. It's an equal market, you just need to know what people will pay you for.\n\nI am simply saying that your point seems to be a pretty weak attempt based on jealousy that women are paid more on OF. As I said, I disagree with its very existence, but you cant really blame them for exploiting a very lucrative market, however exploitative it might be.",
                          "timestamp": "2022-08-17 09:21:44",
                          "score": 3,
                          "num_children": 1,
                          "author": 185,
                          "replies": [
                            {
                              "id": "ikn0sl3",
                              "text": "Any such \"pay gap\" is nothing of the sort.  It is purely an EARNINGS gap, that comes down to the different choices that men and women make (on average).\n\nWhile there is about 1% that cannot be explained by personal choice, there is still zero evidence that that minuscule % has anything to do with sexism.",
                              "timestamp": "2022-08-17 10:34:48",
                              "score": 4,
                              "num_children": 1,
                              "author": 246957,
                              "replies": [
                                {
                                  "id": "ikn0uzw",
                                  "text": "I completely agree.",
                                  "timestamp": "2022-08-17 10:35:35",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 185,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ikw2v2n",
              "text": "There's still no denying that women having a massive money making advantage in OF. \n\nWe probably can compare it to sports. A male athlete uses his biological advantages for the game. \n\n\nWomen use their biological advantages for a different game.",
              "timestamp": "2022-08-19 03:58:00",
              "score": 3,
              "num_children": 0,
              "author": 1716,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikkiitu",
      "text": "And the cgi guys get paid less than her so whats up?",
      "timestamp": "2022-08-16 20:48:01",
      "score": 194,
      "num_children": 3,
      "author": 268260,
      "replies": [
        {
          "id": "ikl8t7b",
          "text": "I’d argue the majority of male actors in the film made less than her. She’s second lead. (To Chris Pratt) is she not?",
          "timestamp": "2022-08-16 23:53:04",
          "score": 24,
          "num_children": 1,
          "author": 36832,
          "replies": [
            {
              "id": "ikl9crj",
              "text": "Yes but I'd argue the cgi guys contributed the most to the movie hahahah",
              "timestamp": "2022-08-16 23:57:05",
              "score": 17,
              "num_children": 1,
              "author": 268260,
              "replies": [
                {
                  "id": "iklcnii",
                  "text": "Oh for sure, I mean that’s like the whole movie. I’d bet she got paid more than them.",
                  "timestamp": "2022-08-17 00:21:29",
                  "score": 11,
                  "num_children": 1,
                  "author": 36832,
                  "replies": [
                    {
                      "id": "imh234y",
                      "text": "Eh, I bet that cgi budget was bonkers. That or they’ve just gotten very efficient with it. I’m sure everyone was paid proportionally to what they produced.",
                      "timestamp": "2022-08-31 02:41:38",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ikkjyqh",
          "text": "Ya but she’s a girl so it’s sexist duh",
          "timestamp": "2022-08-16 20:57:30",
          "score": 100,
          "num_children": 1,
          "author": 333306,
          "replies": [
            {
              "id": "ikkze9x",
              "text": "Fine. What about the cgi girls making her look not as flat for the promotional materials?",
              "timestamp": "2022-08-16 22:44:32",
              "score": 32,
              "num_children": 0,
              "author": 316486,
              "replies": []
            }
          ]
        },
        {
          "id": "iklouoh",
          "text": "They had to render down her huge tank-ass...\n\nI wish I was kidding... [https://www.ebaumsworld.com/articles/bryce-dallas-howards-butt-is-the-center-of-a-major-debate-online/87209973/](https://www.ebaumsworld.com/articles/bryce-dallas-howards-butt-is-the-center-of-a-major-debate-online/87209973/)",
          "timestamp": "2022-08-17 01:51:39",
          "score": 21,
          "num_children": 2,
          "replies": [
            {
              "id": "iklwb3k",
              "text": "Daaaaamn! She got a WAGON 🍑. Love discovering those surprise badonks among actresses.",
              "timestamp": "2022-08-17 02:48:56",
              "score": 11,
              "num_children": 1,
              "author": 183636,
              "replies": [
                {
                  "id": "ikn0z5g",
                  "text": "Not hard to have a huge ass when the rest of you is overweight too. \n\nThe only thing this bucket of flab has going for her, is a rich family.",
                  "timestamp": "2022-08-17 10:37:00",
                  "score": 2,
                  "num_children": 1,
                  "author": 246957,
                  "replies": [
                    {
                      "id": "imh2vkx",
                      "text": "I thought she was a good actress in the films. Cute face too. Not my type as my wife is about 5’3” and 95 lbs. soaking wet. I personally prefer a nice “tight” ass.",
                      "timestamp": "2022-08-31 02:48:03",
                      "score": 2,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ikluf20",
              "text": "Ugh, reality.\n\nMy disappointment is immeasurable and my day is ruined.",
              "timestamp": "2022-08-17 02:33:57",
              "score": 0,
              "num_children": 0,
              "author": 194027,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikkixkm",
      "text": "Wow the **star** of the movie made **more** than the supporting actress",
      "timestamp": "2022-08-16 20:50:41",
      "score": 155,
      "num_children": 1,
      "replies": [
        {
          "id": "ikkjzbe",
          "text": "So rude",
          "timestamp": "2022-08-16 20:57:36",
          "score": 35,
          "num_children": 1,
          "author": 333306,
          "replies": [
            {
              "id": "ikkk1q7",
              "text": "Lol",
              "timestamp": "2022-08-16 20:58:03",
              "score": 19,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikkm9t9",
      "text": "Famous character vs not as famous, seriously? Stop whining!",
      "timestamp": "2022-08-16 21:12:49",
      "score": 44,
      "num_children": 1,
      "author": 359954,
      "replies": [
        {
          "id": "ikknzc3",
          "text": "I know, not even comparable",
          "timestamp": "2022-08-16 21:24:23",
          "score": 11,
          "num_children": 1,
          "author": 333306,
          "replies": [
            {
              "id": "ikkpm99",
              "text": "Yeah.  Someone always trying to stir up some shit for attention.",
              "timestamp": "2022-08-16 21:35:22",
              "score": 8,
              "num_children": 0,
              "author": 359954,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikkqouo",
      "text": "Well I know who Chris Pratt is, I don’t know who she is. I wonder if there’s some kind of correlation here",
      "timestamp": "2022-08-16 21:42:38",
      "score": 39,
      "num_children": 2,
      "author": 293305,
      "replies": [
        {
          "id": "ikl9f9g",
          "text": ";) astute observation",
          "timestamp": "2022-08-16 23:57:36",
          "score": 8,
          "num_children": 0,
          "author": 333306,
          "replies": []
        },
        {
          "id": "ikmjemp",
          "text": "Am I the only person who saw The Village?",
          "timestamp": "2022-08-17 06:42:19",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "ikmutad",
              "text": "i know of her cuz spiderman 3 and well. she hot",
              "timestamp": "2022-08-17 09:16:53",
              "score": 1,
              "num_children": 1,
              "author": 366507,
              "replies": [
                {
                  "id": "ikn15hn",
                  "text": "Was. Was hot.  She's put on about 30lbs since then. Didn't even recognize her.",
                  "timestamp": "2022-08-17 10:39:05",
                  "score": 2,
                  "num_children": 1,
                  "author": 246957,
                  "replies": [
                    {
                      "id": "ikn96cp",
                      "text": "ok thats true",
                      "timestamp": "2022-08-17 12:01:55",
                      "score": 2,
                      "num_children": 0,
                      "author": 366507,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ikkkfqd",
      "text": "Chris Pratt’s dad didn’t get his sons carrier handed to him.",
      "timestamp": "2022-08-16 21:00:36",
      "score": 31,
      "num_children": 0,
      "author": 177748,
      "replies": []
    },
    {
      "id": "ikkq3aa",
      "text": "Just to point out how ridiculous this claim by Ms. Howard is, the amounts actors are paid for their appearance in films is negotiated on a PERSON-BY-PERSON basis.  She agreed to a contract to act in those films for a specific amount.  It’s not like she got a job at Walmart and everyone is paid the same amount.  Did all the women in those films get paid evenly?  No, because they are all paid according to who had the most screen time and who has the best agent, and who got the best deal, etc!!!\n\nHow about this, “Bryce,” let’s address the pay gap between you and all the other people who worked on those movies BESIDES Chris Pratt.",
      "timestamp": "2022-08-16 21:38:35",
      "score": 26,
      "num_children": 1,
      "author": 80317,
      "replies": [
        {
          "id": "iknie19",
          "text": "Yes. \n\nPeople also forget that during the early 2010s Jennifer Lawrence was one of the highest paid in Hollywood because she was the hot item at the time. She was paid almost 10 times as much as her costars in The Hunger Games movies.",
          "timestamp": "2022-08-17 13:17:43",
          "score": 8,
          "num_children": 2,
          "author": 316157,
          "replies": [
            {
              "id": "ikp4hgu",
              "text": "She was paid more than Chris Pratt for Passengers.  I wonder what Bryce thinks about that.",
              "timestamp": "2022-08-17 19:31:46",
              "score": 5,
              "num_children": 1,
              "author": 197883,
              "replies": [
                {
                  "id": "ikpndqr",
                  "text": "I think Chris should sue her and speak openly about how unfair to men it is when female actresses make more than male actors.  After all, if you include pornography as part of the acting profession, it’s one of the MOST uneven gender gaps of any profession, because women who act get paid MANY TIMES more than men, in MOST cases.  Same with modeling, dancing, massage therapists (a field I am qualified in, by the way), waitressing, and many other professions.  Let’s stop acting like the “wage gap” doesn’t help women in MANY careers.  It’s just not rational to pretend that people will get paid whatever they are paid on the basis of their gender.  People WANT to pay a man for certain things, and they WANT to pay a woman for certain things.  I’ve had to accept this as a massage therapist.  Both women and men prefer a woman to massage them, in MOST cases.  Instead of arguing with the public and acting like they are all sexists, it’s better to accept that people have a RIGHT to pay whomsoever they want to pay, to do what they want them to do.\n\nIf I said that you can’t hire the kid next door to mow your lawn until you got several bids from other kids and then chose the right applicant to mow your lawn by using their gender and racial characteristics to decide who you had to hire, would you think that made sense?  Why can’t you hire whatever kid in the neighborhood you want to, to mow your lawn?  Do you need someone sitting on the sidelines criticizing you for hiring more males than females to mow the lawn?  What if you only had ONE KID ask to mow your lawn?  Do you now have to seek out female children who might want to mow your lawn because they are being underrepresented?\n\nThe whole concept is total bullshit and it never has made any sense.  There is only ONE case where I would say the laws are being violated, and that is when someone is hired at a big corporate job where everyone is somehow supposed to get the same pay, and then some group of people is paid less for some reason.  There has to be at least some general reason for why you thought the pay was meant to be equal in the first place.\n\nWomen often work differently than men.  They are just as capable, in my humble opinion, but they don’t TEND work the same hours, or to work without vacations or sick days.  They often don’t make work their main focus in life.  I have NO PROBLEM with that.  I wish men would learn from it too.  Work is supposed to support the things you want to get out of life, it isn’t supposed to BE your life.  Women can have babies, and men can’t (sorry to say this without showing you my credentials as a “medical doctor,” but I assure you it is true).  Women have to take time off work to have babies.  I am entirely in favor of them being given the opportunity to take maternity leave, and I also realize there are billions of issues with how maternity leave works at all of the various places that offer it.  It’s genuinely not possible for some workplaces to give women maternity leave, and it kills a lot of small businesses.  I’m also 100% in favor of paternity leave also, to match maternity leave.  The problem is that we have to be realistic that if a business can’t plan for when their employees might just choose to have a 5th or 6th kid, it becomes an expense they can’t be prepared for.\n\nThe only reasonable way to employ people is on the basis of the value they bring to the workplace.  If they allow the workplace to make more money, then they are valuable.  If they go out on maternity leave several times, or even paternity leave, then as much as that “should be okay,” the word “should” begs the question of who makes that decision.  Are we complaining to God that there aren’t enough hours in the day?  Are we pretending government is there to solve every family issue we have?  That’s not rational.  If people want to complain about the fact women might be paid a different amount than men, then they have to simply measure that on the basis of not just exact number of minutes worked, but the quality of that work, and it’s relevance to the success of the business.\n\nComing full circle, if Bryce Dallas Howard is such a hot commodity, then why is it that she’s rarely in as many movies as other actors or actresses?  If she brings significant acting talent to the movies she’s in, then how well have those movies done in the box office?!  Chris Pratt has been in 67 films.  Bryce Dallas Howard has been in 43.  Might THAT have a little to do with the disparity in pay?  I mean, she’s only been in 64% as many films (according to IMDB) as an actress.  Maybe she shouldn’t inflate her importance to the movie industry just because she has famous people in her family.  Chris Pratt’s mother worked at Safeway, and his father died young.  He had anything but a Hollywood upbringing.  He’s worked hard for everything he has.\n\nI’ve always been a cinephile and I love rare, artistic movies that most people don’t understand.  I admit that blockbuster action movies haven’t been my thing since CGI made most of them ridiculous and unbelievable.  I hate the movies that many members of the public view audience seem to love.\n\nHowever, it’s not up to me.  The majority rules, and they rule with their monetary choices.  If they are sexist, then tell me exactly how you can make a law that demands everyone stop thinking whatever they think.  Until we have Thought Police, in some nightmarish future, we are never going to see a country where women and men are always treated equally by the public.  We can say it over and over, but until people actually stop treating men and women differently, then the amount they are WORTH to any business is going to be different.  That is the final say.  The final say is in the hands of the PEOPLE, as it always will be.  Instead of pretending we are going to change that, we need to just accept that we need to work with what exists.",
                  "timestamp": "2022-08-17 21:29:18",
                  "score": 1,
                  "num_children": 0,
                  "author": 80317,
                  "replies": []
                }
              ]
            },
            {
              "id": "ikpj9vb",
              "text": "Precisely!!!  And MANY female stars get paid significantly more than male stars.  It’s not a great place to complain about women not getting equal pay.  Back when Demi Moore was the hottest thing in Hollywood, she also got paid more than almost any other actor OR actress.  Women in the movies get paid a HUGE amount, but let’s face it:  They also aren’t paid according to gender.  That isn’t the basis of their pay.  They are paid because of how many movies their name sells.  They are paid because the box office gets X number of dollars in the first week when a movie of theirs comes out.  Their pay reflects the REALITY of who people want to see in movies.  It might be racist, sexist, homophobic, or classist, ablist, and anything else you can think of…because it’s based on what the PUBLIC wants.  It’s not even the public of ONE country…It’s the ENTIRE WORLD!!!  If the public isn’t into someone for whatever reason, then they don’t get as much money.\n\nIt’s ludicrous to claim that Bryce Dallas Howard is being paid less than her male costar because she is a woman.  The producers and casting directors and agents would LOVE for her to make more money!!!  They would be happy to pay her more than Chris Pratt if she was actually worth more than Chris Pratt to the movie-going public.  If we want to blame someone, blame the people who buy tickets and choose what movie they would rather see.  Unless you want to force people to sit through every movie Hollywood puts out and then be forced to spend the same amount whether a movie sucks or it doesn’t…whether they hate the main actress or they don’t.\n\nBy the way, non-sequitur, but isn’t Bryce Dallas Howard a serial killer name?  It seems like they are the majority of people who always have to use a middle name.  No one calls her Bryce Howard.  What is the significance of Dallas to her movie business parents, anyway?  Does anyone know?!  I know who her parents are, but I don’t know why they picked the name “Dallas.”  Evidently Ms. Howard has to use her middle name because there are just too many Bryce Howards out there!!",
              "timestamp": "2022-08-17 21:03:19",
              "score": 1,
              "num_children": 0,
              "author": 80317,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikkho21",
      "text": "Man make more money than me man oppress me (angry boonga noises)",
      "timestamp": "2022-08-16 20:42:23",
      "score": 64,
      "num_children": 1,
      "author": 284719,
      "replies": [
        {
          "id": "ikkkc6f",
          "text": "Yes this Hollywood actress is so oppressed >:(",
          "timestamp": "2022-08-16 20:59:57",
          "score": 30,
          "num_children": 1,
          "author": 333306,
          "replies": [
            {
              "id": "ikkmual",
              "text": "Not only is she a Hollywood actress, she is Ron Howards daughter. Ron Howard is one of the most famous actors ever and one of the most successful directors of all time. She literally was born privileged and wants to continue to paint the picture that all men are more privileged than her.",
              "timestamp": "2022-08-16 21:16:42",
              "score": 42,
              "num_children": 3,
              "author": 315345,
              "replies": [
                {
                  "id": "ikknrkx",
                  "text": "Oh that’s even better",
                  "timestamp": "2022-08-16 21:22:57",
                  "score": 14,
                  "num_children": 0,
                  "author": 333306,
                  "replies": []
                },
                {
                  "id": "iklfwlp",
                  "text": "> She literally was born privileged and wants to continue to paint the picture that all men are more privileged than her.\n\nThe bigger problem is the system (like CNN here, but also the leftists in the schools, at the social media companies, the ones entrenched in government institutions, etc) that help her set the narrative.  This ***system*** is what is responsible for indoctrinating so many people into this destructive ideology.  This ***system*** is what allows stupidity like \"the gender pay gap\" endure.",
                  "timestamp": "2022-08-17 00:45:32",
                  "score": 8,
                  "num_children": 1,
                  "author": 174241,
                  "replies": [
                    {
                      "id": "ikna4wj",
                      "text": "Completely agree, the system is against us. If you look on some subreddits they have rules that state against discrimination and racism. If you read the posts it only mentions hatred towards women and says absolutely nothing about men.",
                      "timestamp": "2022-08-17 12:10:38",
                      "score": 2,
                      "num_children": 0,
                      "author": 315345,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iklmiin",
                  "text": "Yeah, this is a fake controversy because she's 41 and she knows the easy Hollywood money is drying up, as if the money and privilege from her rich and famous dad wasn't enough.\n\n[Here she is](https://static1.srcdn.com/wordpress/wp-content/uploads/2016/11/bryce-dallas-howard-gwen-stacy-spiderman.jpg?q=50&fit=crop&w=1500&dpr=1.5) as Gwen Stacey in Spider-Man 3.   Do you think she was complaining she could young-girl-actress her way into a major flagpole film 15 years ago?\n\nSame deal with 47 year old [Amy Adams](https://etcanada.com/news/40007/amy-adams-praises-emma-watson-addresses-gender-inequality-in-hollywood/).    Obligatory [early career Amy Adams appearance.](https://i.pinimg.com/736x/fd/85/8d/fd858dabe88e769ae916dd5aa00a7553.jpg)    Psycho Beach Party (2000)",
                  "timestamp": "2022-08-17 01:34:24",
                  "score": 7,
                  "num_children": 1,
                  "author": 73494,
                  "replies": [
                    {
                      "id": "ikoy0wm",
                      "text": "Nothing is drying up for her because she's following the same path as her father by working as a director. She's directed many of the Mandalorian episodes and many consider her episodes to be best. I can't fathom why she's complaining now she's in an even more powerful position than a supporting actress.",
                      "timestamp": "2022-08-17 18:51:09",
                      "score": 1,
                      "num_children": 0,
                      "author": 208191,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ikkjn1r",
      "text": "I'd be embarrassed of my life to put such a statement out. Do people no longer think anymore?",
      "timestamp": "2022-08-16 20:55:22",
      "score": 33,
      "num_children": 1,
      "author": 209007,
      "replies": [
        {
          "id": "ikkk38h",
          "text": "I think they’ll just bend whatever to align with their narrative, and some people are too ignorant to realize it’s literally just a difference in their work, nothing to do with gender.",
          "timestamp": "2022-08-16 20:58:20",
          "score": 15,
          "num_children": 1,
          "author": 333306,
          "replies": [
            {
              "id": "ikkp5d0",
              "text": "Nooooooo, tHaT iS sEXiSt!!!!!\nIt mUsT bE mY GeNDeR!!!!",
              "timestamp": "2022-08-16 21:32:15",
              "score": 8,
              "num_children": 1,
              "author": 188440,
              "replies": [
                {
                  "id": "ikl9d4d",
                  "text": "Amy Schumer is FUNNY",
                  "timestamp": "2022-08-16 23:57:09",
                  "score": 4,
                  "num_children": 0,
                  "author": 333306,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ikksoda",
      "text": "How about having the actual headline. Her father is Ron Howard, who got her into the business. She took a contract for less money back in 2014 for 3 movies. She thanks Chris for getting her more money.",
      "timestamp": "2022-08-16 21:56:22",
      "score": 8,
      "num_children": 0,
      "author": 263667,
      "replies": []
    },
    {
      "id": "ikl0m6b",
      "text": "wonder if she knows she was paid more than the other 15 unknown men",
      "timestamp": "2022-08-16 22:53:19",
      "score": 7,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ikkoxvw",
      "text": "Of course, if the guys from Hunger Games whined they didn't get paid as much as the lead girl...",
      "timestamp": "2022-08-16 21:30:52",
      "score": 18,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ikkocvn",
      "text": "Pay gap exists because Mark Hammil was paid more than Daisy Ridley !",
      "timestamp": "2022-08-16 21:26:55",
      "score": 7,
      "num_children": 0,
      "author": 34455,
      "replies": []
    },
    {
      "id": "ikl19us",
      "text": "Guy who's portfolio included hit TV series and major come up as lead in a Marvel film vs literally who?",
      "timestamp": "2022-08-16 22:58:07",
      "score": 7,
      "num_children": 0,
      "author": 156942,
      "replies": []
    },
    {
      "id": "iklalyv",
      "text": "\"WHAT ABOUT THE BLOODY BRICKLAYERS HUH?\"\n\n- Jordan Peterson, probably.",
      "timestamp": "2022-08-17 00:06:25",
      "score": 6,
      "num_children": 1,
      "author": 15965,
      "replies": [
        {
          "id": "ikler7t",
          "text": "Hahahahahahahaahhahahahahahahahahha",
          "timestamp": "2022-08-17 00:37:02",
          "score": 2,
          "num_children": 0,
          "author": 333306,
          "replies": []
        }
      ]
    },
    {
      "id": "ikkk67y",
      "text": "[removed]",
      "timestamp": "2022-08-16 20:58:52",
      "score": 4,
      "num_children": 2,
      "replies": [
        {
          "id": "ikklgy7",
          "text": "IKR? In the first movie, the guy in the control room gets quite a few cheap shots at his masculinity from her just because he’s the computer guy. Not everyone literally wrangles velociraptors for a living.",
          "timestamp": "2022-08-16 21:07:26",
          "score": 6,
          "num_children": 0,
          "author": 310947,
          "replies": []
        },
        {
          "id": "ikkq4dk",
          "text": "Please refrain from generalizing women.",
          "timestamp": "2022-08-16 21:38:47",
          "score": 0,
          "num_children": 1,
          "author": 188706,
          "replies": [
            {
              "id": "ikl0434",
              "text": "I was saying that I don't care about 90% of women in movies, not that 90% of women in movies are nobodies. I don't care about 90% of men in movies either.",
              "timestamp": "2022-08-16 22:49:41",
              "score": 1,
              "num_children": 0,
              "author": 312440,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikkjuoe",
      "text": "The article is misleading. She actually thanks pratt for his help in securing her high payment.",
      "timestamp": "2022-08-16 20:56:45",
      "score": 11,
      "num_children": 2,
      "author": 216440,
      "replies": [
        {
          "id": "ikkk5ev",
          "text": "Good on her, and bad on the woke idiot at CNN who wrote the clickbait title",
          "timestamp": "2022-08-16 20:58:43",
          "score": 21,
          "num_children": 2,
          "author": 333306,
          "replies": [
            {
              "id": "ikkloog",
              "text": "bad on you for sharing clickbait",
              "timestamp": "2022-08-16 21:08:52",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ikkulc8",
                  "text": "somewhat yes, somewhat no\n\n\nthis is in fact the \"news\" that's being put out by a major organization\n\n\nso it's bad bc it implies he didn't read the article\n\n\nbut it's factual and important bc it's a problem that mainstream media is still twisting appreciative women's words to fit their narrative about fake gender pay gaps.. and every other bullshit feminist talking point without consequence. \n\n\nand honestly a powerful worldwide media outlet is more consequential than one minor starlets words one way or the other\n\n\nin 100 years i wonder if we'll have finally had enough of news blatantly lying to us to manipulate society and social movements and actually start holding them accountable.",
                  "timestamp": "2022-08-16 22:10:00",
                  "score": 8,
                  "num_children": 1,
                  "author": 157495,
                  "replies": [
                    {
                      "id": "iklo41b",
                      "text": "I’d like to point out I didn’t share the article, but the *title* which highlights one of the exact issues in this sub - that (even if not true) media will push to the masses that there is an issue with a wage gap between sexes. You don’t need to read into it to see that the title is indicating this, and I’ll reiterate it is worse that they’re bending her words to fit their narrative. Thanks for your comment, I think you understood my point well. Also I’m a lady lol. :)",
                      "timestamp": "2022-08-17 01:46:10",
                      "score": 2,
                      "num_children": 0,
                      "author": 333306,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ikksu0b",
              "text": "I mean you haven’t fixed the title so 🤷‍♂️",
              "timestamp": "2022-08-16 21:57:27",
              "score": -1,
              "num_children": 2,
              "author": 263667,
              "replies": [
                {
                  "id": "iklr7dq",
                  "text": "The issue is with *their* title, I feel no need to change mine. It’s just a post that applies to the sub, it’s not that deep.",
                  "timestamp": "2022-08-17 02:09:11",
                  "score": 1,
                  "num_children": 0,
                  "author": 333306,
                  "replies": []
                },
                {
                  "id": "ikoyc68",
                  "text": "You can't change titles on reddit, newb. You joined the site after it became an app, didn't you?",
                  "timestamp": "2022-08-17 18:53:05",
                  "score": 1,
                  "num_children": 0,
                  "author": 208191,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iklf6oa",
          "text": "Thank you! I was just about to post a comment saying this. She indicated that she was in a whole different world than Chris when they negotiated the contract, but they negotiated for all three movies up front, which is why she got paid less since he was a much bigger star at the time (still is, too).\n\nShe even gives him credit that when there's been deals after the fact (like merchandise and such) Chris goes to bat for her and they get equal pay.\n\nCNN is the bad guy here, not her. Just like you said, they spun the title of the article to make waves and push an agenda...",
          "timestamp": "2022-08-17 00:40:11",
          "score": 4,
          "num_children": 0,
          "author": 118954,
          "replies": []
        }
      ]
    },
    {
      "id": "ikkhvkk",
      "text": "Load of cobblers!",
      "timestamp": "2022-08-16 20:43:47",
      "score": 3,
      "num_children": 0,
      "author": 49881,
      "replies": []
    },
    {
      "id": "ikkhycm",
      "text": "But he took more risk in the movie. /s",
      "timestamp": "2022-08-16 20:44:17",
      "score": 6,
      "num_children": 0,
      "author": 239519,
      "replies": []
    },
    {
      "id": "ikl32ox",
      "text": "Haven't seen the movies yet. Also never heard her name before.",
      "timestamp": "2022-08-16 23:11:23",
      "score": 2,
      "num_children": 0,
      "author": 99646,
      "replies": []
    },
    {
      "id": "iklgq4v",
      "text": "LOL I see we are still very much in a clown world.. of course.. no mention of other qualifying or disqualifying factors or reasons why. It must be the sex right? \n\nHow many hours on set was he vs her? Who has a bigger following? who demanded more during negotiations? It's like me going to the shops and buying an avocado for $5 then coming back or complaining online that I got ripped off? Why the hell did I buy the avocado? The reason why she accepted the role/pay is because she knows deep down that if she asked for what she 'believed' she was worth, she wouldn't get the role or that pay. I wish I got $500 an hour for my work.. but guess what? I am not WORTH that much to the marketplace. Capitalism does not care for your feelings or beliefs.\n\nSome part of me always thinks what's the end goal of this non-sense? Is it communism or a form of it? For example.. your title will determine your pay. You're a doctor so each and every doctor gets $2000 a week. You're a bricklayer.. each and everyone with that title will get $1000. Somehow determined by how useful/needed that 'title' is to society. So all the experience, work efficiency/proficiency, marketplace... goes OUT THE WINDOW!. Is this really the end game of this? Or less extreme.. they just want women to be paid more/better for lesser/not equal work to appease feminists and in the name of 'equality'.",
      "timestamp": "2022-08-17 00:51:32",
      "score": 2,
      "num_children": 0,
      "author": 263708,
      "replies": []
    },
    {
      "id": "ikll8pm",
      "text": "I wonder if she would complain or even mention it if she was the star and Pratt was paid less",
      "timestamp": "2022-08-17 01:24:57",
      "score": 2,
      "num_children": 0,
      "author": 73494,
      "replies": []
    },
    {
      "id": "iklqe7s",
      "text": "Remind me how she got famous…her actor/director dad. So oppressed.",
      "timestamp": "2022-08-17 02:03:07",
      "score": 2,
      "num_children": 0,
      "author": 226658,
      "replies": []
    },
    {
      "id": "iklxc2e",
      "text": "Omg poor millionaires and the tough issues they face…",
      "timestamp": "2022-08-17 02:57:09",
      "score": 2,
      "num_children": 0,
      "author": 378754,
      "replies": []
    },
    {
      "id": "ikp5ex1",
      "text": "I'm so fucking gratefully that greed tops political correctness for 99% of corporations. Don't get me wrong. I still hate them. But at least they aren't Evil AND woke",
      "timestamp": "2022-08-17 19:37:40",
      "score": 2,
      "num_children": 0,
      "author": 101170,
      "replies": []
    },
    {
      "id": "ikktq9i",
      "text": "What about the species gap?  I'm pretty sure she made way more money than the dinosaurs.",
      "timestamp": "2022-08-16 22:03:47",
      "score": 4,
      "num_children": 0,
      "author": 119720,
      "replies": []
    },
    {
      "id": "iklgww2",
      "text": "Why did she accept the role if she was being paid less? Maybe she should have asked for more, before she acted; than waiting to gripe about not earning as much after. Did she spend less time on screen than the others?",
      "timestamp": "2022-08-17 00:52:55",
      "score": 2,
      "num_children": 0,
      "author": 93470,
      "replies": []
    },
    {
      "id": "ikm2072",
      "text": "Chris Pratt is the marquee talent. Bryce Dallas Howard isn’t selling the movie. Pratt is.",
      "timestamp": "2022-08-17 03:36:11",
      "score": 2,
      "num_children": 0,
      "author": 18794,
      "replies": []
    },
    {
      "id": "ikn0iqj",
      "text": "Who?  This person was in a movie?  Obviously got way more than she deserved for such an unmemorable performance.\n\nOn the other hand Pratt was AWESOME. Fully deserved every penny.\n\nThere is an EARNINGS gap, not unequal pay for the same job. Obviously this two-bit c-level actor isn't going to make as much as the star.  Feminism once again showing it is nothing but a completely abusive, female superiority movement.",
      "timestamp": "2022-08-17 10:31:31",
      "score": 1,
      "num_children": 0,
      "author": 246957,
      "replies": []
    },
    {
      "id": "ikksovb",
      "text": "It's so convenient that these actresses are now digging back to childhood to unravel past issues that were appropriate for that time and mutually agreed upon. The more high maintenance an image they project, the more of a liability they become. Expect all such revisionists to suffer consequences.",
      "timestamp": "2022-08-16 21:56:28",
      "score": 1,
      "num_children": 0,
      "author": 65777,
      "replies": []
    },
    {
      "id": "iklggsn",
      "text": "There is no gender pay gap. Women just have more time off, a better work/life balance and they're a tiny fraction of the people who work the necessary dangerous jobs upon which our consumerist society survives.",
      "timestamp": "2022-08-17 00:49:38",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "iklrkfj",
          "text": "Yes, very very view female roofers, road workers, military, etc. which I think is all well and good, as we’re not as physically strong so it could be unsafe. We rely on men for these things and they are critical to society.",
          "timestamp": "2022-08-17 02:11:58",
          "score": 1,
          "num_children": 1,
          "author": 333306,
          "replies": [
            {
              "id": "ikmi3i8",
              "text": "I don't think women are unfit for those jobs in any way. You don't have to be THAT strong to do most of the work and blue-collar workers are always willing to help each other out (much more so than white-collar, in my experience).\n\nDave's a fat fuck and can't lift for shit and Darryl has a bad back so I'm going to cover for each of them when it comes to heavy labour. Just like how Darryl does any work that involves heights because he knows I have a thing about heights.\n\nI've known women in the trades and they were always respected because they could *carry their weight*, insofar as most workers were willing to carry what weight they could too.\n\nThe rest were known was 'dogfuckers' and you were told who they were on your first week.\n\nYou're told who's unsafe to work with, too, because these are jobs where you might have to watch your co-worker die.\n\nWhite-collar workers don't know anything about that kind of life.",
              "timestamp": "2022-08-17 06:25:39",
              "score": 1,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikkku8d",
      "text": "Ok. How much was she paid in the episode of Black Mirror she was in compared to others ?",
      "timestamp": "2022-08-16 21:03:14",
      "score": 1,
      "num_children": 0,
      "author": 200588,
      "replies": []
    },
    {
      "id": "ikkv47s",
      "text": "I bet she would've been paid more of both of them would've played in a porno. By a lot!",
      "timestamp": "2022-08-16 22:13:48",
      "score": 1,
      "num_children": 0,
      "author": 388194,
      "replies": []
    },
    {
      "id": "ikl6rby",
      "text": "Honestly i didn't even know who this person was before this post. I dont even watch Jurassic World. She thinks she deserved more than Chris Pratt????",
      "timestamp": "2022-08-16 23:38:03",
      "score": 1,
      "num_children": 0,
      "author": 178506,
      "replies": []
    },
    {
      "id": "iklaea1",
      "text": "Rofl watch them cast someone else xD real power move",
      "timestamp": "2022-08-17 00:04:52",
      "score": 1,
      "num_children": 0,
      "author": 138967,
      "replies": []
    },
    {
      "id": "iklfwam",
      "text": "Tbh i forgot she was in that film I still remember that Pratt is on the film . If this happened  to you that can tell you how interesting her character is.",
      "timestamp": "2022-08-17 00:45:28",
      "score": 1,
      "num_children": 0,
      "author": 11233,
      "replies": []
    },
    {
      "id": "ikll75g",
      "text": "Stop blaming the employer. Blame the actor/actress for having a team of lawyers not asking for more money.",
      "timestamp": "2022-08-17 01:24:37",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iklto6h",
      "text": "Wait, context, What was the gap in pay?",
      "timestamp": "2022-08-17 02:28:07",
      "score": 1,
      "num_children": 0,
      "author": 273881,
      "replies": []
    },
    {
      "id": "ikm0n03",
      "text": "Not to mention the film was absolutely horrible.",
      "timestamp": "2022-08-17 03:24:30",
      "score": 1,
      "num_children": 0,
      "author": 261734,
      "replies": []
    },
    {
      "id": "ikm918p",
      "text": "I know who Chris Pratt is, I don’t know who this beggar is however",
      "timestamp": "2022-08-17 04:42:13",
      "score": 1,
      "num_children": 0,
      "author": 214641,
      "replies": []
    },
    {
      "id": "ikmft1u",
      "text": "The main characters were the dinosaurs, which I'm sure they were paid way more than anyone else.",
      "timestamp": "2022-08-17 05:57:43",
      "score": 1,
      "num_children": 0,
      "author": 206832,
      "replies": []
    },
    {
      "id": "ikmgqoe",
      "text": "Aren't movie stars all technically just contractors?",
      "timestamp": "2022-08-17 06:09:03",
      "score": 1,
      "num_children": 0,
      "author": 224889,
      "replies": []
    },
    {
      "id": "ikmsovb",
      "text": "Bryce Dallas Howard is the daughter of famed actor and filmmaker Ron Howard and a superstar director in the making.",
      "timestamp": "2022-08-17 08:47:46",
      "score": 1,
      "num_children": 0,
      "author": 200487,
      "replies": []
    },
    {
      "id": "iknkir5",
      "text": "The difference being is I’ve heard of Chris Pratt.",
      "timestamp": "2022-08-17 13:33:26",
      "score": 1,
      "num_children": 0,
      "author": 146888,
      "replies": []
    },
    {
      "id": "iknufs5",
      "text": "Her character wasn’t as necessary, essentially just there. He did the crazy scenes like the motorcycle chase. Plus he’s more famous so more likely to bring in fans. But nope it’s cause of sexism",
      "timestamp": "2022-08-17 14:41:08",
      "score": 1,
      "num_children": 0,
      "author": 1600,
      "replies": []
    },
    {
      "id": "iko9tnk",
      "text": "So what she wasn't the star of the film. The star of the film always gets paid more. Get this bitch outta here.",
      "timestamp": "2022-08-17 16:20:06",
      "score": 1,
      "num_children": 0,
      "author": 151519,
      "replies": []
    },
    {
      "id": "ikoj8xc",
      "text": "Didn’t Kirsten Dunst try this garbage too once? Whining that she made less money than Tobey Maguire in the Spider-Man films and crying sexism?",
      "timestamp": "2022-08-17 17:19:09",
      "score": 1,
      "num_children": 0,
      "author": 75962,
      "replies": []
    },
    {
      "id": "ikoq1rm",
      "text": "If this was a claim with any substance she would have a good case for malpractice against her agent.   Negotiations aren't just guesswork,  cocktails, and handshakes anymore.   Far more likely than not it was a data driven decision that reflected the reality of the day she signed the contract.   Now,  she can argue that the reality has changed (likely she would command more due to starring in this movie) but the contract does not re-rate to today's reality.",
      "timestamp": "2022-08-17 18:01:28",
      "score": 1,
      "num_children": 0,
      "author": 229348,
      "replies": []
    },
    {
      "id": "ikoq2oo",
      "text": "who?",
      "timestamp": "2022-08-17 18:01:37",
      "score": 1,
      "num_children": 0,
      "author": 317909,
      "replies": []
    },
    {
      "id": "ikoqyfu",
      "text": "Was Chris Pratt not waaay more popular at the time especially coming off the Guardians of the Galaxy train? I’m sure Bryce still made significantly more than most of the other male actors in the film. 💀",
      "timestamp": "2022-08-17 18:07:08",
      "score": 1,
      "num_children": 0,
      "author": 304865,
      "replies": []
    },
    {
      "id": "ikos5xh",
      "text": "She is not a in shape fit movie star.",
      "timestamp": "2022-08-17 18:14:48",
      "score": 1,
      "num_children": 0,
      "author": 101954,
      "replies": []
    },
    {
      "id": "ikul6pw",
      "text": "Let's talk about the fact Ron Howard is her father and whether she'd be in Hollywood without having his connections.",
      "timestamp": "2022-08-18 21:23:10",
      "score": 1,
      "num_children": 0,
      "author": 402389,
      "replies": []
    },
    {
      "id": "il12h4q",
      "text": "Seriously, no one cares about this meathole.",
      "timestamp": "2022-08-20 04:31:23",
      "score": 1,
      "num_children": 0,
      "author": 111710,
      "replies": []
    },
    {
      "id": "ikm1chw",
      "text": "why do i keep getting this sub recommended to me, this is the 6th time ive tried blocking it out :(",
      "timestamp": "2022-08-17 03:30:31",
      "score": -3,
      "num_children": 1,
      "author": 39084,
      "replies": [
        {
          "id": "ikmnki3",
          "text": "Then why did you comment",
          "timestamp": "2022-08-17 07:37:07",
          "score": 7,
          "num_children": 0,
          "author": 134014,
          "replies": []
        }
      ]
    }
  ]
}