{
  "id": "wr0vyr",
  "text": "wtf\n",
  "timestamp": "2022-08-17 21:35:40",
  "score": 718,
  "subreddit": "t5_2zaj2",
  "num_children": 112,
  "author": 400790,
  "replies": [
    {
      "id": "ikpx5ic",
      "text": "So how did this freak get pregnant in the first place?",
      "timestamp": "2022-08-17 22:33:54",
      "score": 268,
      "num_children": 4,
      "author": 186636,
      "replies": [
        {
          "id": "ikr1xbc",
          "text": "A weak man married it",
          "timestamp": "2022-08-18 03:37:41",
          "score": 126,
          "num_children": 2,
          "author": 52779,
          "replies": [
            {
              "id": "iks03al",
              "text": "IT! totally agree. A woman who can't love her son because it's gross is it",
              "timestamp": "2022-08-18 10:25:22",
              "score": 64,
              "num_children": 1,
              "author": 357319,
              "replies": [
                {
                  "id": "ikswxkf",
                  "text": "It's uncapable to love anyone but itself. Unfortunately some humans are like this. They can be also quite ambitious.",
                  "timestamp": "2022-08-18 14:54:58",
                  "score": 26,
                  "num_children": 1,
                  "author": 394886,
                  "replies": [
                    {
                      "id": "iku5rmr",
                      "text": "You mean ambitchous",
                      "timestamp": "2022-08-18 19:46:44",
                      "score": 9,
                      "num_children": 2,
                      "author": 369400,
                      "replies": [
                        {
                          "id": "ikuw899",
                          "text": "You're quite right.",
                          "timestamp": "2022-08-18 22:34:56",
                          "score": 3,
                          "num_children": 0,
                          "author": 394886,
                          "replies": []
                        },
                        {
                          "id": "ikuwncs",
                          "text": "Nah, it's not fair to keep it in the female section. Fathers also can be quite senseless and rude. Objectively the love of the father is always a bit colder. While your mom will keep you warm and safe in a comfort zone out of love, the father will send you in the cold, to teach you about life. He's also doing it for love and both are very important but the point is,on such expectations it's much easier for fathers to fail to do this the right way rather than the mother doing her part wrong.",
                          "timestamp": "2022-08-18 22:37:45",
                          "score": 3,
                          "num_children": 1,
                          "author": 357319,
                          "replies": [
                            {
                              "id": "ikvlrfk",
                              "text": "You would still call a man who is like that a bitch, so i don't see a problem",
                              "timestamp": "2022-08-19 01:40:24",
                              "score": 1,
                              "num_children": 0,
                              "author": 369400,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "iku0cj4",
              "text": "Probably made him pay for artificial insemenation",
              "timestamp": "2022-08-18 19:12:10",
              "score": 4,
              "num_children": 1,
              "author": 363670,
              "replies": [
                {
                  "id": "ikvnra4",
                  "text": "IVF for sure --she talked a lot about selecting gender",
                  "timestamp": "2022-08-19 01:55:25",
                  "score": 2,
                  "num_children": 0,
                  "author": 52779,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ikpz4k5",
          "text": "I wanna say IUI, because I don't think she could stand her husband trebuchet-ing her sacred temple with his nutbags. Let alone taking the battering ram through the doors.",
          "timestamp": "2022-08-17 22:47:27",
          "score": 118,
          "num_children": 6,
          "author": 264878,
          "replies": [
            {
              "id": "ikqe5al",
              "text": "What the- pfft hahahahaha",
              "timestamp": "2022-08-18 00:36:05",
              "score": 29,
              "num_children": 0,
              "author": 268260,
              "replies": []
            },
            {
              "id": "ikqqb5p",
              "text": "\"..,trebuchet-ing her sarced temple with his nutbags...\"\n\n\\*Snort\\*",
              "timestamp": "2022-08-18 02:05:13",
              "score": 27,
              "num_children": 2,
              "author": 183693,
              "replies": [
                {
                  "id": "ikrgacs",
                  "text": "Civ 6 DLC looking wild.",
                  "timestamp": "2022-08-18 06:05:37",
                  "score": 17,
                  "num_children": 0,
                  "author": 362234,
                  "replies": []
                },
                {
                  "id": "ikrki2t",
                  "text": "I have to say I appreciate someone who can use the term trebuchet in a dirty metaphor.",
                  "timestamp": "2022-08-18 06:58:49",
                  "score": 7,
                  "num_children": 0,
                  "author": 80317,
                  "replies": []
                }
              ]
            },
            {
              "id": "ikuoos6",
              "text": ">I don't think she could stand her husband trebuchet-ing her sacred temple with his nutbags. Let alone taking the battering ram through the doors.\n\nHahahah!  That's one hell of a metaphor...\n\n&#x200B;\n\nOne hell of a visual too...",
              "timestamp": "2022-08-18 21:45:32",
              "score": 4,
              "num_children": 0,
              "author": 215306,
              "replies": []
            },
            {
              "id": "ikrx93e",
              "text": "Lol",
              "timestamp": "2022-08-18 09:49:48",
              "score": 3,
              "num_children": 0,
              "author": 31564,
              "replies": []
            },
            {
              "id": "ikwi98n",
              "text": "Oh yeah he definitely NEVER gets his dick sucked —what a shitty marriage",
              "timestamp": "2022-08-19 06:42:19",
              "score": 2,
              "num_children": 0,
              "author": 52779,
              "replies": []
            },
            {
              "id": "ikyixfx",
              "text": "That makes sense. They’re so repulsed by male genitals that I highly doubt she’d allow them inside her.",
              "timestamp": "2022-08-19 17:19:02",
              "score": 2,
              "num_children": 0,
              "author": 352347,
              "replies": []
            }
          ]
        },
        {
          "id": "ikrpyhx",
          "text": "There is always a simp out there",
          "timestamp": "2022-08-18 08:11:01",
          "score": 19,
          "num_children": 0,
          "author": 304158,
          "replies": []
        },
        {
          "id": "iks59ip",
          "text": "A desperate virgin married her",
          "timestamp": "2022-08-18 11:21:48",
          "score": 12,
          "num_children": 0,
          "author": 79811,
          "replies": []
        }
      ]
    },
    {
      "id": "ikpyci6",
      "text": "Some women have zero business being parents.",
      "timestamp": "2022-08-17 22:42:03",
      "score": 86,
      "num_children": 1,
      "replies": [
        {
          "id": "iksv13f",
          "text": "Some humans have zero business being humans.\n\nFTFY\n\nOh shit I just quoted Hitler",
          "timestamp": "2022-08-18 14:42:35",
          "score": 15,
          "num_children": 2,
          "author": 81905,
          "replies": [
            {
              "id": "iktaffh",
              "text": ">Oh shit I just quoted Hitler\n\nthat doesn't make it any wrong",
              "timestamp": "2022-08-18 16:24:41",
              "score": 9,
              "num_children": 1,
              "author": 329835,
              "replies": [
                {
                  "id": "ikxmong",
                  "text": "Fuck me, you can't say that... you can't say that!",
                  "timestamp": "2022-08-19 13:49:43",
                  "score": 1,
                  "num_children": 1,
                  "author": 82106,
                  "replies": [
                    {
                      "id": "ikxoagl",
                      "text": "why there are times even feminists tell the truth",
                      "timestamp": "2022-08-19 14:00:45",
                      "score": 1,
                      "num_children": 0,
                      "author": 329835,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ikucaq5",
              "text": "Just because hitler was a terrible person doesn't mean every word was terrible. Even the worst person can say great things",
              "timestamp": "2022-08-18 20:28:04",
              "score": 4,
              "num_children": 0,
              "author": 310057,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikprnxg",
      "text": "Once again I am convince that some women just shouldn't be mothers plain and simple. The thing about parenthood is that you're always going to have the gamble of having a son or a daughter. You can want one or the other or want to have both but that doesn't change the odds of what gender the baby will be. \n\nThere are men who wanted a son and only had daughters whereas there are women who wanted a daughter and only had sons. Yet at the end of the day those men and women still raised their children regardless. I'm just so confused though with this woman. If she hates male genitals so much, how did she even do the deed to conceive this son? Did she do it with her eyes shut and then opened them back up when it was over? \n\nThis whole scenario is very confusing to me.",
      "timestamp": "2022-08-17 21:56:56",
      "score": 216,
      "num_children": 5,
      "author": 171580,
      "replies": [
        {
          "id": "ikq47a2",
          "text": "Kids gonna spend some time on the couch, with a mom like that. Can you imagine if a father talked that way?",
          "timestamp": "2022-08-17 23:23:42",
          "score": 70,
          "num_children": 2,
          "author": 196342,
          "replies": [
            {
              "id": "ikqfefr",
              "text": "The father isn't just a father, he was his replacement for his disgusted mom.",
              "timestamp": "2022-08-18 00:45:28",
              "score": 29,
              "num_children": 0,
              "author": 397761,
              "replies": []
            },
            {
              "id": "ikq4j3b",
              "text": "I imagine in the hypothetical scenario the father talked that way about women and their genitals like the way she talked about male genitals, I imagine the mother would put up with it for a little bit but eventually just have enough and take the kid and leave.",
              "timestamp": "2022-08-17 23:26:05",
              "score": 37,
              "num_children": 2,
              "author": 171580,
              "replies": [
                {
                  "id": "ikqdduc",
                  "text": "Yeah, it was really an abusive environment she described, because the whole family knew that the mom was disgusted by the child, and they had to intervene if the child tried to express affection toward its own mother. That indicates she abuses the others, too, and they are all walking on eggshells, so she doesn't express disgust at the child. And what in God's name is she saying her job is? I can't imagine someone like that becoming a healthcare worker, but seemed to be what she was suggesting. I just pray the dad has enough time with the kid to show the kid what life is really about, so he doesn't end up with mental health issues from the mom.",
                  "timestamp": "2022-08-18 00:30:27",
                  "score": 26,
                  "num_children": 0,
                  "author": 196342,
                  "replies": []
                },
                {
                  "id": "iks71rz",
                  "text": "Yes, she could convince most courts that this is not a suitable environment of the kids. Then she divorce from the obviously mental ill man that do hate his little daughter and get custody for both. Plus the whole pity because she was clearly right. But we live in this world, here is it covered by a thing called feminism. A woman could not make mistakes, especially if its go against men. Maybe not anytime, but clear  to much. Think alone if a man would say that he let abort their kid if its female. I mean in a world there both parents would have the same right for the kids, not just the \"right\" to pay for it. This man could bury himself.",
                  "timestamp": "2022-08-18 11:39:09",
                  "score": 2,
                  "num_children": 0,
                  "author": 86325,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ikq38s7",
          "text": "When you google sex selective abortions against boys (unfortunately it is very present in places in china or india against girls) you only find femae foeticide.\n\nHmmmm... Why?",
          "timestamp": "2022-08-17 23:16:49",
          "score": 19,
          "num_children": 2,
          "author": 309083,
          "replies": [
            {
              "id": "iksdam0",
              "text": "umm. im an indian. the current male to female ratio is 1020 females to every 1000 men. \n\nthese are national family health bureau's official figures. what in the actual fuck are you one about female foeticide ???\n\nnot to mention, gender based abortions are illegal in india. not only does the husband, wife, family members go to jail, the doctors performing the said abortion also go to jail. \n\nohh, im also a lawyer in india. so dont challenge me on this. I know more about my country than you ever will.",
              "timestamp": "2022-08-18 12:34:37",
              "score": 6,
              "num_children": 2,
              "author": 286720,
              "replies": [
                {
                  "id": "ikt3is4",
                  "text": "You're wrong. I looked into media articles and they said otherwise. /s",
                  "timestamp": "2022-08-18 15:39:08",
                  "score": 2,
                  "num_children": 1,
                  "author": 309083,
                  "replies": [
                    {
                      "id": "iktc5uk",
                      "text": "hidden sarcasm. nice. I almost fell for it for a second.",
                      "timestamp": "2022-08-18 16:35:53",
                      "score": 5,
                      "num_children": 0,
                      "author": 286720,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "iktdjkj",
                  "text": "Yikes, you are disgusting. There are multiple studies done on this and they predict that by 2030 6,8 million less girls have been born in India compared to men. In some villages only 760 girls have been born compared to boys. Why are you denying facts like this?",
                  "timestamp": "2022-08-18 16:44:49",
                  "score": 1,
                  "num_children": 1,
                  "author": 266336,
                  "replies": [
                    {
                      "id": "iktfnh3",
                      "text": "do you actually have the studies to back that insanity up???\n\nor do you just like talking out of your behind like most feminists do. \n\n[https://www.bbc.com/news/world-asia-india-59428011](https://www.bbc.com/news/world-asia-india-59428011)\n\nI can provide links to the official data. but I guess it still wouldnt get into that thick skull of yours. and you're literally basing your fucking argument on predictions of unnamed studies. you do realise trends change??\n\nwhat an absolute piss poor excuse for a woman you are. makes me sick to actually be conversing with you right now. ugh. \n\nif im denying facts, you're living soo deep in your delusion that you dont even know what's reality any more. \n\nwhat an absolute twat.",
                      "timestamp": "2022-08-18 16:58:21",
                      "score": 1,
                      "num_children": 0,
                      "author": 286720,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ikq9vu7",
              "text": "That's just a myth, though. There's not really a preference for having girls or boys in China.",
              "timestamp": "2022-08-18 00:04:51",
              "score": -2,
              "num_children": 4,
              "author": 201388,
              "replies": [
                {
                  "id": "iks7837",
                  "text": "I believe Chinese culture (and maybe law?) means that boys have to look after their parents when they get older, whereas there is no such expectation for girls (I assume as they would marry and so look after their husband's parents). This is why they traditionally wanted boys and not girls, as otherwise they would put in all the work and expenditure bringing them up, only for someone else to benefit.",
                  "timestamp": "2022-08-18 11:40:48",
                  "score": 3,
                  "num_children": 0,
                  "author": 280068,
                  "replies": []
                },
                {
                  "id": "ikqvccm",
                  "text": "Agreed. For pretty much all of history the elite class wanted sons, but the peasantry knew daughters were a safer bet.",
                  "timestamp": "2022-08-18 02:43:48",
                  "score": 4,
                  "num_children": 0,
                  "author": 139463,
                  "replies": []
                },
                {
                  "id": "ikqv0oc",
                  "text": "LOL!!!! The fine said otherwise.",
                  "timestamp": "2022-08-18 02:41:17",
                  "score": 2,
                  "num_children": 0,
                  "author": 389946,
                  "replies": []
                },
                {
                  "id": "iktdfsv",
                  "text": "So why are they abducting women from poor countries now to marry their sons? Totally not because many girls have been aborted..",
                  "timestamp": "2022-08-18 16:44:08",
                  "score": 0,
                  "num_children": 0,
                  "author": 266336,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iku511k",
          "text": "My uncle always wanted a son so he could give him a specific first name, that combined with our last name, would make a silly, albeit funny, pun. Instead he had 5 girls. I’m sure he was slightly disappointed because I think most guys want a boy to have a little mini me and someone to teach to do ‘guy’ stuff but he loved each of his daughters with all of his heart. \n\nI don’t think you should even consider being a parent if you aren’t willing to unconditionally love, protect, and take care of whatever your child happens to be. This ‘mother’ is a repulsive and the father sounds like a weak, enabling, shell of a man.",
          "timestamp": "2022-08-18 19:42:05",
          "score": 2,
          "num_children": 0,
          "author": 187853,
          "replies": []
        },
        {
          "id": "ikrlkbg",
          "text": "I’d bet 100 if they divorced she’d still want full custody, despite hating the child for something out of there control.",
          "timestamp": "2022-08-18 07:12:34",
          "score": 2,
          "num_children": 0,
          "author": 47577,
          "replies": []
        },
        {
          "id": "ikr324g",
          "text": "*raises hand*\n\nMa'am, how is this any different from the pagan era Ar*bs burying their daughters alive in the sand due to shame?\n\nThe West has cracked vistas of savagery and barbarism that we, have long since abandoned...",
          "timestamp": "2022-08-18 03:47:37",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ikprzrt",
      "text": "Where this shit came from?",
      "timestamp": "2022-08-17 21:59:05",
      "score": 32,
      "num_children": 2,
      "replies": [
        {
          "id": "ikqksam",
          "text": "Reddit threatened to ban this sub if posters included the information about where this kind of post came from. They claimed it was harassment or something. Hard to imagine someone defending this kind of language in the post that was included, but that's reddit for you.",
          "timestamp": "2022-08-18 01:24:39",
          "score": 39,
          "num_children": 2,
          "author": 196342,
          "replies": [
            {
              "id": "ikr202t",
              "text": "In this case she does need to be exposed because she is clearly saying she wanted him killed",
              "timestamp": "2022-08-18 03:38:20",
              "score": 9,
              "num_children": 0,
              "author": 52779,
              "replies": []
            },
            {
              "id": "ikr1d2z",
              "text": "You can always PM the where the OP got it from...",
              "timestamp": "2022-08-18 03:32:51",
              "score": 2,
              "num_children": 3,
              "author": 207185,
              "replies": [
                {
                  "id": "ikr2uci",
                  "text": "Or search google.  Or reddit.",
                  "timestamp": "2022-08-18 03:45:43",
                  "score": 6,
                  "num_children": 0,
                  "author": 227146,
                  "replies": []
                },
                {
                  "id": "ikscpy4",
                  "text": "We do not encourage brigading, this message will serve as a warning to you and a final one. I am not trying to seem like a mod who is abusing his power, but this sub is barely holding on and we now must enforce every rule meticulously.",
                  "timestamp": "2022-08-18 12:29:48",
                  "score": 5,
                  "num_children": 0,
                  "author": 178064,
                  "replies": []
                },
                {
                  "id": "ikrlwvt",
                  "text": "Careful with that if someone is looking for to break any rules (brigading) they can use that as ‘proof’",
                  "timestamp": "2022-08-18 07:17:10",
                  "score": 1,
                  "num_children": 0,
                  "author": 47577,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ikthaxr",
          "text": "I got it from another sub but if I try and link it the comment doesn’t post for some reason.",
          "timestamp": "2022-08-18 17:09:05",
          "score": 2,
          "num_children": 1,
          "author": 400790,
          "replies": [
            {
              "id": "ikv4q7g",
              "text": "That is because we do not allow links to subreddits, or pictures that display the name of subreddits or other Redditors for that matter.  This is done to further enforce rule 4.",
              "timestamp": "2022-08-18 23:34:13",
              "score": 2,
              "num_children": 0,
              "author": 178064,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikqeis4",
      "text": "But when a dad says this about a daughter, the same feminists will accuse him of sexualising her and call him a pedo",
      "timestamp": "2022-08-18 00:38:53",
      "score": 32,
      "num_children": 1,
      "author": 354634,
      "replies": [
        {
          "id": "ikr2087",
          "text": "Yeah, it's horrible how female pedophiles are able to go around destroying boys one at a time.",
          "timestamp": "2022-08-18 03:38:22",
          "score": 17,
          "num_children": 1,
          "author": 207185,
          "replies": [
            {
              "id": "iksdjja",
              "text": "a Texas teacher groomed a 10 yr old boy for 3 yrs. shes started when he was 10 yrs old and then did it till he was 13. and fucking got 60 days in jail because after her husband divorced her, she got with a guy and got pregnant. \n\nhow the fuck does a woman who is supposed to be registered as a sex offender in Texas get to raise a fucking child???",
              "timestamp": "2022-08-18 12:36:41",
              "score": 12,
              "num_children": 0,
              "author": 286720,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikq26mk",
      "text": "The boy grows up completely  full of unresolved emotional problems but as soon as he does anything \n\n\"See! Young white men evil!\"",
      "timestamp": "2022-08-17 23:09:11",
      "score": 70,
      "num_children": 0,
      "author": 101170,
      "replies": []
    },
    {
      "id": "ikq7060",
      "text": "Serious therapy is definitely needed here.",
      "timestamp": "2022-08-17 23:44:01",
      "score": 16,
      "num_children": 2,
      "author": 170728,
      "replies": [
        {
          "id": "ikqpixv",
          "text": "unfortunately it's the son who'll be paying for all/doing of it",
          "timestamp": "2022-08-18 01:59:28",
          "score": 7,
          "num_children": 0,
          "author": 48611,
          "replies": []
        },
        {
          "id": "ikr1vxy",
          "text": "For the child and father, the \"mother\" is too far gone.",
          "timestamp": "2022-08-18 03:37:21",
          "score": 7,
          "num_children": 0,
          "author": 207185,
          "replies": []
        }
      ]
    },
    {
      "id": "ikqnxd0",
      "text": "A mother who is obsessed with her own child's genitalia? Seems CPS missed something here.",
      "timestamp": "2022-08-18 01:47:37",
      "score": 13,
      "num_children": 0,
      "author": 340486,
      "replies": []
    },
    {
      "id": "ikr8r20",
      "text": "But, but feminists have told me that misandry doesn't even exist...",
      "timestamp": "2022-08-18 04:41:27",
      "score": 12,
      "num_children": 1,
      "author": 294229,
      "replies": [
        {
          "id": "ikrveyq",
          "text": "It's not misandry, it's \"gender disappointment\", an absolutely different thing that was caused by people like you and 100% exists unlike misandry and she's the victim here, have some empathy! /S",
          "timestamp": "2022-08-18 09:25:26",
          "score": 3,
          "num_children": 0,
          "author": 126706,
          "replies": []
        }
      ]
    },
    {
      "id": "ikqkk8x",
      "text": "In a way, the issue isn’t that these human pieces of debris exist, or have always existed-it’s that now they are within the greater validation context of this current leftist nightmare which not only spews this man-hating narrative but also is tacitly accepting of these traits, as the story above, along with mostly everything else that makes these women and their supporters cancer for societies.",
      "timestamp": "2022-08-18 01:23:02",
      "score": 11,
      "num_children": 0,
      "author": 405130,
      "replies": []
    },
    {
      "id": "ikq7wcy",
      "text": "What the actual fuck?? Idgaf what gender it is Id be happy. I want a boy but I’m not gonna treat the other like it’s an abomination. It’s a child. A gift no matter the gender. \n\n(The Sex) instead of Gender",
      "timestamp": "2022-08-17 23:50:25",
      "score": 31,
      "num_children": 1,
      "author": 291334,
      "replies": [
        {
          "id": "ikrg7rg",
          "text": "[deleted]",
          "timestamp": "2022-08-18 06:04:46",
          "score": -2,
          "num_children": 2,
          "replies": [
            {
              "id": "iksa1lu",
              "text": "Cool",
              "timestamp": "2022-08-18 12:06:30",
              "score": 3,
              "num_children": 0,
              "author": 291334,
              "replies": []
            },
            {
              "id": "ikt4s99",
              "text": "SAME THING",
              "timestamp": "2022-08-18 15:47:37",
              "score": 1,
              "num_children": 0,
              "author": 332776,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikq236l",
      "text": "What if genders were reversed? If it was father who despises his daughter he would be labelled as a monster on the spot.",
      "timestamp": "2022-08-17 23:08:29",
      "score": 8,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ikpxw2w",
      "text": "Disgusting \"human\" the world would be better off without her.",
      "timestamp": "2022-08-17 22:38:57",
      "score": 26,
      "num_children": 1,
      "replies": [
        {
          "id": "ikqe3hh",
          "text": "this is the race which god is so proud of ever creating right? i think he might be reconsidering that now",
          "timestamp": "2022-08-18 00:35:43",
          "score": 4,
          "num_children": 0,
          "author": 364123,
          "replies": []
        }
      ]
    },
    {
      "id": "ikq1lms",
      "text": "Evil bitch.",
      "timestamp": "2022-08-17 23:04:59",
      "score": 25,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ikq23ye",
      "text": "I'm getting real fucking fed up with the way young boys are treated these days",
      "timestamp": "2022-08-17 23:08:39",
      "score": 28,
      "num_children": 0,
      "author": 241416,
      "replies": []
    },
    {
      "id": "ikqp5d9",
      "text": "Poor kid. Yet it's all about her. She expects people to feel sorry for *her*. The really gross thing is there are plenty of feminists who will.",
      "timestamp": "2022-08-18 01:56:41",
      "score": 8,
      "num_children": 0,
      "author": 32266,
      "replies": []
    },
    {
      "id": "ikqqjc6",
      "text": "Her poor fucking husband.",
      "timestamp": "2022-08-18 02:06:55",
      "score": 9,
      "num_children": 1,
      "author": 304865,
      "replies": [
        {
          "id": "ikr5buw",
          "text": "Her poor fucking son.",
          "timestamp": "2022-08-18 04:08:01",
          "score": 14,
          "num_children": 0,
          "author": 62540,
          "replies": []
        }
      ]
    },
    {
      "id": "ikrqqvc",
      "text": "So she's a pedophile, basically. How come female pedos are tolerated, but the male ones aren't, even though they are both the same pieces of shit? This is absolutely disgusting. What the fuck happened to our society?",
      "timestamp": "2022-08-18 08:21:39",
      "score": 8,
      "num_children": 0,
      "author": 69956,
      "replies": []
    },
    {
      "id": "ikqd6f2",
      "text": "Read this with the genders reversed....",
      "timestamp": "2022-08-18 00:28:54",
      "score": 8,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ikr1oy8",
      "text": "What is this thing doing with small children while thinking about their Genitalia? \n\nEven writing that out I'm disgusted!!!",
      "timestamp": "2022-08-18 03:35:41",
      "score": 7,
      "num_children": 0,
      "author": 207185,
      "replies": []
    },
    {
      "id": "ikrc5pk",
      "text": "Wtf?! People like this who treat their kids unfairly because of their sex shouldn't have children. What happens when the boy gets older and has questions about his body? Is she just gonna be like, I'm sorry son but that's really gross?! Anyways, this woman should not have children any children, even if she had a daughter she still would be projecting her disgust for men and their parts towards her daughter.",
      "timestamp": "2022-08-18 05:17:49",
      "score": 7,
      "num_children": 0,
      "author": 369985,
      "replies": []
    },
    {
      "id": "ikqc9d7",
      "text": "THIS is fucking disturbing...",
      "timestamp": "2022-08-18 00:22:04",
      "score": 15,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ikqnb5s",
      "text": "Yet she would never wanna hand over the child to the father.....",
      "timestamp": "2022-08-18 01:43:03",
      "score": 6,
      "num_children": 0,
      "author": 74439,
      "replies": []
    },
    {
      "id": "ikrcvbq",
      "text": "And then she'll be surprised when the kid grows up with emotional and behavioural issues. This woman needs therapy if she's feeling that way towards her child. If you cannot just be happy with a healthy child, regardless of gender, you shouldn't have kids.",
      "timestamp": "2022-08-18 05:25:45",
      "score": 4,
      "num_children": 0,
      "author": 132802,
      "replies": []
    },
    {
      "id": "ikq9ei9",
      "text": "You know, it's just amazing that someone would actually post this (if it's real of course).",
      "timestamp": "2022-08-18 00:01:27",
      "score": 12,
      "num_children": 1,
      "author": 328906,
      "replies": [
        {
          "id": "ikqkhp5",
          "text": "I am so skeptical. I have both genders and while they are different the caretaking is the exact same for babies and young kids. I feel like as a mom you get like hormonally programmed to not be grossed out by your kid. How could you possibly call any part of your very own baby or toddler that you made gross",
          "timestamp": "2022-08-18 01:22:31",
          "score": 10,
          "num_children": 2,
          "author": 206854,
          "replies": [
            {
              "id": "ikr37xj",
              "text": "\\>I feel like as a mom you get like hormonally programmed to not be grossed out by your kid.\n\nYeah, that's true, but like everything else ever the hormonal effect and volume is entirely different on every person, and can range from completely transformative to entirely ineffective.",
              "timestamp": "2022-08-18 03:49:02",
              "score": 4,
              "num_children": 0,
              "author": 227146,
              "replies": []
            },
            {
              "id": "ikr23lx",
              "text": "If you’re a feminist who hates men then yes I can totally see it",
              "timestamp": "2022-08-18 03:39:13",
              "score": 5,
              "num_children": 0,
              "author": 52779,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikq2jnr",
      "text": "Boy = kill\nGirl = superiority",
      "timestamp": "2022-08-17 23:11:47",
      "score": 12,
      "num_children": 1,
      "author": 9803,
      "replies": [
        {
          "id": "ikqvsi3",
          "text": "Excuse me doctor, I was promised the future would be female?",
          "timestamp": "2022-08-18 02:47:19",
          "score": 5,
          "num_children": 1,
          "author": 139463,
          "replies": [
            {
              "id": "ikr3gh6",
              "text": "That's a typo.  It's the furniture will be female.",
              "timestamp": "2022-08-18 03:51:06",
              "score": 5,
              "num_children": 1,
              "author": 227146,
              "replies": [
                {
                  "id": "iksesuc",
                  "text": "This message is brought to you by Soylent Yellow, Soylent Red and brand new Soylent Green.\"",
                  "timestamp": "2022-08-18 12:47:01",
                  "score": 2,
                  "num_children": 1,
                  "author": 264772,
                  "replies": [
                    {
                      "id": "il1n6bj",
                      "text": "Lol I was 99% sure no one was going to get it.\n\nAlso whoever downvoted you is literally Hitler.",
                      "timestamp": "2022-08-20 08:48:38",
                      "score": 3,
                      "num_children": 0,
                      "author": 227146,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ikqb3nf",
      "text": "Where is this from? It’s simply disgusting",
      "timestamp": "2022-08-18 00:13:40",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ikqmblj",
      "text": "Why did you took your husbands (you know what) inside you if you hate male parts?",
      "timestamp": "2022-08-18 01:35:49",
      "score": 2,
      "num_children": 0,
      "author": 160684,
      "replies": []
    },
    {
      "id": "ikrwezo",
      "text": "20 years from now: \"My son refuses to see or even talk to me for no good reason, but he has a great relationship with his father, even though we were both equally good parents! I'm thinking he might be just a raging misogynist, that's why he pushed me out of life, but not his father!\"",
      "timestamp": "2022-08-18 09:38:52",
      "score": 4,
      "num_children": 0,
      "author": 42637,
      "replies": []
    },
    {
      "id": "ikpzu9d",
      "text": "Me thinks the “old yella” treatment for this women would do fine. \n\nI hope the husband finds that fucking post and leaves her because of it.",
      "timestamp": "2022-08-17 22:52:25",
      "score": 10,
      "num_children": 1,
      "author": 284961,
      "replies": [
        {
          "id": "ikr3d32",
          "text": "That was hydrophobia, not phallophobia.  But I can agree that this is clearly a crazy bitch.",
          "timestamp": "2022-08-18 03:50:16",
          "score": 0,
          "num_children": 0,
          "author": 227146,
          "replies": []
        }
      ]
    },
    {
      "id": "ikqa1v9",
      "text": "I just hope her son grows resentful and full of hatred towards her, since that's the minimum she deserves.",
      "timestamp": "2022-08-18 00:06:02",
      "score": 7,
      "num_children": 1,
      "author": 201388,
      "replies": [
        {
          "id": "ikqcwav",
          "text": "[deleted]",
          "timestamp": "2022-08-18 00:26:49",
          "score": 2,
          "num_children": 1,
          "replies": [
            {
              "id": "ikrwrxt",
              "text": "How drastic and colourful. He will probably ignore her.",
              "timestamp": "2022-08-18 09:43:37",
              "score": 1,
              "num_children": 0,
              "author": 349781,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikqgfng",
      "text": "Honestly, relatable my mum hates men so I know how that kid will grow up",
      "timestamp": "2022-08-18 00:53:09",
      "score": 8,
      "num_children": 1,
      "author": 180066,
      "replies": [
        {
          "id": "ikqt8fe",
          "text": "Same bro. My adoptive mom hated and treated men, including my adoptive father, like absolute shit.",
          "timestamp": "2022-08-18 02:27:26",
          "score": 5,
          "num_children": 0,
          "author": 377461,
          "replies": []
        }
      ]
    },
    {
      "id": "ikroco5",
      "text": "Dad needs to get that kid away from that crazy",
      "timestamp": "2022-08-18 07:49:17",
      "score": 3,
      "num_children": 0,
      "author": 27702,
      "replies": []
    },
    {
      "id": "ikrpupo",
      "text": "Mentally ill and so unworthy of being a parent. I feel sorry for the boy.",
      "timestamp": "2022-08-18 08:09:36",
      "score": 3,
      "num_children": 0,
      "author": 399687,
      "replies": []
    },
    {
      "id": "ikq6lk5",
      "text": "Honestly her real name needs to be found out so CPS can get involved--she is admitting she wanted him killed",
      "timestamp": "2022-08-17 23:41:09",
      "score": 9,
      "num_children": 0,
      "author": 52779,
      "replies": []
    },
    {
      "id": "ikq6gc8",
      "text": "Holy shit this woman needs her son taken away from her! She does not deserve him as a son and he should be given to a home and with a mom and dad who actually care about him. Poor dude. Instead of considering abortion she should just be sterilized and  honestly her husband should have his balls removed because he procreated and helped bring this child into a sad life with a cunt mom",
      "timestamp": "2022-08-17 23:40:05",
      "score": 4,
      "num_children": 1,
      "author": 52779,
      "replies": [
        {
          "id": "ikqtefe",
          "text": "The father may have not known she was this way until after she got pregnant. He's probably walking on eggshells though because if he left...she'd still get custody and she'd do even more damage to that poor child.",
          "timestamp": "2022-08-18 02:28:44",
          "score": 5,
          "num_children": 1,
          "author": 377461,
          "replies": [
            {
              "id": "ikqysff",
              "text": "I get it but don’t link up with feminist leaning women in the first place —sounds like she even just used the guy to have a kid and was disappointed that it was a boy , feminism is a disease but can be avoided by not marrying and having future damaged kids with them",
              "timestamp": "2022-08-18 03:11:19",
              "score": 2,
              "num_children": 0,
              "author": 52779,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ikq9dff",
      "text": "And to think she let one of these nasty penis’s inside of her. Gross",
      "timestamp": "2022-08-18 00:01:14",
      "score": 4,
      "num_children": 0,
      "author": 221338,
      "replies": []
    },
    {
      "id": "ikqt23v",
      "text": "Sounds like my adoptive mother. Us boys were treated 100% different than the girls.",
      "timestamp": "2022-08-18 02:26:02",
      "score": 5,
      "num_children": 1,
      "author": 377461,
      "replies": [
        {
          "id": "ikrietc",
          "text": "Their logic -  \n\n\nMale = aggressive = bad = treat them bad because they are masculine so they will resist whatever you throw on them. Female = less aggressive = good = make them self entitled.",
          "timestamp": "2022-08-18 06:31:54",
          "score": 6,
          "num_children": 0,
          "author": 248374,
          "replies": []
        }
      ]
    },
    {
      "id": "ikqvk5m",
      "text": "So a penis and scrotum is gross yet how did she get impregnated?\n\nHow does she have sex with husband?\n\nWomen have lost their fucking minds",
      "timestamp": "2022-08-18 02:45:30",
      "score": 6,
      "num_children": 0,
      "author": 126688,
      "replies": []
    },
    {
      "id": "ikqqhuq",
      "text": "Now I am reminded of this equally disgusting shite: [https://www.youtube.com/watch?v=mqA7g7a\\_f8A](https://www.youtube.com/watch?v=mqA7g7a_f8A)\n\nWhy do husbands put up with this?\n\nThen again, court biases would not make it easy for him to take the boy, even if he disagreed with her repulsive, misandric dreck. \n\nI honestly think that there is noting wrong with being repulsed by genitalia itself, but that becomes a whole different matter when it is used to treat one sex as objectively evil. \n\nIt becomes another different matter when you treat your own innocent offspring like that. They are wholly reliant on you for love, care and comfort, and, putting aside your disgust for such tasks is the least you can do as a parent.",
      "timestamp": "2022-08-18 02:06:36",
      "score": 5,
      "num_children": 0,
      "author": 183693,
      "replies": []
    },
    {
      "id": "ikr2ut2",
      "text": "*raises hand*\n\nMa'am, how is this any different from the pagan era At*bs burying their daughters alive in the sand due to shame?\n\nThe West has cracked vistas of savagery and barbarism that we, have long forsook...",
      "timestamp": "2022-08-18 03:45:49",
      "score": 5,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ikq5v59",
      "text": "Real?",
      "timestamp": "2022-08-17 23:35:46",
      "score": 2,
      "num_children": 0,
      "author": 143934,
      "replies": []
    },
    {
      "id": "ikq6pyy",
      "text": "Mom?",
      "timestamp": "2022-08-17 23:42:02",
      "score": 2,
      "num_children": 0,
      "author": 6113,
      "replies": []
    },
    {
      "id": "ikqmloa",
      "text": "I really hope this is not real",
      "timestamp": "2022-08-18 01:37:52",
      "score": 2,
      "num_children": 0,
      "author": 111081,
      "replies": []
    },
    {
      "id": "ikqolbf",
      "text": "Was I happy my child was born a boy, yes; does that mean if he were the opposite I’d love her any less? The answer is fuck no.",
      "timestamp": "2022-08-18 01:52:30",
      "score": 2,
      "num_children": 0,
      "author": 36832,
      "replies": []
    },
    {
      "id": "ikqw63u",
      "text": "Fuck man, imagine a father saying this about his daughter. Holy shit. Just wow",
      "timestamp": "2022-08-18 02:50:19",
      "score": 2,
      "num_children": 0,
      "author": 104276,
      "replies": []
    },
    {
      "id": "ikqw8lr",
      "text": "Imagine you adopt a kid, and choose who you want to adopt, just to suddenly get race disappointment months afterwards.",
      "timestamp": "2022-08-18 02:50:51",
      "score": 2,
      "num_children": 0,
      "author": 348859,
      "replies": []
    },
    {
      "id": "ikqzax6",
      "text": "Wtf",
      "timestamp": "2022-08-18 03:15:35",
      "score": 2,
      "num_children": 0,
      "author": 276438,
      "replies": []
    },
    {
      "id": "ikri5kb",
      "text": "Mother of the fucking year!",
      "timestamp": "2022-08-18 06:28:42",
      "score": 2,
      "num_children": 0,
      "author": 310265,
      "replies": []
    },
    {
      "id": "ikrjzu7",
      "text": "You just know that when the child grows up with severe mental health issues as a direct result from this, he’ll get blamed as a reason for men being inherently bad.",
      "timestamp": "2022-08-18 06:52:15",
      "score": 2,
      "num_children": 0,
      "author": 127412,
      "replies": []
    },
    {
      "id": "ikrkg22",
      "text": "I wanted a son with my first child, I wanted it so much. \n\nWe had a little girl, she's perfect and everything I ever wanted, I couldn't be happier.\n\nShe will always be my first born, my little girl, even if she is closer to being a woman now I don't see that feeling ever changing.",
      "timestamp": "2022-08-18 06:58:04",
      "score": 2,
      "num_children": 0,
      "author": 71361,
      "replies": []
    },
    {
      "id": "ikrl0ot",
      "text": "And the award for the worst mother goes to this individual!",
      "timestamp": "2022-08-18 07:05:30",
      "score": 2,
      "num_children": 0,
      "author": 177632,
      "replies": []
    },
    {
      "id": "ikswp1v",
      "text": "Yeah, this is a mental illness right here. There is nothing normal about that.",
      "timestamp": "2022-08-18 14:53:25",
      "score": 2,
      "num_children": 0,
      "author": 274235,
      "replies": []
    },
    {
      "id": "iktbhud",
      "text": "What a disgusting mother…",
      "timestamp": "2022-08-18 16:31:34",
      "score": 2,
      "num_children": 0,
      "author": 177786,
      "replies": []
    },
    {
      "id": "il8nkpz",
      "text": "bro but…? how’d you get pregnant and have a husband if you don’t like dicks???",
      "timestamp": "2022-08-21 21:05:02",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ikqwwh2",
      "text": "Is it too late to abort the mother?",
      "timestamp": "2022-08-18 02:56:07",
      "score": 1,
      "num_children": 0,
      "author": 129470,
      "replies": []
    },
    {
      "id": "ikra3em",
      "text": "bitch of a mother. should be ashamed",
      "timestamp": "2022-08-18 04:55:29",
      "score": 3,
      "num_children": 0,
      "author": 389204,
      "replies": []
    },
    {
      "id": "iks73c1",
      "text": "If this evil bitch hates penises so much, how in the hell did she get pregnant? A ton of alcohol?",
      "timestamp": "2022-08-18 11:39:33",
      "score": 3,
      "num_children": 0,
      "author": 184807,
      "replies": []
    },
    {
      "id": "ikt696l",
      "text": ">…I have never given my son a bath because I find male genitalia revolting…\n\nThen why did you let your husbando do the smexorino with you in the first place?",
      "timestamp": "2022-08-18 15:57:18",
      "score": 2,
      "num_children": 0,
      "author": 130643,
      "replies": []
    },
    {
      "id": "ikrgtdx",
      "text": "This is definitely fake.\n\nIf this is not fake, this person (who is an *individual*, not a group) is very sick in the head and giving that to her son.",
      "timestamp": "2022-08-18 06:12:02",
      "score": 2,
      "num_children": 0,
      "author": 156942,
      "replies": []
    },
    {
      "id": "ikrkfo2",
      "text": "This is pure evil.  There is no excusing it.  For the very EXACT reason that a man raping and murdering women is wrong, so is this.  Ripping apart babies with a vacuum isn’t excused by misandry.  I’m very opened to being empathetic to people in general, but I draw the line at excusing murder purely because it was posited on the basis of wiping one sex off the planet.  This is the legitimate meaning of the term genocide.  I read this in precisely the same tone as Hitler spoke to his SA and SS officers…It’s pure evil.  Inexcusable, unredeemable, inescapable evil.",
      "timestamp": "2022-08-18 06:57:56",
      "score": 2,
      "num_children": 0,
      "author": 80317,
      "replies": []
    },
    {
      "id": "iks7uw9",
      "text": "The husband needs to grow some balls, needs to  take his son and run away, show that text in the custody battle, showing the huge amount of damage that this \"mother\" can inflict on his son. This woman is the kind of person who would convince the kid that he's a trans woman and that he should get sex rearranging surgery before he hits puberty",
      "timestamp": "2022-08-18 11:46:39",
      "score": 2,
      "num_children": 0,
      "author": 184807,
      "replies": []
    },
    {
      "id": "iksqliy",
      "text": "Now imagine that a man spoke of his daughter's genitals that way.  The pussywhipped butthurt admins would DEFINITELY ban you for sexism.  Oh but, a woman says it about a BABY\"S penis and scrotum, nah, that's just A-OK.\n\nAnd misandry doesn't real, incel. /s",
      "timestamp": "2022-08-18 14:13:06",
      "score": 2,
      "num_children": 0,
      "author": 397635,
      "replies": []
    },
    {
      "id": "iktj4qs",
      "text": "Some pussies look like rotten roast beef. That’s gross too. 🤮",
      "timestamp": "2022-08-18 17:21:08",
      "score": 2,
      "num_children": 0,
      "author": 147103,
      "replies": []
    },
    {
      "id": "ikto6e3",
      "text": "You know some elephents bury their dead child and then there is this... and then reddit tries to banTHIS sub.",
      "timestamp": "2022-08-18 17:53:58",
      "score": 2,
      "num_children": 0,
      "author": 274100,
      "replies": []
    },
    {
      "id": "iktpjav",
      "text": "This woman is a closet lesbian",
      "timestamp": "2022-08-18 18:02:42",
      "score": 2,
      "num_children": 0,
      "author": 95888,
      "replies": []
    },
    {
      "id": "ikqa89k",
      "text": "sauce?",
      "timestamp": "2022-08-18 00:07:19",
      "score": 1,
      "num_children": 0,
      "author": 361014,
      "replies": []
    },
    {
      "id": "ikr0vw2",
      "text": "Crazy cunts",
      "timestamp": "2022-08-18 03:28:45",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ikrjviu",
      "text": "What a stone cold bitch",
      "timestamp": "2022-08-18 06:50:42",
      "score": 1,
      "num_children": 0,
      "author": 91885,
      "replies": []
    },
    {
      "id": "iks7cp8",
      "text": "This is disgusting. How is the father of the child allowing this? She states that he knows how she feels.",
      "timestamp": "2022-08-18 11:41:57",
      "score": 1,
      "num_children": 0,
      "author": 280068,
      "replies": []
    },
    {
      "id": "iksbrx8",
      "text": "just imagine the little boy trying to crave his mother's love and affection and her looking at the husband and saying \"get this thing away from me.\" he will grow up either craving affection from the opposite sex or completely shunning them. poor boy. \n\nimagine, him realising his own mother wished that she could have terminated him if she knew she was giving birth to him.  \n\nimagine the father doing the same to the daughter. she'd be up in arms about child abuse. the husband needs to report this bitch. she might just end up killing the little boy if she dislikes him soo much.",
      "timestamp": "2022-08-18 12:21:47",
      "score": 1,
      "num_children": 0,
      "author": 286720,
      "replies": []
    },
    {
      "id": "iksw0wi",
      "text": "That last part is haunting. I’ve seen crazy 20-somethings on Twitter a while back saying if they had a boy they’d abort “the future predator” or some shit like that. These people are insane. \n\nIf you switched the genders and a man said he’d never cleaned his daughter or changed the diaper because it’s gross he’d be labeled a billion names and called a child abuser. This woman is mentally ill. If it’s so gross why did she procreate and marry a man?",
      "timestamp": "2022-08-18 14:49:02",
      "score": 1,
      "num_children": 0,
      "author": 61318,
      "replies": []
    },
    {
      "id": "iku0978",
      "text": "What a piece of shit",
      "timestamp": "2022-08-18 19:11:34",
      "score": 1,
      "num_children": 0,
      "author": 363670,
      "replies": []
    },
    {
      "id": "ikqxkrb",
      "text": "😵‍💫",
      "timestamp": "2022-08-18 03:01:32",
      "score": 1,
      "num_children": 0,
      "author": 67712,
      "replies": []
    },
    {
      "id": "ikr5vgb",
      "text": "I’m out.",
      "timestamp": "2022-08-18 04:13:09",
      "score": 1,
      "num_children": 0,
      "author": 317142,
      "replies": []
    },
    {
      "id": "ikravoc",
      "text": "this woman is flat-out dangerous,she needs professional aid STAT",
      "timestamp": "2022-08-18 05:03:55",
      "score": 1,
      "num_children": 0,
      "author": 215509,
      "replies": []
    },
    {
      "id": "ikriese",
      "text": "Who was the first class lover to knock this fk up up?",
      "timestamp": "2022-08-18 06:31:53",
      "score": 1,
      "num_children": 0,
      "author": 299205,
      "replies": []
    },
    {
      "id": "ikrl8mo",
      "text": "I hope CPS does something.",
      "timestamp": "2022-08-18 07:08:19",
      "score": 1,
      "num_children": 0,
      "author": 17932,
      "replies": []
    },
    {
      "id": "ikrnw9u",
      "text": "Poor kid",
      "timestamp": "2022-08-18 07:43:15",
      "score": 1,
      "num_children": 0,
      "author": 11890,
      "replies": []
    },
    {
      "id": "ikrpuqa",
      "text": "What a foul human being.",
      "timestamp": "2022-08-18 08:09:36",
      "score": 1,
      "num_children": 0,
      "author": 127684,
      "replies": []
    },
    {
      "id": "ikrrunx",
      "text": "SERIOUSLY CONSIDERED WHAT?",
      "timestamp": "2022-08-18 08:36:53",
      "score": 1,
      "num_children": 0,
      "author": 252521,
      "replies": []
    },
    {
      "id": "ikrt9yv",
      "text": "What the fuck?",
      "timestamp": "2022-08-18 08:56:27",
      "score": 1,
      "num_children": 0,
      "author": 42331,
      "replies": []
    },
    {
      "id": "ikrz0so",
      "text": "On a whole new level thats fucked up",
      "timestamp": "2022-08-18 10:12:19",
      "score": 1,
      "num_children": 0,
      "author": 393134,
      "replies": []
    },
    {
      "id": "iks7qwc",
      "text": "What the actual fuck",
      "timestamp": "2022-08-18 11:45:35",
      "score": 1,
      "num_children": 0,
      "author": 160376,
      "replies": []
    },
    {
      "id": "iksrenw",
      "text": "Got to be satire.",
      "timestamp": "2022-08-18 14:18:36",
      "score": 1,
      "num_children": 0,
      "author": 322125,
      "replies": []
    },
    {
      "id": "ikt2pka",
      "text": "this can’t be real",
      "timestamp": "2022-08-18 15:33:41",
      "score": 1,
      "num_children": 0,
      "author": 147844,
      "replies": []
    },
    {
      "id": "ikt353c",
      "text": "Should be the husbands cue to divorce",
      "timestamp": "2022-08-18 15:36:34",
      "score": 1,
      "num_children": 0,
      "author": 257651,
      "replies": []
    },
    {
      "id": "iktqkzx",
      "text": "This person should be nowhere near a child",
      "timestamp": "2022-08-18 18:09:30",
      "score": 1,
      "num_children": 0,
      "author": 83355,
      "replies": []
    },
    {
      "id": "iktrfzk",
      "text": "Did this person eat solely micro plastics their entire life?",
      "timestamp": "2022-08-18 18:15:07",
      "score": 1,
      "num_children": 0,
      "author": 197392,
      "replies": []
    },
    {
      "id": "iku0s7u",
      "text": "There's being disappointed, and then there's this piece of absolute shit.",
      "timestamp": "2022-08-18 19:14:57",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iku4ran",
      "text": "If those two get divorced I hope the boy goes with his dad. That poor lad is just going to be neglected by a detestable wretch, and grow up feeling inadequate, and worst of all unloved.",
      "timestamp": "2022-08-18 19:40:23",
      "score": 1,
      "num_children": 0,
      "author": 310129,
      "replies": []
    },
    {
      "id": "iku7kr2",
      "text": "That poor boy.  This awful relationship that he has with his mother is going to cause him a lot of psychological problems in the future.  I cannot imagine the level of rejection a tiny one must feel when their own mother pushes them away.  That's just heartbreaking.  The man in the relationship clearly didn't vet this woman enough prior to deciding to have children with her.",
      "timestamp": "2022-08-18 19:58:10",
      "score": 1,
      "num_children": 0,
      "author": 382720,
      "replies": []
    },
    {
      "id": "ikuag9x",
      "text": "This is fake. Feminists don’t have husbands.",
      "timestamp": "2022-08-18 20:16:27",
      "score": 1,
      "num_children": 0,
      "author": 316157,
      "replies": []
    },
    {
      "id": "ikub893",
      "text": "To everyone who is worried bout the kid: he will grow up and leave  and be fine, might hate his mother for a while but will eventually realize the energy is better used elsewhere. The Father will one day leave too, even if it takes 20 years, no one puts up with shit like that forever.  The mother will end up alone, a drunk and hating herself for the blatant truth that she is a disgusting shell of a person, who lost all chance of love and family because she is a nasty bitch... I know cus this could have been my mother posting this 30 years ago 🤣",
      "timestamp": "2022-08-18 20:21:23",
      "score": 1,
      "num_children": 0,
      "author": 234103,
      "replies": []
    },
    {
      "id": "ikuiq17",
      "text": "Holy crap",
      "timestamp": "2022-08-18 21:07:37",
      "score": 1,
      "num_children": 0,
      "author": 136176,
      "replies": []
    },
    {
      "id": "ikuso29",
      "text": "Ayo what?",
      "timestamp": "2022-08-18 22:11:17",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ikuwfv2",
      "text": "Wow what a loser of a person.",
      "timestamp": "2022-08-18 22:36:21",
      "score": 1,
      "num_children": 0,
      "author": 365261,
      "replies": []
    },
    {
      "id": "ikv4sm6",
      "text": "Probably the scummiest thing I’ve read in a while.",
      "timestamp": "2022-08-18 23:34:43",
      "score": 1,
      "num_children": 0,
      "author": 357869,
      "replies": []
    },
    {
      "id": "ikvwyyd",
      "text": "Ohhh gods I hate this world so much ;(",
      "timestamp": "2022-08-19 03:07:19",
      "score": 1,
      "num_children": 0,
      "author": 159448,
      "replies": []
    },
    {
      "id": "ikvxj7k",
      "text": "Find the source and call child services immediately.",
      "timestamp": "2022-08-19 03:12:05",
      "score": 1,
      "num_children": 0,
      "author": 28276,
      "replies": []
    },
    {
      "id": "ikwyo3i",
      "text": "This is so wtf in so many wtf-ing ways",
      "timestamp": "2022-08-19 10:17:39",
      "score": 1,
      "num_children": 0,
      "author": 339713,
      "replies": []
    },
    {
      "id": "ikxbm6c",
      "text": "It's women like this, the kind that refuses to even connect with their child over their own internalized hate of something that is natural in all men, that cause boys to become violent, resentful and walk the path of the criminal. \n\nIt isn't all men that do this, some overcome this abuse and rise above it. But her open disdain for her son is going to cause the boy to end up hating and resenting her for the rest of his life.",
      "timestamp": "2022-08-19 12:26:10",
      "score": 1,
      "num_children": 0,
      "author": 245260,
      "replies": []
    },
    {
      "id": "ikxjiey",
      "text": "Imagine being so deep in ideology you can't even look at your baby's genitals. What a sick bitch.",
      "timestamp": "2022-08-19 13:27:17",
      "score": 1,
      "num_children": 0,
      "author": 83057,
      "replies": []
    },
    {
      "id": "ikyisui",
      "text": "Oh boy would I hate to be her son and find this some day!",
      "timestamp": "2022-08-19 17:18:14",
      "score": 1,
      "num_children": 0,
      "author": 352347,
      "replies": []
    },
    {
      "id": "il0hw9q",
      "text": "Surely this is a troll, if she thinks men’s genitalia is so gross why did she marry and have sex with a man?",
      "timestamp": "2022-08-20 01:32:57",
      "score": 1,
      "num_children": 0,
      "author": 380671,
      "replies": []
    },
    {
      "id": "ipbmso2",
      "text": "People like this are one of a handful of reasons why men like Hamza, Sneako, Steph, Andrew Tate & Alex Jones are rising up to fame quick. I am anti lib-feminism/neofeminism.",
      "timestamp": "2022-09-21 12:33:24",
      "score": 1,
      "num_children": 0,
      "author": 215406,
      "replies": []
    },
    {
      "id": "iktgyer",
      "text": "She should have been aborted",
      "timestamp": "2022-08-18 17:06:50",
      "score": -1,
      "num_children": 0,
      "author": 150624,
      "replies": []
    },
    {
      "id": "ikr5g3m",
      "text": "I literally cannot wait to go extinct.",
      "timestamp": "2022-08-18 04:09:08",
      "score": 0,
      "num_children": 0,
      "author": 62540,
      "replies": []
    },
    {
      "id": "ikra8cs",
      "text": "What’s the source?",
      "timestamp": "2022-08-18 04:56:57",
      "score": 0,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ikrjgdc",
      "text": "I mean, that boy will grow up and be the next ed\nKemper",
      "timestamp": "2022-08-18 06:45:16",
      "score": 0,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ikrjnxn",
      "text": "This woman has to have some Kind of mental illness.",
      "timestamp": "2022-08-18 06:48:03",
      "score": 0,
      "num_children": 1,
      "author": 381321,
      "replies": [
        {
          "id": "ikrte5o",
          "text": "Yes, it's called feminism.",
          "timestamp": "2022-08-18 08:58:04",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iksmaff",
      "text": "Aww this is so sad for this little boy . \nGotta ask how she got pregnant ,and why does her husband stay married to her?\n\nHas to be the worst marriage on earth 🌎",
      "timestamp": "2022-08-18 13:43:24",
      "score": 0,
      "num_children": 0,
      "author": 91706,
      "replies": []
    }
  ]
}