{
  "id": "wtjasg",
  "text": "RIP\n",
  "timestamp": "2022-08-20 22:28:02",
  "score": 752,
  "subreddit": "t5_2zaj2",
  "num_children": 35,
  "replies": [
    {
      "id": "il5ce9o",
      "text": "May God rest her soul.",
      "timestamp": "2022-08-21 03:03:59",
      "score": 163,
      "num_children": 1,
      "author": 294730,
      "replies": [
        {
          "id": "il8x8ob",
          "text": "There was another post like this from someone who's trans recently. Think this sub. I'm one of those heavily affected guys. Sitting at the beach without a purpose.",
          "timestamp": "2022-08-21 22:13:52",
          "score": 8,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "il5s2bt",
      "text": "This reads like a satirical post from one of those 'sites' but it's not.. it's nytimes lol. Kudos to her for at least not being 'set in her ways' as a feminist and open to a somewhat decent exploration of the 'enemy'. Must have been a bitter pill to swallow when she finally realised all that she was taught (read: indoctrinated) about was BS. That kind of stuff DESTROYS lives, akin to finding out your girl/wife cheated on you and is taking half in the divorce. Worldview completely shattered.",
      "timestamp": "2022-08-21 05:31:10",
      "score": 144,
      "num_children": 1,
      "author": 263708,
      "replies": [
        {
          "id": "il5vq28",
          "text": "That's exactly what happened to her. \n\nShe would have to completely change her viewpoint and switch sides in order to maintain her sanity. Considering she was a lesbian, it's possible that her unconscious convictions about the sexes were too strong for that (this usually happens through a mother not being able to appreciate her husband, this setting the example for her daughter).",
          "timestamp": "2022-08-21 06:14:21",
          "score": 62,
          "num_children": 1,
          "author": 161322,
          "replies": [
            {
              "id": "il6jpqu",
              "text": "I have heard about bi people before, that experienced the problems of dating women and were like: Holy shit, that's aweful, why would you guys put up with that?",
              "timestamp": "2022-08-21 11:39:46",
              "score": 35,
              "num_children": 1,
              "author": 69862,
              "replies": [
                {
                  "id": "il81t0f",
                  "text": "There is some girl on youtube, I forget her name, super cute girl, looks mixed white and Asian, she came out as bi and did a video on dating women.  Short of it, she was stunned how hard it was and how demanding/the expectations of women even when dating other women, let alone men.",
                  "timestamp": "2022-08-21 18:33:54",
                  "score": 22,
                  "num_children": 3,
                  "replies": [
                    {
                      "id": "il87bof",
                      "text": "Precisley my point. I have to look for this video",
                      "timestamp": "2022-08-21 19:12:37",
                      "score": 4,
                      "num_children": 1,
                      "author": 69862,
                      "replies": [
                        {
                          "id": "ilhhuy6",
                          "text": "The [video](https://youtube.com/watch?v=Y4E8qEDi_xg) and a great [reaction to it](https://youtube.com/watch?v=VXl1Z9FAIq4).",
                          "timestamp": "2022-08-23 18:01:23",
                          "score": 1,
                          "num_children": 0,
                          "author": 98926,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "il8pwsc",
                      "text": "To be fair a woman can't easily bring what other women will search in a man. If they have high expectations they're never gonna find anyone.",
                      "timestamp": "2022-08-21 21:21:29",
                      "score": 1,
                      "num_children": 1,
                      "author": 34455,
                      "replies": [
                        {
                          "id": "il9j1ka",
                          "text": ">they're never gonna find anyone\n\nlol in theory this is correct. What actually happens is they 'settle' DOWN for what they perceive to be 'less than they deserve'. This then breeds resentment and toxicity and you're doomed (yourself, the relationships, everything). You entered into a bad deal under the wrong assumption (she genuinely loves you and you are her prince charming). Women don't take compromise or reality well... and I don't blame them. Imagine being told by disney, educational institutions, wider society, television, etc.. that you are perfect and deserve the dream man/life and then not getting that... you will hate the world (read: men) and especially the man that you 'settled with'. \n\nP.s. I will never forget this one day where I was still working in construction.. we were at a clients house and the couple were there.. the woman (wife) was RUNNING all over the limp wristed simp/beta husband. She was a lawyer, he was a share/stock dude but very rich regardless. They had a kid, lovely house, great career, etc. EVERY SINGLE TIME we saw them on site.. she wore the pants... she got her way over him.. she berated that dude in front of all of us and he just took it and chased after her trying to appease her. Sad... just sad... the lunch time talk was always about how sad and weird that dude seemed and how she's damn near a man and doesn't have anyyyyyyy respect for the dude. \n\nTLDR: Women will settle out of loneliness, but take that 'truth' to the grave or cheat on the side or just be generally toxic and hate your guts for it. It makes sense, they are social creatures (more so) and there is a big benefit in having someone provide something (money, family, lifestyle, etc) even if they aren't 'the one' or the complete perfect thing etc. BUT THEY WILL KNOW THIS AND HOLD SOME SORT OF FEELING ABOUT IT, most likely hatred or a lack of respect about you (who she settled with) because she didn't receive the dream that all girls are sold from very little.",
                          "timestamp": "2022-08-22 01:01:16",
                          "score": 6,
                          "num_children": 1,
                          "author": 263708,
                          "replies": [
                            {
                              "id": "ilbckq0",
                              "text": "From experience, I've seen a lot ( if not all ) young women have the \"One Life\" ( Their words not mine ) attitude. \n\nThis basically meant \"Everybody from school to Disney tell us we can do whatever we want and there will be no consequences and we should always do what we want as a result without a single regard to how that hurts close people\". \n\nThis caused every single of these women to end up real fucking lonely and because of their promiscuous \"past\" even when they settle they take some dessert on the side which never has good consequences. \n\nThe current youth is going to be miserable as time passes. But hey at least Captain Marvel made a bit of money for Disney !",
                              "timestamp": "2022-08-22 12:48:53",
                              "score": 3,
                              "num_children": 0,
                              "author": 34455,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ilhhu9z",
                      "text": "The [video](https://youtube.com/watch?v=Y4E8qEDi_xg) and a great [reaction to it](https://youtube.com/watch?v=VXl1Z9FAIq4).",
                      "timestamp": "2022-08-23 18:01:16",
                      "score": 1,
                      "num_children": 1,
                      "author": 98926,
                      "replies": [
                        {
                          "id": "ilhr130",
                          "text": "That's the one.  Thank you for finding that.",
                          "timestamp": "2022-08-23 19:00:21",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ili8seb",
                              "text": "You're very welcome.",
                              "timestamp": "2022-08-23 20:52:57",
                              "score": 1,
                              "num_children": 0,
                              "author": 98926,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "il6419q",
      "text": "Rest easy. \n\nTheir memory will live on as we keep reading and recommending the book. It's a good read and puts a few things into perspective.",
      "timestamp": "2022-08-21 08:03:39",
      "score": 64,
      "num_children": 0,
      "author": 71361,
      "replies": []
    },
    {
      "id": "il79gkr",
      "text": "But the patriarchy, yeah it's a sad thing when one of your biggest voices takes their own life because they found the cold hard truth for themselves.\n\nShe did a lot of good work in the end, I recall an interview about her story and what she found out and how she thought things were going and getting worse in particular for men and how sad she was for what has been done. \n\nI hope she's found her peace, nothing more I can say.",
      "timestamp": "2022-08-21 15:19:49",
      "score": 19,
      "num_children": 0,
      "author": 227190,
      "replies": []
    },
    {
      "id": "il5wbh7",
      "text": "Was another similar instance of this where a woman was putting together a documentary infiltrating basically \"MGTOW\" and found out that some of them have legitimate points and decided to make the documentary bringing awareness to those points.\n\n&#x200B;\n\nGod bless people who are able to think outside the box and draw their own conclusions and actually giving themselves a chance to understand and learn.",
      "timestamp": "2022-08-21 06:21:31",
      "score": 93,
      "num_children": 3,
      "author": 144607,
      "replies": [
        {
          "id": "il66jbn",
          "text": "The Red Pill movie?",
          "timestamp": "2022-08-21 08:39:00",
          "score": 35,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "il8enya",
          "text": "Not MGTOW, just men's rights. The Red Pill is a real eye opener. Very well done, balanced and objective. And totally exposes how absolutely disgusting, toxic and sexist the feminist movement can be.\n\nOr maybe you mean a different documentary.",
          "timestamp": "2022-08-21 20:03:38",
          "score": 15,
          "num_children": 1,
          "author": 246957,
          "replies": [
            {
              "id": "ilbzfax",
              "text": "Nope that’s the very one.",
              "timestamp": "2022-08-22 15:31:14",
              "score": 5,
              "num_children": 0,
              "author": 144607,
              "replies": []
            }
          ]
        },
        {
          "id": "il6mdel",
          "text": "I don't trust her",
          "timestamp": "2022-08-21 12:09:23",
          "score": 3,
          "num_children": 1,
          "author": 331535,
          "replies": [
            {
              "id": "il7rh5i",
              "text": "Cassie Jay? Did you watch the documentary? If so, what don't you trust? If not, watch it.",
              "timestamp": "2022-08-21 17:22:52",
              "score": 7,
              "num_children": 1,
              "author": 200872,
              "replies": [
                {
                  "id": "il7s814",
                  "text": "She still support feminism. I read it in an article interviewing her a year ago. She's a chameleon.",
                  "timestamp": "2022-08-21 17:28:00",
                  "score": 5,
                  "num_children": 4,
                  "author": 331535,
                  "replies": [
                    {
                      "id": "ilh6kvh",
                      "text": "If you saw the full interview, then you know she's essentially humanist. Like yeah, women can't handle certain shit, so society keeps them protected. Men are also exposed to certain things unnecessarily, protect them as well. Humans are complementary to each other.\n\nThis is what some people think is feminism, it's not. It's simple humanism, people are not equal, but that's not a reason to treat others like your slaves. I would say that's a thoroughly anti-feminist stance.",
                      "timestamp": "2022-08-23 16:50:12",
                      "score": 2,
                      "num_children": 0,
                      "author": 218700,
                      "replies": []
                    },
                    {
                      "id": "il8qkz5",
                      "text": "It's not as if your clearly demonstrating sexism? Committing the same \"sin\" many of us are angry at the majority of feminists for? You are little more then a minute cancer, that if the community has any principle, will cure or excise if you refuse to be anything other then a parasitic growth.",
                      "timestamp": "2022-08-21 21:26:17",
                      "score": 3,
                      "num_children": 0,
                      "author": 48705,
                      "replies": []
                    },
                    {
                      "id": "ile5b8l",
                      "text": "Can we just stop inventing stupid catchwords to use when describing other people... \"chameleon\" is the latest one, it seems. Someone, despite my post content,  accused me of being one. just because I disagreed with him. \n\nGeneralised slurs are how feminists fight, MRA ought to be better than that.",
                      "timestamp": "2022-08-23 00:21:06",
                      "score": 1,
                      "num_children": 0,
                      "author": 160171,
                      "replies": []
                    },
                    {
                      "id": "il8xou8",
                      "text": "Why would she do that",
                      "timestamp": "2022-08-21 22:17:08",
                      "score": 1,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "il5uha4",
      "text": "Wow. That’s quite the news.",
      "timestamp": "2022-08-21 05:59:05",
      "score": 15,
      "num_children": 0,
      "author": 249335,
      "replies": []
    },
    {
      "id": "il5temy",
      "text": "RIP",
      "timestamp": "2022-08-21 05:46:24",
      "score": 14,
      "num_children": 0,
      "author": 104276,
      "replies": []
    },
    {
      "id": "il7nam1",
      "text": "Damn that’s too bad, I really enjoyed her insight. I truly think a women can never truly understand what a man goes through and what it means to be a man. Just like a man can never truly understand what it’s like to be a woman. Some might get close and I think she was one of those ppl",
      "timestamp": "2022-08-21 16:54:32",
      "score": 12,
      "num_children": 0,
      "author": 1600,
      "replies": []
    },
    {
      "id": "il5w9yu",
      "text": "One of the few that has lived life experiencing both sides by believably passing as both a man and a woman and comes to the conclusion that women do indeed have it MUCH easier than men. But let’s not let that stop the lunatic left and radical feminists from crying and whining about how “tough” women have it, despite the opposite being true.",
      "timestamp": "2022-08-21 06:21:01",
      "score": 49,
      "num_children": 0,
      "author": 356668,
      "replies": []
    },
    {
      "id": "il5uf2t",
      "text": "I wish her soul to be in heaven\n\nRest in peace",
      "timestamp": "2022-08-21 05:58:22",
      "score": 36,
      "num_children": 0,
      "author": 398803,
      "replies": []
    },
    {
      "id": "il6jljd",
      "text": "And then they even devalue the strength that man have in dealing with such psychological scars. \n\nI am certain that if most women had the experiences we face, they would have been humbled beyond believe.",
      "timestamp": "2022-08-21 11:38:23",
      "score": 23,
      "num_children": 0,
      "author": 69862,
      "replies": []
    },
    {
      "id": "il6muxe",
      "text": "Someone share this post to a page influenced by feminism.\n\nThose feminist snakes should see what their pathetic ideology has done to men, women and society.\n\nAnd this post finally gotta teach the modern women to be polite and compassionate with men. And that men have feelings and get affected by this mistreatment. Because men, not only in relationships, prefer to simply interact with kind women in general, not destroyers of wellbeing.",
      "timestamp": "2022-08-21 12:14:39",
      "score": 20,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "il66wav",
      "text": "She was probably bullied by feminist groups after releasing that book.\n\nThis is why transmen are our the greatest ally. They experience both sides and feminists fear insulting them because of getting labelled as transphobic.",
      "timestamp": "2022-08-21 08:44:06",
      "score": 33,
      "num_children": 2,
      "author": 112586,
      "replies": [
        {
          "id": "il6i6jb",
          "text": "It's true. When the feminist mob go on the war path and you are the target, you better hope you sanity can withstand the sheer amount of idiocy about to drop.",
          "timestamp": "2022-08-21 11:21:26",
          "score": 14,
          "num_children": 0,
          "author": 245260,
          "replies": []
        },
        {
          "id": "il7sbvu",
          "text": "Our greatest allies are women (the ones that believe what we believe) and transmen",
          "timestamp": "2022-08-21 17:28:43",
          "score": 9,
          "num_children": 0,
          "author": 69521,
          "replies": []
        }
      ]
    },
    {
      "id": "il80049",
      "text": "Damn dude...\n\nHow bad was experiencing the opposite Gender to the point of Suicide?\n\nHell, this is almost like a Lovecraftian story;\nLive inside the body not your own and realize Truths you weren't ready for, only to break your concept of self and the world around you.",
      "timestamp": "2022-08-21 18:21:21",
      "score": 4,
      "num_children": 0,
      "author": 98291,
      "replies": []
    },
    {
      "id": "ilfim7n",
      "text": "I saw her documentary and how she said she needed mental treatment due to the experience. Her book was not well recieved by the \"media\" even though she was a member of LGBT community. Sad to hear a true Ally is lost, someone who shed sweat, tears and blood with men to understand us. That's what makes her a true gender equalist and empath.",
      "timestamp": "2022-08-23 08:16:27",
      "score": 4,
      "num_children": 0,
      "author": 223081,
      "replies": []
    },
    {
      "id": "il61qfb",
      "text": "Rest in peace. Why suicide though? just swap back...and relax. but never forget the experience.",
      "timestamp": "2022-08-21 07:32:05",
      "score": 15,
      "num_children": 1,
      "author": 380875,
      "replies": [
        {
          "id": "il6lxie",
          "text": "She did, she died alot later.",
          "timestamp": "2022-08-21 12:04:39",
          "score": 16,
          "num_children": 1,
          "author": 87357,
          "replies": [
            {
              "id": "il6t8vt",
              "text": "Oh. OH.",
              "timestamp": "2022-08-21 13:16:10",
              "score": 8,
              "num_children": 0,
              "author": 380875,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "il7zypz",
      "text": "It was a rude awakening for saying the least",
      "timestamp": "2022-08-21 18:21:05",
      "score": 3,
      "num_children": 0,
      "author": 157435,
      "replies": []
    },
    {
      "id": "il8oex2",
      "text": "Easy mode indeed. \n\nSorry it went that way for her but sometimes the truth is a lot to handle.",
      "timestamp": "2022-08-21 21:10:55",
      "score": 3,
      "num_children": 0,
      "author": 1716,
      "replies": []
    },
    {
      "id": "ilfw6vx",
      "text": "I'm pretty sure all the feminists mist be celebrating this news as one more enemy down.",
      "timestamp": "2022-08-23 11:12:08",
      "score": 3,
      "num_children": 0,
      "author": 34965,
      "replies": []
    },
    {
      "id": "ilfx7c3",
      "text": "Yep and she was attacked relentlessly by feminists.",
      "timestamp": "2022-08-23 11:22:47",
      "score": 3,
      "num_children": 0,
      "author": 89423,
      "replies": []
    },
    {
      "id": "ilh5qkx",
      "text": "Rip",
      "timestamp": "2022-08-23 16:44:56",
      "score": 3,
      "num_children": 0,
      "author": 329581,
      "replies": []
    },
    {
      "id": "il5ddb8",
      "text": "Aum Shanti",
      "timestamp": "2022-08-21 03:12:25",
      "score": 9,
      "num_children": 0,
      "author": 312487,
      "replies": []
    },
    {
      "id": "il80ilw",
      "text": "Rest easy choom.\n\nAin't no judgements where you are now.",
      "timestamp": "2022-08-21 18:24:54",
      "score": 2,
      "num_children": 0,
      "author": 361163,
      "replies": []
    },
    {
      "id": "il816y0",
      "text": "That’s really, really sad. I’d never heard of her. RIP.",
      "timestamp": "2022-08-21 18:29:38",
      "score": 2,
      "num_children": 0,
      "author": 405776,
      "replies": []
    },
    {
      "id": "il84p8g",
      "text": "Rip.",
      "timestamp": "2022-08-21 18:54:06",
      "score": 2,
      "num_children": 0,
      "author": 93612,
      "replies": []
    },
    {
      "id": "il8bnt2",
      "text": "Holy crap I need to read this book.",
      "timestamp": "2022-08-21 19:42:35",
      "score": 2,
      "num_children": 0,
      "author": 240453,
      "replies": []
    },
    {
      "id": "im1j273",
      "text": "R.I.P.",
      "timestamp": "2022-08-27 19:54:14",
      "score": 2,
      "num_children": 0,
      "author": 27762,
      "replies": []
    },
    {
      "id": "il7rupf",
      "text": "Too bad she died but damn finally something like this happens",
      "timestamp": "2022-08-21 17:25:25",
      "score": 2,
      "num_children": 1,
      "author": 69521,
      "replies": [
        {
          "id": "ileedfe",
          "text": "Something like her dying?",
          "timestamp": "2022-08-23 01:28:45",
          "score": -1,
          "num_children": 1,
          "author": 312440,
          "replies": [
            {
              "id": "ilemp4x",
              "text": "No, a feminist realizing our struggles after a transition",
              "timestamp": "2022-08-23 02:31:38",
              "score": 4,
              "num_children": 1,
              "author": 69521,
              "replies": [
                {
                  "id": "ilfet53",
                  "text": "Ah, gotcha. She did her experiment 20 years ago, so not exactly recently.",
                  "timestamp": "2022-08-23 07:23:22",
                  "score": 2,
                  "num_children": 1,
                  "author": 312440,
                  "replies": [
                    {
                      "id": "ili0dam",
                      "text": "Oh damn ok",
                      "timestamp": "2022-08-23 19:59:28",
                      "score": 1,
                      "num_children": 1,
                      "author": 69521,
                      "replies": [
                        {
                          "id": "ilir3rq",
                          "text": "It's frustrating that what she went through didn't actually bring any awareness to the unique tribulations men go through, and things have only gotten worse in the last 2 decades.",
                          "timestamp": "2022-08-23 22:55:25",
                          "score": 2,
                          "num_children": 1,
                          "author": 312440,
                          "replies": [
                            {
                              "id": "ilis1b0",
                              "text": "Yeah, that is pretty bad",
                              "timestamp": "2022-08-23 23:02:02",
                              "score": 1,
                              "num_children": 0,
                              "author": 69521,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "il8a1pd",
      "text": "She didn't find it \"harder.\" She found it \"just as bad.\"\n\nI am making this point because no feminist would ever agree that men have it harder than women. Not even Cassie Jaye. They would always find a way to rationalize never saying something to that effect.\n\nOne more thing: She said men need men, while the rest of the feminists rely on both men and women to better their position. She essentially was giving out wrong advice, too.",
      "timestamp": "2022-08-21 19:31:29",
      "score": 2,
      "num_children": 0,
      "author": 347422,
      "replies": []
    },
    {
      "id": "il765jz",
      "text": "That wasn’t the conclusion she got though. The conclusion wasn’t that it was easier, it was that it was equally hard. Truth is men and women when you average everything together are pretty equal",
      "timestamp": "2022-08-21 14:56:09",
      "score": 0,
      "num_children": 1,
      "author": 105099,
      "replies": [
        {
          "id": "im0em6n",
          "text": "It suppose they each have their own struggles.",
          "timestamp": "2022-08-27 15:14:31",
          "score": 1,
          "num_children": 0,
          "author": 247104,
          "replies": []
        }
      ]
    },
    {
      "id": "il7f3bu",
      "text": "This is both so sad and so funny at the same time.",
      "timestamp": "2022-08-21 15:59:06",
      "score": 0,
      "num_children": 1,
      "author": 243563,
      "replies": [
        {
          "id": "im0eo7h",
          "text": "She does look like a little bit tbh.",
          "timestamp": "2022-08-27 15:14:54",
          "score": 1,
          "num_children": 0,
          "author": 247104,
          "replies": []
        }
      ]
    },
    {
      "id": "il8w648",
      "text": "This is sad... If more woman became enlightened to their own female nature, instead of just blaming men, we might all be able to get to a place of compromise between the sexes... sadly the truth of the nature of humans is harsh... and not easy to handle.   \n\n\nI'm sorry that she gave in to despair.",
      "timestamp": "2022-08-21 22:06:00",
      "score": 1,
      "num_children": 0,
      "author": 200899,
      "replies": []
    },
    {
      "id": "il6uxyq",
      "text": "Btw can someone help me? I wanna read the article but it seems my chrome extensions dont work. Google hasnt been much help either.",
      "timestamp": "2022-08-21 13:30:53",
      "score": 1,
      "num_children": 2,
      "author": 380875,
      "replies": [
        {
          "id": "il80fcd",
          "text": "https://archive.ph/SPHsp",
          "timestamp": "2022-08-21 18:24:16",
          "score": 2,
          "num_children": 1,
          "author": 65062,
          "replies": [
            {
              "id": "il827v6",
              "text": "Thank you so much",
              "timestamp": "2022-08-21 18:36:45",
              "score": 3,
              "num_children": 0,
              "author": 380875,
              "replies": []
            }
          ]
        },
        {
          "id": "il81511",
          "text": "Are you on the App? I've been having the same issue. I think you have to either Reset your Main Browser or switch the settings for opening links in the Reddit App.",
          "timestamp": "2022-08-21 18:29:16",
          "score": 2,
          "num_children": 0,
          "author": 98291,
          "replies": []
        }
      ]
    },
    {
      "id": "il8iaw8",
      "text": "Don't hate women, just stay far away when you can, brothers. Its great for your mental health.",
      "timestamp": "2022-08-21 20:28:38",
      "score": 1,
      "num_children": 0,
      "author": 305081,
      "replies": []
    },
    {
      "id": "il6s8t0",
      "text": "PAHAHAHHA  ABSOLUTE BULLSHIT",
      "timestamp": "2022-08-21 13:07:05",
      "score": -41,
      "num_children": 3,
      "replies": [
        {
          "id": "il6v6j0",
          "text": "Look at your comment history. It’s the ravings of an angry, bitter, delusional, broken human. Hope you can pull yourself out of whatever this is you’re going through. Genuinely.",
          "timestamp": "2022-08-21 13:32:53",
          "score": 28,
          "num_children": 1,
          "author": 351530,
          "replies": [
            {
              "id": "il6ve7v",
              "text": "Cry about it. Men aren't oppressed. Y'all have it so unbelievably fucking easy. Fucking delusional cunts fr. ❤️",
              "timestamp": "2022-08-21 13:34:33",
              "score": -38,
              "num_children": 11,
              "replies": [
                {
                  "id": "il6y354",
                  "text": "At least provide a supporting statement 💀",
                  "timestamp": "2022-08-21 13:56:00",
                  "score": 27,
                  "num_children": 0,
                  "author": 178064,
                  "replies": []
                },
                {
                  "id": "il72dwd",
                  "text": "Nobody said men are oppressed. Part of the problem with your woke ideology is that people are viewing everyone in this ridiculous binary of oppressed/not oppressed.\n\nHaving problems as a group which makes life difficult or painful is not the same as being oppressed.",
                  "timestamp": "2022-08-21 14:29:12",
                  "score": 21,
                  "num_children": 1,
                  "author": 304941,
                  "replies": [
                    {
                      "id": "il73h30",
                      "text": "\"woke\" so you're a fucking loser then 👍",
                      "timestamp": "2022-08-21 14:37:05",
                      "score": -16,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "il7ia44",
                          "text": "People aren't gonna take any arguments you say seriously or even consider them if your constantly insulting them",
                          "timestamp": "2022-08-21 16:20:42",
                          "score": 11,
                          "num_children": 1,
                          "author": 7610,
                          "replies": [
                            {
                              "id": "il7izca",
                              "text": "Oh no(?)",
                              "timestamp": "2022-08-21 16:25:25",
                              "score": -6,
                              "num_children": 3,
                              "replies": [
                                {
                                  "id": "il8hwtj",
                                  "text": "No, go ahead and take screenshots for your femcel sub, hope the 6 karma are worth it 💀",
                                  "timestamp": "2022-08-21 20:25:57",
                                  "score": 10,
                                  "num_children": 1,
                                  "author": 29247,
                                  "replies": [
                                    {
                                      "id": "il92mw3",
                                      "text": "\"femcel\" isn't even an insult. Just means \"female celibate\"... By choice? Nice try, buddy",
                                      "timestamp": "2022-08-21 22:53:13",
                                      "score": -4,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "il8ofcd",
                                  "text": "Oh no what?",
                                  "timestamp": "2022-08-21 21:11:00",
                                  "score": 5,
                                  "num_children": 0,
                                  "author": 7610,
                                  "replies": []
                                },
                                {
                                  "id": "il8ss2r",
                                  "text": "Please keep all disputes civil, thank you.",
                                  "timestamp": "2022-08-21 21:41:47",
                                  "score": 4,
                                  "num_children": 0,
                                  "author": 178064,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "il7czdt",
                  "text": "Good luck in high school next year.",
                  "timestamp": "2022-08-21 15:44:36",
                  "score": 17,
                  "num_children": 1,
                  "author": 344189,
                  "replies": [
                    {
                      "id": "il7d42c",
                      "text": "Yes because I'm definitely a child that doesn't know what she's talking about 👍",
                      "timestamp": "2022-08-21 15:45:32",
                      "score": -5,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "il7drwu",
                          "text": "In that case, get well soon.",
                          "timestamp": "2022-08-21 15:50:04",
                          "score": 10,
                          "num_children": 0,
                          "author": 344189,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "il7s3yt",
                  "text": "Lol the amount of grants, tax breaks, scholarships, leniency, and help women get is insane. Y’all are far from oppressed yet we are the delusional ones😂🤦🏾‍♂️. No group in history has had close to the amount of handouts women in the west get yet y’all are the ones that want to play oppression olympics the most. Honestly the biggest evidence for this is that feminist groups have been fabricating problems, exaggerating problems, and doing everything in their power to downplay men’s. If y’all was so oppressed that wouldn’t need to be done. Shoot same with the fact of y’all using things that happened far before you was born😅😂.",
                  "timestamp": "2022-08-21 17:27:13",
                  "score": 10,
                  "num_children": 1,
                  "author": 308209,
                  "replies": [
                    {
                      "id": "il7si40",
                      "text": "White men, Christian men and cis-het men get all of those handouts bae.\nBut y'know, the paygap and our rights being taken away right now is making us not-oppressed!",
                      "timestamp": "2022-08-21 17:29:52",
                      "score": -2,
                      "num_children": 2,
                      "replies": [
                        {
                          "id": "il7vt4x",
                          "text": "The pay gap has been debunked for decades now. Men work longer, harder, and more often than women and that’s why on average we tend to earn more. We work full time more, work longer days, work more overtime, are willing to travel more, work more dangerous jobs, take less sick days, take less vacation time, negotiate more, work dirtier jobs, etc. Even if what you said was true(which it isn’t) it would be taken more seriously if you didn’t ignore the work death gap, the work hours gap, and the retirement gap. We die years earlier than y’all while also worker years longer and the whole time working harder. When you said rights taken away are you talking about abortions? So body autonomy? The same thing men have never had in this country? You know how we are born and get circumcised against are will? You do realize that every man that has had that done to him has been introduced to extreme pain at an extremely young age against their will right? If I remember correctly it wasn’t even until 1999 that they started recommending pain relief during the procedure....recommending not requiring. And let’s not get started on selective service which men still face consequences for if they don’t sign up. Plenty of men get fucked over every year because they don’t promise their government the use of their body. If men aren’t oppressed then women definitely aren’t in the west.",
                          "timestamp": "2022-08-21 17:52:23",
                          "score": 11,
                          "num_children": 1,
                          "author": 308209,
                          "replies": [
                            {
                              "id": "il7w2zf",
                              "text": "Oh my lord you are literally insane. ☠️",
                              "timestamp": "2022-08-21 17:54:17",
                              "score": 0,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "il8i8la",
                                  "text": "When shown proper arguments and evidence dumb people often try to use insults in order to descalate the conversation, this comment is living proof of that.\n\nGo outside and learn how people work, not even trying to be mean just go",
                                  "timestamp": "2022-08-21 20:28:11",
                                  "score": 8,
                                  "num_children": 0,
                                  "author": 29247,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "il7w928",
                          "text": "Oh and both men and women can receive gender specific grants and scholarships. But men only have a fraction of the amount that women do and a lot are for specific races or you have to join a fraternity which would eliminate most men automatically. The highest I could find for men granted 15K. Men actually get the same amount as trans people....and they are less than one percent of the population(2% if you take a few studies). So a little under half of the population gets the same amount as less than 1% of the population. Women have far more and I found one where women can get 150K. Theres also a bunch more that are more than the highest for men(40K 80K). This is despite women making up 59.5% of college students in 2021. The government also affords tax incentives to those who conduct business with women ran businesses. Tax liabilities are reduced for projects funded with fed or state grants/loans when the supplier is a woman owned business. There was a senate bill in April of last year introduced to give a tax credit equal to 25% of W2 wages reported to be claimed annually. That’s up to $10,000 in a tax year with a limit of $40,000 lifetime, specifically for women owned businesses.",
                          "timestamp": "2022-08-21 17:55:26",
                          "score": 9,
                          "num_children": 1,
                          "author": 308209,
                          "replies": [
                            {
                              "id": "il7weii",
                              "text": "Yada Yada Yada all bullshit, not truth. Keep trying.",
                              "timestamp": "2022-08-21 17:56:29",
                              "score": 1,
                              "num_children": 2,
                              "replies": [
                                {
                                  "id": "il7wjt6",
                                  "text": "Oh damn this defeated everything I said😮",
                                  "timestamp": "2022-08-21 17:57:31",
                                  "score": 7,
                                  "num_children": 1,
                                  "author": 308209,
                                  "replies": [
                                    {
                                      "id": "il7wlv9",
                                      "text": "Duh 😍",
                                      "timestamp": "2022-08-21 17:57:55",
                                      "score": 1,
                                      "num_children": 0,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "il8f8a0",
                                  "text": "Ok but, do you have any data that proves that what he said is bullshit?",
                                  "timestamp": "2022-08-21 20:07:31",
                                  "score": 8,
                                  "num_children": 1,
                                  "author": 48188,
                                  "replies": [
                                    {
                                      "id": "il8ifdr",
                                      "text": "*Radio silence*\n\nShe is in denial, let her be in denial along with her circle jerk, truth is that she probably screwed up her life and blames everything and everyone as a coping mechanism, L humanp",
                                      "timestamp": "2022-08-21 20:29:28",
                                      "score": 8,
                                      "num_children": 0,
                                      "author": 29247,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "il8008m",
                  "text": "You got any points or you just mad?",
                  "timestamp": "2022-08-21 18:21:22",
                  "score": 8,
                  "num_children": 1,
                  "author": 324853,
                  "replies": [
                    {
                      "id": "il8ihwn",
                      "text": "She is in denial, just let her brain cooldown you will see it perform awesome mental gymnastics",
                      "timestamp": "2022-08-21 20:29:57",
                      "score": 7,
                      "num_children": 1,
                      "author": 29247,
                      "replies": [
                        {
                          "id": "il90aok",
                          "text": "How much you bet she’s in a first world country and the most hardship she had was a dude looked at her funny",
                          "timestamp": "2022-08-21 22:36:06",
                          "score": 3,
                          "num_children": 0,
                          "author": 324853,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "il73ccm",
                  "text": "Women aren't oppressed either. The fact that you're allowed to use a computer proves that.",
                  "timestamp": "2022-08-21 14:36:09",
                  "score": 14,
                  "num_children": 1,
                  "author": 220085,
                  "replies": [
                    {
                      "id": "il73ew8",
                      "text": "That's not how oppression works in the slightest, bae",
                      "timestamp": "2022-08-21 14:36:39",
                      "score": -9,
                      "num_children": 0,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "il9173u",
                  "text": "\"Men have it so easy\". Yet men are committing suicide in greater numbers, are 3/4 of the homeless population, get higher prison sentencing for the same crime and similar criminal histories compared to women. Men are the main victims of street crime, get more online harassment compared to women. Lose custody of their kids in greater numbers compared to women, even if the woman is not fit to parent. Men are falling behind in education, women out-earn men up until the age of 30. Men, who are sexually assaulted, raped, or abused by a woman, are often laughed at, or told to \"man up\" by both men and women. Female on male rape isn't even recognised in many first world countries. A number of people don't even think men have any problems.",
                  "timestamp": "2022-08-21 22:42:40",
                  "score": 6,
                  "num_children": 0,
                  "author": 36798,
                  "replies": []
                },
                {
                  "id": "ilczv23",
                  "text": "Oh jeez I can already see and smell you through the screen",
                  "timestamp": "2022-08-22 19:25:58",
                  "score": 6,
                  "num_children": 1,
                  "author": 150442,
                  "replies": [
                    {
                      "id": "ild1khh",
                      "text": "Describe it then lol",
                      "timestamp": "2022-08-22 19:37:13",
                      "score": -2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ild9iq2",
                          "text": "Definitely no shower in 2 months, and you're probably overweight with dyed hair",
                          "timestamp": "2022-08-22 20:29:54",
                          "score": 5,
                          "num_children": 1,
                          "author": 150442,
                          "replies": [
                            {
                              "id": "ildbqxr",
                              "text": "1) showered this morning \n2) underweight\n3) natural hair\nLOL nice try :)",
                              "timestamp": "2022-08-22 20:45:00",
                              "score": -1,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "ilde17v",
                                  "text": "I also wouldn't be surprised if you were also disgustingly skinny but a shower? Feminists don't know what showers are",
                                  "timestamp": "2022-08-22 21:00:16",
                                  "score": 3,
                                  "num_children": 1,
                                  "author": 150442,
                                  "replies": [
                                    {
                                      "id": "ildg5qh",
                                      "text": "Sweetheart, feminism doesn't equal poor hygiene, bit of a dumb and overused stereotype, not offensive anymore and totally boring. Also no, I'm not \"disgustingly\" skinny, another weird and wrong assumption.",
                                      "timestamp": "2022-08-22 21:14:33",
                                      "score": 0,
                                      "num_children": 1,
                                      "replies": [
                                        {
                                          "id": "ildi10h",
                                          "text": "1st) feminists don't know what the word hygiene means and 2nd) using words like sweetheart and bae don't make you smarter lmao",
                                          "timestamp": "2022-08-22 21:27:24",
                                          "score": 3,
                                          "num_children": 1,
                                          "author": 150442,
                                          "replies": [
                                            {
                                              "id": "ildidp2",
                                              "text": "1) maintaining health via practice of cleanliness (that's your theory debunked)\n2) please point me to where I said that using basic vocabulary makes you smarter?",
                                              "timestamp": "2022-08-22 21:29:51",
                                              "score": 1,
                                              "num_children": 1,
                                              "replies": [
                                                {
                                                  "id": "ildv2yj",
                                                  "text": "nice use of google\n\nalso a lot of feminists like to use the words sweetheart, bae, sweetie or whatever just to seem smarter or sassier when in reality they look retarded",
                                                  "timestamp": "2022-08-22 23:01:50",
                                                  "score": 3,
                                                  "num_children": 1,
                                                  "author": 150442,
                                                  "replies": [
                                                    {
                                                      "id": "ildwcpt",
                                                      "text": "Knowing what hygiene is means I used Google? Okay so so you're actually clinically delusional. I would say have a nice day, but you use slurs for no reason so, I hope you have a horrible day.",
                                                      "timestamp": "2022-08-22 23:11:15",
                                                      "score": 0,
                                                      "num_children": 1,
                                                      "replies": [
                                                        {
                                                          "id": "ildwm1j",
                                                          "text": "lol ok, also saying retard isn't that bad",
                                                          "timestamp": "2022-08-22 23:13:12",
                                                          "score": 4,
                                                          "num_children": 1,
                                                          "author": 150442,
                                                          "replies": [
                                                            {
                                                              "id": "ildwodb",
                                                              "text": "Oh my lord...",
                                                              "timestamp": "2022-08-22 23:13:41",
                                                              "score": 1,
                                                              "num_children": 0,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ildoeje",
                  "text": "You must be fucking retarded 💀",
                  "timestamp": "2022-08-22 22:12:55",
                  "score": 3,
                  "num_children": 0,
                  "author": 142268,
                  "replies": []
                },
                {
                  "id": "il6vico",
                  "text": "lol",
                  "timestamp": "2022-08-21 13:35:26",
                  "score": 4,
                  "num_children": 0,
                  "author": 351530,
                  "replies": []
                },
                {
                  "id": "ilhckxs",
                  "text": "This one needs hugs. Such a heavy and bitter heart.",
                  "timestamp": "2022-08-23 17:27:57",
                  "score": 2,
                  "num_children": 0,
                  "author": 218700,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "il81c1y",
          "text": "I'm not sure how this could be \"bullshit\". You just don't agree with the conclusion. Men are not systemically oppressed (I don't believe women are either), but misandry is real.",
          "timestamp": "2022-08-21 18:30:37",
          "score": 4,
          "num_children": 0,
          "author": 243563,
          "replies": []
        },
        {
          "id": "ilg749d",
          "text": "I love the way that here we are; sympathising over the death of someone who we 'ought' to consider an 'enemy'.\n\nHere you are, spitting venom and mocking her death.\n\nWho is the misogynist here? The people who can distinguish the person from the ideology? Or the person who will throw one of their own under the bus to take a cheap shot?",
          "timestamp": "2022-08-23 12:51:42",
          "score": 3,
          "num_children": 1,
          "author": 31926,
          "replies": [
            {
              "id": "ilg77s5",
              "text": "Because it's all bullshit 🥰👍",
              "timestamp": "2022-08-23 12:52:29",
              "score": 0,
              "num_children": 0,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}