{
  "id": "wvmquy",
  "text": "woke up to see this garbage first thing\n",
  "timestamp": "2022-08-23 11:50:25",
  "score": 1008,
  "subreddit": "t5_2zaj2",
  "num_children": 84,
  "author": 362760,
  "replies": [
    {
      "id": "ilgajm4",
      "text": "Her 'valid belief' is that all men should die, but her heart is filled with love, lol.",
      "timestamp": "2022-08-23 13:18:01",
      "score": 307,
      "num_children": 9,
      "author": 220394,
      "replies": [
        {
          "id": "ilgbww3",
          "text": "yeah, i was going to mention this as well.  Her heart is SO full of love she wants to commit genocide!",
          "timestamp": "2022-08-23 13:28:05",
          "score": 93,
          "num_children": 5,
          "author": 250154,
          "replies": [
            {
              "id": "ilgdavw",
              "text": "Sadly that's exactly how it works. The pursuit of the glorious utopia means anything in the way of it is *evil.*\n\n*“Of all tyrannies, a tyranny sincerely exercised for the good of its victims may be the most oppressive. It would be better to live under robber barons than under omnipotent moral busybodies. The robber baron's cruelty may sometimes sleep, his cupidity may at some point be satiated; but those who torment us for our own good will torment us without end for they do so with the approval of their own conscience. They may be more likely to go to Heaven yet at the same time likelier to make a Hell of earth. This very kindness stings with intolerable insult. To be \"cured\" against one's will and cured of states which we may not regard as disease is to be put on a level of those who have not yet reached the age of reason or those who never will; to be classed with infants, imbeciles, and domestic animals.”*\n\nC.S. Lewis.",
              "timestamp": "2022-08-23 13:38:12",
              "score": 52,
              "num_children": 2,
              "author": 398446,
              "replies": [
                {
                  "id": "ilihr69",
                  "text": "As the old saying goes: the road to hell is paved with good intentions.\n\nLet me tell you a little story, completely true. There was a monk who had a friend. That friend was into social activism. I don't remember the cause, but it was some social reform in some country that I don't remember, either. They lost contact. One day, a monk found a book. The book told of horrendous atrocities in that country. There was a photo in the book. To the monk's complete amazement he saw his friend in the photo of the people who committed the atrocities.\n\nThis is why I'm an anti-progressive. I know that, deep down, their hearts are filled with a sense of injustice. This leads to callousness and anger.",
                  "timestamp": "2022-08-23 21:51:26",
                  "score": 8,
                  "num_children": 0,
                  "author": 23671,
                  "replies": []
                },
                {
                  "id": "ilgdwp6",
                  "text": "> to be classed with infants, imbeciles, and domestic animals\n\nFor some reason, this brought \"feminists\" to mind",
                  "timestamp": "2022-08-23 13:42:31",
                  "score": 16,
                  "num_children": 0,
                  "author": 161322,
                  "replies": []
                }
              ]
            },
            {
              "id": "ilgkd5p",
              "text": "infanticide\\*",
              "timestamp": "2022-08-23 14:26:52",
              "score": 6,
              "num_children": 1,
              "author": 33259,
              "replies": [
                {
                  "id": "ilh4ytu",
                  "text": "Gendercide is the term used, I believe.",
                  "timestamp": "2022-08-23 16:40:08",
                  "score": 13,
                  "num_children": 0,
                  "author": 34455,
                  "replies": []
                }
              ]
            },
            {
              "id": "ilh1ar4",
              "text": "You mean supports genocide of men",
              "timestamp": "2022-08-23 16:17:04",
              "score": 4,
              "num_children": 0,
              "author": 65777,
              "replies": []
            },
            {
              "id": "ilgj2go",
              "text": "Undertale reference?",
              "timestamp": "2022-08-23 14:18:09",
              "score": 1,
              "num_children": 0,
              "author": 119022,
              "replies": []
            },
            {
              "id": "ili9anr",
              "text": "Idk if you watch Re:Zero or anime in general, but it's probably Betelgeuse's version of \"love\"",
              "timestamp": "2022-08-23 20:56:12",
              "score": 1,
              "num_children": 0,
              "author": 102794,
              "replies": []
            }
          ]
        },
        {
          "id": "ilges4x",
          "text": "She loves to wish death upon all men i guess lol",
          "timestamp": "2022-08-23 13:48:41",
          "score": 22,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "iljll2u",
          "text": "Wait how did she make a baby without a man??",
          "timestamp": "2022-08-24 02:37:39",
          "score": 3,
          "num_children": 0,
          "author": 19811,
          "replies": []
        },
        {
          "id": "ilhve27",
          "text": "She means her heart is filled with love for those that she believes deserve it.\n\nThat's what most of these people mean. The type of people who are obviously horrible and hateful but they say that they are filled with love.",
          "timestamp": "2022-08-23 19:28:07",
          "score": 6,
          "num_children": 0,
          "author": 51829,
          "replies": []
        },
        {
          "id": "ilgux3t",
          "text": "Exactly. And if you substitute for women in her little hashtag, even just to make a point, the account would’ve been permanently banned. But all good if you say “kill all men”. Lunatic Leftist hypocrites and hate-mongers.",
          "timestamp": "2022-08-23 15:36:08",
          "score": 6,
          "num_children": 0,
          "author": 356668,
          "replies": []
        },
        {
          "id": "ilk8mei",
          "text": "As sad as it is if she did have a boy he would probably be better off being aborted than growing up with this cunt as his mother.",
          "timestamp": "2022-08-24 06:20:23",
          "score": 2,
          "num_children": 0,
          "author": 394033,
          "replies": []
        },
        {
          "id": "ili512d",
          "text": "Her feminism is so severe, it's like she romanticises being female which is ironic given how feminists claim that the female life is made shitty by everyone around them...",
          "timestamp": "2022-08-23 20:29:02",
          "score": 5,
          "num_children": 1,
          "author": 354634,
          "replies": [
            {
              "id": "iljwvln",
              "text": "Feminism is all about being the victim. They love being victims!",
              "timestamp": "2022-08-24 04:12:43",
              "score": 4,
              "num_children": 0,
              "author": 99609,
              "replies": []
            }
          ]
        },
        {
          "id": "ilhea30",
          "text": "[Indeed.](https://twitter.com/shampoob0ttles/status/1261553629049257990?cxt=HHwWjICwye6V-IEjAAAA)",
          "timestamp": "2022-08-23 17:38:39",
          "score": 1,
          "num_children": 0,
          "author": 304158,
          "replies": []
        },
        {
          "id": "ilidy78",
          "text": "Women Am I right?",
          "timestamp": "2022-08-23 21:26:24",
          "score": 0,
          "num_children": 1,
          "author": 146455,
          "replies": [
            {
              "id": "ilie20b",
              "text": "feminists rather",
              "timestamp": "2022-08-23 21:27:05",
              "score": 1,
              "num_children": 1,
              "author": 220394,
              "replies": [
                {
                  "id": "iliemyr",
                  "text": "Cheers, brother! ☕️",
                  "timestamp": "2022-08-23 21:30:54",
                  "score": -1,
                  "num_children": 0,
                  "author": 146455,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ilgdbn3",
      "text": "Left a few choice words on her page. Fuck that bitch.",
      "timestamp": "2022-08-23 13:38:22",
      "score": 62,
      "num_children": 3,
      "author": 151519,
      "replies": [
        {
          "id": "ilgdofr",
          "text": "If you don't mind me asking, what were they?",
          "timestamp": "2022-08-23 13:40:55",
          "score": 11,
          "num_children": 1,
          "replies": [
            {
              "id": "ilgdu3u",
              "text": "Tried to post my screen shot but reddit won't let me, I called her a sick human being and said that I pray she becomes sterile because she doesn't deserve to be a mother.",
              "timestamp": "2022-08-23 13:42:01",
              "score": 46,
              "num_children": 5,
              "author": 151519,
              "replies": [
                {
                  "id": "ilgdxkl",
                  "text": "Truth 100%",
                  "timestamp": "2022-08-23 13:42:41",
                  "score": 16,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "ilgo9el",
                  "text": "*everybody liked that*",
                  "timestamp": "2022-08-23 14:52:48",
                  "score": 12,
                  "num_children": 0,
                  "author": 8940,
                  "replies": []
                },
                {
                  "id": "iljlqb4",
                  "text": "Isn't the entire point of being a parent to love your kid and raise them the best you can? Gee,",
                  "timestamp": "2022-08-24 02:38:45",
                  "score": 4,
                  "num_children": 0,
                  "author": 19811,
                  "replies": []
                },
                {
                  "id": "iljww78",
                  "text": "Who cares. You wouldn’t want her as a mom anyway if you were a guy.",
                  "timestamp": "2022-08-24 04:12:52",
                  "score": 3,
                  "num_children": 0,
                  "author": 280318,
                  "replies": []
                },
                {
                  "id": "im7s8gc",
                  "text": "Hey, can you send this to her on my behalf? I don't want to return to that nuclear wasteland of a site.\n\n\"Ladies and Gentlemen, imagine a world where the fathers of newly born girls would bury them alive under the sand, due to shame. A case so prevalent, that was even mentioned in a religious book that came down to them. That's not fiction. That's what pre-Islamic Arabs did. The Western civilization has truly dwelled deeper than a bunch of cavemen in the desert. Y'all fucked up. Although, you shouldn't be allowed children in the first place if you think that way.\"\n\nThank you brother.",
                  "timestamp": "2022-08-29 03:57:37",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ilhehku",
          "text": "Her account is inactive. And don't bother bruh. We are fucked anyways. There are millions of these chicks around.",
          "timestamp": "2022-08-23 17:39:59",
          "score": 9,
          "num_children": 1,
          "author": 304158,
          "replies": [
            {
              "id": "ilhf124",
              "text": "[removed]",
              "timestamp": "2022-08-23 17:43:22",
              "score": 6,
              "num_children": 2,
              "replies": [
                {
                  "id": "ilhg9co",
                  "text": "She doesn't use it bro, pointless. And like i said, millions of these chicks exist and twitter overlords will censor you and not her. Kind of a wasted attempt.",
                  "timestamp": "2022-08-23 17:51:12",
                  "score": 3,
                  "num_children": 1,
                  "author": 304158,
                  "replies": [
                    {
                      "id": "ilhgjgp",
                      "text": "Yeah it just sucks that it feel like we can't do anything. At least we stick together though.",
                      "timestamp": "2022-08-23 17:53:00",
                      "score": 3,
                      "num_children": 0,
                      "author": 151519,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ili54g0",
                  "text": "Brigades are against Reddit's TOS and could get our subreddit banned. This includes cross posts with any sort of antagonistic subreddit.",
                  "timestamp": "2022-08-23 20:29:37",
                  "score": 2,
                  "num_children": 0,
                  "author": 188706,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ilhr6ix",
          "text": "Don’t fuck that bitch. I certainly wouldn’t. Don’t stick your dick in crazy!",
          "timestamp": "2022-08-23 19:01:20",
          "score": 7,
          "num_children": 1,
          "author": 120081,
          "replies": [
            {
              "id": "ilhux67",
              "text": "🤣🤣🤣 smart man",
              "timestamp": "2022-08-23 19:25:08",
              "score": 2,
              "num_children": 0,
              "author": 151519,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ilgauv8",
      "text": "To the man who stuck his dick in her: Do you just not have any standards at all?",
      "timestamp": "2022-08-23 13:20:19",
      "score": 121,
      "num_children": 7,
      "replies": [
        {
          "id": "ilgc99r",
          "text": "She's probably close to tolerable when she can't speak due to all the penis in her mouth.",
          "timestamp": "2022-08-23 13:30:34",
          "score": 36,
          "num_children": 1,
          "author": 305081,
          "replies": [
            {
              "id": "ilgceyp",
              "text": "I'd still rather stay a virgin for the rest of my life than fuck her ugh",
              "timestamp": "2022-08-23 13:31:43",
              "score": 37,
              "num_children": 1,
              "replies": [
                {
                  "id": "ilgmioz",
                  "text": "You can't say what sort of STI/STD disease she's harbouring lol. Maybe she's even having some disease mankind doesn't know of, and after sleeping with her, you catch it, and die a horrible death later on. I bet being a virgin is much better than going through all this",
                  "timestamp": "2022-08-23 14:41:20",
                  "score": 11,
                  "num_children": 0,
                  "author": 185666,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ilgd4b3",
          "text": "lol you're dreaming if you think 90% of 'men' aren't pandering and putting pussy on a pedestal.. You have to really try hard to be not able to attract/keep ANY dude if you were a woman. A crazy (read: actually crazy mentally ill) woman will have some loser that will be with them just based on the grounds of sex availability. We live in a world of pussified/feminine men, and hate to use the word but beta or simp men too.",
          "timestamp": "2022-08-23 13:36:51",
          "score": 38,
          "num_children": 2,
          "author": 263708,
          "replies": [
            {
              "id": "ilgddey",
              "text": "Hopefully the GigaChad myth is real and he is born within the next 10 years to restore things to the way they were/ should be.",
              "timestamp": "2022-08-23 13:38:43",
              "score": 9,
              "num_children": 2,
              "replies": [
                {
                  "id": "ilgfbdm",
                  "text": "It's highly unlikely just based on the way the western world in particular works. It's hard to go against the programming and social/media stigma too. You will suffer consequences and I can't see many men willing to continue forward. For example, you won't get that job, be promoted, go on 'dates', etc by just being traditionally masculine or a man. Those traits and characteristics are now bad and you will get shamed, labelled, ostracised, excluded, etc. In some cases it will be overt (like a bad date or the reason why you aren't getting promoted) but most often it's covert or subtle (like harder to make friends/business partners since you would be an outlier compared to everyone else who is going along with... or are deep in the 'new think'). \n\nThere are some men who hate it.. don't believe in this new age craziness where being a man is inherently bad... BUT they go along to get along which is just as bad because it promotes it by placid acceptance. They understand the best and selfish way to make their way in the world is to say/do/don't say whatever is required to further their self-interest in sex, relationships, business, etc. \n\nTLDR: I wouldn't hold my breath.",
                  "timestamp": "2022-08-23 13:52:23",
                  "score": 9,
                  "num_children": 1,
                  "author": 263708,
                  "replies": [
                    {
                      "id": "ilgfxo6",
                      "text": "(Partially satire, partially based in reality) The GigaChad myth tells the tale of a man with unspeakable power and great success, socially, financially, sexually etc. His thirst for victory is unquenchable and he will completely dominate the world, crushing all in his way. No man, no woman, no feminist, sjw, can stop him. He is the male dream incarnate.",
                      "timestamp": "2022-08-23 13:56:41",
                      "score": 8,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ilgs37f",
                          "text": "So basically Alexander The Great 2.0",
                          "timestamp": "2022-08-23 15:17:58",
                          "score": 3,
                          "num_children": 0,
                          "author": 288297,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "iljb210",
                  "text": "How should things be?",
                  "timestamp": "2022-08-24 01:20:19",
                  "score": -2,
                  "num_children": 0,
                  "author": 295982,
                  "replies": []
                }
              ]
            },
            {
              "id": "ilikw83",
              "text": "90% seems low",
              "timestamp": "2022-08-23 22:12:40",
              "score": 2,
              "num_children": 1,
              "replies": [
                {
                  "id": "iliy8gb",
                  "text": "I was being optimistic haha, you are right though, probably more like 98%",
                  "timestamp": "2022-08-23 23:46:42",
                  "score": 2,
                  "num_children": 0,
                  "author": 263708,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ilh1efm",
          "text": "Good question. With such a pus filled heart how did she fool a male long enough to get the D",
          "timestamp": "2022-08-23 16:17:43",
          "score": 5,
          "num_children": 0,
          "author": 65777,
          "replies": []
        },
        {
          "id": "ilhed0r",
          "text": "That's the problem ain't it? Simps be simpin",
          "timestamp": "2022-08-23 17:39:10",
          "score": 5,
          "num_children": 0,
          "author": 304158,
          "replies": []
        },
        {
          "id": "iljnwgh",
          "text": "Have you met the modern Californian? These so called \"Men\" will literally get the snip on their fertility to hook up with one of these. Being a bitchboy is no longer a deviation for lots of places.",
          "timestamp": "2022-08-24 02:55:34",
          "score": 3,
          "num_children": 0,
          "author": 39375,
          "replies": []
        },
        {
          "id": "ilikmyf",
          "text": "But she’s got love bruh",
          "timestamp": "2022-08-23 22:10:56",
          "score": 2,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "imm4fk8",
          "text": "Male raised by a woman is actually just female in male body. They'll do anything out of desperation",
          "timestamp": "2022-09-01 03:22:49",
          "score": 1,
          "num_children": 0,
          "author": 186047,
          "replies": []
        }
      ]
    },
    {
      "id": "ilggs8p",
      "text": "Yet, feminists keep telling me that misandry doesn't even exist and that we are the hateful ones. Then I see something like this and I'm astonished how hateful a person can be.",
      "timestamp": "2022-08-23 14:02:33",
      "score": 42,
      "num_children": 0,
      "author": 294229,
      "replies": []
    },
    {
      "id": "ilgh2ll",
      "text": ">heart filled with love\n\nAnd her womb is filled with death.",
      "timestamp": "2022-08-23 14:04:31",
      "score": 29,
      "num_children": 2,
      "author": 324093,
      "replies": [
        {
          "id": "ilgscxu",
          "text": "That's deep, something that should be a place of life becomes a cemetery, people really do corrupt even the purest of things.",
          "timestamp": "2022-08-23 15:19:41",
          "score": 9,
          "num_children": 0,
          "author": 288297,
          "replies": []
        },
        {
          "id": "iljo4m5",
          "text": "Behold, I have become death, destroyer of worlds.",
          "timestamp": "2022-08-24 02:57:24",
          "score": 2,
          "num_children": 1,
          "author": 39375,
          "replies": [
            {
              "id": "ilonrlb",
              "text": "hard to put her in the same category as Oppenheiner. But if she had her way they'd def be similar. Only difference is Oppenheimer was destroyed by what he had created, and this psycho would willingly kill millions it seems",
              "timestamp": "2022-08-25 02:51:17",
              "score": 1,
              "num_children": 1,
              "author": 51311,
              "replies": [
                {
                  "id": "ilow9u1",
                  "text": "Oppenheimer wasn't killed by a nuke, so I'm going to guess that you mean his suicide because he felt responsible\n\n\nThe quote is actually of Hindu origin, and he just popularized it. I wasn't really trying to compare her to Oppenheimer, but the quote could very easily fit in with her narrative.",
                  "timestamp": "2022-08-25 04:03:54",
                  "score": 1,
                  "num_children": 0,
                  "author": 39375,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ilgkxtz",
      "text": "To bad her dad performed with her mom and now this idiot is in the World.",
      "timestamp": "2022-08-23 14:30:42",
      "score": 13,
      "num_children": 0,
      "author": 332264,
      "replies": []
    },
    {
      "id": "ilgek06",
      "text": "Curious if she killed the poor sap who got her pregnant.",
      "timestamp": "2022-08-23 13:47:06",
      "score": 10,
      "num_children": 0,
      "author": 97765,
      "replies": []
    },
    {
      "id": "ilggp0q",
      "text": "If we're banning people of the internet for bullshit clearly this woman needs to be canceled. Oh wait I don't believe I deleting views I don't believe with let this girl make herself look stupid.",
      "timestamp": "2022-08-23 14:01:55",
      "score": 8,
      "num_children": 0,
      "author": 138967,
      "replies": []
    },
    {
      "id": "ilgq5us",
      "text": "Well the west can’t continue to exist with this narrative for longer than 50 more years, so in the end they win, and the NWO wins.. the only group that looses are the broke guys who wanted to have a good wife and some kids.. no matter how you slice it, this way we get the least harm..",
      "timestamp": "2022-08-23 15:05:26",
      "score": 9,
      "num_children": 2,
      "author": 70446,
      "replies": [
        {
          "id": "ilhawqg",
          "text": "Her opinion is not mainstream, if it were true then there would be more females than males being born in the west which it is not.  You can find always find a small sample extreme opinions online, don't confuse it with average people.",
          "timestamp": "2022-08-23 17:17:29",
          "score": 3,
          "num_children": 1,
          "author": 160081,
          "replies": [
            {
              "id": "ilmb6q8",
              "text": "I think their Numbers are actually quite big.. definitely over 30% of the western population, both genders.. which is enough to cause a catastrophe..",
              "timestamp": "2022-08-24 17:23:52",
              "score": 2,
              "num_children": 1,
              "author": 70446,
              "replies": [
                {
                  "id": "ilmbs79",
                  "text": "Where do you get that? You probably can't even find 5 of people like her twitter.",
                  "timestamp": "2022-08-24 17:27:33",
                  "score": 1,
                  "num_children": 0,
                  "author": 160081,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "iljof5i",
          "text": "The people who are doing this to themselves aew normally not the ones who breed, fortunately. Frankly, I'm glad that all these extremists are getting hysterectomies and vasectomies.",
          "timestamp": "2022-08-24 02:59:44",
          "score": 1,
          "num_children": 1,
          "author": 39375,
          "replies": [
            {
              "id": "ilmay3u",
              "text": "The issue is that the media successfully convinced a large portion of the population in their entire narrative.. these social outcasts are no longer just a small minority nobody knows, they are a large group of people that will leave an imprint on humanity as a whole.. once the dust settles decades from now, peoples views will be drastically different and hate will be a factor!",
              "timestamp": "2022-08-24 17:22:23",
              "score": 2,
              "num_children": 0,
              "author": 70446,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ilgj3ed",
      "text": "Sodom and Gomorrah times. Brainwashed by lamestream society.",
      "timestamp": "2022-08-23 14:18:20",
      "score": 7,
      "num_children": 0,
      "author": 309489,
      "replies": []
    },
    {
      "id": "ilgita0",
      "text": "Love huh? But its lacking towards males.",
      "timestamp": "2022-08-23 14:16:24",
      "score": 6,
      "num_children": 0,
      "author": 380875,
      "replies": []
    },
    {
      "id": "ilgkal0",
      "text": "[Saw this a year ago. She's thinking of raising the kid as a girl.](https://twitter.com/shampoob0ttles/status/1268189454050656259?cxt=HHwWhoCwydvlwZkjAAAA)",
      "timestamp": "2022-08-23 14:26:24",
      "score": 5,
      "num_children": 1,
      "author": 304158,
      "replies": [
        {
          "id": "ilgtpjg",
          "text": "Was the kid a boy",
          "timestamp": "2022-08-23 15:28:22",
          "score": 3,
          "num_children": 1,
          "author": 194539,
          "replies": [
            {
              "id": "ilhd8o7",
              "text": "She deleted her account, so we don't know what happened after this. But there are examples of women raising their boys as girls.\n\n[Edit: Nope account still there. Doesn't post anymore obvio.](https://twitter.com/shampoob0ttles/status/1268189454050656259?cxt=HHwWhoCwydvlwZkjAAAA)",
              "timestamp": "2022-08-23 17:32:07",
              "score": 1,
              "num_children": 0,
              "author": 304158,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ilhqdmx",
      "text": "I love how this idiot characterizes anyone who calls her out on her sexism as “alt-right”. This is classic projection. It’s nauseating.",
      "timestamp": "2022-08-23 18:56:11",
      "score": 5,
      "num_children": 1,
      "author": 120081,
      "replies": [
        {
          "id": "ilhr8lt",
          "text": "Yep!",
          "timestamp": "2022-08-23 19:01:42",
          "score": 1,
          "num_children": 0,
          "author": 362760,
          "replies": []
        }
      ]
    },
    {
      "id": "ilgtpjs",
      "text": "Wouldn't this technically be anti trans because she assuming her unborn child gender? Also she sounds like a psychopath",
      "timestamp": "2022-08-23 15:28:22",
      "score": 5,
      "num_children": 1,
      "author": 179451,
      "replies": [
        {
          "id": "iljtiqb",
          "text": "Good catch.",
          "timestamp": "2022-08-24 03:42:12",
          "score": 1,
          "num_children": 0,
          "author": 40143,
          "replies": []
        }
      ]
    },
    {
      "id": "ilgnlnz",
      "text": "Her ♥️ 4 abortion.",
      "timestamp": "2022-08-23 14:48:28",
      "score": 3,
      "num_children": 0,
      "author": 299649,
      "replies": []
    },
    {
      "id": "ilgs04y",
      "text": "She's a good example of a bad person, but this is an old tweet which means it wouldn't have shown up in your twitter feed. Are you just karmawhoring?",
      "timestamp": "2022-08-23 15:17:25",
      "score": 3,
      "num_children": 0,
      "author": 396688,
      "replies": []
    },
    {
      "id": "ilh28du",
      "text": "Ah yes alt right when you know your wrong but wanna find an excuse",
      "timestamp": "2022-08-23 16:22:54",
      "score": 3,
      "num_children": 0,
      "author": 127773,
      "replies": []
    },
    {
      "id": "ilh2vi4",
      "text": "I can just tell she is gross from her picture 🤣",
      "timestamp": "2022-08-23 16:26:57",
      "score": 3,
      "num_children": 0,
      "author": 52210,
      "replies": []
    },
    {
      "id": "ilgtsu1",
      "text": "I hope unspeakable things happen to her and all women like her. Amen.",
      "timestamp": "2022-08-23 15:28:57",
      "score": 2,
      "num_children": 0,
      "author": 39998,
      "replies": []
    },
    {
      "id": "ilh311a",
      "text": "This cant be real 🫠",
      "timestamp": "2022-08-23 16:27:54",
      "score": 2,
      "num_children": 0,
      "author": 334202,
      "replies": []
    },
    {
      "id": "ilhiw67",
      "text": "She is filled with love. And cum.",
      "timestamp": "2022-08-23 18:08:07",
      "score": 2,
      "num_children": 0,
      "author": 117497,
      "replies": []
    },
    {
      "id": "ilitq6i",
      "text": "A heart that aborts male children cannot be filled with love",
      "timestamp": "2022-08-23 23:14:09",
      "score": 2,
      "num_children": 0,
      "author": 295867,
      "replies": []
    },
    {
      "id": "iliz8wv",
      "text": "Talk about being TOXIC",
      "timestamp": "2022-08-23 23:54:08",
      "score": 2,
      "num_children": 0,
      "author": 258470,
      "replies": []
    },
    {
      "id": "iljfhea",
      "text": "Someone should fill that \"heart of love\" with fucking lead",
      "timestamp": "2022-08-24 01:52:37",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iljpua9",
      "text": "Lol did a man get her pregnant? I assume this since she hates males so much.",
      "timestamp": "2022-08-24 03:11:16",
      "score": 2,
      "num_children": 1,
      "author": 403083,
      "replies": [
        {
          "id": "iljuqoi",
          "text": "No, she hates men way too much and who's going to stick their dick in a human cesspool like that.\n\nShe probably found a condom in a trash can",
          "timestamp": "2022-08-24 03:53:00",
          "score": 0,
          "num_children": 0,
          "author": 134014,
          "replies": []
        }
      ]
    },
    {
      "id": "iljw35r",
      "text": "Ok what I’m about to say is about to sound horrible but I think abortions should be heavily like selective about who Is able to. Rape victims, of course, anyone under 18 should have the option, and pregnac that will probably kill the mother. They shouldn’t be options to people like her who don’t want to have a baby due to it being female or male, or it having a non harmful deformity, some form of a disorder/ Syndrom idk what to call it such as down So long as it’s not harmful to the mother.",
      "timestamp": "2022-08-24 04:05:14",
      "score": 2,
      "num_children": 0,
      "author": 294252,
      "replies": []
    },
    {
      "id": "ilkn8do",
      "text": "Wasn’t her page a satire page? Still a hateful thing to post, but most people doubted that the page was run by a ‘real’ person",
      "timestamp": "2022-08-24 09:36:01",
      "score": 2,
      "num_children": 0,
      "author": 378000,
      "replies": []
    },
    {
      "id": "ilgt33u",
      "text": "Imagine saying groomer and being ban from all platforms but a lefty who literally say she will abort only if it’s a boy get a pass! Crazy world\n\nWhere are the feminists on this sub saying misandry doesn’t exist?",
      "timestamp": "2022-08-23 15:24:20",
      "score": 2,
      "num_children": 1,
      "author": 80437,
      "replies": [
        {
          "id": "ilhbsmq",
          "text": "Maybe because one is defamation and various expression of hatred against men and women are legal and allowed by TOS? Just depends on far your take it. Calling for violence against groups is illegal but just expressing disdain against people is not.",
          "timestamp": "2022-08-23 17:23:00",
          "score": 2,
          "num_children": 0,
          "author": 160081,
          "replies": []
        }
      ]
    },
    {
      "id": "ilgimd9",
      "text": "This is one of those posts where unfortunately if you want the right to free speech you must accept the burden of supporting it. Be happy in that the author of said post is only making themselves and their opinions look foolish. There will always be extremes of opinions from both the left and right. We accept that for the majority of people who actually make a difference in the world, these opinions have no bearing.",
      "timestamp": "2022-08-23 14:15:06",
      "score": 3,
      "num_children": 2,
      "author": 239114,
      "replies": [
        {
          "id": "ilgsr86",
          "text": ">We accept that for the majority of people who actually make a difference in the world, these opinions have no bearing.\n\nI wouldn't count on that...",
          "timestamp": "2022-08-23 15:22:13",
          "score": 2,
          "num_children": 0,
          "author": 288297,
          "replies": []
        },
        {
          "id": "ilgvfus",
          "text": "I don't have to support it, I have to tolerate it. There's a difference.",
          "timestamp": "2022-08-23 15:39:26",
          "score": 2,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "iliqfm6",
      "text": "Women like these are the reason I am a misogynist. I'll behave because it's the rules. This post really ramped that up a few notches. Disgusting.",
      "timestamp": "2022-08-23 22:50:44",
      "score": 1,
      "num_children": 0,
      "author": 283942,
      "replies": []
    },
    {
      "id": "ilixphs",
      "text": "I hope her daughter is born health and she bleeds out in the OR!",
      "timestamp": "2022-08-23 23:42:47",
      "score": 1,
      "num_children": 0,
      "author": 221612,
      "replies": []
    },
    {
      "id": "ilj0jug",
      "text": "she is a misandrist yet most likely had a huband for that child, or a sperm donor was a man who gave that child.",
      "timestamp": "2022-08-24 00:03:46",
      "score": 1,
      "num_children": 0,
      "author": 179153,
      "replies": []
    },
    {
      "id": "iljeak1",
      "text": "Yeah filled with love. A love to hate men. Moronic embarrassment to my gender.",
      "timestamp": "2022-08-24 01:44:02",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "iljgsfe",
      "text": "🤣  Gentlemen and ladies... I present to you... insanity and delusion.\n\nOne **cannot** be \"filled with love\" (at least in the PG sense) while ALSO claiming the desire to KILL half the population of the world... which, btw, is literally required to ensure the homo sapien species doesn't go extinct.  The girl hasn't thought it through.  What she calls \"valid beliefs\" are merely misguided and easily disprovable *\"feelings*\".",
      "timestamp": "2022-08-24 02:02:06",
      "score": 1,
      "num_children": 0,
      "author": 257874,
      "replies": []
    },
    {
      "id": "iljrrc8",
      "text": "Millions of people think just like her. Men included. It's the end of the world. We're done",
      "timestamp": "2022-08-24 03:27:08",
      "score": 1,
      "num_children": 0,
      "author": 327246,
      "replies": []
    },
    {
      "id": "iljtc8u",
      "text": "Feminism has truly destroyed western society as a whole.",
      "timestamp": "2022-08-24 03:40:39",
      "score": 1,
      "num_children": 0,
      "author": 407226,
      "replies": []
    },
    {
      "id": "iljwnts",
      "text": "\"mine is filled with love\" That made me laugh lol.",
      "timestamp": "2022-08-24 04:10:40",
      "score": 1,
      "num_children": 0,
      "author": 99609,
      "replies": []
    },
    {
      "id": "ilk8ueb",
      "text": "But she banged a dude, in order to become pregnant? So it's ok to let men run a train on you, but it you get pregnant, and it's a boy, kill all men? \n\nBizarre logic.",
      "timestamp": "2022-08-24 06:23:03",
      "score": 1,
      "num_children": 1,
      "author": 371275,
      "replies": [
        {
          "id": "ilsffqb",
          "text": "Exactly. Basically people like her just want to be in control. What feminists want isn't equality, but for men to be slaves and women to be in complete power where they can do no wrong. Honestly it's a sick mental problem.",
          "timestamp": "2022-08-25 21:39:19",
          "score": 2,
          "num_children": 0,
          "author": 136085,
          "replies": []
        }
      ]
    },
    {
      "id": "ilk086v",
      "text": "I've been on this sub for years... Stopped checking it for a while and recently came back.\n\nThis shit is *still* being reposted??? Sounds like some of yall need to move on. It's one stupid person. What are you gonna do?",
      "timestamp": "2022-08-24 04:45:25",
      "score": 0,
      "num_children": 0,
      "author": 255588,
      "replies": []
    },
    {
      "id": "ilgfjh6",
      "text": "Honestly, I don't think abortion is actually that bad\n\n\n\nIt's better not to live in this world.",
      "timestamp": "2022-08-23 13:53:56",
      "score": -9,
      "num_children": 3,
      "author": 351080,
      "replies": [
        {
          "id": "ilgp944",
          "text": "[removed]",
          "timestamp": "2022-08-23 14:59:24",
          "score": 5,
          "num_children": 1,
          "replies": [
            {
              "id": "ilie567",
              "text": "Targeted hate gets subs banned and is in general a bad thing. This includes misandry, misogyny, transphobia, racism, homophobia, ableism, etc.",
              "timestamp": "2022-08-23 21:27:40",
              "score": 2,
              "num_children": 0,
              "author": 40076,
              "replies": []
            }
          ]
        },
        {
          "id": "ilghxis",
          "text": ">It's better not to live in this world. \n\nThat's your opinion. Even if it were true, that doesn't make murder okay. \n\nA viable fetus should not be sucked out with a vacuum and harvested for stem cells. Abortion should only be performed in cases where it's medically necessary or if there are complications with the fetus. And in cases of rape and incest, abortion should not be performed after a certain period of time (3-4 months).",
          "timestamp": "2022-08-23 14:10:23",
          "score": 4,
          "num_children": 2,
          "author": 324093,
          "replies": [
            {
              "id": "ilgpbeg",
              "text": "Dude is either a troll or incredibly mentally unstable.",
              "timestamp": "2022-08-23 14:59:49",
              "score": 3,
              "num_children": 0,
              "author": 151519,
              "replies": []
            },
            {
              "id": "ilhb2po",
              "text": "Why it is okay before 3-4 months but not after in your opinion?",
              "timestamp": "2022-08-23 17:18:32",
              "score": 1,
              "num_children": 1,
              "author": 160081,
              "replies": [
                {
                  "id": "ilhgygo",
                  "text": "Read up on abortion literature. There are many forms of abortion. There is not just one pill to swallow and the fetus disappears. \n\nGenerally after 15 weeks, the fetus needs to be pulled out limb-by-limb to complete the abortion. The fetus is torn apart. Both Mississippi and Florida ban abortion after 15 weeks unless medically necessary.\n\nAlso to clarify, abortion before 15 weeks is also morally wrong on a viable fetus that is not of rape or incest.",
                  "timestamp": "2022-08-23 17:55:40",
                  "score": 2,
                  "num_children": 1,
                  "author": 324093,
                  "replies": [
                    {
                      "id": "ilhhby3",
                      "text": "Why do you make an exception though, how does it make it okay if its rape or incest?",
                      "timestamp": "2022-08-23 17:58:03",
                      "score": 0,
                      "num_children": 1,
                      "author": 160081,
                      "replies": [
                        {
                          "id": "ilhk9d7",
                          "text": ">make it okay if its rape or incest? \n\nIt's not okay. But you can't force a woman or underage girl to bear her rapist's child. It's at best a necessary evil. \n\nBefore 15 weeks, abortion is allowed if it's born of rape/incest. After 15 weeks, abortion not allowed, unless medically necessary (underage, etc).",
                          "timestamp": "2022-08-23 18:16:58",
                          "score": 1,
                          "num_children": 1,
                          "author": 324093,
                          "replies": [
                            {
                              "id": "ilhkoj6",
                              "text": "Why shouldn't they be forced to do it if abortion is \"murder.\" Two wrongs don't make a right.",
                              "timestamp": "2022-08-23 18:19:44",
                              "score": 1,
                              "num_children": 1,
                              "author": 160081,
                              "replies": [
                                {
                                  "id": "ilhmlaq",
                                  "text": ">Why shouldn't they be forced to do it if abortion is \"murder.\"\n\nBe more specific in your discourse. I have already laid out scenarios where abortion is allowed and where the fetus is forced to be carried to term. \n\nIn which scenario are you referring to?\n\nMost abortion should be allowed under fringe scenarios, and even then only early in the pregnancy.",
                                  "timestamp": "2022-08-23 18:32:00",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 324093,
                                  "replies": [
                                    {
                                      "id": "ilhmwvq",
                                      "text": "Yes why do you think it should be allowed if its murdering of an unborn baby. Two wrongs don't make a right.  Do you have a reasoning or it is it just your arbitrary opinion?",
                                      "timestamp": "2022-08-23 18:34:06",
                                      "score": 1,
                                      "num_children": 2,
                                      "author": 160081,
                                      "replies": [
                                        {
                                          "id": "ilhnrb0",
                                          "text": "Are you saying there is no scenario where abortion is allowed? All the way from the night of conception to the day of birth? I think that's extreme and there are always extenuating circumstances.\n\nI think abortion laws are trying to solve a modern problem brought on by radical feminism: that is frivolous abortions on viable fetuses. Feminists originally started it so women could work longer hours, but now modern feminism has corrupted it even more to where abortions are now a badge of honor.",
                                          "timestamp": "2022-08-23 18:39:35",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 324093,
                                          "replies": [
                                            {
                                              "id": "ilho2th",
                                              "text": "I'm asking you why you think its okay to murder a baby just because someone else did something wrong.  What is the reasoning on your mind that it should be allowed?  You are just saying it should be allowed by but not why.",
                                              "timestamp": "2022-08-23 18:41:37",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 160081,
                                              "replies": [
                                                {
                                                  "id": "ilhqhv5",
                                                  "text": "According to my beliefs, abortion is only allowed when:\n\n1. The life of the woman is threatened.\n2. The woman or girl is raped or of incest.\n\nIn the first case, my stance is utilitarian. That is, if the woman's life is threatened by the fetus, then her life takes precedence over the life of the fetus.\n\nYou could also extend this protection to the fetus. If the fetus has complications, and is doomed to a life of pain and misery, then abortion is allowed so that the child doesn't suffer in life. Again this stance is utilitarian.\n\nIn the 2nd case, the justification is a little harder to explain, but the issue is one of consent. Did two adults willingly engage in sex, whether or not the intention was to create life, that is the result. So their burden is to nurture that life.\n\nIf the woman was instead raped. They now have 15 weeks to prepare the legal paperwork and evidence of rape to terminate the pregnancy. The woman never willingly engaged in sex, so she shouldn't be held with the burden of carrying it past the 1st trimester, where it becomes a fully-fledged viable fetus.",
                                                  "timestamp": "2022-08-23 18:56:56",
                                                  "score": 2,
                                                  "num_children": 1,
                                                  "author": 324093,
                                                  "replies": [
                                                    {
                                                      "id": "ilhupp5",
                                                      "text": "Just because they did not consent doesn't mean they should murder the baby though?  I don't get how you are making the jump that murder is okay just because they didn't consent and how it makes any difference that its 4 month or 5 months.",
                                                      "timestamp": "2022-08-23 19:23:48",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "author": 160081,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "id": "ilhokby",
                                          "text": ">Do you have a reasoning or it is it just your arbitrary opinion? \n\nNot just my own reasoning. Also the opinion of Justice Clarence Thomas. See: Stenberg v. Carhart, 530 U.S. 914 (2000), Justice Clarence Thomas\n\nAlso, I have already stated that it is a Mississippi and Florida law.",
                                          "timestamp": "2022-08-23 18:44:41",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 324093,
                                          "replies": [
                                            {
                                              "id": "ilhp59m",
                                              "text": "Thats legal opinion not related to morality. There are things that can be legal but also immoral.  What's your basis for allowing the murdering of babies in those circumstances?",
                                              "timestamp": "2022-08-23 18:48:24",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 160081,
                                              "replies": [
                                                {
                                                  "id": "ilhs5jt",
                                                  "text": ">Thats legal opinion not related to morality.\n\nThat's just a silly thing to say. I'd say it's immoral to force a woman to bear her rapist's baby before 15 weeks. What's your basis for punishing the woman for being raped?",
                                                  "timestamp": "2022-08-23 19:07:36",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 324093,
                                                  "replies": [
                                                    {
                                                      "id": "ilhtw3e",
                                                      "text": "Sure by why is it more moral murder a baby than to bear an unwated baby in the case of incest or rape?",
                                                      "timestamp": "2022-08-23 19:18:39",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 160081,
                                                      "replies": [
                                                        {
                                                          "id": "ili9okb",
                                                          "text": "Laws are there to protect people and their rights. If it isn't medically necessary, the question is if it's morally acceptable. \n\nThere's no easy answer to terminating a fetus. Provided that the fetus has not developed too much and that the pregnancy was started in an unlawful manner, then it's reprehensible, but acceptable to terminate the fetus.\n\nThe law has done what it can to prevent frivolous abortions. But it also makes room for cases where it is not black and white.\n\nI can't explain it any better so this is my last response.",
                                                          "timestamp": "2022-08-23 20:58:41",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 324093,
                                                          "replies": [
                                                            {
                                                              "id": "ilibjil",
                                                              "text": "Yeah you didn't explain anything. Just reiterated your assertion that its okay to kill a baby because you think so.",
                                                              "timestamp": "2022-08-23 21:10:42",
                                                              "score": 1,
                                                              "num_children": 0,
                                                              "author": 160081,
                                                              "replies": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ilgsmo1",
          "text": "\"I'm unhappy with my life so we should terminate babies before they're alive so they don't suffer like I do\" what a terrying way of thinking.",
          "timestamp": "2022-08-23 15:21:24",
          "score": 1,
          "num_children": 0,
          "author": 288297,
          "replies": []
        }
      ]
    },
    {
      "id": "ilgl9mn",
      "text": "Is sad when all your life purpose works around this. Like if this was going to take off and every women in the world would listen to this idiot",
      "timestamp": "2022-08-23 14:32:54",
      "score": 1,
      "num_children": 0,
      "author": 11233,
      "replies": []
    },
    {
      "id": "ilgr93s",
      "text": "talk about projecting",
      "timestamp": "2022-08-23 15:12:32",
      "score": 1,
      "num_children": 0,
      "author": 148904,
      "replies": []
    },
    {
      "id": "ilgrfp3",
      "text": "I kinda hope she has a girl, who later comes out as a trans man",
      "timestamp": "2022-08-23 15:13:44",
      "score": 1,
      "num_children": 0,
      "author": 5083,
      "replies": []
    },
    {
      "id": "ilgwtgj",
      "text": "I’ve seen this one before. Loves murdering a baby if it’s a boy.",
      "timestamp": "2022-08-23 15:48:15",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ilh182b",
      "text": "I really feel sorry for the female child she may bring to life. Born unto and into hate, taught from birth to hate men, a cursed life.",
      "timestamp": "2022-08-23 16:16:35",
      "score": 1,
      "num_children": 0,
      "author": 65777,
      "replies": []
    },
    {
      "id": "ilh41la",
      "text": "I bet there is puppy in her womb.",
      "timestamp": "2022-08-23 16:34:20",
      "score": 1,
      "num_children": 0,
      "author": 238790,
      "replies": []
    },
    {
      "id": "ilh4ed9",
      "text": "She isn't fatherless, she is the entire orphanage",
      "timestamp": "2022-08-23 16:36:34",
      "score": 1,
      "num_children": 0,
      "author": 203535,
      "replies": []
    },
    {
      "id": "ilh7uxy",
      "text": "Tell me this is satire...... please",
      "timestamp": "2022-08-23 16:58:11",
      "score": 1,
      "num_children": 0,
      "author": 5932,
      "replies": []
    },
    {
      "id": "ilhbp2r",
      "text": "Yea.Love for what exactly? Loving the wrong things are bad you know. It seems you are a lover of killing weak, innocent, and wonderful beings. A lover of mass genocide and what else?",
      "timestamp": "2022-08-23 17:22:22",
      "score": 1,
      "num_children": 0,
      "author": 336692,
      "replies": []
    },
    {
      "id": "ilhc0ok",
      "text": "Good thing she put that hashtag, proof they know exactly what abortion is",
      "timestamp": "2022-08-23 17:24:24",
      "score": 1,
      "num_children": 0,
      "author": 264290,
      "replies": []
    },
    {
      "id": "ilhraux",
      "text": "POV: She loves everyone so much she want's to kill half of them.",
      "timestamp": "2022-08-23 19:02:06",
      "score": 1,
      "num_children": 0,
      "author": 160238,
      "replies": []
    },
    {
      "id": "ilhvk5p",
      "text": "Her heart was filled with love for anyone who's not a man",
      "timestamp": "2022-08-23 19:29:13",
      "score": 1,
      "num_children": 0,
      "author": 325040,
      "replies": []
    },
    {
      "id": "ilhw2j1",
      "text": "I’m guessing she didn’t get pregnant by a man",
      "timestamp": "2022-08-23 19:32:26",
      "score": 1,
      "num_children": 0,
      "author": 1089,
      "replies": []
    },
    {
      "id": "ilhyfwu",
      "text": "*\"I hate half of the population that has ever existed in this world. I have nothing to do with them, even if they are related to me!\"* \\#ValidBelief #HeartFilledWithLove #LiveLaughLove",
      "timestamp": "2022-08-23 19:47:23",
      "score": 1,
      "num_children": 0,
      "author": 62043,
      "replies": []
    },
    {
      "id": "ili2gku",
      "text": "So \"love\" = \"murdering children based on their sex\"?",
      "timestamp": "2022-08-23 20:12:45",
      "score": 1,
      "num_children": 0,
      "author": 54124,
      "replies": []
    },
    {
      "id": "ilidhu5",
      "text": "Who fucked this creature?",
      "timestamp": "2022-08-23 21:23:24",
      "score": 1,
      "num_children": 0,
      "author": 84480,
      "replies": []
    },
    {
      "id": "iliejfx",
      "text": "Stole the joke from my good boy Borat! FOR SHAAAME!",
      "timestamp": "2022-08-23 21:30:16",
      "score": 1,
      "num_children": 0,
      "author": 221208,
      "replies": []
    },
    {
      "id": "iliiy0u",
      "text": "More toxic than a cyanide pill. When you are so woke you support eradication of half the world...",
      "timestamp": "2022-08-23 21:59:20",
      "score": 1,
      "num_children": 0,
      "author": 59852,
      "replies": []
    },
    {
      "id": "ilim5rb",
      "text": "Aborting a kid based off its gender should be banned. Change my mind if you can.",
      "timestamp": "2022-08-23 22:21:20",
      "score": 1,
      "num_children": 0,
      "author": 397761,
      "replies": []
    },
    {
      "id": "ilip8rg",
      "text": "If she hates men so much how did she even get pregnant in the first place?",
      "timestamp": "2022-08-23 22:42:30",
      "score": 1,
      "num_children": 0,
      "author": 293305,
      "replies": []
    },
    {
      "id": "ilit3k6",
      "text": "Infant annihilator (if you know you know) also shit like this is why I'm Bi",
      "timestamp": "2022-08-23 23:09:37",
      "score": 1,
      "num_children": 0,
      "author": 196095,
      "replies": []
    },
    {
      "id": "ilive2c",
      "text": "Sounds like a female version of The Dictator",
      "timestamp": "2022-08-23 23:26:04",
      "score": 1,
      "num_children": 0,
      "author": 85368,
      "replies": []
    },
    {
      "id": "ilja4n1",
      "text": "She wanted to kill all men yet she is sleeping with one lol... Why else would she be pregnant then?????",
      "timestamp": "2022-08-24 01:13:41",
      "score": 1,
      "num_children": 0,
      "author": 265435,
      "replies": []
    },
    {
      "id": "iljl1jv",
      "text": "The mental gymnastics some of these people perform are astounding.",
      "timestamp": "2022-08-24 02:33:35",
      "score": 1,
      "num_children": 0,
      "author": 74697,
      "replies": []
    },
    {
      "id": "iljncr8",
      "text": "Just like the \"loving\" Nazis. They were going to see if it was a German or mincemeat. I don't see how this is different",
      "timestamp": "2022-08-24 02:51:13",
      "score": 1,
      "num_children": 0,
      "author": 39375,
      "replies": []
    },
    {
      "id": "iljzl85",
      "text": "I hate evil.",
      "timestamp": "2022-08-24 04:38:58",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ilk55nr",
      "text": "I wonder who convinced her that hating men=love",
      "timestamp": "2022-08-24 05:39:21",
      "score": 1,
      "num_children": 0,
      "author": 104276,
      "replies": []
    },
    {
      "id": "ilkynzq",
      "text": "Let's take a minute and ask how she god pregnant",
      "timestamp": "2022-08-24 11:46:18",
      "score": 1,
      "num_children": 0,
      "author": 89636,
      "replies": []
    },
    {
      "id": "ill4hga",
      "text": "Men leave tho woman alone. Do not ever giver her attention or help her in any way but to leave her completely alone.  Be free away from her.  She is not worthy of anything but indifference.",
      "timestamp": "2022-08-24 12:37:03",
      "score": 1,
      "num_children": 0,
      "author": 359954,
      "replies": []
    },
    {
      "id": "ilmpqdk",
      "text": "Fucking SelfAwarewolves",
      "timestamp": "2022-08-24 18:55:12",
      "score": 1,
      "num_children": 0,
      "author": 266637,
      "replies": []
    },
    {
      "id": "ilo7qoc",
      "text": "Well how the hell would she know if it’s a boy or a girl until it tells her. Just because it’s born with a penis doesn’t mean it’s male. That’s not a determination the doctor or her should be making. What a transphobe.",
      "timestamp": "2022-08-25 00:53:49",
      "score": 1,
      "num_children": 0,
      "author": 42764,
      "replies": []
    },
    {
      "id": "ilo9407",
      "text": "Well, too bad its illegal now",
      "timestamp": "2022-08-25 01:03:32",
      "score": 1,
      "num_children": 0,
      "author": 53197,
      "replies": []
    },
    {
      "id": "ilp1xou",
      "text": "another brainless ditz",
      "timestamp": "2022-08-25 05:00:02",
      "score": 1,
      "num_children": 0,
      "author": 298187,
      "replies": []
    },
    {
      "id": "ilqpbre",
      "text": "As a woman I would apologize for this stupid tweet 🙏🏻",
      "timestamp": "2022-08-25 15:01:20",
      "score": 1,
      "num_children": 0,
      "author": 99442,
      "replies": []
    },
    {
      "id": "inll827",
      "text": "Funny thing is she got pregnant by a Man. Very contradicting",
      "timestamp": "2022-09-08 15:25:12",
      "score": 1,
      "num_children": 0,
      "author": 257039,
      "replies": []
    },
    {
      "id": "iol93y0",
      "text": "She's killing a baby based on its gender, yet says she has love in her heart and others have hate...\n\nAlso, I thought we weren't supposed to know a baby's gender until they are old enough (<10 in some states) to verbally state which gender they are. \n\nWhat about if her baby boy that was terminated became a teenage girl?! Would she regret not getting an abortion if her boy decided to be a girl?\n\nEdit: This isn't anti-Trans btw before anyone thinks it is.\n\nLeading on from my point above; does anyone think that gender disappointment from parents can guide someone's mind down the route of thinking that they're the wrong gender and need to become trans? \n\nLike if a girl is born and the father wanted a son but got a girl and so pushes her to do men's sports, watch TV that boys would watch, wear boy's clothes etc. Does this make it more likely that this girl will become a trans-man?\n\nAnd likewise if a mother wanted a girl but got a boy (before aborting...) and so pushes him towards playing with Barbie's, learning make up and being a cheerleader instead of a player; does this make it more likely this boy will become a trans-women.\n\nJust a couple things I thought about.",
      "timestamp": "2022-09-15 22:19:45",
      "score": 1,
      "num_children": 0,
      "author": 20955,
      "replies": []
    },
    {
      "id": "ilgicsg",
      "text": "Yall need a different hobby.",
      "timestamp": "2022-08-23 14:13:16",
      "score": -12,
      "num_children": 1,
      "author": 206401,
      "replies": [
        {
          "id": "ilhhspw",
          "text": "You need morals. And a dictionary.",
          "timestamp": "2022-08-23 18:01:00",
          "score": 4,
          "num_children": 0,
          "author": 316265,
          "replies": []
        }
      ]
    },
    {
      "id": "ilgx27g",
      "text": "Just from reading the comments, and not the mentioning the post. Does this entire sub think abortion is murder and not healthcare?",
      "timestamp": "2022-08-23 15:49:49",
      "score": 0,
      "num_children": 0,
      "author": 216440,
      "replies": []
    },
    {
      "id": "ilj68rk",
      "text": "Hang on guys, maybe she wants to abort a boy because she doesn't want her son to live in the world feminism created!",
      "timestamp": "2022-08-24 00:45:31",
      "score": 0,
      "num_children": 0,
      "author": 131368,
      "replies": []
    },
    {
      "id": "ilk3to3",
      "text": "Evil. Completely evil. These people are mentally ill.",
      "timestamp": "2022-08-24 05:24:08",
      "score": 0,
      "num_children": 0,
      "author": 222011,
      "replies": []
    },
    {
      "id": "ilk4f4s",
      "text": "That had to be satire.",
      "timestamp": "2022-08-24 05:31:01",
      "score": 0,
      "num_children": 0,
      "author": 348360,
      "replies": []
    },
    {
      "id": "ilkdblz",
      "text": "she needs men to keep mankind alive. so i do not understand why they want to kill everybody?",
      "timestamp": "2022-08-24 07:20:22",
      "score": 0,
      "num_children": 0,
      "author": 169632,
      "replies": []
    },
    {
      "id": "ilkkczv",
      "text": "It's honestly tweets and people like her that contributed to Roe v. Wade getting repealed in the US. Sure the laws are now state level but celebrating abortion like it's a wonderful practice is something that has turned off many from the feminist movement.",
      "timestamp": "2022-08-24 08:56:28",
      "score": 0,
      "num_children": 0,
      "author": 171580,
      "replies": []
    },
    {
      "id": "ilmrstx",
      "text": "This is clearly satire",
      "timestamp": "2022-08-24 19:08:12",
      "score": 0,
      "num_children": 0,
      "author": 372164,
      "replies": []
    }
  ]
}