{
  "id": "wz3k4s",
  "text": "History's judgement has arrived...\n",
  "timestamp": "2022-08-27 13:59:47",
  "score": 3876,
  "subreddit": "t5_3fdcn",
  "num_children": 36,
  "author": 219131,
  "replies": [
    {
      "id": "im046hw",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-08-27 13:59:48",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "im05ghs",
      "text": "Nah let’s elevate him to a GOP hero myth like they did with Ronald Reagan.",
      "timestamp": "2022-08-27 14:09:25",
      "score": 190,
      "num_children": 2,
      "author": 234758,
      "replies": [
        {
          "id": "im07uzt",
          "text": "On the one hand 👈 realizing that his pandering to the worst people, emboldened white supremacists and filling offices with sycophantic yes men is bad for our country's future, not to mention prosecuting him for the terrible damage he's caused us over issues like false claims of election fraud or hoarding state secrets in insecure locations\n\nOn the other hand 👉 building a golden statue of him, leaning on the white supremacist propaganda because it gets you votes and power and just go all-in on supporting him cuz screw it I guess",
          "timestamp": "2022-08-27 14:27:11",
          "score": 66,
          "num_children": 0,
          "author": 329379,
          "replies": []
        },
        {
          "id": "im0udbg",
          "text": "I have heard people in my own family say that he’s the best president we’ve had in this lifetime, except for maybe Reagan. I will never be able to understand.",
          "timestamp": "2022-08-27 17:02:24",
          "score": 46,
          "num_children": 2,
          "author": 295287,
          "replies": [
            {
              "id": "im1ef4p",
              "text": "Fox News. (Now you understand)",
              "timestamp": "2022-08-27 19:21:01",
              "score": 28,
              "num_children": 0,
              "author": 62613,
              "replies": []
            },
            {
              "id": "im0v4dd",
              "text": "Well I’ll say this it’s possible he may not if he actually goes to jail which seems less likely everyday. But if he doesn’t go to jail he’ll be the new Reagan.",
              "timestamp": "2022-08-27 17:07:31",
              "score": 12,
              "num_children": 2,
              "author": 234758,
              "replies": [
                {
                  "id": "im0vc9z",
                  "text": "I don’t think so. I really don’t think there’s anything he could do or anything that could happen to him that would make these people worship him less. I think if he goes to jail he’ll just be more of a martyr to them.",
                  "timestamp": "2022-08-27 17:09:01",
                  "score": 13,
                  "num_children": 1,
                  "author": 295287,
                  "replies": [
                    {
                      "id": "im0vzb2",
                      "text": "It’s possible imo. I think if they had a legit trial they would watch it and if they had the best prosecution they can hire and they see the guy in a actual prison jumpsuit it might click that yeah this guy is just a con man. But either way there would always be a niche following",
                      "timestamp": "2022-08-27 17:13:28",
                      "score": 4,
                      "num_children": 1,
                      "author": 234758,
                      "replies": [
                        {
                          "id": "im3b314",
                          "text": "> they would watch it \n\nHe had 4 legit trials with the impeachments between the house and the senate. Neither were broadcasted anywhere those people would watch things and were instead demonized as a witch hunt. Those same avenues are demonizing this raid as a witch hunt. It's going to be the same bag over head where the only information given to them is from networks that pander to them.",
                          "timestamp": "2022-08-28 04:35:43",
                          "score": 1,
                          "num_children": 0,
                          "author": 184882,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "im1rh3l",
                  "text": "Reagan was a normal liar, and mentally I am not sure how much of it was just reading a script. At least he was amiable and had them tear down that wall. Trump lies like he breathes. He doubles down on his lies and perpetuates them. I worry about people who believe him absolutely.  He cares about nothing except himself. I am still waiting to see if it gets bad enough for him to pull out the “Pocket Pardon” he granted himself before leaving office.",
                  "timestamp": "2022-08-27 20:54:54",
                  "score": 5,
                  "num_children": 0,
                  "author": 290744,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "im0ef99",
      "text": "When they said 'Anyone can grow up to be president,' I don't think Trump is what they had in mind.",
      "timestamp": "2022-08-27 15:13:11",
      "score": 47,
      "num_children": 2,
      "author": 202742,
      "replies": [
        {
          "id": "im1fob9",
          "text": "It was supposed to be inspiring, not alarming.",
          "timestamp": "2022-08-27 19:30:01",
          "score": 17,
          "num_children": 0,
          "author": 374084,
          "replies": []
        },
        {
          "id": "im3po48",
          "text": "> grow up \n\nWell you see, that would require him to *have grown up*, and he's done nothing but act like a child the entire time so",
          "timestamp": "2022-08-28 07:32:06",
          "score": 3,
          "num_children": 0,
          "author": 138007,
          "replies": []
        }
      ]
    },
    {
      "id": "im0cw15",
      "text": "\"We really thought the monkey could fly the passenger plane. I mean, he said he was the only one who could do it.\"",
      "timestamp": "2022-08-27 15:02:41",
      "score": 39,
      "num_children": 0,
      "author": 402667,
      "replies": []
    },
    {
      "id": "im0eprh",
      "text": "Even at this late stage of the game most republicans still would vote for him.  Why has 50 % of the country suddenly gone insane?",
      "timestamp": "2022-08-27 15:15:12",
      "score": 20,
      "num_children": 3,
      "author": 146285,
      "replies": [
        {
          "id": "im0io7o",
          "text": "> Why has 35% of the country suddenly gone insane?\n\nFTFY",
          "timestamp": "2022-08-27 15:42:00",
          "score": 20,
          "num_children": 1,
          "author": 219131,
          "replies": [
            {
              "id": "im1f5w5",
              "text": "8 years of a black president broke their brains",
              "timestamp": "2022-08-27 19:26:22",
              "score": 15,
              "num_children": 0,
              "author": 152884,
              "replies": []
            }
          ]
        },
        {
          "id": "im1cz47",
          "text": "> suddenly \n\nYou mean since Fox News, the Republican propaganda outlet started in the late 90s? Or since at least Reagan? Or for a more recent watershed even, the Republican reaction to Obama?\n\nIt's not suddenly. \n\nIt's also not Trump. Trump is a symptom of the problem, not the problem itself.\n\nThe problem is two-fold:\n\nFirst, and primarily, that the Republicans have gone to fascism to stay in power and serve their oligarch powermakers.\n\nSecond, and important but definitely as much as an order of magnitude less important, is what I would summarize as Citizen's United. Basically, corporations and the wealthy used to be limited in the financial support they could provide to politicians, so politicians had to go to We the People to raise money. Now that is no longer true. Why does your voice not matter? Because you can't put enough money where your mouth is to be heard, unlike the ultra rich oligarchs.",
          "timestamp": "2022-08-27 19:10:43",
          "score": 18,
          "num_children": 0,
          "author": 409482,
          "replies": []
        },
        {
          "id": "im2tqjm",
          "text": "Fox News",
          "timestamp": "2022-08-28 01:57:38",
          "score": 3,
          "num_children": 0,
          "author": 132451,
          "replies": []
        }
      ]
    },
    {
      "id": "im0e3pr",
      "text": "I am never going to say the phrase “I hate to say I told you show” ever again. I’m gonna tell these fuckers I told them so every single day for the rest of my life. *Assuming* that things ultimately do turn out OK in the end, I will never let any of these people live this down.",
      "timestamp": "2022-08-27 15:10:57",
      "score": 16,
      "num_children": 1,
      "author": 125671,
      "replies": [
        {
          "id": "im0h7y9",
          "text": "They won't get it",
          "timestamp": "2022-08-27 15:32:10",
          "score": 11,
          "num_children": 1,
          "author": 254756,
          "replies": [
            {
              "id": "im0ujrp",
              "text": "They still think he’s the greatest president we’ve ever had.",
              "timestamp": "2022-08-27 17:03:38",
              "score": 9,
              "num_children": 0,
              "author": 295287,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "im099nl",
      "text": "Wait until it’s handed to Desantis… On paper he has the credentials, but it will be infinitely worse.",
      "timestamp": "2022-08-27 14:37:05",
      "score": 52,
      "num_children": 3,
      "author": 243135,
      "replies": [
        {
          "id": "im0dg9l",
          "text": "You mean that guy who looks like he was genetically engineered to sell used cars?",
          "timestamp": "2022-08-27 15:06:29",
          "score": 49,
          "num_children": 1,
          "author": 160411,
          "replies": [
            {
              "id": "im2r4mi",
              "text": "/r/RareInsults",
              "timestamp": "2022-08-28 01:35:35",
              "score": 3,
              "num_children": 0,
              "author": 80707,
              "replies": []
            }
          ]
        },
        {
          "id": "im0ebuc",
          "text": "If the Democrats keep passing life-changing legislation and the president keeps making life-changing policy decisions then maybe DeSantis won’t get a shot. Too bad that won’t fucking happen.",
          "timestamp": "2022-08-27 15:12:31",
          "score": 37,
          "num_children": 2,
          "author": 125671,
          "replies": [
            {
              "id": "im1f6pi",
              "text": "Just look at the conservative meltdown over the debt forgiveness, then look at them turning around and praising the president that let a virus spread across our country killing hundreds of thousands of people, some of them their close family members. There’s no stopping the misinformation machine.",
              "timestamp": "2022-08-27 19:26:31",
              "score": 3,
              "num_children": 0,
              "author": 62613,
              "replies": []
            },
            {
              "id": "im0gnlt",
              "text": "The debt forgiveness bill was a paltry sum at best. Hopefully it's not a one time deal. Now if we can overhaul the supreme court then we could get down to brass tacks but guess what?\n\nThat ain't gonna fucking happen.",
              "timestamp": "2022-08-27 15:28:18",
              "score": 16,
              "num_children": 1,
              "replies": [
                {
                  "id": "im1ew0p",
                  "text": "It definitely won't with that attitude. Either keep fighting, stay positive and never let up on the pressure on the GOP, or shutup and keep doomer apathy to yourself",
                  "timestamp": "2022-08-27 19:24:24",
                  "score": 9,
                  "num_children": 1,
                  "author": 165811,
                  "replies": [
                    {
                      "id": "im1g2r1",
                      "text": "Ya know what?\n\nYou're right. This is one of those \"Get busy living or get busy dying\" type situations. I vote, always have but the frustrating part is that my local leaders are either incompetent or they just aren't listening. I live in a North Houston suburb and the local board need to be voted out. \n\nI'm seeing less and less MAGA flag trucks around so thats a good sign for the moment. The people that live in my neighborhood are just like us, working/middle class families from all over the place so we know the score. Sadly the elected officials don't but from what I'm seeing, that's all about to change.",
                      "timestamp": "2022-08-27 19:32:51",
                      "score": 8,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "im1gtb3",
                          "text": "There it is, that's the spirit!\n\nEither all of us do everything in our ability right now to stop the Republican party from gaining any more power, or we let this country die and become overrun with fascism.\n\nLiving a life in a fascist state, perpetually in fear, is no life worth living at all.",
                          "timestamp": "2022-08-27 19:38:05",
                          "score": 4,
                          "num_children": 1,
                          "author": 165811,
                          "replies": [
                            {
                              "id": "im1icmy",
                              "text": "I couldn't agree more with that last sentence. I joined the Marines because I believed we were in danger of losing our democracy to racist fundamentalists overseas. Little did I know that those assholes were already hear and instead of using IEDs and public executions they manipulated elections and the economy to get what they want.\n\nFuck that. Not on my watch.",
                              "timestamp": "2022-08-27 19:49:10",
                              "score": 5,
                              "num_children": 0,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "im0gm39",
          "text": "No amount of 'deathsantis is comin!' will make him next anything. Hes not even gonna win reelection.",
          "timestamp": "2022-08-27 15:28:02",
          "score": 3,
          "num_children": 1,
          "author": 391890,
          "replies": [
            {
              "id": "im0ouk8",
              "text": "He’s tremendously popular among those that actually vote, and he’s put “loyal” people in many, many positions of power.\n\nWe can hope he’s defeated as governor, but between voter suppression and voter turnout I won’t hold my breath.\n\nMoreover, he’s being groomed so fiercely by the Murdochs for the 2024 Republican presidential nomination that it’s a given he’ll win it. \n\nAll he has to do is get Trump to back off, and a discreetly promised pardon would do the trick.",
              "timestamp": "2022-08-27 16:24:16",
              "score": 9,
              "num_children": 1,
              "author": 243135,
              "replies": [
                {
                  "id": "im0pmzw",
                  "text": "Oh he’d take ‘election stolen’ to a whole new level and not leave.",
                  "timestamp": "2022-08-27 16:29:45",
                  "score": 5,
                  "num_children": 0,
                  "author": 160305,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "im0evay",
      "text": "68 charges of sexual assault, only 68?/s",
      "timestamp": "2022-08-27 15:16:18",
      "score": 14,
      "num_children": 0,
      "author": 317995,
      "replies": []
    },
    {
      "id": "im0mr00",
      "text": "Trump is going to be something that America *never* lives down. He's basically our Hitler - an everlasting national shame that we're going to have to constantly apologize for, which is saying a lot when you consider all the other fucked up shit we've produced. For the rest of our history as a nation, the entire world is never going to forget that, at best, we're only 4 years away from another *that*.",
      "timestamp": "2022-08-27 16:09:41",
      "score": 42,
      "num_children": 1,
      "author": 2665,
      "replies": [
        {
          "id": "im11v8n",
          "text": "You can spin it positively, at least America's theoretical Hitler was a gargantuan moron and general giant piece of shit. A more educated and respectful type could have done exponentially more damage than Trump did.\n\nI strongly doubt the majority of his supporters have ever actually watched him speak, live and unedited. It's quite clear that he has significant issues actually understanding anything.",
          "timestamp": "2022-08-27 17:53:42",
          "score": 19,
          "num_children": 1,
          "author": 308512,
          "replies": [
            {
              "id": "im12vl3",
              "text": "Yeah, that's not really positive, dude. It's just more of an indictment of how shitty our country is. \"Well, he totally tried to be Hitler, but he's such a fucking buffoon after decades of coddling by our capitalist celebrity culture that he was wildly incompetent!\"",
              "timestamp": "2022-08-27 18:00:37",
              "score": 9,
              "num_children": 0,
              "author": 2665,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "im04ltr",
      "text": "They were going off historical precedent the last time they elected a movie star",
      "timestamp": "2022-08-27 14:03:04",
      "score": 12,
      "num_children": 1,
      "author": 186841,
      "replies": [
        {
          "id": "im0cp9x",
          "text": "Reagan was hardly a \"star\". He was B-list at the height of his career. His political career started when he was president of the Screen Actor's Guild where he helped blacklist suspected communists, and he was an FBI informant. The bastard.",
          "timestamp": "2022-08-27 15:01:21",
          "score": 23,
          "num_children": 1,
          "author": 402667,
          "replies": [
            {
              "id": "im0phyo",
              "text": "My mom fucking hates Reagan with a passion. He ended school lunch programs, and allowed scores of people with mental health issues to become homeless.",
              "timestamp": "2022-08-27 16:28:48",
              "score": 12,
              "num_children": 0,
              "author": 205017,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "im0hjid",
      "text": "Please! Fuck is wrong with anyone who doesn't see it!!!",
      "timestamp": "2022-08-27 15:34:19",
      "score": 8,
      "num_children": 0,
      "author": 146459,
      "replies": []
    },
    {
      "id": "im0qu68",
      "text": "I think people figured a Joe Pesci-like president would be funny and cool somehow.  \n\nYes, I know Joe Pesci as a person is way cooler, but Trump acts like one of his *characters* in real life.  It's a fucking disaster, because he a spiteful, hateful little piece of shit, with no intention of hiding or changing that.\n\nIt only works in Hollywood, not in real life, so can we please not ever try this again?",
      "timestamp": "2022-08-27 16:38:00",
      "score": 6,
      "num_children": 0,
      "author": 95338,
      "replies": []
    },
    {
      "id": "im0it3d",
      "text": "Please! Fuck is wrong with anyone who doesn't see it!!!",
      "timestamp": "2022-08-27 15:42:55",
      "score": 5,
      "num_children": 0,
      "author": 146459,
      "replies": []
    },
    {
      "id": "im12jz7",
      "text": "I wish we could all agree on that",
      "timestamp": "2022-08-27 17:58:23",
      "score": 4,
      "num_children": 0,
      "author": 361318,
      "replies": []
    },
    {
      "id": "im1faqw",
      "text": "\"Let's try something new!  Let's elect an outsider to shake things up!\"\n\nFuck's sake...",
      "timestamp": "2022-08-27 19:27:19",
      "score": 3,
      "num_children": 0,
      "author": 152884,
      "replies": []
    },
    {
      "id": "im1op6h",
      "text": "I still don’t get how some many people still believe in him and still part of the cult.",
      "timestamp": "2022-08-27 20:34:33",
      "score": 5,
      "num_children": 1,
      "author": 397691,
      "replies": [
        {
          "id": "im3qri2",
          "text": "Ditto.",
          "timestamp": "2022-08-28 07:47:00",
          "score": 1,
          "num_children": 0,
          "author": 313554,
          "replies": []
        }
      ]
    },
    {
      "id": "im2ipio",
      "text": "No, we can't, because Republicans only pretend to care about integrity and \"traditional values\" when all they really want is to get their way.",
      "timestamp": "2022-08-28 00:25:59",
      "score": 3,
      "num_children": 0,
      "author": 35057,
      "replies": []
    },
    {
      "id": "im11hu0",
      "text": "AKA handing the world's most powerful office to the world's most powerful orifice.",
      "timestamp": "2022-08-27 17:51:11",
      "score": 3,
      "num_children": 0,
      "author": 350101,
      "replies": []
    },
    {
      "id": "im1jakc",
      "text": "If only. Nearly half of America wants to be just like him.",
      "timestamp": "2022-08-27 19:55:56",
      "score": 3,
      "num_children": 0,
      "author": 190442,
      "replies": []
    },
    {
      "id": "im1rspf",
      "text": "And thats a small fucking understatement for what the former tv host did",
      "timestamp": "2022-08-27 20:57:18",
      "score": 3,
      "num_children": 0,
      "author": 45756,
      "replies": []
    },
    {
      "id": "im25x77",
      "text": "Can we add that that something me who defrauded his University students can’t opine on cancellation of University debt?",
      "timestamp": "2022-08-27 22:44:11",
      "score": 2,
      "num_children": 0,
      "author": 21427,
      "replies": []
    },
    {
      "id": "im2bubc",
      "text": "I believe Trump will finally usher in a Biblical apocalypse if we allow it.",
      "timestamp": "2022-08-27 23:30:43",
      "score": 2,
      "num_children": 0,
      "author": 350289,
      "replies": []
    },
    {
      "id": "im2dvxr",
      "text": "My dumbshit Idaho extended family think he's the greatest president in the history of America. They send him money every month and think he should be on Mt Rushmore.",
      "timestamp": "2022-08-27 23:47:02",
      "score": 2,
      "num_children": 2,
      "author": 384066,
      "replies": [
        {
          "id": "im2fci6",
          "text": "Are they neo-Nazis and fascists?  There are a lot of those in Idaho.  Such a shame, it's a beautiful place.",
          "timestamp": "2022-08-27 23:58:53",
          "score": 3,
          "num_children": 1,
          "author": 219131,
          "replies": [
            {
              "id": "im3jm6k",
              "text": "Just \"average\" Trump-voting Boise suburbanites. They do all stockpile guns just waiting for Trump to \"give the signal\" to start shooting Democrats.",
              "timestamp": "2022-08-28 06:12:49",
              "score": 3,
              "num_children": 0,
              "author": 384066,
              "replies": []
            }
          ]
        },
        {
          "id": "im3qgem",
          "text": "I’m always stunned that people are incapable of seeing who trump is. \n\nDo you ever ask them “why are you sending money to a billionaire?” They clearly have no concept of what a billion dollars is. trump is greedy beyond comprehension.",
          "timestamp": "2022-08-28 07:42:47",
          "score": 2,
          "num_children": 1,
          "author": 313554,
          "replies": [
            {
              "id": "im3s4ym",
              "text": "They're helping Trump fight the globalists!",
              "timestamp": "2022-08-28 08:05:45",
              "score": 2,
              "num_children": 1,
              "author": 384066,
              "replies": [
                {
                  "id": "im4u0q0",
                  "text": "They are completely deluded. How can they so easily buy into trump’s twisted, corrupt and entirely made up rhetoric.",
                  "timestamp": "2022-08-28 14:53:28",
                  "score": 2,
                  "num_children": 0,
                  "author": 313554,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "im2uqmp",
      "text": "I think the people that'll vote for him in 2024 would argue he's awesome.\n\nThe only reason they can't: literacy.\n\nI know, low hanging fruit and all that.",
      "timestamp": "2022-08-28 02:06:06",
      "score": 2,
      "num_children": 0,
      "author": 399409,
      "replies": []
    },
    {
      "id": "im0kk8g",
      "text": "It’s basically been a poison pill for democracy. It has both set the stage for authoritarianism/totalitarianism in the US, and has proven unequivocally that democracy is a farce, that law is a farce, and that no authority can ever be legitimate.",
      "timestamp": "2022-08-27 15:54:43",
      "score": 6,
      "num_children": 1,
      "author": 290632,
      "replies": [
        {
          "id": "im1eak4",
          "text": "> set the stage\n\nNo, and what worries me is how pervasive this is.\n\nTrump is a symptom, not the problem itself. What set the stage was the gradual process of Republicans becoming fascist - from Reagan (and before, but he was basically a watershed event in the progression) of Fox News starting up as the Republican propaganda outlet to the abuses of the reaction to 9/11 (Patriot Act, etc) and to the escalation of rhetoric and \"the party of no\" when Obama was elected. \n\nTrump is not who the Republicans and their oligarchs want - he's too much. Case in point, people woke up to him and now there's backlash. Republicans want a president who mostly slips under the radar. Like Dubya, who played the character of \"I'm just a country guy you'd have a beer with\". That didn't scare people like Trump, even though he caused… well, not as much harm as Trump, but a HELL of a lot more harm than more people paid attention to.\n\nSo comments like yours worry me. We're about to have Republicans with even more power, meaning they stop most legislation. Which means people not paying attention will be back even more than they already are to saying \"Democrats can't get anything done!\" and not vote, meaning we're likely to have a Republican in 2024. And they'll be smart. Back to someone not like Trump, and people will go to sleep again, and we'll continue to lose basic human rights.\n\nSo it's not that Trump wasn't horrific - he was. It's that he's not anywhere near to being the actual problem, merely a fluke extra-bad effect that actually harmed Republican plans to destroy our democracy. To focus on Trump as the problem is to be asleep to our loss of democracy.\n\nIdeally, we need to get corporate/oligarch money out of politics again, repair the Democrats, disband the Republicans for their near successful attempt to destroy us… although I don't know how we go about fixing the half of the nation that believes lies.\n\nBasically, we're fucked. So much harder than Trump fucked us.",
          "timestamp": "2022-08-27 19:20:07",
          "score": 3,
          "num_children": 0,
          "author": 409482,
          "replies": []
        }
      ]
    },
    {
      "id": "im1hy39",
      "text": "evidently we can not 'all' agree",
      "timestamp": "2022-08-27 19:46:16",
      "score": 1,
      "num_children": 0,
      "author": 335493,
      "replies": []
    },
    {
      "id": "im1x2cz",
      "text": "Hey there was some good stuff too, i can’t remember but there must have been right?",
      "timestamp": "2022-08-27 21:36:49",
      "score": 1,
      "num_children": 1,
      "author": 353741,
      "replies": [
        {
          "id": "im1xz8b",
          "text": "Only when he was impeached the first time, defeated in the election, impeached the 2nd time and then again when he was tossed out of the White House on Jan 20th.",
          "timestamp": "2022-08-27 21:43:45",
          "score": 3,
          "num_children": 1,
          "author": 219131,
          "replies": [
            {
              "id": "im2mj49",
              "text": "Oh yeah, see, there was some good stuff.",
              "timestamp": "2022-08-28 00:57:17",
              "score": 2,
              "num_children": 0,
              "author": 353741,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "im264vh",
      "text": "I'm sorry that's just dumb.  Of course we can't all agree with that, that's the problem.",
      "timestamp": "2022-08-27 22:45:48",
      "score": 1,
      "num_children": 0,
      "author": 137247,
      "replies": []
    },
    {
      "id": "im2crhh",
      "text": "Nope. It went “great”",
      "timestamp": "2022-08-27 23:38:04",
      "score": 1,
      "num_children": 0,
      "author": 119950,
      "replies": []
    },
    {
      "id": "im2dac0",
      "text": "No, we apparently can not agree because 1/3 of the country wants to give it to him again. 🤪",
      "timestamp": "2022-08-27 23:42:13",
      "score": 1,
      "num_children": 0,
      "author": 85518,
      "replies": []
    },
    {
      "id": "im35drv",
      "text": "Hmm, historically speaking, I'm extremely doubtful. Just consider that a huge percentage of people (around the world) still believe, that selecting an incompetent actor was a great idea, and that he did well, although all the evidence argues against such a conclusion.\n\nThat actor was treasons by supplying the enemy with weapons, and agreeing to demands by terrorists fuelling terror against the US.\n\nCognitive dissonance and wilful ignorance are hugely underrated phenomena.",
      "timestamp": "2022-08-28 03:40:02",
      "score": 1,
      "num_children": 0,
      "author": 391516,
      "replies": []
    },
    {
      "id": "im3t41x",
      "text": "We can. They can’t.",
      "timestamp": "2022-08-28 08:19:20",
      "score": 1,
      "num_children": 0,
      "author": 399628,
      "replies": []
    },
    {
      "id": "im4dnr2",
      "text": "…surprising absolutely no one",
      "timestamp": "2022-08-28 12:41:39",
      "score": 1,
      "num_children": 0,
      "author": 189194,
      "replies": []
    },
    {
      "id": "im4orzu",
      "text": "It worked fine for all the fucking dummies in this country ( united states ) who were quite happy with having someone as dumb as them running things. They don't like to feel stupid so they decided let's elect one of us , someone so fucking dumb that we will understand their elementary school level sentences. It also worked quite fine for all the racist pieces of shit who were more than happy to openly be racist pieces of shit like \"the good old days\" \n\nBasically it worked for all the worst people in our country not the majority of us. \nWe all knew it was gonna be bad prior to him getting elected and unfortunately had to watch as he attempted to do a fascist takeover of the entire government. Fortunately he lost but I'm really really hoping he gets a federal fucking charge for the whole espionage thing and we get to see him in handcuffs or an orange jumpsuit ( would probably go well with his spray tan skin ) \nHe needs to be embarrassed and those who fucking helped him commit treasonous acts need to be removed from their positions and charged as well. We need to weed out the fucking fascists now or things may be worse in just a few years.",
      "timestamp": "2022-08-28 14:15:57",
      "score": 1,
      "num_children": 0,
      "author": 118850,
      "replies": []
    },
    {
      "id": "im09s3m",
      "text": "[removed]",
      "timestamp": "2022-08-27 14:40:46",
      "score": -22,
      "num_children": 2,
      "replies": [
        {
          "id": "im0av16",
          "text": "Incompetence",
          "timestamp": "2022-08-27 14:48:22",
          "score": 21,
          "num_children": 1,
          "author": 219131,
          "replies": [
            {
              "id": "im0bukt",
              "text": "So it should be theoretically possible?   \nCan they block me from posing?   \nMaybe they didnt my showing them transmen and asking them if they really want to use Matt Walshs definition of a woman...",
              "timestamp": "2022-08-27 14:55:19",
              "score": -19,
              "num_children": 3,
              "replies": [
                {
                  "id": "im0csah",
                  "text": "So you're an idiot then.  That's good to know.",
                  "timestamp": "2022-08-27 15:01:57",
                  "score": 17,
                  "num_children": 0,
                  "author": 405532,
                  "replies": []
                },
                {
                  "id": "im0fgob",
                  "text": "They blocked me... Right wing idiots really are snowflakes...",
                  "timestamp": "2022-08-27 15:20:16",
                  "score": -2,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "im0f6ep",
                  "text": ">So youre an ...  then.  That's good to know.\n\nu/californicating what did you want to say?",
                  "timestamp": "2022-08-27 15:18:19",
                  "score": -7,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "im14air",
          "text": "How is this a meme. These are facts about how much of a shitty asshole Trump is. What does it say about you that you’re ok with this?",
          "timestamp": "2022-08-27 18:10:18",
          "score": 3,
          "num_children": 0,
          "author": 182848,
          "replies": []
        }
      ]
    },
    {
      "id": "im0jj8m",
      "text": "Looks like close enough to half of you disagree, though.\n\nEdit. Hey I'm just looking at your election results.",
      "timestamp": "2022-08-27 15:47:43",
      "score": -5,
      "num_children": 0,
      "author": 31002,
      "replies": []
    }
  ]
}