{
  "id": "wzy9ey",
  "text": "No way she is serious\n",
  "timestamp": "2022-08-28 15:32:09",
  "score": 615,
  "subreddit": "t5_2zaj2",
  "num_children": 51,
  "author": 400790,
  "replies": [
    {
      "id": "im57mac",
      "text": "People love to say “all teen boys want to fuck their teachers” and it sounds just like “he was asking for it”",
      "timestamp": "2022-08-28 16:27:37",
      "score": 124,
      "num_children": 5,
      "author": 255707,
      "replies": [
        {
          "id": "im5s25n",
          "text": "I never wanted to fuck any of my teachers.",
          "timestamp": "2022-08-28 18:45:51",
          "score": 50,
          "num_children": 1,
          "author": 100024,
          "replies": [
            {
              "id": "im7fmfr",
              "text": "You had fugly teachers[.](https://i.imgflip.com/6rh3vt.jpg)",
              "timestamp": "2022-08-29 02:08:21",
              "score": 9,
              "num_children": 1,
              "author": 211250,
              "replies": [
                {
                  "id": "im9x7jk",
                  "text": "Thats highly untrue, i bet today i would want that",
                  "timestamp": "2022-08-29 16:42:22",
                  "score": 3,
                  "num_children": 0,
                  "author": 100024,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "im6s49l",
          "text": "I was 15 when a 23 year old took my virginity. \n\nI was playing fucking HALO leading up to her doing it. I didn't want to but I recall her insisting it's what a \"man would do\" and if I \"wanted to be a man\" this is how I'd do it. And to trust her. \n\nAlways felt pretty fucked up about my relationships with women after that.\n\n\nI was playing Halo. I wasn't asking 23 year old to groom me for sex. \n\nWeird how quickly feminists want to silence things like this when it detracts from their alleged victimhood.",
          "timestamp": "2022-08-28 23:01:19",
          "score": 50,
          "num_children": 1,
          "author": 1716,
          "replies": [
            {
              "id": "im7f2g5",
              "text": "YOU got raped. The stance of this sub reddit though is that even if you said yes it would have been rape because you're stupid and don't know what you want.",
              "timestamp": "2022-08-29 02:03:54",
              "score": 15,
              "num_children": 2,
              "author": 211250,
              "replies": [
                {
                  "id": "im7zdlp",
                  "text": "I smell a power dynamic feminists decline it exists",
                  "timestamp": "2022-08-29 05:11:47",
                  "score": 7,
                  "num_children": 0,
                  "author": 367302,
                  "replies": []
                },
                {
                  "id": "im82t2s",
                  "text": "To be fair a fifteen year shouldn't know what they want - sexually. \n\nBut yeah most people I actually opened up to in the past (since I actually felt ashamed in the long run) guys and even guys who should have been caring friends would usually tell me to shut up, I got \"lucky\". They'd apparently totally kill to have had that happen to them.",
                  "timestamp": "2022-08-29 05:52:03",
                  "score": 4,
                  "num_children": 2,
                  "author": 1716,
                  "replies": [
                    {
                      "id": "im8jq7m",
                      "text": "\"A fifteen year old should know\"\nI will stop you here. A fifteen year old doesn't know how it fucks them up long term. Your brain doesn't finnish it's development until your late 20's. Some boys think it's a good idea to stick their dicks into tree trunks. They are dumb af just like teenage girls are dumb as shit. All children deserve to be protected. Not to mention that manipulation is a thing, and kids are much likely to be manipulated.",
                      "timestamp": "2022-08-29 09:49:12",
                      "score": 7,
                      "num_children": 1,
                      "author": 330647,
                      "replies": [
                        {
                          "id": "im8m3hg",
                          "text": "Dude, he said shouldn't",
                          "timestamp": "2022-08-29 10:21:14",
                          "score": 6,
                          "num_children": 1,
                          "author": 106259,
                          "replies": [
                            {
                              "id": "im8rzde",
                              "text": "Ohh- sorry",
                              "timestamp": "2022-08-29 11:30:09",
                              "score": 4,
                              "num_children": 1,
                              "author": 330647,
                              "replies": [
                                {
                                  "id": "im8uwep",
                                  "text": "It's not me u should be apologising to, but it's grand, it was just a misunderstanding",
                                  "timestamp": "2022-08-29 11:59:44",
                                  "score": 3,
                                  "num_children": 0,
                                  "author": 106259,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ipcstqj",
                      "text": "They should explore safely with other people their own age if they really want to become active, and even then, they should really have an adult they trust around them to be able to talk about it and be sure it's not done in an unhealthy way",
                      "timestamp": "2022-09-21 17:13:34",
                      "score": 1,
                      "num_children": 0,
                      "author": 57569,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "im7hwg5",
          "text": "It’s weird how we treat teen girls as so divergent from teen males. People can’t conceive that (some of) these girls want to bone an attractive male teacher. They do. I knew a lot of girls in high school that had (non-teacher) boyfriends in their early to late 20s. It’s universally and equally wrong for any teacher to take advantage of a student like that.",
          "timestamp": "2022-08-29 02:26:44",
          "score": 13,
          "num_children": 2,
          "author": 226658,
          "replies": [
            {
              "id": "im8fgkj",
              "text": "Yeah, there was a post years ago asking about this sort of thing and lots of male teachers told stories about inappropriate affection from teenaged girls. Some of these girls can be really aggressive about it too.\n\nWhen I was a teenager I lived down the road from an all girls school. They were having some construction work done and as it turns out one of the builders was very attractive. The poor guy got sexually harassed by the students constantly, to the point that he had to transfer to another jobsite. Every day hordes of girls would catcall him from the perimeter fence and ask for his number.",
              "timestamp": "2022-08-29 08:47:51",
              "score": 11,
              "num_children": 1,
              "author": 23473,
              "replies": [
                {
                  "id": "im9brxo",
                  "text": "Yep I went to an all girls school, can confirm the sexual frustration is real",
                  "timestamp": "2022-08-29 14:17:09",
                  "score": 7,
                  "num_children": 0,
                  "author": 216418,
                  "replies": []
                }
              ]
            },
            {
              "id": "inhpx03",
              "text": "When i was 15 i read articles in teen magazines o line with headlines like \"why girls want a college boyfriend and why it totally okay\" or \"how to get an 20 yr old boy as a 15 yr old\". \n\nI was grossed out beyond believe, i didn't understand why someone would want to date an adult. Sure, i had posters of celebrities who were 18+ and thought they were attractive but in no way would i date someone so much older. It was so weird to me. \n\nThen i grew up and I'm now 27 and i still don't get it. I don't understand why magazines and others were encouraging girls to let them be taken advantage off by adults. Why people were trying to get it normalized. \n\nNow i get it. It's not girls. It's not boys. It's children. They are easy to manipulate. Girls are told to get a cool 18 yr old bf so when the 25yr substitute teacher tries to groom her, she'll think it's normal and all the cool girlz do it.\nBoys are told that wanting to do your 30 yr old female gym teacher is normal because hormones and she is hot so when the gym teacher does Rey to force herself onto him, he'll think that he is lucky and that any guy would kill to be in his place.\n\nIt's sick and gross and needs to stop.",
              "timestamp": "2022-09-07 19:35:59",
              "score": 3,
              "num_children": 0,
              "author": 231375,
              "replies": []
            }
          ]
        },
        {
          "id": "im8jg20",
          "text": "Well most toddlers want to run away from home or dumpster dive, but that doesn't mean you should let them. It's the adult's responsibility to not violate a child. That boy probably still eats his boogers lmao. It's immoral exactly because there IS a power dynamic. Not only is the teacher in a position of authority/caretaker role, but she is also SIGNIFICANTLY older. The sad truth is that teenagers are easy to manipulate. It's your responsibility as a grown ass adult to not traumatizethe poor child for life. Even if the boy \"asked\" for it, it would make little to no difference.",
          "timestamp": "2022-08-29 09:45:17",
          "score": 3,
          "num_children": 0,
          "author": 330647,
          "replies": []
        },
        {
          "id": "in6acz8",
          "text": "People in general still follow the notion that men “only want to get laid” and it’s sexist as",
          "timestamp": "2022-09-05 12:03:11",
          "score": 1,
          "num_children": 0,
          "author": 279984,
          "replies": []
        }
      ]
    },
    {
      "id": "im5fiiw",
      "text": "Ask her if she thinks the “power dynamic” was the same if they were both hit with Rohypnol before the rape. \n\nI REALLY want to see her response",
      "timestamp": "2022-08-28 17:20:10",
      "score": 28,
      "num_children": 1,
      "author": 348777,
      "replies": [
        {
          "id": "im7f96c",
          "text": "How would that even work? Pretty hard to rape someone when you're barely conscious.",
          "timestamp": "2022-08-29 02:05:22",
          "score": 6,
          "num_children": 0,
          "author": 211250,
          "replies": []
        }
      ]
    },
    {
      "id": "im57555",
      "text": "Just gotta love the constant discrediting of male experiences.  Apparently we suffer only a fraction of mental stress as women.",
      "timestamp": "2022-08-28 16:24:21",
      "score": 58,
      "num_children": 2,
      "replies": [
        {
          "id": "im5a00q",
          "text": "Man gets raped. Women most affected",
          "timestamp": "2022-08-28 16:43:14",
          "score": 43,
          "num_children": 1,
          "author": 126225,
          "replies": [
            {
              "id": "im63zdj",
              "text": "Man gets raped women gets trauma and man gets arrested for 10 years",
              "timestamp": "2022-08-28 20:08:35",
              "score": 24,
              "num_children": 0,
              "author": 9280,
              "replies": []
            }
          ]
        },
        {
          "id": "im7i1ew",
          "text": "All evidence to the contrary, lol.",
          "timestamp": "2022-08-29 02:27:53",
          "score": 1,
          "num_children": 0,
          "author": 226658,
          "replies": []
        }
      ]
    },
    {
      "id": "im57gpx",
      "text": "This is horrible. Being male doesn't mean you can't be violated, where is her humanity? Physical damage is a thing, but so is psychological damage. \n\nThis has the same energy as \"white people can't face racism\". This type of thinking needs to stop. Hate is hate, and a crime is a crime, period.",
      "timestamp": "2022-08-28 16:26:33",
      "score": 71,
      "num_children": 1,
      "author": 314985,
      "replies": [
        {
          "id": "im5wlve",
          "text": "Feminists have no humanity",
          "timestamp": "2022-08-28 19:17:10",
          "score": 59,
          "num_children": 1,
          "author": 224697,
          "replies": [
            {
              "id": "im7mvi8",
              "text": "She's not feminist",
              "timestamp": "2022-08-29 03:08:51",
              "score": -9,
              "num_children": 3,
              "author": 61249,
              "replies": [
                {
                  "id": "im8dkgm",
                  "text": "Yeah she's just an idiot",
                  "timestamp": "2022-08-29 08:20:03",
                  "score": 6,
                  "num_children": 0,
                  "author": 287753,
                  "replies": []
                },
                {
                  "id": "im8r5n7",
                  "text": "Why would you imagine she isn't a feminist?",
                  "timestamp": "2022-08-29 11:21:15",
                  "score": 6,
                  "num_children": 1,
                  "author": 224697,
                  "replies": [
                    {
                      "id": "im9folm",
                      "text": "...because she said so ?",
                      "timestamp": "2022-08-29 14:44:27",
                      "score": 0,
                      "num_children": 1,
                      "author": 61249,
                      "replies": [
                        {
                          "id": "im9tucv",
                          "text": "All women are feminists when it benefits them.",
                          "timestamp": "2022-08-29 16:20:16",
                          "score": 4,
                          "num_children": 1,
                          "author": 224697,
                          "replies": [
                            {
                              "id": "im9uxqn",
                              "text": "...not how it works ?",
                              "timestamp": "2022-08-29 16:27:25",
                              "score": 0,
                              "num_children": 1,
                              "author": 61249,
                              "replies": [
                                {
                                  "id": "ima2oeq",
                                  "text": "Exactly how it works.\nDon't be naive.",
                                  "timestamp": "2022-08-29 17:17:57",
                                  "score": 4,
                                  "num_children": 0,
                                  "author": 224697,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "im8hapy",
                  "text": "Say all feminists when trying to persuade you into believing them.",
                  "timestamp": "2022-08-29 09:14:32",
                  "score": 3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "im8pbo9",
                      "text": "I'm just pointing out the fact that she said herself that she wasn't a feminist",
                      "timestamp": "2022-08-29 11:00:42",
                      "score": 2,
                      "num_children": 1,
                      "author": 61249,
                      "replies": [
                        {
                          "id": "im8xmsi",
                          "text": "Yes, her statement sounded very “I’m not a racist, but…*followed by a racist rant*\n\nOr “I’m not sexist, but…*followed by sexist rant*",
                          "timestamp": "2022-08-29 12:25:23",
                          "score": 8,
                          "num_children": 1,
                          "author": 409206,
                          "replies": [
                            {
                              "id": "im9fyuu",
                              "text": "hmm what she said was indeed sexist 🤔\n\nNo matter which gender gets more sexually assaulted than the other, it's an equally big deal in both cases",
                              "timestamp": "2022-08-29 14:46:22",
                              "score": 3,
                              "num_children": 0,
                              "author": 61249,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "im5rja3",
      "text": "There is one point they're forgetting. There **is** a power dynamic/difference here.\n\nShe's his teacher. If he refused or fought back, she can land him in serious trouble.\n\nHell every woman has this power now. One false accusation, even if baseless and was rejected, causes so much distress and damage it can even cause PTSD and life-long mistrust of the opposite sex in the victim. So they have to comply, because they have a choice:\n\n1. Have sex (get raped, given that he has no effective choice) and deal with that internally, or\n2. Have your entire life and reputation up-ended and flipped upside down in the dirtiest pile of shit there is in the land.\n\nEither way, the moment a woman sets her eyes on you, you're done for. Regardless of anything and everything you've done. You'll need Johnny Depp's level of fame and wealth to fight back (and even that's not certain).",
      "timestamp": "2022-08-28 18:42:14",
      "score": 44,
      "num_children": 1,
      "author": 347422,
      "replies": [
        {
          "id": "im6k6mg",
          "text": "> One false accusation,\n\nBut those never happen.  I mean, come on.  Just because women have the systematic and legal ability to literally crush a man with nothing but some well placed rumors, it's not like they do.  So it shouldn't matter.  In fact, if you consider false accusations a problem then you're just another one of them.  You're the problem.  Not us that are trying to further errod the right to due process.\n\n/s",
          "timestamp": "2022-08-28 22:02:15",
          "score": 15,
          "num_children": 1,
          "author": 68721,
          "replies": [
            {
              "id": "im6lwwm",
              "text": "Yeah. You believe false accusations even exist? Why would **any** woman ever lie about being raped?!\n\n/s",
              "timestamp": "2022-08-28 22:14:52",
              "score": 15,
              "num_children": 0,
              "author": 347422,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "im5doid",
      "text": "\"If you are actually serious I have lost all hope in humanity\".. maybe your mistake here was having any hope at all.",
      "timestamp": "2022-08-28 17:07:42",
      "score": 12,
      "num_children": 0,
      "author": 281170,
      "replies": []
    },
    {
      "id": "im5f8ic",
      "text": "It’s because she legitimately believes that men cannot be victims",
      "timestamp": "2022-08-28 17:18:18",
      "score": 14,
      "num_children": 0,
      "author": 72860,
      "replies": []
    },
    {
      "id": "im5j2wg",
      "text": "Victimhood monopoly.",
      "timestamp": "2022-08-28 17:44:39",
      "score": 12,
      "num_children": 0,
      "author": 278275,
      "replies": []
    },
    {
      "id": "im5mjnj",
      "text": "She may not adhere so closely to the idea of equality (she calls it feminism because the media portrays feminism as equality), but she does clearly adhere to the idea of the misandrist agenda. Anyone who tries to say that rape is not rape is a rapist.",
      "timestamp": "2022-08-28 18:08:04",
      "score": 11,
      "num_children": 1,
      "author": 348859,
      "replies": [
        {
          "id": "im7ez6o",
          "text": "they just said they weren't feminist\n\nedit, didn't see the second part",
          "timestamp": "2022-08-29 02:03:11",
          "score": 1,
          "num_children": 1,
          "author": 212799,
          "replies": [
            {
              "id": "im95btc",
              "text": "A lot of people who aren’t feminist are still sucked into the misandrist agenda by mass media and things.",
              "timestamp": "2022-08-29 13:29:14",
              "score": 3,
              "num_children": 1,
              "author": 348859,
              "replies": [
                {
                  "id": "im9duad",
                  "text": "my personal theory is that the guy that wasn't a feminist is some horny loser that doesn't understand the trauma suffered during or after rape.\n\nI see too many guys that think getting raped is fun and that have fantasies of their teachers raping them which is disgusting. \n\nbut there are also misandrists that genuinely believe that nothing bad could happen to men because they are men (which is also stupid)",
                  "timestamp": "2022-08-29 14:31:39",
                  "score": 1,
                  "num_children": 0,
                  "author": 212799,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "im54ol9",
      "text": "Anyone can be raped, no one is safe against it. A 6 foot 2 inch 225 lb man can be raped by a 125 pound woman.",
      "timestamp": "2022-08-28 16:07:51",
      "score": 25,
      "num_children": 0,
      "author": 172882,
      "replies": []
    },
    {
      "id": "im68j7g",
      "text": "I'm not a feminist at all but...\n\nI'm not racist at all but....\n\nI'm not sexist at all but...",
      "timestamp": "2022-08-28 20:40:11",
      "score": 11,
      "num_children": 0,
      "author": 191113,
      "replies": []
    },
    {
      "id": "im67ohf",
      "text": "\"I just wanna talk to him\"\n\n-Peter Griffin",
      "timestamp": "2022-08-28 20:34:12",
      "score": 6,
      "num_children": 1,
      "author": 32714,
      "replies": [
        {
          "id": "im6zcfg",
          "text": "Yet if we were to do that we would be called monsters and tossed in jail the rest of our lives. But if they did well now it’s different with the current kind of society.",
          "timestamp": "2022-08-28 23:57:47",
          "score": 4,
          "num_children": 0,
          "author": 136176,
          "replies": []
        }
      ]
    },
    {
      "id": "im78h9w",
      "text": "Lol so it’s literally the “stop bitching, you know you loved it” argument… 🙄🙄🙄",
      "timestamp": "2022-08-29 01:10:38",
      "score": 8,
      "num_children": 0,
      "author": 196510,
      "replies": []
    },
    {
      "id": "im5fisa",
      "text": "What the writer is short sighted of is the fact that men are physically stronger and women coerce emotionally and mentally.  A woman can bully a man into having sex with her in any number of ways using head games.",
      "timestamp": "2022-08-28 17:20:12",
      "score": 18,
      "num_children": 2,
      "author": 157316,
      "replies": [
        {
          "id": "im61vmr",
          "text": "Or just saying she will run to the cops lying that he raped her.",
          "timestamp": "2022-08-28 19:54:00",
          "score": 16,
          "num_children": 1,
          "author": 321843,
          "replies": [
            {
              "id": "im64kaq",
              "text": "Or she could drug him",
              "timestamp": "2022-08-28 20:12:39",
              "score": 13,
              "num_children": 0,
              "author": 9280,
              "replies": []
            }
          ]
        },
        {
          "id": "im7f5a8",
          "text": "especially when the person has authority over them, like a teacher",
          "timestamp": "2022-08-29 02:04:31",
          "score": 4,
          "num_children": 0,
          "author": 212799,
          "replies": []
        }
      ]
    },
    {
      "id": "im6cdo8",
      "text": "How to say your a masandrist without saying your a masandrist",
      "timestamp": "2022-08-28 21:07:02",
      "score": 5,
      "num_children": 1,
      "author": 242763,
      "replies": [
        {
          "id": "im6cfh9",
          "text": "*misandtist* I mean",
          "timestamp": "2022-08-28 21:07:23",
          "score": 3,
          "num_children": 1,
          "author": 242763,
          "replies": [
            {
              "id": "im88oxn",
              "text": "[removed]",
              "timestamp": "2022-08-29 07:09:27",
              "score": 2,
              "num_children": 2,
              "replies": [
                {
                  "id": "imb1r6f",
                  "text": "Misandrist is a word everyone needs to learn imo. The fact everyone knows what misogyny is but not misandry says it all",
                  "timestamp": "2022-08-29 21:20:57",
                  "score": 3,
                  "num_children": 1,
                  "author": 374447,
                  "replies": [
                    {
                      "id": "immt6u7",
                      "text": "I didn't know that word existed until recently. Always heard of mysogny, and sexism apparently was for women only",
                      "timestamp": "2022-09-01 08:01:14",
                      "score": 2,
                      "num_children": 0,
                      "author": 19811,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "im8swe5",
                  "text": "It's misogynist but for men",
                  "timestamp": "2022-08-29 11:39:45",
                  "score": 2,
                  "num_children": 1,
                  "author": 242763,
                  "replies": [
                    {
                      "id": "imcy2z7",
                      "text": "Best comment thread of 2022",
                      "timestamp": "2022-08-30 07:25:38",
                      "score": 2,
                      "num_children": 0,
                      "author": 297529,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "im6rl5z",
      "text": "\"The only way a man can rape a woman is through her front hole which she pees from.\"\n\nSo it's totally acceptable then? Gotcha.",
      "timestamp": "2022-08-28 22:57:20",
      "score": 5,
      "num_children": 0,
      "author": 1716,
      "replies": []
    },
    {
      "id": "im5axwq",
      "text": "i just want to punch a hole in a wall when i hear these psuedo-intellectuals using the words \"RaBbbIT hOlE\" \"PiPELiNE\" but sure, how dare we think rape can happen to anyone us, right wing reactionary chuds. we need to be \"BreAd-pILlEd\" by these \"enlightened\" individuals.",
      "timestamp": "2022-08-28 16:49:21",
      "score": 14,
      "num_children": 0,
      "author": 216075,
      "replies": []
    },
    {
      "id": "im6txmj",
      "text": "So yeah, the thing these insane Feminists don't understand about trauma is that it's completely subjective and based on the person's own psychology.\n\n2 different people could have the exact same experience and for one person it would be traumatic and the other person would be having the time of their life.\n\nDifferences in size, strength, power, etc. are irrelevant because trauma is a personal thing, based on one's discomfort or horror over a certain experience.",
      "timestamp": "2022-08-28 23:15:25",
      "score": 5,
      "num_children": 0,
      "author": 304941,
      "replies": []
    },
    {
      "id": "im5tphy",
      "text": "Imagine using the same logic on some gay dude after being \"forced\" by some \"popular\" and \"good looking\" female teacher. \n\nImagine if some male idol who's a huge narcissist and is really popular with girls and women uses the same excuse to rape women, saying that \"it's enjoyable experience for them\".\n\nIt's funny how after saying such stuff these women wonder why no man with self-respect supports them and their cause and doesn't even want to be even 50ft near them",
      "timestamp": "2022-08-28 18:57:11",
      "score": 4,
      "num_children": 0,
      "author": 185666,
      "replies": []
    },
    {
      "id": "im6j3b2",
      "text": "Female = victim\n\nMale = Deal with it pussy",
      "timestamp": "2022-08-28 21:54:26",
      "score": 8,
      "num_children": 0,
      "author": 312363,
      "replies": []
    },
    {
      "id": "im58t6a",
      "text": "I have actually wondered about this, and I apologize for my ignorance - if someone touches or goes down on a man and he becomes hard, can that feel uncomfortable/bad? Just wondering because, as a woman, I can only get aroused if something feels good and I am comfortable with the person. I don't mean to imply that rape/sexual assault against men isn't real or important because it VERY MUCH IS. My ex was raped when he was five and it changed his life forever. Just an ignorant woman looking for some info.",
      "timestamp": "2022-08-28 16:35:25",
      "score": 10,
      "num_children": 6,
      "author": 240878,
      "replies": [
        {
          "id": "im59ji2",
          "text": "I may not know how this works in women but in men, it's not always in our control on when we get a boner. I've also read that few women orgasm during rape & that doesn't mean they actually like it.",
          "timestamp": "2022-08-28 16:40:17",
          "score": 18,
          "num_children": 2,
          "author": 209007,
          "replies": [
            {
              "id": "im5be8t",
              "text": "Correct!\n\nJust like you dont always control when you get a boner, sometimes we can't help when we get wet. I do all the time, and it BUgS me because it isnt thr time nor place. (Doesn't soak anything, just have a feeling and can sometimes feel it. ><) \n\nWhen it comes to rape the body says \"oh! We like this! HORMONES DO YOUR THING!\" While the brain tries to stop it. But, as like shown in puberty, hormones trump everything. Women can orgasm, and get super wet. Its why some people think women like it, because the body obviously \"wants it\" since its getting ready, despite what the person feels.\n\nI feel like it's rhe same with men, where hormones say \"Oh touching! BLOOD FLOW AND HORMONES GO\" while the person doesn't want it themselves. \nAgain, woman, have no idea. Im taking from what I've heard from men. 😅 but if im wrong by all means let me know! I wanna learn!\nIm all for helping others understand :)",
              "timestamp": "2022-08-28 16:52:24",
              "score": 10,
              "num_children": 1,
              "author": 339707,
              "replies": [
                {
                  "id": "im5k2ns",
                  "text": "You would be correct, except that it isn’t just about hormones. You can be not at all aroused as a man and due to something like blood pressure still have an erection. But yes, hormones still play a huge role.\n\nThat’s what causes morning wood, blood pressure. Do you know how if someone is punched in the liver they fall into the fetal position? That’s because laying down like that makes it easier for the body to build blood pressure, and being punched in the liver lowers your blood pressure.",
                  "timestamp": "2022-08-28 17:51:23",
                  "score": 8,
                  "num_children": 1,
                  "author": 266807,
                  "replies": [
                    {
                      "id": "im5n38s",
                      "text": "Thanks!\n\nI actually didn't know that, thanks for explaining!\n\nI knew blood pressure is huge, I am on some tjag lower it to help me sleep and *my god* is it horrible otherwise. 😓 i feel for people \nBut this makes a lot more sense!",
                      "timestamp": "2022-08-28 18:11:44",
                      "score": 4,
                      "num_children": 1,
                      "author": 339707,
                      "replies": [
                        {
                          "id": "im62mdz",
                          "text": "It is even 'worse' then that, the so called 'morning wood' is part of the male sleep-cycle.",
                          "timestamp": "2022-08-28 19:59:08",
                          "score": 4,
                          "num_children": 1,
                          "author": 212414,
                          "replies": [
                            {
                              "id": "im62w5m",
                              "text": "D: I would hate that so much. \n\nI've noticed it with my fiance and he mentions it sucks, I vant imagine having jt!",
                              "timestamp": "2022-08-28 20:01:02",
                              "score": 4,
                              "num_children": 0,
                              "author": 339707,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "im59wbe",
              "text": "Wow, it is so hard for me to imagine orgasming while being raped, it kind of makes me sick to think about. Thank you for informing me!",
              "timestamp": "2022-08-28 16:42:36",
              "score": 8,
              "num_children": 1,
              "author": 240878,
              "replies": [
                {
                  "id": "im5itft",
                  "text": "The female equivalent is to become lubricated. It's an uncontrollable biological thing.\n\nSadly, Women often feel shamed by this involuntary reaction and it's 'part' of the horror of being a victim.",
                  "timestamp": "2022-08-28 17:42:49",
                  "score": 5,
                  "num_children": 1,
                  "author": 237689,
                  "replies": [
                    {
                      "id": "im5tnjd",
                      "text": "crazily something used to justify the rape of men, when it seems pretty easy for people to still have sympathy for a woman in such a situation",
                      "timestamp": "2022-08-28 18:56:50",
                      "score": 4,
                      "num_children": 0,
                      "author": 48611,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "im5auai",
          "text": "I would say yes.\n\nNow I am a woman, so take anything I say with a grain of salt, but I have heard from men and women about this. \n\nWhen it comes to sexual assault/rape, the body itself knows \"Oh! Im being touched in a place that feels good. Let's hype up the hormones! GET BLOOD FLOW!\" While the brain goes \"WAIT WAIT STOP NO I DONT WANT THIS\". Hormones take over and the body 'acts in arousal' while the person doesn't like it.\n\nExample:\nA woman gets touched down below, gets wet regardless if she likes it right? Because hormones and body says \"we like!\" \n\nSame with a man (I've heard, again woman), they get blood flow to it because \"oh touching!\" Regardless if they want it.\n\nThink about puberty. They get blood flow REGARDLESS of what they are thinking/doing. It just happens. Their mind says \"this is a horrible time\" but body says \"RAGING HORMONES\". Hormones take over brain. \n\nDoes this make sense? 🙂 🤔 I genuinely wanna help, as I was curious too. I've asked my fiance and other males about things I personally don't know, and have read others experiences with horrible things (assault/rape), and this seems to be the consensus. (The last sentence not the whole thing. Where hormones do what they want and the brain tries to fight it)",
          "timestamp": "2022-08-28 16:48:42",
          "score": 4,
          "num_children": 2,
          "author": 339707,
          "replies": [
            {
              "id": "im5jr5p",
              "text": "It's not even necessarily \"I don't like this\". It should be if I don't 'want' this.\n\nErect or lubricated should never ever be used to somehow prove they 'liked' it and therefore must have wanted it.\n\nEDIT: It's so fkn despicable when they do this!",
              "timestamp": "2022-08-28 17:49:14",
              "score": 6,
              "num_children": 1,
              "author": 237689,
              "replies": [
                {
                  "id": "im5nfnv",
                  "text": "Right, ill fix the first oart\n\nAnd I agree! But it is the argument I've seen from both sides. A post was taken down from another reddit because a boy was raped, yet was hard.\n\nThe mods said he wanted it, therefore it wasn't rape and belittled him. I was SO MAD when I found out they deleted and banned him. (Found on nother reddit) \nSome people even LAUGH when a man says they are raped.\n\nI have heard \"oh the women was wet therefore they like it\" many times. I also advocate and explain how that is never right. That was just an example from this morning.",
                  "timestamp": "2022-08-28 18:14:06",
                  "score": 4,
                  "num_children": 1,
                  "author": 339707,
                  "replies": [
                    {
                      "id": "im5o7iq",
                      "text": "Thanks, I realised I left a bit out of my comment when I came to read yours... \n\nIt annoys the crap outa me too.",
                      "timestamp": "2022-08-28 18:19:22",
                      "score": 3,
                      "num_children": 0,
                      "author": 237689,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "im5bo87",
              "text": "Mer I definitely do not get aroused/wet if my brain doesn't like what's happening, but maybe I am weird in that regard. But I can definitely see a pubescent dude being like, oh no, boner! I appreciate your perspective!",
              "timestamp": "2022-08-28 16:54:15",
              "score": 2,
              "num_children": 2,
              "author": 240878,
              "replies": [
                {
                  "id": "im5bzd6",
                  "text": "Different for everyone!\n\nAs I mentioned I get this from multiple people. 😂\nI'm kinda rhe same? I also get aroused at random times thanks to BC. \nBut of course! I try to help by seeing both sides, and being a woman I dont get to experience the male.side, so I ask a TON of questions. \n\nNot everyone does, so I always try to help!",
                  "timestamp": "2022-08-28 16:56:18",
                  "score": 3,
                  "num_children": 0,
                  "author": 339707,
                  "replies": []
                },
                {
                  "id": "im8guz7",
                  "text": "I hope you never have, nor ever will, get anywhere near actually finding out.",
                  "timestamp": "2022-08-29 09:08:09",
                  "score": 2,
                  "num_children": 0,
                  "author": 237689,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "im5hew1",
          "text": "In most cases, erection is an involuntary reaction. Even if we don’t want to have sex, or even if we are being sexually harassed, we can still get a bonner despite not wanting anything to do with that situation for x or n reasons.",
          "timestamp": "2022-08-28 17:33:12",
          "score": 2,
          "num_children": 0,
          "author": 140672,
          "replies": []
        },
        {
          "id": "im5tf5n",
          "text": "Its an instinct after all you know? Nature said \"make kids\" and that was a very general request, so the human male body doesnt always realise when its time and when its not. Our brain however, with it's emotions and conscious thinking, is not always in sync with that (and for a good reason). My knowledge over all that is very limited tho, that is simply my humble understanding over the subject (as a male).",
          "timestamp": "2022-08-28 18:55:15",
          "score": 2,
          "num_children": 0,
          "author": 100024,
          "replies": []
        },
        {
          "id": "im5ukii",
          "text": "There are 3 \"level's\" to being aroused to me. Physical, emotional, and mental. I can be physically aroused, but neither of the other two, which means I can still have sex, but I won't be into it. I have been emotionally and mentally aroused but the little man just stays down.  And on the worst side of it I had been forced at one point, and the physical stimulation was there. I just let it happen because somehow she was stronger than me. When she finished she hopped off, cleaned me up and left.",
          "timestamp": "2022-08-28 19:03:03",
          "score": 2,
          "num_children": 0,
          "author": 362550,
          "replies": []
        },
        {
          "id": "im5u9kt",
          "text": "I have read many women orgasm during rape. Does that mean that they actually enjoy the experience? I would like to first know your answer on this",
          "timestamp": "2022-08-28 19:00:58",
          "score": 2,
          "num_children": 0,
          "author": 185666,
          "replies": []
        }
      ]
    },
    {
      "id": "im62kyb",
      "text": "lol, posted on our very own subreddit",
      "timestamp": "2022-08-28 19:58:52",
      "score": 3,
      "num_children": 0,
      "author": 40076,
      "replies": []
    },
    {
      "id": "im6hyd5",
      "text": "The trauma may not be immediate for the teenage boy. They might think what happened to them is a good thing but when they become an adult they will start to feel it. To say that a man wouldn’t feel trauma in this situation is stupid.",
      "timestamp": "2022-08-28 21:46:21",
      "score": 3,
      "num_children": 0,
      "author": 293305,
      "replies": []
    },
    {
      "id": "im6on3t",
      "text": "But female teacher is person in power, so there is power dynamic. Thats why even if it will be young teacher with her student who is 18, by law it will be a rape even if this sex was consensual, same with boss-employe situation. But ofc if men are holding \"power\" they will use for their advantage, but if women will do this she still will be victim",
      "timestamp": "2022-08-28 22:35:09",
      "score": 3,
      "num_children": 0,
      "author": 204222,
      "replies": []
    },
    {
      "id": "im6y8mz",
      "text": "I’m starting to save any image of conversations or articles showing this crap. Given enough I will make increasingly long videos showcasing these things so people can know just how much is out there.",
      "timestamp": "2022-08-28 23:48:56",
      "score": 3,
      "num_children": 1,
      "author": 136176,
      "replies": [
        {
          "id": "im6zw21",
          "text": "You can just make specific feminist ones.\n\nYou know Marry P. Koss claiming it should be classified as unwanted touching.",
          "timestamp": "2022-08-29 00:02:14",
          "score": 3,
          "num_children": 1,
          "author": 180640,
          "replies": [
            {
              "id": "im706ke",
              "text": "Yikes, I’ll look into stuff like that as well. My main goal is to collect very current examples of the news and people in the general public saying this stuff to show that this crap has become an actual problem that should not and cannot be ignored.",
              "timestamp": "2022-08-29 00:04:31",
              "score": 1,
              "num_children": 0,
              "author": 136176,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "im7ib37",
      "text": "I literally had someone reply to me in this very subreddit saying that being raped is a woman is worse than as a man. As someone who hasn’t been raped and has only been male all their life I don’t feel like I’m inclined to say whether it’s true or not, but I will say that it’s foolish to compare trauma and we should all just collectively agree that rape is bad.",
      "timestamp": "2022-08-29 02:30:07",
      "score": 3,
      "num_children": 0,
      "author": 352347,
      "replies": []
    },
    {
      "id": "im7phk6",
      "text": "Oh my God, it is a worse version of me from eleven years ago.\n\nThe only difference is that I WAS a feminist and did see a female teacher raping a male pupil is just as bad and traumatic as the reverse.\n\nFingers crossed she will learn before it is too late, unlike me...",
      "timestamp": "2022-08-29 03:31:58",
      "score": 3,
      "num_children": 0,
      "author": 183693,
      "replies": []
    },
    {
      "id": "im7tqt3",
      "text": "Power is with the female, *always*. \n\nThat word for unwanted penetration has no place in a conversation about minors who consent.",
      "timestamp": "2022-08-29 04:12:09",
      "score": 3,
      "num_children": 0,
      "author": 139463,
      "replies": []
    },
    {
      "id": "im8h3l9",
      "text": "Trauma wise, it's literally the same.",
      "timestamp": "2022-08-29 09:11:38",
      "score": 3,
      "num_children": 0,
      "author": 186356,
      "replies": []
    },
    {
      "id": "im5vu5b",
      "text": "Honestly.. she is stupid, and she should feel stupid, share the link OP.. \n\nAnd no i never wanted to fuck a teacher, they were old/fat/ugly or all of the above.. these females think the milf fetish is so prevalent among younger people.. lol.. get your head out of the sand we know you have close to no value for most guys past 30-35 and young students are no exception, this is RAPE!",
      "timestamp": "2022-08-28 19:11:49",
      "score": 5,
      "num_children": 1,
      "author": 70446,
      "replies": [
        {
          "id": "im75c7n",
          "text": "Sort by controversial on the post I made about the 13 year old boy raped by his teacher. It should be there.",
          "timestamp": "2022-08-29 00:45:36",
          "score": 1,
          "num_children": 0,
          "author": 400790,
          "replies": []
        }
      ]
    },
    {
      "id": "im6lxwi",
      "text": "“i believe all sex outside of marriage is immoral” tells you everything you need to know",
      "timestamp": "2022-08-28 22:15:04",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "im5jmp0",
      "text": "well I have very less expectations from them yet they surprise me",
      "timestamp": "2022-08-28 17:48:25",
      "score": 2,
      "num_children": 0,
      "author": 186019,
      "replies": []
    },
    {
      "id": "im5zvx0",
      "text": "Jesus do they want equality or not??",
      "timestamp": "2022-08-28 19:40:04",
      "score": 2,
      "num_children": 0,
      "author": 91386,
      "replies": []
    },
    {
      "id": "im61ds4",
      "text": "Inadvertently admitted that men and women are different.",
      "timestamp": "2022-08-28 19:50:32",
      "score": 2,
      "num_children": 0,
      "author": 402485,
      "replies": []
    },
    {
      "id": "im6ny0s",
      "text": "She's so ignorant. You can tell she didn't learn empathy as a child. She's struggling.",
      "timestamp": "2022-08-28 22:29:56",
      "score": 2,
      "num_children": 0,
      "author": 384803,
      "replies": []
    },
    {
      "id": "im85jz1",
      "text": "See!! This is precisely why medical professionals strongly recommend not to use drugs during pregnancies. \n\nThis can happen to your child L̶a̶d̶i̶e̶s̶ ̶&̶ ̶G̶e̶n̶t̶l̶e̶m̶e̶n̶ ̶ my fellow Carbon based lifeforms. Say no to drugs.",
      "timestamp": "2022-08-29 06:26:53",
      "score": 2,
      "num_children": 0,
      "author": 34965,
      "replies": []
    },
    {
      "id": "im85mb8",
      "text": "Rape is rape. \n\nOnly when people stop seeing it as such will others fail to see the gravity of it.",
      "timestamp": "2022-08-29 06:27:47",
      "score": 2,
      "num_children": 0,
      "author": 22156,
      "replies": []
    },
    {
      "id": "im8jeeo",
      "text": "She's way more feminist than the average feminist.",
      "timestamp": "2022-08-29 09:44:39",
      "score": 2,
      "num_children": 0,
      "author": 367412,
      "replies": []
    },
    {
      "id": "im8kkab",
      "text": "Why does she use TF2 languagr like bonk and bonkers for example???",
      "timestamp": "2022-08-29 10:00:46",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "im8uleh",
      "text": "She dumb.",
      "timestamp": "2022-08-29 11:56:41",
      "score": 2,
      "num_children": 0,
      "author": 359954,
      "replies": []
    },
    {
      "id": "in0n1dh",
      "text": "I mean I had some girl on Reddit ask “how is a man being forced to penetrate even possible”. Almost like all common sense left her when she was typing🤦🏾‍♂️.",
      "timestamp": "2022-09-04 04:36:37",
      "score": 2,
      "num_children": 0,
      "author": 308209,
      "replies": []
    },
    {
      "id": "im7neyt",
      "text": "And now I'm pissed.\nShe is the worst of womanity.",
      "timestamp": "2022-08-29 03:13:36",
      "score": 1,
      "num_children": 0,
      "author": 343158,
      "replies": []
    },
    {
      "id": "im8dh9j",
      "text": "Well of course the two situations are different if you say \"《raped》 men\" instead of \"raped men\". Using the quotation marks gives away the fact that she thinks that males being raped are not subjected to \"real\" rape (whatever the fuck that could be in her mind).\n\nHer whole argument is reduced to using and not using the quotation marks.",
      "timestamp": "2022-08-29 08:18:45",
      "score": 1,
      "num_children": 0,
      "author": 287753,
      "replies": []
    },
    {
      "id": "im9gow7",
      "text": "Based",
      "timestamp": "2022-08-29 14:51:18",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "im9yyp7",
      "text": ".",
      "timestamp": "2022-08-29 16:53:49",
      "score": 1,
      "num_children": 0,
      "author": 17234,
      "replies": []
    },
    {
      "id": "imhp4e5",
      "text": "Cites power dynamic\nMentions teacher-student un consented sex\n\nHello? Anyone?",
      "timestamp": "2022-08-31 06:37:29",
      "score": 1,
      "num_children": 0,
      "author": 97788,
      "replies": []
    },
    {
      "id": "im7etlf",
      "text": "First half is stupid, raping a guy is more that sticking it in his ass.\nHe/she's right about the second half. Males and females aren't the same, a fact you happily acknowledge for pretty much any other topic.",
      "timestamp": "2022-08-29 02:01:56",
      "score": -4,
      "num_children": 1,
      "author": 211250,
      "replies": [
        {
          "id": "im8lnd5",
          "text": "Yeah idk why these people try to act like everything is the same.\n\nThey literally do the same exact thing they criticize feminism for, which is picking \"absolute equality, no difference between the genders\" when it's convenient.",
          "timestamp": "2022-08-29 10:15:21",
          "score": 0,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "im66f06",
      "text": "This might be unpopular to say here, but it is obvious that there is a spectrum of violation one can impose on another, and not merely a binary distinction. It would be helpful if the language we used to describe these things accounted for that. It doesn't detract from the wrongness or what some of these female teachers have done. But I would agree with the author, that most of these are nowhere the same thing as forcibly raping a girl. The comparable action would be a grown man raping a boy by force. And so a consensual relationship between a female student and male teacher, that would be considered nonconsensual because of the age difference is comparable to an identical relationship between a boy and a male teacher. But both or those are wildly different from forcible rape. In the past, our language accommodated that difference \n\nI also think there could be some admission that lots of guys would voluntarily bone their female teachers, as teenagers, if they had a hot teacher in their school, but that doesn't detract from the fact that other guys would not. Honestly, I would have boned a hot teacher, if we had one. It doesn't diminish the wrongness of what they did. Other guys might do it and later realize it was a terrible mistake, and she took advantage of them. It doesn't diminish their victimization it another wouldn't mind. Both things can be true.\n\nIt's the outrageous privilege women exercise that bothers me. We aren't paying these hoes to exploit the kids. They're supposed to be teaching.",
      "timestamp": "2022-08-28 20:25:24",
      "score": -5,
      "num_children": 0,
      "author": 196342,
      "replies": []
    },
    {
      "id": "im8ku36",
      "text": "🤔 i have to agree with her on that… it s a different kind of trauma",
      "timestamp": "2022-08-29 10:04:29",
      "score": -6,
      "num_children": 2,
      "author": 188820,
      "replies": [
        {
          "id": "im9k4tw",
          "text": "...I would rather not be raped. Dude, rape is rape. It is a horrible thing. Stop trying to say that teenage boys have an inferior type of trauma just because they are teenage boys. If someone gets raped, you should show support.",
          "timestamp": "2022-08-29 15:15:09",
          "score": 4,
          "num_children": 1,
          "author": 301192,
          "replies": [
            {
              "id": "im9pyjq",
              "text": "you didn’t get my point …",
              "timestamp": "2022-08-29 15:54:19",
              "score": -1,
              "num_children": 1,
              "author": 188820,
              "replies": [
                {
                  "id": "im9qtj6",
                  "text": "IT IS NOT a different kind of trauma. TRAUMA IS TRAUMA.",
                  "timestamp": "2022-08-29 16:00:02",
                  "score": 6,
                  "num_children": 1,
                  "author": 301192,
                  "replies": [
                    {
                      "id": "im9sujb",
                      "text": "of course, trauma is trauma, yet there is a slight difference btw the trauma of falling from a bike and the trauma of crashing a car",
                      "timestamp": "2022-08-29 16:13:40",
                      "score": -1,
                      "num_children": 1,
                      "author": 188820,
                      "replies": [
                        {
                          "id": "im9t7ya",
                          "text": "STOP. COMPARING. TRAUMA. If a TEENAGER gets raped, said teenager si going to have trauma. SAME. TRAUMA. IT DOESN'T MATTER THE GENDER.",
                          "timestamp": "2022-08-29 16:16:10",
                          "score": 6,
                          "num_children": 1,
                          "author": 301192,
                          "replies": [
                            {
                              "id": "im9xnu5",
                              "text": "that’s where we disagree, i m not expert in psychology though and i don’t think you are, are you?",
                              "timestamp": "2022-08-29 16:45:18",
                              "score": 1,
                              "num_children": 0,
                              "author": 188820,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "immtb4l",
          "text": "No its not",
          "timestamp": "2022-09-01 08:02:55",
          "score": 1,
          "num_children": 0,
          "author": 19811,
          "replies": []
        }
      ]
    },
    {
      "id": "im71igr",
      "text": "She's right about a few things.\nSadly, this sub is still Pro equality despite being \"anti-feminism\". Yeah right.",
      "timestamp": "2022-08-29 00:15:17",
      "score": -3,
      "num_children": 1,
      "replies": [
        {
          "id": "imssbc0",
          "text": "Feminism is female supremacy, wanting equality only where it would benefit women at the expense of men.\n\nAnd the fact that you view being pro-true equality as a bad thing speaks volumes.",
          "timestamp": "2022-09-02 14:15:48",
          "score": 0,
          "num_children": 1,
          "replies": [
            {
              "id": "imstbf1",
              "text": "Nope. I believe in gender roles. You believe men and women are the exact same.\n\nWe are not the same.",
              "timestamp": "2022-09-02 14:22:38",
              "score": 0,
              "num_children": 1,
              "replies": [
                {
                  "id": "imtve8l",
                  "text": "I don't believe they are the same, I believe they should be treated the same, as anything else proves to lead to unfairness.\n\nAnd if you're a tradcon, why are you even here?You clearly don't care about men, just upholding outdated, discriminatory bs.",
                  "timestamp": "2022-09-02 18:31:02",
                  "score": 2,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "imtzso0",
                      "text": "Lmao here come the NPCs once more. The anti-feminist thinks I'm against men while the feminist thinks I'm against women. Truly hilarious.\n\nNo, I don't think women and men should be treated the same. Subjecting women to things that they are not equipped to handle is a bad idea. Same for men.",
                      "timestamp": "2022-09-02 19:00:15",
                      "score": 0,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "imwpdsm",
                          "text": "You are for forcing people into roles because of their gender.Roles that are outdated and whose enforcement hurts both genders.\n\nYes you very much are against bot men and women, so please fuck off with your traditional gender roles, we don't want them.",
                          "timestamp": "2022-09-03 09:45:56",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "imwr82j",
                              "text": "You're as dumb as the people that believe communism works. \"Oh not that kind of communism\".\n\nThat's the exact same thing you're doing. \"Oh not their equality, my equality is better!\".",
                              "timestamp": "2022-09-03 10:11:57",
                              "score": 0,
                              "num_children": 1,
                              "replies": [
                                {
                                  "id": "imyhmt3",
                                  "text": "Their equality is female supremacy.\n\nThey don't actually want equality.It's just a mask to avoid backlash.\n\nObjectively, there is only 1 way to have equality, so your bs falls.",
                                  "timestamp": "2022-09-03 18:35:23",
                                  "score": 1,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "im9q7k3",
      "text": "I agree about the power dynamics being the same and it’s wrong to have sex with a minor but girls can get pregnant.",
      "timestamp": "2022-08-29 15:55:58",
      "score": -2,
      "num_children": 1,
      "author": 207370,
      "replies": [
        {
          "id": "immta2s",
          "text": "Ok?? There was literally a story years ago where a female teacher got pregnant from her student and married him then forced to pay child support from his parents!! Stop the victim mentality",
          "timestamp": "2022-09-01 08:02:31",
          "score": 2,
          "num_children": 0,
          "author": 19811,
          "replies": []
        }
      ]
    }
  ]
}