{
  "id": "x5u6h7",
  "text": "This so true\n",
  "timestamp": "2022-09-04 18:36:31",
  "score": 4965,
  "subreddit": "t5_3fdcn",
  "num_children": 31,
  "author": 133955,
  "replies": [
    {
      "id": "in350lv",
      "text": "\n#Freedom Lovers! If you see:\n\n##• Nazis  \n##• Nazi Enablers  \n##• Calls to Violence  \n##• Infighting\n\n#Smash That Report Button - Thwart the Fash!\n\n---\n\n^(Nazis, fascists, fascist apologists, whattaboutism, and bigotry are banned here. Report Nazi tactics, false flaggers, agents provocateur and bigoted behaviour!)  \nSee [Our Rules](https://www.reddit.com/r/Fuckthealtright/about/rules/) for more information! Fuck the Alt-Right!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fuckthealtright) if you have any questions or concerns.*",
      "timestamp": "2022-09-04 18:36:32",
      "score": 1,
      "num_children": 0,
      "author": 184140,
      "replies": []
    },
    {
      "id": "in3fyhb",
      "text": "Nobody at the rally was in black and white! \n\nOk… but you saw all of the swastikas right?",
      "timestamp": "2022-09-04 19:53:22",
      "score": 143,
      "num_children": 1,
      "author": 330703,
      "replies": [
        {
          "id": "in4o8q6",
          "text": "Lol when your in a crowd with ppl sharing the same beliefs and you see a swastika flag. You might be on the wrong side",
          "timestamp": "2022-09-05 01:27:38",
          "score": 45,
          "num_children": 1,
          "author": 227158,
          "replies": [
            {
              "id": "in5xyix",
              "text": "Just one? If they were real fascists, everybody would be holding a swastika flag. /s",
              "timestamp": "2022-09-05 09:23:53",
              "score": 9,
              "num_children": 0,
              "author": 142402,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "in3j0ua",
      "text": "People expect another authoritarian to look like Hitler and grow a party just as he did. The reality is that while history does repeat itself it looks totally different. You have to look at what’s being said. Eg; scapegoating, ultranationalistic, might makes right, anti-elite.",
      "timestamp": "2022-09-04 20:15:12",
      "score": 121,
      "num_children": 3,
      "author": 288659,
      "replies": [
        {
          "id": "in4axxe",
          "text": "> “The language and symbols of an authentic American fascism would, of course, have little to do with the original European models. They would have to be as familiar and reassuring to loyal Americans as the language and symbols of the original fascisms were familiar and reassuring to many Italians and Germans, as Orwell suggested. Hitler and Mussolini, after all, had not tried to seem exotic to their fellow citizens. \n\n>No swastikas in an American fascism, but Stars and Stripes (or Stars and Bars) and Christian crosses. No fascist salute, but mass recitations of the pledge of allegiance. These symbols contain no whiff of fascism in themselves, of course, but an American fascism would transform them into obligatory litmus tests for detecting the internal enemy.”\n\n> ― Robert O. Paxton, The Anatomy of Fascism\n\nFascism always looks different because it always drapes itself in its host nation's cherished symbols and ideals. It doesn't claim to be some new movement - it claims to be a return to the glory of a lost mythological golden era, and it always coopts the symbols which harken back to it such as the roman fetishism in Mussolini's Italy",
          "timestamp": "2022-09-04 23:43:34",
          "score": 80,
          "num_children": 1,
          "author": 294102,
          "replies": [
            {
              "id": "in6cwzl",
              "text": "“I’ve never seen a pro biden flag, shirt, or hat.”",
              "timestamp": "2022-09-05 12:28:45",
              "score": 4,
              "num_children": 1,
              "author": 171261,
              "replies": [
                {
                  "id": "in7jgxz",
                  "text": "Well we had a pro-Biden election in 2020 when he got more votes than a presidential candidate ever got before.",
                  "timestamp": "2022-09-05 17:38:09",
                  "score": 1,
                  "num_children": 0,
                  "author": 288659,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "in4a3sq",
          "text": "History does not repeat itself, but it rhymes.\n- Marx Twain",
          "timestamp": "2022-09-04 23:37:01",
          "score": 43,
          "num_children": 0,
          "author": 321403,
          "replies": []
        },
        {
          "id": "in4pp94",
          "text": "You don’t even have to go as far back as Hitler. There have been plenty of fascists throughout central and South America that talk the same as these assholes. \n\nIn the music documentary Break It All there is a section that has some of the dictators talking and they speak just like trump and the rest of his mob. It’s almost word for word.",
          "timestamp": "2022-09-05 01:39:17",
          "score": 15,
          "num_children": 0,
          "author": 400122,
          "replies": []
        }
      ]
    },
    {
      "id": "in3m87f",
      "text": "I’m starting to think that even if it looks exactly like Nazi Germany, too many people wouldn’t recognize it!   (You know, if it’s POC instead of Jews, it doesn’t count because it’s OK to hate them:   (sarcasm).",
      "timestamp": "2022-09-04 20:37:57",
      "score": 70,
      "num_children": 3,
      "author": 327114,
      "replies": [
        {
          "id": "in3q9kr",
          "text": "As someone else pointed out - the right wing terrorists are literally brandishing swastikas and still people resent the comparison … mind boggling.",
          "timestamp": "2022-09-04 21:06:35",
          "score": 42,
          "num_children": 0,
          "author": 99422,
          "replies": []
        },
        {
          "id": "in4l3uq",
          "text": "Can you spot the difference?\n\nhttps://youtu.be/Hk-TLXKlubk",
          "timestamp": "2022-09-05 01:02:34",
          "score": 15,
          "num_children": 0,
          "author": 278242,
          "replies": []
        },
        {
          "id": "in5nhhh",
          "text": "If it were identical even Jewish people being the target, it still wouldn’t be noticed.",
          "timestamp": "2022-09-05 07:00:21",
          "score": 4,
          "num_children": 1,
          "author": 286494,
          "replies": [
            {
              "id": "in5oen5",
              "text": "If?",
              "timestamp": "2022-09-05 07:11:59",
              "score": 3,
              "num_children": 0,
              "author": 379518,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "in3q6zr",
      "text": "It's not Nazism unless it's from the Bavarian region of Germany; otherwise it's just sparkling fascism",
      "timestamp": "2022-09-04 21:06:04",
      "score": 47,
      "num_children": 0,
      "author": 389201,
      "replies": []
    },
    {
      "id": "in452rq",
      "text": "This has been due to actual fascists deliberately muddying the waters when it comes to defining fascism coupled with removing and/or calling invalid any viable definitions of it.\n\nPeople not knowing what it looks like is not accidental. It's been a concentrated information denial campaign. They deny people the information they need and repeatedly deny that the needed information is valid in any capacity.\n\nThis is why books like the Diary of Anne Frank, the actual books that were burned by the Nazies, accurate (non-sensationalized) historical accounts surrounding WWII and the Mauz graphic novel are treated as toxic sludge by the Right, because they clearly and understandably convey what fascism looks like.\n\nTo remedy the danger, the banned and burned books need to be spread as far as possible, and the history of Nazism told without nationalistic mayonnaise slathered all over it.\n\nTL;DR people not knowing what fascism looks like is a direct result of a very real info war, one that is fought to keep the definition vague and exploitable, and the remedy is to clarify the definition by showing what the Nazies don't want you to see.",
      "timestamp": "2022-09-04 22:56:58",
      "score": 38,
      "num_children": 0,
      "author": 92428,
      "replies": []
    },
    {
      "id": "in3n2xx",
      "text": "American Fascism is all blue button-down shirts and tan chinos, polite handshakes and fake smiles.",
      "timestamp": "2022-09-04 20:43:53",
      "score": 33,
      "num_children": 2,
      "author": 371107,
      "replies": [
        {
          "id": "in4gg0l",
          "text": "\"When fascism comes to America, it will be wrapped in the flag and carrying a cross.\"",
          "timestamp": "2022-09-05 00:26:50",
          "score": 32,
          "num_children": 1,
          "author": 25414,
          "replies": [
            {
              "id": "in5kqxm",
              "text": "Something like,.. [this?](https://i.imgur.com/YMkJ9gk.jpg)\n\nTennessee. Where the KKK was born.",
              "timestamp": "2022-09-05 06:27:07",
              "score": 11,
              "num_children": 0,
              "author": 166676,
              "replies": []
            }
          ]
        },
        {
          "id": "in5vlub",
          "text": "Don't forget the bible.",
          "timestamp": "2022-09-05 08:50:19",
          "score": 1,
          "num_children": 0,
          "author": 301757,
          "replies": []
        }
      ]
    },
    {
      "id": "in37x55",
      "text": "“It was 6 million ILLEGALS, not 6 million Jews!  Stop comparing Trump to Hitler!”",
      "timestamp": "2022-09-04 18:56:39",
      "score": 134,
      "num_children": 4,
      "author": 152884,
      "replies": [
        {
          "id": "in3n4wu",
          "text": "\"How dare you compare Trump to Hitler! He doesn't have a moustache!\"",
          "timestamp": "2022-09-04 20:44:15",
          "score": 46,
          "num_children": 0,
          "author": 138887,
          "replies": []
        },
        {
          "id": "in3b6fr",
          "text": "We're against all *Globalists*, not Jews!\n\nBonus: It's called *Fake News!* Not Lügenpresse!",
          "timestamp": "2022-09-04 19:19:27",
          "score": 82,
          "num_children": 1,
          "author": 166676,
          "replies": [
            {
              "id": "in49t7x",
              "text": "\"We're against Cultural Marxism, not that Cultural Bolshevism stuff Nazis were on about!\"",
              "timestamp": "2022-09-04 23:34:41",
              "score": 33,
              "num_children": 0,
              "author": 294102,
              "replies": []
            }
          ]
        },
        {
          "id": "in429wa",
          "text": "I was just talking to my wife about this the other night. Specifically about how a lot of folks right now don’t know where their ideas came from.",
          "timestamp": "2022-09-04 22:34:59",
          "score": 15,
          "num_children": 0,
          "author": 220545,
          "replies": []
        },
        {
          "id": "in4g38i",
          "text": "The children Trump had thrown in cages were legal immigrants. Biden started the process, but it will take years to reunite them with their families.",
          "timestamp": "2022-09-05 00:24:07",
          "score": 8,
          "num_children": 0,
          "author": 25414,
          "replies": []
        }
      ]
    },
    {
      "id": "in3v0rg",
      "text": "Same way a lot of white Europeans can't recognize systemic racism unless it looks exactly like the US",
      "timestamp": "2022-09-04 21:40:37",
      "score": 27,
      "num_children": 1,
      "author": 44147,
      "replies": [
        {
          "id": "in4jjhp",
          "text": "TRUE. I live in Europe and you get people that act all concerned about Trump and tell you how he reminds them of Hitler, that will in the next sentence call Africans and middle easterners uncivilised and call for deportations. And when it's about Roma, even genocide will suddenly be something acceptable to suggest..",
          "timestamp": "2022-09-05 00:50:36",
          "score": 21,
          "num_children": 2,
          "author": 179448,
          "replies": [
            {
              "id": "in5z08k",
              "text": "This, both of what you said! The ignorance is off the charts.",
              "timestamp": "2022-09-05 09:38:59",
              "score": 2,
              "num_children": 0,
              "author": 372021,
              "replies": []
            },
            {
              "id": "in63e9a",
              "text": "Jesus, i live in Germany my whole live and worked in a lot of European countries. What kind of fucked up people do you surround yourself with?",
              "timestamp": "2022-09-05 10:40:13",
              "score": 1,
              "num_children": 2,
              "author": 226968,
              "replies": [
                {
                  "id": "in65gpz",
                  "text": "Have you ever talked to anyone over 60? It's common af",
                  "timestamp": "2022-09-05 11:07:12",
                  "score": 3,
                  "num_children": 1,
                  "author": 179448,
                  "replies": [
                    {
                      "id": "in662gl",
                      "text": "I mean. I'm from a Jewish German family, so maybe not that common in my relatives.",
                      "timestamp": "2022-09-05 11:14:52",
                      "score": 2,
                      "num_children": 0,
                      "author": 226968,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "in6603w",
                  "text": "i'm also from Germany and while i've yet to hear any calls gor deportation, racism is still very much entrenched in our culture, especially the older people. We may get taught a lot about National Socialism, but we sometimes neglect the other forms of fascism and how it works. This leads to some supposedly tolerant people going on rants about turks, poles and africans without seeing the hypocrisy in their statements.",
                  "timestamp": "2022-09-05 11:14:05",
                  "score": 3,
                  "num_children": 1,
                  "author": 134011,
                  "replies": [
                    {
                      "id": "in665an",
                      "text": "I fully agree that there is a massive problem with racism, but I never heard someone talking about genocide or deportation. That seems like a huge exaggeration.",
                      "timestamp": "2022-09-05 11:15:50",
                      "score": 1,
                      "num_children": 1,
                      "author": 226968,
                      "replies": [
                        {
                          "id": "in6689a",
                          "text": "It is, but there’s definitely some truth in it.\n\nDeportation i occasionally hear calls for, but genocide is a line that people currently daren't cross (let's hope it stays that way). I'm cautiously optimistic. Most younger people i met were pretty tolerant. \n\nI hate to use that tired cliche, but fuck the cdu-, spd- and especially afd-voters.\n\nThere’s also still this view that Germany changed overnight when the nazis came to power, when actually the culture at the time was fertile ground for these ideologies. People see Weimar Berlin and think it was this great liberal democratic state, when underneath all the pomp was a deeply conservative regime still very much of the colonial mindset that enabled our first genocide over in Africa. After World War 2 there was a push to distance themselves from the horrors of the 3rd reich by acting like victims of the regime they enabled and upheld (\"we didn't know any of that!\", myth of the clean Wehrmacht, Machtergreifung, \"just following orders\").",
                          "timestamp": "2022-09-05 11:16:52",
                          "score": 1,
                          "num_children": 0,
                          "author": 134011,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "in42h05",
      "text": "I mean the alt right groups literally walk around with swastikas. \n\n\nHow much more of a clue do people want?",
      "timestamp": "2022-09-04 22:36:32",
      "score": 23,
      "num_children": 2,
      "author": 48290,
      "replies": [
        {
          "id": "in5h720",
          "text": "Scariest part are those who never expose it, but hold positions in government and agencies.",
          "timestamp": "2022-09-05 05:45:47",
          "score": 4,
          "num_children": 0,
          "author": 71301,
          "replies": []
        },
        {
          "id": "in5yect",
          "text": "Unless there are millions of swastikas all over the place: Nothing to see here, folks! /s",
          "timestamp": "2022-09-05 09:30:14",
          "score": 2,
          "num_children": 0,
          "author": 142402,
          "replies": []
        }
      ]
    },
    {
      "id": "in3rmu1",
      "text": "“They’re not nazis unless they say so. If they do, then they’re joking.”",
      "timestamp": "2022-09-04 21:16:23",
      "score": 19,
      "num_children": 0,
      "author": 55486,
      "replies": []
    },
    {
      "id": "in42tok",
      "text": "There are swastikas all over America. People recognize it and like it, THAT'S the problem.",
      "timestamp": "2022-09-04 22:39:19",
      "score": 8,
      "num_children": 0,
      "author": 72405,
      "replies": []
    },
    {
      "id": "in4o4yu",
      "text": "Funny how republicans and maga are literally doing the hail hitler salute and have a swastika flag behind them. \n\nI think we’re running out of excuses.",
      "timestamp": "2022-09-05 01:26:48",
      "score": 8,
      "num_children": 0,
      "author": 227158,
      "replies": []
    },
    {
      "id": "in4rafr",
      "text": "The fact that far too many people will defend and excuse those that espouse the same beliefs as Nazis is also very dangerous. Far too many will defend them using the \"you don't like them because they have different political views\" line is very dangerous.\n\nIt is like that line from Chicago (movie). \"I guess you could say we broke up because of artistic differences. He saw himself as alive. And I saw him dead.” The Nazis here in the US are similar in that, which isn't good.",
      "timestamp": "2022-09-05 01:52:01",
      "score": 5,
      "num_children": 0,
      "author": 167270,
      "replies": []
    },
    {
      "id": "in4hvpn",
      "text": "Oh, it looks just like it",
      "timestamp": "2022-09-05 00:37:59",
      "score": 4,
      "num_children": 0,
      "author": 324378,
      "replies": []
    },
    {
      "id": "in4ru9t",
      "text": "It’s the result of purposely cutting education funding in many states, red and blue. It is also the result of the nationalistic “we are number one!” Indoctrination that many were subjected to for decades. The shining beacon on the seas has been less and less shiny , yet rather than being honest about it, our politicians kept pushing the same bullshit over and over without leveling with its people. \n\nNowhere was this more evident( aside from January 6,  and Trumpism), than when JUUUUUST before the bottom fell out for hundreds of thousands of people, back in 2008, John McCain says in a major speech “The pillars of our economy are strong!” Then the same people he speaking to, start losing their houses. \n\nHad he been honest “look we are about to face tough times, but we can move forward together!” He would have had a chance to win over Obama.\n\nMitt Romney was another one who rather than putting a plan forward, started asking “are you better off?” At a time in which the employment rate was at record low. \n\nMy point? We have been cutting education funding for years, and politicians have beeb lying to the public about verifiable issues for so long that:\n\nA) they don’t know who or what to believe( and as a result becoming prime target for demagogues like Trump).\n\nB) they don’t really know where to learn the stuff to help them identify ideologies like demagoguery. \n\nHell! These people still believe we were “the good guys” when invading irak( which had nothing to do with 911, in the first place).",
      "timestamp": "2022-09-05 01:56:34",
      "score": 5,
      "num_children": 0,
      "author": 380917,
      "replies": []
    },
    {
      "id": "in5vnc1",
      "text": "Even when they do recognize it, they're like \"But they hate the same colored people i do right? Then clearly they're not that bad\"\n\nMake no mistake about it, most Amuricans who support fascist Repulbicansism, don't give two shits about what others think. They only care that they think they now have the RIGHT to be a bigot towards those they hate. That's it. That's all those wannabe nazis care about.",
      "timestamp": "2022-09-05 08:50:55",
      "score": 4,
      "num_children": 0,
      "author": 54010,
      "replies": []
    },
    {
      "id": "in3qjw1",
      "text": "Considering fascism was [initially Mussolini’s thing](https://en.wikipedia.org/wiki/Fascism), it’s yet another consequence of the USA’s deficient education system…",
      "timestamp": "2022-09-04 21:08:37",
      "score": 10,
      "num_children": 3,
      "author": 243135,
      "replies": [
        {
          "id": "in3ux50",
          "text": "Had you asked a nazi if they were fascist,  they would have responded,  \"im not Italian\" \n\nSame as the trump idiots.  Willful ignorance? You decide",
          "timestamp": "2022-09-04 21:39:54",
          "score": 16,
          "num_children": 0,
          "author": 218523,
          "replies": []
        },
        {
          "id": "in3qles",
          "text": "**[Fascism](https://en.wikipedia.org/wiki/Fascism)** \n \n >Fascism is a far-right, authoritarian, ultranationalist political ideology and movement, characterized by a dictatorial leader, centralized autocracy, militarism, forcible suppression of opposition, belief in a natural social hierarchy, subordination of individual interests for the perceived good of the nation and race, and strong regimentation of society and the economy. It rose to prominence in early 20th-century Europe. The first fascist movements emerged in Italy during World War I, before spreading to other European countries, such as Germany. Fascism also had adherents outside of Europe.\n \n^([ )[^(F.A.Q)](https://www.reddit.com/r/WikiSummarizer/wiki/index#wiki_f.a.q)^( | )[^(Opt Out)](https://reddit.com/message/compose?to=WikiSummarizerBot&message=OptOut&subject=OptOut)^( | )[^(Opt Out Of Subreddit)](https://np.reddit.com/r/Fuckthealtright/about/banned)^( | )[^(GitHub)](https://github.com/Sujal-7/WikiSummarizerBot)^( ] Downvote to remove | v1.5)",
          "timestamp": "2022-09-04 21:08:55",
          "score": 10,
          "num_children": 0,
          "author": 358107,
          "replies": []
        },
        {
          "id": "in5xdo9",
          "text": "To be fair to the US education system: The term morphed from meaning \"Mussolini's fascism\" to \"all European military based authoritarianism\" in the UK press even *during* WWII and has been used that way ever since.",
          "timestamp": "2022-09-05 09:15:45",
          "score": 3,
          "num_children": 1,
          "author": 53163,
          "replies": [
            {
              "id": "in6fpjy",
              "text": "Indeed, that’s why I mentioned « initially ». \n\nThe most precise, and therefore scariest observation is that MAGA/QAnon, the present mutation of the virus that gave the Confederacy, Lost Cause, Tea Party, whose petri dishes are Evangelicalism & White Nationalism, precisely fits Umberto Eco’s list of 14 signs of fascism, as extolled by [Trump & his gang](https://www.salon.com/2016/12/20/14-signs-show-trumps-political-persona-aligns-with-that-of-a-fascist-leader_partner/)",
              "timestamp": "2022-09-05 12:54:45",
              "score": 3,
              "num_children": 0,
              "author": 243135,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "in4j64x",
      "text": "it does though, just not the end parts yet.",
      "timestamp": "2022-09-05 00:47:49",
      "score": 3,
      "num_children": 0,
      "author": 28789,
      "replies": []
    },
    {
      "id": "in4vk7z",
      "text": "It's like believing that only snakes with rattles are venomous.",
      "timestamp": "2022-09-05 02:26:03",
      "score": 3,
      "num_children": 0,
      "author": 26954,
      "replies": []
    },
    {
      "id": "in4kgik",
      "text": "But the patriot front clowns and all the other right wing Maga fuckers look EXACTLY like facists.",
      "timestamp": "2022-09-05 00:57:41",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "in4pyhj",
      "text": "It's unsurprising really. For the longest time fascism came to be defined through Hitler documentaries on History channel for most people.",
      "timestamp": "2022-09-05 01:41:17",
      "score": 2,
      "num_children": 0,
      "author": 180984,
      "replies": []
    },
    {
      "id": "in5ci9e",
      "text": "Also weird how those that cosplay as Nazis with tucked in polo shirts were immediately offended by a guy's speech about fascists",
      "timestamp": "2022-09-05 04:55:36",
      "score": 2,
      "num_children": 0,
      "author": 224652,
      "replies": []
    },
    {
      "id": "in581rb",
      "text": "They’re called, you know, morons.",
      "timestamp": "2022-09-05 04:11:38",
      "score": 1,
      "num_children": 0,
      "author": 202809,
      "replies": []
    },
    {
      "id": "in58euz",
      "text": "What makes you think they’ll recognize fascism even if it looks like the Nazis?",
      "timestamp": "2022-09-05 04:15:08",
      "score": 1,
      "num_children": 0,
      "author": 116983,
      "replies": []
    },
    {
      "id": "in5q4lr",
      "text": "It's wild that just because I don't know this twitter poster, I can't tell if she supports fascism or fighting it. The alt-right cries fascism as they push for it.",
      "timestamp": "2022-09-05 07:34:35",
      "score": 1,
      "num_children": 0,
      "author": 74033,
      "replies": []
    },
    {
      "id": "in5smwl",
      "text": "A leader who refuses to step down is the most obvious read.",
      "timestamp": "2022-09-05 08:08:48",
      "score": 1,
      "num_children": 0,
      "author": 21840,
      "replies": []
    },
    {
      "id": "in5ubix",
      "text": "But they do",
      "timestamp": "2022-09-05 08:31:58",
      "score": 1,
      "num_children": 0,
      "author": 409139,
      "replies": []
    },
    {
      "id": "in5z23x",
      "text": "I’ve seen people say they were socialist 🤪",
      "timestamp": "2022-09-05 09:39:44",
      "score": 1,
      "num_children": 0,
      "author": 361626,
      "replies": []
    },
    {
      "id": "in5smj8",
      "text": "Maybe if everything y’all disagreed with wasn’t reflexively labelled fascism people would be able to spot it better 🤷🏽‍♂️",
      "timestamp": "2022-09-05 08:08:39",
      "score": -7,
      "num_children": 1,
      "author": 227021,
      "replies": [
        {
          "id": "in7f65s",
          "text": "I disagree with people trying to overturn an election, remove rights from the populace, restrict voting, and censor \"bad book\". I disagree with people that start or are involved in coups against the US.\n\n\"disagreed\". Fuck off with that BS. You know damn well it isn't that.",
          "timestamp": "2022-09-05 17:09:41",
          "score": 1,
          "num_children": 0,
          "author": 167270,
          "replies": []
        }
      ]
    },
    {
      "id": "in4jfjj",
      "text": " Columbia University Professor Robert O. Paxton defines fascism in the modern age as \"1. a sense of overwhelming crisis beyond reach of traditional solutions; 2. belief one’s group is the victim, justifying any action without legal or moral limits; 3. need for authority by a natural leader above the law, relying on the superiority of his instincts; 4. right of the chosen people to dominate others without legal or moral restraint; 5. fear of foreign \\`contamination.'\"\n\nLeon Trotsky defines fascism traditionally as \" The Fascist movement in Italy was a spontaneous movement of large masses, with new leaders from the rank and file. It is a plebeian movement in origin, directed and financed by big capitalist powers. It issued forth from the petty bourgeoisie, the slum proletariat and even to a certain extent, from the proletarian masses, Mussolini, a former socialist, is a “self-made” man arising from this movement.\"\n\nNot surprising, Trotsky's definition rings true today, especially the part about corporate sponsorship of plebian (grassroots in todays terms) movements.\n\nMost scholars hold that fascism as a social movement employs elements from the political left, but many conclude that fascism eventually allies with the political right, especially after attaining state power.   This part is important and I am not going to explain it but I will leave it to you to comprehend, you're smart people.\n\nFinally, fascism is aligned tightly with extensive state regulation of the economy.  The Federal reserve, the IRS, bitcoin 'know your customer' rules, capital market regulations, securities and exchange commission.  Fascism thrives in over-regulation.  Many here lump libertarians in with the alt-right, falsely, but do consider the power you free grant nation states when voting, especially when it comes to government programs and more regulation, especially of economies and commodities.",
      "timestamp": "2022-09-05 00:49:46",
      "score": -4,
      "num_children": 1,
      "replies": [
        {
          "id": "in63xlt",
          "text": "Pay your taxes.\n\nTaxation is not theft.",
          "timestamp": "2022-09-05 10:47:20",
          "score": 1,
          "num_children": 0,
          "author": 162833,
          "replies": []
        }
      ]
    }
  ]
}