{
  "id": "x83zlb",
  "text": "Pope Francis is lying about having ‘zero tolerance’ for child rape | If he really cared, he’d suspend all of the accused, hand investigations over to secular authorities, pay victims what they’re owed, make all findings transparent, and change \"traditional\" rules that have contributed to the problem\n",
  "timestamp": "2022-09-07 12:35:10",
  "score": 17609,
  "subreddit": "t5_2qh2p",
  "num_children": 178,
  "author": 221311,
  "replies": [
    {
      "id": "inh1l8y",
      "text": "Hello r/all, Welcome to r/atheism!\n\nPlease read our [Commandments](http://www.reddit.com/r/atheism/wiki/guidelines) and [FAQ](http://www.reddit.com/r/atheism/wiki/FAQ) before commenting. If you follow the rules and act civilly we can avoid a lot of bans. While everyone is welcome here, this sub is intended for atheists to discuss things of interest to us. This means that a wide variety of subjects are on-topic here. This is not a sub about just atheism.\n\nRemember: The mods do not choose which posts get voted up the frontpage. They remove the posts that violate the [Commandments](/r/atheism/w/guidelines); they don't police quality.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*",
      "timestamp": "2022-09-07 17:04:05",
      "score": 1,
      "num_children": 1,
      "author": 184140,
      "replies": [
        {
          "id": "iniz2hx",
          "text": "The Pope does not care about young people.",
          "timestamp": "2022-09-08 00:37:20",
          "score": 1,
          "num_children": 0,
          "author": 378339,
          "replies": []
        }
      ]
    },
    {
      "id": "ing36if",
      "text": "If you go to a catholic church you pay for pedophiles. Idk how else to say this.",
      "timestamp": "2022-09-07 13:14:07",
      "score": 798,
      "num_children": 6,
      "author": 45972,
      "replies": [
        {
          "id": "ing6ren",
          "text": "Nobody is neutral on the question of child molestation.\n\nIt's not a topic you can have a legitimate difference of opinion on, like whether black licorice is edible. Nobody thinks \"Well, I don't *personally* enjoy raping children, but I respect the choices of my friends who do!\"\n\nEither you're disgusted by the very idea and you actively work to oppose it, or you are *at best* complicit (and quite probably a child abuser yourself). If you're a grown adult in $CURRENT_YEAR, and you call yourself a Catholic, **you are in the second category**.",
          "timestamp": "2022-09-07 13:40:47",
          "score": 310,
          "num_children": 6,
          "author": 18996,
          "replies": [
            {
              "id": "ingokhh",
              "text": "Yet you have a billion catholics in denial...",
              "timestamp": "2022-09-07 15:41:26",
              "score": 105,
              "num_children": 4,
              "author": 397929,
              "replies": [
                {
                  "id": "inhjy5t",
                  "text": "\"it's not happening in *our* parish\"\n\n\"It isn't *our* priest that's doing it\"\n\n**Until it is.**",
                  "timestamp": "2022-09-07 18:59:13",
                  "score": 48,
                  "num_children": 2,
                  "author": 391021,
                  "replies": [
                    {
                      "id": "inkghwp",
                      "text": "Even the \"our parish our priest\" argument is crazy. It's not a competition!",
                      "timestamp": "2022-09-08 09:36:37",
                      "score": 6,
                      "num_children": 0,
                      "author": 190019,
                      "replies": []
                    },
                    {
                      "id": "inksj3u",
                      "text": "Yep. I grew up in a small town of 5,000 people. There was a very small Catholic school, and a tiny Catholic church. When I was in my 20s a bunch of people that went to that school (I went to the regular public school) came forward about being molested by non other than the local priest. So in my little town that had ONE Catholic priest in it, guess who was the pedophile?",
                      "timestamp": "2022-09-08 11:52:28",
                      "score": 1,
                      "num_children": 0,
                      "author": 59626,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "inh8v68",
                  "text": "When have Catholics not been in denial?",
                  "timestamp": "2022-09-07 17:49:12",
                  "score": 69,
                  "num_children": 2,
                  "author": 284651,
                  "replies": [
                    {
                      "id": "inhu49a",
                      "text": "Think of the pope as a CEO of a company, he wants to make the organization look as good as possible to the public, while continuing to maximize profit.",
                      "timestamp": "2022-09-07 20:01:17",
                      "score": 36,
                      "num_children": 2,
                      "author": 279559,
                      "replies": [
                        {
                          "id": "ini1rav",
                          "text": "Never forget that if the Catholic church would be a company it'd be by far the most valuable in the world. \n\nFor comparison, Apple is worth about $2.5t and Germany's GDP in 2020 was $3.8t.\n\nThe church owns land the size of France. \n\nIt makes billions every month.\n\nThe treasures hidden in the Vatican alone are worth far beyond what we can begin to comprehend.\n\n\nBelieve in God if you want but the cath. church is a huge fucking scam and you should leave it asap.",
                          "timestamp": "2022-09-07 20:47:30",
                          "score": 40,
                          "num_children": 0,
                          "author": 72159,
                          "replies": []
                        },
                        {
                          "id": "inir43y",
                          "text": "This is the closest analogy.  Any closer and they’d have to pay taxes.",
                          "timestamp": "2022-09-07 23:38:48",
                          "score": 11,
                          "num_children": 1,
                          "author": 203944,
                          "replies": [
                            {
                              "id": "ink6vae",
                              "text": "Just like the real companies do!\n\nWait...",
                              "timestamp": "2022-09-08 07:22:34",
                              "score": 5,
                              "num_children": 0,
                              "author": 281856,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "inut40j",
                      "text": "The Pope is just another vapid old man in a funny hat. He’s a “team” player, and he’s protecting his “team”.",
                      "timestamp": "2022-09-10 13:53:16",
                      "score": 1,
                      "num_children": 0,
                      "author": 321131,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "inihmud",
                  "text": "There are a lot of Catholics who are not okay with what is happening inside the Catholic Church\n\n…but they repented and said 6 hail maries so they good now",
                  "timestamp": "2022-09-07 22:30:46",
                  "score": 12,
                  "num_children": 0,
                  "author": 22022,
                  "replies": []
                },
                {
                  "id": "ingwmjx",
                  "text": ">Yet you have a billion catholics in denial...\n\nThey say things like \"but my faith is important to me\".\n\nEven if that is true, it's still very possible to remain Christian without supporting the catholic church.",
                  "timestamp": "2022-09-07 16:32:51",
                  "score": 56,
                  "num_children": 3,
                  "author": 155543,
                  "replies": [
                    {
                      "id": "inhbf9j",
                      "text": "Careful there, I hear they defenestrate when you point that out.",
                      "timestamp": "2022-09-07 18:05:08",
                      "score": 14,
                      "num_children": 1,
                      "author": 16187,
                      "replies": [
                        {
                          "id": "inutg24",
                          "text": "They have to catch you first! It’s hard for them to run with their pants around their ankles.",
                          "timestamp": "2022-09-10 13:55:50",
                          "score": 1,
                          "num_children": 0,
                          "author": 321131,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "injhj6c",
                      "text": "growing up i constantly heard people saying “it’s not the church it’s self, it’s the individuals” as if that makes a difference when the institution systematically covers it up and tries to brush it under the rug",
                      "timestamp": "2022-09-08 02:57:28",
                      "score": 14,
                      "num_children": 0,
                      "author": 9009,
                      "replies": []
                    },
                    {
                      "id": "inh27gw",
                      "text": "Is it really? How\n?\nEdit:I misread your reply a it is possible to remail christian while supporting the catholic church. My bad.",
                      "timestamp": "2022-09-07 17:07:57",
                      "score": 5,
                      "num_children": 0,
                      "author": 397929,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "inidtmx",
              "text": "and Tim Minchin is STILL correct in The Pope Song!",
              "timestamp": "2022-09-07 22:04:52",
              "score": 8,
              "num_children": 0,
              "author": 137110,
              "replies": []
            },
            {
              "id": "inkck8l",
              "text": "I just don't understand this point of view, I know everyone can have their opinion but some are just wrong, and this one is a prime example.\n\nBlack licorice is the worst thing on this planet",
              "timestamp": "2022-09-08 08:41:21",
              "score": 2,
              "num_children": 0,
              "author": 204738,
              "replies": []
            },
            {
              "id": "ingtm23",
              "text": "Lumping everyone who associates to varying degrees with some group as complicit with the worst behavior of individuals within said group is bad precedent.\n\nBy that logic every Muslim complicit with Islamist extremism/terrorism, every politician is complicit with stealing classified documents, every working person is complicit with the worst practices of their employer, etc.\n\nThat being said, The Pope is complicit.",
              "timestamp": "2022-09-07 16:13:51",
              "score": -30,
              "num_children": 7,
              "author": 383490,
              "replies": [
                {
                  "id": "ingu439",
                  "text": "> Lumping everyone who associates to varying degrees with some group as complicit with the worst behavior of individuals within said group is bad precedent.\n\nWords are wind. It's your choices that reveal your character. If you claim that you don't support X, and then you turn around and voluntarily contribute time and money to *fund* X, you are a hypocrite and a liar.\n\n\nA lot of Catholics and Catholic-adjacent people like to make a big show of engaging in fake moral outrage, usually by making arguments beginning with \"I don't support pedophila, **but**...\", and think that this means they've done their part and are now absolved of all guilt.\n\nIt doesn't. This behaviour puts you on the level of the German Citizen who, while he isn't *personally* interested in murdering his Jewish neighbours, still cheers at Hitler's rallies, wears Swastika merchandise, and votes for the NSDAP. Citizens who quietly \"had grave reservations\" about \"a small minority of extremists\" who had \"lost sight of the Führer's true message of peace\", but who kept those reservations to themselves because they're convinced that their *local* Gestapo officers were all \"very fine people\".\n\n Historians have a word for those people, and that word is \"Nazi\".\n\nYes, every single one of them.\n\n>By that logic every Muslim complicit with Islamist extremism/terrorism, \n\nCorrect. Probably not the point you were trying to make, but yes, this *does* apply to  people in other child rape cults as well.\n\nI get that it's scary to admit that you've been wrong for years, but sometimes it's necessary to do scary things before you can grow. I get that the desire to belong to a club is a big part of human nature. But couldn't you try picking a club that isn't **built on a foundation of Pure Evil**?",
                  "timestamp": "2022-09-07 16:17:04",
                  "score": 48,
                  "num_children": 0,
                  "author": 18996,
                  "replies": []
                },
                {
                  "id": "inh5s35",
                  "text": "The church ran a child prostitution ring in cologne. They used the nuns of their orphanage to provide children for the fucking 5% known child abuser among their priests. \n\nAnd to be clear. That’s just the lower confirmed rate determined through personal records of the church (for Germany). Also that is the amount of active abusers with 4 known victims on average.",
                  "timestamp": "2022-09-07 17:30:07",
                  "score": 20,
                  "num_children": 0,
                  "author": 102747,
                  "replies": []
                },
                {
                  "id": "inguuh8",
                  "text": "If you're giving money to the church, you may not be directly morally complicit in child rape, but you're providing aid to a worldwide organization who, under pretensions of being a sovereign state and using its coffers of hundreds of billions, if not *trillions* of dollars, has perpetrated a decades-long explicit conspiracy to rape tens of thousands of children, to cover up those rapes, and to protect the rapists from the reach of secular law inside of virtually every sovereign nation on Earth. So, if you want to split hairs about complicity, that's fine, but the Catholic Church has committed, and continues to commit crimes against humanity in an explicit and organized way, and if you give anything to the church, that's what you're paying for. It's not about painting the faithful with the same brush as the rapists.  It's about supporting the organizational machine which makes this systematic rape possible.  *Those crimes* are still ongoing.  You can put that into whatever moral bucket you want, but I don't think it's a good one.",
                  "timestamp": "2022-09-07 16:21:38",
                  "score": 24,
                  "num_children": 1,
                  "author": 260534,
                  "replies": [
                    {
                      "id": "inh69jw",
                      "text": ">If you're giving money to the church, you ~~may not be~~ **are** directly morally complicit in child rape\n\nFTFY",
                      "timestamp": "2022-09-07 17:33:04",
                      "score": 16,
                      "num_children": 0,
                      "author": 18996,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ingxm9i",
                  "text": "With conservative estimates of accusations of abuse by priest at 2-4% (we can assume that the actual rates are much higher due to the nature of the church) , and 10% at liberal estimates.\n\nI don't like Islam like I don't like Christianity. Both create a world of cruelty , oppression,  and suffering. I don't think you can be a moral Muslim like I don't think you can be a moral Christian. \n\nI don't blame Muslims or Christians for the actions of other people,  but I argue they agree that their beliefs are so important , that it is okay if people get raped, killed and oppressed in the process.",
                  "timestamp": "2022-09-07 16:39:04",
                  "score": 11,
                  "num_children": 0,
                  "author": 45972,
                  "replies": []
                },
                {
                  "id": "inh7vs4",
                  "text": "Lumping all christians together has been the best personal policy choice of my life. My life is tangibly better every day for having run all the christians out of it.",
                  "timestamp": "2022-09-07 17:43:03",
                  "score": 11,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "inhr30o",
                  "text": "Slight correction: Islam is an entire religion, similar to Christianity. \n\nCatholicism is a denomination. It's a portion of a religion.\n\nSo it would be more like if someone is Sunni, they would be associated with all of the problems of that particular group. Anyone who follows Sufism would be associated with the problems of Sufism. \n\nIf you were to find which denominations groups like Alqueda are a part of, and that denomination is not trying to call them out and distance themselves, ans instead protect them\n\nThen I would gladly group people in the denomination with the problems in the denomination.",
                  "timestamp": "2022-09-07 19:43:09",
                  "score": 4,
                  "num_children": 0,
                  "author": 271950,
                  "replies": []
                },
                {
                  "id": "inhi4ou",
                  "text": "Odds are decent they refuse to vote for their opposing political party for *far* less than being complicit in hundreds, if not thousands, of child rapes. I see no problem in calling them out for supporting religious institutions that protect child rapists, assuming they're not absolute hypocrites",
                  "timestamp": "2022-09-07 18:47:43",
                  "score": 3,
                  "num_children": 0,
                  "author": 28578,
                  "replies": []
                }
              ]
            },
            {
              "id": "inikexw",
              "text": "This is so true.  Look how people vote in politicians who are accused",
              "timestamp": "2022-09-07 22:50:15",
              "score": 1,
              "num_children": 0,
              "author": 98004,
              "replies": []
            },
            {
              "id": "inhksmx",
              "text": "[removed]",
              "timestamp": "2022-09-07 19:04:34",
              "score": 0,
              "num_children": 2,
              "replies": [
                {
                  "id": "inhlpgn",
                  "text": "Maybe if the teachers unions were covering it up and just shuffling them to different schools to hide it and let it continue further",
                  "timestamp": "2022-09-07 19:10:17",
                  "score": 3,
                  "num_children": 1,
                  "author": 139660,
                  "replies": [
                    {
                      "id": "inhmj3r",
                      "text": "[removed]",
                      "timestamp": "2022-09-07 19:15:27",
                      "score": 0,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "inhmxdi",
                          "text": "Yeah, and because of that alot of people don't support them? Police is like the perfect example, looks how many people still bootlick police with all the bullshit they constantly get away with in seemingly every precinct.",
                          "timestamp": "2022-09-07 19:17:57",
                          "score": 2,
                          "num_children": 0,
                          "author": 139660,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "inhmmqt",
                  "text": "A rounding error compared to the number of priests that diddle children.\n\n**A FUCKING ROUNDING ERROR.**\n\nStop defending child rapists in the katholic church with your 'but-what-about-ism' bullshit. That stopped working for your kind a few years back.",
                  "timestamp": "2022-09-07 19:16:05",
                  "score": 1,
                  "num_children": 1,
                  "author": 114177,
                  "replies": [
                    {
                      "id": "inhnfy0",
                      "text": "[removed]",
                      "timestamp": "2022-09-07 19:21:02",
                      "score": 0,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "inhpsgn",
                          "text": "\n**Myth:** The rate of sexual abuse committed by priests is not significantly higher than that committed by other professions.\n\n**Fact:** This is one of those Big Lies that apologists keep repeating in the hopes that people will accept it without question if they hear it often enough. Unfortunately, like most Big Lies, it falls apart as soon as somebody shows up with actual data.\n\n>I think you should revisit the data.\n\nOkay, let's do that.\n\nIn Australia, for instance, it's estimated that, between 1950 and 2010, approximately 7% of Catholic priests  were involved in child sexual abuse in some capacity. In some specific orders, the rate is higher than *40%*. That's more than **two out of every five**.\n\nFor comparison, the occupation with the second highest rate of child abuse (teacher) was slightly less than one percent. When it comes to the kiddie-diddling race, The One Holy Catholic and Apostolic Church isn't running in the middle of the pack. They aren't even ahead by a narrow margin. They've lapped everyone else **seven times over**.\n\n(Lest you think that the figures for Australia are anomalous, the rate in the USA is about 5.6%)\n\nSee also: http://www.abc.net.au/news/2017-02-06/child-sex-abuse-royal-commission:-data-reveals-catholic-abuse/8243890\n\nhttps://www.patheos.com/blogs/tippling/2017/06/30/catholic-clergy-likely-paedophiles-general-public/\n\n\nBut let's pretend for a moment that this claim **is** true. Let's pretend, against all evidence,  that a randomly selected priest is exactly as likely to be a practising paedophile as is a random florist or a random tax accountant. You would still have to deal with the fact that there is no organized conspiracy that moves child-molesting florists from flower shop to flower shop to escape the law, no multinational organization dedicated to concealing the crimes of tax accountants.\n\nLet's imagine that the ratio of child abusers who work as priests and those who work as public school teachers were magically set to 1:1 today. That would not be a *stable* equilibrium. Given that one profession goes to extreme lengths to protect and enable child abusers, and the other goes to extreme lengths to protect children *from* child abusers, that ratio wouldn't remain at 1:1 for very long.\n\nEven if this Big Lie is taken as read, the Catholic Church would still be **guilty as fuck**.",
                          "timestamp": "2022-09-07 19:35:14",
                          "score": 2,
                          "num_children": 0,
                          "author": 18996,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "inhqq5h",
          "text": "I've been saying this for years. If you support the church in any way, you support child rape.\n\nI don't call it the church, I call it the child rape cult. :)",
          "timestamp": "2022-09-07 19:40:57",
          "score": 17,
          "num_children": 2,
          "author": 374930,
          "replies": [
            {
              "id": "inipo1l",
              "text": "You should stop calling it that…\n\nwhen it stops being 100% accurate.",
              "timestamp": "2022-09-07 23:28:05",
              "score": 4,
              "num_children": 0,
              "author": 4715,
              "replies": []
            },
            {
              "id": "inhs733",
              "text": "[removed]",
              "timestamp": "2022-09-07 19:49:44",
              "score": -6,
              "num_children": 4,
              "replies": [
                {
                  "id": "inhwedt",
                  "text": "Taxes aren't voluntary though...while giving money to the Catholic Church is.",
                  "timestamp": "2022-09-07 20:15:01",
                  "score": 16,
                  "num_children": 1,
                  "author": 6350,
                  "replies": [
                    {
                      "id": "ini3wzt",
                      "text": "For now. Give the Talibangelicals some time.",
                      "timestamp": "2022-09-07 21:00:46",
                      "score": 3,
                      "num_children": 0,
                      "author": 145941,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "inig5er",
                  "text": "That's because it's a bad take. You can't *not* pay taxes. Anywhere you live in the world has taxes. Religion is something that a person voluntarily takes part in and **donates** money to. It's just not the same thing.",
                  "timestamp": "2022-09-07 22:20:33",
                  "score": 5,
                  "num_children": 0,
                  "author": 126744,
                  "replies": []
                },
                {
                  "id": "inih3le",
                  "text": "Most people don't have the luxury of just getting up and going to another country, and as another redditor pointed out, taxes aren't voluntary.\n\nYou could easily join another denomination of the Christian cult if you so choose.  Therefore staying Catholic and putting $$ in the beging plate means you choose to support child rape, among other atrocities.  Just look at Mother Teresa the \"sadistic saint\".\n\nEdit, punctuation",
                  "timestamp": "2022-09-07 22:27:02",
                  "score": 3,
                  "num_children": 0,
                  "author": 248803,
                  "replies": []
                },
                {
                  "id": "inihr1w",
                  "text": "And that's what's called a false equivalence.",
                  "timestamp": "2022-09-07 22:31:35",
                  "score": 3,
                  "num_children": 0,
                  "author": 89974,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ini1ync",
          "text": "is there a religion without them?",
          "timestamp": "2022-09-07 20:48:46",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "inibrr9",
          "text": "That *is* all there is to say.  If you support the catholic church you *know* that you are actively supporting child rape.",
          "timestamp": "2022-09-07 21:51:13",
          "score": 1,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "inig3ry",
          "text": "By this, what says you of politicians?",
          "timestamp": "2022-09-07 22:20:15",
          "score": -2,
          "num_children": 0,
          "author": 361334,
          "replies": []
        },
        {
          "id": "ink3ghi",
          "text": "so do you pay for murder if you pay tax?",
          "timestamp": "2022-09-08 06:38:37",
          "score": 0,
          "num_children": 2,
          "author": 34212,
          "replies": [
            {
              "id": "ink8vf9",
              "text": "Basically. You don't go to prison for not paying the Catholic Church, though.",
              "timestamp": "2022-09-08 07:49:28",
              "score": 2,
              "num_children": 0,
              "author": 318636,
              "replies": []
            },
            {
              "id": "inkiref",
              "text": "You don't get a choice in the matter and taxes actually provide resources such as infrastructure , education , hospitals, emergency services, and hundreds of other important items.",
              "timestamp": "2022-09-08 10:06:01",
              "score": 1,
              "num_children": 0,
              "author": 45972,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ing2407",
      "text": "The Catholic Church struggled to [raise $25m](https://www.cbc.ca/news/canada/saskatoon/church-residential-school-compensation-1.6082935) for residential school victims but somehow managed to raise $28m for a new church and [$3.5m](https://wichitabeacon.org/stories/2022/07/27/follow-the-money-who-is-funding-kansas-abortion-amendment-ads/) to attempt to overturn bodily autonomy rights for people in Kansas.\n\nGtfoh with your hypocrisy, Pope.",
      "timestamp": "2022-09-07 13:05:48",
      "score": 602,
      "num_children": 12,
      "author": 113779,
      "replies": [
        {
          "id": "ingr3au",
          "text": "They find the money to dispute every single allegation that's ever made against them. They demand that the people they've abused chase them through the courts for years before they'll even consider recognising the harm that has been done. \n\nI can't think of anything further from what Jesus would do.",
          "timestamp": "2022-09-07 15:57:38",
          "score": 50,
          "num_children": 1,
          "author": 102356,
          "replies": [
            {
              "id": "ingrhlb",
              "text": "Exactly. They try to get off on all sorts of technicalities. \n\nI'll believe John Paul I is a saint when he performs the miracle of exposing child abusers in his church.",
              "timestamp": "2022-09-07 16:00:11",
              "score": 27,
              "num_children": 0,
              "author": 113779,
              "replies": []
            }
          ]
        },
        {
          "id": "ingw66h",
          "text": ">The Catholic Church struggled to [raise $25m](https://www.cbc.ca/news/canada/saskatoon/church-residential-school-compensation-1.6082935) for residential school victims but somehow managed to raise $28m \n\nThen they hired one of Canada's top lawyers, who, in a private court hearing, successfully argued that the country's Catholic churches had tried their best and had no more to give.\n\nIn previous years, the Catholic Church was the only church refusing to pay its 30 per cent share of survivors' claims. Now, its lawyers were also refusing to sign this deal.\n\nNo, they didn't \"struggle\" to raise $28m, they didn't even care enough to try coming in at a measly $34,650. It's such a giant middle finger to us, and most of our community only hates the church more now, to the point we want them completely gone.",
          "timestamp": "2022-09-07 16:29:57",
          "score": 45,
          "num_children": 3,
          "author": 376384,
          "replies": [
            {
              "id": "ingwf4v",
              "text": "You're absolutely right. It should say the Catholic Church failed to raise the $25m they had committed to. Or perhaps failed to even try.",
              "timestamp": "2022-09-07 16:31:32",
              "score": 20,
              "num_children": 1,
              "author": 113779,
              "replies": [
                {
                  "id": "inh369l",
                  "text": "Clearly it wasn't gods will to give those people 25million, but it was gods will to fund that totally sweet and legal 28million dollar church. Watch out for  your testicles, spectacles, your wallet and your watch out there!",
                  "timestamp": "2022-09-07 17:14:02",
                  "score": 11,
                  "num_children": 0,
                  "author": 340507,
                  "replies": []
                }
              ]
            },
            {
              "id": "inhdels",
              "text": "I have zero sympathy when they whine about churches being burned down",
              "timestamp": "2022-09-07 18:17:42",
              "score": 12,
              "num_children": 2,
              "author": 223,
              "replies": [
                {
                  "id": "inhv5mv",
                  "text": "as a 'confirmed' catholic who went to their schools for like 13 years, i would prefer to see them all gutted and repurposed as affordable housing, but i'll take burned down as a consolation",
                  "timestamp": "2022-09-07 20:07:30",
                  "score": 9,
                  "num_children": 1,
                  "author": 228023,
                  "replies": [
                    {
                      "id": "inhvjg5",
                      "text": "i suggested community centers, affordable housing, libraries, etc. on a reddit post and got downvoted to hell.\n\n…but I like the cut of your jib",
                      "timestamp": "2022-09-07 20:09:48",
                      "score": 8,
                      "num_children": 0,
                      "author": 223,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "inhfuas",
                  "text": "And yet people in my town will lose their shit if someone graffitis something on the church, and blame it on us because it's a \"hate crime\".",
                  "timestamp": "2022-09-07 18:33:17",
                  "score": 9,
                  "num_children": 0,
                  "author": 376384,
                  "replies": []
                }
              ]
            },
            {
              "id": "inif0jn",
              "text": "They possibly did struggle depending on who owed the money.      \nFrom what I understand the Catholic Church has put a lot of effort into every part of itself running as separate legal entities in order to minimise this kind of thing.     \nThe ruling ends up being on some local diocese that surprisingly suddenly has empty coffers.",
              "timestamp": "2022-09-07 22:12:55",
              "score": 3,
              "num_children": 0,
              "author": 122682,
              "replies": []
            }
          ]
        },
        {
          "id": "ingd8oh",
          "text": "At the end of the day, he is a fucking pope and this a church machine. He and all the people like him are nothing but a money and power sapping crooks and liars.",
          "timestamp": "2022-09-07 14:26:20",
          "score": 168,
          "num_children": 1,
          "author": 406939,
          "replies": [
            {
              "id": "inhc5gd",
              "text": "edmontons archbishop or whatever contributed 15 million when the pope came to Canada, and they're saying the entirety of the church can't raise 25m. \n\nfuck religion.",
              "timestamp": "2022-09-07 18:09:42",
              "score": 52,
              "num_children": 1,
              "author": 65487,
              "replies": [
                {
                  "id": "inhxh2x",
                  "text": "I met a pastor that I know is agnostic and 0% religious (edited for clarity). It’s a job. They are paid actors at this point. And they are rich as fuck. \n\nI knew a divorced carpenter. He made 62k a year. When his wife left him because he worked too much, they were donating 20% of their income (she didn’t work) to the church. When he told me I was almost pissed off. You can’t fix your car and you’re getting a ride into work but you’re donating 20% of your income to the church? He continued to donate 20% of his 50% after his wife got half of his paycheck. \n\nHis pastor had 2 Cadillacs and 3 kids were going to private school. How does that make any sense?",
                  "timestamp": "2022-09-07 20:21:34",
                  "score": 41,
                  "num_children": 4,
                  "author": 379038,
                  "replies": [
                    {
                      "id": "ini4oog",
                      "text": "My family was very poor and we sometimes had to wear shoes with cardboard in them because of the holes.  We only had fresh produce twice a month (i.e., everyone got one apple or orange), and we could hardly keep the water and power turned on, even though my dad worked two jobs for decades.\n\nBut it was more important to give that 10% to the church than to make sure all the kids had at least a single decent pair of shoes and were properly fed. All this to support a religion that has lied, tortured, killed, and sexually assaulted children wholesale, all while keeping themselves fat and happy.\n\nYeah, it's def a 'bad religion'.",
                      "timestamp": "2022-09-07 21:05:32",
                      "score": 26,
                      "num_children": 0,
                      "author": 349414,
                      "replies": []
                    },
                    {
                      "id": "ini7a69",
                      "text": "How can you be 100% agnostic? Dude’s 100% sure he isn’t sure?",
                      "timestamp": "2022-09-07 21:22:05",
                      "score": 7,
                      "num_children": 0,
                      "author": 294813,
                      "replies": []
                    },
                    {
                      "id": "inib2hh",
                      "text": "Oh, it goes further than this. Pretty fun to look up a study on who actually pays their tithes - it's a real shocker that folks on food stamps or many times more likely to pay their 10% then even Christians making over $100,000. Greedy fucks have a flat tax rate and they won't even pay that. Tithing is 100% grift to steal money from the poorest congregants - a good reminder that all that talk about helping the poor was nothing but lip service.",
                      "timestamp": "2022-09-07 21:46:38",
                      "score": 8,
                      "num_children": 0,
                      "author": 168356,
                      "replies": []
                    },
                    {
                      "id": "inprvdp",
                      "text": "It makes sense because your carpenter friend is an idiot.",
                      "timestamp": "2022-09-09 11:55:45",
                      "score": 1,
                      "num_children": 0,
                      "author": 353859,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ingw8ib",
          "text": "Oh you forgot about the 35 million dollar it cost Canadians to have the CEO of sky daddy say an half assed apology and another pledge of [30 million](https://www.cccb.ca/media-release/canadas-bishops-announce-indigenous-reconciliation-fund-to-support-projects-across-canada/) it won't pay. The ~~child killers~~ Church will not release its information/documents it has on these [atrocities from that time](https://www.theglobeandmail.com/canada/article-residential-school-records-top-of-mind-for-indigenous-delegates-ahead/) (probably knew about it, kept it hush hush). Oh and lets not forget the [mementoes they stole](https://nativenewsonline.net/sovereignty/western-canadian-inuit-leader-to-the-vatican-it-is-not-the-pope-s-kayak) from native people and still have. Oh and Harper (Canada's Conservative Prime Minister) forgave the first 25 million settlement so well it can't be overturned. I wish they would sell one of their golden wands or a painting or two just to make an attempt at it, but as we know the lord works in ~~profitable ways~~ mysterious ways.",
          "timestamp": "2022-09-07 16:30:21",
          "score": 28,
          "num_children": 1,
          "author": 15050,
          "replies": [
            {
              "id": "ingwmod",
              "text": ">the lord works in profitable ways mysterious ways.\n\nThis. This awful organisation has only been about money and power from the very beginning.",
              "timestamp": "2022-09-07 16:32:53",
              "score": 14,
              "num_children": 2,
              "author": 113779,
              "replies": [
                {
                  "id": "ingxhph",
                  "text": "Hubbard said it the best “You don't get rich writing science fiction. If you want to get rich, you start a religion.”  Now look at the [wack job of scientology](https://www.dailymotion.com/video/x28etf4) but its [highly profitable](https://newsongreen.org/scientology-net-worth-2020-2021/).",
                  "timestamp": "2022-09-07 16:38:16",
                  "score": 11,
                  "num_children": 0,
                  "author": 15050,
                  "replies": []
                },
                {
                  "id": "inh8mdu",
                  "text": "It was the old temples of Rome recognizing the end of thier ways who then co-opted Christianity to form the Catholic Church and obtain even more power and wealth than ever before, as monotheism ensures universal adherence (unlike paganism which allowed infinite choice etc).",
                  "timestamp": "2022-09-07 17:47:41",
                  "score": 6,
                  "num_children": 0,
                  "author": 224654,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "inh7c7y",
          "text": "When the Pope came to Canada to \"apologize\" for the rapes and murders perpetrated by their criminal enterprise, it cost the Canadian taxpayer 35 million.\n\n...for a half-assed apology and no real attempt at reconciliation.",
          "timestamp": "2022-09-07 17:39:41",
          "score": 17,
          "num_children": 1,
          "author": 341113,
          "replies": [
            {
              "id": "ini0mog",
              "text": "Zoom would have been cheaper.",
              "timestamp": "2022-09-07 20:40:37",
              "score": 5,
              "num_children": 0,
              "author": 213322,
              "replies": []
            }
          ]
        },
        {
          "id": "ingxi9r",
          "text": "The Catholic Church is believed to be the richest institution in the world. Their real estate portfolio alone puts them in the running and their other holdings should easily push them to the top.",
          "timestamp": "2022-09-07 16:38:22",
          "score": 16,
          "num_children": 1,
          "author": 407189,
          "replies": [
            {
              "id": "ingxzqv",
              "text": ">The Catholic Church is believed to be the richest institution in the world.\n\nI would believe this. They collected tithes for centuries but don't pay tax in many countries.",
              "timestamp": "2022-09-07 16:41:26",
              "score": 12,
              "num_children": 0,
              "author": 113779,
              "replies": []
            }
          ]
        },
        {
          "id": "ingfu47",
          "text": "If you are part of and fund the Catholic Church you are part of that. I wish Catholics would consider leaving their church. Not saying they need to drop their faith. Just go to more liberal churches.",
          "timestamp": "2022-09-07 14:43:47",
          "score": 62,
          "num_children": 2,
          "author": 242458,
          "replies": [
            {
              "id": "ingtpkd",
              "text": "Yes, if you support the Catholic Church you are supporting an international pedophile organization.",
              "timestamp": "2022-09-07 16:14:28",
              "score": 22,
              "num_children": 0,
              "author": 174609,
              "replies": []
            },
            {
              "id": "ingrbfx",
              "text": "[deleted]",
              "timestamp": "2022-09-07 15:59:05",
              "score": 27,
              "num_children": 1,
              "replies": [
                {
                  "id": "inkrj6b",
                  "text": "You seem to be implying that other churches are more sane?",
                  "timestamp": "2022-09-08 11:42:56",
                  "score": 2,
                  "num_children": 1,
                  "author": 241968,
                  "replies": [
                    {
                      "id": "inkrp71",
                      "text": "[deleted]",
                      "timestamp": "2022-09-08 11:44:32",
                      "score": 2,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "inksjwc",
                          "text": "That's a beautiful saying. Fuck religion.",
                          "timestamp": "2022-09-08 11:52:41",
                          "score": 2,
                          "num_children": 0,
                          "author": 241968,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "inhia0n",
          "text": "I found it really upsetting when he went to Canada to apologize for the previous wrongs of the missionaries. Not because he apologized, but because, “WHY STOP THERE!?”\n\n“POPE, yous got some splainen’ to do!”",
          "timestamp": "2022-09-07 18:48:39",
          "score": 9,
          "num_children": 0,
          "author": 36368,
          "replies": []
        },
        {
          "id": "ingry7k",
          "text": "Everyone who's ever been to the Vatican knows how bullshit this is. Whether or not they're able to open their eyes to the lies entirely depends on how brainwashed a catholic you are. They could sell half the art on the left side of a hallway in the Vatican museum and pay off their victims tomorrow. Monsters",
          "timestamp": "2022-09-07 16:03:08",
          "score": 19,
          "num_children": 2,
          "author": 117993,
          "replies": [
            {
              "id": "ini6wh7",
              "text": "I used to have a fantasy of going to the vatican and mooning the pope.  Then I thought bigger and began to wonder, if I won the lottery could I afford to pay a bunch of people (like 50 people) $100 each to moon the pope with me?  I would certainly love to see something like that happen!\n\nIt's interesting enough to get world wide attention, but amusing enough to keep people talking.  Probably most of the talk would be about how disrespectful it was, but then people would ask why.  \n\nWhy do this?  To set the stage for talking about all the atrocities this organization has committed over the world and through the centuries.  To bring more attention to the horrible things done by this church in the name of God.  Talk about disrespectful!",
              "timestamp": "2022-09-07 21:19:39",
              "score": 4,
              "num_children": 0,
              "author": 349414,
              "replies": []
            },
            {
              "id": "inhlu8v",
              "text": "Most things in the Vatican are stolen, all proudly displayed. Time to give those things back to their rightful owners",
              "timestamp": "2022-09-07 19:11:07",
              "score": 7,
              "num_children": 1,
              "author": 15898,
              "replies": [
                {
                  "id": "inhqwor",
                  "text": "Seriously.  They say don't take photos or videos in the Shitsteam Crapple, so some \"reverence,\" oh and beware of pick pockets. Now exit thru the gift shop. But those mummies are just on display. Reverently and shit. Shithole cuntry. And a fucking creepshow. https://www.nytimes.com/2019/07/20/world/europe/vatican-bones-emanuela-orlandi.html\n\n> Less than 10 days after Vatican officials said they found no evidence that the daughter of an employee who disappeared 36 years ago had been buried in a cemetery inside Vatican City, a new foray there unearthed two ossuaries Saturday that contained unidentified human bones.\n\n> Whether any of them belonged to the girl, Emanuela Orlandi, who disappeared at age 15 in 1983, was not possible to say immediately.",
                  "timestamp": "2022-09-07 19:42:04",
                  "score": 6,
                  "num_children": 0,
                  "author": 117993,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ingo64t",
          "text": "I heard they're buying up Louisiana land after tragedies too.",
          "timestamp": "2022-09-07 15:38:51",
          "score": 5,
          "num_children": 0,
          "author": 157521,
          "replies": []
        },
        {
          "id": "inhc8vy",
          "text": "after having been bailed out for over a billion dollars",
          "timestamp": "2022-09-07 18:10:19",
          "score": 4,
          "num_children": 1,
          "author": 223,
          "replies": [
            {
              "id": "inhcfhk",
              "text": "I didn't even know that bit. Wtaf?!!",
              "timestamp": "2022-09-07 18:11:27",
              "score": 2,
              "num_children": 1,
              "author": 113779,
              "replies": [
                {
                  "id": "inhczh1",
                  "text": "yeah, essentially got reimbursed for all their payouts resulting from raping god’s children \n\n[i literally cried when i first heard about it](https://apnews.com/article/economy-wv-state-wire-new-york-il-state-wire-dc-wire-dab8261c68c93f24c0bfc1876518b3f6)",
                  "timestamp": "2022-09-07 18:14:59",
                  "score": 6,
                  "num_children": 0,
                  "author": 223,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "inknu6s",
          "text": "In Poland CC bought recently 100 hectars of land. I guess they will now actually shave sheeps, not just its memebers.",
          "timestamp": "2022-09-08 11:05:11",
          "score": 2,
          "num_children": 0,
          "author": 321677,
          "replies": []
        }
      ]
    },
    {
      "id": "ing4q2h",
      "text": "Francis, for some reasons, put our local arch bishop in charge of the investigation into systematic child abuse by German Catholic clergy, involving thousands of children over several decades. He has absolutely fucked up every step, it seems, and possibly intentionally sabotaged that investigation and couldn't even spin it properly for the public. In March, the guy even offered to retire - and Francis has done fuck all. Fuck them both.",
      "timestamp": "2022-09-07 13:25:48",
      "score": 83,
      "num_children": 2,
      "author": 79221,
      "replies": [
        {
          "id": "inhgcxc",
          "text": "Folks want to talk about \"deep state\", the Vatican is literally a country made almost entirely of bureaucracy which consistently manages, protects, and clearly attracts child abusers. \n\nThis country has indoctrinated foreign agents ALL OVER THE WORLD who systematically commit child abuse for generations with almost no repercussions because of the defenses and protections invested by their government across hundreds of years. If that's not the \"deep state\" folks have been screaming about, then literally what is?",
          "timestamp": "2022-09-07 18:36:31",
          "score": 27,
          "num_children": 1,
          "author": 23301,
          "replies": [
            {
              "id": "inhl2gd",
              "text": "The secret child prostitution ring run for the benefit of them and their political allies? Yes they confirmed that with at least 143 victims. They used their nuns to provide orphans form their orphanage for officials in the church and in politics. \n\nAnd the report on this isn't even published because apparently the stuff in it is soo much worse. These are just the absolute basic details they failed to hide.",
              "timestamp": "2022-09-07 19:06:15",
              "score": 10,
              "num_children": 0,
              "author": 45861,
              "replies": []
            }
          ]
        },
        {
          "id": "inhvhb3",
          "text": "How do you “spin” covering up child abuse?\n\nBurn it down imo.  They have for centuries been the **absolute fucking worst.**\n\nYa listening god?  Could use some smiting ya stingy bitch",
          "timestamp": "2022-09-07 20:09:26",
          "score": 12,
          "num_children": 1,
          "author": 258202,
          "replies": [
            {
              "id": "inhx9i8",
              "text": "Not the child abuse but his fuckups in the process of investigation. The whole thing could plausibly have been presented in such a way as to not make him look like a complete idiot in the public's eye (or at least the eyes of Catholic believers) but he took every chance he got to make it worse. Not just a fucking dick but incompetent as well, is what I'm saying.",
              "timestamp": "2022-09-07 20:20:19",
              "score": 4,
              "num_children": 0,
              "author": 79221,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ing6foa",
      "text": "He’s been considering retirement. If that’s any indication of where catholicism stands in modern times, two back to back popes would have “retired”.  \n\nDon’t think for a minute this dude will be tackling anything of substance, there’s too much money involved to shake things up.",
      "timestamp": "2022-09-07 13:38:24",
      "score": 57,
      "num_children": 1,
      "author": 336694,
      "replies": [
        {
          "id": "ing9gtw",
          "text": "If he's retiring, shake it up and walk away. Make some really poignant, clear statements, publicly swear to god that it's true, and step back.",
          "timestamp": "2022-09-07 14:00:05",
          "score": 24,
          "num_children": 4,
          "author": 166115,
          "replies": [
            {
              "id": "ingwjbm",
              "text": "You're assuming he actually wants to do something about it but is prevented from doing so by the organization.  I don't think this is true.",
              "timestamp": "2022-09-07 16:32:16",
              "score": 15,
              "num_children": 0,
              "author": 260534,
              "replies": []
            },
            {
              "id": "ing9w3j",
              "text": "I agree. But retiring is a mark of shame for a post that’s supposedly in communication with their god, so whatever change he attempts to introduce will be stained with the defeat of retirement. He’ll immediately be persona non grata.",
              "timestamp": "2022-09-07 14:03:05",
              "score": 8,
              "num_children": 0,
              "author": 336694,
              "replies": []
            },
            {
              "id": "ingmbya",
              "text": "You've mistaken him for a man who actually cares about children. He's just there to look like he cares, not to actually do anything.",
              "timestamp": "2022-09-07 15:26:46",
              "score": 18,
              "num_children": 1,
              "author": 11896,
              "replies": [
                {
                  "id": "ingr65q",
                  "text": "I don’t believe he cares about anything except status quo. Religion is the biggest MLM ever set loose on this planet and nothing has disproven this to me yet.",
                  "timestamp": "2022-09-07 15:58:08",
                  "score": 9,
                  "num_children": 0,
                  "author": 336694,
                  "replies": []
                }
              ]
            },
            {
              "id": "inhbxf2",
              "text": "But he has to want to make these changes, i have zero reason to believe he does",
              "timestamp": "2022-09-07 18:08:18",
              "score": 6,
              "num_children": 0,
              "author": 215082,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ingfoj0",
      "text": "Usual church propaganda.  The \"joke\" about priests liking little boys has been around for hundreds of years.  This behavior didn't just start happening, it's an established cultural trait found in the church.",
      "timestamp": "2022-09-07 14:42:46",
      "score": 44,
      "num_children": 2,
      "author": 174838,
      "replies": [
        {
          "id": "inh9o30",
          "text": "Roman pagan temple leaders converted to Christianity as a means to maintain power and control. Given the norms of the Romans, you'd likely be absolutely correct to say it's at the very founding of the church.",
          "timestamp": "2022-09-07 17:54:11",
          "score": 17,
          "num_children": 0,
          "author": 224654,
          "replies": []
        },
        {
          "id": "inhryox",
          "text": "It was when they required Priests and Nuns to be celibate so they couldn't give their property to their heirs so it would go to the church that I'd imagine the sexual abuse became a real problem.",
          "timestamp": "2022-09-07 19:48:22",
          "score": 9,
          "num_children": 0,
          "author": 376584,
          "replies": []
        }
      ]
    },
    {
      "id": "ing3ar1",
      "text": "Open the Vatican archives to the press. It would take very little effort.",
      "timestamp": "2022-09-07 13:15:02",
      "score": 23,
      "num_children": 0,
      "author": 286151,
      "replies": []
    },
    {
      "id": "ingau0t",
      "text": "I really wish we didn't HAVE to care about the leader of an imaginary friend fanclub full of bigotry and hate has to say, but here we are.",
      "timestamp": "2022-09-07 14:09:44",
      "score": 29,
      "num_children": 0,
      "author": 388300,
      "replies": []
    },
    {
      "id": "ing8te7",
      "text": "I caught shit when I called this guy the \"PR Pope\" when he was elected. The Vatican isn't stupid, they knew they needed a better front man after Ratzinger, so they picked this guy.\n\nOf course they never intended to actually solve their pedo problem.",
      "timestamp": "2022-09-07 13:55:25",
      "score": 114,
      "num_children": 7,
      "author": 338285,
      "replies": [
        {
          "id": "ingfq9q",
          "text": "Of course not. Pedophilia is baked into the cake called Catholic Church and the Pope is the cherry on top of the cake.",
          "timestamp": "2022-09-07 14:43:05",
          "score": 41,
          "num_children": 1,
          "author": 223053,
          "replies": [
            {
              "id": "ingzkqz",
              "text": "Then I guess they have to…\n\n*puts on sunglasses*\n\n…pop a few cherries.",
              "timestamp": "2022-09-07 16:51:23",
              "score": 10,
              "num_children": 2,
              "author": 349629,
              "replies": [
                {
                  "id": "inkac06",
                  "text": "Contextual issues...",
                  "timestamp": "2022-09-08 08:09:28",
                  "score": 3,
                  "num_children": 0,
                  "author": 41594,
                  "replies": []
                },
                {
                  "id": "inknuna",
                  "text": "Yes officer this comment right here.",
                  "timestamp": "2022-09-08 11:05:19",
                  "score": 1,
                  "num_children": 0,
                  "author": 321808,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "inhgr2i",
          "text": "This sub was a dumpster fire in the earlier years of PR Pope.  \"OMG, the pope is good now?!?!\"  posts daily.  Really made me lose respect for the average user on this sub, and now only see it on /r/all.",
          "timestamp": "2022-09-07 18:39:02",
          "score": 10,
          "num_children": 0,
          "author": 78375,
          "replies": []
        },
        {
          "id": "inhdwmi",
          "text": "Yup, he says all sorts of seemingly progressive things, in terms of politics, climate change, wage gaps, even women at times etc. Trying to rebrand their image to be more appealing to young people so they keep the new blood of children to molest coming in. \n\nWho cares what the Pope thinks about income inequality, when he still allows a plague of child rapists to infest his clergy?",
          "timestamp": "2022-09-07 18:20:53",
          "score": 14,
          "num_children": 1,
          "author": 333872,
          "replies": [
            {
              "id": "inhzfxh",
              "text": "They hired a former Fox News PR person at the beginning during that big media blitz.\n\nI said it then and it's clearly obvious by now - it's all for show.",
              "timestamp": "2022-09-07 20:33:26",
              "score": 6,
              "num_children": 0,
              "author": 135618,
              "replies": []
            }
          ]
        },
        {
          "id": "ingqte0",
          "text": "Hey now, Ratzinger is Pope Sidious to you!",
          "timestamp": "2022-09-07 15:55:53",
          "score": 4,
          "num_children": 0,
          "author": 309601,
          "replies": []
        },
        {
          "id": "inhhtto",
          "text": "The south park episode said it the best.",
          "timestamp": "2022-09-07 18:45:47",
          "score": 5,
          "num_children": 1,
          "author": 268090,
          "replies": [
            {
              "id": "inicv4i",
              "text": "Does the pope shit in the woods? ^^and ^^protect ^^pedophiles?",
              "timestamp": "2022-09-07 21:58:29",
              "score": 2,
              "num_children": 1,
              "author": 250708,
              "replies": [
                {
                  "id": "iniesnw",
                  "text": "Protect child rapists*",
                  "timestamp": "2022-09-07 22:11:26",
                  "score": 3,
                  "num_children": 1,
                  "author": 268090,
                  "replies": [
                    {
                      "id": "iniio23",
                      "text": "Got banned for saying it before",
                      "timestamp": "2022-09-07 22:37:57",
                      "score": 1,
                      "num_children": 1,
                      "author": 250708,
                      "replies": [
                        {
                          "id": "inimsep",
                          "text": "Well thats stupid. We really need to start differentiating child rapists from pedophiles.",
                          "timestamp": "2022-09-07 23:07:09",
                          "score": 3,
                          "num_children": 0,
                          "author": 268090,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "inhohfk",
          "text": "Make no mistake - their coddling of pedophiles is a biiiig recruitment tool for priests:\n\n\"Hey, dude, do you like molesting little boys? Are you frustrated because you might get caught and have to go to prison for a very long time, where you'll have the shit kicked out of you by inmates who don't like kiddie diddlers?  \n\n\"Well, worry no more. Here at the katholic church, we understand your needs and problems, and will do our very best to protect you should you be found out as a kiddie diddler. We'll move you from parish to parish, deny you have a problem, pretend to send you to counseling, and do whatever is necessary to ensure you continue to enjoy your little kink, especially if you look hot dressed all in black with an offsetting bright white collar! \n\n\"For those already enrolled, there will be a choir boy pageant and runway walk at 4:30 in the main hall. Come and check out this month's collection of supple young boys! Sacramental wine and canapes will be served.\"",
          "timestamp": "2022-09-07 19:27:24",
          "score": 6,
          "num_children": 0,
          "author": 114177,
          "replies": []
        },
        {
          "id": "ingw47h",
          "text": "It's probably why Ratzinger retired. And then, conveniently, he gets to live out his life behind the walls of a \"sovereign state\", subject to no law but his own.",
          "timestamp": "2022-09-07 16:29:35",
          "score": 9,
          "num_children": 0,
          "author": 260534,
          "replies": []
        }
      ]
    },
    {
      "id": "infzuba",
      "text": "Wouldn't be surprised if the Pope was involved as well.",
      "timestamp": "2022-09-07 12:47:59",
      "score": 22,
      "num_children": 1,
      "author": 225382,
      "replies": [
        {
          "id": "ingmddv",
          "text": "I would be more surprised if he wasn't",
          "timestamp": "2022-09-07 15:27:01",
          "score": 15,
          "num_children": 0,
          "author": 11896,
          "replies": []
        }
      ]
    },
    {
      "id": "ing9nlj",
      "text": "I think the molestation is a feature of priesthood not a bug.",
      "timestamp": "2022-09-07 14:01:24",
      "score": 20,
      "num_children": 0,
      "author": 74321,
      "replies": []
    },
    {
      "id": "inga5uq",
      "text": "\"We openly have zero tolerance for child rape. And what tolerate privately is none of your business.\"",
      "timestamp": "2022-09-07 14:04:57",
      "score": 18,
      "num_children": 0,
      "author": 292248,
      "replies": []
    },
    {
      "id": "ingap4v",
      "text": "Oh, the Pope is full of shit? Who would have thought.",
      "timestamp": "2022-09-07 14:08:46",
      "score": 14,
      "num_children": 0,
      "author": 333450,
      "replies": []
    },
    {
      "id": "ingmubz",
      "text": "The buffalo diocese just reinstated 17 priests all who were accused of abuse. No explanation, no nothing. Just put back to work like everything is normal. But as long as they can keep the donations flowing ammirite?",
      "timestamp": "2022-09-07 15:30:06",
      "score": 15,
      "num_children": 1,
      "author": 95201,
      "replies": [
        {
          "id": "inh8e0m",
          "text": "See, this is why I'm confused. How do all the conspiracy nuts go all-in on \"Pizzagate\" why blithely walking past this noise?\n\nWe KNOW where the pedophiles are - why aren't the pitchfork mobs showing up to THAT location?",
          "timestamp": "2022-09-07 17:46:12",
          "score": 7,
          "num_children": 2,
          "author": 122266,
          "replies": [
            {
              "id": "inhtiek",
              "text": "They don't serve pizza?",
              "timestamp": "2022-09-07 19:57:39",
              "score": 5,
              "num_children": 0,
              "author": 180358,
              "replies": []
            },
            {
              "id": "inijlkz",
              "text": "Not sure if you're asking rhetorically or not, but to answer anyway - because conspiracy theories are never about the actual conspiracy, they're about the beliefs and policies the conspiracies justify. That's why arguing against them with factual evidence isn't very effective; even if you managed to shake the theorist's belief, they'd just move on to a new one to rationalize the same shit.\n\nIt's kinda depressing :/",
              "timestamp": "2022-09-07 22:44:30",
              "score": 2,
              "num_children": 0,
              "author": 216623,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "inge4jv",
      "text": "When it comes to the history of the Catholic Church, there is no reason for the entire thing to NOT be burned to the ground. It has always been an excuse for colonialism, rape, torture, murder, genocide, lies, greed - the list is long. There is no reason for it to exist at all, and it has never done anything good anywhere. Ever.",
      "timestamp": "2022-09-07 14:32:23",
      "score": 41,
      "num_children": 0,
      "author": 305461,
      "replies": []
    },
    {
      "id": "ing7gj4",
      "text": "Come on, this is a smoke screen so the religious can have morals too. It's not about doing anything, it's about looking like you're doing something. Which is literally the definition of Christian morality.",
      "timestamp": "2022-09-07 13:45:46",
      "score": 10,
      "num_children": 1,
      "author": 173097,
      "replies": [
        {
          "id": "inidy2f",
          "text": "Don't forget those thoughts and prayers.  (Also, does nothing)",
          "timestamp": "2022-09-07 22:05:41",
          "score": 3,
          "num_children": 0,
          "author": 22681,
          "replies": []
        }
      ]
    },
    {
      "id": "infzq6a",
      "text": "I mean, at this point, I wouldn't be surprised if the pope was the biggest of the child rapists. Maybe that's how you become pope -- having the highest rape numbers.",
      "timestamp": "2022-09-07 12:47:04",
      "score": 103,
      "num_children": 5,
      "author": 178636,
      "replies": [
        {
          "id": "ing3tgz",
          "text": "This is what happens when you preach celibacy as a virtue and repress a very natural thing.",
          "timestamp": "2022-09-07 13:18:58",
          "score": 48,
          "num_children": 1,
          "replies": [
            {
              "id": "inhxdvt",
              "text": "Celibacy doesn’t cause pedophilia. Pedophiles are going to gravitate to places with other pedophiles and/or positions with easy access to children, and it’s no secret the Catholic Church is full of both of those.",
              "timestamp": "2022-09-07 20:21:01",
              "score": 10,
              "num_children": 2,
              "author": 395042,
              "replies": [
                {
                  "id": "inkqm9w",
                  "text": ">Celibacy doesn’t cause pedophilia.\n\nIt definitely has a horrible effect on mental and sexual health when it's forced upon adolescents.",
                  "timestamp": "2022-09-08 11:34:02",
                  "score": 1,
                  "num_children": 1,
                  "author": 252875,
                  "replies": [
                    {
                      "id": "inlrr7x",
                      "text": "Priests are adults who choose celibacy to become priests.",
                      "timestamp": "2022-09-08 16:06:28",
                      "score": 1,
                      "num_children": 1,
                      "author": 395042,
                      "replies": [
                        {
                          "id": "inorl9m",
                          "text": "That is actually not true.",
                          "timestamp": "2022-09-09 04:36:15",
                          "score": 1,
                          "num_children": 0,
                          "author": 252875,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "inl66v1",
                  "text": "It does exclude people with \"normal\" sexual appetites who want to find a long term partner and perhaps start a family of their own.  The priesthood selects its members from a pool of people who are willing to consent to being sexually repressed.  It's no surprise they end up with a few bad apples.\n\nChurches that allow and encourage their ministers to marry and have families don't seem to have nearly the same issues.",
                  "timestamp": "2022-09-08 13:43:43",
                  "score": 1,
                  "num_children": 0,
                  "author": 377087,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "inghj7a",
          "text": "I mean, hes the pope, hes literally the king of pedos",
          "timestamp": "2022-09-07 14:55:02",
          "score": 13,
          "num_children": 0,
          "author": 290390,
          "replies": []
        },
        {
          "id": "ing8weo",
          "text": "wow, i see what Epstein was trying to do now",
          "timestamp": "2022-09-07 13:56:01",
          "score": 13,
          "num_children": 2,
          "author": 281617,
          "replies": [
            {
              "id": "inhca3k",
              "text": "oh man....riddle solved",
              "timestamp": "2022-09-07 18:10:31",
              "score": 6,
              "num_children": 0,
              "author": 153643,
              "replies": []
            },
            {
              "id": "ini0ugr",
              "text": "He was just helping Bill Barr gather intelligence for blackmail.",
              "timestamp": "2022-09-07 20:41:56",
              "score": 2,
              "num_children": 0,
              "author": 213322,
              "replies": []
            }
          ]
        },
        {
          "id": "inhm3ya",
          "text": "Literally every priest is a rapist. Its always been an open secret. Everybody knew. And no catholic in history has ever cared. They were always happy to hand over their kids to the cult lmao",
          "timestamp": "2022-09-07 19:12:51",
          "score": 3,
          "num_children": 2,
          "replies": [
            {
              "id": "inikw5f",
              "text": "This might sound like a \"not all catholics wahhh\" thing, but I think it's actually important to bring up - part of the problem is that the non-rapist priests and the catholics who do/would care are leaving the church, for the obvious and some less obvious reasons, so there's no one on the inside to hold people accountable. I've got a family friend who's a real person with a functioning moral compass who finished seminary and then couldn't get a placement as a priest because all the possible churches were openly requiring conservative political alignment for the job. It's pretty bad.",
              "timestamp": "2022-09-07 22:53:39",
              "score": 3,
              "num_children": 1,
              "author": 216623,
              "replies": [
                {
                  "id": "inil8z1",
                  "text": "It's been pure evil since its inception. And anyone who willingly associates with it is evil. I don't feel the slightest bit bad for any of them.",
                  "timestamp": "2022-09-07 22:56:12",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "iniruvn",
                      "text": "Oh, you were not using hyperbole.",
                      "timestamp": "2022-09-07 23:44:19",
                      "score": 1,
                      "num_children": 0,
                      "author": 216623,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "inhqza5",
              "text": "Maybe this is why the hardline anti-choice stance",
              "timestamp": "2022-09-07 19:42:30",
              "score": 1,
              "num_children": 0,
              "author": 180358,
              "replies": []
            }
          ]
        },
        {
          "id": "ing043w",
          "text": "[removed]",
          "timestamp": "2022-09-07 12:50:05",
          "score": -7,
          "num_children": 1,
          "replies": [
            {
              "id": "ing0fuf",
              "text": "Aww like I give a shit. Just like the pope with those kids.",
              "timestamp": "2022-09-07 12:52:38",
              "score": 14,
              "num_children": 1,
              "author": 178636,
              "replies": [
                {
                  "id": "ingdqxi",
                  "text": "Damn, that is a sick burn",
                  "timestamp": "2022-09-07 14:29:47",
                  "score": 1,
                  "num_children": 0,
                  "author": 406939,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ingawcm",
      "text": "His Assholiness Pope Francis. Supposed to be God's representative on Earth. Kinda fits, they both pieces of shit, even if one of them is fictional. Never liked this pope, or any pope, but at least the last one looked like a demon.",
      "timestamp": "2022-09-07 14:10:11",
      "score": 9,
      "num_children": 0,
      "author": 75840,
      "replies": []
    },
    {
      "id": "ingk4px",
      "text": "Until the church actually starts throwing these pedo fucks under the bus (figuratively or literally, doesn't matter to me), I'm going to continue assuming every member of their clergy is a sex offender.",
      "timestamp": "2022-09-07 15:12:17",
      "score": 10,
      "num_children": 0,
      "author": 269629,
      "replies": []
    },
    {
      "id": "ingmnfl",
      "text": "The Holy See is the largest, oldest, criminal organization and cult on Earth.\n\nTax them on all property, worldwide.",
      "timestamp": "2022-09-07 15:28:51",
      "score": 10,
      "num_children": 1,
      "author": 10136,
      "replies": [
        {
          "id": "ingvfpp",
          "text": "Tax? Confiscate.",
          "timestamp": "2022-09-07 16:25:19",
          "score": 7,
          "num_children": 0,
          "author": 135471,
          "replies": []
        }
      ]
    },
    {
      "id": "ingnpw4",
      "text": "Strange how 'zero tolerance' bears more of a resemblance to 'full support'.",
      "timestamp": "2022-09-07 15:35:54",
      "score": 9,
      "num_children": 0,
      "author": 176419,
      "replies": []
    },
    {
      "id": "ingxb7i",
      "text": "Cardinal Law (The archbishop in Boston who resigned after covering up evidence and impeding investigations into pedophilia by catholic priests) was sheltered by Pope John Paul II, who appointed Law to a post in Rome, as Archpriest of the Basilica di Santa Maria Maggiore. This entitled him to sit on the Holy See, the voting body which decides who the Pope is. He voted in the election (papal enclave) that brought the current pope into power in 2013. never take the word of any Pope regarding what their policy is. They will pay lip-service to anything politics require, but their core beliefs will never change. It would be blasphemy. They are lunatics who claim to speak for God on earth and will always serve themselves first. There is no organization that fits the classic description of evil more completely than the one represented by this decrepit bunch, and they have made it very clear where they actually sit on this issue.",
      "timestamp": "2022-09-07 16:37:09",
      "score": 9,
      "num_children": 0,
      "author": 229770,
      "replies": []
    },
    {
      "id": "ing8nm6",
      "text": "The pope can go fuck himself along with the whole structure of the church.",
      "timestamp": "2022-09-07 13:54:16",
      "score": 7,
      "num_children": 1,
      "author": 201981,
      "replies": [
        {
          "id": "injm7ze",
          "text": "You my friend are gonna love this song!\n\nhttps://youtu.be/Sph8Qu8wLAk",
          "timestamp": "2022-09-08 03:37:08",
          "score": 2,
          "num_children": 1,
          "author": 127300,
          "replies": [
            {
              "id": "inkqqa5",
              "text": "Brilliant.",
              "timestamp": "2022-09-08 11:35:07",
              "score": 2,
              "num_children": 1,
              "author": 201981,
              "replies": [
                {
                  "id": "inkzbv9",
                  "text": "Pope came to my country (Canada) this summer to \"apologie\" to first nations treatment in residential schools. I've been sharing this a lot locally!",
                  "timestamp": "2022-09-08 12:51:28",
                  "score": 2,
                  "num_children": 0,
                  "author": 127300,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ing7w53",
      "text": "Sure, but what do you expect him to say?\n\n\"Sure our tolerance rate isn't zero, it's more like about 40%.\"",
      "timestamp": "2022-09-07 13:48:50",
      "score": 6,
      "num_children": 3,
      "author": 104495,
      "replies": [
        {
          "id": "ing9at7",
          "text": "Dudesan put it very well in the FAQ:\n\nhttps://www.reddit.com/r/atheism/wiki/faq#wiki_the_pope_is_not_all_that_bad.21\n\nThat's what the Pope should say and do.",
          "timestamp": "2022-09-07 13:58:53",
          "score": 6,
          "num_children": 0,
          "author": 286151,
          "replies": []
        },
        {
          "id": "inghjv2",
          "text": "If the pope don’t go to Heaven, nobody will (well nobody does, but using the criteria for the fiction it applies). So I expect him to either loudly and with all his power fight this, or if he is indeed just a PR figure very loudly and publicly resign and do the wiki leak of the century.\n\nWhat he is doing is lying, i.e. bearing false witness.",
          "timestamp": "2022-09-07 14:55:09",
          "score": 3,
          "num_children": 1,
          "author": 242458,
          "replies": [
            {
              "id": "iniujlj",
              "text": "Good. Most of the churches lies are about things we can't disprove. We need to catch them in more lies, in courts, and bring the whole tower of cards tumbling down",
              "timestamp": "2022-09-08 00:04:27",
              "score": 1,
              "num_children": 0,
              "author": 104495,
              "replies": []
            }
          ]
        },
        {
          "id": "ingmqxc",
          "text": "Saying nothing would be better than a blatant lie",
          "timestamp": "2022-09-07 15:29:29",
          "score": 2,
          "num_children": 1,
          "author": 11896,
          "replies": [
            {
              "id": "iniu7mp",
              "text": "Buddy, you're not aware the church lies? I'm not sure it does anything else.",
              "timestamp": "2022-09-08 00:02:02",
              "score": 1,
              "num_children": 0,
              "author": 104495,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ingjp0m",
      "text": "If the pope did that it would likely close hundreds if not thousands of churches globally and could finally drive a stake through the heart of mother church (and good riddance).",
      "timestamp": "2022-09-07 15:09:21",
      "score": 7,
      "num_children": 0,
      "author": 323890,
      "replies": []
    },
    {
      "id": "inhewj9",
      "text": "The Catholic Church is probably the biggest pedophile ring in the world.",
      "timestamp": "2022-09-07 18:27:18",
      "score": 6,
      "num_children": 1,
      "author": 218432,
      "replies": [
        {
          "id": "inkkutg",
          "text": "\"\"\"\"\"probably\"\"\"\"\"",
          "timestamp": "2022-09-08 10:31:57",
          "score": 1,
          "num_children": 0,
          "author": 301533,
          "replies": []
        }
      ]
    },
    {
      "id": "ingctig",
      "text": "The popes just another king, albeit an elected one. Why do we tolerate their perverted regime shoving their standards in our faces?",
      "timestamp": "2022-09-07 14:23:27",
      "score": 5,
      "num_children": 0,
      "author": 230593,
      "replies": []
    },
    {
      "id": "ingy4v1",
      "text": "in truth, the Church can't change these rules, because it would involve changing previous \"infallible\" rulings on catholic Doctrine. \n\nif they acknowledged that they were helping child rapists both get away with, and continue to rape kids, then at the very least people would start questioning all the OTHER things they've claimed throughout their existence. They've spent 2000 years acting like their priests are somehow \"above humanity\" b/c of celibacy, prayer, all the Church education they get.....so acknowledging that priests are capable of human failings, they're afraid that the people they deliberately encourage to be uneducated *might stop believing in them.*\n\nif THAT happens, how will they continue getting tax free money and diplomatic immunity for unrepentant criminals? /S",
      "timestamp": "2022-09-07 16:42:19",
      "score": 6,
      "num_children": 0,
      "author": 22223,
      "replies": []
    },
    {
      "id": "inhn281",
      "text": "[deleted]",
      "timestamp": "2022-09-07 19:18:46",
      "score": 6,
      "num_children": 1,
      "replies": [
        {
          "id": "ininjhw",
          "text": "Out of curiosity, do you know of any examples of Catholic priests being caught admitting they don't actually believe in God? I've seen a couple articles about Evangelical pastors along those lines, but don't remember any Catholic ones.\n\nI wonder because my read, especially regarding the lower-level leadership (priests, deacons) is that many of them have actually twisted their brain into a knot to somehow reconcile a genuine belief in an all-loving God with their monstrous behavior.",
          "timestamp": "2022-09-07 23:12:38",
          "score": 1,
          "num_children": 1,
          "author": 216623,
          "replies": [
            {
              "id": "iniog00",
              "text": "[deleted]",
              "timestamp": "2022-09-07 23:19:13",
              "score": 2,
              "num_children": 1,
              "replies": [
                {
                  "id": "inioxa1",
                  "text": "Huh. Til.",
                  "timestamp": "2022-09-07 23:22:38",
                  "score": 1,
                  "num_children": 0,
                  "author": 216623,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ingk1l4",
      "text": "Also he would open up their fucking records to the public so we can know the names and details of every abuser/genocidal maniac since their records began. Also the names of the victims.",
      "timestamp": "2022-09-07 15:11:42",
      "score": 4,
      "num_children": 0,
      "author": 353671,
      "replies": []
    },
    {
      "id": "ingni5x",
      "text": "He can't lose that amount of men in the priesthood and still be able to run the church. In the end, it's still a business decision.",
      "timestamp": "2022-09-07 15:34:29",
      "score": 4,
      "num_children": 0,
      "author": 216152,
      "replies": []
    },
    {
      "id": "ingrx5v",
      "text": "If you really cared he would close his church",
      "timestamp": "2022-09-07 16:02:57",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ingwjce",
      "text": "Well since he made John Paul Deuce, the asswipe who hid many pedophile priest, bishops, and cardinals from prosecution, a fucking Saint, I say bullshit.",
      "timestamp": "2022-09-07 16:32:16",
      "score": 4,
      "num_children": 0,
      "author": 35268,
      "replies": []
    },
    {
      "id": "inh0h8w",
      "text": "I’m just curious, does the pope have like supreme power over all of church politics? I mean, how much power does he really have in all these? I feel like it’s akin to the queen with symbolically holding power. Does the American evangelist even care what the Pope says?",
      "timestamp": "2022-09-07 16:57:05",
      "score": 4,
      "num_children": 3,
      "author": 56089,
      "replies": [
        {
          "id": "inh95xp",
          "text": "Protestants do not care about Pope stuff, thats the whole point of Lutherans etc... they \"protested\" the Catholic way of things = Protestant.",
          "timestamp": "2022-09-07 17:51:02",
          "score": 3,
          "num_children": 0,
          "author": 122266,
          "replies": []
        },
        {
          "id": "ini7cza",
          "text": "No, he is not a monarch. But people love their own narratives. Ps I hate pretty much all religions and religious institutes because they spread lies and perpetuate ignorance. Exactly like this garbage post.",
          "timestamp": "2022-09-07 21:22:34",
          "score": 1,
          "num_children": 0,
          "author": 392054,
          "replies": []
        },
        {
          "id": "inimdv4",
          "text": "The Pope ostensibly has absolute power over the Catholic Church, although the reality of the matter is likely more complicated. He absolutely DOES have enough power to do something about huge systemic problems like this - one of the explicit powers of the Pope is excommunication, and it's hard to be a Catholic priest (or bishop etc) if you're not even Catholic anymore.\n\nProtestants, which constitute the majority of Christians, do not recognize the authority of the Pope, and he has no power over them. American Evangelicals mostly hate him, because even his lukewarm public statements re:climate change and stuff are too progressive for them.\n\nI'd liken it more to Emperor Hirohito than the Queen - he has a lot of power, but is hesitant to use it for political reasons.",
          "timestamp": "2022-09-07 23:04:17",
          "score": 1,
          "num_children": 0,
          "author": 216623,
          "replies": []
        }
      ]
    },
    {
      "id": "inh1sb7",
      "text": "Francis was installed 10 years before he ever stated that he was putting predator priests on notice. Waiting until your victims have aged out of the abuse is not zero tolerance, it's abetting the crime.",
      "timestamp": "2022-09-07 17:05:18",
      "score": 4,
      "num_children": 0,
      "author": 275385,
      "replies": []
    },
    {
      "id": "ink6vim",
      "text": "Let's be honest, if he actually cared about protecting kids there's absolutely no way he'd be in that position in the first place.\n\nHe's already contributed to disgusting acts. Whether directly or indirectly he's partly to blame!",
      "timestamp": "2022-09-08 07:22:40",
      "score": 5,
      "num_children": 0,
      "author": 202887,
      "replies": []
    },
    {
      "id": "inge2s6",
      "text": "Everyone, I \\*have\\* to recommend Hemant Mehta and Bob Seidensticker (both in [OnlySky.media](https://OnlySky.media)) as being AMAZINGLY straightforward, in-depth, yet super easy to understand thinkers/writers.  Each has this way of 'cutting through the BS' to get to the heart of often-complex theological issues, in an exceptionally easy to follow, common-sense way.\n\nThat said, Pope ain't gonna change.  He's the head of an exceptionally powerful, exceptionally influential organization that goes WAAAAAYYYYYYY back; and like it or not - in good times and in bad; they's them Catholics.  They're the very same Catholics that were gonna host a Public Banquet and roast Galileo for his discovering that the Earth goes around the Sun - which was **not** what the Catholic Church had been teaching for 1600+ years.  \n\n1) \"You know, we been teachin' this for 1600 years; that's a long time, right?  *RIGHT??*  So, WE must be **RIGHT**, and YOU must be **WRONG**.  *Keep yer mouth shut, fella*, or we'll *burn you at the stake in public* ('cause we're Religious 'n all, and we don't allow no shedding of blood in OUR church!, *not even if you're having your period*... because women are just *nasty things that tempt us righteous men*....)\"\n\n2) \"Mr Hitler, you go right ahead and eliminate them Jews; We's the Catholics; **we** is to be the Real Deal.  Yeah, yeah, I know Jesus WAS a Jew, but - he saw the Light (wink, wink) and became a Christian; yeah, you go ahead and get rid of 'em - OH, WHAT'S THIS?  The ALLIES are winning??  Hey, Guys, yes, yes, you were **right** \\- *this Hitler guy, he's GOT TO GO*.....\"\n\n3) \"Child molestations?  In CHURCH?  WTF are you even talking about?\"\n\n4) [https://en.wikipedia.org/wiki/The\\_Magdalene\\_Sisters](https://en.wikipedia.org/wiki/The_Magdalene_Sisters)\n\n5) Add about 6,837 pages of the above, below....",
      "timestamp": "2022-09-07 14:32:03",
      "score": 11,
      "num_children": 2,
      "author": 174957,
      "replies": [
        {
          "id": "inilhtv",
          "text": "Wait, didn't the Nazis also persecute Catholics (to a lesser extent than Jews, obviously) or am I remembering high school history wrong?",
          "timestamp": "2022-09-07 22:57:56",
          "score": 2,
          "num_children": 2,
          "author": 216623,
          "replies": [
            {
              "id": "inio2r5",
              "text": "Sorry; someone else will have to answer that one - but I wouldn't be surprised at all...",
              "timestamp": "2022-09-07 23:16:31",
              "score": 2,
              "num_children": 0,
              "author": 174957,
              "replies": []
            },
            {
              "id": "inioofh",
              "text": "Not really. The Catholic Church refused to get involved. They did some good things by helping Jews escape, but they also did the same for Nazis after the war to protect war criminals. They didn't oppose one another. \n\nThe acts of outcry and rebellion against the Nazis were purely the acts of individual Catholics with no backing from the church itself. Certainly not publicly.",
              "timestamp": "2022-09-07 23:20:54",
              "score": 2,
              "num_children": 0,
              "author": 223197,
              "replies": []
            }
          ]
        },
        {
          "id": "ini8pfp",
          "text": "I wish I had this much energy to write fan fiction about people I hate. Thanks for the words!",
          "timestamp": "2022-09-07 21:31:16",
          "score": 1,
          "num_children": 1,
          "author": 176036,
          "replies": [
            {
              "id": "inipl2p",
              "text": "Thank you... I *think?*  Fan?  *Fiction????*",
              "timestamp": "2022-09-07 23:27:28",
              "score": 2,
              "num_children": 0,
              "author": 174957,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "inh4uhb",
      "text": "That’s the great thing about religion. It normalizes lies",
      "timestamp": "2022-09-07 17:24:21",
      "score": 3,
      "num_children": 0,
      "author": 195161,
      "replies": []
    },
    {
      "id": "ini5l5t",
      "text": "Francis made Pell a Cardinal. Pell restructured the Catholic Church in Australia so that it technically does not exist as a single organisation. Each diocese is independent. This was done to limit the financial reparations to rape victims.\n\nPell was supposed to help set the rest of the Church up the same way internationally. He was also supposed to stop the corruption in the Vatican bank and extricate it from Mafia money laundering.",
      "timestamp": "2022-09-07 21:11:15",
      "score": 3,
      "num_children": 0,
      "author": 377396,
      "replies": []
    },
    {
      "id": "inj6inn",
      "text": "Christians curiously are okay with child molestation - not just catholics.  I read that trumps approval rating with the evangeliban is above 60% - ***and trump bragged about watching teenage girls (under 18) get naked on the Howard Stern show.***  That's statutory child molestation.  Christians think he's \"god's chosen one\".\n\nChristian: \"Child molestation - meh.\"\n\ntrump suggested that people get vaccinated against COVID and he actually got bood.  \n\nChristian: \"vaccination?!?  WTF!?!?\"\n\n---\n\nreligion == brain worms.",
      "timestamp": "2022-09-08 01:31:39",
      "score": 3,
      "num_children": 0,
      "author": 270909,
      "replies": []
    },
    {
      "id": "ink9kp8",
      "text": "The Catholic Church is the world's most powerful and protected pedo ring.\nThe only way it will ever change is when everyone turns their back on it.",
      "timestamp": "2022-09-08 07:59:00",
      "score": 3,
      "num_children": 0,
      "author": 340913,
      "replies": []
    },
    {
      "id": "ingsgpo",
      "text": "The entire global organization from parishioners to pope are complicit.",
      "timestamp": "2022-09-07 16:06:26",
      "score": 2,
      "num_children": 0,
      "author": 8775,
      "replies": []
    },
    {
      "id": "ingwcbf",
      "text": ">Pope Francis is lying...\n\nThat's all the headline needs to be.",
      "timestamp": "2022-09-07 16:31:02",
      "score": 2,
      "num_children": 0,
      "author": 155543,
      "replies": []
    },
    {
      "id": "ingxwcw",
      "text": "Until the Catholic Church hands over all records of suspected rapists to the specific, local authorities they are complicit in, and condone through their actions, the sexual abuse and rape of children by clergy members.",
      "timestamp": "2022-09-07 16:40:51",
      "score": 2,
      "num_children": 0,
      "author": 77122,
      "replies": []
    },
    {
      "id": "ingzey3",
      "text": "the church lie? never!!!!",
      "timestamp": "2022-09-07 16:50:23",
      "score": 2,
      "num_children": 0,
      "author": 248981,
      "replies": []
    },
    {
      "id": "inh3z5u",
      "text": "The Catholic Church lying?!? Who would have thunk???\n( <-- Yes, I know \"thunk\" is misspelled )\n\nThe underlying theory here has always been that if you can be made to believe in an invisible man in the sky, you are primed for anything. And people talk about grooming.\n\nEVERY. RELIGION. IS. A. SCAM.\n\nI'm here all week.",
      "timestamp": "2022-09-07 17:19:00",
      "score": 2,
      "num_children": 0,
      "author": 240980,
      "replies": []
    },
    {
      "id": "inh61mj",
      "text": "How real is your god when it takes a mortal to say, \"fucking kids and raping nuns is bad.\"\n\nYou'd think the big sky daddy would have made it abundantly clear early on...but nah.",
      "timestamp": "2022-09-07 17:31:43",
      "score": 2,
      "num_children": 0,
      "author": 24449,
      "replies": []
    },
    {
      "id": "inhfych",
      "text": "But then he would lose all support, because there are so many pedophiles in the Catholic Church. The real reason he does nothing. I genuinely don't think he's a part of it, but caring more about his personal position than children being raped is... kind of the opposite of what Jesus was going for?",
      "timestamp": "2022-09-07 18:34:00",
      "score": 2,
      "num_children": 0,
      "author": 262824,
      "replies": []
    },
    {
      "id": "inhit0c",
      "text": "ACAB\n\nAll catholics are bastards.\n\nIf you are a member of the catholic church and you don't actively fight against the rampant child rape happening in the organization you financially support then you are part of the problem.\n\nYou know what happens if any organization I am a part of turns out to be a rape factory? I stop being part of that organization.",
      "timestamp": "2022-09-07 18:51:57",
      "score": 2,
      "num_children": 0,
      "author": 200167,
      "replies": []
    },
    {
      "id": "inhjbs0",
      "text": "I still don't understand how church authorities are not being thrown in jail for helping cover up these crimes, even if they claim to be investigating them. I can't imagine any other organization claiming the right to investigate themselves without notifying law enforcement. Could you imagine any contractor or cleaning service that was on somebody's property being accused of molestation or stealing jewelry and claiming the right to investigate themselves?",
      "timestamp": "2022-09-07 18:55:17",
      "score": 2,
      "num_children": 0,
      "author": 369404,
      "replies": []
    },
    {
      "id": "inhkeug",
      "text": "He's just as evil as the pedophiles, if the devil existed his seat would be in the Vatican.",
      "timestamp": "2022-09-07 19:02:07",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "inhm52u",
      "text": "I think the recruitment campaign featuring billboards saying **\"Come see us for the God, stay for the child rape and molestation!\"** could probably use some toning down.\n\nA larger group of hateful, evil, greedy, wealthy, power hungry child molesting shitpile of feral animals than the katholic church does not exist anywhere.\n\nEven American Republican politicians, who use that church's getting away with it all for centuries as their template for how to behave, evade prosecution, and avoid paying taxes cannot match the sheer global corruption of the church. \n\nBut goddamit, they're trying!",
      "timestamp": "2022-09-07 19:13:02",
      "score": 2,
      "num_children": 0,
      "author": 114177,
      "replies": []
    },
    {
      "id": "inhuclz",
      "text": "Same shit different tall hat.",
      "timestamp": "2022-09-07 20:02:41",
      "score": 2,
      "num_children": 0,
      "author": 96918,
      "replies": []
    },
    {
      "id": "inhyil8",
      "text": "It's almost as if it's all just for the cameras....",
      "timestamp": "2022-09-07 20:27:52",
      "score": 2,
      "num_children": 0,
      "author": 370311,
      "replies": []
    },
    {
      "id": "iniyteh",
      "text": "https://youtu.be/uxPCxvxzujo",
      "timestamp": "2022-09-08 00:35:27",
      "score": 2,
      "num_children": 0,
      "author": 45799,
      "replies": []
    },
    {
      "id": "inj9yjg",
      "text": "Turns out the “cool pope” angle can only work for so long, he’s still a pope and I have no respect for the Vatican or the pope or people of the cloth in general (unless they stay fairly quiet and just help the poor like Jesus couldn’t have been more clear about)",
      "timestamp": "2022-09-08 01:57:17",
      "score": 2,
      "num_children": 0,
      "author": 112678,
      "replies": []
    },
    {
      "id": "ink3k5c",
      "text": "Time to shut down this crooked pedophile enabling cult. Bulldoze the Vatican, no more pope’s, enough is enough, it’s time for people to wake up to reality and stop living in a fantasy world.",
      "timestamp": "2022-09-08 06:39:54",
      "score": 2,
      "num_children": 0,
      "author": 115511,
      "replies": []
    },
    {
      "id": "inkg5jk",
      "text": "I watched a debate earlier and this young woman claiming Catholicism is for truth and the only true religion out of all the others. And the entire time I'm thinking about the child abusers among them, the lack of transparency, the abuse of power they use...and all the many followers who turn a blind eye and stay ignorant...",
      "timestamp": "2022-09-08 09:31:59",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "inkj1ys",
      "text": "Not a hot take, but this is all true. Catholic church is such a medieval shithole.",
      "timestamp": "2022-09-08 10:09:48",
      "score": 2,
      "num_children": 0,
      "author": 408227,
      "replies": []
    },
    {
      "id": "inksotx",
      "text": "The thing is America is 'officially' a secular state and the UK is not, yet which one comes across as the nuttier of the 2?",
      "timestamp": "2022-09-08 11:53:58",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ink8abq",
      "text": "All Vatican records should be public without the authority to make anything redacted.",
      "timestamp": "2022-09-08 07:41:27",
      "score": 2,
      "num_children": 1,
      "replies": [
        {
          "id": "inkk57n",
          "text": "I wonder how many they shredded...",
          "timestamp": "2022-09-08 10:23:19",
          "score": 1,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "inghj7m",
      "text": "> pay victims what they’re owed\n\nHow, exactly, does the church pay for raping you or your child?\n\nThere's only one price that should be paid for sexually assaulting those helpless to stop it.",
      "timestamp": "2022-09-07 14:55:02",
      "score": 2,
      "num_children": 1,
      "author": 385387,
      "replies": [
        {
          "id": "inins15",
          "text": "I believe you refer here to the death penalty, and just wanted to say on behalf of the survivors I know that your abuser being put to death tends to hurt your mental health more than help, for reasons I can get into if you're interested.",
          "timestamp": "2022-09-07 23:14:21",
          "score": 1,
          "num_children": 1,
          "author": 216623,
          "replies": [
            {
              "id": "injid43",
              "text": ">  and just wanted to say on behalf of the survivors I know\n\nHave them come here and talk to me. You can keep it to yourself.",
              "timestamp": "2022-09-08 03:04:21",
              "score": 1,
              "num_children": 0,
              "author": 385387,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ingol0p",
      "text": "Raises a good question… what are they owed? How do you put a price tag on rape hush money?",
      "timestamp": "2022-09-07 15:41:31",
      "score": 1,
      "num_children": 0,
      "author": 227126,
      "replies": []
    },
    {
      "id": "ings9fb",
      "text": "There is no excuse for his shortcomings in regards to the handling of these investigations. We must condemn that loudly and clearly. \nHowever, we might have a successor, who is much less progressive than Francis has been. From the point of view of conservative catholics he is pretty much a liberal revolutionary. \n\nWikipedia:\nFrancis maintains the views of the church regarding abortion, clerical celibacy, and the ordination of women, but has initiated dialogue on the possibility of deaconesses and has made women full members of dicasteries in the Roman Curia. He maintains that the church should be more open and welcoming for members of the LGBT community. Francis is an outspoken critic of unbridled capitalism and free market economics, consumerism, and overdevelopment;[2] he advocates taking action on climate change,[3] a focus of his papacy with the promulgation of Laudato si'. In international diplomacy, he helped to restore full diplomatic relations between the United States and Cuba, supported the cause of refugees during the European and Central American migrant crises, and made a deal with the People's Republic of China to define how much influence the nation has in appointing their Catholic bishops. Since 2017, Francis has been a vocal opponent of neo-nationalism and populism.[4][5] He has faced criticism from theological conservatives on many questions, especially what some interpret as his suggestion in a footnote of Amoris Laetitia that divorced and remarried Catholics may be admitted to receive the Eucharist.[6]\nSource: https://en.m.wikipedia.org/wiki/Pope_Francis",
      "timestamp": "2022-09-07 16:05:09",
      "score": 1,
      "num_children": 0,
      "author": 374488,
      "replies": []
    },
    {
      "id": "ingx5wl",
      "text": "How do you put a number on what is owed to rape victim?",
      "timestamp": "2022-09-07 16:36:14",
      "score": 1,
      "num_children": 1,
      "author": 384989,
      "replies": [
        {
          "id": "inhlhj2",
          "text": "Why do rape victims always drop the charges in favor of a settlement and NDA if their pain is so priceless?",
          "timestamp": "2022-09-07 19:08:54",
          "score": -12,
          "num_children": 3,
          "replies": [
            {
              "id": "inhm4pa",
              "text": "Didn't say it was priceless. I more hinted at it being unquantifiable. Are *you* saying that they feel \"less raped\" after a certain amount?",
              "timestamp": "2022-09-07 19:12:59",
              "score": 4,
              "num_children": 2,
              "author": 384989,
              "replies": [
                {
                  "id": "inknotx",
                  "text": ">Are you saying that they feel \"less raped\" after a certain amount?\n\nI think a better way to frame this question is:\n\n\"Are they any more/less complicit to the corruption of powerful inviduals if they accept hush money?\"",
                  "timestamp": "2022-09-08 11:03:39",
                  "score": 1,
                  "num_children": 0,
                  "author": 252875,
                  "replies": []
                },
                {
                  "id": "inhmpci",
                  "text": "Just saying what I've said: you clearly can put a number on it, duh.",
                  "timestamp": "2022-09-07 19:16:32",
                  "score": -4,
                  "num_children": 0,
                  "replies": []
                }
              ]
            },
            {
              "id": "inicocp",
              "text": "To be done with the process so they have to stop reliving it or being reminded of it every time someone speaks to them in court? There's also the social harm aspect, or in some church cases the threats for not settling/dropping.",
              "timestamp": "2022-09-07 21:57:13",
              "score": 3,
              "num_children": 1,
              "author": 223197,
              "replies": [
                {
                  "id": "iniepxh",
                  "text": "So you agree, they can put a price on their rape.",
                  "timestamp": "2022-09-07 22:10:55",
                  "score": -3,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "inigfgo",
                      "text": "No, but they can put a price on their peace of mind.\n\nDo you think settling or even winning a lawsuit makes it all okay? Because that's what \"putting a price on it\" implies, when it's much more about holding the other party accountable.",
                      "timestamp": "2022-09-07 22:22:28",
                      "score": 3,
                      "num_children": 1,
                      "author": 223197,
                      "replies": [
                        {
                          "id": "inign7d",
                          "text": "Sure sure",
                          "timestamp": "2022-09-07 22:23:56",
                          "score": 0,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "inik7wt",
              "text": "Those greedy, greedy rape victims! They're the *real* problem, am I right?",
              "timestamp": "2022-09-07 22:48:53",
              "score": 3,
              "num_children": 1,
              "author": 286151,
              "replies": [
                {
                  "id": "inilkni",
                  "text": "If you take your eight pieces of silver can you really keep feeling sorry for yourself? Maybe,  but I certainly won't. Sellouts are sellouts. Just because the stakes are higher doesn't change a thing.",
                  "timestamp": "2022-09-07 22:58:30",
                  "score": 0,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "inio3me",
                      "text": "Way to victim blame.\n\nAlso, it's *thirty* pieces of silver. If you're going to be a jerk, at least be a jerk properly.",
                      "timestamp": "2022-09-07 23:16:41",
                      "score": 4,
                      "num_children": 1,
                      "author": 286151,
                      "replies": [
                        {
                          "id": "inkoh1a",
                          "text": ">Way to victim blame.\n\nI disagree with this point. At what point does accepting hush money not set the precedent that \"it's okay for you to do whatever you want to me and others so long as you properly compensate me in the end\"? \n\nWouldn't it be more valuable to try to prevent further damage being inflicted on others than to just accept money and ignoring what happened?",
                          "timestamp": "2022-09-08 11:11:55",
                          "score": 0,
                          "num_children": 1,
                          "author": 252875,
                          "replies": [
                            {
                              "id": "inkon71",
                              "text": "Let's imagine you were brutally raped. You *could* take compensation and never see the rapist again or you *could* sit through a trial where you had to face your rapist every day. Which would you prefer? Which would be better for your mental health?\n\nThis is absolutely victim blaming, especially when he said they got their \"eight\" pieces of silver, suggesting they betrayed someone.",
                              "timestamp": "2022-09-08 11:13:47",
                              "score": 1,
                              "num_children": 1,
                              "author": 286151,
                              "replies": [
                                {
                                  "id": "inkpaf7",
                                  "text": ">Which would you prefer? Which would be better for your mental health?\n\nThat the system gets fixed so no one else has to go through the same horror as me. Fuck my personal mental health, what about every victim after me? Don't be selfish.\n\n>suggesting they betrayed someone.\n\nYeah, themselves and every victim after them who falls prey to their predator.",
                                  "timestamp": "2022-09-08 11:20:30",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 252875,
                                  "replies": [
                                    {
                                      "id": "inkqupq",
                                      "text": "Well the system isn't going to get fixed. Wish in one hand and crap in the other and see which piles up first.\n\nMeanwhile, rape victims are doing what they can handle mentally. Expecting them all to face their rapist in court is not rational. They didn't betray anyone. That is, again, victim blaming.",
                                      "timestamp": "2022-09-08 11:36:20",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 286151,
                                      "replies": [
                                        {
                                          "id": "inkr7d6",
                                          "text": "What a perfectly rational mindset. That is in no way a self defeatist's attitude. I'm so proud of you for being complicit.",
                                          "timestamp": "2022-09-08 11:39:50",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 252875,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ingtow9",
      "text": "Not sure why anyones upset. People pretending to care about issues for social points is what reddit users do best",
      "timestamp": "2022-09-07 16:14:21",
      "score": -6,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ingdvkq",
      "text": "Are there rules in place like no 1 on 1 meetings? Seems like that's 99% of the stories.",
      "timestamp": "2022-09-07 14:30:40",
      "score": 1,
      "num_children": 0,
      "author": 271085,
      "replies": []
    },
    {
      "id": "ingev3p",
      "text": "Pretty fucking brazen of him to say that,  tbh\n\nThen again,  the Church hasn't got a great track record with truth in general",
      "timestamp": "2022-09-07 14:37:22",
      "score": 1,
      "num_children": 0,
      "author": 82852,
      "replies": []
    },
    {
      "id": "ingh8n2",
      "text": "What a strange experience it must all be for a Catholic. Knowing what the church has done but still believing it is the represantative of god on Earth. Biblical god's a cunt too, so it makes sense, but not from their point of view.",
      "timestamp": "2022-09-07 14:53:04",
      "score": 1,
      "num_children": 0,
      "author": 365106,
      "replies": []
    },
    {
      "id": "ingi6mz",
      "text": "The Pope should end priestly celibacy, obviously.",
      "timestamp": "2022-09-07 14:59:20",
      "score": 1,
      "num_children": 0,
      "author": 323128,
      "replies": []
    },
    {
      "id": "ingmt2p",
      "text": "Zero tolerance for child rape allegations. He just missed the word off the end there. No one’s perfect and he’s very far from it.",
      "timestamp": "2022-09-07 15:29:53",
      "score": 1,
      "num_children": 0,
      "author": 151778,
      "replies": []
    },
    {
      "id": "ingnd8a",
      "text": "Yep. At this point, if it exists, every pope and bishop is in their hell.",
      "timestamp": "2022-09-07 15:33:34",
      "score": 1,
      "num_children": 0,
      "author": 135688,
      "replies": []
    },
    {
      "id": "ingrfqr",
      "text": "Religious people are all talk.\n\nDoubly so if they live in a gold castle.",
      "timestamp": "2022-09-07 15:59:51",
      "score": 1,
      "num_children": 0,
      "author": 227707,
      "replies": []
    },
    {
      "id": "ingrle1",
      "text": "It's sad I can't upvote this more than once",
      "timestamp": "2022-09-07 16:00:51",
      "score": 1,
      "num_children": 0,
      "author": 65689,
      "replies": []
    },
    {
      "id": "ingrraj",
      "text": "Fully agree, actions speak louder than words and saying there is zero tolerance just rings hollow unless you follow it up with action.\n\nAs someone who was highly considering the priesthood growing up as an alter server and spent a year at a seminary when I was 19-20 (and have since became a non-believer just through reading the bible instead of select passages and experiences meeting/talking to different people), it was definitely the big reason for me leaving that I just couldn't live a life of celibacy and a lot of the traditional rules I didn't agree with (not being able to be married, women not being able to become priest). \n\nI just think about what would have happened if those traditional rules weren't in place anymore that I would have likely stayed which sucks because I feel I would have been pretty good at serving the community (wherever I got appointed) and would have been actually able to try and help the whole pedophilia problem.",
      "timestamp": "2022-09-07 16:01:54",
      "score": 1,
      "num_children": 0,
      "author": 312592,
      "replies": []
    },
    {
      "id": "ingt4th",
      "text": "I'm reasonably sure someone in the church would have him killed for trying that.\n\nStill, point stands.",
      "timestamp": "2022-09-07 16:10:46",
      "score": 1,
      "num_children": 0,
      "author": 301230,
      "replies": []
    },
    {
      "id": "ingtas8",
      "text": "It's a bit like Hitchens saying that in countries that practice Sharia, they can't go lopping off the hands of everyone who steals as the labor force would be too drastically reduced. If every guilty priest were excommunicated, the church would be left with very few to administer it.",
      "timestamp": "2022-09-07 16:11:51",
      "score": 1,
      "num_children": 0,
      "author": 311041,
      "replies": []
    },
    {
      "id": "ingtivs",
      "text": "They can either 1. disband the church alltogheter which they won't or 2. allow for priests to marry which they also won't do.",
      "timestamp": "2022-09-07 16:13:17",
      "score": 1,
      "num_children": 0,
      "author": 181181,
      "replies": []
    },
    {
      "id": "inguct8",
      "text": "I don't get it. The Vatican doesn't have a standing army. The closest thing, the Swiss Guard, stands at 135 members. They are incredibly weakly positioned militarily and basically asking to be overrun. A single regiment and colonel could conceivably bring them to their knees and yet here we are waiting for them to fall like dogs asking to be let outside.",
      "timestamp": "2022-09-07 16:18:36",
      "score": 1,
      "num_children": 0,
      "author": 362029,
      "replies": []
    },
    {
      "id": "ingwoua",
      "text": "This is an lgbt+ issue as well!",
      "timestamp": "2022-09-07 16:33:16",
      "score": 1,
      "num_children": 0,
      "author": 224881,
      "replies": []
    },
    {
      "id": "ingwzor",
      "text": "He would probably be assassinated.",
      "timestamp": "2022-09-07 16:35:09",
      "score": 1,
      "num_children": 0,
      "author": 34048,
      "replies": []
    },
    {
      "id": "ingx9tq",
      "text": "He has 0 tolerances as long as the church in unharmed. All those things would harm the church.",
      "timestamp": "2022-09-07 16:36:55",
      "score": 1,
      "num_children": 0,
      "author": 407189,
      "replies": []
    },
    {
      "id": "inh81fk",
      "text": "I wish all the wealthy would sit on a throne like the pope’s. \n\nIt’d be so easy to identify our masters instead of all this “dark overlording thru proxies” mess that forces us to dig to find them out.",
      "timestamp": "2022-09-07 17:44:01",
      "score": 1,
      "num_children": 0,
      "author": 401841,
      "replies": []
    },
    {
      "id": "inh84eo",
      "text": "Any Catholic saying anything of the sort is a lying two faced pos\n\nFull stop.\n\nNo one who actually believes in the word of God would follow that sinner filled temple. It's way worse than the money changers and Jesus straight up got violent with those fucks.",
      "timestamp": "2022-09-07 17:44:31",
      "score": 1,
      "num_children": 0,
      "author": 224654,
      "replies": []
    },
    {
      "id": "inh8k2g",
      "text": "Maybe he is involved too. Why would he allow more investigation.",
      "timestamp": "2022-09-07 17:47:17",
      "score": 1,
      "num_children": 0,
      "author": 49052,
      "replies": []
    },
    {
      "id": "inh95n4",
      "text": "the church is full of shit?? surprised",
      "timestamp": "2022-09-07 17:50:59",
      "score": 1,
      "num_children": 0,
      "author": 349145,
      "replies": []
    },
    {
      "id": "inh9dux",
      "text": "How is it that in a highly political work environment, the predator priests aren't getting displaced by less overtly shitty people who want their jobs?",
      "timestamp": "2022-09-07 17:52:24",
      "score": 1,
      "num_children": 0,
      "author": 122266,
      "replies": []
    },
    {
      "id": "inh9erf",
      "text": "It’s called gaslighting.",
      "timestamp": "2022-09-07 17:52:34",
      "score": 1,
      "num_children": 0,
      "author": 384903,
      "replies": []
    },
    {
      "id": "inh9ner",
      "text": "He'd probably be killed if he tried doing something for real. But if he really believes in God he'd do it anyways and die a Martyr.",
      "timestamp": "2022-09-07 17:54:04",
      "score": 1,
      "num_children": 0,
      "author": 207840,
      "replies": []
    },
    {
      "id": "inhaklm",
      "text": "Every religion is designed to enhance power, wealth and enslave and rape people especially women and children.  More science please.",
      "timestamp": "2022-09-07 17:59:49",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "inhbwlf",
      "text": "But confession cleanses their sins! Every predator priest confesses, repents, and is thus forgiven.  \n\nYou need to understand that by the churches rules, the sin is erased. The church can't violate the sacred privacy of the confessional!",
      "timestamp": "2022-09-07 18:08:09",
      "score": 1,
      "num_children": 0,
      "author": 319846,
      "replies": []
    },
    {
      "id": "inhc7ux",
      "text": "He meant he has zero tolerance for accountability.",
      "timestamp": "2022-09-07 18:10:08",
      "score": 1,
      "num_children": 0,
      "author": 9292,
      "replies": []
    },
    {
      "id": "inhdvy0",
      "text": "He'd also stop fucking little boys.",
      "timestamp": "2022-09-07 18:20:45",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "inhf4p0",
      "text": "Exactly. Remove the priests. Local authorities investigate the crime free from Church influence. Allow priests to marry. Allow female priests. This isn't difficult. Fuck the Pope.",
      "timestamp": "2022-09-07 18:28:43",
      "score": 1,
      "num_children": 0,
      "author": 272200,
      "replies": []
    },
    {
      "id": "inhfwiy",
      "text": "Agreed that full disclosure and transparency is the right thing to do and should have been the policy of the church since day one. \n\nBut it also would spell the utter destruction of the Catholic Church and would have a domino effect with regard to other major sects. \n\nYou can see why they wouldn’t elect to do the right thing. I’m sure their opinion is that their existence is more important than doing the right thing and risk being discredited and destroyed.",
      "timestamp": "2022-09-07 18:33:40",
      "score": 1,
      "num_children": 0,
      "author": 337888,
      "replies": []
    },
    {
      "id": "inhh3iz",
      "text": "I’m not Catholic, but I think that’s how you wind up with 1 dead pope and 1 alive—but slightly more complacent—pope.",
      "timestamp": "2022-09-07 18:41:11",
      "score": 1,
      "num_children": 0,
      "author": 311993,
      "replies": []
    },
    {
      "id": "inhhoro",
      "text": "Wasn't the last pope the guy whose job it was to cover this shit up? Every guy in a red dress is in on this. They're all part of it.",
      "timestamp": "2022-09-07 18:44:54",
      "score": 1,
      "num_children": 0,
      "author": 298479,
      "replies": []
    },
    {
      "id": "inhisc0",
      "text": "Out of curiosity. What kind of payment does the church deem acceptable for the family of a child who they raped?",
      "timestamp": "2022-09-07 18:51:50",
      "score": 1,
      "num_children": 0,
      "author": 119884,
      "replies": []
    },
    {
      "id": "inhixn6",
      "text": "How much power does the Pope have? Like on par of dictator level?",
      "timestamp": "2022-09-07 18:52:45",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "inhqtji",
          "text": "> Like on par of dictator level?\n\nCorrect. Vatican City is the only remaining absolute monarchy in Europe.\n\nAs far as Church Law is concerned, the Supreme Pontiff is just that: Supreme. His power is absolute. There is no separation of powers. There is no independent legislative or judiciary branch. There are no re-elections to worry about. There are no checks or balances. If he wants to change the laws of the church, he doesn't need to convince anyone to approve his new policies. He can call for an Ecumenical Council to advise him *if he wants*, but he doesn't *have* to do so. He doesn't need to wait for anyone to vote. What he says, goes. If he declares that the sacrament of the Eucharist is only valid if the priest spreads marmalade on the cracker before casting the transformation spell, then that declaration becomes church law, immediately, no questions asked.\n\nIn fact, according to official Catholic Doctrine, the pope has the magical power to channel the voice of Yahweh Himself through his words, rendering them extra-super-double-infallible. Contrary to popular belief, this doesn't automatically apply to *everything* the pope says. It has to be officially invoked, which has only happened about a dozen times since it was formally defined in the 1800s. If he *doesn't* invoke this magical power, then he \"merely\" has the authority of an absolute monarch with no checks or balances as described above. That still means that all his employees have to do what he says, but you won't automatically be condemned to hell for privately disagreeing with it - only if you disagreed on a *really* important issue such as \"Did the Virgin Mary ever get laid *after* Jesus was born?\".\n\nOf course, his power isn't *actually* absolute, because he **is** subject to one *unofficial* check and balance: the possibility that his underlings might decide to assassinate him and replace him with someone who will immediately reverse all his changes. That same caveat has applied to every ruler in history, no matter how \"absolute\" they might believe themselves to be. If the biggest check on a person's political power is \"They're not physically indestructible\", you've got to admit that there isn't *much* holding them back. But *within* the laws of the church, if he *really* wants something to get done, his opponents have no recourse.",
          "timestamp": "2022-09-07 19:41:31",
          "score": 1,
          "num_children": 0,
          "author": 18996,
          "replies": []
        }
      ]
    },
    {
      "id": "inhkq5v",
      "text": "Makes sense that Shia LeBeouf got attached to em. Water finding its own level there.",
      "timestamp": "2022-09-07 19:04:07",
      "score": 1,
      "num_children": 0,
      "author": 17962,
      "replies": []
    },
    {
      "id": "inhmjd7",
      "text": "Fuck the pope fuck that stupid ass religion and fuck anyone who doesn’t say the same\n\nThe biggest child rape ring in the world and it’s been done in broad daylight for 100 years. BURN THE FUCKING CHURCHES",
      "timestamp": "2022-09-07 19:15:30",
      "score": 1,
      "num_children": 0,
      "author": 284784,
      "replies": []
    },
    {
      "id": "inhmmy3",
      "text": "This is the Obama method of saying exactly the right things in exactly while doing everything wrong. Most people are too stupid they want to be whispered sweet nothings while the child rape continues unabated.",
      "timestamp": "2022-09-07 19:16:07",
      "score": 1,
      "num_children": 0,
      "author": 393374,
      "replies": []
    },
    {
      "id": "inhngdo",
      "text": "Some catholics believe going through seminary treats vices like pedophilia, if not curing them entirely. Ie, as many pedophiles as possible need to become priests. If it causes problems for children exposed to those priests then it's just their cross to bear. Their suffering is part of God's plan to shame the remaining pedophiles into changing their ways.\n\nJesus chased the moneylenders out of the temple as the story goes, but Catholics can't bring themselves to chase pedophiles and their enablers out of their churches. They're literally waiting for Jesus to come back and do it for them.",
      "timestamp": "2022-09-07 19:21:06",
      "score": 1,
      "num_children": 0,
      "author": 37103,
      "replies": []
    },
    {
      "id": "inhocuk",
      "text": "Of course he's lying, he's a Pope. You know a pope is lying when their mouth is open and words are coming out.",
      "timestamp": "2022-09-07 19:26:37",
      "score": 1,
      "num_children": 0,
      "author": 401271,
      "replies": []
    },
    {
      "id": "inhp7ge",
      "text": "It's blatantly illegal to harbor criminals. The church has zero jurisdiction to investigate these crimes. Charge the church and hold these people criminally responsible.",
      "timestamp": "2022-09-07 19:31:47",
      "score": 1,
      "num_children": 0,
      "author": 215784,
      "replies": []
    },
    {
      "id": "inhs915",
      "text": "There's nothing stopping the secular authorities from investigating accusations and arresting priests. They're not outside the law.",
      "timestamp": "2022-09-07 19:50:03",
      "score": 1,
      "num_children": 0,
      "author": 376584,
      "replies": []
    },
    {
      "id": "inhsgtg",
      "text": "I mean, obviously. He's the pope, lying is his job description.",
      "timestamp": "2022-09-07 19:51:19",
      "score": 1,
      "num_children": 0,
      "author": 322331,
      "replies": []
    },
    {
      "id": "inhshq2",
      "text": "I love how they frame it as just ‘child rape’ when mostly it is ‘homosexual child rape’ there’s nothing wrong with being homosexual to normal people but these are religious people that mostly despise homosexuals and homosexual acts. And the leaders of these religions are gay. Idk how you could ever believe or follow these clown shows",
      "timestamp": "2022-09-07 19:51:28",
      "score": 1,
      "num_children": 0,
      "author": 52288,
      "replies": []
    },
    {
      "id": "inht892",
      "text": "Platitudes is the go to move of religion, thoughts and prayers",
      "timestamp": "2022-09-07 19:55:55",
      "score": 1,
      "num_children": 0,
      "author": 98418,
      "replies": []
    },
    {
      "id": "inhvgs5",
      "text": "Ii think the Zero tolerance statement  is just for him",
      "timestamp": "2022-09-07 20:09:21",
      "score": 1,
      "num_children": 0,
      "author": 217873,
      "replies": []
    },
    {
      "id": "inhwpmd",
      "text": "*Religous official lies about stance on pedophilia.*\n\nI'm shocked.",
      "timestamp": "2022-09-07 20:16:56",
      "score": 1,
      "num_children": 0,
      "author": 250454,
      "replies": []
    },
    {
      "id": "inhx7td",
      "text": "Absofvckinglutely",
      "timestamp": "2022-09-07 20:20:01",
      "score": 1,
      "num_children": 0,
      "author": 252783,
      "replies": []
    },
    {
      "id": "inhxghg",
      "text": "It’s a global issue.   They probably don’t have enough resources or money to do anything about it even if they really wanted to",
      "timestamp": "2022-09-07 20:21:28",
      "score": 1,
      "num_children": 0,
      "author": 211902,
      "replies": []
    },
    {
      "id": "inhyey1",
      "text": "Hear, hear.",
      "timestamp": "2022-09-07 20:27:15",
      "score": 1,
      "num_children": 0,
      "author": 210021,
      "replies": []
    },
    {
      "id": "inhyg8y",
      "text": "I mean, forgiveness of sin is an integral part of the religion.",
      "timestamp": "2022-09-07 20:27:28",
      "score": 1,
      "num_children": 0,
      "author": 85820,
      "replies": []
    },
    {
      "id": "inhzgwo",
      "text": "What else to expect from a millennia old criminal organization ?",
      "timestamp": "2022-09-07 20:33:36",
      "score": 1,
      "num_children": 0,
      "author": 10498,
      "replies": []
    },
    {
      "id": "ini1vwm",
      "text": "the Catholic church doesn't report to secular authorities",
      "timestamp": "2022-09-07 20:48:18",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ini1zmp",
      "text": "Will never understand how parents can raise their children in the Catholic Church knowing all of the shit they love to do to little kids",
      "timestamp": "2022-09-07 20:48:56",
      "score": 1,
      "num_children": 0,
      "author": 6527,
      "replies": []
    },
    {
      "id": "ini2x2u",
      "text": "Pope ain’t shit",
      "timestamp": "2022-09-07 20:54:39",
      "score": 1,
      "num_children": 0,
      "author": 292707,
      "replies": []
    },
    {
      "id": "ini2yyu",
      "text": "If he suspended all the accused who would run the Catholic church? Thats it guys! no more mass, dressing up in silly outfits,and various other bizarre rituals.",
      "timestamp": "2022-09-07 20:54:58",
      "score": 1,
      "num_children": 0,
      "author": 317881,
      "replies": []
    },
    {
      "id": "ini5ny4",
      "text": "And repay the Canadian tax payers for the settlement we covered for what your pedo priests and nuns did to residential school children.",
      "timestamp": "2022-09-07 21:11:45",
      "score": 1,
      "num_children": 0,
      "author": 407001,
      "replies": []
    },
    {
      "id": "ini6bhx",
      "text": "that's because he believes the children consented",
      "timestamp": "2022-09-07 21:15:55",
      "score": 1,
      "num_children": 0,
      "author": 54298,
      "replies": []
    },
    {
      "id": "ini8hpr",
      "text": "They're doing their best to Make Atheism Great Again",
      "timestamp": "2022-09-07 21:29:53",
      "score": 1,
      "num_children": 0,
      "author": 325218,
      "replies": []
    },
    {
      "id": "inialj4",
      "text": "Nah. If he really cared he'd abolish the Catholic church ;-)",
      "timestamp": "2022-09-07 21:43:31",
      "score": 1,
      "num_children": 0,
      "author": 227285,
      "replies": []
    },
    {
      "id": "inibxdc",
      "text": "I seem.to remember them bending over backwards to get George Pells conviction overturned on a bullshit technicality",
      "timestamp": "2022-09-07 21:52:15",
      "score": 1,
      "num_children": 0,
      "author": 47218,
      "replies": []
    },
    {
      "id": "inicp8o",
      "text": "Hey! No shit.",
      "timestamp": "2022-09-07 21:57:23",
      "score": 1,
      "num_children": 0,
      "author": 12030,
      "replies": []
    },
    {
      "id": "inigsqs",
      "text": "But, but, but God is loving. /s",
      "timestamp": "2022-09-07 22:24:58",
      "score": 1,
      "num_children": 0,
      "author": 323222,
      "replies": []
    },
    {
      "id": "inihqrl",
      "text": "A religious person lying? No way",
      "timestamp": "2022-09-07 22:31:31",
      "score": 1,
      "num_children": 0,
      "author": 166848,
      "replies": []
    },
    {
      "id": "iniikx9",
      "text": "Just a couple more generations, gang.  As a gen xer, we rarely went to church. My children never.  Any metro  area(U.S.) you'll see churches closing, consolidating, etc. The weak candle in the dark is really becoming a mere, quaint novelty of culture.",
      "timestamp": "2022-09-07 22:37:20",
      "score": 1,
      "num_children": 0,
      "author": 153421,
      "replies": []
    },
    {
      "id": "inijnf9",
      "text": "Yes, but if they do all that, how will they recruit new pedophiles, I mean priests?",
      "timestamp": "2022-09-07 22:44:52",
      "score": 1,
      "num_children": 0,
      "author": 171831,
      "replies": []
    },
    {
      "id": "inijuot",
      "text": "Yes. Address the situation, no matter what the consequences.  \n\nIt’s just the right thing to do already",
      "timestamp": "2022-09-07 22:46:17",
      "score": 1,
      "num_children": 0,
      "author": 98004,
      "replies": []
    },
    {
      "id": "inikwww",
      "text": "Yeah but he is a puppet... the people holding the strings have the power. They are all Opus Dei fanatics. I bet if the Pope could he would change a lot of these things. We need to get rid of those fanatics who destroy everything!",
      "timestamp": "2022-09-07 22:53:49",
      "score": 1,
      "num_children": 0,
      "author": 378104,
      "replies": []
    },
    {
      "id": "inilm87",
      "text": "He does have zero tolerance, though. As soon as it comes up, he immediately does everything in his power to bury it. No hesitation.",
      "timestamp": "2022-09-07 22:58:48",
      "score": 1,
      "num_children": 0,
      "author": 41055,
      "replies": []
    },
    {
      "id": "inilofs",
      "text": "He probably has a few lads under his belt himself",
      "timestamp": "2022-09-07 22:59:15",
      "score": 1,
      "num_children": 0,
      "author": 247456,
      "replies": []
    },
    {
      "id": "inimqtv",
      "text": "How much are they owed? Im honestly asking, not an answer like completely bankrupt the catholic church because that’s not feasible.",
      "timestamp": "2022-09-07 23:06:51",
      "score": 1,
      "num_children": 1,
      "author": 307023,
      "replies": [
        {
          "id": "inkjjgw",
          "text": "It's feasible.",
          "timestamp": "2022-09-08 10:15:58",
          "score": 1,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "ininus3",
      "text": "What he means is zero tolerance for victims of rape.",
      "timestamp": "2022-09-07 23:14:54",
      "score": 1,
      "num_children": 0,
      "author": 186285,
      "replies": []
    },
    {
      "id": "inio351",
      "text": "The Catholic Church are liars!? , no way!. Get outta town.",
      "timestamp": "2022-09-07 23:16:36",
      "score": 1,
      "num_children": 0,
      "author": 345332,
      "replies": []
    },
    {
      "id": "iniq80q",
      "text": "The pope being untruthful? No! No way! Popes are infallible, always have been always will be.",
      "timestamp": "2022-09-07 23:32:11",
      "score": 1,
      "num_children": 0,
      "author": 56068,
      "replies": []
    },
    {
      "id": "iniqc72",
      "text": "They \"care\" about the children hosting hordes of pedophiles in their ranks just like they \"care\" about the poor with churches covered in gold and a shit ton of money held in the Vatican Bank",
      "timestamp": "2022-09-07 23:33:04",
      "score": 1,
      "num_children": 0,
      "author": 394680,
      "replies": []
    },
    {
      "id": "inirwgk",
      "text": "Of course he's lying. He's literally **endorsed** the rape of children since day one of his position.",
      "timestamp": "2022-09-07 23:44:37",
      "score": 1,
      "num_children": 0,
      "author": 60583,
      "replies": []
    },
    {
      "id": "inisigw",
      "text": "My all-time favorite Onion headline: \"Pope forgives child sexual abuse victims\"",
      "timestamp": "2022-09-07 23:49:12",
      "score": 1,
      "num_children": 0,
      "author": 387046,
      "replies": []
    },
    {
      "id": "inisw87",
      "text": "His concern is the abusers finding salvation.",
      "timestamp": "2022-09-07 23:52:04",
      "score": 1,
      "num_children": 0,
      "author": 12568,
      "replies": []
    },
    {
      "id": "init4sc",
      "text": "This is why I call him the PR Pope. He’s only there to make the church *look* better after the scandal.",
      "timestamp": "2022-09-07 23:53:54",
      "score": 1,
      "num_children": 0,
      "author": 306804,
      "replies": []
    },
    {
      "id": "initxmg",
      "text": "atheist now but i say AMEN",
      "timestamp": "2022-09-07 23:59:58",
      "score": 1,
      "num_children": 0,
      "author": 144262,
      "replies": []
    },
    {
      "id": "iniu5ar",
      "text": "Not black and white.  Must be proven guilty even for the Church.  Hard to change tradition which the Pope is trying to.",
      "timestamp": "2022-09-08 00:01:32",
      "score": 1,
      "num_children": 0,
      "author": 15654,
      "replies": []
    },
    {
      "id": "iniwnaa",
      "text": "You have to find the root cause of the problem and change the system to eliminate the problem by making sure it cannot happen again. You can talk all you want about change but it will not happen if the same system that allowed it remains. That is why nothing will change in the church, the military, and any other group you find corruption in. It disgust me end to know preying on children in the church and rape in the military will not end no matter how much these groups vow to stop it.",
      "timestamp": "2022-09-08 00:19:38",
      "score": 1,
      "num_children": 0,
      "author": 225271,
      "replies": []
    },
    {
      "id": "inix07s",
      "text": "Until people like Pell face justice, I won’t believe it for a second",
      "timestamp": "2022-09-08 00:22:09",
      "score": 1,
      "num_children": 0,
      "author": 245070,
      "replies": []
    },
    {
      "id": "iniy5fl",
      "text": "Let priests get married and let women be priests and the problem is fixed",
      "timestamp": "2022-09-08 00:30:34",
      "score": 1,
      "num_children": 1,
      "author": 50231,
      "replies": [
        {
          "id": "inkjgl8",
          "text": "Neither thing stops pedophilia. And celibacy doesn't cause pedophilia. Pedophiles are attracted to the priesthood because they know they will have easy access to children from a trusted position and will be able to get away with it because the church has their backs.\n\nEven if every priest was *commanded* to be married, there would be pedophile priests. Just ask anyone who was raped by a married family member.",
          "timestamp": "2022-09-08 10:14:57",
          "score": 1,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "inizda8",
      "text": "The set of things the Catholic church has zero tolerance for includes homosexuality, priests getting married and women being ordained. It most certainly does not include priests raping children.",
      "timestamp": "2022-09-08 00:39:28",
      "score": 1,
      "num_children": 0,
      "author": 336724,
      "replies": []
    },
    {
      "id": "inj0k36",
      "text": "It's almost as if the church is an empire built on colonialism and murder and doesn't bend the knee to anyone",
      "timestamp": "2022-09-08 00:48:12",
      "score": 1,
      "num_children": 0,
      "author": 31615,
      "replies": []
    },
    {
      "id": "inj11qe",
      "text": "Maybe, just maybe…. He doesn’t believe in a god either and he’s just a CEO trying to keep his company above water.",
      "timestamp": "2022-09-08 00:51:44",
      "score": 1,
      "num_children": 0,
      "author": 138570,
      "replies": []
    },
    {
      "id": "inj3hlr",
      "text": "After centuries of hiding and actively enabling it, the Church is not believable on the subject.",
      "timestamp": "2022-09-08 01:09:27",
      "score": 1,
      "num_children": 0,
      "author": 395557,
      "replies": []
    },
    {
      "id": "inj49nm",
      "text": "He was quoted \"if God didn't want the priests to fuck these children, why did he make them so god damned sexy\"?",
      "timestamp": "2022-09-08 01:15:10",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "inj50ab",
      "text": "Frateli e sorele porcodio",
      "timestamp": "2022-09-08 01:20:33",
      "score": 1,
      "num_children": 0,
      "author": 139195,
      "replies": []
    },
    {
      "id": "inj7py1",
      "text": "Fuck them all",
      "timestamp": "2022-09-08 01:40:31",
      "score": 1,
      "num_children": 0,
      "author": 42531,
      "replies": []
    },
    {
      "id": "injhb5l",
      "text": "Y’all talking as if this was the only shit religion, when in fact they all are. Meant to keep the masses stupid and obedient, all organized religions are the same.",
      "timestamp": "2022-09-08 02:55:37",
      "score": 1,
      "num_children": 0,
      "author": 63374,
      "replies": []
    },
    {
      "id": "injhpw6",
      "text": "Most people have zero tolerance for the lies of Popes that actively ignore the rape of children",
      "timestamp": "2022-09-08 02:59:00",
      "score": 1,
      "num_children": 0,
      "author": 329855,
      "replies": []
    },
    {
      "id": "injoblc",
      "text": "Seems like churches should pay taxes, same with all their ~~pedophiles~~ clergy and followers.\n\nFuck ALL religion and their cults. Tell me you can't think for yourself without telling me you can't think for yourself.\n\n\"Too stupid to understand Science? Try Religion!\"",
      "timestamp": "2022-09-08 03:55:54",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "injowkp",
      "text": "Sure the Pope might have a zero tolerance.. but his boss has eternal tolerance if you just continue to repent.",
      "timestamp": "2022-09-08 04:01:16",
      "score": 1,
      "num_children": 1,
      "author": 320240,
      "replies": [
        {
          "id": "inkjc9s",
          "text": "Nope. Not eternal. I blasphemed against the holy spirit. [That can't be forgiven.](https://www.biblegateway.com/passage/?search=Mark+3%3A29&version=NIV)",
          "timestamp": "2022-09-08 10:13:25",
          "score": 1,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "injrkwr",
      "text": "Of course he's lying.  He's clergy.  That's their business model.",
      "timestamp": "2022-09-08 04:26:53",
      "score": 1,
      "num_children": 0,
      "author": 318980,
      "replies": []
    },
    {
      "id": "ink5f1k",
      "text": "The Homie Barnstable: “Fine, I’ll do it myself.”",
      "timestamp": "2022-09-08 07:03:19",
      "score": 1,
      "num_children": 0,
      "author": 349584,
      "replies": []
    },
    {
      "id": "ink7jbh",
      "text": "Why this body has any authority in the real world is beyond me.",
      "timestamp": "2022-09-08 07:31:23",
      "score": 1,
      "num_children": 0,
      "author": 302901,
      "replies": []
    },
    {
      "id": "inkobyg",
      "text": "a pope, lying?\n\nsorry mate, but what else do they do?",
      "timestamp": "2022-09-08 11:10:25",
      "score": 1,
      "num_children": 0,
      "author": 278817,
      "replies": []
    },
    {
      "id": "inkqkgy",
      "text": "Religion is evil.",
      "timestamp": "2022-09-08 11:33:32",
      "score": 1,
      "num_children": 0,
      "author": 68180,
      "replies": []
    },
    {
      "id": "inkrble",
      "text": "Suspend all of the accused? That is very scary thought. I hope you mean convicted…\nInnocent until provent guilty.",
      "timestamp": "2022-09-08 11:40:54",
      "score": 1,
      "num_children": 0,
      "author": 250515,
      "replies": []
    },
    {
      "id": "inlzv1r",
      "text": "Yes, I agree with your assessment. The Pope has the power to make a difference, and by refusing to do everything that could possibly help, he is complicit! How is this not obvious? It seems to me that the religious often ignore the crimes committed by their leaders and followers against individuals and society so as not to diminish the reputation of their organization. Don't they see that by standing for what is RIGHT and JUST and GOOD will raise the reputation of their organization and advance their mission?  The US Military too must turn over criminal cases to secular authorities.",
      "timestamp": "2022-09-08 16:56:47",
      "score": 1,
      "num_children": 0,
      "author": 82901,
      "replies": []
    },
    {
      "id": "inmhp20",
      "text": "It's probably the paying out the money part. The Catholic church is really good at raking it in, and not so great at handing it out.",
      "timestamp": "2022-09-08 18:47:05",
      "score": 1,
      "num_children": 0,
      "author": 243394,
      "replies": []
    },
    {
      "id": "inozus3",
      "text": "Fuck this guy",
      "timestamp": "2022-09-09 06:05:51",
      "score": 1,
      "num_children": 0,
      "author": 117641,
      "replies": []
    },
    {
      "id": "inwiwtk",
      "text": "The Catholic Church is a disgusting, malignant tumor.",
      "timestamp": "2022-09-10 20:54:43",
      "score": 1,
      "num_children": 0,
      "author": 378322,
      "replies": []
    },
    {
      "id": "inggigw",
      "text": "Granted it's gotten better. It's not there but it's better than it used to be when nothing at all happened.",
      "timestamp": "2022-09-07 14:48:15",
      "score": -7,
      "num_children": 2,
      "author": 366841,
      "replies": [
        {
          "id": "inhkv7l",
          "text": "I'm beating people with metal pipes less. I haven't stopped completely, it's a long process that needs time. But it should be mentioned that I've gotten better anytime someone talks about it.",
          "timestamp": "2022-09-07 19:05:00",
          "score": 10,
          "num_children": 2,
          "replies": [
            {
              "id": "inhq5wl",
              "text": "I'm glad you're beating people with metal pipes less.  Have you considered PVC?  Or maybe just do it in the next town over?\n\nEdit ? In wrong spot",
              "timestamp": "2022-09-07 19:37:29",
              "score": 0,
              "num_children": 1,
              "author": 180358,
              "replies": [
                {
                  "id": "inhqbvx",
                  "text": "Even better. I'm asking everybody to send me thoughts and prayers in this difficult time.",
                  "timestamp": "2022-09-07 19:38:29",
                  "score": 5,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "inhu1k1",
                      "text": "T & P brother",
                      "timestamp": "2022-09-07 20:00:49",
                      "score": 0,
                      "num_children": 1,
                      "author": 180358,
                      "replies": [
                        {
                          "id": "inhuycn",
                          "text": "Inshallah amen dreidel hokey pokey dooda my friend.",
                          "timestamp": "2022-09-07 20:06:20",
                          "score": 3,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ini20i1",
                              "text": "Priceless!  I think some people believe we were being serious in this little exchange, but I really liked your metal pipe comparison.",
                              "timestamp": "2022-09-07 20:49:05",
                              "score": 1,
                              "num_children": 0,
                              "author": 180358,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "inis40u",
                      "text": "Thoughts and prays man or woman. Keep up the lords work 🫡",
                      "timestamp": "2022-09-07 23:46:10",
                      "score": 0,
                      "num_children": 0,
                      "author": 23726,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "iniogjx",
              "text": "It's an interesting moral question in a vacuum - given someone who constantly beats people with metal pipes, how do you best put your effort towards reducing the harm they cause? There's an argument to be made for a short-term, easier goal of getting them to do it less while you work on getting them to stop completely. Feel like it's the kind of question you'd see in a philosophy textbook.\n\nAnd like most of those philosophy textbook quandaries, there's an obvious real life answer - take away the goddamn pipe.",
              "timestamp": "2022-09-07 23:19:19",
              "score": 1,
              "num_children": 0,
              "author": 216623,
              "replies": []
            }
          ]
        },
        {
          "id": "inhopx9",
          "text": "But are they? Like do we have some sort of source from this outside of the pedophiles?",
          "timestamp": "2022-09-07 19:28:49",
          "score": 3,
          "num_children": 1,
          "author": 271950,
          "replies": [
            {
              "id": "injwbns",
              "text": "The fact that they are cracking down on it and that we are even told. About it does indicate that it is getting better. Slowly.",
              "timestamp": "2022-09-08 05:15:39",
              "score": -1,
              "num_children": 0,
              "author": 366841,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "inh8a43",
      "text": "Are preists gay when entering into the church or do they become gay later? Victims are  almost always boys. \nWhy?",
      "timestamp": "2022-09-07 17:45:31",
      "score": -10,
      "num_children": 3,
      "author": 175842,
      "replies": [
        {
          "id": "inhqjjr",
          "text": "Pedophiles is the word you're looking for.  Not gay.",
          "timestamp": "2022-09-07 19:39:49",
          "score": 7,
          "num_children": 0,
          "author": 180358,
          "replies": []
        },
        {
          "id": "inhpb3k",
          "text": "It's more likely the fact that they have boys available. Girls can't hold the position that would give the preists as much of an opportunity. I'm sure that if you put girls in those roles they would also get raped.",
          "timestamp": "2022-09-07 19:32:22",
          "score": 2,
          "num_children": 0,
          "author": 271950,
          "replies": []
        },
        {
          "id": "inicx2m",
          "text": "It's a crime of opportunity and access. If they had access to girls there would be more girls harmed.",
          "timestamp": "2022-09-07 21:58:50",
          "score": 1,
          "num_children": 0,
          "author": 223197,
          "replies": []
        }
      ]
    },
    {
      "id": "ingqdwh",
      "text": "If they paid all their victims...they'd be bankrupt.",
      "timestamp": "2022-09-07 15:53:07",
      "score": -7,
      "num_children": 2,
      "author": 362707,
      "replies": [
        {
          "id": "inhl830",
          "text": "Not even close.  They have 2000 years of collecting tax free money into the coffers of their own personal nation. This pedo cult could buy and sell Bezoes with their pocket change.",
          "timestamp": "2022-09-07 19:07:12",
          "score": 7,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "inikouj",
          "text": "Even if you're right, good.",
          "timestamp": "2022-09-07 22:52:13",
          "score": 2,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "inim4xn",
              "text": "No argument here.",
              "timestamp": "2022-09-07 23:02:32",
              "score": 2,
              "num_children": 0,
              "author": 362707,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ing2laa",
      "text": "[removed]",
      "timestamp": "2022-09-07 13:09:33",
      "score": -7,
      "num_children": 7,
      "replies": [
        {
          "id": "ing3i70",
          "text": "It's funny that you complain that the world isn't Christian enough but we find the largest pedo scandals based almost entirely amongst the various Christian religious organizations.\n\nAlmost like there is pattern of priests deliberately hiding pedos.......",
          "timestamp": "2022-09-07 13:16:36",
          "score": 17,
          "num_children": 0,
          "author": 351284,
          "replies": []
        },
        {
          "id": "ing3dfp",
          "text": "Oh do tell us what your god intended sex to be. This should be fascinating.",
          "timestamp": "2022-09-07 13:15:36",
          "score": 10,
          "num_children": 0,
          "author": 286151,
          "replies": []
        },
        {
          "id": "ing3703",
          "text": "You're in the wrong sub.",
          "timestamp": "2022-09-07 13:14:13",
          "score": 6,
          "num_children": 0,
          "author": 365038,
          "replies": []
        },
        {
          "id": "ing57mu",
          "text": "Strange, then, that so many of the perpetrators are Christian clergy members. See r/pastorarrested. \n\nActually it’s quite obvious that there are basic psychological principles involved. Deeply flawed tribal thinking that Christian = good, teaching people to be ashamed and afraid of their own sexuality, creating a space where people are told implicitly and explicitly that church representatives and elders are not to be questioned or opposed, creating an environment where the image of moral superiority takes precedence over victims’ rights because of the “damage” it would do to their church’s finances if the sexual abuse was disclosed, and generally teaching people that when bad things happen to them it’s either their own fault or they just don’t understand god’s mysterious plan that somehow involved his earthly representatives raping the children of the faithful.\n\nIn other words, you’re correct in saying biblical principles are at work here. Child molestation continues to be a widespread problem, especially in church environments, specifically as a result of the “Christian worldview.”",
          "timestamp": "2022-09-07 13:29:26",
          "score": 6,
          "num_children": 0,
          "author": 196146,
          "replies": []
        },
        {
          "id": "ing5w76",
          "text": "Society is *less* tolerant of aberrant behaviour: the reason child molestation appears to be on the rise is because good people are no longer prepared to remain silent.  Priests have been molesting children for as long as the Catholic church has been around, it was just kept quiet because people were afraid of the church, which had the power to destroy lives.\n\nOf course, your definition of “aberrant behaviour” includes homosexuality, but why do you care?  Homosexuality is not on the rise, it has always existed, society is just beginning to accept now that it’s completely normal.\n\nIt’s only religious institutions which are hiding child abuse.",
          "timestamp": "2022-09-07 13:34:26",
          "score": 5,
          "num_children": 0,
          "author": 319100,
          "replies": []
        },
        {
          "id": "ing62rc",
          "text": "Fuck off, man. We're just holding your leaders accountable for once. Child molestation is not considered acceptable by anyone other than sick fucks. Find me a single atheist who would think it's okay to molest ANYONE, let alone a child. Don't mix me in with Christians who will bend over backwards to find a way to justify when their priest/pastor gets caught.\n\nIt's just more common to hear about it because of how modern news cycles and spread. Can't hide shit when anyone with a phone and internet connection can call someone out on their bullshit. \n\nAdditionally, victims are slowing feeling more and more empowered to actually seek out justice and hold these assholes accountable. We have a long way to go as a society, but every time there is a new story where someone gets caught and punished it hopefully gives other victims the hope that the same can happen to their predator.",
          "timestamp": "2022-09-07 13:35:45",
          "score": 4,
          "num_children": 0,
          "author": 240043,
          "replies": []
        },
        {
          "id": "ing5e77",
          "text": "LOL what?  Everytime I think some Christian has outdone themselves with ignorance another comes along to prove me wrong.  Where is \"child molestation\" increasingly accepted apart from in the church that keeps hiding their pedophiles?  \n\nAlso it isnt \"more common\". It just gets caught now.",
          "timestamp": "2022-09-07 13:30:45",
          "score": 3,
          "num_children": 0,
          "author": 78304,
          "replies": []
        }
      ]
    },
    {
      "id": "ini9vwr",
      "text": "Simple statement, answer - yes.\n\nThis thread WRAAAAGH CHUUUUURCH WRAAAGH CANT TELL DIFFERENCE BETWEEN DENOMINATIONS WRAAAGH WRAAAGH.\n\nResult - fuck all worthwhile discussion of simple subject that could be understood by reading the well considered title.\n\nRedditors suck.",
      "timestamp": "2022-09-07 21:38:55",
      "score": -2,
      "num_children": 0,
      "author": 373852,
      "replies": []
    },
    {
      "id": "iniia38",
      "text": "Adrenochrome need I say more.",
      "timestamp": "2022-09-07 22:35:16",
      "score": -2,
      "num_children": 1,
      "author": 100696,
      "replies": [
        {
          "id": "inkjlhv",
          "text": "Adrenochrome can be easily synthesized in a lab, so why the evil evil conspirators have to take it from children makes no sense.\n\nBut then conspiracy theories rarely do.",
          "timestamp": "2022-09-08 10:16:40",
          "score": 3,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "inkktt0",
              "text": "Because human traffickers get off on the  suffering at children duh that's why its a billion dollar business because organ harvesting makes big bucks.",
              "timestamp": "2022-09-08 10:31:36",
              "score": 1,
              "num_children": 1,
              "author": 100696,
              "replies": [
                {
                  "id": "inkl07j",
                  "text": "Ok, why not just make the children suffer without harvesting the minute amount of adrenochrome they can get from them and then synthesize huge amounts in the lab?\n\nAnd I suppose you have evidence for this happening, right?",
                  "timestamp": "2022-09-08 10:33:43",
                  "score": 1,
                  "num_children": 1,
                  "author": 286151,
                  "replies": [
                    {
                      "id": "inkl5c0",
                      "text": "Humanity is psychopathic thats why cannibal drug cartels exist and torture videos of them committing these acts are online if you dig hard enough.",
                      "timestamp": "2022-09-08 10:35:23",
                      "score": 1,
                      "num_children": 1,
                      "author": 100696,
                      "replies": [
                        {
                          "id": "inkle1k",
                          "text": "So no evidence.",
                          "timestamp": "2022-09-08 10:38:13",
                          "score": 1,
                          "num_children": 1,
                          "author": 286151,
                          "replies": [
                            {
                              "id": "inkltap",
                              "text": "https://en.m.wikipedia.org/wiki/Adrenochrome",
                              "timestamp": "2022-09-08 10:43:04",
                              "score": 1,
                              "num_children": 1,
                              "author": 100696,
                              "replies": [
                                {
                                  "id": "inkm7qj",
                                  "text": "Not only is that not evidence, it agrees with me that it's a conspiracy theory to be dismissed. Did you even read it?",
                                  "timestamp": "2022-09-08 10:47:32",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 286151,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ingevl5",
      "text": "None of this means jack shit until priests are allowed to marry. Otherwise the job will forever attract pedophiles and other weirdos.",
      "timestamp": "2022-09-07 14:37:27",
      "score": -1,
      "num_children": 1,
      "author": 11718,
      "replies": [
        {
          "id": "ingg5p7",
          "text": "Celibacy doesn't cause pedophilia. Pedophiles will still be attracted to the priesthood because it gives them easy access to children from a trusted position.",
          "timestamp": "2022-09-07 14:45:54",
          "score": 8,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "inh7pq5",
              "text": "Does the priesthood turn people *into* child abusers, or do people who are *already* child abusers seek out the priesthood?\n\nI feel that the answer is \"a bit of both\".\n\nNot only does a position as a priest give you access to an ever-refreshing pool of potential victims, and even contain rituals for isolating and giving you leverage over the most vulnerable of them; but the organization itself has dedicated an incredible amount of resources to protecting child abusers among its ranks from discovery or justice. If you already plan on abusing children, \"priest\" is the ultimate dream job.\n\nAnd where child abusers gather, pedophilia is of course going to be normalized. The Church has spent a long, long time fighting against healthy attitudes towards sexuality or any real sex education. There's a lot of social reasons for this, but one of the big ones is to keep their victims as vulnerable as possible, to prevent them from realizing what's happening to them until it's too late, to shame them into not speaking up. Another main purpose is, of course, to make themselves feel better about their behaviour. \n\nOf course, despite all the men who sought Holy Orders with the specific intention of using their congregation as an all-you-can-molest buffet, there are still presumably going to be *some* people who joined The Church for other reasons. Some percentage of those people are going to be \"marginal pedophiles\" - those who have some small predisposition towards attraction-to-minors, but who would never have acted on it, and likely never even become consciously aware of it, if they didn't spend years immersed in a culture that **glorifies and encourages** the rape of children. These people could have gone on to live a normal life with a totally healthy sexuality, if they hadn't made the mistake of joining an organization whose stated rule is \"You are never allowed to experiene sexual release ever again!\", and whose unwritten but institutionally accepted rule is \"...except by raping a child.\"\n\nThe existing child-abusers understand that it's in their best interests to recruit these new priests into their ranks. The more of them there are, the more they can help each other, and the more easily they can convince themselves that there's nothing wrong with that they're doing. Perhaps more importantly, in the (apparently very, very rare) instance that a priest might figure out that **raping children is bad**, the fact that he's *complicit* in the abuse ought to be enough to keep him silent.\n\ntl;dr: Powerful pedophiles protect the positions of their pals, pardon each other's perversions, and promote participation of potential pedophiles via peer pressure.",
              "timestamp": "2022-09-07 17:42:00",
              "score": 2,
              "num_children": 1,
              "author": 18996,
              "replies": [
                {
                  "id": "inhaoag",
                  "text": "Lots of focus on priests and no mention of nuns....\n\nIn residential schools the vast majority of sex abuse was committed by nuns, not priests, as they outnumbered the priests multiple times over. This issue persists in the nunneries.\n\nWe ignore it because of misogynistic prejudices.\n\nIf we really want to fix this problem then we need to stop being sexist about which abusers we deal with.",
                  "timestamp": "2022-09-07 18:00:27",
                  "score": 1,
                  "num_children": 0,
                  "author": 224654,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "inhvm3g",
      "text": "Recent Time Suck Podcast on the matter\n\nhttps://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5zaW1wbGVjYXN0LmNvbS9MbGM3S0wySw/episode/YTgzMGRmZDUtY2NhYi00Mzc5LTgwNmQtNzI5ZjgzYmRiYjY1?ep=14",
      "timestamp": "2022-09-07 20:10:15",
      "score": 0,
      "num_children": 1,
      "author": 73712,
      "replies": [
        {
          "id": "inkn84s",
          "text": "Hail Nimrod",
          "timestamp": "2022-09-08 10:58:34",
          "score": 1,
          "num_children": 0,
          "author": 252875,
          "replies": []
        }
      ]
    },
    {
      "id": "inhxlla",
      "text": "All religions are guilty of covering for pedophiles, they care more about the institution than the people.  Almost all organizations operate this way, don't be fooled by it being a catholic problem",
      "timestamp": "2022-09-07 20:22:19",
      "score": 0,
      "num_children": 0,
      "author": 212513,
      "replies": []
    }
  ]
}