{
  "id": "xiobd8",
  "text": "#1 leader of Southern Baptists: Christians who don't vote Republican are \"unfaithful.\" Hey IRS: Do your job and revoke their tax exempt status for violating the Johnson Amendment of 1954.\n",
  "timestamp": "2022-09-19 20:51:12",
  "score": 43692,
  "subreddit": "t5_2qh2p",
  "num_children": 243,
  "author": 221311,
  "replies": [
    {
      "id": "ip52s9i",
      "text": "Hello r/all, Welcome to r/atheism!\n\nPlease read our [Commandments](http://www.reddit.com/r/atheism/wiki/guidelines) and [FAQ](http://www.reddit.com/r/atheism/wiki/FAQ) before commenting. If you follow the rules and act civilly we can avoid a lot of bans. While everyone is welcome here, this sub is intended for atheists to discuss things of interest to us. This means that a wide variety of subjects are on-topic here. This is not a sub about just atheism.\n\nRemember: The mods do not choose which posts get voted up the frontpage. They remove the posts that violate the [Commandments](/r/atheism/w/guidelines); they don't police quality.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*",
      "timestamp": "2022-09-20 01:28:56",
      "score": 1,
      "num_children": 1,
      "author": 184140,
      "replies": [
        {
          "id": "ip57yhe",
          "text": "This pastor, no matter what office he holds in Southern Baptist Convention is voicing his opinion. I agre that is not the place for that and he shouldn’t be doing it. But SBC churches do what they want. All churches and people are autonomous. They make there own decisions as they interpret the Bible.",
          "timestamp": "2022-09-20 02:08:49",
          "score": -7,
          "num_children": 0,
          "author": 100611,
          "replies": []
        }
      ]
    },
    {
      "id": "ip4athw",
      "text": "It's happening in small churches all across the country. I heard this line repeatedly 30 years ago",
      "timestamp": "2022-09-19 21:53:19",
      "score": 393,
      "num_children": 6,
      "author": 230822,
      "replies": [
        {
          "id": "ip57sze",
          "text": "I grew up in the 90s and 2000s hearing catholic priests in multiple churches consistently say that it is a catholic’s moral imperative to vote for republican candidates, that whatever opposing Democrat is the anti-christ, and that voting for “pro life” candidates is all that matters in elections. I didn’t realize how fucked up that is until about halfway through college when I broke up with my *very* catholic girlfriend at the time and started making non-religious friends.\n\nI got confirmed in high school because that’s just what you did in 10th grade and my wife and I got married in a catholic church to make the parents and grandparents happy but I regret both of those things in hindsight.",
          "timestamp": "2022-09-20 02:07:34",
          "score": 128,
          "num_children": 6,
          "author": 30837,
          "replies": [
            {
              "id": "ip61wpz",
              "text": "My parents’ Evangelical church is exactly like this. This country is screwed.",
              "timestamp": "2022-09-20 07:33:17",
              "score": 32,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ipuameq",
              "text": "I came from an Italian and Irish family. But my dad was just a white trash son of a moonshiner who went to college. He graduated with a degree in microbiology. Thanks to my semi atheist father my parents let me decide if I wanted to keep going to Sunday school when I was 10. I said hell no. \n\nI imagine I was coming home from Sunday school saying some wacky Catholic stuff.\n\nI'll always be thankful for my parents giving me the choice.",
              "timestamp": "2022-09-25 14:09:23",
              "score": 2,
              "num_children": 0,
              "author": 354674,
              "replies": []
            },
            {
              "id": "ip5bofu",
              "text": "I thought the catholic church does communion at 8 or so? Could be wrong. I was forced at 12/13, but not catholic",
              "timestamp": "2022-09-20 02:38:40",
              "score": 3,
              "num_children": 1,
              "author": 140396,
              "replies": [
                {
                  "id": "ip5cgzy",
                  "text": "First communion is around 7 or 8. Confirmation is 10th or 11th grade.\n\nMy understanding of the idea behind confirmation is you choosing to follow the catholic church and it’s teachings. The person was likely baptized as an infant and had no choice in the matter. Confirmation is essentially a reaffirmation of your baptism as an teenager that is supposed to be an informed decision based on an understanding of the church’s teachings and beliefs. In reality it’s something they have the high school youth group do some Sunday in the summer after having them attend a few classes/lectures and listen to a priest tell them masturbation and sex outside of marriage will send them to hell.",
                  "timestamp": "2022-09-20 02:45:17",
                  "score": 15,
                  "num_children": 8,
                  "author": 30837,
                  "replies": [
                    {
                      "id": "ip5ggt9",
                      "text": "Also you're under 18 and your parents basically force you to do Confirmation with everyone else. It's not really your decision.",
                      "timestamp": "2022-09-20 03:19:40",
                      "score": 21,
                      "num_children": 2,
                      "author": 21912,
                      "replies": [
                        {
                          "id": "ip5kok8",
                          "text": "Ding ding!!! This!!",
                          "timestamp": "2022-09-20 04:00:27",
                          "score": 8,
                          "num_children": 0,
                          "author": 140396,
                          "replies": []
                        },
                        {
                          "id": "ip786ji",
                          "text": "The Sunday morning after I made my confirmation I told my mother, when she woke me up to get ready for church, that I was now\"considered an adult in the eyes of the church\" and was making the decision to no longer go. The whole thing seemed fishy to me from the beginning.",
                          "timestamp": "2022-09-20 14:48:27",
                          "score": 1,
                          "num_children": 0,
                          "author": 19306,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ip6i5xe",
                      "text": "I went thru 12yrs of Catholic school in Cincinnati. We did first communion in 2nd grade & confirmation in 7th. How in the hell anyone can claim that a child that age is capable of making THEIR OWN informed decision about religion is a testament to the brainwashing the Catholic church inflicts upon its most impressionable members.",
                      "timestamp": "2022-09-20 11:19:47",
                      "score": 9,
                      "num_children": 2,
                      "author": 389388,
                      "replies": [
                        {
                          "id": "ip762s5",
                          "text": "The Mormon church is even worse. They expect an 8 year old child to be able to make an informed enough decision whether to be a member by choosing baptism and confirmation. \n\nMyself and many other kids i knew chose to go through the process because it was expected and they wanted to please their parents.",
                          "timestamp": "2022-09-20 14:34:32",
                          "score": 2,
                          "num_children": 0,
                          "author": 104298,
                          "replies": []
                        },
                        {
                          "id": "ip7b0hm",
                          "text": "What about Children introduced to Islam, Judism, and the Morman Church. Will your critique extend to them?",
                          "timestamp": "2022-09-20 15:07:13",
                          "score": 1,
                          "num_children": 1,
                          "author": 307175,
                          "replies": [
                            {
                              "id": "ip7ndmz",
                              "text": "Absolutely. I don’t think children should be indoctrinated with any religion. I think they should be educated about religion, but then be allowed to choose if they want to get involved with such bunk once they are adults & of an age to be able to responsibly make such decisions in an informed manner.",
                              "timestamp": "2022-09-20 16:26:18",
                              "score": 2,
                              "num_children": 0,
                              "author": 389388,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ip6ycxr",
                      "text": "Confirmed catholic here.  I had to go to an hour long class every Wednesday from 1st through 11th grade during the school year.  It was nothing but propaganda",
                      "timestamp": "2022-09-20 13:40:24",
                      "score": 5,
                      "num_children": 1,
                      "author": 69002,
                      "replies": [
                        {
                          "id": "ip76yor",
                          "text": "Same here. CCD classes....Catholic Christian Doctrine ( should be Dogma)",
                          "timestamp": "2022-09-20 14:40:26",
                          "score": 3,
                          "num_children": 0,
                          "author": 305315,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ip7fsf3",
                      "text": "The irony when they talk about schools indoctrinating children when they themselves are forcing this on all their children",
                      "timestamp": "2022-09-20 15:38:24",
                      "score": 5,
                      "num_children": 1,
                      "author": 307063,
                      "replies": [
                        {
                          "id": "ip7ntnz",
                          "text": "It’s all projection.",
                          "timestamp": "2022-09-20 16:29:05",
                          "score": 1,
                          "num_children": 0,
                          "author": 103341,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ip5kqb9",
                      "text": "I was forced to go to confirmation at 12 and 13. Every Wednesday for like 2 years. Year and a half? Doesn't matter. Too long",
                      "timestamp": "2022-09-20 04:00:55",
                      "score": 1,
                      "num_children": 0,
                      "author": 140396,
                      "replies": []
                    },
                    {
                      "id": "ip6ll7a",
                      "text": "My 8th grade religion class was basically 'how to confirmation'.\n\nIf I didn't do it, I probably would have failed, and been the single odd-one-out in my peer group at a highly emotionally fragile time in my life.",
                      "timestamp": "2022-09-20 11:54:19",
                      "score": 1,
                      "num_children": 0,
                      "author": 282418,
                      "replies": []
                    },
                    {
                      "id": "ip79l5e",
                      "text": "I went to Catholic school from Kindergarten to 12th grade. I was baptized not long after I was born, I had Confession in 2nd grade when I was 8y/o, Communion when I was 9y/o in 3rd grade, and Confirmation was when I was 12y/o in 6th grade. It’s true that Confirmation is supposed to be an informed decision to reaffirm your baptism, but I did it just because it was something I was forced into. Ironically, I became an atheist in the summer just a few months after my Confirmation. With all the things they taught me, I honestly thought that Catholicism was 100% proven (they even said constantly that it was the only “true religion” and “closest to God”). It only took 1 George Carlin special (It’s Bad For Ya!) and that was it. I found that what I had been taught was not at all proven and was just like Santa Claus or the Easter Bunny.",
                      "timestamp": "2022-09-20 14:57:46",
                      "score": 1,
                      "num_children": 0,
                      "author": 363716,
                      "replies": []
                    },
                    {
                      "id": "ip7nabe",
                      "text": "Glad my parents respected my beliefs and didn’t force me. I’m in HighSchool rn and going back to church is something I don’t want to ever again in my life.",
                      "timestamp": "2022-09-20 16:25:44",
                      "score": 1,
                      "num_children": 0,
                      "author": 256420,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ip6uvli",
              "text": "I'm so glad my mom was too lazy to get up early on Sunday mornings and drag us to church.\nThe best thing we can do is raise our kids to have a healthy skepticism about religions.  People are leaving the church in droves, we need that to continue.  My kids were raised without religion and, I know, shocker, they're good adults.\nBut I'm not anti religion, I don't really care if someone wants to worship God or ants or even piles of cow shit.  It's when they feel the need to shove their religious views down my throat and force me to adhere to their bullshit religious laws that I take issue.  I'm more of a live and let live kinda gal until you start trying to push me around.  I'm freakishly strong and I push back.",
              "timestamp": "2022-09-20 13:14:19",
              "score": 1,
              "num_children": 0,
              "author": 389136,
              "replies": []
            },
            {
              "id": "ip75v8j",
              "text": "Well, the Catholic church has never been in a better position.\n\nVotes for GOP:  good for business\n\nVotes for DNC:  Their operatives are President and Speaker of the House.",
              "timestamp": "2022-09-20 14:33:07",
              "score": 1,
              "num_children": 0,
              "author": 772,
              "replies": []
            },
            {
              "id": "ip838b6",
              "text": "I can't imagine doing a wedding in a catholic church. Those places are so damn spooky and creepy.",
              "timestamp": "2022-09-20 18:05:18",
              "score": 1,
              "num_children": 1,
              "author": 175088,
              "replies": [
                {
                  "id": "ip85w4j",
                  "text": "It was a whole thing. Catholic mass with the wedding smashed in the middle. We had like 7 choices for reading (including the classic \"women submit to your husbands\" reading), 3 choices for the gospel reading, and the priest specifically called out and prayed for families, the deceased, the unborn, those struggling with \"identity issues\", and a number of other things.\n\nMost of our friends and family who attended are not catholic and many are gay or have had abortions or are divorced. In hindsight I'm not sure making grandma happy was worth the whole thing.\n\nA couple of our friends told us it was a relatively low-key catholic wedding compared to what they had attended in the past. Really makes you wonder.",
                  "timestamp": "2022-09-20 18:22:37",
                  "score": 1,
                  "num_children": 1,
                  "author": 30837,
                  "replies": [
                    {
                      "id": "ip88qzc",
                      "text": "Ah man you should have gotten a bit about the Tuetonic genocide against Lithuanian pagans! That would really set the mood.",
                      "timestamp": "2022-09-20 18:41:28",
                      "score": 1,
                      "num_children": 0,
                      "author": 175088,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ip5msdo",
          "text": "2019 I went to a small church and the preacher demanded we all pray for Trump, “chosen by God to defeat the democrats and help us slay the demons in the upcoming war” \n\nWent only that one time, never went back.",
          "timestamp": "2022-09-20 04:22:20",
          "score": 28,
          "num_children": 2,
          "author": 10650,
          "replies": [
            {
              "id": "ip75mpj",
              "text": "I went to a church briefly that my neighbors had invited my family to, and they made it clear that they would not speak about politics or tell you how to vote.\n\nMy parents didn't like that. It was too liberal.",
              "timestamp": "2022-09-20 14:31:30",
              "score": 12,
              "num_children": 0,
              "author": 159285,
              "replies": []
            },
            {
              "id": "ip76alf",
              "text": "Well, the advantage of being an Atheist is you only need to listen to the voices in your head.  The last thing I need is someone else telling me what to do.",
              "timestamp": "2022-09-20 14:36:00",
              "score": 3,
              "num_children": 0,
              "author": 772,
              "replies": []
            }
          ]
        },
        {
          "id": "ip5f4g2",
          "text": "We need to keep reposting the link to the form to report them.\n\nAnd remind people that there is a possible reward from the IRS as well.\n\nI don't have it on hand but when I find it later I'll probably replace this text and continue to spread it.",
          "timestamp": "2022-09-20 03:07:34",
          "score": 8,
          "num_children": 1,
          "author": 258939,
          "replies": [
            {
              "id": "ip7afb9",
              "text": "https://www.reddit.com/r/exchristian/comments/uwhjdj/time_for_a_new_challenge/?utm_medium=android_app&utm_source=share",
              "timestamp": "2022-09-20 15:03:19",
              "score": 1,
              "num_children": 0,
              "author": 173674,
              "replies": []
            }
          ]
        },
        {
          "id": "ip6sfq4",
          "text": "I found a flyer in a coworker’s car from his church with a list of candidates to vote for in 2008…in the northeast outside a major city. This isn’t new or rare.",
          "timestamp": "2022-09-20 12:55:09",
          "score": 3,
          "num_children": 0,
          "author": 381598,
          "replies": []
        },
        {
          "id": "ip5ot4q",
          "text": "I heard the same, although I don't remember it being quite so explicit. People \"knew\" who to vote for.",
          "timestamp": "2022-09-20 04:45:08",
          "score": 1,
          "num_children": 0,
          "author": 160006,
          "replies": []
        },
        {
          "id": "ip7nui1",
          "text": "He was not in his church acting as a preacher when he gave this statement. He was at a Family Research Council summit.",
          "timestamp": "2022-09-20 16:29:14",
          "score": 1,
          "num_children": 0,
          "author": 361531,
          "replies": []
        }
      ]
    },
    {
      "id": "ip4375o",
      "text": "Fuck this piece of shit",
      "timestamp": "2022-09-19 20:59:47",
      "score": 611,
      "num_children": 3,
      "author": 308610,
      "replies": [
        {
          "id": "ip5562w",
          "text": "Use a condom",
          "timestamp": "2022-09-20 01:47:21",
          "score": 61,
          "num_children": 3,
          "author": 248576,
          "replies": [
            {
              "id": "ip55m6l",
              "text": "Double wrap that shit too",
              "timestamp": "2022-09-20 01:50:45",
              "score": 25,
              "num_children": 0,
              "author": 253251,
              "replies": []
            },
            {
              "id": "ip6ljbg",
              "text": "I'd rather a technology where there is always a miniscule layer of air between, so contact never truly has to be made. I'd be able to sleep much better at night that way.",
              "timestamp": "2022-09-20 11:53:49",
              "score": 1,
              "num_children": 0,
              "author": 407907,
              "replies": []
            },
            {
              "id": "ip6z1zn",
              "text": "Why would I put a condom on a nail studded baseball bat?",
              "timestamp": "2022-09-20 13:45:27",
              "score": 1,
              "num_children": 0,
              "author": 123252,
              "replies": []
            }
          ]
        },
        {
          "id": "ip5dyi8",
          "text": "Rodney Dangerfield wannabe",
          "timestamp": "2022-09-20 02:57:47",
          "score": 6,
          "num_children": 0,
          "author": 53514,
          "replies": []
        },
        {
          "id": "ip5e5au",
          "text": "I always forget that free speech evaporates depending on your tax status. Thanks for the reminder.",
          "timestamp": "2022-09-20 02:59:17",
          "score": -1,
          "num_children": 0,
          "author": 152816,
          "replies": []
        }
      ]
    },
    {
      "id": "ip48umr",
      "text": "Isn’t there a way to report these types?",
      "timestamp": "2022-09-19 21:39:09",
      "score": 1233,
      "num_children": 14,
      "author": 92189,
      "replies": [
        {
          "id": "ip499no",
          "text": "Form 13909\n\nhttps://www.irs.gov/pub/irs-tege/divulge_all_suspected_tax_exempt_status_abuses_to_the_irs.pdf",
          "timestamp": "2022-09-19 21:42:07",
          "score": 724,
          "num_children": 5,
          "author": 100376,
          "replies": [
            {
              "id": "ip4hekm",
              "text": "That links through to: http://www.irs.gov/pub/irs-pdf/f13909.pdf",
              "timestamp": "2022-09-19 22:42:11",
              "score": 463,
              "num_children": 3,
              "author": 378111,
              "replies": [
                {
                  "id": "ip4lc1s",
                  "text": "Sorry about that. I was trying to help quickly while I was at work.",
                  "timestamp": "2022-09-19 23:12:23",
                  "score": 193,
                  "num_children": 0,
                  "author": 100376,
                  "replies": []
                },
                {
                  "id": "ip57qqs",
                  "text": "It's a shame we can't prefill it and just have individual redditors print/mail them.",
                  "timestamp": "2022-09-20 02:07:04",
                  "score": 124,
                  "num_children": 4,
                  "author": 17507,
                  "replies": [
                    {
                      "id": "ip5a5gv",
                      "text": "Wdym, you can definitely prefill it and save as a new pdf.  Then people can just write their addresses.  Do it homie.  I'll print it and I've got prestamped envelopes right here.\n\nEdit:.  **Printable already filled out form here**\n\n\n https://drive.google.com/file/d/1VuRb3quzJQpmYkHAql-Z1iPE--pi%5C_dUK/view?usp=sharing\n\nSee item 6 on the form for mailing address.  And write your address in item 5.  I recommend to check the box that says you're afraid of retaliation; presumably this will keep your name and address from being given to the church.  Can't be too careful with these kinds of people.\n\nThanks /u/Mind_on_Idle .  Mine is already in the mailbox.",
                      "timestamp": "2022-09-20 02:26:27",
                      "score": 323,
                      "num_children": 9,
                      "author": 379264,
                      "replies": [
                        {
                          "id": "ip5clu6",
                          "text": "What can I use to edit a PDF free?\n\nLet me be more clear: How can we have as many people as possible legally sign these forms for you to print?",
                          "timestamp": "2022-09-20 02:46:25",
                          "score": 58,
                          "num_children": 4,
                          "author": 118298,
                          "replies": [
                            {
                              "id": "ip5davw",
                              "text": "The form is built in to the pdf so you shouldn't need any special software.  On PC just use Adobe reader or an alternative.  On mobile you should just be able to open it with the regular pdf app and fill the form, afaik.",
                              "timestamp": "2022-09-20 02:52:14",
                              "score": 35,
                              "num_children": 3,
                              "author": 379264,
                              "replies": [
                                {
                                  "id": "ip5f8e4",
                                  "text": "Heyyoooo!\n\nThis should be filled out with everything required except the signers info.\n\n&#x200B;\n\nhttps://drive.google.com/file/d/1VuRb3quzJQpmYkHAql-Z1iPE--pi\\_dUK/view?usp=drivesdk",
                                  "timestamp": "2022-09-20 03:08:33",
                                  "score": 78,
                                  "num_children": 7,
                                  "author": 118298,
                                  "replies": [
                                    {
                                      "id": "ip5rs14",
                                      "text": "I truly appreciate you, how in the world is it 2022 and we still have to mail shit like this to them... Why can't we just fill it out and submit it online?!",
                                      "timestamp": "2022-09-20 05:19:50",
                                      "score": 26,
                                      "num_children": 4,
                                      "author": 55575,
                                      "replies": [
                                        {
                                          "id": "ip5wue8",
                                          "text": "Some things are intentionally tough.",
                                          "timestamp": "2022-09-20 06:23:27",
                                          "score": 24,
                                          "num_children": 0,
                                          "author": 188199,
                                          "replies": []
                                        },
                                        {
                                          "id": "ip6f5qh",
                                          "text": ">Why can't we just fill it out and submit it online?!\n\nBecause it would be too easy to weaponize, or just clog up with bots.",
                                          "timestamp": "2022-09-20 10:45:20",
                                          "score": 9,
                                          "num_children": 0,
                                          "author": 327712,
                                          "replies": []
                                        },
                                        {
                                          "id": "ip5vvxr",
                                          "text": "\"hackers or something\"\n- IRS",
                                          "timestamp": "2022-09-20 06:10:41",
                                          "score": 8,
                                          "num_children": 0,
                                          "author": 227133,
                                          "replies": []
                                        },
                                        {
                                          "id": "ip6umy7",
                                          "text": "In the instructions you can email it to them. See #6",
                                          "timestamp": "2022-09-20 13:12:29",
                                          "score": 3,
                                          "num_children": 1,
                                          "author": 188194,
                                          "replies": [
                                            {
                                              "id": "ip7yibt",
                                              "text": "I suppose reading is key to these kinds of things. Thank you, kind stranger. Mine has been sent via email.",
                                              "timestamp": "2022-09-20 17:35:43",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 55575,
                                              "replies": [
                                                {
                                                  "id": "ip81mlk",
                                                  "text": "To be fair it’s small and crammed at the bottom of the page. I’ve just submitted enough government papers to know they always include instructions on getting the form back to them.",
                                                  "timestamp": "2022-09-20 17:55:07",
                                                  "score": 2,
                                                  "num_children": 0,
                                                  "author": 188194,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "ip5fruc",
                                      "text": "Must've dropped your crown.",
                                      "timestamp": "2022-09-20 03:13:23",
                                      "score": 23,
                                      "num_children": 0,
                                      "author": 250524,
                                      "replies": []
                                    },
                                    {
                                      "id": "ip6tyva",
                                      "text": "Do we need to live in the state to make this valid?",
                                      "timestamp": "2022-09-20 13:07:17",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 393797,
                                      "replies": [
                                        {
                                          "id": "ip748an",
                                          "text": "No, this is Federal Law.",
                                          "timestamp": "2022-09-20 14:21:57",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 118298,
                                          "replies": [
                                            {
                                              "id": "ip7px31",
                                              "text": "Good good",
                                              "timestamp": "2022-09-20 16:42:11",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 393797,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "ip9utfl",
                                      "text": "The link is no longer valid. Mind reposting it?",
                                      "timestamp": "2022-09-21 01:25:54",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 292675,
                                      "replies": [
                                        {
                                          "id": "ip9zt87",
                                          "text": "https://drive.google.com/file/d/1VuRb3quzJQpmYkHAql-Z1iPE--pi_dUK/view?usp=drivesdk\n\nStill the same link. So I'd just try again.",
                                          "timestamp": "2022-09-21 02:04:17",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 118298,
                                          "replies": [
                                            {
                                              "id": "ipaci42",
                                              "text": "Thanks, that works much better. The link is different. I'm guessing some funky Reddit formatting was keeping me from opening it.",
                                              "timestamp": "2022-09-21 03:46:22",
                                              "score": 2,
                                              "num_children": 1,
                                              "author": 292675,
                                              "replies": [
                                                {
                                                  "id": "ipajn4z",
                                                  "text": "You know what. It's because of *how* I shared the link, I've corrected the first one",
                                                  "timestamp": "2022-09-21 04:53:09",
                                                  "score": 1,
                                                  "num_children": 0,
                                                  "author": 118298,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "ip780wr",
                                      "text": "Just put mine in the mail. Thanks!",
                                      "timestamp": "2022-09-20 14:47:26",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 250646,
                                      "replies": []
                                    },
                                    {
                                      "id": "ip5k1kd",
                                      "text": "File doesn't exist when I click it",
                                      "timestamp": "2022-09-20 03:53:54",
                                      "score": 0,
                                      "num_children": 1,
                                      "author": 52680,
                                      "replies": [
                                        {
                                          "id": "ip5li3m",
                                          "text": "Just tried and it worked.",
                                          "timestamp": "2022-09-20 04:08:49",
                                          "score": 5,
                                          "num_children": 0,
                                          "author": 271694,
                                          "replies": []
                                        }
                                      ]
                                    },
                                    {
                                      "id": "ip5ml6b",
                                      "text": "while while",
                                      "timestamp": "2022-09-20 04:20:16",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 291441,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "ip5lgl8",
                                  "text": "DocuSign for mobile works ok",
                                  "timestamp": "2022-09-20 04:08:22",
                                  "score": 4,
                                  "num_children": 0,
                                  "author": 62843,
                                  "replies": []
                                },
                                {
                                  "id": "ip5df74",
                                  "text": "Heard, back in a few",
                                  "timestamp": "2022-09-20 02:53:15",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 118298,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "ip5p4mz",
                              "text": "DocHub is a good PDF editing tool that gives you like 5 docs a month for free. Might help for this though it costs if you need more",
                              "timestamp": "2022-09-20 04:48:46",
                              "score": 5,
                              "num_children": 1,
                              "author": 51935,
                              "replies": [
                                {
                                  "id": "ip5pd0p",
                                  "text": "~~I found what I needed. Check just a bit lower if you need it (the pdf)~~\n\nThe person above me edited in a link to the pdf I set up.",
                                  "timestamp": "2022-09-20 04:51:23",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 118298,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "ip5zd3e",
                              "text": "Microsoft Edge allows you to edit PDFs on it, basic edition",
                              "timestamp": "2022-09-20 06:57:14",
                              "score": 1,
                              "num_children": 0,
                              "author": 101790,
                              "replies": []
                            },
                            {
                              "id": "ippkjmt",
                              "text": ">What can I use to edit a PDF free?\n>\n>Let me be more clear: How can we have as many people as possible legally sign these forms for you to print?\n\nWhy bother? These statements don't violate the law. It's a waste of time, paper, postage.",
                              "timestamp": "2022-09-24 12:29:55",
                              "score": 0,
                              "num_children": 1,
                              "author": 53061,
                              "replies": [
                                {
                                  "id": "ippp924",
                                  "text": "Well aren't you a useful fountain of non-specific information 4 days after the conversation.",
                                  "timestamp": "2022-09-24 13:15:22",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 118298,
                                  "replies": [
                                    {
                                      "id": "ipyzjpv",
                                      "text": "Ok, and? I stated the correct law. His speech in this video is protected speech and doesn't violate the church's tax exempt status. The IRS publications are in plain English, go read them.",
                                      "timestamp": "2022-09-26 14:02:43",
                                      "score": 0,
                                      "num_children": 1,
                                      "author": 53061,
                                      "replies": [
                                        {
                                          "id": "ipzmc16",
                                          "text": "Uh, you didn't state or source a fucking thing, so you should have put it somewhere everyone could see it. Instead you chose to be a snarky punk to one person. Con-grat-u-fucking-lations, you're a fucking tool.",
                                          "timestamp": "2022-09-26 16:35:52",
                                          "score": 1,
                                          "num_children": 0,
                                          "author": 118298,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ip5g1gx",
                          "text": "Note that the bottom of page one of the form provides an email to which completed forms can be sent. \n \nEoclass@irs.gov",
                          "timestamp": "2022-09-20 03:15:48",
                          "score": 27,
                          "num_children": 2,
                          "author": 209117,
                          "replies": [
                            {
                              "id": "ip5if3n",
                              "text": "Perfect, save the trees. No sense in killing more trees just to deal with these oxygen thiefs...",
                              "timestamp": "2022-09-20 03:37:50",
                              "score": 17,
                              "num_children": 1,
                              "author": 327811,
                              "replies": [
                                {
                                  "id": "ippkmel",
                                  "text": ">Perfect, save the trees. No sense in killing more trees just to deal with these oxygen thiefs...\n\nNo sense in doing anything since his statement here doesn't violate the law.",
                                  "timestamp": "2022-09-24 12:30:42",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 53061,
                                  "replies": []
                                }
                              ]
                            },
                            {
                              "id": "ip5js54",
                              "text": "Prefilling the form broke the built-in text fields.  So you would have to write your address on the PDF to send it digitally.  This site claims to let you do it for free, and there may be other sites. https://pdf-writer.pdffiller.com/\n\nEdit: Might be easier to just copy and paste over from the prefilled form to a blank one manually, now that I think of it.  Well, either way works.",
                              "timestamp": "2022-09-20 03:51:16",
                              "score": 5,
                              "num_children": 2,
                              "author": 379264,
                              "replies": [
                                {
                                  "id": "ip74llz",
                                  "text": "Crap. Wish I had seen this sooner. Let me see if I can save those correct text placeholders back in without breaking it.",
                                  "timestamp": "2022-09-20 14:24:28",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 118298,
                                  "replies": [
                                    {
                                      "id": "ip7b3if",
                                      "text": "I don't think you can but I could be wrong so it's worth taking a google",
                                      "timestamp": "2022-09-20 15:07:45",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 379264,
                                      "replies": []
                                    }
                                  ]
                                },
                                {
                                  "id": "ip6jo7z",
                                  "text": "Download Inkscape and you should be able to add text boxes wherever you want.",
                                  "timestamp": "2022-09-20 11:35:26",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 343879,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ip5p8kf",
                          "text": "Drive link is dead",
                          "timestamp": "2022-09-20 04:50:00",
                          "score": 3,
                          "num_children": 0,
                          "author": 3808,
                          "replies": []
                        },
                        {
                          "id": "ip5d46r",
                          "text": "Ok, man, I just bought printer ink, if we have to print them out at home!",
                          "timestamp": "2022-09-20 02:50:43",
                          "score": 2,
                          "num_children": 1,
                          "author": 24070,
                          "replies": [
                            {
                              "id": "ip6twe4",
                              "text": "im so confused",
                              "timestamp": "2022-09-20 13:06:45",
                              "score": 1,
                              "num_children": 0,
                              "author": 75724,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ip5dgih",
                          "text": "Same. I'll buy stamps to mail these fuckers off.",
                          "timestamp": "2022-09-20 02:53:32",
                          "score": 1,
                          "num_children": 0,
                          "author": 93429,
                          "replies": []
                        },
                        {
                          "id": "ip5krhr",
                          "text": "I'm in lets do it. Church exemption and political advocation is a fucking blight.",
                          "timestamp": "2022-09-20 04:01:14",
                          "score": 1,
                          "num_children": 0,
                          "author": 117896,
                          "replies": []
                        },
                        {
                          "id": "ip5qu83",
                          "text": "Thank you!",
                          "timestamp": "2022-09-20 05:08:27",
                          "score": 1,
                          "num_children": 0,
                          "author": 61683,
                          "replies": []
                        },
                        {
                          "id": "ip87zic",
                          "text": "Link is down",
                          "timestamp": "2022-09-20 18:36:25",
                          "score": 1,
                          "num_children": 1,
                          "author": 257822,
                          "replies": [
                            {
                              "id": "ip89pmc",
                              "text": "Works for me",
                              "timestamp": "2022-09-20 18:47:47",
                              "score": 1,
                              "num_children": 1,
                              "author": 379264,
                              "replies": [
                                {
                                  "id": "ip89um4",
                                  "text": "Every time I click it, it gives me the generic “this file does not exist”",
                                  "timestamp": "2022-09-20 18:48:43",
                                  "score": 2,
                                  "num_children": 0,
                                  "author": 257822,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ippkhtg",
                          "text": ">Thanks /u/Mind_on_Idle .  Mine is already in the mailbox.\n\nWasted your time since these statements don't violate the law.",
                          "timestamp": "2022-09-24 12:29:23",
                          "score": 0,
                          "num_children": 0,
                          "author": 53061,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ip5arv1",
                      "text": "Tell me how to fill this out and I'll write a program to do that.",
                      "timestamp": "2022-09-20 02:31:18",
                      "score": 18,
                      "num_children": 2,
                      "author": 104429,
                      "replies": [
                        {
                          "id": "ip5bt4s",
                          "text": "This is how shit gets done let's gooo",
                          "timestamp": "2022-09-20 02:39:44",
                          "score": 12,
                          "num_children": 0,
                          "author": 125893,
                          "replies": []
                        },
                        {
                          "id": "ip5jy2l",
                          "text": "Match the fillers to some printers. Eg - if someone sends me ten, I’ll print and mail. Said differently, if there was an app where I could volunteer to print and mail for people, I’d volunteer.",
                          "timestamp": "2022-09-20 03:52:54",
                          "score": 2,
                          "num_children": 0,
                          "author": 235466,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ip5978s",
                      "text": "How much is a stamp?",
                      "timestamp": "2022-09-20 02:18:50",
                      "score": 5,
                      "num_children": 1,
                      "author": 93666,
                      "replies": [
                        {
                          "id": "ip5fkut",
                          "text": "Costs like 50 cents lol",
                          "timestamp": "2022-09-20 03:11:40",
                          "score": 1,
                          "num_children": 0,
                          "author": 136698,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ippkfkn",
                      "text": ">It's a shame we can't prefill it and just have individual redditors print/mail them.\n\nI mean the biggest shame is all the time wasted since this statement by the pastor doesn't violate the law.",
                      "timestamp": "2022-09-24 12:28:44",
                      "score": 1,
                      "num_children": 0,
                      "author": 53061,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ip5ffce",
                  "text": "We should create a subreddit specifically designed to coordinate and submit the 13909 form at scale.I’m bookmarking this document and plan to put it to good use this election season!!",
                  "timestamp": "2022-09-20 03:10:17",
                  "score": 29,
                  "num_children": 2,
                  "author": 354629,
                  "replies": [
                    {
                      "id": "ip5gfka",
                      "text": "r/taxthechurches Just made it.",
                      "timestamp": "2022-09-20 03:19:21",
                      "score": 39,
                      "num_children": 2,
                      "author": 157188,
                      "replies": [
                        {
                          "id": "ip5mlsf",
                          "text": "Cross post it",
                          "timestamp": "2022-09-20 04:20:26",
                          "score": 6,
                          "num_children": 0,
                          "author": 336092,
                          "replies": []
                        },
                        {
                          "id": "ip5ob63",
                          "text": "Subbed thanks",
                          "timestamp": "2022-09-20 04:39:26",
                          "score": 2,
                          "num_children": 1,
                          "author": 250665,
                          "replies": [
                            {
                              "id": "ip75slq",
                              "text": "Thank you! Feel free to spread the good news!",
                              "timestamp": "2022-09-20 14:32:37",
                              "score": 2,
                              "num_children": 0,
                              "author": 157188,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ip6dy1l",
                      "text": "If these religious nutcases think it's ok to monitor polling places while armed, it should be ok to monitor churches while armed at well, right? Goose, gander.",
                      "timestamp": "2022-09-20 10:30:15",
                      "score": 1,
                      "num_children": 1,
                      "author": 272461,
                      "replies": [
                        {
                          "id": "ip87ciy",
                          "text": "I mean, I was just planning to file IRS complaints lol, but hey, we have a big tent and all ideas are welcome!",
                          "timestamp": "2022-09-20 18:32:09",
                          "score": 1,
                          "num_children": 0,
                          "author": 354629,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ip4lx6n",
              "text": "So many other forms up to that point!",
              "timestamp": "2022-09-19 23:17:02",
              "score": 17,
              "num_children": 0,
              "author": 81897,
              "replies": []
            },
            {
              "id": "ip552rt",
              "text": "Yea but which of you has the balls to fill it out?",
              "timestamp": "2022-09-20 01:46:40",
              "score": 2,
              "num_children": 2,
              "author": 143372,
              "replies": [
                {
                  "id": "ip5fc9i",
                  "text": "I filed a complaint, did all the paperwork, included pictures where they had giant Trump signs clearly on the church property, etc when Trump ran the first time.\n\nAs of three minutes ago my state's website says they still are a nonprofit... so roughly 7 years with zero action after having been given proof nobody could deny.",
                  "timestamp": "2022-09-20 03:09:31",
                  "score": 41,
                  "num_children": 3,
                  "author": 207927,
                  "replies": [
                    {
                      "id": "ip5mppd",
                      "text": "Remember that paperwork is received by a human. A human can be sympathetic with these nuts. Keep sending copies. Then complain to a sympathetic opposition party and media. Make sure they process the document.",
                      "timestamp": "2022-09-20 04:21:34",
                      "score": 22,
                      "num_children": 1,
                      "author": 336092,
                      "replies": [
                        {
                          "id": "ip5wvcq",
                          "text": ">  media.\n\n media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media. media! \n\nNo, seriously, media.",
                          "timestamp": "2022-09-20 06:23:48",
                          "score": 10,
                          "num_children": 0,
                          "author": 326151,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ip5o3po",
                      "text": "report to IRS,  then report to your state representative that you've reported it to the IRS and saw no results.",
                      "timestamp": "2022-09-20 04:37:02",
                      "score": 14,
                      "num_children": 3,
                      "author": 160858,
                      "replies": [
                        {
                          "id": "ip6jtqp",
                          "text": "My representative probably goes to one of these churches, so that second part is useless.",
                          "timestamp": "2022-09-20 11:37:00",
                          "score": 5,
                          "num_children": 1,
                          "author": 343879,
                          "replies": [
                            {
                              "id": "ip6q34e",
                              "text": "My state rep is Louisianian, so he probably thinks those guys aren't MAGA enough for heaven",
                              "timestamp": "2022-09-20 12:35:27",
                              "score": 3,
                              "num_children": 0,
                              "author": 268142,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ip7qzs5",
                          "text": "My representative told me to get fucked last time I contacted him. His entire campaign last time around was \"I side with Trump\"... and he won.",
                          "timestamp": "2022-09-20 16:48:50",
                          "score": 1,
                          "num_children": 0,
                          "author": 207927,
                          "replies": []
                        },
                        {
                          "id": "ippkr2i",
                          "text": ">report to IRS,  then report to your state representative that you've reported it to the IRS and saw no results.\n\nWhy? They will write back and explain to you that these statements by the pastor don't violate the law.",
                          "timestamp": "2022-09-24 12:32:04",
                          "score": 1,
                          "num_children": 0,
                          "author": 53061,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ip5l534",
                      "text": "Yep",
                      "timestamp": "2022-09-20 04:05:05",
                      "score": 5,
                      "num_children": 0,
                      "author": 143372,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ip5704s",
                  "text": "Be the change you want to see in the world!",
                  "timestamp": "2022-09-20 02:01:17",
                  "score": 20,
                  "num_children": 1,
                  "author": 100376,
                  "replies": [
                    {
                      "id": "ip5k10k",
                      "text": "You want me to be cheaper burritos?",
                      "timestamp": "2022-09-20 03:53:44",
                      "score": 3,
                      "num_children": 3,
                      "author": 235466,
                      "replies": [
                        {
                          "id": "ip6ltj0",
                          "text": "Yes! But actually quesadillas. Those things are surprisingly expensive!",
                          "timestamp": "2022-09-20 11:56:32",
                          "score": 1,
                          "num_children": 1,
                          "author": 407907,
                          "replies": [
                            {
                              "id": "ip6s3xg",
                              "text": "No love for the carnitas??  I could eat those every day.  Damnit, now I want Mexican food.",
                              "timestamp": "2022-09-20 12:52:28",
                              "score": 1,
                              "num_children": 0,
                              "author": 389136,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ip73hd9",
                          "text": "You can learn how to make them yourself and have cheaper burritos. Bonus points if you grow the vegetables yourself.",
                          "timestamp": "2022-09-20 14:16:49",
                          "score": 1,
                          "num_children": 0,
                          "author": 65151,
                          "replies": []
                        },
                        {
                          "id": "ip9ygwg",
                          "text": "If that's what it takes.",
                          "timestamp": "2022-09-21 01:53:51",
                          "score": 1,
                          "num_children": 0,
                          "author": 181137,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ip6b9k3",
              "text": "It’s not going to do any good. They never go after them, just regular Americans.",
              "timestamp": "2022-09-20 09:53:56",
              "score": 1,
              "num_children": 0,
              "author": 79513,
              "replies": []
            },
            {
              "id": "ippkcle",
              "text": ">Form 13909\n>\n>https://www.irs.gov/pub/irs-tege/divulge_all_suspected_tax_exempt_status_abuses_to_the_irs.pdf\n\nDoesn't matter, these statements do not violate the law.",
              "timestamp": "2022-09-24 12:27:52",
              "score": 1,
              "num_children": 0,
              "author": 53061,
              "replies": []
            }
          ]
        },
        {
          "id": "ip493ts",
          "text": "[Here's the form. ](https://www.irs.gov/pub/irs-news/fs-08-13.pdf)",
          "timestamp": "2022-09-19 21:40:58",
          "score": 262,
          "num_children": 1,
          "author": 77934,
          "replies": [
            {
              "id": "ip4hig7",
              "text": "Fill this out, then use directions linked ^\n\nhttp://www.irs.gov/pub/irs-pdf/f13909.pdf",
              "timestamp": "2022-09-19 22:43:00",
              "score": 166,
              "num_children": 0,
              "author": 378111,
              "replies": []
            }
          ]
        },
        {
          "id": "ip555r7",
          "text": "Yes (someone posted it below).\n\nThe *real* question is \"how do we get the IRS to actually *act* on those reports\"?",
          "timestamp": "2022-09-20 01:47:17",
          "score": 22,
          "num_children": 0,
          "author": 155543,
          "replies": []
        },
        {
          "id": "ip52ft2",
          "text": "With this Supreme Court?",
          "timestamp": "2022-09-20 01:26:16",
          "score": 7,
          "num_children": 0,
          "author": 204290,
          "replies": []
        },
        {
          "id": "ip4pcc9",
          "text": "you can report it, cant force the government to follow through and honor the law. and the ones doing this crap, actually would welcome the loss of their irs status so they can scream the government is trying to shut down jesus. and losing the 503 status for wealthy churches wouldnt mean all that much. effective taxes are low as fuck in this country.\n\nwe pretty much never enforce the johnson amendment we did once with farwell but really havent since.\n\n\nbut lets say we enforce the fuck out of it, its a meaningless fight because all you can not do is say 'vote for this dude or party\" but you can bash the shit out of biden fighting to restore abortion rights, you can say the republican party protects the unborn while dems want to kill them.  THATS OK under the amendment.\n\nbasically what im saying is despite i agree with OP they should lose their tax status, there are more important things to fight over, than this weak as all fuck regulation. The only reason this guy is violating it is to get into the news, because he could pretty much tell his congregation to vote GOP without actually using those words. Its kinda like cities that have rules on calling bongs, water pipes. It doesnt really change anything. The bongs still get sold and still get filled with cannabis. Its a meaningless reg. Yeah things would be worse without the johnson amendment but its still not one of the major things we should put a lot of calories into getting upset about, because its a weak as all fuck reg that isnt even enforced for shit for churches anyways.",
          "timestamp": "2022-09-19 23:43:59",
          "score": 81,
          "num_children": 13,
          "author": 220399,
          "replies": [
            {
              "id": "ip4vkyi",
              "text": "[deleted]",
              "timestamp": "2022-09-20 00:33:10",
              "score": 49,
              "num_children": 2,
              "replies": [
                {
                  "id": "ip52vj8",
                  "text": "There was a church in Houston years ago that got flagged for sending out voter guides or something, so the government was actually being really lenient and instead of revoking their status asked to look at their sermons to investigate.  \n\n\nThe story went national and was blasted on fox news for weeks as the headlines  \n\"GOVERNMENT CENSORS GOD\" or some shit. so basically it radicalized even more people, and drove the congregation up. it's so trash. So infuriating",
                  "timestamp": "2022-09-20 01:29:40",
                  "score": 22,
                  "num_children": 2,
                  "author": 302362,
                  "replies": [
                    {
                      "id": "ip54ez2",
                      "text": "[deleted]",
                      "timestamp": "2022-09-20 01:41:34",
                      "score": 15,
                      "num_children": 0,
                      "replies": []
                    },
                    {
                      "id": "ip5gswy",
                      "text": "Well, that's what you get for unfettered freedom of speech lol.",
                      "timestamp": "2022-09-20 03:22:42",
                      "score": 0,
                      "num_children": 0,
                      "author": 284461,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ip95azn",
                  "text": "The only thing grifters hate more than the money being cut off is nothing. There is nothing they hate worse.",
                  "timestamp": "2022-09-20 22:15:03",
                  "score": 1,
                  "num_children": 0,
                  "author": 35017,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip50lvi",
              "text": "I don't care if they whine and bitch about it. The louder they are, the more it will draw scrutiny by those who are generally unaware of this abuse of tax exemption.",
              "timestamp": "2022-09-20 01:12:03",
              "score": 10,
              "num_children": 1,
              "author": 71269,
              "replies": [
                {
                  "id": "ip5de9t",
                  "text": "It's such an easy PR move. \"God wants this christian money to fund the government.\"",
                  "timestamp": "2022-09-20 02:53:02",
                  "score": 1,
                  "num_children": 0,
                  "author": 43349,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip54c2l",
              "text": "They would not welcome the loss of their tax emempt status… money talks and they’d go broke without it!",
              "timestamp": "2022-09-20 01:40:58",
              "score": 5,
              "num_children": 0,
              "author": 115003,
              "replies": []
            },
            {
              "id": "ip65pw3",
              "text": "Attack from ALL angles. Period.  \n  \n'Bigger fish to fry' isn't constructive, in fact it **hurts** us.  \n  \nIf some random person, let's call them Randall, decides to get involved with this particular subject because it's close to their heart (went to a church like this and was victimized by the community, for example) BUT wouldn't do so otherwise for a number of other 'more important' issues; your negative input might discourage him from helping at all. That doesn't help anyone, does it?   \n  \nThere are millions of people involved here, all wanting to do their part in one way or another. They can't all be focused entirely upon the exact same issues, can they? This is why we shouldn't be discouraging them, no matter how 'small' we might view that issue or topic in the grand scheme of things.  \n  \nProgress is progress.",
              "timestamp": "2022-09-20 08:31:18",
              "score": 5,
              "num_children": 1,
              "author": 381362,
              "replies": [
                {
                  "id": "ip7p8c7",
                  "text": ">Attack from ALL angles. Period.\n\nThat's the republican tactic to get shit done. Unless the left starts to use it too it will always be a losing battle.",
                  "timestamp": "2022-09-20 16:37:55",
                  "score": 1,
                  "num_children": 0,
                  "author": 42367,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip5lwe0",
              "text": "Who cares if they scream about the IRS coming for jesus? Do we really give a crap about what they say? You're damned whether you do or don't might as well do the right thing.\n\nAnd if they have a persecution fetish, that's just your cue to actually persecute them. \"God is coming after you because you have been sinning, don't be fooled.\"",
              "timestamp": "2022-09-20 04:12:58",
              "score": 3,
              "num_children": 1,
              "author": 394796,
              "replies": [
                {
                  "id": "ip6smav",
                  "text": "Well, to be fair, Jesus does seem to spend quite a bit of time in jail.  So many people find him in there.😂",
                  "timestamp": "2022-09-20 12:56:36",
                  "score": 1,
                  "num_children": 0,
                  "author": 389136,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip52mvm",
              "text": "I would like to add to your valid talking points, I'll play Devil's Advocate here for a moment and contribute this.\n\nLet's say that yes, they lose their tax exempt status.  There is nothing stopping them from dissolving the church in its current form and then starting up a new one under a different name.\n\nWhat was once the Church of the Blathering Hypocrite has now risen three days later after an unholy amount of paperwork filing done by highly paid lawyers with the relevant government agencies.\n\nThanks to the interns at the law firm pulling three 18 hour days, the task was accomplished and the lawyers were paid enormous sums for the interns valiant efforts.\n\nThey would probably lease the same building at a bargain from the former church turned LLC for $1 a year and \"donate\" its assets and holdings to the new church for a sweet tax write-off.  The difference from the going market rate for the property lease and the $1 paid could be taken as a tax write-off or donated to a Super PAC that is controlled by the church.\n\nhttps://www.youtube.com/watch?v=ijxvjL7KJlk\n\nAs you know, Super PAC's can create their own nested Super PAC and that creates a legal black hole in which money can disappear.\n\nTo quote Dana Carvey's Church Lady character, \"How convenient!\"\n\nPlease don't tell me misusing tax free church funds can't be done, the [Mormons have more than $100 Billion](https://www.sltrib.com/religion/2020/01/21/commentary-billion-lds/) and climbing in liquid capitol and they're using it to invest in movies, tech stocks and real estate.\n\nWhen the Salt Lake Tribune publishes a story like that, you know it's gotta be true.\n\nA year after the story broke...\n\nhttps://markets.businessinsider.com/news/stocks/mormon-church-100-billion-fund-gamestop-stock-gain-tesla-stake-2021-5-1030442617\n\nWhere can I get a 900% gain on an investment?  The holy rollers are on a roll!\n\nNow we have the New Reformed Church of the Unholy Profits that takes it's place.  Tune in next week kiddies, same batshit insane channel, same batshit insane time (I enjoy sleeping in late in Sunday's).\n\nThe same batshit insane congregants would attend, the only thing that has changed is the name and a \"new\" church appears on the scene with a clean slate in the eyes of the law.\n\nCorporations pull this shit *all the time*.\n\nWhen the stench of Comcast or the Blackwater mercenaries gets to be too much to bear, let's change the name to Xfinity and Xe respectively, now all their prior sins are brainwashed away in the minds of the public.\n\nAfter all, you can see that the Devil's in the details and the paperwork filings.  There is more than one way to do the Devil's bidding and religious organizations are experts in accomplishing it.\n\nI yield the rest of my time back to you, the honorable powercow.\n\nP.S. Any relation to [Devin Nunes’ cow](https://twitter.com/DevinCow)?",
              "timestamp": "2022-09-20 01:27:49",
              "score": 23,
              "num_children": 3,
              "author": 64196,
              "replies": [
                {
                  "id": "ip54aei",
                  "text": "Thanks, I hate it.",
                  "timestamp": "2022-09-20 01:40:39",
                  "score": 11,
                  "num_children": 1,
                  "author": 141949,
                  "replies": [
                    {
                      "id": "ip54s6o",
                      "text": "You and me both.",
                      "timestamp": "2022-09-20 01:44:24",
                      "score": 3,
                      "num_children": 0,
                      "author": 64196,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ip561t0",
                  "text": "The fix would be for the IRS to not grant automatic tax exemption status for churches.  They should have to apply like everyone else and open up their books.  Presumably their tax exempt status could be denied if they have to apply because they're the same exact organization, but who am I kidding?  They'd never do that.",
                  "timestamp": "2022-09-20 01:54:03",
                  "score": 8,
                  "num_children": 1,
                  "author": 253251,
                  "replies": [
                    {
                      "id": "ip56t08",
                      "text": "Please keep in mind that the IRS was not created to fix things.",
                      "timestamp": "2022-09-20 01:59:49",
                      "score": 4,
                      "num_children": 1,
                      "author": 64196,
                      "replies": [
                        {
                          "id": "ip7b5nb",
                          "text": "It sure fixed that whole \"how do we collect income taxes from those that need that money the most\" thing.",
                          "timestamp": "2022-09-20 15:08:09",
                          "score": 1,
                          "num_children": 0,
                          "author": 325013,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ip5eg0g",
                  "text": "Then we do it again.",
                  "timestamp": "2022-09-20 03:01:38",
                  "score": 1,
                  "num_children": 1,
                  "author": 171109,
                  "replies": [
                    {
                      "id": "ip5haob",
                      "text": "They would play the persecution card at a much higher volume than they currently are and the actions of the government would be warped and spun from *complying with the written law* into a case held in the court of public opinion that \"they are discriminating against us\"!\n\nQue camera two and the crocodile tears in 3-- 2-- 1-- *now* while their website address and instructions on how to donate to their cause in on a crawler at the bottom of the screen.\n\nDonations by MasterCard & Visa gladly accepted!",
                      "timestamp": "2022-09-20 03:27:14",
                      "score": 1,
                      "num_children": 1,
                      "author": 64196,
                      "replies": [
                        {
                          "id": "ip6tpn8",
                          "text": "I've found that the people who scream the loudest about being persecuted for \"being a Christian\" are the ones who act the least like they are one.\nIf someone tells me what a good Christian they are, I immediately don't trust them and I don't support businesses that profess to be Christian run.\nThat being said, I know some deeply religious folks who I would consider to be good Christians, they just don't feel the need to brag and they quietly go about their good deeds.",
                          "timestamp": "2022-09-20 13:05:17",
                          "score": 1,
                          "num_children": 0,
                          "author": 389136,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ip5dx76",
              "text": "Your part of the problem. You have to do every single thing and push it to its limit. Fill out the forms and then if nothing is done file a foia request to find out why. Then act on that and keep pushing every fucking button until they take every fucking one of their tax exemptions. Fuck them",
              "timestamp": "2022-09-20 02:57:28",
              "score": 3,
              "num_children": 0,
              "author": 321917,
              "replies": []
            },
            {
              "id": "ip5gmts",
              "text": "IRS is also underfunded so they don't have the resources to go after the big fish millionaires, billionaires tax evaders because they can tied up the IRS in long lawsuits. This is in spite of the fact that going after the whales yield more return on tax evaded dollars than going after the small fries.\n\nThe gop has been starving the IRS to protect the rich for a long time.",
              "timestamp": "2022-09-20 03:21:10",
              "score": 2,
              "num_children": 1,
              "author": 284461,
              "replies": [
                {
                  "id": "ip6hh0d",
                  "text": "But Biden just gave it a boost & they have been instructed only to audit the big fish",
                  "timestamp": "2022-09-20 11:12:12",
                  "score": 1,
                  "num_children": 0,
                  "author": 389388,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip6gz9d",
              "text": "So what happens when the ACLU or NAACP loses their tax exempt status for the same rules?",
              "timestamp": "2022-09-20 11:06:32",
              "score": 1,
              "num_children": 0,
              "replies": []
            },
            {
              "id": "ip6jxba",
              "text": "Yeah, losing tax exemption would be a huge boon for their persecution complex.",
              "timestamp": "2022-09-20 11:38:00",
              "score": 1,
              "num_children": 0,
              "author": 343879,
              "replies": []
            },
            {
              "id": "ip6m2bj",
              "text": "I kinda wish there was some supranational option...",
              "timestamp": "2022-09-20 11:58:52",
              "score": 1,
              "num_children": 0,
              "author": 407907,
              "replies": []
            },
            {
              "id": "ip7ahgp",
              "text": "> It doesnt really change anything. The bongs still get sold and still get filled with cannabis. Its a meaningless reg.   \n\n>Yeah things would be worse without the johnson amendment  \n\nYou don't get to say both these things.",
              "timestamp": "2022-09-20 15:03:43",
              "score": 1,
              "num_children": 0,
              "author": 325013,
              "replies": []
            },
            {
              "id": "ippkw6p",
              "text": ">you can report it, cant force the government to follow through and honor the law. \n\nThese statements by this pastor don't violate the law.",
              "timestamp": "2022-09-24 12:33:32",
              "score": 1,
              "num_children": 0,
              "author": 53061,
              "replies": []
            }
          ]
        },
        {
          "id": "ip52epp",
          "text": "You can report all you like, but no church has lost tax-exempt status for making political statements since the Clinton years. Under W. Bush, Obama, Trump, and Biden the Johnson amendment has been enforced against churches a total of zero times.",
          "timestamp": "2022-09-20 01:26:01",
          "score": 19,
          "num_children": 3,
          "author": 211979,
          "replies": [
            {
              "id": "ip5b0cr",
              "text": "Not according to those angry pastors who are tweeting about losing their tax status or closing their church up. \n\nThere's no official list but would love to see one!",
              "timestamp": "2022-09-20 02:33:14",
              "score": 11,
              "num_children": 1,
              "author": 104429,
              "replies": [
                {
                  "id": "ip5btm3",
                  "text": "There may be some people on twitter lying -- or just confused -- about a church losing it's 501(c)3 status. But the IRS makes all of the 501(c)3 statuses it revokes public here: https://www.irs.gov/charities-non-profits/charitable-organizations/revocations-of-501c3-determinations\n\nNone of the 501(c)3 revocations, as far as I can tell are of churches losing their status due to the Johnson Amendment.",
                  "timestamp": "2022-09-20 02:39:51",
                  "score": 7,
                  "num_children": 0,
                  "author": 211979,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip5blo8",
              "text": "A few months back, I saw a post about a pastor who told his congregation that Democrats are “baby butchers”, and insisted they not vote for them. I thought his church lost its tax exempt status, but he apparently gave it up pending an IRS investigation. The video of his rant is included in this link:\n\n[https://www.newsweek.com/pastor-greg-locke-claims-he-gave-tax-exempt-status-church-1709615](https://www.newsweek.com/pastor-greg-locke-claims-he-gave-tax-exempt-status-church-1709615)\n\nI think there were enough complaints to the IRS that started the investigation. It’s certainly worth a try.\n\nedit: spelling error",
              "timestamp": "2022-09-20 02:38:02",
              "score": 9,
              "num_children": 1,
              "author": 272385,
              "replies": [
                {
                  "id": "ip5d7hv",
                  "text": "Well, he claims he gave it up. I'm not sure how you would even go about that, given IRS policy that churches automatically have 501c3 status.\n\nIn any case, the Johnson amendment, so far as churches, is at this point basically a theoretical principle that people either get excited or upset about, but not a piece of law that anybody is enforcing.",
                  "timestamp": "2022-09-20 02:51:28",
                  "score": 4,
                  "num_children": 0,
                  "author": 211979,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip5b2kv",
              "text": "[deleted]",
              "timestamp": "2022-09-20 02:33:44",
              "score": -1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ip5doxv",
                  "text": "An additional difficulty would be establishing whether his political statements are statements of the Southern Baptist Convention itself, or just his personal statements. I'm not sure how a court would distinguish the two, but I doubt they would rule that if you lead a 501c3 organization you automatically lose the right to discuss politics as an individual on your own time.",
                  "timestamp": "2022-09-20 02:55:32",
                  "score": 1,
                  "num_children": 0,
                  "author": 211979,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ip5bafh",
          "text": "I'm more interested in finding out who this guy has raped. That is the rapiest face I've ever seen.",
          "timestamp": "2022-09-20 02:35:31",
          "score": 3,
          "num_children": 1,
          "author": 21804,
          "replies": [
            {
              "id": "ip5bgfd",
              "text": "I thought it was Rodney Dangerfield (spelling???) at first.",
              "timestamp": "2022-09-20 02:36:52",
              "score": 1,
              "num_children": 0,
              "author": 92189,
              "replies": []
            }
          ]
        },
        {
          "id": "ip5bpe0",
          "text": "The IRS doesn't make a habit of pulling church tax exempt status. The political backlash would be enormous and just isn't worth it to them. It doesn't matter that churches are breaking the law, it simply won't be enforced no matter how many reports are made.",
          "timestamp": "2022-09-20 02:38:53",
          "score": 1,
          "num_children": 0,
          "author": 120477,
          "replies": []
        },
        {
          "id": "ip5d254",
          "text": "Yes and Trump claimed he got rid of the Johnson Amendment but in reality it is still on the books but unenforced:  https://www.washingtonpost.com/politics/2019/05/09/president-trumps-shifting-claim-that-we-got-rid-johnson-amendment/",
          "timestamp": "2022-09-20 02:50:15",
          "score": 1,
          "num_children": 0,
          "author": 404189,
          "replies": []
        },
        {
          "id": "ip5ecp2",
          "text": "Same guys who have a list of 800 people committing sex crimes. Biden signed the bill eliminating civil statutes of victims. They are scared...",
          "timestamp": "2022-09-20 03:00:53",
          "score": 1,
          "num_children": 0,
          "author": 323643,
          "replies": []
        },
        {
          "id": "ip5o9lv",
          "text": "We shouldn't have to report them it's openly public knowledge. You found it in Reddit! The IRS can arm it's agents but can't get a reliable internet connection? Unless they are staring into the void pretending like shit don't happen then they already know shits going down.",
          "timestamp": "2022-09-20 04:38:57",
          "score": 1,
          "num_children": 0,
          "author": 158501,
          "replies": []
        },
        {
          "id": "ippizxd",
          "text": ">Isn’t there a way to report these types?\n\nThere is, but it doesn't matter, since this activity doesn't violate the law.",
          "timestamp": "2022-09-24 12:13:29",
          "score": 1,
          "num_children": 0,
          "author": 53061,
          "replies": []
        },
        {
          "id": "ip58zrw",
          "text": "It might help if he actually said “vote Republican or your a bad Christian”. \n\nYes, I realize the implication.  I realize the message.  But getting the government to go after Christians need to vote according to their faith, is probably never going to happen.",
          "timestamp": "2022-09-20 02:17:10",
          "score": 0,
          "num_children": 0,
          "author": 70370,
          "replies": []
        },
        {
          "id": "ip5bfq0",
          "text": "Sure is, won't do a god damned thing tho lol.",
          "timestamp": "2022-09-20 02:36:42",
          "score": 0,
          "num_children": 1,
          "author": 98174,
          "replies": [
            {
              "id": "ip5biw2",
              "text": "God’s not real.",
              "timestamp": "2022-09-20 02:37:24",
              "score": -1,
              "num_children": 1,
              "author": 92189,
              "replies": [
                {
                  "id": "ip5e5yk",
                  "text": "Still fun to say.",
                  "timestamp": "2022-09-20 02:59:26",
                  "score": 1,
                  "num_children": 0,
                  "author": 98174,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip42fea",
      "text": "Cursed is anyone who withholds justice from the foreigner, the fatherless or the widow.’ Then all the people shall say, ‘Amen!’\nDeuteronomy 27:19",
      "timestamp": "2022-09-19 20:54:30",
      "score": 638,
      "num_children": 8,
      "author": 72063,
      "replies": [
        {
          "id": "ip42lpb",
          "text": "That's the Old Testament. That doesn't count. Except when it does.",
          "timestamp": "2022-09-19 20:55:41",
          "score": 350,
          "num_children": 10,
          "author": 286151,
          "replies": [
            {
              "id": "ip4nej9",
              "text": "Sue them for their religious non-profit status.",
              "timestamp": "2022-09-19 23:28:44",
              "score": 51,
              "num_children": 0,
              "author": 279559,
              "replies": []
            },
            {
              "id": "ip4khxl",
              "text": "Only when it tells you that gays are icky or that the world is only 6000 years old.",
              "timestamp": "2022-09-19 23:05:51",
              "score": 130,
              "num_children": 0,
              "author": 178472,
              "replies": []
            },
            {
              "id": "ip50tx8",
              "text": "Are you suggesting God changed it's mind?  Shouldn't there only by one testament, because God isn't a dipshit that makes mistakes?",
              "timestamp": "2022-09-20 01:13:45",
              "score": 24,
              "num_children": 4,
              "author": 408349,
              "replies": [
                {
                  "id": "ip588wg",
                  "text": "[deleted]",
                  "timestamp": "2022-09-20 02:11:11",
                  "score": 21,
                  "num_children": 0,
                  "replies": []
                },
                {
                  "id": "ip57g9y",
                  "text": "No, you see, his chosen people are idiots so he had to create a second volume to get them back on track.  Just ignore the differences and pretend it's all from the same dude.",
                  "timestamp": "2022-09-20 02:04:46",
                  "score": 7,
                  "num_children": 0,
                  "author": 253251,
                  "replies": []
                },
                {
                  "id": "ip55qh0",
                  "text": "One of the first things Jesus says in the New Testament is, I'm paraphrasing here, \"that is the old law, it is now gone. God is extending his grace to the gentiles, and no one comes to my Father but through me\".\n\nAll of the above was prophesied in the Old Testament, along with Jesus birth and who he would be descended from (theoretically) so God's will maintains \"consistency\".",
                  "timestamp": "2022-09-20 01:51:39",
                  "score": -1,
                  "num_children": 2,
                  "author": 189362,
                  "replies": [
                    {
                      "id": "ip5ixsg",
                      "text": "The fun part is that that's only what it says if you want it to. Lots of scholars and lots of sects disagree very strongly on what he was saying there.",
                      "timestamp": "2022-09-20 03:42:54",
                      "score": 6,
                      "num_children": 0,
                      "author": 207927,
                      "replies": []
                    },
                    {
                      "id": "ip5bgcy",
                      "text": "[deleted]",
                      "timestamp": "2022-09-20 02:36:51",
                      "score": 1,
                      "num_children": 3,
                      "replies": [
                        {
                          "id": "ip5j7ff",
                          "text": "I’m no fan of religion, but I was raised in a Baptist church. What they said is true - Jesus (or some other Christ-like figure) was prophesied in the OT as the messiah. Jews even today still believe that the OT promises a messiah - they just don’t believe that messiah was Jesus. Instead, Jews believe this messiah is yet to come.\n\nTo Christians, Jesus represents the ending of the OT laws and the beginning of salvation through grace through Jesus Christ. This doesn’t mean Christians don’t believe in the OT - it means they don’t believe you have to follow the laws of the OT in order to go to heaven.\n\nOne example of prophetic scripture: “Therefore the Lord himself will give you a sign: The virgin will conceive and give birth to a son, and will call him Immanuel” (Isaiah 7:14).",
                          "timestamp": "2022-09-20 03:45:32",
                          "score": 5,
                          "num_children": 0,
                          "author": 90213,
                          "replies": []
                        },
                        {
                          "id": "ip61qy9",
                          "text": "Deuteronomy, Samuel, Malachi, Isaiah. Others as well. The first chapter of Matthew in the new testament is dedicated to \"proving\" the genealogy of Jesus, in that he was descended from both Jacob and King David of Israel as that was a major part of the prophecy of a new king of the Jews come to deliver his people. That's why that whole chapter is \"someone begat someone, who begat someone else, who begat....\" all the way from Abraham down to Jesus",
                          "timestamp": "2022-09-20 07:30:56",
                          "score": 3,
                          "num_children": 0,
                          "author": 189362,
                          "replies": []
                        },
                        {
                          "id": "ip5gr5r",
                          "text": "In the last book of the OT I think. Not sure though, I just know it was indeed mentioned in the Old Testament",
                          "timestamp": "2022-09-20 03:22:15",
                          "score": 1,
                          "num_children": 0,
                          "author": 324357,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ip7j5bm",
                  "text": "and then God comes out in the the Quran like, \"remember all that peace shit my son was preaching? yeah fuck that. MURDER THE UNBELIEVERS\"",
                  "timestamp": "2022-09-20 15:59:26",
                  "score": 1,
                  "num_children": 0,
                  "author": 97884,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip4wfr0",
              "text": "I'll have you know the Old Testament totally counts. My understanding is it's full of Numbers.",
              "timestamp": "2022-09-20 00:39:53",
              "score": 17,
              "num_children": 1,
              "author": 126829,
              "replies": [
                {
                  "id": "ip5am9a",
                  "text": "Common misconception, it's just the one chapter.",
                  "timestamp": "2022-09-20 02:30:07",
                  "score": 1,
                  "num_children": 1,
                  "author": 312482,
                  "replies": [
                    {
                      "id": "ip5p1ji",
                      "text": "Two books, actually. Numbers and Deuteronomy (or \"second Numbers\" as the Hobbits call it)",
                      "timestamp": "2022-09-20 04:47:47",
                      "score": 1,
                      "num_children": 0,
                      "author": 268205,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ip57rvk",
              "text": "> That's the ~~Old Testament~~ Bible. That doesn't count. Except when it does.\n\nFTFY",
              "timestamp": "2022-09-20 02:07:19",
              "score": 4,
              "num_children": 0,
              "author": 413232,
              "replies": []
            },
            {
              "id": "ip5jc01",
              "text": "“ For I was hungry and you gave me something to eat, I was thirsty and you gave me something to drink, I was a stranger and you invited me in,I needed clothes and you clothed me,I was sick and you looked after me, I was in prison and you came to visit me.’”\n-Matthew 25:35-40\n\nSee, the hypocrisy is in both testaments.",
              "timestamp": "2022-09-20 03:46:49",
              "score": 3,
              "num_children": 0,
              "author": 207056,
              "replies": []
            },
            {
              "id": "ip5oxxv",
              "text": "Then fucking show them Matthew 25:31-46.",
              "timestamp": "2022-09-20 04:46:40",
              "score": 3,
              "num_children": 0,
              "author": 268205,
              "replies": []
            },
            {
              "id": "ip4ys9a",
              "text": "That can be said for literally anything with these flushable wipes!!! Yes I agree with X when X works for me! Y is a sin except when I do Y! Duh!",
              "timestamp": "2022-09-20 00:57:56",
              "score": 4,
              "num_children": 1,
              "author": 319452,
              "replies": [
                {
                  "id": "ip588xi",
                  "text": "They're not flushable at all, believe me I've tried many times.",
                  "timestamp": "2022-09-20 02:11:11",
                  "score": 1,
                  "num_children": 0,
                  "author": 88413,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip5qvl3",
              "text": "It only counts when it’s used to justify homophobia and slavery. \n\nIt doesn’t count when it says don’t lie, commit adultery, steal, covet, et. al.",
              "timestamp": "2022-09-20 05:08:54",
              "score": 4,
              "num_children": 0,
              "author": 410556,
              "replies": []
            },
            {
              "id": "ip6295s",
              "text": "Here is one from the new testament that applies in a different way:\n\n\"No man can serve two masters: for either he will hate the one, and love the other; or else he will hold to the one, and despise the other, Ye cannot serve God and mammon.\"\n\nMatthew 6:24",
              "timestamp": "2022-09-20 07:38:21",
              "score": 2,
              "num_children": 0,
              "author": 16792,
              "replies": []
            }
          ]
        },
        {
          "id": "ip4qjby",
          "text": "The next verse has some strong words about stepmom porn.",
          "timestamp": "2022-09-19 23:53:21",
          "score": 15,
          "num_children": 0,
          "author": 112448,
          "replies": []
        },
        {
          "id": "ip4x5ki",
          "text": "Ramen!",
          "timestamp": "2022-09-20 00:45:19",
          "score": 4,
          "num_children": 0,
          "author": 402781,
          "replies": []
        },
        {
          "id": "ip4jxxo",
          "text": "“I’ll give those foreigners some justice all right.  Fists of justice.”\n\nhttps://images.app.goo.gl/tervQqw6WUEXe5cRA",
          "timestamp": "2022-09-19 23:01:36",
          "score": 8,
          "num_children": 1,
          "author": 274046,
          "replies": [
            {
              "id": "ip4t60s",
              "text": "Funny image but wtf is that link",
              "timestamp": "2022-09-20 00:14:21",
              "score": 3,
              "num_children": 0,
              "author": 150786,
              "replies": []
            }
          ]
        },
        {
          "id": "ip626qt",
          "text": "\"No man can serve two masters: for either he will hate the one, and love the other; or else he will hold to the one, and despise the other, Ye cannot serve God and mammon.\"\n\nMatthew 6:24",
          "timestamp": "2022-09-20 07:37:21",
          "score": 2,
          "num_children": 0,
          "author": 16792,
          "replies": []
        },
        {
          "id": "ip563rg",
          "text": "From the article:\n\n> “Here we have a sitting president of an sbc (Southern Baptist Convention) seminary who is emphatically saying to vote ‘wrongly’ matters to God,” tweeted prominent Texas Pastor Dwight McKissic. “Voting ‘wrongly’ to Mohler means voting Dem. God is not a Dem or Republican. To imply that voting exclusively Republican is God’s choice defies Jhn. 18:36”",
          "timestamp": "2022-09-20 01:54:27",
          "score": 1,
          "num_children": 0,
          "author": 147955,
          "replies": []
        },
        {
          "id": "ip5ekqe",
          "text": "Southern Baptist here with a question honestly meant in good faith: \n\nIf my pastor were to suggest that the biblical position on immigration aligns more closely with the democratic platform, and as such the best option for Christians would be to vote for democrats, would you still take issue with that and suggest that their tax exempt status be revoked? \n\nIf so, would you apply that same standard to every nonprofit? Why or why not?\n\nAgain, this is a question in good faith. It's not a Gotcha question I pull out of my back pocket because I think it will own the libs (or in this case, atheists). \n\nThanks for quoting scripture. I love it and I appreciate it when Christians are challenged to think about whether our practices align with scripture.",
          "timestamp": "2022-09-20 03:02:45",
          "score": 1,
          "num_children": 0,
          "author": 153673,
          "replies": []
        },
        {
          "id": "ip5533m",
          "text": "[deleted]",
          "timestamp": "2022-09-20 01:46:44",
          "score": -1,
          "num_children": 2,
          "replies": [
            {
              "id": "ip57kxv",
              "text": "Yes they do. The book of Deuteronomy is not in that list in your link. It’s part of the Pentateuch - the first 5 books of the Old Testament.",
              "timestamp": "2022-09-20 02:05:48",
              "score": 2,
              "num_children": 0,
              "author": 317942,
              "replies": []
            },
            {
              "id": "ip5fl3a",
              "text": "We absolutely do believe it is canon. You're mistaken.",
              "timestamp": "2022-09-20 03:11:43",
              "score": 1,
              "num_children": 0,
              "author": 153673,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip49u1k",
      "text": "Supply side Jesus strikes again!",
      "timestamp": "2022-09-19 21:46:12",
      "score": 108,
      "num_children": 1,
      "author": 363487,
      "replies": [
        {
          "id": "ip4j1p5",
          "text": "GOP Jesus: https://www.youtube.com/watch?v=SZ2L-R8NgrA\n\nI've introduced myself here as a \"gnostic theist\" and Igottatellya there are very few things that piss Him off more than these stamped-on-their-forehead gold-statue-worshipping \"christians\".\n\nProtip \"christians\": YOU DO NOT GET TO ANNOINT WHOEVER IS CONVENIENT TO YOUR MINISCULE WORLDVIEW... and yer gonna get what your false witnessing, stealing, and blaspheming butts deserve.",
          "timestamp": "2022-09-19 22:54:44",
          "score": 55,
          "num_children": 1,
          "author": 27713,
          "replies": [
            {
              "id": "ip54452",
              "text": "GOP Jesus was/is amazing. We need more of this kind of humor out there.",
              "timestamp": "2022-09-20 01:39:23",
              "score": 7,
              "num_children": 0,
              "author": 117628,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip4euyf",
      "text": "Let's just revoke tax exempt status from every church and call it a day.",
      "timestamp": "2022-09-19 22:22:50",
      "score": 441,
      "num_children": 9,
      "author": 148453,
      "replies": [
        {
          "id": "ip4sda3",
          "text": "What's next, actually enforcing separation of church and state?",
          "timestamp": "2022-09-20 00:07:59",
          "score": 203,
          "num_children": 2,
          "author": 262606,
          "replies": [
            {
              "id": "ip4w4el",
              "text": "I still dont get how some conservatives think separation of church and state is a liberal lie. “It’s freedom of religion not freedom from religion.” They can fuck right off.",
              "timestamp": "2022-09-20 00:37:23",
              "score": 93,
              "num_children": 5,
              "author": 320220,
              "replies": [
                {
                  "id": "ip52vb0",
                  "text": "The idea is that since religion doesn't get a say in politics, they shouldn't be taxed because they have no representation. In theory it makes sense, in practice it means people can rake in tax free money while proselytizing about the govt they want.",
                  "timestamp": "2022-09-20 01:29:37",
                  "score": 29,
                  "num_children": 8,
                  "author": 395705,
                  "replies": [
                    {
                      "id": "ip54ny5",
                      "text": "I think you misunderstood. There are literally conservatives who believe there’s no such thing as separation of church and state. Meaning they believe religion does get a say and should br forefront in politics. That’s not just how they believe it should be, they believe that’s the way it is.",
                      "timestamp": "2022-09-20 01:43:30",
                      "score": 23,
                      "num_children": 2,
                      "author": 320220,
                      "replies": [
                        {
                          "id": "ip55zas",
                          "text": "Oh, I agree, I was just stating that the real purpose of the separation was to stop involvement in politics.",
                          "timestamp": "2022-09-20 01:53:32",
                          "score": 9,
                          "num_children": 0,
                          "author": 395705,
                          "replies": []
                        },
                        {
                          "id": "ip56wsq",
                          "text": "Spot on!\nThe dominionists of the Betsy DeVos and Mike Pence types \nIt’s scary stuff",
                          "timestamp": "2022-09-20 02:00:36",
                          "score": 3,
                          "num_children": 0,
                          "author": 408820,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ip5918m",
                      "text": "my hockey club does not have a say in politics. Can we lower league fees and stop paying taxes at the rink?",
                      "timestamp": "2022-09-20 02:17:30",
                      "score": 11,
                      "num_children": 1,
                      "author": 288740,
                      "replies": [
                        {
                          "id": "ip5c7du",
                          "text": "Assuming you can get 30 other followers to report it on the census, yes.",
                          "timestamp": "2022-09-20 02:42:59",
                          "score": 3,
                          "num_children": 0,
                          "author": 262606,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ip5d2yl",
                      "text": "Religion shouldn't be a representable group.  Fuck this no holds bar free speech shit.  No public religion.  You can do what you want in your own basement but fuck being on TV, and politicians shouldn't be able to utter a word about it unless its about its regulation.  \n\nIf it were any other work of fiction wed lock them up in an mental hospital.",
                      "timestamp": "2022-09-20 02:50:26",
                      "score": 10,
                      "num_children": 0,
                      "author": 222377,
                      "replies": []
                    },
                    {
                      "id": "ip579sa",
                      "text": "The policy is ripe for abuse. The Kardashians have a tax shell \"membership only church\"",
                      "timestamp": "2022-09-20 02:03:23",
                      "score": 4,
                      "num_children": 0,
                      "author": 301563,
                      "replies": []
                    },
                    {
                      "id": "ip5iwe3",
                      "text": "But every single member of that religion DOES get a say in politics - and when they gather and do this whole group brainwashing session...  \n  \n*Tax the fucking church.*",
                      "timestamp": "2022-09-20 03:42:31",
                      "score": 3,
                      "num_children": 0,
                      "author": 106687,
                      "replies": []
                    },
                    {
                      "id": "ip53h4q",
                      "text": "> people can rake in tax free money \n\nEveryone who takes a salary from the church pays income tax.",
                      "timestamp": "2022-09-20 01:34:26",
                      "score": -1,
                      "num_children": 1,
                      "author": 74229,
                      "replies": [
                        {
                          "id": "ip5442m",
                          "text": "See so do people employed by other buisnesses, but for some reason buisnesses called \"churches\" dont while other kinds of buisnesses do.",
                          "timestamp": "2022-09-20 01:39:22",
                          "score": 4,
                          "num_children": 1,
                          "author": 185677,
                          "replies": [
                            {
                              "id": "ip55hef",
                              "text": "Other businesses are allowed to ~~buy politicians~~donate to political campaigns and help candidates who they want win. Churches can’t. Can you imagine if the Catholic church started using its billions of dollars to lobby? Abortions would be illegal everywhere.",
                              "timestamp": "2022-09-20 01:49:46",
                              "score": -2,
                              "num_children": 2,
                              "author": 74229,
                              "replies": [
                                {
                                  "id": "ip5770c",
                                  "text": ">Churches can’t. Can you imagine if the Catholic church started using its billions of dollars to lobby?\n\nThey've been busy spending money on lobbying to fight statute of linitation reform to get their priests off the hook in rape allegations:\n\nhttps://feeneylawfirm.com/catholic-church-spends-10m-to-fight-statute-of-limitations-reforms/\n\nThe sad truth is because Churches are not required to fill out [IRS form 990](https://www.irs.gov/charities-non-profits/form-990-resources-and-tools) like other nonprofits, their books are closed to the public and they're basically immune from IRS audits, they could easily be funneling money into super PACs to fund pro-abortion candidates and we'd never know.",
                                  "timestamp": "2022-09-20 02:02:46",
                                  "score": 7,
                                  "num_children": 0,
                                  "author": 253251,
                                  "replies": []
                                },
                                {
                                  "id": "ip5723o",
                                  "text": "The catholic funds in Kansas recently spent 9 miilion on ads",
                                  "timestamp": "2022-09-20 02:01:42",
                                  "score": 3,
                                  "num_children": 1,
                                  "author": 408820,
                                  "replies": [
                                    {
                                      "id": "ip578z6",
                                      "text": "Ads about abortion or ads about a particular political candidate? The former is their right, they’re allowed to preach what they view as morality.",
                                      "timestamp": "2022-09-20 02:03:12",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 74229,
                                      "replies": [
                                        {
                                          "id": "ip5872x",
                                          "text": "True, they lost very big though, lots of $$$ wasted but hey it’s a tax free right?",
                                          "timestamp": "2022-09-20 02:10:46",
                                          "score": 2,
                                          "num_children": 0,
                                          "author": 408820,
                                          "replies": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ippjo2a",
                      "text": ">The idea is that since religion doesn't get a say in politics, they shouldn't be taxed because they have no representation. \n\nThat's not the idea at all, but why don't you tell me what federal taxes churches would pay if they lost their federal tax exempt status? This will be good.",
                      "timestamp": "2022-09-24 12:20:42",
                      "score": 1,
                      "num_children": 0,
                      "author": 53061,
                      "replies": []
                    },
                    {
                      "id": "ip5m26r",
                      "text": "No, the idea is that taxes provide for the common good. Churches, historically, have been a force for providing for common good. Thus why tax them?",
                      "timestamp": "2022-09-20 04:14:40",
                      "score": -2,
                      "num_children": 0,
                      "author": 396828,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ip559k1",
                  "text": "The People should have freedom of religion, and our Republic should have freedom from religion.",
                  "timestamp": "2022-09-20 01:48:05",
                  "score": 4,
                  "num_children": 1,
                  "author": 68830,
                  "replies": [
                    {
                      "id": "ip55lpg",
                      "text": "We’re on the same page",
                      "timestamp": "2022-09-20 01:50:39",
                      "score": 1,
                      "num_children": 1,
                      "author": 320220,
                      "replies": [
                        {
                          "id": "ip55udp",
                          "text": "Democracy high-five … or fist bump … or whatever the ‘freedom from tyranny’ secret handshake is …",
                          "timestamp": "2022-09-20 01:52:29",
                          "score": 1,
                          "num_children": 1,
                          "author": 68830,
                          "replies": [
                            {
                              "id": "ip56s1u",
                              "text": "✊🏻",
                              "timestamp": "2022-09-20 01:59:36",
                              "score": 1,
                              "num_children": 0,
                              "author": 320220,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ip5crg6",
                  "text": "Because they believe the US is a theocracy that essentially guarantees freedom of religions primarily for other Christians, when the founding fathers specifically didn't want a theocratic form of government at all and specifically wishes to create a division between religious institutions and government. But religious conservatives have manipulated current events to make Christian conservatives feel like their religion is under attack simply because not everyone believes in it. Thus as a result of this, our democracy is unraveling in front of our eyes.",
                  "timestamp": "2022-09-20 02:47:44",
                  "score": 3,
                  "num_children": 0,
                  "author": 181215,
                  "replies": []
                },
                {
                  "id": "ip5goca",
                  "text": "I'm still wondering why I have to pay taxes to cover policing and fire coverage for the largest private club in town. They have their own air conditioned indoor basketball court and indoor heated pool, that's really only available to members... yet I'm left with the bill.\n\nOh right, they have a can drive once a year that collects enough food for the elderly I could literally just pay for it myself... but nah, it's cool they're occupying the most valuable piece of land in my town while contributing nothing.",
                  "timestamp": "2022-09-20 03:21:32",
                  "score": 1,
                  "num_children": 0,
                  "author": 207927,
                  "replies": []
                },
                {
                  "id": "ip58t4n",
                  "text": "Maybe because it's not a literal law? And the Johnson Amendment is about endorsing a specific candidate not a party",
                  "timestamp": "2022-09-20 02:15:45",
                  "score": -1,
                  "num_children": 1,
                  "author": 286177,
                  "replies": [
                    {
                      "id": "ip5c6a5",
                      "text": "Who’s saying it’s a law? It’s part of the bill of rights.",
                      "timestamp": "2022-09-20 02:42:43",
                      "score": 1,
                      "num_children": 1,
                      "author": 320220,
                      "replies": [
                        {
                          "id": "ip6pid7",
                          "text": "Except it's not anywhere in the bill of rights",
                          "timestamp": "2022-09-20 12:30:22",
                          "score": 1,
                          "num_children": 1,
                          "author": 286177,
                          "replies": [
                            {
                              "id": "ip6x1fx",
                              "text": "https://en.m.wikipedia.org/wiki/Establishment_Clause#:~:text=While%20the%20Establishment%20Clause%20does,of%20the%20Free%20Exercise%20Clause.",
                              "timestamp": "2022-09-20 13:30:34",
                              "score": 1,
                              "num_children": 1,
                              "author": 320220,
                              "replies": [
                                {
                                  "id": "ip7hzp9",
                                  "text": "Like I said, it's not in the Bill of rights\n\n\"The Establishment Clause is a limitation placed upon the United States Congress\"",
                                  "timestamp": "2022-09-20 15:52:04",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 286177,
                                  "replies": [
                                    {
                                      "id": "ip8olw5",
                                      "text": "What? It says it right there. It’s not explicitly called “separation of church and state” that’s effectively what it does. Are we ignoring anything and everything that isn’t in explicit writing?",
                                      "timestamp": "2022-09-20 20:23:06",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 320220,
                                      "replies": [
                                        {
                                          "id": "ipa3vvj",
                                          "text": "That's not the bill of rights...\n\nThe words Separation of Church and State is just something Thomas Jefferson said a long time ago, he didn't write it into law and it's not found in any U.S. laws.\n\nhttps://en.m.wikipedia.org/wiki/Separation_of_church_and_state_in_the_United_States",
                                          "timestamp": "2022-09-21 02:35:45",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 286177,
                                          "replies": [
                                            {
                                              "id": "ipbsnxs",
                                              "text": "Used to explain the establishment clause in the first amendment of the bill of rights. Separation of church and state is not in there verbatim. It’s a phrase used to explain the idea behind the establishment clause. Unless you just mean that the words aren’t explicit enough for you to accept then i dont know what else you could be meaning?",
                                              "timestamp": "2022-09-21 13:19:35",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 320220,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ip58pco",
              "text": "Separation of Church and State is not actually a law",
              "timestamp": "2022-09-20 02:14:57",
              "score": -4,
              "num_children": 1,
              "author": 286177,
              "replies": [
                {
                  "id": "ip5e5hf",
                  "text": "Separation of church and state is largely considered to be covered by the 1st amendment",
                  "timestamp": "2022-09-20 02:59:19",
                  "score": 2,
                  "num_children": 1,
                  "author": 28578,
                  "replies": [
                    {
                      "id": "ip6pm7k",
                      "text": "1st Amendment says congress cannot make laws prohibiting the freedom to practice religion, it is not a restriction on religions, they can participate in politics as much as they want",
                      "timestamp": "2022-09-20 12:31:20",
                      "score": -1,
                      "num_children": 1,
                      "author": 286177,
                      "replies": [
                        {
                          "id": "ip6vc27",
                          "text": "https://en.m.wikipedia.org/wiki/Establishment_Clause",
                          "timestamp": "2022-09-20 13:17:51",
                          "score": 1,
                          "num_children": 1,
                          "author": 28578,
                          "replies": [
                            {
                              "id": "ip7hzze",
                              "text": "\"The Establishment Clause is a limitation placed upon the United States Congress\"\n\nThat's what I said above",
                              "timestamp": "2022-09-20 15:52:07",
                              "score": 1,
                              "num_children": 1,
                              "author": 286177,
                              "replies": [
                                {
                                  "id": "ip8cvdn",
                                  "text": "\"The Establishment Clause acts as a double security, prohibiting both religious abuse of government and political control of religion.\"\n\nYou can weasel around the wording as much as you want, but both the intent from the founders when they wrote it, and the way it's been interpreted for the entirety of the US's life, has been that religious institutions aren't allowed to participate in politics. The only way you can honestly argue otherwise is if you're something like a nationalist christian, where your goal is to intentionally misinterpret the law in whatever way is most effective at trying to turn the US into a theocracy",
                                  "timestamp": "2022-09-20 19:08:19",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 28578,
                                  "replies": [
                                    {
                                      "id": "ipa40wn",
                                      "text": "Yes they are, the words Separation of Church and State is just something Thomas Jefferson said a long time ago, he never put it in any U.S. laws, or else you probably would have found it by now and put it in a quote",
                                      "timestamp": "2022-09-21 02:36:47",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 286177,
                                      "replies": [
                                        {
                                          "id": "ipa50z3",
                                          "text": "🤦‍♂️ bud the exact words \"separation of church and state\" are just used as a simple explanation for what the Establishment Clause was created by the founders to do. Bashing your head against a point no one is making, while avoiding the elephant in the room, isn't a winning argument. You're treading into willfully stupid territory now",
                                          "timestamp": "2022-09-21 02:44:31",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 28578,
                                          "replies": [
                                            {
                                              "id": "ipa5yk3",
                                              "text": "You can use them to explain it, but you can't say that there is any law that mentions a separation of church and state, it is perfectly legal for churches to get involved in politics, that is why many are doing exactly that without any consequences",
                                              "timestamp": "2022-09-21 02:51:48",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 286177,
                                              "replies": [
                                                {
                                                  "id": "ipa7df2",
                                                  "text": "*I* don't have to say anything. The founding fathers and the government of the United States of America since its inception do all the talking for me. In the Establishment Clause.\n\nBased off your repeated attempts at arguing for revisionism and your seemingly exclusively religious comment history, I'm getting much closer to assuming you're a nationalist christian. In which case your opinion on law is basically worthless. Later, I'm not wasting more of my time on your disingenuous claims",
                                                  "timestamp": "2022-09-21 03:03:11",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 28578,
                                                  "replies": [
                                                    {
                                                      "id": "ipa7wlc",
                                                      "text": "The Establishment clause makes no restrictions on churches, go read the 1st Amendment, it only makes it illegal for the government to meddle in religious affairs, it makes no prohibitions for religions, it is not a law for churches, it is a law made only for congress not to be able to mess with our religious freedoms.",
                                                      "timestamp": "2022-09-21 03:07:24",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "author": 286177,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ip502az",
          "text": "The religious persecution cries would explode, and it would be glorious.\n\nI just worry it might make MORE of those ultra religious folks vote.",
          "timestamp": "2022-09-20 01:07:50",
          "score": 14,
          "num_children": 2,
          "author": 258248,
          "replies": [
            {
              "id": "ip55n0e",
              "text": "Now I am by no means well versed in the Bible despite being a Christian myself. But doesn't Jesus have a few reservations towards organized worship in a church? I feel like the versus that talk about praying in secret and not making a show of your belief are relevant here.",
              "timestamp": "2022-09-20 01:50:55",
              "score": 3,
              "num_children": 2,
              "author": 268240,
              "replies": [
                {
                  "id": "ip5b9x7",
                  "text": "Well, there’s a little more to it. His remarks were highlighting the penchant of Pharisees intentionally making a big public show of being faithful while also living antithetical lives. The church itself is the people. Hebrews 10:25 encourages assembly. It’s just unfortunate the Republican leaning reich-wing are Pharisees reborn & fucking it up for the rest.",
                  "timestamp": "2022-09-20 02:35:23",
                  "score": 2,
                  "num_children": 0,
                  "author": 222122,
                  "replies": []
                },
                {
                  "id": "ip5htgj",
                  "text": "A two-second look at your comment history shows you happily insulting others. \n\nYou might need to rethink your life, if you want to follow Jesus.",
                  "timestamp": "2022-09-20 03:32:05",
                  "score": 0,
                  "num_children": 1,
                  "author": 207927,
                  "replies": [
                    {
                      "id": "ip5n85e",
                      "text": "Never said I was good Christian, asswipe",
                      "timestamp": "2022-09-20 04:27:09",
                      "score": 0,
                      "num_children": 0,
                      "author": 268240,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ippjri6",
              "text": ">The religious persecution cries would explode, and it would be glorious.\n\nWould it? What federal taxes would they pay if they lost their tax exempt status?",
              "timestamp": "2022-09-24 12:21:42",
              "score": 1,
              "num_children": 0,
              "author": 53061,
              "replies": []
            }
          ]
        },
        {
          "id": "ip51gj5",
          "text": "How many churches would pack it in? I bet a whole lot.",
          "timestamp": "2022-09-20 01:18:40",
          "score": 2,
          "num_children": 2,
          "author": 94245,
          "replies": [
            {
              "id": "ip55zwf",
              "text": "One would hope",
              "timestamp": "2022-09-20 01:53:39",
              "score": 1,
              "num_children": 0,
              "author": 148453,
              "replies": []
            },
            {
              "id": "ippjuyb",
              "text": ">How many churches would pack it in? I bet a whole lot.\n\nI bet zero and I also bet you don't know what you're talking about. What federal taxes would they pay if they lost their federal tax exempt status?",
              "timestamp": "2022-09-24 12:22:43",
              "score": 1,
              "num_children": 1,
              "author": 53061,
              "replies": [
                {
                  "id": "ipq4g8l",
                  "text": "The federal taxes they would now owe.",
                  "timestamp": "2022-09-24 15:18:37",
                  "score": 1,
                  "num_children": 1,
                  "author": 94245,
                  "replies": [
                    {
                      "id": "ipyzmm6",
                      "text": ">The federal taxes they would now owe.\n\nUh huh. Which would be what? What would they owe?\n\nHint: Zero.",
                      "timestamp": "2022-09-26 14:03:19",
                      "score": 1,
                      "num_children": 1,
                      "author": 53061,
                      "replies": [
                        {
                          "id": "ipz4rlj",
                          "text": "Hey educate me. If they weren't exempt anymore they would then now owe those taxes.",
                          "timestamp": "2022-09-26 14:39:44",
                          "score": 1,
                          "num_children": 0,
                          "author": 94245,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ip4thtg",
          "text": "Idk I grew up in a Church that embodied the message of charity. I became an atheist but a lot Lutherans do good work. A more nuanced stance is needed. Mission work and Bible study should probably not be counted as exempt the rest yes.",
          "timestamp": "2022-09-20 00:16:53",
          "score": -2,
          "num_children": 5,
          "author": 150786,
          "replies": [
            {
              "id": "ip4v9qw",
              "text": "Charities are exempt because they’re charities; churches aren’t charities, even if some do charity things, but it really isn’t that hard to become exempt again if they’re truly charities",
              "timestamp": "2022-09-20 00:30:42",
              "score": 19,
              "num_children": 1,
              "author": 7974,
              "replies": [
                {
                  "id": "ip50snx",
                  "text": "Even now the IRS seldom enforces the current laws regarding what applies and what does not. Many churches have businesses that are in competition with other private businesses. For profit day care, stores, and what amount to country clubs and entertainment venues. Those for-profit business are supposed to not be tax exempt but only in the most clear cases like rental properties after complaints from people like the FFRF will the IRS do anything. As in many other instances selective enforcement is government corruption.",
                  "timestamp": "2022-09-20 01:13:29",
                  "score": 8,
                  "num_children": 0,
                  "author": 216202,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip4u91z",
              "text": "My father was a pastor in such a church. We had out of luck street people living in our house quite often. It didn't change my opinion on the validity of religion, but my Dad walked the walk when it came to charity for the less fortunate. This was, however, not in the United States... where evangelical Christianity has been perverted into some sort of bizarre I've got mine fuck you Go Go Sports Team religion.",
              "timestamp": "2022-09-20 00:22:41",
              "score": 9,
              "num_children": 0,
              "author": 33044,
              "replies": []
            },
            {
              "id": "ip4wfx3",
              "text": "How about this. Every religious organization losses tax exempt status. Then, they can reapply and prove their worthiness of being classified tax exempt.",
              "timestamp": "2022-09-20 00:39:55",
              "score": 8,
              "num_children": 0,
              "author": 229373,
              "replies": []
            },
            {
              "id": "ip58b5t",
              "text": "my gay men’s chorus rehearses at a lutheran church and they’re always very kind to us",
              "timestamp": "2022-09-20 02:11:42",
              "score": 1,
              "num_children": 0,
              "author": 263215,
              "replies": []
            },
            {
              "id": "ip5h16a",
              "text": "My Lutheran church prays for both sides to work together and solve the problems best they can. Prayed for Biden, Trump, Obama, Bush. I’m sure the congregation is like 80% conservative, but they still all say those people out loud during group prayers.",
              "timestamp": "2022-09-20 03:24:49",
              "score": -3,
              "num_children": 0,
              "author": 283388,
              "replies": []
            }
          ]
        },
        {
          "id": "ip581nb",
          "text": "At least tax brackets. I'm fine with the little 300 person church that uses 80% of their money for charity. The 1000+ seat arenas that spend millions on just AV, they need to be taxed and strict rules and oversight on charity.",
          "timestamp": "2022-09-20 02:09:32",
          "score": 1,
          "num_children": 0,
          "author": 150727,
          "replies": []
        },
        {
          "id": "ip780gn",
          "text": "If they're charitable they can file as a nonprofit.",
          "timestamp": "2022-09-20 14:47:21",
          "score": 1,
          "num_children": 0,
          "author": 238932,
          "replies": []
        },
        {
          "id": "ip5cc8v",
          "text": "It will never happen. You would have to specifically exclude them, as they would qualify for every other reason.",
          "timestamp": "2022-09-20 02:44:09",
          "score": 0,
          "num_children": 0,
          "author": 228840,
          "replies": []
        },
        {
          "id": "ip7lqxo",
          "text": "So you want to give churches the ability to do this legally?",
          "timestamp": "2022-09-20 16:16:04",
          "score": 0,
          "num_children": 1,
          "author": 118641,
          "replies": [
            {
              "id": "ip7lzyk",
              "text": "I want churches be completely eradicated from the face of the earth. Making them pay taxes in the mean time is just a stepping stone.",
              "timestamp": "2022-09-20 16:17:41",
              "score": 1,
              "num_children": 0,
              "author": 148453,
              "replies": []
            }
          ]
        },
        {
          "id": "ippje1f",
          "text": ">Let's just revoke tax exempt status from every church and call it a day.\n\n1. What federal taxes would they pay if we did this?\n\n2. Would you also do the same to secular nonprofits and charities?\n\nIn your answers to these questions, you will reveal that you, like all people who say this, do not understand the law or the tax code.\n\nEdit because of course he did:\n>Tax them at the corporate rate. Same goes for secular nonprofits and charities that engage in political actions.\n\nGreat, they'd pay ZERO. As I said you don't understand the tax code.\n\n>In my answers to these questions, I have revealed that you're a pompous ass and that I do in fact understand the law and the tax code.\n\nOn the contrary, you've revealed exactly what I said.\n\n>You've commented a dozen times that the pastors statement's don't violate the law without citing any reasoning or laws that would support what you claim.\n\nRead the IRS publications regarding political activities by nonprofits. Then get back to me when you are capable of hearing truth.",
          "timestamp": "2022-09-24 12:17:44",
          "score": 0,
          "num_children": 1,
          "author": 53061,
          "replies": [
            {
              "id": "ippp2qt",
              "text": "Tax them at the corporate rate. Same goes for secular nonprofits and charities that engage in political actions.\n\nIn my answers to these questions, I have revealed that you're a pompous ass and that I do in fact understand the law and the tax code.\n\nYou've commented a dozen times that the pastors statement's don't violate the law without citing any reasoning or laws that would support what you claim. \n\nGet better at trolling or find something else to waste your time on.",
              "timestamp": "2022-09-24 13:13:45",
              "score": 1,
              "num_children": 0,
              "author": 148453,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip4a2sh",
      "text": "If unfaithful = not paying raging lunatics to strip freedom from the people then fuckit let’s be unfaithful.",
      "timestamp": "2022-09-19 21:47:58",
      "score": 35,
      "num_children": 0,
      "author": 152676,
      "replies": []
    },
    {
      "id": "ip44vd3",
      "text": "Christians who do not help their fellow man and instead ship them off to someone while lying about where they are sending them are unfaithful",
      "timestamp": "2022-09-19 21:11:13",
      "score": 140,
      "num_children": 2,
      "author": 279124,
      "replies": [
        {
          "id": "ip4u0hn",
          "text": "It is called kidnapping. Everyone involved in those people being lied to, manipulated, and sent over state lines should be arrested on kidnapping charges.",
          "timestamp": "2022-09-20 00:20:52",
          "score": 43,
          "num_children": 1,
          "author": 365566,
          "replies": [
            {
              "id": "ip4vzt9",
              "text": "They transported people across state lines; that's human trafficking.",
              "timestamp": "2022-09-20 00:36:24",
              "score": 25,
              "num_children": 0,
              "author": 229997,
              "replies": []
            }
          ]
        },
        {
          "id": "ip4x9yd",
          "text": "I'm not a Christian but holy shit these people just continually blaspheme and defile the word of God. Like fuck me, its your book Jesus was not ok with anything you guys are doing.",
          "timestamp": "2022-09-20 00:46:16",
          "score": 11,
          "num_children": 1,
          "author": 196914,
          "replies": [
            {
              "id": "ip7js1h",
              "text": "\"fuck it, the Lord will sort them\" - killer mike",
              "timestamp": "2022-09-20 16:03:29",
              "score": 3,
              "num_children": 0,
              "author": 97884,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip4q0tl",
      "text": "I have imaginary friends too. Why do I have to pay taxes?",
      "timestamp": "2022-09-19 23:49:16",
      "score": 28,
      "num_children": 0,
      "author": 289026,
      "replies": []
    },
    {
      "id": "ip4v89a",
      "text": "I sure wish he'd spend more time worrying about his church's ministers and leaders that assault women and children and less on this stupidity…  \n  \nhttps://www.npr.org/2022/06/02/1102621352/how-the-southern-baptist-convention-covered-up-its-widespread-sexual-abuse-scand  \n  \nhttps://www.washingtonpost.com/religion/2022/05/22/southern-baptist-sex-abuse-report/  \n  \nhttps://www.vox.com/culture/23131530/southern-baptist-convention-sexual-abuse-scandal-guidepost  \n  \nhttps://www.newyorker.com/news/q-and-a/decades-of-sexual-abuse-coverups-in-the-southern-baptist-convention",
      "timestamp": "2022-09-20 00:30:23",
      "score": 25,
      "num_children": 1,
      "author": 129488,
      "replies": [
        {
          "id": "ip59ws5",
          "text": "Is this story getting the attention it deserves? I don't think so, but maybe I live under a rock. Houston Chronicle and San Antonio Express-News broke this in 2019 and I just heard about it a couple months ago: https://www.houstonchronicle.com/news/investigations/abuse-of-faith/",
          "timestamp": "2022-09-20 02:24:29",
          "score": 8,
          "num_children": 3,
          "author": 334173,
          "replies": [
            {
              "id": "ip5at11",
              "text": "> Is this story getting the attention it deserves?\n\nNo. It is not getting the attention it deserves. Feel free to post as many links as possible whenever the Southern Baptists come up…",
              "timestamp": "2022-09-20 02:31:34",
              "score": 3,
              "num_children": 0,
              "author": 129488,
              "replies": []
            },
            {
              "id": "ip6hu15",
              "text": "Behind the bastards 2 pt series on the Southern Baptist Church quotes from this extensively",
              "timestamp": "2022-09-20 11:16:12",
              "score": 2,
              "num_children": 0,
              "author": 29001,
              "replies": []
            },
            {
              "id": "ip71yso",
              "text": "It's getting plenty of attention, but I'm not sure I can really decide how much is enough. I think you'll find that if you look, every major news outlet reported on the issue, and many big Christian networks did as well. It dominated the discussion on r/reformed, where I'm most active.   \n\n\nMoreover, the issue dominated the SBC's 2021 and 2022 convention. In 2021,  the convention resolved to appoint a task force, including an external third party, to investigate the sexual abuse allegations, specifically any coverup measures taken by the executive committee, and called on the executive committee to take the extraordinary measure of waiving attorney client privilege in order to provide the maximum amount of transparency. The executive committee voted to wave attorney client privilege, a move considered so legally stupid that their lawyers resigned. It has been suggested that this move could open up the SBC to liability that would put it's very existence at risk. That was something that the messengers at the convention (read: the representatives of actual churches) were overwhelmingly willing to risk in the pursuit of justice for sexual abuse victims.   \n\n\nIn 2022, the task force released the results of it's investigation. It should be noted that while the original Houston Chronicle article was a piece of outstanding investigative journalism, the second makes a lot of use of the report issued by the task force. [You can see reports and updates from the task force here.](https://www.sataskforce.net/downloads) While the actual process of getting to the investigation is messy because of the legal structure of the SBC and how those things have to be implemented, the long and short of it is that the messengers made it clear that the members of SBC churches wanted this investigation done with no roadblocks, and that's ultimately what came to pass. If you want to see for yourself how those annual meetings went down, you can read the minutes [here for 2021](https://www.sbc.net/wp-content/uploads/2021/09/2021-SBC-Annual.pdf) and while the minutes for 2022 are not yet available, two relevant resolutions can be found [here](https://www.sbc.net/resource-library/resolutions/on-support-for-consistent-laws-regarding-pastoral-sexual-abuse/) and [here](https://www.sbc.net/resource-library/resolutions/on-lament-and-repentance-for-sexual-abuse/). There are recommendations from the task force on how to proceed in light of the investigative report, and you can be sure that implementation of those recommendations will be major issues in the upcoming 2023 convention.",
              "timestamp": "2022-09-20 14:06:07",
              "score": 1,
              "num_children": 0,
              "author": 153673,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip4dspp",
      "text": "\"You can do whatever you want to anyone you want. You just have to say you're sorry on Sunday. You don't have to mean it.\" - Baptists <- I wish I was kidding.",
      "timestamp": "2022-09-19 22:15:02",
      "score": 69,
      "num_children": 4,
      "author": 165283,
      "replies": [
        {
          "id": "ip4zrny",
          "text": "I was at my daughter’s school PTA meeting last week and they passed around the medical/religious exemption for Covid vaccines form. While doing that, the PTA president—who is known to be pretty religious—said, “You literally can put whatever you want, as long as it has something religious-sounding.”",
          "timestamp": "2022-09-20 01:05:34",
          "score": 16,
          "num_children": 2,
          "author": 189163,
          "replies": [
            {
              "id": "ip54125",
              "text": "Schools encouraging lying on a piece of paper?  Noo.. get outta here.",
              "timestamp": "2022-09-20 01:38:43",
              "score": 7,
              "num_children": 1,
              "author": 368991,
              "replies": [
                {
                  "id": "ip57n0b",
                  "text": "Not the school!\nA pta member parent",
                  "timestamp": "2022-09-20 02:06:15",
                  "score": 7,
                  "num_children": 0,
                  "author": 408820,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip50zwq",
              "text": "[removed]",
              "timestamp": "2022-09-20 01:15:06",
              "score": -9,
              "num_children": 4,
              "replies": [
                {
                  "id": "ip51mu3",
                  "text": "Where did you get your medical degree, again?",
                  "timestamp": "2022-09-20 01:20:02",
                  "score": 6,
                  "num_children": 1,
                  "author": 304858,
                  "replies": [
                    {
                      "id": "ip54o7u",
                      "text": "PulledFromOuttaTheirAss University?",
                      "timestamp": "2022-09-20 01:43:33",
                      "score": 4,
                      "num_children": 0,
                      "author": 165283,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ip54lom",
                  "text": "The PTA president is clearly an uneducated idiot. Why do you think her opinion is worth listening to when weighed against the tens of thousands of medical and scientific experts who have trained their whole lives to be able to answer these key questions accurately.\n\nEveryone is entitled to an opinion. But not everyone's opinion is valid or equal. Some are based on facts as supported by evidence. Others are ignorant gullible cowards being played for fools by charlatans, crooks, trolls, and the mentally ill.\n\nYou get the difference, right?",
                  "timestamp": "2022-09-20 01:43:00",
                  "score": 4,
                  "num_children": 0,
                  "author": 165283,
                  "replies": []
                },
                {
                  "id": "ip549me",
                  "text": "like grow up healthy?  God forbid they do.  We need more people on welfare in red states so they can stay home all day and watch fox news.",
                  "timestamp": "2022-09-20 01:40:30",
                  "score": 2,
                  "num_children": 0,
                  "author": 368991,
                  "replies": []
                },
                {
                  "id": "ip6n4u4",
                  "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* Vaccine/Covid Disinformation\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                  "timestamp": "2022-09-20 12:08:53",
                  "score": 2,
                  "num_children": 0,
                  "author": 122319,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ip5guay",
          "text": "Yep. Grew up in the deep south, very poor, low-info, evangelical family. None attended church or prayed or anything like that of course, but they tried their hardest to indoctrinate me. Went to a private baptist school until middle school, and they *seriously* believe that you can do, say, think absolutely anything, but so long as you accept Jesus into your heart you'll be forgiven of all sins and go to heaven. \n\nWhat a sad, delusional group of people.",
          "timestamp": "2022-09-20 03:23:04",
          "score": 9,
          "num_children": 1,
          "author": 224848,
          "replies": [
            {
              "id": "ip5kram",
              "text": "Like the rich men who pay Mullahs to marry them to a prostitute for two hours and then pay them to get divorced right after, there are literally religious people who truly believe their god is a deaf, dumb, and blind imbecile.",
              "timestamp": "2022-09-20 04:01:11",
              "score": 2,
              "num_children": 0,
              "author": 165283,
              "replies": []
            }
          ]
        },
        {
          "id": "ip5vmk6",
          "text": "Sadly, I learned the hard way that other Christians also believe that. Be the shittiest, angriest, most vindictive person. But your god will protect you and you'll have a happy afterlife. It's tragic. It's really hard to keep any sheds of faith when watching people like that continue to make choices to treat you like shit (the one person in particular was an alcoholic but the anger was all by choice, not due to mental illness)",
          "timestamp": "2022-09-20 06:07:15",
          "score": 2,
          "num_children": 0,
          "author": 257094,
          "replies": []
        },
        {
          "id": "ip8ha5m",
          "text": "I was raised Baptist. The joke we told was \"Baptists go to church on Sunday, to be forgiven for everything they did on Saturday night.\"",
          "timestamp": "2022-09-20 19:36:25",
          "score": 2,
          "num_children": 0,
          "author": 41559,
          "replies": []
        }
      ]
    },
    {
      "id": "ip4vmxt",
      "text": "This country is turning into an absolute joke. The punishment for a religious organization getting involved in politics is a joke. The punishment for hedge funds violating SEC rules is a joke. The punishment for stealing classified information from the WH is a joke. The punishment for attempting to overthrow a legitimate election is a joke. \n\nThere is no rule of law if it isn't applied equally.",
      "timestamp": "2022-09-20 00:33:36",
      "score": 16,
      "num_children": 1,
      "author": 199338,
      "replies": [
        {
          "id": "ip5mesi",
          "text": "https://www.reddit.com/r/collapse/comments/nqpv21/collapse_as_a_result_of_zero_accountability_it_is/",
          "timestamp": "2022-09-20 04:18:22",
          "score": 2,
          "num_children": 0,
          "author": 394796,
          "replies": []
        }
      ]
    },
    {
      "id": "ip4bel1",
      "text": "This guy looks like a younger Rodney Dangerfield.",
      "timestamp": "2022-09-19 21:57:34",
      "score": 14,
      "num_children": 2,
      "author": 378680,
      "replies": [
        {
          "id": "ip4i8s3",
          "text": "No reason to insult Rodney Dangerfield!",
          "timestamp": "2022-09-19 22:48:34",
          "score": 12,
          "num_children": 1,
          "author": 349032,
          "replies": [
            {
              "id": "ip4k5zh",
              "text": "No respect",
              "timestamp": "2022-09-19 23:03:20",
              "score": 15,
              "num_children": 0,
              "author": 375463,
              "replies": []
            }
          ]
        },
        {
          "id": "ip4hqfa",
          "text": "Lemme tell ya.",
          "timestamp": "2022-09-19 22:44:41",
          "score": 3,
          "num_children": 0,
          "author": 273105,
          "replies": []
        }
      ]
    },
    {
      "id": "ip4j0yr",
      "text": "Garbage human being.",
      "timestamp": "2022-09-19 22:54:34",
      "score": 10,
      "num_children": 1,
      "author": 326724,
      "replies": [
        {
          "id": "ip5po2a",
          "text": "Pretty damn stupid too.  I guarantee you at least 99% of the people who actually listen to him are voting republican anyway so he isn't changing anyone's mind and bringing some serious heat on his organization in the process.",
          "timestamp": "2022-09-20 04:54:49",
          "score": 2,
          "num_children": 1,
          "author": 246598,
          "replies": [
            {
              "id": "ip5q8io",
              "text": "I agree. But serious heat that won't actually hurt.\n\n Smh. Religious people are wild.\n\nedit: to clarify I want serious heat on them but it's not going to happen.",
              "timestamp": "2022-09-20 05:01:20",
              "score": 1,
              "num_children": 0,
              "author": 326724,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip4g0mu",
      "text": "Did you report it?",
      "timestamp": "2022-09-19 22:31:34",
      "score": 6,
      "num_children": 0,
      "author": 279986,
      "replies": []
    },
    {
      "id": "ip4u3au",
      "text": "Not ro be pedantic, but he's the president of an SBC seminary, not the Southern Baptist Convention as a whole.",
      "timestamp": "2022-09-20 00:21:28",
      "score": 6,
      "num_children": 1,
      "author": 183931,
      "replies": [
        {
          "id": "ip4xdx5",
          "text": "He also didn't actually say \"Republican\", but just to vote \"correctly\". I don't think that's enough to violate the law even though everyone knows what he means.",
          "timestamp": "2022-09-20 00:47:07",
          "score": 4,
          "num_children": 1,
          "author": 52276,
          "replies": [
            {
              "id": "ip5jqlq",
              "text": "Yes. But, it seems if you have enough hate in your heart, you don’t have to read the actual quote, just some cunts interpretation.  I feel the people who hate Christians and/or Republicans so much are actually a closeted conservative, but can’t admit it to themselves or their friends and family. Just like all the homophobic preachers who are actually closeted gay people cannot admit to themselves they are actually gay.",
              "timestamp": "2022-09-20 03:50:49",
              "score": -6,
              "num_children": 2,
              "author": 56887,
              "replies": [
                {
                  "id": "ip5wbcx",
                  "text": "That makes no sense. People who hate Christians are people who were treated like shit by Christians. Because Christians don't believe that you have to be a good person to have a good afterlife. How does that lead to them being hidden conservatives? The only thing that hating Christians does to me is lose faith and become an atheist. If Christians lived by the principles outlined in the Bible (which they don't, and that's the problem), if they treated their spouses and neighbors with respect and care, there would be no hate towards Christians. None of this has anything to do with being conservative. Be conservative all you want but stay out of others' business.",
                  "timestamp": "2022-09-20 06:16:28",
                  "score": 1,
                  "num_children": 0,
                  "author": 257094,
                  "replies": []
                },
                {
                  "id": "ip6hxp8",
                  "text": "I think most people just misunderstand the rule. People think churches can't bring up politics at all, but they can as long as it isn't explicitly partisan. \n\nI think there is a lot of hate towards fascists whether they are Christian or not though. You can respect people's religious beliefs and not hate them, while still hating fascists trying to create a theocracy, which the guy in the article would probably welcome. He's clearly happy telling women what to do with their own bodies.",
                  "timestamp": "2022-09-20 11:17:20",
                  "score": 1,
                  "num_children": 0,
                  "author": 52276,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip4l6bj",
      "text": "Did you report it to the IRS?",
      "timestamp": "2022-09-19 23:11:07",
      "score": 6,
      "num_children": 0,
      "author": 351721,
      "replies": []
    },
    {
      "id": "ip4rk27",
      "text": "My former coworker, Lindsey, is a devout southern Christian. When trump was president, she posted on FB about how she became an independent because the trump party no longer aligned with her values. She was met with lots of backlash from her church “friends.” Be like Lindsey. Do the right thing, even if it’s hard.",
      "timestamp": "2022-09-20 00:01:37",
      "score": 5,
      "num_children": 0,
      "author": 21855,
      "replies": []
    },
    {
      "id": "ip4p7dg",
      "text": "The Southern Baptists are not that hierarchical, but if the top guy saying this gets them all rendered taxable I would be very happy.",
      "timestamp": "2022-09-19 23:42:52",
      "score": 3,
      "num_children": 1,
      "author": 169379,
      "replies": [
        {
          "id": "ip531ta",
          "text": "He's not the top guy either. Just the equivalent of a college president. I'm all for making them pay taxes though.",
          "timestamp": "2022-09-20 01:31:05",
          "score": 3,
          "num_children": 0,
          "author": 371158,
          "replies": []
        }
      ]
    },
    {
      "id": "ip4t0s3",
      "text": "You know what kind of countries have laws that don't enforce them fairly?  Fascist ones.",
      "timestamp": "2022-09-20 00:13:12",
      "score": 4,
      "num_children": 0,
      "author": 271049,
      "replies": []
    },
    {
      "id": "ip4bab9",
      "text": "They need to stop running racists and rhinos then; need more honest Abes.",
      "timestamp": "2022-09-19 21:56:41",
      "score": 9,
      "num_children": 1,
      "author": 395216,
      "replies": [
        {
          "id": "ip4bjk3",
          "text": "Current GOP would label Honest Abe as a liberal communist marxist (he literally received a letter of admiration from Marx) who is destroying america.",
          "timestamp": "2022-09-19 21:58:34",
          "score": 22,
          "num_children": 0,
          "author": 18816,
          "replies": []
        }
      ]
    },
    {
      "id": "ip4m1aw",
      "text": "You know these incorrigibles voted for the most sinful President we've ever had at the rate of 80% in 2016 and 75% in 2020.  They're \"unfaithful\" and \"disloyal\" to Jesus.  These people need to get religion.",
      "timestamp": "2022-09-19 23:17:55",
      "score": 8,
      "num_children": 0,
      "author": 123845,
      "replies": []
    },
    {
      "id": "ip4vlhv",
      "text": "christofascist makes flippy floppy",
      "timestamp": "2022-09-20 00:33:17",
      "score": 3,
      "num_children": 0,
      "author": 325218,
      "replies": []
    },
    {
      "id": "ip4y9ld",
      "text": "You can't just make a reddit post. He has to be turned in to the FBI.",
      "timestamp": "2022-09-20 00:53:55",
      "score": 3,
      "num_children": 0,
      "author": 186350,
      "replies": []
    },
    {
      "id": "ip59ctc",
      "text": "Aren’t the southern baptists a pedophile organization?",
      "timestamp": "2022-09-20 02:20:05",
      "score": 3,
      "num_children": 1,
      "author": 183028,
      "replies": [
        {
          "id": "ip5bkfc",
          "text": "I thought it was the evangelicals in general.",
          "timestamp": "2022-09-20 02:37:45",
          "score": 1,
          "num_children": 0,
          "author": 280719,
          "replies": []
        }
      ]
    },
    {
      "id": "ip5j9ye",
      "text": "I'd go a step the other direction and say that Christians voting Republican are following the Antichrist. Because... Why not, hey?",
      "timestamp": "2022-09-20 03:46:15",
      "score": 3,
      "num_children": 0,
      "author": 181000,
      "replies": []
    },
    {
      "id": "ip5nm48",
      "text": "Christian’s get away with literally everything, it’s insane",
      "timestamp": "2022-09-20 04:31:34",
      "score": 3,
      "num_children": 0,
      "author": 123224,
      "replies": []
    },
    {
      "id": "ip5o3ul",
      "text": "The Bible explicitly says to treat immigrants completely the opposite of how Trump and DeSantis treat them. On abortion, the Bible gives instructions on how to do it because sometimes it’s necessary. But yeah, let’s follow the denomination that split off from its parent organization because they were abolitionists.",
      "timestamp": "2022-09-20 04:37:05",
      "score": 3,
      "num_children": 0,
      "author": 248621,
      "replies": []
    },
    {
      "id": "ip6i5uh",
      "text": "Religion is the only thing keeping GOP fundamental politicians relevant. Like an ignorance feedback loop.",
      "timestamp": "2022-09-20 11:19:45",
      "score": 3,
      "num_children": 0,
      "author": 212228,
      "replies": []
    },
    {
      "id": "ip71wf6",
      "text": "The biggest threat to the US is Conservative Christian Nationalists.",
      "timestamp": "2022-09-20 14:05:40",
      "score": 3,
      "num_children": 0,
      "author": 374111,
      "replies": []
    },
    {
      "id": "ip4u7ox",
      "text": "The churches should have lost their tax exemption decades ago.",
      "timestamp": "2022-09-20 00:22:24",
      "score": 5,
      "num_children": 0,
      "author": 294665,
      "replies": []
    },
    {
      "id": "ip56xl2",
      "text": "As someone who grew up in the Baptist church... fuck baptists.",
      "timestamp": "2022-09-20 02:00:46",
      "score": 4,
      "num_children": 0,
      "author": 116439,
      "replies": []
    },
    {
      "id": "ip4b86q",
      "text": "I thought 45 got rid of the Johnson amendment? Am I mistaken?",
      "timestamp": "2022-09-19 21:56:16",
      "score": 2,
      "num_children": 3,
      "author": 260123,
      "replies": [
        {
          "id": "ip4r2ht",
          "text": "the right tried to in his tax cut for billionaires bill.\nhe did an EO that limits the enforcement of the penalties but its kinda convoluted and probably wouldnt hold up. Thing is we pretty much dont enforce it anyways. AS usual right wingers are inventing issues to \"fix\".. despite trump claiming to restore religious freedom, the irs pretty much wasnt doing shit. \n\nyall remember when cali banned same sex marriage? turned out the mormon church was behind most of the funding for that. aint dick happened to them.  and they spent something like 75 million to ban same sex marriage, clearly a violation of the johnson amendment. but we dont go after churches, its political suicide, unfortunately.  While a super majority, of both parties and even the religious, think church leaders should stay out of politics,  much like  people hating politicians, it seems to only count when its not their own politician...or church.",
          "timestamp": "2022-09-19 23:57:43",
          "score": 6,
          "num_children": 1,
          "author": 220399,
          "replies": [
            {
              "id": "ip5153r",
              "text": "As much as I hate to say it, the Mormon church didn't violate the Johnson amendment in your example. \n\nA lot of people seem to think the Johnson amendment is more of a hindrance than it actually is...\n\nThe only actual restriction is of the church itself endorsing a specific candidate. They are free to endorse issues and initiatives. \n\nThat said. They get around this by saying. \"As a pastor I can't tell you who to vote for... But as a fellow citizen I say vote (insert asshole here).\"  Then the \"church\" isn't endorsing the candidate just the totally random guy who happens to be in robes at the pulpit. \n\nBut a church is still free to officially say it's anti abortion or gay marriage  whatever. It's only a restriction on supporting specific candidates. \n\n[Current IRS rules (in brief) and links to guidance](https://www.irs.gov/newsroom/charities-churches-and-politics)",
              "timestamp": "2022-09-20 01:16:12",
              "score": 1,
              "num_children": 0,
              "author": 268571,
              "replies": []
            }
          ]
        },
        {
          "id": "ip4fv1o",
          "text": "Yes.",
          "timestamp": "2022-09-19 22:30:25",
          "score": 2,
          "num_children": 1,
          "author": 296051,
          "replies": [
            {
              "id": "ip4ieej",
              "text": "Glad to be wrong!",
              "timestamp": "2022-09-19 22:49:46",
              "score": 1,
              "num_children": 0,
              "author": 260123,
              "replies": []
            }
          ]
        },
        {
          "id": "ip530gz",
          "text": "Pretty much signed an order saying it will not be enforced.  Would love to see numbers on political contributions from Churches.  Sadly will probably never see the light of day.\n\n> On May 4, 2017, Trump signed the \"Presidential Executive Order Promoting Free Speech and Religious Liberty.\"[18] The executive order does not repeal the Johnson Amendment, nor does it allow ministers to endorse from the pulpit, but it does halt the enforcement of its consequences[19] by directing the Department of Treasury that \"churches should not be found guilty of implied endorsements where secular organizations would not be.\"\n\nhttps://en.wikipedia.org/wiki/Johnson_Amendment\n\n>  In particular, the Secretary of the Treasury shall ensure, to the extent permitted by law, that the Department of the Treasury does not take any adverse action against any individual, house of worship, or other religious organization on the basis that such individual or organization speaks or has spoken about moral or political issues from a religious perspective, where speech of similar character has, consistent with law, not ordinarily been treated as participation or intervention in a political campaign on behalf of (or in opposition to) a candidate for public office by the Department of the Treasury.  As used in this section, the term \"adverse action\" means the imposition of any tax or tax penalty; the delay or denial of tax-exempt status; the disallowance of tax deductions for contributions made to entities exempted from taxation under section 501(c)(3) of title 26, United States Code; or any other action that makes unavailable or denies any tax deduction, exemption, credit, or benefit.\n\nhttps://web.archive.org/web/20170506055021/https://www.whitehouse.gov/the-press-office/2017/05/04/presidential-executive-order-promoting-free-speech-and-religious-liberty/",
          "timestamp": "2022-09-20 01:30:46",
          "score": 1,
          "num_children": 0,
          "author": 368991,
          "replies": []
        }
      ]
    },
    {
      "id": "ip4u27e",
      "text": "\"Remember all the things Jesus said to do and vote for the party that regularly does the opposite.\"",
      "timestamp": "2022-09-20 00:21:14",
      "score": 2,
      "num_children": 0,
      "author": 80496,
      "replies": []
    },
    {
      "id": "ip4yit9",
      "text": "Go to the IRS website and download/submit the form to have their status revoked.",
      "timestamp": "2022-09-20 00:55:53",
      "score": 2,
      "num_children": 1,
      "author": 249028,
      "replies": [
        {
          "id": "ip58rlo",
          "text": "But maybe stop and realize this guy isn't actual the \"#1 SBC leader\" and doesn't speak for the SBC as a whole anyways.",
          "timestamp": "2022-09-20 02:15:27",
          "score": 1,
          "num_children": 0,
          "author": 101181,
          "replies": []
        }
      ]
    },
    {
      "id": "ip4yz3a",
      "text": "What about supporting candidates who are for usury?  Also, Republicans supporting the sanctity of marriage???  They are the divorcingest bunch ever.  They will divorce you when you hit 30, when you're in the hospital with cancer, etc... etc...  They trade wives more than I trade cars.",
      "timestamp": "2022-09-20 00:59:27",
      "score": 2,
      "num_children": 1,
      "author": 352938,
      "replies": [
        {
          "id": "ip54gke",
          "text": "what about the Leviticus prohibition against eating pork and shellfish? Against having tattoos? Against lying? Against going to church if you wear glasses? Also adultery, which Baptists seem to make a sport of..",
          "timestamp": "2022-09-20 01:41:54",
          "score": 3,
          "num_children": 0,
          "author": 102841,
          "replies": []
        }
      ]
    },
    {
      "id": "ip4zfsh",
      "text": "And they wonder why people are leaving their ~~organized religion~~ weird ass cult",
      "timestamp": "2022-09-20 01:02:59",
      "score": 2,
      "num_children": 0,
      "author": 121629,
      "replies": []
    },
    {
      "id": "ip4zxpj",
      "text": "Y'all remember when the country was made, when church state separation was a major point?\n\nPepperidge Farm remembers.",
      "timestamp": "2022-09-20 01:06:51",
      "score": 2,
      "num_children": 0,
      "author": 402633,
      "replies": []
    },
    {
      "id": "ip5037z",
      "text": "Fun thing is, Jesus probably would be a socialist...",
      "timestamp": "2022-09-20 01:08:02",
      "score": 2,
      "num_children": 0,
      "author": 2193,
      "replies": []
    },
    {
      "id": "ip51dxl",
      "text": "Christian as in Christ as in Jesus, he'd lecture the republican party to the point they would crucify him, yes history repeating itself.",
      "timestamp": "2022-09-20 01:18:07",
      "score": 2,
      "num_children": 0,
      "author": 94245,
      "replies": []
    },
    {
      "id": "ip58via",
      "text": "Should get rid of all tax exempt status for all churches and religions. Not just the ones pushing politics.",
      "timestamp": "2022-09-20 02:16:16",
      "score": 2,
      "num_children": 0,
      "author": 363461,
      "replies": []
    },
    {
      "id": "ip5ayxp",
      "text": "The GOP has nothing in common with Jesus",
      "timestamp": "2022-09-20 02:32:54",
      "score": 2,
      "num_children": 0,
      "author": 211034,
      "replies": []
    },
    {
      "id": "ip5b4qb",
      "text": "Hahahahhaha! Congress do your job, that’s a good one!",
      "timestamp": "2022-09-20 02:34:13",
      "score": 2,
      "num_children": 0,
      "author": 95731,
      "replies": []
    },
    {
      "id": "ip5cjgq",
      "text": "Atheists try not to be insufferable challenge (impossible)",
      "timestamp": "2022-09-20 02:45:52",
      "score": 2,
      "num_children": 0,
      "author": 54550,
      "replies": []
    },
    {
      "id": "ip5dm9p",
      "text": "Southern Baptist here. An important thing to remember is that while we all willingly join together as a convention and cooperate on certain initiatives, each church is a distinct legal entity and has no legal authority outside its own walls. So while you could potentially remove the tax exempt status for any entity that employs Albert Mohler (or Alfred Backtooth, as my friend likes to call him), that wouldn't have much of any effect on the thousands of SBC churches around the country, because they are autonomous by design. \n\nMohler may be a thought leader and a figurehead for the SBC, but we're diverse in our own way and he has lost a lot of favor in recent years. Some of us greatly disprove of his increasing tendency to draw political lines in the sand, especially saying he'd never vote for Trump in 2016 then voting for him in 2020, and now this. Others disprove of him because he has, in their eyes, \"gone woke\" (I kid you not). \n\nI'm under no illusion that the vast majority of this sub disagrees with me on several major policy issues. But I can attest that my pastor regularly addresses social and political issues from the pulpit and leaves room for Christians to make differing decisions regarding those issues. \n\nAnd all that said, I'll also add that I'm not entirely convinced that churches need to be nonprofits, because I'm not sure an apolitical disposition is realistic for any entity.",
      "timestamp": "2022-09-20 02:54:53",
      "score": 2,
      "num_children": 0,
      "author": 153673,
      "replies": []
    },
    {
      "id": "ip5maya",
      "text": "Southern Baptist church are the  national child fucking association.\n\nhttps://www.theguardian.com/world/2022/jun/12/southern-baptist-church-sexual-abuse-scandal\n\nBut do keep saying the left are grooming children.",
      "timestamp": "2022-09-20 04:17:14",
      "score": 2,
      "num_children": 0,
      "author": 251108,
      "replies": []
    },
    {
      "id": "ip5mhbo",
      "text": "After Trump, this sort of rhetoric has become normalized. \n\nThese guys keep testing the limits of what the government officials will tolerate. The latter seem to be either useless or in bed with the rich “god-fearing” men.",
      "timestamp": "2022-09-20 04:19:07",
      "score": 2,
      "num_children": 0,
      "author": 306540,
      "replies": []
    },
    {
      "id": "ip5mte2",
      "text": "This is Americas number one terrorist organization. Sadly super entrenched in government. IRS will do nothing. Our only hope is these people continue to eat ivermectin and dwindle themselves out of society over generations.",
      "timestamp": "2022-09-20 04:22:38",
      "score": 2,
      "num_children": 0,
      "author": 7784,
      "replies": []
    },
    {
      "id": "ip5pvfr",
      "text": "As Mohler isn’t a pastor of the “church” he was in, just a guest speaker, would this technically be violating separation of church and state? I’m woefully ignorant on these things and genuinely curious, not trying to start an argument.",
      "timestamp": "2022-09-20 04:57:12",
      "score": 2,
      "num_children": 0,
      "author": 370145,
      "replies": []
    },
    {
      "id": "ip5rckf",
      "text": "unfaithful? Tax this heathen so that he may repent!",
      "timestamp": "2022-09-20 05:14:38",
      "score": 2,
      "num_children": 0,
      "author": 157445,
      "replies": []
    },
    {
      "id": "ip6b0vw",
      "text": "To those wanting to report this as repugnant to the johnson act.. They arent endorsing..or contributing to the campaign directly. So its going to be tough. Worth looking into, as im sure some are pushing...if not breaking the limits. \n And be sure to include ALL churches..not just one side.",
      "timestamp": "2022-09-20 09:50:30",
      "score": 2,
      "num_children": 0,
      "author": 21971,
      "replies": []
    },
    {
      "id": "ip6qclr",
      "text": "What about Churches that have politicians speak at them?",
      "timestamp": "2022-09-20 12:37:42",
      "score": 2,
      "num_children": 0,
      "author": 301393,
      "replies": []
    },
    {
      "id": "ip6rppn",
      "text": "Unless they mention a candidate by name, you won't get anywhere with this. They can speak on political issues, even parties. The line in the sand is endorsing a specific candidate. Even saying \"Vote Republican\" when there is only one option isn't enough for the IRS to revoke their status.",
      "timestamp": "2022-09-20 12:49:15",
      "score": 2,
      "num_children": 1,
      "author": 380864,
      "replies": [
        {
          "id": "ip754q1",
          "text": "The IRS isn't revoking tax exempt status of any churches, for anything political.  Some of them *are* telling their flocks to vote for specific candidates.  They've gotten very bold about it because they know nothing will be done.",
          "timestamp": "2022-09-20 14:28:06",
          "score": 1,
          "num_children": 0,
          "author": 178902,
          "replies": []
        }
      ]
    },
    {
      "id": "ip6scw8",
      "text": "But people are leaving the church at higher rates because 'they just want to sin'.",
      "timestamp": "2022-09-20 12:54:30",
      "score": 2,
      "num_children": 0,
      "author": 179007,
      "replies": []
    },
    {
      "id": "ip6tc6h",
      "text": "But yet they love tsrgeting poor and middle class people. Wtf.",
      "timestamp": "2022-09-20 13:02:19",
      "score": 2,
      "num_children": 0,
      "author": 281941,
      "replies": []
    },
    {
      "id": "ip6te50",
      "text": "Do these Christian think voting democrat is a one way ticket to hell?",
      "timestamp": "2022-09-20 13:02:46",
      "score": 2,
      "num_children": 1,
      "author": 346281,
      "replies": [
        {
          "id": "ip73kh4",
          "text": "I have neighbors that would say yes and I live in Western NY.",
          "timestamp": "2022-09-20 14:17:26",
          "score": 2,
          "num_children": 0,
          "author": 250985,
          "replies": []
        }
      ]
    },
    {
      "id": "ip6x83n",
      "text": "I absolutely support this opinion, and investigation by the IRS. \n\nBut also, the current SCOTUS would enjoin them and strike down the Johnson Amendment faster than you can say \"administrative ruling.\"",
      "timestamp": "2022-09-20 13:31:58",
      "score": 2,
      "num_children": 0,
      "author": 316099,
      "replies": []
    },
    {
      "id": "ip70qa6",
      "text": "Where's FFRF?  Are they looking into this?",
      "timestamp": "2022-09-20 13:57:29",
      "score": 2,
      "num_children": 0,
      "author": 239212,
      "replies": []
    },
    {
      "id": "ip7kdph",
      "text": "Interesting the Q loonies have no interest in pedos at Southern Baptist church.",
      "timestamp": "2022-09-20 16:07:19",
      "score": 2,
      "num_children": 0,
      "author": 303936,
      "replies": []
    },
    {
      "id": "ip4eyee",
      "text": "Report him.",
      "timestamp": "2022-09-19 22:23:33",
      "score": 3,
      "num_children": 0,
      "author": 178073,
      "replies": []
    },
    {
      "id": "ip4qaq7",
      "text": "I sure hope someone actually reports it rather than just get the updoots here",
      "timestamp": "2022-09-19 23:51:28",
      "score": 2,
      "num_children": 0,
      "author": 244443,
      "replies": []
    },
    {
      "id": "ip4tood",
      "text": "Southern Baptists are fascist theocrats. You can't be one without supporting people like him and giving them political power.",
      "timestamp": "2022-09-20 00:18:21",
      "score": 3,
      "num_children": 0,
      "author": 64183,
      "replies": []
    },
    {
      "id": "ip5a48e",
      "text": "Raping kids = relocation . Voting democrat = eternal damnation. Seems reasonable.",
      "timestamp": "2022-09-20 02:26:10",
      "score": 4,
      "num_children": 0,
      "author": 278242,
      "replies": []
    },
    {
      "id": "ip4nzik",
      "text": "And yet he himself was against Trump in 2016. I wonder how much money it took to change his mind? 30 pieces of silver perhaps?",
      "timestamp": "2022-09-19 23:33:17",
      "score": 1,
      "num_children": 0,
      "author": 138099,
      "replies": []
    },
    {
      "id": "ip5c2c8",
      "text": "All churches need to be taxed. I hope this is the beginning of it.",
      "timestamp": "2022-09-20 02:41:49",
      "score": 1,
      "num_children": 1,
      "author": 218961,
      "replies": [
        {
          "id": "ip7ou8y",
          "text": "He never said this at a church",
          "timestamp": "2022-09-20 16:35:29",
          "score": 0,
          "num_children": 1,
          "author": 361531,
          "replies": [
            {
              "id": "ipa1ro1",
              "text": "What’s your point?",
              "timestamp": "2022-09-21 02:19:21",
              "score": 1,
              "num_children": 0,
              "author": 218961,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip5d6nl",
      "text": "Tax churches now",
      "timestamp": "2022-09-20 02:51:16",
      "score": 1,
      "num_children": 0,
      "author": 26280,
      "replies": []
    },
    {
      "id": "ip5dsjl",
      "text": "If you report this and the IRS pursues taxing the churches, the churches will sue and claim that it's freedom of speech and exercise of religion. It'll go to the trial court, which will probably find for the IRS. Then it will get appealed. Eventually, it will make it's way to SCOTUS. SCOTUS is corrupt and intentionally stacked to allow for religious control. They're just itching for this case so they can overturn the Johnson Amendment for religious institutions. This will embolden churches which will start using their donations to fund political candidates...openly. They'll have more power than ever before. It will also strengthen \"religious freedom\" in general, which will allow them to ignore more laws, especially antidiscrimination laws, even in settings where they're acting like schools, businesses, or nonprofit organizations instead of religious institutions.  \n \n&nbsp;  \n\nSo, when you report these churches, you're risking giving them far more power. You have to pick your battles. And this battle is already rigged. Don't fuck things up more than they already are.",
      "timestamp": "2022-09-20 02:56:22",
      "score": -1,
      "num_children": 1,
      "author": 368055,
      "replies": [
        {
          "id": "ip7osnx",
          "text": "He didn’t say this at a church",
          "timestamp": "2022-09-20 16:35:13",
          "score": 0,
          "num_children": 0,
          "author": 361531,
          "replies": []
        }
      ]
    },
    {
      "id": "ip4o6z4",
      "text": "He doesn’t say HOW to vote as in which party.  Wink wink. We know what he means. But he doesn’t say explicitly to vote one way or the other.  So urging people to “vote” isn’t violation of church and state.",
      "timestamp": "2022-09-19 23:34:55",
      "score": 0,
      "num_children": 0,
      "author": 15248,
      "replies": []
    },
    {
      "id": "ip4vo62",
      "text": "Mohler is a piece of shit, but he worded his statement just dog-whistley enough that he did not endorse candidates or even a party. Nothing report worthy",
      "timestamp": "2022-09-20 00:33:53",
      "score": -10,
      "num_children": 1,
      "author": 87484,
      "replies": [
        {
          "id": "ip57m6r",
          "text": "Even if you literally tell people who to vote for it's fine apparently?\n\nhttps://abcnews4.com/news/nation-world/experts-say-kamala-harris-church-video-supporting-virginia-democrat-may-be-illegal",
          "timestamp": "2022-09-20 02:06:05",
          "score": 6,
          "num_children": 1,
          "author": 163858,
          "replies": [
            {
              "id": "ip59bgz",
              "text": "All those churches should lose their exemption too. No exceptions at all.",
              "timestamp": "2022-09-20 02:19:46",
              "score": 6,
              "num_children": 1,
              "author": 191787,
              "replies": [
                {
                  "id": "ip59xg0",
                  "text": "Yeah but I mean\n\nThe executive branch of the current government is literally endorsing this behavior. It won't happen",
                  "timestamp": "2022-09-20 02:24:38",
                  "score": 1,
                  "num_children": 0,
                  "author": 163858,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip452io",
      "text": "[removed]",
      "timestamp": "2022-09-19 21:12:37",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "ip4xca8",
          "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n- This comment has been removed for trolling or shitposting. Even if your intent is not to troll or shitpost, certain words and phrases are enough for removal. This rule is applied strictly and may lead to an immediate ban.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
          "timestamp": "2022-09-20 00:46:46",
          "score": 2,
          "num_children": 0,
          "author": 122319,
          "replies": []
        }
      ]
    },
    {
      "id": "ip4t2tt",
      "text": "Problem is, when it gets up to our current SCOTUS... how do you think we'll go? They've been trying to get a car up to the Supreme Court for like a decade, remember \"Pulpit Freedom Sunday\" from the Left Behind pastor in San Diego?",
      "timestamp": "2022-09-20 00:13:40",
      "score": 1,
      "num_children": 0,
      "author": 322752,
      "replies": []
    },
    {
      "id": "ip4tuwo",
      "text": "They never will",
      "timestamp": "2022-09-20 00:19:41",
      "score": 1,
      "num_children": 0,
      "author": 326959,
      "replies": []
    },
    {
      "id": "ip4u2yd",
      "text": "There's leaders in the Baptist church? Lmao never heard of this guy and he doesn't mean anything more to me than any other Baptist",
      "timestamp": "2022-09-20 00:21:24",
      "score": 1,
      "num_children": 1,
      "author": 125511,
      "replies": [
        {
          "id": "ip56d57",
          "text": "He’s just a seminary president. If anything, a self-appointed spokesperson. No thanks.",
          "timestamp": "2022-09-20 01:56:25",
          "score": 2,
          "num_children": 1,
          "author": 278786,
          "replies": [
            {
              "id": "ip5aogo",
              "text": "So like saying he's the \"#1 leader of southern baptists\" is just a bullshit title the author made?",
              "timestamp": "2022-09-20 02:30:35",
              "score": 1,
              "num_children": 0,
              "author": 125511,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip4x3jd",
      "text": "Damnit….these hypocritical idiots.  How the hell can any conservative religious person get behind fucking Trump?  I thought “grab em by the p***y” was going to be his downfall…..god was I wrong.",
      "timestamp": "2022-09-20 00:44:53",
      "score": 1,
      "num_children": 0,
      "author": 43610,
      "replies": []
    },
    {
      "id": "ip4yll0",
      "text": "If church and politics mix, then you're not a church and you owe me money!",
      "timestamp": "2022-09-20 00:56:29",
      "score": 1,
      "num_children": 0,
      "author": 319452,
      "replies": []
    },
    {
      "id": "ip4zmid",
      "text": "Stoned me saw Rodney Dangerfield in the image preview lol",
      "timestamp": "2022-09-20 01:04:27",
      "score": 1,
      "num_children": 0,
      "author": 245762,
      "replies": []
    },
    {
      "id": "ip4zwaw",
      "text": "We’re they speaking for themselves or for the church?  If not the church, freedom of speech supersedes income taxes.",
      "timestamp": "2022-09-20 01:06:34",
      "score": 1,
      "num_children": 0,
      "author": 226263,
      "replies": []
    },
    {
      "id": "ip500hw",
      "text": "Thought Rodney Dangerfield was Jewish.",
      "timestamp": "2022-09-20 01:07:27",
      "score": 1,
      "num_children": 0,
      "author": 46010,
      "replies": []
    },
    {
      "id": "ip50on2",
      "text": "Al Mohler is certainly not the #1 leader of the SBC and he definitely doesn’t speak for the organization at all. He’s a seminary president and got 3rd place in an election that had three other extremely unpopular options.",
      "timestamp": "2022-09-20 01:12:37",
      "score": 1,
      "num_children": 0,
      "author": 252323,
      "replies": []
    },
    {
      "id": "ip515rn",
      "text": "I genuinely do not understand how this isn't a slam dunk lawsuit for the FFRF or similar group.\n\nLike, tell me they are at least exploiting some kind of legal loophole that I'm too dumb to grasp.",
      "timestamp": "2022-09-20 01:16:20",
      "score": 1,
      "num_children": 0,
      "author": 387190,
      "replies": []
    },
    {
      "id": "ip51av7",
      "text": "Country is going straight to hell in any way shapes or forms you want to look at it and this is your solution? Idiot",
      "timestamp": "2022-09-20 01:17:26",
      "score": 1,
      "num_children": 1,
      "author": 247161,
      "replies": [
        {
          "id": "ip544kd",
          "text": "how about writing an understandable sentence?",
          "timestamp": "2022-09-20 01:39:28",
          "score": 1,
          "num_children": 1,
          "author": 102841,
          "replies": [
            {
              "id": "ip9au6c",
              "text": "Act like it's a conversation... not hard. Literally.",
              "timestamp": "2022-09-20 22:54:42",
              "score": 1,
              "num_children": 0,
              "author": 247161,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip51o1l",
      "text": "If government institutions in the US actually did their jobs, that country wouldn't be on such an insane downward trajectory as it is now.",
      "timestamp": "2022-09-20 01:20:17",
      "score": 1,
      "num_children": 0,
      "author": 265440,
      "replies": []
    },
    {
      "id": "ip5205u",
      "text": "Lololol nah all red!",
      "timestamp": "2022-09-20 01:22:51",
      "score": 1,
      "num_children": 0,
      "author": 187472,
      "replies": []
    },
    {
      "id": "ip5215d",
      "text": "My eyes passed over the image and thought it was young Rodney Dangerfield. Then all I could imagine was him doing the “no respect” bit as an official response.",
      "timestamp": "2022-09-20 01:23:04",
      "score": 1,
      "num_children": 0,
      "author": 391902,
      "replies": []
    },
    {
      "id": "ip523ja",
      "text": "Perhaps they are just trying to use this lunacy to move past [this disgusting mess](https://www.vox.com/culture/23131530/southern-baptist-convention-sexual-abuse-scandal-guidepost)",
      "timestamp": "2022-09-20 01:23:35",
      "score": 1,
      "num_children": 0,
      "author": 114053,
      "replies": []
    },
    {
      "id": "ip527pn",
      "text": "Ah sorry, IRS is under the department of the treasury, meaning they're under the executive branch.  And that means if it involves anything with conservatives and republicans, they get a pass on any law breaking.",
      "timestamp": "2022-09-20 01:24:30",
      "score": 1,
      "num_children": 0,
      "author": 211105,
      "replies": []
    },
    {
      "id": "ip52gub",
      "text": "Same copy and paste speech since ever. God always has their favorite political party, and it seems to be the worst one at that",
      "timestamp": "2022-09-20 01:26:30",
      "score": 1,
      "num_children": 0,
      "author": 41039,
      "replies": []
    },
    {
      "id": "ip534t3",
      "text": "Do it! Do it! Do it! \n-chanted everyone",
      "timestamp": "2022-09-20 01:31:44",
      "score": 1,
      "num_children": 0,
      "author": 240557,
      "replies": []
    },
    {
      "id": "ip53ddv",
      "text": "Religions should not be tax exempt unless they actively provide charity. So much money hidden and hoarded",
      "timestamp": "2022-09-20 01:33:37",
      "score": 1,
      "num_children": 0,
      "author": 213098,
      "replies": []
    },
    {
      "id": "ip53fp3",
      "text": "Ahh, yes. Just as Jesus, a middle eastern Jew, intended. I’m pretty sure it’s somewhere in Corinthians that he spoke of voting for the political party that oppresses people if they’re brown-skinned, homosexual, pregnant, female, poor, etc in the United States of America thousands of years into the future.",
      "timestamp": "2022-09-20 01:34:07",
      "score": 1,
      "num_children": 0,
      "author": 87083,
      "replies": []
    },
    {
      "id": "ip53pit",
      "text": "If the IRS can hassle me and theeaten to fine me thousands of dollars over a form I mailed to them but they lost (phew), then they can sure investigate so called \"churches\".\n\nThen again theycprobavly expected I'd just pat the penalties and go away because who is going to to to court over $3,000? These \"churches\" have lawyers on payrol (and arguably judges too) so they can defend themselves pretty well.",
      "timestamp": "2022-09-20 01:36:14",
      "score": 1,
      "num_children": 0,
      "author": 268984,
      "replies": []
    },
    {
      "id": "ip53tsp",
      "text": "A vote for the Republicans is a vote for the devil, that’s blasphemy he’s spouting.",
      "timestamp": "2022-09-20 01:37:10",
      "score": 1,
      "num_children": 0,
      "author": 261429,
      "replies": []
    },
    {
      "id": "ip540j0",
      "text": "What? These parasites can be held accountable to law? Let’s get it started!",
      "timestamp": "2022-09-20 01:38:36",
      "score": 1,
      "num_children": 0,
      "author": 167259,
      "replies": []
    },
    {
      "id": "ip543jo",
      "text": "So this guy is not actually a religious person. He is the devil",
      "timestamp": "2022-09-20 01:39:15",
      "score": 1,
      "num_children": 0,
      "author": 136710,
      "replies": []
    },
    {
      "id": "ip545tf",
      "text": "Has this ever actually worked? I see posts on Reddit to report these churches almost daily, but never once an article on a church losing its tax exempt status.",
      "timestamp": "2022-09-20 01:39:44",
      "score": 1,
      "num_children": 0,
      "author": 287743,
      "replies": []
    },
    {
      "id": "ip54xz3",
      "text": "[removed]",
      "timestamp": "2022-09-20 01:45:39",
      "score": 1,
      "num_children": 1,
      "replies": [
        {
          "id": "ip63jqp",
          "text": "Do you have a problem with fair and even application of laws?",
          "timestamp": "2022-09-20 07:57:55",
          "score": 1,
          "num_children": 0,
          "author": 318636,
          "replies": []
        }
      ]
    },
    {
      "id": "ip55hlx",
      "text": "Thia is the leader of the denomination [that tried to cover up decades of sexual abuse](https://www.npr.org/2022/06/02/1102621352/how-the-southern-baptist-convention-covered-up-its-widespread-sexual-abuse-scand) by people of authority within it's ranks. How could he not plead with people to only vote for Republicans?",
      "timestamp": "2022-09-20 01:49:49",
      "score": 1,
      "num_children": 1,
      "author": 279861,
      "replies": [
        {
          "id": "ip79xmg",
          "text": "As much as I dislike Mohler, this is not true.   \n\n\nAl Mohler is not, and has never been, the leader of the SBC. He is the President of our flagship seminary. The coverup was carried out by members of the Executive Committee of the SBC. There are a lot of guilty parties in the abuse scandal, but Mohler isn't one of them, and the vast majority of the 14.5 million members of the SBC aren't either. In fact, the messengers (lay representatives of member churches) have been proactive in addressing the scandal. They resolved in 2021 to have a third party investigate the coverup, and in 2022 to [encourage lawmakers to pass more consistent laws regarding pastoral abuse.](https://www.sbc.net/resource-library/resolutions/on-support-for-consistent-laws-regarding-pastoral-sexual-abuse/)",
          "timestamp": "2022-09-20 15:00:04",
          "score": 1,
          "num_children": 1,
          "author": 153673,
          "replies": [
            {
              "id": "ip7aou7",
              "text": "So, to be clear, the only part of my post that \"is not true\" is Mohler's position in the SBC hierarchy. I stand corrected.",
              "timestamp": "2022-09-20 15:05:06",
              "score": 1,
              "num_children": 1,
              "author": 279861,
              "replies": [
                {
                  "id": "ip7fu3p",
                  "text": "Unless you think that it's deceptive to attribute a coverup to 14.5 million people when the coverup was perpetrated by their leadership. While the perpetrators of the abuse and the cover-up were at at least 1000 (but probably more like 14000 by my estimation) southern baptists, the victims were at least 14.4 million southern baptists who were either abused or lied to.",
                  "timestamp": "2022-09-20 15:38:42",
                  "score": 1,
                  "num_children": 1,
                  "author": 153673,
                  "replies": [
                    {
                      "id": "ip7h5e8",
                      "text": "> Unless you think that it's deceptive to attribute a coverup to 14.5 million people when the coverup was perpetrated by their leadership\n\nWhich I didn't do. \n\nWhen I wrote \"the denomination that tried to cover up decades of sexual abuse by people of authority within it's ranks\", I'm *obviously* not saying that it is the 14.5 million members that did this, rather that it is the people with decision-making authority that did this.\n\nIf I say \"the United States invaded Iraq\", is this somehow deceptive because not all 300+ million people from the US went to Iraq?\n\nBut yes, I did get Mohler's position in the hierarchy wrong, so thanks for pointing that out.",
                      "timestamp": "2022-09-20 15:46:39",
                      "score": 1,
                      "num_children": 1,
                      "author": 279861,
                      "replies": [
                        {
                          "id": "ip7kusr",
                          "text": "I appreciate your clarification, and I think you've got a fair point, though it's comparing a public act that was supported by most Americans at the time to a secret act that's supported by almost no Southern Baptists.",
                          "timestamp": "2022-09-20 16:10:21",
                          "score": 1,
                          "num_children": 0,
                          "author": 153673,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip55idf",
      "text": "As a Christian, Republican policy is incompatible with my faith.",
      "timestamp": "2022-09-20 01:49:58",
      "score": 1,
      "num_children": 0,
      "author": 407368,
      "replies": []
    },
    {
      "id": "ip55yd7",
      "text": "And he is promptly called out about this by fellow Pastors\n\n>“Here we have a sitting president of an sbc (Southern Baptist Convention) seminary who is emphatically saying to vote ‘wrongly’ matters to God,” tweeted prominent Texas Pastor Dwight McKissic. “Voting ‘wrongly’ to Mohler means voting Dem. God is not a Dem or Republican. To imply that voting exclusively Republican is God’s choice defies Jhn. 18:36”",
      "timestamp": "2022-09-20 01:53:20",
      "score": 1,
      "num_children": 0,
      "author": 147955,
      "replies": []
    },
    {
      "id": "ip56jnx",
      "text": "That is some fucked up shit right there.",
      "timestamp": "2022-09-20 01:57:48",
      "score": 1,
      "num_children": 0,
      "author": 46536,
      "replies": []
    },
    {
      "id": "ip56k6q",
      "text": "Also Southern Baptists:.  Let's fuck a bunch of kids and cover it up just like the Catholics",
      "timestamp": "2022-09-20 01:57:55",
      "score": 1,
      "num_children": 0,
      "author": 8552,
      "replies": []
    },
    {
      "id": "ip56mvc",
      "text": "Some of that $80 billion earmarked for IRS should go towards a national crackdown on church tax status abusers. We all know it won't and we all know it should.",
      "timestamp": "2022-09-20 01:58:30",
      "score": 1,
      "num_children": 0,
      "author": 19604,
      "replies": []
    },
    {
      "id": "ip56pzw",
      "text": "I would actually argue Christians that DO vote Republican are unfaithful.",
      "timestamp": "2022-09-20 01:59:10",
      "score": 1,
      "num_children": 0,
      "author": 147823,
      "replies": []
    },
    {
      "id": "ip575sd",
      "text": "How the heck are baptists that don’t vote for GOP “unfaithful?”",
      "timestamp": "2022-09-20 02:02:30",
      "score": 1,
      "num_children": 0,
      "author": 105554,
      "replies": []
    },
    {
      "id": "ip576vy",
      "text": "He isn't a Real Christian anyways.",
      "timestamp": "2022-09-20 02:02:45",
      "score": 1,
      "num_children": 0,
      "author": 209225,
      "replies": []
    },
    {
      "id": "ip57br5",
      "text": "Is he 501c3?",
      "timestamp": "2022-09-20 02:03:48",
      "score": 1,
      "num_children": 1,
      "author": 49505,
      "replies": [
        {
          "id": "ip5ev0s",
          "text": "People aren't 501c3, but some organizations are.",
          "timestamp": "2022-09-20 03:05:17",
          "score": 1,
          "num_children": 1,
          "author": 211979,
          "replies": [
            {
              "id": "ip8r0xy",
              "text": "That's what I was asking. Johnson Ammendment only applies to 501c3",
              "timestamp": "2022-09-20 20:38:32",
              "score": 1,
              "num_children": 1,
              "author": 49505,
              "replies": [
                {
                  "id": "ip9bvjc",
                  "text": "Well, despite how the OP worded things, Al Mohler is not the leader of the Southern Baptist Convention. He *used to be* their leader. It would be hard to argue in court that the Southern Baptist Churches as a whole lose their 501c3 statuses because a former president of the Southern Baptist Convention got political.",
                  "timestamp": "2022-09-20 23:02:15",
                  "score": 1,
                  "num_children": 0,
                  "author": 211979,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip57g3i",
      "text": "I don't get no respect",
      "timestamp": "2022-09-20 02:04:43",
      "score": 1,
      "num_children": 0,
      "author": 37490,
      "replies": []
    },
    {
      "id": "ip57hd1",
      "text": "Almost no one is ever prosecuted for this\n\nFor example the VP sent videos to play at churches telling folks who to vote for:\n\nhttps://abcnews4.com/news/nation-world/experts-say-kamala-harris-church-video-supporting-virginia-democrat-may-be-illegal",
      "timestamp": "2022-09-20 02:05:00",
      "score": 1,
      "num_children": 0,
      "author": 163858,
      "replies": []
    },
    {
      "id": "ip580ci",
      "text": "Tax all churches that push political agendas.  We need to pay off our debts somehow.",
      "timestamp": "2022-09-20 02:09:14",
      "score": 1,
      "num_children": 0,
      "author": 159665,
      "replies": []
    },
    {
      "id": "ip58e7x",
      "text": "The actual language used did not violate anything that is in the Johnson act. No endorsements or opposition to candidates was used. Stating that Christians should vote for candidates that align with their faith is not a violation.",
      "timestamp": "2022-09-20 02:12:24",
      "score": 1,
      "num_children": 1,
      "author": 288012,
      "replies": [
        {
          "id": "ip5dw72",
          "text": "Republicans are money worshippers. \n\nJesus says that’s anti Christian.",
          "timestamp": "2022-09-20 02:57:14",
          "score": 1,
          "num_children": 1,
          "author": 276061,
          "replies": [
            {
              "id": "ip9puq5",
              "text": "🤣 I guess. I'm pretty sure money worship extends to both sides quite fluidly. Still not seeing how this guy's statement violates any laws. I'm not seeing the difference in what he's implying versus black pastors using their forum to imply voting democrat because it best aligns with their community values. You could argue the hypocrisy of the statements but I don't really see how you can argue the legality.",
              "timestamp": "2022-09-21 00:48:08",
              "score": 1,
              "num_children": 0,
              "author": 288012,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip58haj",
      "text": "God didn't say that.",
      "timestamp": "2022-09-20 02:13:06",
      "score": 1,
      "num_children": 0,
      "author": 241848,
      "replies": []
    },
    {
      "id": "ip58i55",
      "text": "Seriously, revoke it.",
      "timestamp": "2022-09-20 02:13:18",
      "score": 1,
      "num_children": 0,
      "author": 311960,
      "replies": []
    },
    {
      "id": "ip58igg",
      "text": "Al Mohler is not the #1 leader of Southern Baptists. He is one of six seminary presidents. He holds no actual position of leadership in the denomination itself, and the president, Bart Barber, has not said anything remotely like this.",
      "timestamp": "2022-09-20 02:13:22",
      "score": 1,
      "num_children": 0,
      "author": 101181,
      "replies": []
    },
    {
      "id": "ip58jke",
      "text": "To call him the #1 leader of southern baptists is extremely misleading when he’s just the leader of some seminary of baptist “practice” who happens to also live in the south.",
      "timestamp": "2022-09-20 02:13:38",
      "score": 1,
      "num_children": 1,
      "author": 55541,
      "replies": [
        {
          "id": "ip7acnu",
          "text": "Not quite true. He's the president of The Southern Baptist Theological Seminary, which is the flagship seminary of the Southern Baptist Convention. That said, he has no formal power within the convention itself.",
          "timestamp": "2022-09-20 15:02:49",
          "score": 1,
          "num_children": 1,
          "author": 153673,
          "replies": [
            {
              "id": "ip7j9zm",
              "text": "That’s fair enough, I just had never heard of him and if he’s the leader of southern baptists I would’ve definitely heard at least of his name as someone who grew up in a southern Baptist church lmao",
              "timestamp": "2022-09-20 16:00:16",
              "score": 1,
              "num_children": 1,
              "author": 55541,
              "replies": [
                {
                  "id": "ip7lpiy",
                  "text": ">if he’s the leader of southern baptists I would’ve definitely heard at least of his name\n\nWell, that's where you're probably wrong. Al Mohler is easily more famous than any of the other recent presidents, with maybe J.D. Greear being the exception. Fred Luter? Ronnie Floyd? Steve Gaines? Ed Litton? These presidents of the SBC are virtually unknown even to most members of SBC churches. This is because the SBC president is a largely ceremonial role and has very little power, even executive.",
                  "timestamp": "2022-09-20 16:15:48",
                  "score": 1,
                  "num_children": 1,
                  "author": 153673,
                  "replies": [
                    {
                      "id": "ip7qiqy",
                      "text": "Claiming someone is the #1 leader of an entire religious sector, you’d think more people in that sector would’ve heard of him. That’s all I’m saying.",
                      "timestamp": "2022-09-20 16:45:53",
                      "score": 1,
                      "num_children": 0,
                      "author": 55541,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip58pvh",
      "text": "This BS cracks me up. I think these church leaders have forgotten that there were NO Republicans or Democrats during Jesus' time on Earth. Hell, the US didn't exist as a country then. But hey, they scream, God, guns and glory every damn day.",
      "timestamp": "2022-09-20 02:15:04",
      "score": 1,
      "num_children": 0,
      "author": 170664,
      "replies": []
    },
    {
      "id": "ip58t8d",
      "text": "I don't know how this ended up being a notification for me on Reddit as I am not really a part of the atheism community (I am proudly a devout Christian), but I can gladly say that this guy is an idiot and I profusely reject his hypocrisy and will NEVER associate myself with the Southern Baptists again so long as they hold views such as these. My Christian belief is between God and myself and a denomination will not stand between me and my own salvation. This man is doing great harm to the church with commentary like that and I absolutely believe Jesus would not stand for such. Not that I believe Jesus would have supported Donald Trump either... there is a massive problem of Christian nationalism these days that distort and truly utterly twist the message of my faith into one of hatred, bigotry, and violence. And please, I know there will be some redditors who participate in a community like this who will gladly hate on my religion and make some snide remark, but hopefully you can hold your tongue as I am not insulting your beliefs, so please do not reply to my comment and try to engage with an insult to mine. I'm ultimately agreeing with this post based on the behavior of some leaders in some denominations/communities.",
      "timestamp": "2022-09-20 02:15:47",
      "score": 1,
      "num_children": 1,
      "author": 150941,
      "replies": [
        {
          "id": "ip7amsd",
          "text": ">so long as they hold views such as these\n\n\"we\" don't believe this. The only rule for the SBC is the [Baptist Faith and Message](https://bfm.sbc.net/). Al Mohler is the head of one of our six seminaries and doesn't speak for all 14.5 million Southern Baptists.",
          "timestamp": "2022-09-20 15:04:43",
          "score": 1,
          "num_children": 1,
          "author": 153673,
          "replies": [
            {
              "id": "ip7q1kr",
              "text": "Thanks great to hear and thank you for clearing that up.",
              "timestamp": "2022-09-20 16:42:57",
              "score": 1,
              "num_children": 0,
              "author": 150941,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip5945z",
      "text": "Jesus wept.",
      "timestamp": "2022-09-20 02:18:08",
      "score": 1,
      "num_children": 0,
      "author": 92076,
      "replies": []
    },
    {
      "id": "ip594wn",
      "text": "As a Christian I support taxing churches that openly support a party",
      "timestamp": "2022-09-20 02:18:18",
      "score": 1,
      "num_children": 0,
      "author": 325627,
      "replies": []
    },
    {
      "id": "ip59ba6",
      "text": "These are cults",
      "timestamp": "2022-09-20 02:19:44",
      "score": 1,
      "num_children": 0,
      "author": 21251,
      "replies": []
    },
    {
      "id": "ip59bc2",
      "text": "That isn't a thing anymore. Not since 2018.",
      "timestamp": "2022-09-20 02:19:45",
      "score": 1,
      "num_children": 0,
      "author": 146264,
      "replies": []
    },
    {
      "id": "ip59liu",
      "text": "Get outta here",
      "timestamp": "2022-09-20 02:22:00",
      "score": 1,
      "num_children": 0,
      "author": 121492,
      "replies": []
    },
    {
      "id": "ip59zqc",
      "text": "I'm a Christian and find this disturbing.  Jesus wasn't a Republican, does that mean he was \"unfaithful\"?  Give me a break.",
      "timestamp": "2022-09-20 02:25:09",
      "score": 1,
      "num_children": 0,
      "author": 60806,
      "replies": []
    },
    {
      "id": "ip59zxg",
      "text": "Revoke our tax exempt status, I dare you. Then full blown election mode every week on the pulpit is what will happen.",
      "timestamp": "2022-09-20 02:25:12",
      "score": 1,
      "num_children": 0,
      "author": 2000,
      "replies": []
    },
    {
      "id": "ip5a2nr",
      "text": "Don't like what Mohler said, but he's not the #1 leader of the SBC. This is a bad title.",
      "timestamp": "2022-09-20 02:25:49",
      "score": 1,
      "num_children": 0,
      "author": 366035,
      "replies": []
    },
    {
      "id": "ip5aijq",
      "text": "So has any church actually had their tax exempt status revoked in the past few years?",
      "timestamp": "2022-09-20 02:29:21",
      "score": 1,
      "num_children": 0,
      "author": 280120,
      "replies": []
    },
    {
      "id": "ip5akkq",
      "text": "As if the one employee at the IRS has time to pursue every violation of tax law by a rich person.",
      "timestamp": "2022-09-20 02:29:47",
      "score": 1,
      "num_children": 0,
      "author": 205941,
      "replies": []
    },
    {
      "id": "ip5aqa0",
      "text": "I think all churches need to pay income and property tax like the rest of us and get deductions for proving their charity. It is obscene for ministers at the gigantic ministries to be driving Rolls', owning multimillion dollar homes and etc. but it is just as obscene for the churches to hold land and not pay fair taxes.",
      "timestamp": "2022-09-20 02:30:58",
      "score": 1,
      "num_children": 1,
      "author": 197436,
      "replies": [
        {
          "id": "ip5bf4l",
          "text": "Same for nonprofits all together. And businesses as a whole. And the 40-50 percent of all people that don’t pay any federal income tax. Let’s not just focus on churches. The whole system is fucked up.",
          "timestamp": "2022-09-20 02:36:34",
          "score": 1,
          "num_children": 0,
          "author": 216430,
          "replies": []
        }
      ]
    },
    {
      "id": "ip5bejg",
      "text": "Yes please!!",
      "timestamp": "2022-09-20 02:36:27",
      "score": 1,
      "num_children": 0,
      "author": 406085,
      "replies": []
    },
    {
      "id": "ip5bf15",
      "text": "Are seminaries taxed? And is he associated with a church or just the seminary?",
      "timestamp": "2022-09-20 02:36:33",
      "score": 1,
      "num_children": 0,
      "author": 215023,
      "replies": []
    },
    {
      "id": "ip5bi2f",
      "text": "Isn’t this the same southern Baptist church that had a massive priest sexual scandal a few months back? I’m not an atheist, but it’s more than a bit hypocritical to come back and talk about unfaithfulness after that load of crap",
      "timestamp": "2022-09-20 02:37:13",
      "score": 1,
      "num_children": 0,
      "author": 203772,
      "replies": []
    },
    {
      "id": "ip5c5n3",
      "text": "A nation of laws! That’s all we have",
      "timestamp": "2022-09-20 02:42:35",
      "score": 1,
      "num_children": 0,
      "author": 268738,
      "replies": []
    },
    {
      "id": "ip5cacb",
      "text": "All of Assemblies of God (responsible for pretty much every evil person you can think of) should have their tax exempt status revoked, since the 70s.",
      "timestamp": "2022-09-20 02:43:41",
      "score": 1,
      "num_children": 0,
      "author": 361123,
      "replies": []
    },
    {
      "id": "ip5calo",
      "text": "It’s not a violation of the Johnson amendment. That law states that a 501(c) cannot engage in “political campaign activity”.  They can certainly preach about politics from the pulpit regardless if you or I agree with their opinion",
      "timestamp": "2022-09-20 02:43:45",
      "score": 1,
      "num_children": 0,
      "author": 101662,
      "replies": []
    },
    {
      "id": "ip5ccjr",
      "text": "How many churches has the IRS revoked Tax Exempt status for? I tried looking it up but couldn't find it. I feel like the number is less than a dozen over the last 20 years.",
      "timestamp": "2022-09-20 02:44:14",
      "score": 1,
      "num_children": 0,
      "author": 326187,
      "replies": []
    },
    {
      "id": "ip5cmxe",
      "text": "Q",
      "timestamp": "2022-09-20 02:46:41",
      "score": 1,
      "num_children": 0,
      "author": 391794,
      "replies": []
    },
    {
      "id": "ip5cmxs",
      "text": "Oh my god. When did it ever say in the BIBLE or the CATECHISIM to vote republican. I NEVER LEARNED THIS IN MY THEOLOGY CLASS",
      "timestamp": "2022-09-20 02:46:41",
      "score": 1,
      "num_children": 0,
      "author": 82875,
      "replies": []
    },
    {
      "id": "ip5coiz",
      "text": "\"HATE THE UNWORTHY\" - Osama Bin Mohler",
      "timestamp": "2022-09-20 02:47:04",
      "score": 1,
      "num_children": 0,
      "author": 129226,
      "replies": []
    },
    {
      "id": "ip5cosk",
      "text": "OK, let's see what secrets this \"Southern Baptists\" is hiding in his closet, underage massage room, overseas bank account, and yacht full of coke in his private island.",
      "timestamp": "2022-09-20 02:47:08",
      "score": 1,
      "num_children": 0,
      "author": 221318,
      "replies": []
    },
    {
      "id": "ip5d2au",
      "text": "This is why they’re TERRIFIED of the increased IRS funding",
      "timestamp": "2022-09-20 02:50:17",
      "score": 1,
      "num_children": 0,
      "author": 37572,
      "replies": []
    },
    {
      "id": "ip5dni6",
      "text": "So… cult.",
      "timestamp": "2022-09-20 02:55:11",
      "score": 1,
      "num_children": 0,
      "author": 186587,
      "replies": []
    },
    {
      "id": "ip5do2i",
      "text": "Anybody who believes in this kind of constitutional bullshit is deluded.",
      "timestamp": "2022-09-20 02:55:19",
      "score": 1,
      "num_children": 0,
      "author": 91374,
      "replies": []
    },
    {
      "id": "ip5doww",
      "text": "Tax them Motherfuckers!!!!",
      "timestamp": "2022-09-20 02:55:31",
      "score": 1,
      "num_children": 0,
      "author": 101029,
      "replies": []
    },
    {
      "id": "ip5dt22",
      "text": "There are many more; how about all of them?",
      "timestamp": "2022-09-20 02:56:29",
      "score": 1,
      "num_children": 0,
      "author": 330659,
      "replies": []
    },
    {
      "id": "ip5dt9c",
      "text": "Joke’s on you, dumbass. Republicans worship money. \n\nAnd Jesus says that makes you not Christian.\n\nBlaspheming trash.",
      "timestamp": "2022-09-20 02:56:32",
      "score": 1,
      "num_children": 0,
      "author": 276061,
      "replies": []
    },
    {
      "id": "ip5dzlx",
      "text": "On a serious note, is there something we average Americans can do to report, protest, & of course always vote, but don’t say politicians because that won’t ever happen, but what can we, I do to get their tax exempt status revoked?",
      "timestamp": "2022-09-20 02:58:02",
      "score": 1,
      "num_children": 0,
      "author": 101029,
      "replies": []
    },
    {
      "id": "ip5e62c",
      "text": "Confidently incorrect lol",
      "timestamp": "2022-09-20 02:59:27",
      "score": 1,
      "num_children": 0,
      "author": 206363,
      "replies": []
    },
    {
      "id": "ip5ei6t",
      "text": "They won’t do anything\n\n[https://www.natlawreview.com/article/president-trump-signs-johnson-amendment-executive-order-limiting-treasury-s-actions](https://www.natlawreview.com/article/president-trump-signs-johnson-amendment-executive-order-limiting-treasury-s-actions)",
      "timestamp": "2022-09-20 03:02:09",
      "score": 1,
      "num_children": 0,
      "author": 209800,
      "replies": []
    },
    {
      "id": "ip5es68",
      "text": "There’s a curious lack of compassion from the religious in this country.",
      "timestamp": "2022-09-20 03:04:34",
      "score": 1,
      "num_children": 0,
      "author": 91539,
      "replies": []
    },
    {
      "id": "ip5frmy",
      "text": "Ya know, there is a federal separation of church and state, do you?",
      "timestamp": "2022-09-20 03:13:20",
      "score": 1,
      "num_children": 0,
      "author": 30347,
      "replies": []
    },
    {
      "id": "ip5g04r",
      "text": "If God existed he would do more to defend his reputation from these people.",
      "timestamp": "2022-09-20 03:15:28",
      "score": 1,
      "num_children": 0,
      "author": 162770,
      "replies": []
    },
    {
      "id": "ip5g7j5",
      "text": "if you use a fictional diety and a book of plays to make a voting decision, then stay home.",
      "timestamp": "2022-09-20 03:17:19",
      "score": 1,
      "num_children": 0,
      "author": 65658,
      "replies": []
    },
    {
      "id": "ip5gncx",
      "text": "Where is the separation of church and government in the states , what a crock of shit the republicans are.",
      "timestamp": "2022-09-20 03:21:18",
      "score": 1,
      "num_children": 0,
      "author": 164129,
      "replies": []
    },
    {
      "id": "ip5h1wm",
      "text": "He’d better be focusing on this instead:\n\nhttps://www.cnn.com/2022/05/23/us/southern-baptist-convention-sexual-abuse-allegations-report/index.html",
      "timestamp": "2022-09-20 03:25:00",
      "score": 1,
      "num_children": 0,
      "author": 299197,
      "replies": []
    },
    {
      "id": "ip5h2ga",
      "text": "There absolutely needs to be more punishment against these shit asses",
      "timestamp": "2022-09-20 03:25:09",
      "score": 1,
      "num_children": 0,
      "author": 388702,
      "replies": []
    },
    {
      "id": "ip5h3dq",
      "text": "Someone fill out the paperwork.  There is a form for this.",
      "timestamp": "2022-09-20 03:25:22",
      "score": 1,
      "num_children": 0,
      "author": 112552,
      "replies": []
    },
    {
      "id": "ip5hjc1",
      "text": "The SBC is such a nightmare, in every way",
      "timestamp": "2022-09-20 03:29:29",
      "score": 1,
      "num_children": 0,
      "author": 91382,
      "replies": []
    },
    {
      "id": "ip5hr2k",
      "text": "Well I agree this is bullshit, my understanding is this is not in violation of any law. Unless they endorse a specific candidate there's no issue legally.\n\nHeres some sillyness\n\nhttps://m.youtube.com/watch?v=_GdEKvZ5q4Q",
      "timestamp": "2022-09-20 03:31:29",
      "score": 1,
      "num_children": 0,
      "author": 9491,
      "replies": []
    },
    {
      "id": "ip5i2dl",
      "text": "Southern baptists don’t have a leader, this isnt the Catholic Church",
      "timestamp": "2022-09-20 03:34:25",
      "score": 1,
      "num_children": 0,
      "author": 140621,
      "replies": []
    },
    {
      "id": "ip5iaoi",
      "text": "Mohler is influential to be sure, but he's not the '#1 leader' of the SBC.  \n  \nSadly, for Bible-believing Christians like myself, Mohler has his positions routinely challenged and defeated by various vote measures at the national convention in recent years.  \n  \nThe SBC is actually lurching more and more into 'Wokeness' every year.  \n  \nFWIW",
      "timestamp": "2022-09-20 03:36:38",
      "score": 1,
      "num_children": 0,
      "author": 349704,
      "replies": []
    },
    {
      "id": "ip5j7sa",
      "text": "\"Conservative Christianity\" has always been an abomination of desolation.\n\nI'll still never forgive them for murdering Hypatia with seashells and all the misery they've brought to humanity since.",
      "timestamp": "2022-09-20 03:45:39",
      "score": 1,
      "num_children": 0,
      "author": 369382,
      "replies": []
    },
    {
      "id": "ip5je2t",
      "text": "My parents having a visit with my in-laws back when Obama was running for re-election and heard that my dad flat out told them that if they voted for Obama then they were going to hell. I can imagine a hint of facetiousness in his voice, but I can also imagine 100% seriousness. \n\nWe umm… don’t talk much.",
      "timestamp": "2022-09-20 03:47:22",
      "score": 1,
      "num_children": 0,
      "author": 327304,
      "replies": []
    },
    {
      "id": "ip5jfa9",
      "text": "Title is a little misleading, he’s the president of Souther Baptist Theological Seminary, a college in Kentucky. Still revoke his status though.",
      "timestamp": "2022-09-20 03:47:42",
      "score": 1,
      "num_children": 0,
      "author": 24142,
      "replies": []
    },
    {
      "id": "ip5jil6",
      "text": "You guys remember when Trump lost and there were all these lunatic pastors praying for God Emperor Trump to be \"re-enstated\"? Good times. All the weeping, speaking in tongues...Brought me great joy.",
      "timestamp": "2022-09-20 03:48:37",
      "score": 1,
      "num_children": 0,
      "author": 391082,
      "replies": []
    },
    {
      "id": "ip5jz86",
      "text": "Tax the shit out of all church",
      "timestamp": "2022-09-20 03:53:13",
      "score": 1,
      "num_children": 0,
      "author": 354036,
      "replies": []
    },
    {
      "id": "ip5kaf3",
      "text": "Julie Roys is a hero, actually doing God’s work",
      "timestamp": "2022-09-20 03:56:24",
      "score": 1,
      "num_children": 0,
      "author": 177751,
      "replies": []
    },
    {
      "id": "ip5keax",
      "text": "Crosspost this over to r/churchaudits",
      "timestamp": "2022-09-20 03:57:31",
      "score": 1,
      "num_children": 0,
      "author": 316921,
      "replies": []
    },
    {
      "id": "ip5kv87",
      "text": "The Johnson amendment is a little more specific than this, I think it has to be down to the specific person rather than the party.",
      "timestamp": "2022-09-20 04:02:17",
      "score": 1,
      "num_children": 0,
      "author": 219126,
      "replies": []
    },
    {
      "id": "ip5m80t",
      "text": "Foreigner here? Why are they tax exempt?",
      "timestamp": "2022-09-20 04:16:23",
      "score": 1,
      "num_children": 0,
      "author": 52358,
      "replies": []
    },
    {
      "id": "ip5mtwy",
      "text": "I thought that was Rodney Dangerfield at first",
      "timestamp": "2022-09-20 04:22:48",
      "score": 1,
      "num_children": 0,
      "author": 342773,
      "replies": []
    },
    {
      "id": "ip5nsz7",
      "text": "Tax the fuck out of the churches!",
      "timestamp": "2022-09-20 04:33:44",
      "score": 1,
      "num_children": 0,
      "author": 342326,
      "replies": []
    },
    {
      "id": "ip5ogr5",
      "text": "Half the IRS probably agrees. I hear it's full of Mormons.",
      "timestamp": "2022-09-20 04:41:09",
      "score": 1,
      "num_children": 0,
      "author": 336101,
      "replies": []
    },
    {
      "id": "ip5on64",
      "text": "“Republican” isn’t a specific candidate, I don’t think it counts. Kinda like family values and other fluff Pieces. You can walk up to the line and not cross it, but they’ll know what to do once they get to the booth.",
      "timestamp": "2022-09-20 04:43:12",
      "score": 1,
      "num_children": 0,
      "author": 112193,
      "replies": []
    },
    {
      "id": "ip5onj9",
      "text": "Really seems like the Republican Party is just the sugar coated version of the nazi party now",
      "timestamp": "2022-09-20 04:43:19",
      "score": 1,
      "num_children": 0,
      "author": 27601,
      "replies": []
    },
    {
      "id": "ip5ooc4",
      "text": "Let's just revoke tax exempt status in perpetuity.",
      "timestamp": "2022-09-20 04:43:34",
      "score": 1,
      "num_children": 0,
      "author": 121347,
      "replies": []
    },
    {
      "id": "ip5pqr3",
      "text": "How much better would this world be if people didn't believe in bunch of glitter hovering invisibly over them at all times",
      "timestamp": "2022-09-20 04:55:41",
      "score": 1,
      "num_children": 0,
      "author": 229632,
      "replies": []
    },
    {
      "id": "ip5qyj1",
      "text": "The IRS won't do anything of the sort.\n\nNope.",
      "timestamp": "2022-09-20 05:09:54",
      "score": 1,
      "num_children": 0,
      "author": 31507,
      "replies": []
    },
    {
      "id": "ip5tcoo",
      "text": "He can't get no respect...no respect I tells ya!",
      "timestamp": "2022-09-20 05:38:36",
      "score": 1,
      "num_children": 0,
      "author": 123439,
      "replies": []
    },
    {
      "id": "ip5tu2l",
      "text": "This is why the admin is trying to boost IRS employees.",
      "timestamp": "2022-09-20 05:44:29",
      "score": 1,
      "num_children": 0,
      "author": 409481,
      "replies": []
    },
    {
      "id": "ip5u35b",
      "text": "The Johnson Amendment is an addition, adopted in 1954, to the Internal Revenue Code, 501(c)(3).  As a condition for maintaining exception from income taxes and other taxes, charitable organizations including churches and affiliated groups, were forbidden from participating or intervening in “any political campaign on behalf of (or in opposition to) any candidate for public office”",
      "timestamp": "2022-09-20 05:47:40",
      "score": 1,
      "num_children": 0,
      "author": 253133,
      "replies": []
    },
    {
      "id": "ip5ucfh",
      "text": "This guy looks like he gets no respect, no respect at all lol",
      "timestamp": "2022-09-20 05:50:54",
      "score": 1,
      "num_children": 0,
      "author": 276279,
      "replies": []
    },
    {
      "id": "ip5wec2",
      "text": "Honestly, by the metrics of their own faith, most Christian preachers and pastors are antichrists. They act, and get others to act, in a manner that is not consistent with the teachings of Christ.",
      "timestamp": "2022-09-20 06:17:35",
      "score": 1,
      "num_children": 0,
      "author": 278734,
      "replies": []
    },
    {
      "id": "ip5z6b7",
      "text": "Churches are cults in modern times. Don’t ‘kid’ yourself",
      "timestamp": "2022-09-20 06:54:39",
      "score": 1,
      "num_children": 0,
      "author": 29236,
      "replies": []
    },
    {
      "id": "ip5za1r",
      "text": " Slap them with so much back tax dues that they can't give anything to their Republican buddies.",
      "timestamp": "2022-09-20 06:56:03",
      "score": 1,
      "num_children": 0,
      "author": 311934,
      "replies": []
    },
    {
      "id": "ip5zjpb",
      "text": "They should rename their church, \"The Holy Crap Trump Church\".",
      "timestamp": "2022-09-20 06:59:46",
      "score": 1,
      "num_children": 0,
      "author": 323640,
      "replies": []
    },
    {
      "id": "ip602m7",
      "text": "This guy looks just like Rodney Dangerfield.",
      "timestamp": "2022-09-20 07:06:52",
      "score": 1,
      "num_children": 0,
      "author": 207588,
      "replies": []
    },
    {
      "id": "ip61ul8",
      "text": " Get em! (And update us!)",
      "timestamp": "2022-09-20 07:32:25",
      "score": 1,
      "num_children": 0,
      "author": 116295,
      "replies": []
    },
    {
      "id": "ip64f6x",
      "text": "And christians who are not catholic or orthodox are unfaithful. (/s)",
      "timestamp": "2022-09-20 08:11:08",
      "score": 1,
      "num_children": 0,
      "author": 105028,
      "replies": []
    },
    {
      "id": "ip659nq",
      "text": "Make sure you do the same for the nation of Islam too. This guys are nuts!",
      "timestamp": "2022-09-20 08:24:15",
      "score": 1,
      "num_children": 0,
      "author": 98790,
      "replies": []
    },
    {
      "id": "ip65eg7",
      "text": "Vote then. You don't vote do you. I hate Republicans but they vote. Not you too cool for school atheists.",
      "timestamp": "2022-09-20 08:26:20",
      "score": 1,
      "num_children": 0,
      "author": 150543,
      "replies": []
    },
    {
      "id": "ip65i47",
      "text": "Better to complain than let that sand out your holes. \n\nGo vote. Speak up where it matters. \n\nGod damn you act like children",
      "timestamp": "2022-09-20 08:27:56",
      "score": 1,
      "num_children": 0,
      "author": 150543,
      "replies": []
    },
    {
      "id": "ip674w0",
      "text": "You can report that violation to the IRS",
      "timestamp": "2022-09-20 08:53:05",
      "score": 1,
      "num_children": 1,
      "author": 139119,
      "replies": [
        {
          "id": "ip75sss",
          "text": "You can report it, but they won't do anything about it.  I've been trying to find the last time the IRS actually revoked a church's tax-exempt status for partisan political activity.  I found one instance of it being done in 1992...",
          "timestamp": "2022-09-20 14:32:39",
          "score": 1,
          "num_children": 0,
          "author": 178902,
          "replies": []
        }
      ]
    },
    {
      "id": "ip67cdq",
      "text": "i mean, yes? They forged the party into a part of their religion like 40 years ago. Why are people surprised by this? The IRS hasn't done anything about it for nearly half a century, they certainly wont start now.",
      "timestamp": "2022-09-20 08:56:18",
      "score": 1,
      "num_children": 0,
      "author": 135660,
      "replies": []
    },
    {
      "id": "ip6ds4z",
      "text": "Hypocrites and pharisees. Jesus said A LOT about these people specifically. It's as of these fucks modeled their lives being exactly the things Jesus warned people from following.\n\nWell, they have their place laid out for them.",
      "timestamp": "2022-09-20 10:28:05",
      "score": 1,
      "num_children": 0,
      "author": 272461,
      "replies": []
    },
    {
      "id": "ip6fnlw",
      "text": "He's president of a seminary, not the actual denomination.",
      "timestamp": "2022-09-20 10:51:14",
      "score": 1,
      "num_children": 0,
      "author": 32935,
      "replies": []
    },
    {
      "id": "ip6hun8",
      "text": "It still blows my mind that anyone is stupid/foolish enough to hear the acts/teachings of Jesus in their book then turn to Republicans (or FFS Trump, who embodies the polar opposite...) And think to themselves \"yeah that's the Christian way to go\"\n\nI know that it isn't all Christians, I have a father who knows how to use his brain and realizes this is corrupt as fuck political figures using religion as a stepping stool for power... But far FAR too many people have had their faith utilized against them..\n\nI ain't even religious... I grew up in a Christian household but seeing the massive corruption in the shocking large number of churches broke me of that in my early teens even before all the politics really bkatentky rooted themselves publicly like this.",
      "timestamp": "2022-09-20 11:16:23",
      "score": 1,
      "num_children": 0,
      "author": 52939,
      "replies": []
    },
    {
      "id": "ip6o7vl",
      "text": "Religion and politics in the US are both regressive piles of shit, quite frankly.",
      "timestamp": "2022-09-20 12:18:51",
      "score": 1,
      "num_children": 0,
      "author": 195366,
      "replies": []
    },
    {
      "id": "ip6omhr",
      "text": "Tithe cucks lol",
      "timestamp": "2022-09-20 12:22:24",
      "score": 1,
      "num_children": 0,
      "author": 296936,
      "replies": []
    },
    {
      "id": "ip6wjqg",
      "text": "This is the only way to get these \"religious politicians\" to stop with this bullshit. The only thing they care about is money. Have fun giving your god money to the govt. SMFH. Is Christianity the only religion where they shove it down your throat? Believe in some invisible fictional \"being\" in the sky all you want. I don't want to hear about it. Quit trying to \"save\" everyone and worry about yourself you stupid piece of shit. You want to stop grooming pedos? start with the church.",
      "timestamp": "2022-09-20 13:26:56",
      "score": 1,
      "num_children": 0,
      "author": 408504,
      "replies": []
    },
    {
      "id": "ip6x95l",
      "text": "Can't we sue the IRS for not enforcing this?",
      "timestamp": "2022-09-20 13:32:11",
      "score": 1,
      "num_children": 0,
      "author": 101656,
      "replies": []
    },
    {
      "id": "ip6ya0l",
      "text": "Seriously, how do we make this happen?",
      "timestamp": "2022-09-20 13:39:49",
      "score": 1,
      "num_children": 0,
      "author": 89515,
      "replies": []
    },
    {
      "id": "ip79bph",
      "text": "This Isn't new. This why I stopped going to church over 15 years ago. The day they started telling me how to vote was the day the church lost credibility for me.",
      "timestamp": "2022-09-20 14:56:01",
      "score": 1,
      "num_children": 0,
      "author": 15089,
      "replies": []
    },
    {
      "id": "ip79kuq",
      "text": "Jesus loves fascism, apparently.",
      "timestamp": "2022-09-20 14:57:43",
      "score": 1,
      "num_children": 0,
      "author": 250645,
      "replies": []
    },
    {
      "id": "ip7ah0q",
      "text": "Seriously Jesus fucking Christ we need some real law and order in this country and it starts with holding people and organizations accountable for what they do. Sick of this bullshit",
      "timestamp": "2022-09-20 15:03:38",
      "score": 1,
      "num_children": 0,
      "author": 298304,
      "replies": []
    },
    {
      "id": "ip7bj1q",
      "text": "So if a Muslim doesn't kill a cartoonists who draws the Prophet Meh ham ed...are they unfaithful?",
      "timestamp": "2022-09-20 15:10:38",
      "score": 1,
      "num_children": 0,
      "author": 307175,
      "replies": []
    },
    {
      "id": "ip7bzjl",
      "text": "Sorry kids, but this is freedom of speech.  Also, read up on the establishment clause.",
      "timestamp": "2022-09-20 15:13:38",
      "score": 1,
      "num_children": 0,
      "author": 359720,
      "replies": []
    },
    {
      "id": "ip7c0ll",
      "text": "My neighbor listens to christian radio on the weekends very loudly. They spend SO much time talking about the IRS and basically massaging other trending political stuff into their listeners, whole time I was pooping they never talked about bible stuff.",
      "timestamp": "2022-09-20 15:13:49",
      "score": 1,
      "num_children": 0,
      "author": 391883,
      "replies": []
    },
    {
      "id": "ip7khbh",
      "text": "The more this shit happens, the more their politicians run on revoking the Johnson Amendment.",
      "timestamp": "2022-09-20 16:07:57",
      "score": 1,
      "num_children": 0,
      "author": 79507,
      "replies": []
    },
    {
      "id": "ip7vr57",
      "text": "What should be done and what actually will be done are very different. Should they be taxed? Absolutely. Will they? Never.",
      "timestamp": "2022-09-20 17:18:26",
      "score": 1,
      "num_children": 0,
      "author": 360751,
      "replies": []
    },
    {
      "id": "ip81zee",
      "text": "You mean the church that broke off from the rest of the Baptist cause they still wanted to defend slavery?",
      "timestamp": "2022-09-20 17:57:20",
      "score": 1,
      "num_children": 0,
      "author": 3991,
      "replies": []
    },
    {
      "id": "ip85q59",
      "text": "Christians who vote Republican are not real Christians. They are anti christ’s message.",
      "timestamp": "2022-09-20 18:21:33",
      "score": 1,
      "num_children": 0,
      "author": 173680,
      "replies": []
    },
    {
      "id": "ip8az1b",
      "text": "Oh please, seriously, please make them have to pay taxes! Maybe the water in MS could be fixed then!",
      "timestamp": "2022-09-20 18:56:00",
      "score": 1,
      "num_children": 0,
      "author": 301916,
      "replies": []
    },
    {
      "id": "ip8d6ui",
      "text": "Smh.... we are doomed as people..I could go on and on about this!!!!",
      "timestamp": "2022-09-20 19:10:23",
      "score": 1,
      "num_children": 0,
      "author": 322175,
      "replies": []
    },
    {
      "id": "ip8jz3m",
      "text": "I'm so tired of the Southern Baptist Church having the power that they do in our society.",
      "timestamp": "2022-09-20 19:53:30",
      "score": 1,
      "num_children": 0,
      "author": 260203,
      "replies": []
    },
    {
      "id": "ip8litx",
      "text": "Like I’m going to let this Rodney Dangerfield wannabe tell me what Christianity looks like.",
      "timestamp": "2022-09-20 20:03:25",
      "score": 1,
      "num_children": 0,
      "author": 187326,
      "replies": []
    },
    {
      "id": "ip8ltob",
      "text": "The IRS only has to do this one time and make a big show of it and the rest of those greedy fuckers will shut up because their “love of God“ ends when their bottom line is threatened",
      "timestamp": "2022-09-20 20:05:21",
      "score": 1,
      "num_children": 0,
      "author": 251273,
      "replies": []
    },
    {
      "id": "ip8qu2i",
      "text": "I assume they've got a lot of people in the IRS",
      "timestamp": "2022-09-20 20:37:19",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ipc0f4b",
      "text": "Christianity is set to be a minority in 2070. Let's get them to minority status by 2040.",
      "timestamp": "2022-09-21 14:14:28",
      "score": 1,
      "num_children": 0,
      "author": 173938,
      "replies": []
    },
    {
      "id": "ipmxbgp",
      "text": "The real question is why are they rather exempt in the first place, the church belongs to Jesus,  not the state.",
      "timestamp": "2022-09-23 20:18:01",
      "score": 1,
      "num_children": 0,
      "author": 142226,
      "replies": []
    },
    {
      "id": "ip4w1h1",
      "text": "No no no no no no no!  If you remove the tax exempt status of churches, then all of the sudden they are ALLOWED to play their part in politics, because they pay taxes!  \n\n\nThis is the same type of nonsense that is currently happening with abortion.  There was a woman who protested by driving in the HOV lane while pregnant.  Guess what, it back fired.  She got out of her ticket and now states are trying to codify that shit because it helps legitimize the claim that an unborn fetus is, in fact, a human being.",
      "timestamp": "2022-09-20 00:36:46",
      "score": -11,
      "num_children": 1,
      "author": 212029,
      "replies": [
        {
          "id": "ip5cj4k",
          "text": "They’re doing it anyway. Might as well get money from them for it.",
          "timestamp": "2022-09-20 02:45:47",
          "score": 15,
          "num_children": 0,
          "author": 7545,
          "replies": []
        }
      ]
    },
    {
      "id": "ip53p3k",
      "text": "That isn't  campaigning. If non profits were completely banned from discussing politics then most of them would be shut down, not just churches.",
      "timestamp": "2022-09-20 01:36:09",
      "score": -12,
      "num_children": 2,
      "author": 92327,
      "replies": [
        {
          "id": "ip7ftnt",
          "text": "Religion is tied to fundamental beliefs. There's a major difference here",
          "timestamp": "2022-09-20 15:38:37",
          "score": 1,
          "num_children": 0,
          "author": 213102,
          "replies": []
        },
        {
          "id": "ip579xp",
          "text": "Shhh, you’re ruining it!!!",
          "timestamp": "2022-09-20 02:03:25",
          "score": -12,
          "num_children": 1,
          "author": 357523,
          "replies": [
            {
              "id": "ipcb0vq",
              "text": "Won’t anyone think of the Christian nationalists?",
              "timestamp": "2022-09-21 15:22:52",
              "score": 1,
              "num_children": 0,
              "author": 149091,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip4rcww",
      "text": "Kind of reminds me of Biden’s “if you don’t vote for me, you ain’t black”",
      "timestamp": "2022-09-20 00:00:05",
      "score": -26,
      "num_children": 1,
      "author": 253464,
      "replies": [
        {
          "id": "ip4wzgw",
          "text": "True. What a moronic thing to say then and now. At least that was from a politician instead of a pastor.",
          "timestamp": "2022-09-20 00:44:01",
          "score": 18,
          "num_children": 1,
          "author": 292651,
          "replies": [
            {
              "id": "ip4x2m1",
              "text": "Why am I getting down voted for saying that? Wtf?",
              "timestamp": "2022-09-20 00:44:42",
              "score": -2,
              "num_children": 1,
              "author": 253464,
              "replies": [
                {
                  "id": "ip6nwd7",
                  "text": "Whining about downvotes will get you more downvotes.",
                  "timestamp": "2022-09-20 12:15:58",
                  "score": 3,
                  "num_children": 1,
                  "author": 122319,
                  "replies": [
                    {
                      "id": "ipo1zbr",
                      "text": "That’s just toxic",
                      "timestamp": "2022-09-24 01:41:32",
                      "score": 1,
                      "num_children": 1,
                      "author": 253464,
                      "replies": [
                        {
                          "id": "ipo3kjz",
                          "text": "It is just an honest assessment of how Reddit tends to work.",
                          "timestamp": "2022-09-24 01:55:16",
                          "score": 1,
                          "num_children": 1,
                          "author": 122319,
                          "replies": [
                            {
                              "id": "ipo3q00",
                              "text": "Maybe Reddit or maybe just this subreddit apparently.",
                              "timestamp": "2022-09-24 01:56:37",
                              "score": 1,
                              "num_children": 1,
                              "author": 253464,
                              "replies": [
                                {
                                  "id": "ipo4y3v",
                                  "text": "Some element of both.\n\nI have seen it in other subs, especially ones that involve stating your opinion on controversial topics.  It is fine to state an unpopular opinion, but don't whine about the consequences.  A lot of times the downvotes may not really be justified and are really \"disagree\" votes.  But still, own up to it.  The points really don't matter.\n\nBut in some subs there are somewhat unique views on the subject.  In this sub some Christians like to characterize the downvotes as \"Christian persecution.\"",
                                  "timestamp": "2022-09-24 02:07:21",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 122319,
                                  "replies": [
                                    {
                                      "id": "ipo5d6p",
                                      "text": "Can’t say what I said was unpopular or controversial, but apparently riled some feathers nonetheless.",
                                      "timestamp": "2022-09-24 02:11:04",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 253464,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip576i5",
      "text": "He’s not endorsing a candidate… the Johnson amendment doesn’t apply.",
      "timestamp": "2022-09-20 02:02:39",
      "score": -6,
      "num_children": 0,
      "author": 357523,
      "replies": []
    },
    {
      "id": "ip53cq4",
      "text": "[removed]",
      "timestamp": "2022-09-20 01:33:28",
      "score": -19,
      "num_children": 5,
      "replies": [
        {
          "id": "ip5ae09",
          "text": "Imagine thinking any civilized modern society can function without taxes",
          "timestamp": "2022-09-20 02:28:22",
          "score": 9,
          "num_children": 0,
          "author": 181390,
          "replies": []
        },
        {
          "id": "ip56l6c",
          "text": "[removed]",
          "timestamp": "2022-09-20 01:58:08",
          "score": 8,
          "num_children": 1,
          "replies": [
            {
              "id": "ip6cuq8",
              "text": "[removed]",
              "timestamp": "2022-09-20 10:15:47",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ip6mc2l",
                  "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for using abusive language, personal attacks, being a dick, or fighting with other users. These activities are against the [rules](https://www.reddit.com/r/atheism/wiki/guidelines).   \r\nConnected comments may also be removed for the same reason, though editing out the direct attack may merit your comment being restored.  Users who don't cease this behavior may get banned temporarily or permanently.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                  "timestamp": "2022-09-20 12:01:24",
                  "score": 1,
                  "num_children": 0,
                  "author": 122319,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ip5au4r",
          "text": "I’m pro IRS. The IRS existing means I can drive on roads, use public transportation, get energy to my house, be protected from invading countries, have this discussion on the internet, drink clean water; that my parents can get health care; that my grandmother was able to afford to buy food.\n\nThe IRS needs more funding and more agents. Not less. Taxes are needed to fund all of the things we use every day. And there needs to be an organization to collect and manage those taxes.",
          "timestamp": "2022-09-20 02:31:49",
          "score": 4,
          "num_children": 1,
          "author": 273351,
          "replies": [
            {
              "id": "ip6cst2",
              "text": "[removed]",
              "timestamp": "2022-09-20 10:15:02",
              "score": -2,
              "num_children": 1,
              "replies": [
                {
                  "id": "ip86nmb",
                  "text": "what does \"wielding government power to hurt your enemies\" have to do with the fact that there's no invisible man living in the clouds?",
                  "timestamp": "2022-09-20 18:27:35",
                  "score": 1,
                  "num_children": 0,
                  "author": 2762,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ip5e5uc",
          "text": "Who is anti IRS? Billionaires? Millionaires?",
          "timestamp": "2022-09-20 02:59:24",
          "score": 3,
          "num_children": 0,
          "author": 163438,
          "replies": []
        },
        {
          "id": "ip540lz",
          "text": "they are baptists and that is what Baptists do. Ask the religion of the anti abortionists, the anti gay, the anti immigration, and they will tell you \"Baptist\". And to think that was the religion that insisted on separation of church and state being put into the constitution. Oh, wait - this is also the religion that believes they are being persecuted but goes around ( like the Taliban) Trying to enforce its religious rules (Selectively chosen) on others, while ignoring their own sins..",
          "timestamp": "2022-09-20 01:38:37",
          "score": 6,
          "num_children": 2,
          "author": 102841,
          "replies": [
            {
              "id": "ip59691",
              "text": "Ah yes all them Catholic Baptists",
              "timestamp": "2022-09-20 02:18:36",
              "score": 0,
              "num_children": 1,
              "author": 101181,
              "replies": [
                {
                  "id": "ip6a3kb",
                  "text": "You think the Catholics have a monopoly on all of that?",
                  "timestamp": "2022-09-20 09:37:23",
                  "score": 0,
                  "num_children": 0,
                  "author": 286151,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip54qig",
              "text": "[removed]",
              "timestamp": "2022-09-20 01:44:03",
              "score": -10,
              "num_children": 1,
              "replies": [
                {
                  "id": "ip5b5w5",
                  "text": "It's patriotic to pay taxes. I'm happy to contribute to my country. I can't stand people who try to weasel their way out of their patriotic duty. \n\nThis used to be a conservative value. Those values seem to be eroding as of late.",
                  "timestamp": "2022-09-20 02:34:29",
                  "score": 7,
                  "num_children": 1,
                  "author": 151349,
                  "replies": [
                    {
                      "id": "ip6crqp",
                      "text": "[removed]",
                      "timestamp": "2022-09-20 10:14:38",
                      "score": 1,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ip6mywg",
                          "text": "Thank you for your comment. Unfortunately, your comment has been removed for the following reason:\r\n\r\n* This comment has been removed for using abusive language, personal attacks, being a dick, or fighting with other users. These activities are against the [rules](https://www.reddit.com/r/atheism/wiki/guidelines).   \r\nConnected comments may also be removed for the same reason, though editing out the direct attack may merit your comment being restored.  Users who don't cease this behavior may get banned temporarily or permanently.\r\n\r\n--\r\n\r\n\r\n\r\nFor information regarding this and similar issues please see the [Subreddit Commandments.](http://www.reddit.com/r/atheism/wiki/guidelines) If you have any questions, please do not delete your comment and [message the mods,](http://www.reddit.com/message/compose?to=/r/atheism) Thank you.",
                          "timestamp": "2022-09-20 12:07:21",
                          "score": 1,
                          "num_children": 0,
                          "author": 122319,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip57j2y",
      "text": "Then we need to repeal Planned Parethood's tax exempt status, too.",
      "timestamp": "2022-09-20 02:05:23",
      "score": -15,
      "num_children": 1,
      "author": 75538,
      "replies": [
        {
          "id": "ip5ege3",
          "text": "Is PP a church?",
          "timestamp": "2022-09-20 03:01:43",
          "score": 8,
          "num_children": 1,
          "author": 163438,
          "replies": [
            {
              "id": "ip6iyw7",
              "text": "It might as well be the way the left worships abortion.",
              "timestamp": "2022-09-20 11:28:14",
              "score": -3,
              "num_children": 0,
              "author": 75538,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip52o5d",
      "text": "Why am I getting stuff for r/atheism? I'm Catholic. I need an adult.",
      "timestamp": "2022-09-20 01:28:05",
      "score": -13,
      "num_children": 2,
      "author": 302729,
      "replies": [
        {
          "id": "ip5eero",
          "text": "Because it's coming up on r/all since it's popular.",
          "timestamp": "2022-09-20 03:01:20",
          "score": 6,
          "num_children": 0,
          "author": 163438,
          "replies": []
        },
        {
          "id": "ip6a596",
          "text": "> I'm Catholic. I need an adult.\n\nYou certainly do. Don't be childish by supporting the Catholic Church.",
          "timestamp": "2022-09-20 09:38:04",
          "score": 3,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "ip50e3f",
      "text": "He didn't say those who don't \"vote Republican\". Just more liberal prpaganda",
      "timestamp": "2022-09-20 01:10:25",
      "score": -12,
      "num_children": 0,
      "author": 319706,
      "replies": []
    },
    {
      "id": "ip527ub",
      "text": "Should listen cause the anti family devil shit show needs to go.  Anyone that votes democrat is an idiot",
      "timestamp": "2022-09-20 01:24:31",
      "score": -10,
      "num_children": 0,
      "author": 187472,
      "replies": []
    },
    {
      "id": "ip57mhz",
      "text": "Atheism...lol",
      "timestamp": "2022-09-20 02:06:09",
      "score": -8,
      "num_children": 0,
      "author": 346906,
      "replies": []
    },
    {
      "id": "ip58n9i",
      "text": "[removed]",
      "timestamp": "2022-09-20 02:14:29",
      "score": -10,
      "num_children": 1,
      "replies": [
        {
          "id": "ip88rep",
          "text": "If you've got some examples of other religious leaders doing the same thing we'd all love to see it.\n\nWhat examples did you have?",
          "timestamp": "2022-09-20 18:41:32",
          "score": 1,
          "num_children": 0,
          "author": 2762,
          "replies": []
        }
      ]
    },
    {
      "id": "ip4xzmb",
      "text": "Don't worry they won't do jack shit. They're too busy auditing your Aunt Mae for that $10 in unclaimed Venmo payments she received for her cross stitch work. \n\nAlso, fuck \"Christians\" using the Lord's name to tell people how they should vote and fuck the ppl who are dumb enough to listen to them b/c they're incapable of their own critical thinking.",
      "timestamp": "2022-09-20 00:51:45",
      "score": -8,
      "num_children": 0,
      "author": 73745,
      "replies": []
    },
    {
      "id": "ip5f8qc",
      "text": "If your not democrat than your not black",
      "timestamp": "2022-09-20 03:08:37",
      "score": -4,
      "num_children": 0,
      "author": 34142,
      "replies": []
    },
    {
      "id": "ip5m867",
      "text": "He's right though. You can't be a Democrat and be a true believer",
      "timestamp": "2022-09-20 04:16:25",
      "score": -5,
      "num_children": 1,
      "author": 29392,
      "replies": [
        {
          "id": "ip5ufha",
          "text": "And you certainly can’t be a republican and a true believer.  Way too much greed, hate, and obvious cherry picking of the Bible.  Really seems odd honestly.",
          "timestamp": "2022-09-20 05:51:58",
          "score": 3,
          "num_children": 0,
          "author": 240426,
          "replies": []
        }
      ]
    },
    {
      "id": "ip5ue82",
      "text": "Uhhh he did not say vote republican. Nice try tho",
      "timestamp": "2022-09-20 05:51:32",
      "score": -5,
      "num_children": 0,
      "author": 229313,
      "replies": []
    },
    {
      "id": "ip5jlz2",
      "text": "Revoke all income taxes. Income taxation is slavery.",
      "timestamp": "2022-09-20 03:49:32",
      "score": -4,
      "num_children": 0,
      "author": 249057,
      "replies": []
    },
    {
      "id": "ip5lw4p",
      "text": "Al Mohler is not the #1 leader of southern baptists, and he is allowed to speak in his capacity as a citizen. This was at a convention, not a church service and is protected speech. Y’all really think pastors can’t have an opinion on politics.",
      "timestamp": "2022-09-20 04:12:53",
      "score": -5,
      "num_children": 0,
      "author": 223775,
      "replies": []
    },
    {
      "id": "ip6g0b2",
      "text": "Wtf wrong you man feeding shit to ur sheep ur no Preacher ur pieve of assess all belong under jail all people that tricked FOLKS must care urs their family naive MAN FOLKS I PRPMISE U LOOK UP HEADS OUT SSMD SLIDE ON OVER HERE THOS DUDES TNE SLIDER SIDEBUNDER MOVER UP BILL TO LAW BULPARTUSAN ANY THING STUPID ONLY U WILL BE TROUBLE CHILL TJE BEST OF ITS COMING WITHOUT DOUBT I’d tell u where burn but you know truth hidden under belly lies ur farryinh out do not pay attention Here danger get the fuvk out off phone yo got…if your happy and unsure of it clap ur hands 🙌 🙌 lol if happy and unsure of it clap ur hands 🙌🙌 I’d happy unsure of it clap hands hehe go be happy don’t give Monry to this some bitch you ain’t no Rubin hood u belong hood scared with small dick🖕🇺🇸👅",
      "timestamp": "2022-09-20 10:55:24",
      "score": -4,
      "num_children": 1,
      "author": 244197,
      "replies": [
        {
          "id": "ip85u9o",
          "text": "huh?",
          "timestamp": "2022-09-20 18:22:17",
          "score": 1,
          "num_children": 0,
          "author": 2762,
          "replies": []
        }
      ]
    },
    {
      "id": "ip74ihl",
      "text": "i feel second hand embarrassment for people that run to reddit to post this type of stuff lmao",
      "timestamp": "2022-09-20 14:23:53",
      "score": -3,
      "num_children": 0,
      "author": 242195,
      "replies": []
    },
    {
      "id": "ip5dfs4",
      "text": "[removed]",
      "timestamp": "2022-09-20 02:53:22",
      "score": -3,
      "num_children": 1,
      "replies": [
        {
          "id": "ip5fwsh",
          "text": "Which political party tried to impede the US Congress from carrying out its constitutional duties via mob violence?",
          "timestamp": "2022-09-20 03:14:38",
          "score": 3,
          "num_children": 0,
          "author": 365403,
          "replies": []
        }
      ]
    },
    {
      "id": "ip6lzn3",
      "text": "Ultra religious people feel so strongly about abortion that this statement isn’t really a political one.",
      "timestamp": "2022-09-20 11:58:09",
      "score": -1,
      "num_children": 1,
      "author": 182736,
      "replies": [
        {
          "id": "ip6n2cg",
          "text": "They already got what they wanted, so yes it is.",
          "timestamp": "2022-09-20 12:08:15",
          "score": 1,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "ip6oky7",
              "text": "They did not get what they wanted. They still have a lot more damage to do.",
              "timestamp": "2022-09-20 12:22:02",
              "score": 1,
              "num_children": 1,
              "author": 182736,
              "replies": [
                {
                  "id": "ip6opis",
                  "text": "Yes. Political damage.",
                  "timestamp": "2022-09-20 12:23:09",
                  "score": 1,
                  "num_children": 0,
                  "author": 286151,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip7n6fe",
      "text": "Remember when Biden said to Black Americans, it was basically “if you don’t vote for me then you ain’t black.” Strangely similar. Biden’s quote was worse in my opinion. Were you all complaining about that?",
      "timestamp": "2022-09-20 16:25:02",
      "score": -1,
      "num_children": 1,
      "author": 164425,
      "replies": [
        {
          "id": "ip8029c",
          "text": "He also apologized for saying it. Where's this guy's apology?",
          "timestamp": "2022-09-20 17:45:23",
          "score": 1,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "ipdv13x",
              "text": "[removed]",
              "timestamp": "2022-09-21 21:13:40",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ipdypkj",
                  "text": "Looks like [this is it.](https://www.nytimes.com/2020/05/22/us/politics/joe-biden-black-breakfast-club.html) It was very easy to Google.",
                  "timestamp": "2022-09-21 21:38:37",
                  "score": 1,
                  "num_children": 0,
                  "author": 318636,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip5gwcs",
      "text": "one rule for christians, another for muslims.  muslims are appeased in every country because they quietly vote as a block.  i kid you not.  if you go to any non muslim country you will find all the muslims are aligned towards a particular party, and even if they are 5-10 percent of the vote, they are able to swing elections.\n\nthe only thing: they all keep it secret and no media dare ever expose them.\n\ni fully expect to get banned from here.",
      "timestamp": "2022-09-20 03:23:35",
      "score": 0,
      "num_children": 0,
      "author": 208655,
      "replies": []
    },
    {
      "id": "ip8j2bf",
      "text": "I wonder who is more ignorant, the southern Baptist or OP",
      "timestamp": "2022-09-20 19:47:45",
      "score": 0,
      "num_children": 0,
      "replies": []
    }
  ]
}