{
  "id": "xj85zy",
  "text": "These male politicians in multiple states are pushing for women who receive abortions to be punished with prison time. What they all have in common: Wanting to push their personal Christian beliefs on everybody.\n",
  "timestamp": "2022-09-20 12:59:56",
  "score": 15845,
  "subreddit": "t5_2qh2p",
  "num_children": 159,
  "author": 221311,
  "replies": [
    {
      "id": "ip8rhv1",
      "text": "Hello r/all, Welcome to r/atheism!\n\nPlease read our [Commandments](http://www.reddit.com/r/atheism/wiki/guidelines) and [FAQ](http://www.reddit.com/r/atheism/wiki/FAQ) before commenting. If you follow the rules and act civilly we can avoid a lot of bans. While everyone is welcome here, this sub is intended for atheists to discuss things of interest to us. This means that a wide variety of subjects are on-topic here. This is not a sub about just atheism.\n\nRemember: The mods do not choose which posts get voted up the frontpage. They remove the posts that violate the [Commandments](/r/atheism/w/guidelines); they don't police quality.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/atheism) if you have any questions or concerns.*",
      "timestamp": "2022-09-20 20:41:32",
      "score": 1,
      "num_children": 1,
      "author": 184140,
      "replies": [
        {
          "id": "ipa4h84",
          "text": "I'd still rather spend some time in jail than be forced into a lifelong commitment that nobody wanted. Not that either of those options are humane of course. It's a sad time we live in when a group of cells are deemed more important than the already living children needing loving families.",
          "timestamp": "2022-09-21 02:40:20",
          "score": 2,
          "num_children": 0,
          "author": 279050,
          "replies": []
        }
      ]
    },
    {
      "id": "ip6t7nj",
      "text": "Jailing people for getting health care. Sounds like America in 2022.",
      "timestamp": "2022-09-20 13:01:20",
      "score": 1003,
      "num_children": 7,
      "author": 286151,
      "replies": [
        {
          "id": "ip76tz7",
          "text": "Christians loud and proud about how evil they are. They are embracing fascism.\n\nThis is their Christianity. This is who we must fight. I am glad they are showing their true colors before the midterms, but terrified what this will do to the overtone window without strong push back from public atheists.",
          "timestamp": "2022-09-20 14:39:34",
          "score": 304,
          "num_children": 9,
          "author": 64183,
          "replies": [
            {
              "id": "ip7vimw",
              "text": "I watched more than 70 million people vote for Trump the second time around when ignorance was no longer an excuse. Trumpism and a Theocratic dystopia are exactly what they want.    \n\nI am not hopeful.",
              "timestamp": "2022-09-20 17:16:56",
              "score": 162,
              "num_children": 5,
              "author": 239652,
              "replies": [
                {
                  "id": "ip84yc0",
                  "text": "People seem to forget that while Biden received literally the most votes for a presidential candidate in history  in 2020... Trump followed up with the second most in history.\n\nThat DEFEATS me inside",
                  "timestamp": "2022-09-20 18:16:33",
                  "score": 97,
                  "num_children": 4,
                  "replies": [
                    {
                      "id": "ip91dfl",
                      "text": "I think it should be viewed as a triumph. Largest voter turn out ever and super high engagement. \n\nOf course we're fighting for this nation not to become a fascist hellhole so that part sucks.",
                      "timestamp": "2022-09-20 21:47:23",
                      "score": 57,
                      "num_children": 0,
                      "author": 335629,
                      "replies": []
                    },
                    {
                      "id": "ip97wsc",
                      "text": "I mean that is how population growth works. I’ll bet who ever wins the 2024 election will get the most votes ever and the loser will get the 2nd most.  It’s what is called a deepity , it sounds deep and impressive to say that but really it’s the expected outcome\n\nEdit to correct per below comment",
                      "timestamp": "2022-09-20 22:33:41",
                      "score": 9,
                      "num_children": 1,
                      "author": 132373,
                      "replies": [
                        {
                          "id": "ip9tbq0",
                          "text": "\"Deepening\"? Isn't the term \"deepity\"?",
                          "timestamp": "2022-09-21 01:14:34",
                          "score": 1,
                          "num_children": 1,
                          "author": 180545,
                          "replies": [
                            {
                              "id": "ip9tfg6",
                              "text": "Yup autocorrect got me",
                              "timestamp": "2022-09-21 01:15:22",
                              "score": 2,
                              "num_children": 0,
                              "author": 132373,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ip9tp30",
                      "text": "Well you’re pretty easily defeated then. Turn out and vote. Invite some of your neighbors, etc. these nut jobs are the minority. They just vote better. And they don’t feel defeated when they have setbacks. They play the long game. Example- SCOTUS.",
                      "timestamp": "2022-09-21 01:17:26",
                      "score": 1,
                      "num_children": 1,
                      "author": 133712,
                      "replies": [
                        {
                          "id": "ipbwlm9",
                          "text": "I do those things. I'm really tired of seeing it as \"advice\" when everyone that's part of this discussion is already doing it. Next?",
                          "timestamp": "2022-09-21 13:47:59",
                          "score": 1,
                          "num_children": 1,
                          "replies": [
                            {
                              "id": "ipch8wt",
                              "text": "Good on you! However, voter turnout at presidential elections remains in the low-mid 60% range. Everyone is clearly not doing it.",
                              "timestamp": "2022-09-21 16:01:47",
                              "score": 1,
                              "num_children": 1,
                              "author": 133712,
                              "replies": [
                                {
                                  "id": "ipctqt5",
                                  "text": "What I'm saying is: The people you're telling this to are already doing it. It's useless.",
                                  "timestamp": "2022-09-21 17:19:20",
                                  "score": 1,
                                  "num_children": 0,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ipa7uag",
                      "text": ">That DEFEATS me inside\n\n  \n\n\nDid you not vote?\n\n  \n\n\nI voted for Biden and we won! I felt like fireworks inside exploding.\n\n  \n\n\nWe need to keep doing it again. If you don't vote, then you let yourself be defeated.",
                      "timestamp": "2022-09-21 03:06:53",
                      "score": 0,
                      "num_children": 1,
                      "author": 93570,
                      "replies": [
                        {
                          "id": "ipbwcil",
                          "text": "Of course I did. Why would that change my feelings on the above fact? I definitely didn't feel fireworks, I felt exhausted and honestly scared that Trump had that much support after everything he did.\n\nFrankly, I need people to stop just saying \"vote.\" Like that's all that needs to happen to solve things. Obviously we need to vote, but that's not enough by itself.",
                          "timestamp": "2022-09-21 13:46:12",
                          "score": 1,
                          "num_children": 0,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ipa7k01",
                  "text": ">I am not hopeful.\n\nStill we must vote out the Republicans.",
                  "timestamp": "2022-09-21 03:04:38",
                  "score": 3,
                  "num_children": 0,
                  "author": 93570,
                  "replies": []
                },
                {
                  "id": "ip9t8lp",
                  "text": "You know who is hopeful? White christian nationalists. And this BS will energize their voting base. Fortunately, they only account for about 1/3 of all voters. I’m hopeful that you can find us a few new voters.",
                  "timestamp": "2022-09-21 01:13:54",
                  "score": 1,
                  "num_children": 1,
                  "author": 133712,
                  "replies": [
                    {
                      "id": "ipa0ybv",
                      "text": ">I’m hopeful that you can find us a few new voters.\n\nThose would be the women who didn't vote because they never thought politics affected their daily life. Republicans finally made it clear to them that it does. There are a record number of women registering to vote for the first time. They are furious.  \n\nBut the Republicans are determined to cheat because they are convinced that God is on their side. (Never fails to amaze me that God is somehow always on the side of every self righteous zealot willing to cause enough suffering.)",
                      "timestamp": "2022-09-21 02:13:00",
                      "score": 1,
                      "num_children": 1,
                      "author": 239652,
                      "replies": [
                        {
                          "id": "ipamw02",
                          "text": "This is my hope. I would expect to see 99% turnout for the ladies after that shit the SCOTUS pulled. Sneaky lying bastards… \n\nStep one- win midterms big. \n\nStep two- expose qanon for the cult that it is.",
                          "timestamp": "2022-09-21 05:26:57",
                          "score": 1,
                          "num_children": 0,
                          "author": 133712,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ip94hmp",
                  "text": "[removed]",
                  "timestamp": "2022-09-20 22:09:14",
                  "score": -9,
                  "num_children": 3,
                  "replies": [
                    {
                      "id": "ip95i4t",
                      "text": "He's Catholic, but he's not an idiot, and as I recall he was all but excommunicated for failing to unquestioningly push Catholic dogma on US citizens. \n\nIt's interesting that you managed to say all of that without once mentioning the mother's right to make medical decisions that affect her body.",
                      "timestamp": "2022-09-20 22:16:27",
                      "score": 10,
                      "num_children": 1,
                      "author": 318636,
                      "replies": [
                        {
                          "id": "ip99h1v",
                          "text": "Not to mention how he claims the abortion debate is not religious while failing to note that the vast majority of people pushing the forced birth/anti-choice position are religious zealots; the Catholics, the Evangelists, the Southern Baptists, etc.",
                          "timestamp": "2022-09-20 22:44:47",
                          "score": 6,
                          "num_children": 0,
                          "author": 239652,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ipa3gfy",
                      "text": "Only three people should have any involvement into the decision concerning the termination of a pregnancy, the pregnant individual's significant other/partner, her doctor, and the pregnant individual. The actual decision can only be made by the pregnant individual. \n\nIt's not your womb, it's not your body, you don't know that person's situation, and the zygote/embryo/fetus is not yours. It's not your life that is being affected. It's not your decision to make. You have no say in the matter, regardless of your personal or religious beliefs.",
                      "timestamp": "2022-09-21 02:32:25",
                      "score": 3,
                      "num_children": 0,
                      "author": 248641,
                      "replies": []
                    },
                    {
                      "id": "ipawc1p",
                      "text": "Those are lovely, clear, concise standards you have laid out.\n\nFor yourself.\n\nYou have zero right, and zero moral basis, for forcing other people to give their body over to the growth and feeding of a fetus.",
                      "timestamp": "2022-09-21 07:19:51",
                      "score": 1,
                      "num_children": 0,
                      "author": 403008,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ip98t2p",
                  "text": "[removed]",
                  "timestamp": "2022-09-20 22:40:04",
                  "score": -1,
                  "num_children": 2,
                  "replies": [
                    {
                      "id": "ip9ayad",
                      "text": "Ah look everybody, one of those 70+ million afore mentioned Trumpanzies who actually revel in the assholery, stupid simplistic \"solutions,\" and cruelty has popped up to proudly announce how much other people being different really offends them.",
                      "timestamp": "2022-09-20 22:55:32",
                      "score": 4,
                      "num_children": 0,
                      "author": 239652,
                      "replies": []
                    },
                    {
                      "id": "ip9agpm",
                      "text": "Yes, yes, we all know that the idea of letting people who aren't exactly like you and have no effect on your life just be who and what they want to be offends your sensibilities.  \n\nYour lot were and still are pissed off at the idea of integrated schooling, civil rights, gays in the military, gay marriage, immigration of non-whites, and now allowing trans-gender to just be.   \n\nDo you guys ever get tired of whinging about having to treat other people with dignity, respect, and equality?",
                      "timestamp": "2022-09-20 22:51:58",
                      "score": 3,
                      "num_children": 0,
                      "author": 239652,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ip97ngq",
              "text": "Look at nazi belt buckles. It’s always been what Christianity is about. The whole religion is based on unwavering belief in unprovable things and that’s fascism pure and simple",
              "timestamp": "2022-09-20 22:31:48",
              "score": 15,
              "num_children": 0,
              "author": 132373,
              "replies": []
            },
            {
              "id": "ip8v4be",
              "text": "Exactly.\n\nI'm a little dissappointed to see the word \"MALE\" in the title, this isn't a \"male\" problem, it's a christian one.\n\nDon't forget, a supreme court that was entirely male passed roe v wade in the first place, a supreme court with more women on it than ever before in US history repealed it.",
              "timestamp": "2022-09-20 21:04:57",
              "score": 40,
              "num_children": 2,
              "author": 226173,
              "replies": [
                {
                  "id": "ip9i943",
                  "text": "Didn't they repeal Roe before Jackson was sworn in?",
                  "timestamp": "2022-09-20 23:49:41",
                  "score": 8,
                  "num_children": 1,
                  "author": 371978,
                  "replies": [
                    {
                      "id": "ip9kpjl",
                      "text": "They may have done, but it still had more women on it at that point than when they passed r vs w.\n\nThe point is that there are many fundamentalist christian women (Marjorie taylor greene, etc, etc) that are just as dangerous as conservative men, and are actively voting against their own (as women) interests.",
                      "timestamp": "2022-09-21 00:08:33",
                      "score": 15,
                      "num_children": 0,
                      "author": 226173,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ipapwlv",
                  "text": "Muslims are pro abortion?",
                  "timestamp": "2022-09-21 06:01:15",
                  "score": 0,
                  "num_children": 2,
                  "author": 42523,
                  "replies": [
                    {
                      "id": "ipbgti4",
                      "text": "I understand that abortion is permissible within the first trimester for (most) Muslims.",
                      "timestamp": "2022-09-21 11:39:44",
                      "score": 3,
                      "num_children": 0,
                      "author": 410213,
                      "replies": []
                    },
                    {
                      "id": "ipc0jhz",
                      "text": "I don't actually know what the muslim stance is on abortion, but I'm pretty sure most of the people pushing for abortion rights to be taken away from women in america are christians, not muslims.",
                      "timestamp": "2022-09-21 14:15:18",
                      "score": 2,
                      "num_children": 0,
                      "author": 226173,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ip7muo9",
              "text": "Doesn't have to be atheists. There's a humongous number of good Christians who are horrified by what's happening in our country. I just hope they have the spine to do what's right come November. Problem is that they often have  crazies for neighbors and they don't want antagonize them. Still,  I think that this November may come as a surprise for Republicans.",
              "timestamp": "2022-09-20 16:23:00",
              "score": 29,
              "num_children": 5,
              "author": 104754,
              "replies": [
                {
                  "id": "ip7wf24",
                  "text": "\"good\" Christian women will do exactly as they are told and will vote Republican.",
                  "timestamp": "2022-09-20 17:22:32",
                  "score": 56,
                  "num_children": 1,
                  "author": 186350,
                  "replies": [
                    {
                      "id": "ip8cpwe",
                      "text": "I hope you're being facetious.",
                      "timestamp": "2022-09-20 19:07:19",
                      "score": -18,
                      "num_children": 1,
                      "author": 104754,
                      "replies": [
                        {
                          "id": "ip8dxav",
                          "text": "They're not: middle class white women were the reason Mango Unchained won the electoral college vote. White women have been voting against their own interests almost since they've had the right to vote.",
                          "timestamp": "2022-09-20 19:15:10",
                          "score": 23,
                          "num_children": 1,
                          "author": 58930,
                          "replies": [
                            {
                              "id": "ip8ma1p",
                              "text": "I would like to see the religious makeup of the single women who voted Obama into office personally.",
                              "timestamp": "2022-09-20 20:08:15",
                              "score": -5,
                              "num_children": 0,
                              "author": 408587,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ip8jmgk",
                  "text": "They might be horrified but they'll still vote Republican because abortion. Or LGBTQ. Or whatever strawman is being waved around on Fox news and being talked about in their churches.",
                  "timestamp": "2022-09-20 19:51:17",
                  "score": 37,
                  "num_children": 2,
                  "author": 74247,
                  "replies": [
                    {
                      "id": "ip8nvp1",
                      "text": "Or, as one woman said on CNN days before the 2016 election when asked who she will vote for: \"Oh, honey, that's a question for hubby.\"\n\nI'm guessing 'hubby' fills out both ballots.",
                      "timestamp": "2022-09-20 20:18:33",
                      "score": 21,
                      "num_children": 0,
                      "author": 114177,
                      "replies": []
                    },
                    {
                      "id": "ipa8bqb",
                      "text": "Tru that. They are not as horrified as us.",
                      "timestamp": "2022-09-21 03:10:52",
                      "score": 2,
                      "num_children": 0,
                      "author": 93570,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ip9374m",
                  "text": "I think so as well. If the Republicans lose \"bigly\" however, I suspect a violent freakout from some of their cult-members...",
                  "timestamp": "2022-09-20 22:00:01",
                  "score": 3,
                  "num_children": 1,
                  "author": 232438,
                  "replies": [
                    {
                      "id": "ipa4uhd",
                      "text": "Doug Mastriano will certainly claim it was stolen",
                      "timestamp": "2022-09-21 02:43:07",
                      "score": 1,
                      "num_children": 1,
                      "author": 337162,
                      "replies": [
                        {
                          "id": "ipa4va2",
                          "text": "> I think instead of $19,000, we fund each student around $9,000 or $10,000 and they can decide which school to go to; public school, private school, religious school, cyber school, or home school.  \n**-Doug Mastriano** (on defunding public education) | [Source](https://www.psea.org/issues-action/action-center/voter-toolkit/mastriano-cuts-explained/)  \n  \n[Register to vote against him](https://www.pavoterservices.pa.gov/pages/VoterRegistrationApplication.aspx) | [Mail Voting](https://www.pavoterservices.pa.gov/OnlineAbsenteeApplication/#/OnlineAbsenteeBegin) | Deadline to register is Oct 24th. Do not let this fascist win.",
                          "timestamp": "2022-09-21 02:43:18",
                          "score": 3,
                          "num_children": 0,
                          "author": 263855,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ipa88u5",
                  "text": "They won't. They will still vote Republican. That's just the way it is. They may disagree with their party but they will always vote with the party.\n\n  \n\n\nThe only way to win is to get as many votes as we can.",
                  "timestamp": "2022-09-21 03:10:12",
                  "score": 3,
                  "num_children": 0,
                  "author": 93570,
                  "replies": []
                },
                {
                  "id": "ip9xzkh",
                  "text": "I’d love to be hopeful that Republicans will be served this November, but I have a hunch that Trump’s minions are still just getting fired up. I don’t think his ugly legacy is going away any time soon, sadly. Then again, maybe I feel that way because I live in MAGA county, Alabama, where “democrat” and “liberal” are basically curse words. 😫\n\nMaybe the country that exists outside of Hicksville will save us.",
                  "timestamp": "2022-09-21 01:50:07",
                  "score": 2,
                  "num_children": 0,
                  "author": 200755,
                  "replies": []
                }
              ]
            },
            {
              "id": "ipa752i",
              "text": "Just remember that the underlining issue here isn't Christianity, it's people believing in baseless beliefs, and wanting everyone else to conform to their baseless beliefs.  \n  \nAny group can be guilty of doing that, although religious groups seem to be the Usain Bolt of doing it.",
              "timestamp": "2022-09-21 03:01:19",
              "score": 1,
              "num_children": 0,
              "author": 234230,
              "replies": []
            },
            {
              "id": "ip8uscl",
              "text": "In the preface to the Lord's Prayer at Matthew 6.5, Jesus mocked the hypocrites at church.",
              "timestamp": "2022-09-20 21:02:44",
              "score": 1,
              "num_children": 1,
              "author": 298438,
              "replies": [
                {
                  "id": "ipa8gbw",
                  "text": "I don't even think Jesus was a real person. He is as real as Santa.",
                  "timestamp": "2022-09-21 03:11:54",
                  "score": 1,
                  "num_children": 1,
                  "author": 93570,
                  "replies": [
                    {
                      "id": "ipa97ha",
                      "text": "But the advice written in Jesus's name is to get your lazy butts to work building Heaven when the Matthew 6:5 hypocrites at church who Jesus mocked have been pushing the \"exists as if by magic\" long con.\n\nIt doesn't really matter who suggested building heaven, but Jesus was the reference I knew in 1975 telling the government scientists about it before we started mapping the brain.\n\n\"Physical Control of the Mind: Toward a Psychocivilized Society\" (1969) by José M.R. Delgado, M.D.\n\n[Professor Creates Remote Control People | Dark Matters](https://www.youtube.com/watch?v=CVtjszPa6UY)",
                      "timestamp": "2022-09-21 03:18:09",
                      "score": 1,
                      "num_children": 0,
                      "author": 298438,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ipa7s96",
              "text": "Just become a member of The Satanic Temple, abortion is a religious sacrament for satanists and it's a religious freedom to order plan B pills online.\n\nhttps://announcement.thesatanictemple.com/rrr-campaign41280784",
              "timestamp": "2022-09-21 03:06:25",
              "score": 1,
              "num_children": 0,
              "author": 182855,
              "replies": []
            },
            {
              "id": "ipaccu4",
              "text": "At least non affiliated or atheist is skyrocketing among the youth as compared to previous decades, unfortunately, that's exactly what they're trying to prevent with their attempts to further infiltrate public education.",
              "timestamp": "2022-09-21 03:45:05",
              "score": 1,
              "num_children": 0,
              "author": 404215,
              "replies": []
            },
            {
              "id": "ip9pea9",
              "text": "[removed]",
              "timestamp": "2022-09-21 00:44:31",
              "score": -6,
              "num_children": 1,
              "replies": [
                {
                  "id": "ipawy05",
                  "text": "No, it's not. And saying it is doesn't make it so, child.",
                  "timestamp": "2022-09-21 07:27:46",
                  "score": 5,
                  "num_children": 0,
                  "author": 403008,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ip6uyt4",
          "text": "First they bankrupted them, now they're putting them in jail. Seems like a common theme in America.",
          "timestamp": "2022-09-20 13:15:01",
          "score": 176,
          "num_children": 5,
          "author": 313875,
          "replies": [
            {
              "id": "ip71lmk",
              "text": "Then after we are bankrupt and jailed, we’ll be felons so we can’t vote 🥸",
              "timestamp": "2022-09-20 14:03:35",
              "score": 145,
              "num_children": 4,
              "author": 408458,
              "replies": [
                {
                  "id": "ip7772f",
                  "text": "✔️ push extremist religious beliefs  \n\n✔️ funnel people into privately owned prison  \n\n✔️ disinfranchise non-republican voters  \n\n✔️ make health care harder access   \n\n✔️ direct victims of new policy are primarily women and minorities  \n\n✔️ expand and abuse government power over individual liberties and freedoms for explicitly dangerous religious ends. Behaviors that all fly in the face of the constitution and claimed old republican values  \n\nLots of wins for the party of the transparently self serving kleptocrats/theocrats/demagogues  using religion to grift money and consolidate power",
                  "timestamp": "2022-09-20 14:41:59",
                  "score": 160,
                  "num_children": 3,
                  "author": 262316,
                  "replies": [
                    {
                      "id": "ip7dg6j",
                      "text": "Well said. Dig the formatting.",
                      "timestamp": "2022-09-20 15:23:09",
                      "score": 32,
                      "num_children": 0,
                      "author": 96570,
                      "replies": []
                    },
                    {
                      "id": "ip89484",
                      "text": "Okay everyone together with me, FUCK FASCISTS FUCK REGRESSIVISM AND FUCK INEQUALITY",
                      "timestamp": "2022-09-20 18:43:53",
                      "score": 22,
                      "num_children": 1,
                      "author": 214545,
                      "replies": [
                        {
                          "id": "ip8ei89",
                          "text": "And fuck republicans bringing these things to us",
                          "timestamp": "2022-09-20 19:18:52",
                          "score": 16,
                          "num_children": 2,
                          "author": 277025,
                          "replies": [
                            {
                              "id": "ip8xcq9",
                              "text": "They make people’s lives hell and have the goddamn nerve to denounce the people protesting, they need to learn their lesson one way or another, I know me and many other Americans feel the exact same way",
                              "timestamp": "2022-09-20 21:20:00",
                              "score": 7,
                              "num_children": 0,
                              "author": 214545,
                              "replies": []
                            },
                            {
                              "id": "ip9hujf",
                              "text": "And the horse they rode in on",
                              "timestamp": "2022-09-20 23:46:35",
                              "score": 3,
                              "num_children": 0,
                              "author": 171543,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ip9veaz",
                      "text": "I honestly think at this point that taking these monsters out by force is the only viable option. Now before anyone Reddit jails me, I’m not calling for violence, I’m just stating that I don’t think anything short of it will fix our situation. \n\nWe had one revolution to overthrow / escape this type of government before, and we may just have to have one again.",
                      "timestamp": "2022-09-21 01:30:12",
                      "score": 2,
                      "num_children": 0,
                      "author": 251911,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ip763l7",
                  "text": "Or get a job in order to correct problem number 1 so you likely end up back in jail where it can cost you money to remain which in turn will help you be forced back.. *when a system works exactly as designed..",
                  "timestamp": "2022-09-20 14:34:41",
                  "score": 24,
                  "num_children": 1,
                  "author": 273366,
                  "replies": [
                    {
                      "id": "ip781iz",
                      "text": "Don't forget the part where they [charge you money to be incarcerated.](https://abcnews.go.com/US/wireStory/249-day-prison-stays-leave-inmates-deep-debt-88930478)",
                      "timestamp": "2022-09-20 14:47:32",
                      "score": 35,
                      "num_children": 1,
                      "author": 286151,
                      "replies": [
                        {
                          "id": "ip787l7",
                          "text": "I mean that's what I said, but I appreciate the source to back it up.",
                          "timestamp": "2022-09-20 14:48:38",
                          "score": 14,
                          "num_children": 0,
                          "author": 273366,
                          "replies": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ip7ojub",
                  "text": "Then the 13th amendment kicks in and you can be enslaved. And DeSantis has the key. They don't have to release you until you pay the government back for any imagined expenses they can make up.",
                  "timestamp": "2022-09-20 16:33:41",
                  "score": 22,
                  "num_children": 0,
                  "author": 376584,
                  "replies": []
                },
                {
                  "id": "ip8wmjg",
                  "text": "Since I realized this fairly recently, I just wanted to share it for those who don't know. After doing time, most states allow felons to vote.\n\nhttps://www.aclu.org/issues/voting-rights/voter-restoration/felony-disenfranchisement-laws-map",
                  "timestamp": "2022-09-20 21:15:02",
                  "score": 5,
                  "num_children": 0,
                  "author": 307538,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip7d6ap",
              "text": "It makes sense though. Dig deep to discover who owns prisons in America.\n\nWhat they don't own and can't take a cut of? Abortions and the gynecologists that perform them.\n\nThey're hopeful these babies will make them lots of money down the road - aka ROI.",
              "timestamp": "2022-09-20 15:21:22",
              "score": 15,
              "num_children": 1,
              "author": 96570,
              "replies": [
                {
                  "id": "ip7h9lt",
                  "text": "the pipeline to prison starts early in life.",
                  "timestamp": "2022-09-20 15:47:25",
                  "score": 15,
                  "num_children": 2,
                  "author": 210541,
                  "replies": [
                    {
                      "id": "ip8n15h",
                      "text": "They know that pushing \"traditional family values\" is a great strategy:\n\n1. Demonize birth control and abortion as \"immoral\"\n2. Get girl married young\n3. Husband cheats on girl (now wife) and takes off to start new same cycle with new young girl\n4. Criticize woman  (now ex wife) for not \"keeping her husband's attention\"\n5. Ex wife is forced to raise children in poverty, children commit crimes and are thrown into military, low wage slave work, and/or private prisons making peanuts and unable to advocate for themselves\n6. The children in poverty are \"rescued\" by the church, which demonizes birth control and abortion\n7. AND the cycle starts over again, hopefully by this time the former husband has impregnated multiple young girls and ditched them, the more unwanted children there are, the more profit can be made off of them",
                      "timestamp": "2022-09-20 20:13:05",
                      "score": 14,
                      "num_children": 1,
                      "author": 408587,
                      "replies": [
                        {
                          "id": "ip9vnqp",
                          "text": "That’s their system and guess what: it fucking works. They’re just in an expansion period is all.",
                          "timestamp": "2022-09-21 01:32:12",
                          "score": 3,
                          "num_children": 1,
                          "author": 251911,
                          "replies": [
                            {
                              "id": "ipaiteq",
                              "text": "Yeah, for some time we were BRIEFLY escaping this system through responsible childbearing of women and our political, corporate, and religious overlords didn't like that AT ALL, hence why Roe \"had to go.\"",
                              "timestamp": "2022-09-21 04:44:58",
                              "score": 1,
                              "num_children": 0,
                              "author": 408587,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ip7pqh2",
                      "text": "And legal and easy access to abortion has been correlated to lower crime and poverty, which would  drive prison populations if removed. Not sure if there is a conspiracy with this reasoning but like a lot of abstract incentives, like money and power, things seem to grow 'naturally' toward those desires and resources  :)",
                      "timestamp": "2022-09-20 16:41:03",
                      "score": 24,
                      "num_children": 1,
                      "author": 340507,
                      "replies": [
                        {
                          "id": "ip8e4gr",
                          "text": "Despite sounding crazy - it's all part of a master plan, don't doubt that.",
                          "timestamp": "2022-09-20 19:16:27",
                          "score": 3,
                          "num_children": 1,
                          "author": 96570,
                          "replies": [
                            {
                              "id": "ip8naip",
                              "text": "It appeals to both corporate overlords and white supremacists-get whites breeding again, AND get the corporations more slave labor, as we haven't been making enough since 2007. It also makes Evangelical conservative Christians pat themselves on the back for \"saving life.\"",
                              "timestamp": "2022-09-20 20:14:45",
                              "score": 5,
                              "num_children": 0,
                              "author": 408587,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ip7ij6t",
              "text": "Jail leasing is the new slavery, this is by design",
              "timestamp": "2022-09-20 15:55:32",
              "score": 15,
              "num_children": 1,
              "author": 287695,
              "replies": [
                {
                  "id": "ip8hy34",
                  "text": "It has always been the way that slavery was perpetuated. These are just efforts to streamline the process so it works more like it did during the reconstruction.",
                  "timestamp": "2022-09-20 19:40:37",
                  "score": 2,
                  "num_children": 0,
                  "author": 196146,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip7q3av",
              "text": "Then they make money out of them while in jail.",
              "timestamp": "2022-09-20 16:43:14",
              "score": 7,
              "num_children": 0,
              "author": 119965,
              "replies": []
            },
            {
              "id": "ip84prc",
              "text": "Well all you have to do is follow their religious edicts that they themselves break all the time and you’ll be fine.\n\nWhy should you not have to follow their religious laws?\n\n/s",
              "timestamp": "2022-09-20 18:14:59",
              "score": 2,
              "num_children": 0,
              "author": 406571,
              "replies": []
            }
          ]
        },
        {
          "id": "ip7umzr",
          "text": "Sounds very American “Christian” too",
          "timestamp": "2022-09-20 17:11:24",
          "score": 8,
          "num_children": 0,
          "author": 325322,
          "replies": []
        },
        {
          "id": "ip96k7x",
          "text": "Don't forget charging them ridiculous amounts for said health care as well",
          "timestamp": "2022-09-20 22:23:56",
          "score": 4,
          "num_children": 0,
          "author": 336995,
          "replies": []
        },
        {
          "id": "ip8o3ek",
          "text": "Not 'people\", just women.  /s",
          "timestamp": "2022-09-20 20:19:53",
          "score": 2,
          "num_children": 0,
          "author": 341113,
          "replies": []
        },
        {
          "id": "ip9hsnd",
          "text": "Blessed be the fruit",
          "timestamp": "2022-09-20 23:46:11",
          "score": 1,
          "num_children": 0,
          "author": 87147,
          "replies": []
        },
        {
          "id": "ip9rgi4",
          "text": "“Health care”",
          "timestamp": "2022-09-21 01:00:26",
          "score": -2,
          "num_children": 1,
          "author": 285827,
          "replies": [
            {
              "id": "ipb4415",
              "text": "What exactly would you call a medical procedure performed by a medical professional if not health care?",
              "timestamp": "2022-09-21 09:07:50",
              "score": 2,
              "num_children": 1,
              "author": 286151,
              "replies": [
                {
                  "id": "ipb48t8",
                  "text": "Not all medical procedures are equal. Some involve murder.",
                  "timestamp": "2022-09-21 09:09:40",
                  "score": 0,
                  "num_children": 1,
                  "author": 285827,
                  "replies": [
                    {
                      "id": "ipb4ijy",
                      "text": "Ah, so it *is* a medical procedure. Thank you for agreeing. So your quotes were meaningless.",
                      "timestamp": "2022-09-21 09:13:26",
                      "score": 1,
                      "num_children": 1,
                      "author": 286151,
                      "replies": [
                        {
                          "id": "ipba6jz",
                          "text": "No. We agree it’s a medical procedure, but I don’t agree that it’s conducive to health, nor is it a form of care.",
                          "timestamp": "2022-09-21 10:28:05",
                          "score": 0,
                          "num_children": 1,
                          "author": 285827,
                          "replies": [
                            {
                              "id": "ipbaaad",
                              "text": "How is caring for a woman's needs not a form of care? How is ending a pregnancy, which is a risk to a woman's body and life, not conducive to health?",
                              "timestamp": "2022-09-21 10:29:20",
                              "score": 3,
                              "num_children": 1,
                              "author": 286151,
                              "replies": [
                                {
                                  "id": "ipbaheg",
                                  "text": "By putting a woman’s temporal needs above another’s right to life, the medical procedure ceases to be conducive to health. Also it usually involves ripping a human apart, limb from limb.",
                                  "timestamp": "2022-09-21 10:31:40",
                                  "score": 0,
                                  "num_children": 1,
                                  "author": 285827,
                                  "replies": [
                                    {
                                      "id": "ipbakdn",
                                      "text": "Ah, so what you mean is you don't care about a woman's health.\n\nAlso, that is not how the vast majority of abortions work. Most of them are chemical. Most of the rest are performed before limbs have grown. Please stop spreading misinformation.",
                                      "timestamp": "2022-09-21 10:32:40",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 286151,
                                      "replies": [
                                        {
                                          "id": "ipbaqjj",
                                          "text": "Don’t misrepresent me. Chemical is just as bad. It’s murder. Stop calling it something else to gloss over the fact that you’re willing to allow someone to kill a weak, innocent human for what you term “health”.",
                                          "timestamp": "2022-09-21 10:34:46",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 285827,
                                          "replies": [
                                            {
                                              "id": "ipbaskj",
                                              "text": "How many children have you adopted? How many have special needs? \n\nOr are you talking about a problem you don't intend to help solve?",
                                              "timestamp": "2022-09-21 10:35:27",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 286151,
                                              "replies": [
                                                {
                                                  "id": "ipbay82",
                                                  "text": "Well done. I have three of my own, two of whom have special needs. If I were eligible to adopt, I would, but I’m on a carers pension and my wife has chronic illness so we don’t qualify.",
                                                  "timestamp": "2022-09-21 10:37:21",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 285827,
                                                  "replies": [
                                                    {
                                                      "id": "ipbazqo",
                                                      "text": "Convenient. Why didn't you adopt before that happened?",
                                                      "timestamp": "2022-09-21 10:37:53",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 286151,
                                                      "replies": [
                                                        {
                                                          "id": "ipbbk78",
                                                          "text": "My wife has had chronic illnesses since she was 14. I’ve tried to hold full-time employment but in our situation it’s been untenable. At no point did we qualify for adoption. Fact is, Ive never murdered one of my own children and neither has my wife. My ex did though, without talking to me and without knowing who the father was. It’s a grief I carry.\n\nHow about you? What’s your story?",
                                                          "timestamp": "2022-09-21 10:44:29",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 285827,
                                                          "replies": [
                                                            {
                                                              "id": "ipbbpdo",
                                                              "text": "> My wife has had chronic illnesses since she was 14.\n\nThen you're a terrible person forcing her to go through three pregnancies. You could have killed your wife. But then we already established that a woman's health or life is not important to you.",
                                                              "timestamp": "2022-09-21 10:46:09",
                                                              "score": 1,
                                                              "num_children": 1,
                                                              "author": 286151,
                                                              "replies": [
                                                                {
                                                                  "id": "ipbby6r",
                                                                  "text": "Ok, I was actually interested to know your story, but I’m done here.",
                                                                  "timestamp": "2022-09-21 10:48:59",
                                                                  "score": 1,
                                                                  "num_children": 1,
                                                                  "author": 285827,
                                                                  "replies": [
                                                                    {
                                                                      "id": "ipbc1ci",
                                                                      "text": "My story is irrelevant. I don't have to adopt because I believe in a woman's right to choose whether or not they want to give birth. You think they should be forced or, apparently, imprisoned for having an abortion (I wonder how you expect to tell whether or not it was an abortion or a natural miscarriage?)",
                                                                      "timestamp": "2022-09-21 10:49:56",
                                                                      "score": 0,
                                                                      "num_children": 0,
                                                                      "author": 286151,
                                                                      "replies": []
                                                                    }
                                                                  ]
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip6w4l2",
      "text": "I had a great call with a very old friend of mine who was a gospel preacher a few years ago. He isn't anymore. \n\nHe's furious at the obvious hypocrisy of all religions which he has seen from the inside and from the outside now. He never fell for Trump's bullshit, because he's always been a more rational man. So, now he's in that \"I'm agnostic\" phase on his way to the truth any year now. \n\nSo, for all the horror stories we hear daily about the evangelical kooks, I thought I'd share a positive story of one (always decent) old man finally reaching enlightenment through his own person journey. :)",
      "timestamp": "2022-09-20 13:23:45",
      "score": 294,
      "num_children": 4,
      "author": 165283,
      "replies": [
        {
          "id": "ip6wfbg",
          "text": "One of our mods (I will let them speak for themself rather than name them) used to be clergy. Went through seminary and everything. They've brought it up before but I don't want to speak for them.\n\nThe Clergy Project has a lot of other examples. It's really sad. A lot of them have no training to do any sort of other work, so they remain clergy just to make a living even though they don't believe.\n\nhttps://clergyproject.org/",
          "timestamp": "2022-09-20 13:26:00",
          "score": 109,
          "num_children": 4,
          "author": 286151,
          "replies": [
            {
              "id": "ip80v2n",
              "text": "The fastest way to atheism is studying the Bible. I have Catholic high school to thank for that. For every answer a priest gave young me in religion class, it only opened up 100 more questions, and the answers stopped making any logical sense.\n\nReligion class in high school was such a waste in hindsight. All those hours spent teaching nothing when I could have learned about finance or something relevant to reality.",
              "timestamp": "2022-09-20 17:50:23",
              "score": 43,
              "num_children": 1,
              "author": 276933,
              "replies": [
                {
                  "id": "ip8ni6q",
                  "text": "As a Christian, it's one of those reasons I'm not disturbed by public funding going to Christian schools in Maine...nothing will make an Atheist FASTER than a Christian school. Most of my schoolmates barely practice Christianity anymore despite years of indoctrination.",
                  "timestamp": "2022-09-20 20:16:07",
                  "score": 6,
                  "num_children": 2,
                  "author": 408587,
                  "replies": [
                    {
                      "id": "ip95i6q",
                      "text": "I tell you it is crazy.\n\nGrowing up as my family started to get away from the Christian faith (still went to a Christian school because private education is supposed to be better, right?) well one of my best friends was in a hardcore christian family. Only NES/PC games we could play were generic games like pinpall or a Christian focused game. No swearing. Mom always wore a dress and never shorts/pants.\n\nWell he came back home after college for a visit so I dropped by his parent's house to hang out with him.\n\nGo back down the basement fully expecting to see his brothers playing some Christian Gamecube game or something. Nope Gears of War was being played. Ok they clearly found a loophole to get their parents to buy it for them right?\n\nWell I hear his dad upstairs \"FUCKING GOD DAMMIT!\" What the fuck did I just hear? We go upstairs and see his dad smashed his finger with a hammer by mistake and his mom cames running in with shorts on.\n\nNever thought Id see his family have that drastic of a change. Sure enough their family saw the same shit I saw. The hypocrisy of the Christian faith. They ended up the same way I am. Christian values are key but fuck all the rest of it.",
                      "timestamp": "2022-09-20 22:16:28",
                      "score": 15,
                      "num_children": 1,
                      "author": 176669,
                      "replies": [
                        {
                          "id": "ipajtu8",
                          "text": "Haha, that's a GREAT story. And agreed, Evangelical Christians more or less commit the same \"vices\" as non-Christians, they just don't talk about it/hide it so that makes it \"okay.\" A child of a liberal college educated mother has a 9% chance of being born within wedlock, a child of a non-college educated conservative mother MIGHT have a 40% chance of being born within wedlock. \n\nYeah, I have found that my classmates have gone one of two ways:  \nEven more extreme, hyper Christian Trumper types\n\nOR (much more likely)\n\nHave ditched the faith altogether, and don't attend church except for Easter or Christmas if family pressures them enough",
                          "timestamp": "2022-09-21 04:55:01",
                          "score": 3,
                          "num_children": 1,
                          "author": 408587,
                          "replies": [
                            {
                              "id": "ipcdkgk",
                              "text": "> Even more extreme, hyper Christian Trumper types\n\nYa thats how one of my old school friends went. His situation was a little different though since his father was a pastor. His older brother from what Iv heard also became a pastor.\n\n> Have ditched the faith altogether, and don't attend church except for Easter or Christmas if family pressures them enough\n\nThat was something that me and my mom attempted but when you do that the church does not remember all those years of you attending church and treat you like you are a sinner coming back into the flock.",
                              "timestamp": "2022-09-21 15:38:49",
                              "score": 1,
                              "num_children": 1,
                              "author": 176669,
                              "replies": [
                                {
                                  "id": "ipjvwyi",
                                  "text": "Do they expect you to come back if you attend church then? I don't recall any of my churches pressuring anyone to come back to church if they were present at the Christmas or Easter services.",
                                  "timestamp": "2022-09-23 02:27:54",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 408587,
                                  "replies": [
                                    {
                                      "id": "ipk0ye7",
                                      "text": "It was not really that they pressured you to go to church again.\n\nLike people we were good friends with from school/church the ones that parents talk for an hour after something. They wanted nothing to do with us when we showed up for those special services.",
                                      "timestamp": "2022-09-23 03:11:58",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 176669,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ip98pr6",
                      "text": "I am upset because all those students will be waisting time with it. When they can be learning STEM",
                      "timestamp": "2022-09-20 22:39:24",
                      "score": 7,
                      "num_children": 3,
                      "author": 335335,
                      "replies": [
                        {
                          "id": "ip9eyfi",
                          "text": "I'm taking an English degree and this semester have both Islam and the West and Literature and Spirituality. \n\nI'm finding the Islam and the West is covering all the bases from my conservative christian upbringing. Especially the political stuff.\n\nIt's pretty alarming really.",
                          "timestamp": "2022-09-20 23:25:01",
                          "score": 4,
                          "num_children": 1,
                          "author": 203751,
                          "replies": [
                            {
                              "id": "ipa4jah",
                              "text": "The parallels are astounding",
                              "timestamp": "2022-09-21 02:40:46",
                              "score": 1,
                              "num_children": 0,
                              "author": 335335,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ipajdbh",
                          "text": "Ah, I get that. Well, rich conservatives will ensure that their babies receive the finest secular, Ivy League education that this country will offer.\n\nAnd yes, say no to religion, yes to STEM, reason, and rationality! I can't wait for Atheist, STEM focused China to desecrate us personally and Christians in this country to cry out to a god who doesn't exist. It's gonna be HILARIOUS.",
                          "timestamp": "2022-09-21 04:50:28",
                          "score": 1,
                          "num_children": 1,
                          "author": 408587,
                          "replies": [
                            {
                              "id": "ipaogel",
                              "text": "China is falling as well.  Like their system is going to collapse financially. A ton of companies are leaving china. for security and just because trade secrets basically are stolen. They also want to deversitify their supply chains. Because of the severe lockdowns in china.  it basically caused a global recession",
                              "timestamp": "2022-09-21 05:44:19",
                              "score": 2,
                              "num_children": 2,
                              "author": 335335,
                              "replies": [
                                {
                                  "id": "ipap079",
                                  "text": "Western sources on China/DRPK/Russia can't be trusted",
                                  "timestamp": "2022-09-21 05:50:46",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 188199,
                                  "replies": []
                                },
                                {
                                  "id": "ipaor5x",
                                  "text": "Sounds like you have been consuming the American propaganda train too. No, Atheist China has already usurped us in multiple measures, and as their kids consume actual STEM vs. \"dinosaurs in saddles,\" they will 100% be able to blow us away in war. Tons of companies, you mean like 10% ROFL. Most American companies will continue to do business there, the cheap labor and lack of regulation is WAY too sweet to give up. Those same companies will sell us out in 10 seconds to make money as well :)",
                                  "timestamp": "2022-09-21 05:47:50",
                                  "score": 0,
                                  "num_children": 1,
                                  "author": 408587,
                                  "replies": [
                                    {
                                      "id": "ipatwdk",
                                      "text": "I am saying they are looking elsewhere. South America, africa, india etc. \n\nThe cost of chinese labor has gone up. and the simple fact of spreading out your supply chain is always a good idea. Its shown us that.\n\nAnd IP theft is real in china. Thats like a huge liability  to your company.  China will be losing econemic power in the next 10 years just watch. \n\nYou have been going hard on the CPP propaganda. Silicon manufacturing is already shifting away from china. of course corps will still do business there duh. but what business and how much will change.  But  it would not be surprising to see a 10 to 20 % movement away from china. \n\nI am very much a realist. companies are looking to reduce loses.  Simplified its a case of dont put all your eggs in just one basket.",
                                      "timestamp": "2022-09-21 06:48:52",
                                      "score": 2,
                                      "num_children": 0,
                                      "author": 335335,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ipb9l82",
                          "text": "I am upset because all those students will be wasting time with it. When they can be learning ~~STEM~~ literally anything real.",
                          "timestamp": "2022-09-21 10:20:55",
                          "score": 1,
                          "num_children": 0,
                          "author": 186702,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ip6y70h",
              "text": "Thank you for reminding us all of this. :)",
              "timestamp": "2022-09-20 13:39:13",
              "score": 18,
              "num_children": 0,
              "author": 165283,
              "replies": []
            },
            {
              "id": "ip73jgd",
              "text": "Cool, the first part looks like it would be in GTA VI.",
              "timestamp": "2022-09-20 14:17:13",
              "score": 9,
              "num_children": 0,
              "author": 3640,
              "replies": []
            },
            {
              "id": "ip9ekqh",
              "text": "Generically speaking they're essentially trying to be social workers without the appropriate tools.",
              "timestamp": "2022-09-20 23:22:11",
              "score": 3,
              "num_children": 0,
              "author": 203751,
              "replies": []
            }
          ]
        },
        {
          "id": "ip7aggc",
          "text": "This is why we have to keep talking about it. I am so ever grateful for all the various people who challenged me and my faith over the years. In the moment in specific conversations, I had disagreed with them and even argued back (thinking I was doing the right thing), but little by little it unraveled for me and it finally clicked what a big scam religion is.\n\nSecularity all the way.",
          "timestamp": "2022-09-20 15:03:31",
          "score": 20,
          "num_children": 1,
          "author": 59602,
          "replies": [
            {
              "id": "ip7i5ko",
              "text": "my dad was a lutheran pastor and a chaplain in the us army. talk about a scam. his job was to convince soldiers that murdering for the state is morally acceptable and expected- iow whitewashing war for those who'd be committing war. he watched a lot of soldiers die while he was doing last rites. he got so familiar with seeing death he could tell when they couldn't be resuscitated.",
              "timestamp": "2022-09-20 15:53:06",
              "score": 13,
              "num_children": 0,
              "author": 210541,
              "replies": []
            }
          ]
        },
        {
          "id": "ip7ollj",
          "text": "It seems not surprisingly that the most predatory and exploitative preachers out there (ex. Televangelists) are by far the most passionate about Trump and the theocratic Fascist ideology he seems to embrace. \n\nI think that's because they see it as a great way to maintain their power at a time of declining religious attendance/belief throughout the country and siphon tons of money from their followers in the process. This definitely was amplified by Covid where you saw lots of preachers who didn't care about the health and well-being of their followers demanding that they do everything possible to fight against quarantine rules and show up for church in person no matter the health risks (which I'm sure totally didn't have anything to do with making sure the church kept getting the tax free, largely untraceable cash donations they were used to receiving every Sunday). It shouldn't be a shocker that many of these churches that demanded people show up and couldn't be bothered to temporarily conduct services online due to the risk of losing members/donation money seem to be heavily aligned with Trumpism despite all the supposed rules out there about expressing political opinions at the pulpit.\n\nOn the flipside though, this type of reactionary backlash seems to have happened before in places like Europe and led to a rapid decline in religion in the long run after periods such as WWII. Lots of these religious institutions pinned their hopes of survival on far-right fascist ideology but ultimately were abandoned by much of the population. Hopefully, we will see the same thing happen here if we're lucky...",
          "timestamp": "2022-09-20 16:33:59",
          "score": 11,
          "num_children": 0,
          "author": 109053,
          "replies": []
        },
        {
          "id": "ip9x543",
          "text": "I don't see this as a positive. Evangelical religions are so toxic that the only option as a reasonable person is to leave which means the remaining evangelicals are even more extreme because the cooler heads are gone.",
          "timestamp": "2022-09-21 01:43:33",
          "score": 0,
          "num_children": 1,
          "author": 36352,
          "replies": [
            {
              "id": "ipa6pt1",
              "text": "> I don't see this as a positive.\n\nIt means one less kook in the world. You get that, right?",
              "timestamp": "2022-09-21 02:57:56",
              "score": 1,
              "num_children": 0,
              "author": 165283,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip74uoq",
      "text": "We should be clear on one point:\n\nMaking personal choices based on your beliefs is *religious freedom*, but forcing other people's decisions based on your beliefs is *religious oppression*.\n\nCan we start calling out these politicians for what they are doing?",
      "timestamp": "2022-09-20 14:26:12",
      "score": 242,
      "num_children": 4,
      "author": 2262,
      "replies": [
        {
          "id": "ip7c98r",
          "text": "It's religious terrorism, oppression is too light of a word here, in my opinion.",
          "timestamp": "2022-09-20 15:15:23",
          "score": 71,
          "num_children": 1,
          "author": 80755,
          "replies": [
            {
              "id": "ip7erir",
              "text": "I tend to think religious terrorism is what's going on in Iran right now where young women are picked up and murdered by the clothing police and the government unanimously stands behind it. While the US has fallen into a sad state, it's still many steps from that level (at least so far).",
              "timestamp": "2022-09-20 15:31:46",
              "score": 23,
              "num_children": 5,
              "author": 2262,
              "replies": [
                {
                  "id": "ip7ohhl",
                  "text": " Not too far, in some states you can be imprisoned for having an abortion. Now they're going after contraceptives. How far are we from Fornication Under Consent of the King? The irony of it is that the man they would like to make King is the biggest fornicator of all. He's even hinted that his daughter catches his eye. Doesn't seem to bother his base one bit.",
                  "timestamp": "2022-09-20 16:33:16",
                  "score": 22,
                  "num_children": 2,
                  "author": 104754,
                  "replies": [
                    {
                      "id": "ip87pft",
                      "text": "They can eat bullets before they command me to accept rape.",
                      "timestamp": "2022-09-20 18:34:34",
                      "score": 8,
                      "num_children": 0,
                      "author": 244330,
                      "replies": []
                    },
                    {
                      "id": "ip806h6",
                      "text": "He didn't hint. He literally said, \"if she wasn't my daughter I'd date her\" clip on YouTube",
                      "timestamp": "2022-09-20 17:46:07",
                      "score": 5,
                      "num_children": 0,
                      "author": 186350,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ip874yy",
                  "text": "The US is not at all many steps from religious terrorism. It just seems like it because hindsight is such a fucker that we often don't see what's spread out before us with any clarity. I mean, we're at a point in history where women [can be prosecuted for having a miscarriage](https://www.npr.org/2022/07/03/1109015302/abortion-prosecuting-pregnancy-loss). If that isn't the start of religious terrorism, I don't know what is.",
                  "timestamp": "2022-09-20 18:30:45",
                  "score": 10,
                  "num_children": 0,
                  "author": 275385,
                  "replies": []
                },
                {
                  "id": "ip7zx5p",
                  "text": "Yeah. America is headed in the same direction",
                  "timestamp": "2022-09-20 17:44:30",
                  "score": 7,
                  "num_children": 1,
                  "author": 186350,
                  "replies": [
                    {
                      "id": "ip85anq",
                      "text": "It's certainly worrisome when politicians openly call for the US to go that way. I'm still cautiously optimistic that enough reason will prevail. But more emphasis on caution than on optimism.",
                      "timestamp": "2022-09-20 18:18:47",
                      "score": 5,
                      "num_children": 0,
                      "author": 2262,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ip8lm1z",
                  "text": "Tell that to women of color!",
                  "timestamp": "2022-09-20 20:03:58",
                  "score": 3,
                  "num_children": 0,
                  "author": 71922,
                  "replies": []
                },
                {
                  "id": "ipaphgo",
                  "text": "Just because it looks different in the US, doesn't mean it's not the same. People are dying because doctors are scared to do procedures until the 'danger to life' threshold is met. People are in jail (have been in jail) for miscarriages. Rapists have right to sue for parental rights.",
                  "timestamp": "2022-09-21 05:56:19",
                  "score": 1,
                  "num_children": 0,
                  "author": 188199,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ip87cno",
          "text": "Remember when Obama was President and they were screaming about him letting Muslims invade the US to install Sharia Law? I guess it's A-OK when Christians do it /s",
          "timestamp": "2022-09-20 18:32:11",
          "score": 12,
          "num_children": 1,
          "author": 41914,
          "replies": [
            {
              "id": "ip88gga",
              "text": "The classic rules for thee and none for me. Seems to happen a lot in religious circles.",
              "timestamp": "2022-09-20 18:39:33",
              "score": 3,
              "num_children": 0,
              "author": 2262,
              "replies": []
            }
          ]
        },
        {
          "id": "ip7f7f7",
          "text": "https://imgur.com/88KXRHd",
          "timestamp": "2022-09-20 15:34:40",
          "score": 8,
          "num_children": 0,
          "author": 400752,
          "replies": []
        },
        {
          "id": "ip74yyl",
          "text": "Thank you for this.",
          "timestamp": "2022-09-20 14:27:00",
          "score": 4,
          "num_children": 0,
          "author": 66361,
          "replies": []
        }
      ]
    },
    {
      "id": "ip6xiy0",
      "text": "The Republican Supreme Court has destroyed the separation of church and state.",
      "timestamp": "2022-09-20 13:34:16",
      "score": 122,
      "num_children": 3,
      "author": 80119,
      "replies": [
        {
          "id": "ip7b5en",
          "text": "That’s why we need to MAKE SURE a progressive, Democrat/liberal/science-minded president is in office in the next few election cycles. The oldest conservative justices are in their mid-70s and will need to retire or pass soon due to old age and a *progressive president* needs to appoint the next ones to balance the court again. \n\nMy Christian evangelical family always said “we aren’t voting for the president, we are voting for the Supreme Court” bc they know what the SC can do (regards to abortion, etc). So even the ones who didn’t like Trump voted for him specifically to get that SC pick appointed.",
          "timestamp": "2022-09-20 15:08:06",
          "score": 57,
          "num_children": 2,
          "author": 59602,
          "replies": [
            {
              "id": "ip80lmp",
              "text": "You vote your personality. That's a fact",
              "timestamp": "2022-09-20 17:48:45",
              "score": 6,
              "num_children": 0,
              "author": 186350,
              "replies": []
            },
            {
              "id": "ip8l4qo",
              "text": "On the other hand, I remember \"progressives\" saying \"don't threaten me with the Supreme Court\" in 2016.",
              "timestamp": "2022-09-20 20:00:52",
              "score": 3,
              "num_children": 0,
              "author": 191181,
              "replies": []
            }
          ]
        },
        {
          "id": "ip73w0v",
          "text": "Leonard Leo picked the 6 conservative justices.",
          "timestamp": "2022-09-20 14:19:40",
          "score": 9,
          "num_children": 0,
          "author": 359381,
          "replies": []
        },
        {
          "id": "ip80gd8",
          "text": "You can't tell me Trump didn't get a huge payout for planting Catholics on the SC",
          "timestamp": "2022-09-20 17:47:49",
          "score": 2,
          "num_children": 0,
          "author": 186350,
          "replies": []
        }
      ]
    },
    {
      "id": "ip77rnc",
      "text": "Remember everyone; Abortion is only reserved for when the Republicans get their Mistresses pregnant, or their Daughter gets knocked up.",
      "timestamp": "2022-09-20 14:45:43",
      "score": 88,
      "num_children": 2,
      "author": 339010,
      "replies": [
        {
          "id": "ip7yxgn",
          "text": "Or the kid they touched gets knocked up",
          "timestamp": "2022-09-20 17:38:20",
          "score": 23,
          "num_children": 2,
          "author": 7215,
          "replies": [
            {
              "id": "ip8nuga",
              "text": "It's honestly a win win for them:\n\nIf they get married to the kid, they can keep her trapped in the kitchen, and unable to progress in education or career. They can beat her, cheat on her, and the church will blame HER. \n\nOn the other hand, they can also tell her to abort, the church will tell her to respect the patriarchy, and he can rid of her quickly.",
              "timestamp": "2022-09-20 20:18:20",
              "score": 7,
              "num_children": 0,
              "author": 408587,
              "replies": []
            },
            {
              "id": "ip8al7o",
              "text": "That too!!",
              "timestamp": "2022-09-20 18:53:29",
              "score": 2,
              "num_children": 0,
              "author": 339010,
              "replies": []
            }
          ]
        },
        {
          "id": "ip8c94h",
          "text": "[“The Only Moral Abortion is My Abortion”  When the Anti-Choice Choose](https://joycearthur.com/abortion/the-only-moral-abortion-is-my-abortion/)",
          "timestamp": "2022-09-20 19:04:17",
          "score": 9,
          "num_children": 1,
          "author": 274114,
          "replies": [
            {
              "id": "ip9l45e",
              "text": "Damn, ain’t that some shit",
              "timestamp": "2022-09-21 00:11:44",
              "score": 3,
              "num_children": 1,
              "author": 339010,
              "replies": [
                {
                  "id": "ipbo2w6",
                  "text": "Yup, utter hypocrites.",
                  "timestamp": "2022-09-21 12:43:51",
                  "score": 3,
                  "num_children": 0,
                  "author": 274114,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip7au74",
      "text": "Christianity is dying and this is how they're trying to remain relevant - force. Fuck them all.",
      "timestamp": "2022-09-20 15:06:05",
      "score": 46,
      "num_children": 0,
      "author": 191958,
      "replies": []
    },
    {
      "id": "ip6uuyg",
      "text": "They are also trying to make IVF illegal since embryos are often discarded.\n\nMy daughter wouldn't be here without IVF.",
      "timestamp": "2022-09-20 13:14:11",
      "score": 128,
      "num_children": 8,
      "author": 313875,
      "replies": [
        {
          "id": "ip76ou9",
          "text": "Prolifers are the worst people, what makes them worse is the fact that they have audacity to think they are good guys",
          "timestamp": "2022-09-20 14:38:37",
          "score": 86,
          "num_children": 3,
          "author": 333070,
          "replies": [
            {
              "id": "ip7ich4",
              "text": "they are just using anti-abortion as a way to whitewash themselves for all the other harms they are doing to society.",
              "timestamp": "2022-09-20 15:54:20",
              "score": 21,
              "num_children": 0,
              "author": 210541,
              "replies": []
            },
            {
              "id": "ip7z3bu",
              "text": "I think they have confused God with Lucifer. Satan kills 10 people in the bible\nGod kills EVERYBODY. TWICE.",
              "timestamp": "2022-09-20 17:39:22",
              "score": 15,
              "num_children": 1,
              "author": 186350,
              "replies": [
                {
                  "id": "ipa2w8g",
                  "text": "The flood and ...?  What is the other time?",
                  "timestamp": "2022-09-21 02:28:05",
                  "score": 1,
                  "num_children": 1,
                  "author": 73190,
                  "replies": [
                    {
                      "id": "ipbsg1x",
                      "text": "My bad. I was thinking about a different religion",
                      "timestamp": "2022-09-21 13:17:54",
                      "score": 1,
                      "num_children": 0,
                      "author": 186350,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ip7ysy2",
              "text": "Shouldn’t pro-forced birthers be happy IVF is being made illegal? Going based on their logic, I’m confused?",
              "timestamp": "2022-09-20 17:37:33",
              "score": 9,
              "num_children": 1,
              "author": 7215,
              "replies": [
                {
                  "id": "ip8hzxk",
                  "text": "they are, that's what the op was saying --no IVF = no unimplanted embryo-\"people\" being murdered (or used to develop stem cell technology...)",
                  "timestamp": "2022-09-20 19:40:56",
                  "score": 3,
                  "num_children": 0,
                  "author": 20404,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ip7yvql",
          "text": "Get rid of abortion and IVF but don't go after men who ejaculate with no plans of procreation. Every child starts with a dick.\nREGULATE THOSE",
          "timestamp": "2022-09-20 17:38:02",
          "score": 15,
          "num_children": 3,
          "author": 186350,
          "replies": [
            {
              "id": "ip865ux",
              "text": "They are flat out rewarding rape, especially if it's done with the express purpose of impregnating a woman/girl.",
              "timestamp": "2022-09-20 18:24:23",
              "score": 8,
              "num_children": 0,
              "author": 313875,
              "replies": []
            },
            {
              "id": "ip88r9z",
              "text": "Every sperm is sacred; every sperm is great. When a sperm is wasted, God gets quite irate.",
              "timestamp": "2022-09-20 18:41:31",
              "score": 3,
              "num_children": 1,
              "author": 367660,
              "replies": [
                {
                  "id": "ip951pk",
                  "text": "Pregnancy requires an active component which only **men** carry: sperm. It’s literally swimming around, it actively seeks out the egg. The egg is floating around giving off chemicals to be found but it’s men who need to be regulated. \n\nThey have a loaded weapon in their pants yet no regulation.",
                  "timestamp": "2022-09-20 22:13:13",
                  "score": 2,
                  "num_children": 1,
                  "author": 1125,
                  "replies": [
                    {
                      "id": "ip9dzdj",
                      "text": "I, for one, fully support the demilitarization of my penis. It's been wielding its power all willy nilly for far too long.",
                      "timestamp": "2022-09-20 23:17:54",
                      "score": 1,
                      "num_children": 0,
                      "author": 367660,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ip9wqog",
              "text": "Prison for women, graham crackers for men.",
              "timestamp": "2022-09-21 01:40:28",
              "score": 1,
              "num_children": 0,
              "author": 254853,
              "replies": []
            }
          ]
        },
        {
          "id": "ip74g46",
          "text": "Very pro life of them",
          "timestamp": "2022-09-20 14:23:27",
          "score": 16,
          "num_children": 0,
          "author": 408296,
          "replies": []
        },
        {
          "id": "ip8hljk",
          "text": "My entire career researching a cure for Type 1 Diabetes wouldn't be here!  Our main stem cell line is from a donated IVF embryo.\n\nSo many repercussions and unintended consequences when zealots look at a colorful world in Black and White.\n\n\nI am so happy you got to be a parent <3",
          "timestamp": "2022-09-20 19:38:26",
          "score": 4,
          "num_children": 0,
          "author": 20404,
          "replies": []
        },
        {
          "id": "ip7io2k",
          "text": "What the actual fuck.",
          "timestamp": "2022-09-20 15:56:23",
          "score": 3,
          "num_children": 0,
          "author": 297040,
          "replies": []
        },
        {
          "id": "ip7tt4b",
          "text": "Is it actually being made illegal or is not being practiced because doctors are too scared Incase of abortion/miscarriage?",
          "timestamp": "2022-09-20 17:06:13",
          "score": 3,
          "num_children": 1,
          "author": 339508,
          "replies": [
            {
              "id": "ip7zkqs",
              "text": "They are trying to ban abortion nationally now.",
              "timestamp": "2022-09-20 17:42:21",
              "score": 2,
              "num_children": 1,
              "author": 186350,
              "replies": [
                {
                  "id": "ip8g143",
                  "text": "I meant specifically IVF. I know.... It's all over reddit.",
                  "timestamp": "2022-09-20 19:28:31",
                  "score": 1,
                  "num_children": 0,
                  "author": 339508,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ip8t5kp",
          "text": "The world without abortion is much, much worse.  They get to pretend they are the good people by creating more emotional, mental and physical abuse.  And they don't support anything that helps these unwanted children survive, or have functional lives.\n\nBecause they find 1 story where some women was kept from having an abortion and has \"never been happier she changed her mind\" and ignore how that's the best and least likely outcome.\n\nAlso they were tricked into being anti-abortion with horror stories of things that \"might happen based on the laws\" even when they never did and never would because the most wide open laws leave it to **medical professionals**, so the law has no restrictions because legislation is not how you manage healthcare decisions.",
          "timestamp": "2022-09-20 20:52:09",
          "score": 3,
          "num_children": 0,
          "author": 361123,
          "replies": []
        },
        {
          "id": "ip847eh",
          "text": "Women being unable to choose when to have children hugely reduces the chance of women ending up in positions of power. I wonder how much halving their competition plays into the decisions of these dickheads.",
          "timestamp": "2022-09-20 18:11:40",
          "score": 6,
          "num_children": 0,
          "author": 198742,
          "replies": []
        }
      ]
    },
    {
      "id": "ip7acsz",
      "text": "Yet the Bible never even condemns abortion.",
      "timestamp": "2022-09-20 15:02:51",
      "score": 31,
      "num_children": 2,
      "author": 279343,
      "replies": [
        {
          "id": "ip81iy4",
          "text": "Christians do a lot of talking FOR their God.",
          "timestamp": "2022-09-20 17:54:28",
          "score": 10,
          "num_children": 2,
          "author": 186350,
          "replies": [
            {
              "id": "ip8y12l",
              "text": "If they didn’t invent dogmatic law, how else would they scare people into tithing?",
              "timestamp": "2022-09-20 21:24:34",
              "score": 1,
              "num_children": 0,
              "author": 135769,
              "replies": []
            },
            {
              "id": "ipcro4f",
              "text": "If God really did exist, it would seem he’s completely incapable of speaking to man.",
              "timestamp": "2022-09-21 17:06:14",
              "score": 1,
              "num_children": 0,
              "author": 259813,
              "replies": []
            }
          ]
        },
        {
          "id": "ip82b49",
          "text": "But the mental gymnastics trying to convince you otherwise is at least entertaining.",
          "timestamp": "2022-09-20 17:59:24",
          "score": 2,
          "num_children": 0,
          "author": 361556,
          "replies": []
        }
      ]
    },
    {
      "id": "ip7puwe",
      "text": "It won't be just for abortions.\n \nThere is a woman in Oklahoma who is sitting in jail right now convicted of manslaughter for having a miscarriage. Something similar has happened 1,254 other times in Red States over the last 15 years.\n\nhttps://www.motherjones.com/politics/2022/05/roe-abortion-miscarriage-crime-murder-prosecution/\n\nWhy are more women soon to be sitting in jail after they have an abortion?  Because women can do a medical abortion in the privacy of their own homes and it's hard to tell that it wasn't a miscarriage.  \n\nThe Republicans will never let that stand. They demand punishment for every abortion and they'll gladly point their cruel and heartless sights at women",
      "timestamp": "2022-09-20 16:41:48",
      "score": 32,
      "num_children": 2,
      "author": 7016,
      "replies": [
        {
          "id": "ip829p9",
          "text": "Republicans are killing women. Period.",
          "timestamp": "2022-09-20 17:59:09",
          "score": 16,
          "num_children": 1,
          "author": 186350,
          "replies": [
            {
              "id": "ip9hoe5",
              "text": "They’re abusers using the GQP moniker to hide their real agenda: tomake women subservient to men/him again by using State and Federal law to force her to carry a pregnancy to term. \n\nKeeping a woman pregnant against her wishes is abusive. Causing her to be pregnant consistently and continually is abusive.",
              "timestamp": "2022-09-20 23:45:18",
              "score": 7,
              "num_children": 0,
              "author": 1125,
              "replies": []
            }
          ]
        },
        {
          "id": "ip95j6z",
          "text": "So what happens to the men? I can’t get pregnant without one, so why wouldn’t he be sitting in jail with me?? We need someone to introduce laws to punish the men as well. Or allow me to sue them for getting me pregnant…they release millions of sperm at a time, I’m only fertile in a very short window, I’d argue they are more responsible for pregnancy.",
          "timestamp": "2022-09-20 22:16:40",
          "score": 1,
          "num_children": 1,
          "author": 111061,
          "replies": [
            {
              "id": "ip9ekmy",
              "text": "That will just result in ensuring men turn their loved ones in to avoid jail. Bad take.",
              "timestamp": "2022-09-20 23:22:10",
              "score": 2,
              "num_children": 0,
              "author": 92080,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip7hwf2",
      "text": "[deleted]",
      "timestamp": "2022-09-20 15:51:29",
      "score": 22,
      "num_children": 2,
      "replies": [
        {
          "id": "ip81l4h",
          "text": "They cover it up",
          "timestamp": "2022-09-20 17:54:51",
          "score": 10,
          "num_children": 0,
          "author": 186350,
          "replies": []
        },
        {
          "id": "ipcs5r0",
          "text": "They stick with boys since they can’t get pregnant. So much easier to cover up!",
          "timestamp": "2022-09-21 17:09:20",
          "score": 1,
          "num_children": 0,
          "author": 259813,
          "replies": []
        }
      ]
    },
    {
      "id": "ip7ks75",
      "text": "One of the worst things evangelicals have done is make the word abortion a bad moral word. It's a medical term for fucks sake. At the end of the day they want to ban all elective abortions and make it so a woman can't get medical care while she is pregnant unless she is literally dying in the hospital. This is why there can't be compromise with them on this issue.",
      "timestamp": "2022-09-20 16:09:53",
      "score": 16,
      "num_children": 3,
      "author": 391457,
      "replies": [
        {
          "id": "ip85git",
          "text": "> unless she is literally dying in the hospital\n\nOr even if she is literally dying in the hospital because “it’s still murdering a baby”.",
          "timestamp": "2022-09-20 18:19:50",
          "score": 7,
          "num_children": 0,
          "author": 185877,
          "replies": []
        },
        {
          "id": "ip8o59y",
          "text": "They're so caught up on that that many of them go so far as to try to redefine the word \"abortion\" to exclude those abortions *they* consider to be acceptable.  \n\n>\"Oh, it's not an abortion if the woman's life is in danger.\"  \n\n>\"Oh, it's not an abortion if the fetus won't survive after birth.\" \n\n>\"Oh, it's not an abortion if it's a pregnant 10 year old.\n\nEtc.",
          "timestamp": "2022-09-20 20:20:12",
          "score": 4,
          "num_children": 1,
          "author": 178902,
          "replies": [
            {
              "id": "ip8pjnb",
              "text": "Yup... \n\nI see them saying that now when I talk to family members. \n\nNow they are trying to gatekeep and define what an abortion is or isn't, if it passes their morality test I suppose or what is a real one vs what isn't.",
              "timestamp": "2022-09-20 20:29:06",
              "score": 3,
              "num_children": 0,
              "author": 391457,
              "replies": []
            }
          ]
        },
        {
          "id": "ip9whdw",
          "text": ">\tOne of the worst things evangelicals have done\n\n The worst thing evangelicals have ever done is exist. They’re fucking 100% evil. The problem is, they may have crossed a threshold where they can’t be taken down through normal political methods. That’s my main fear.",
          "timestamp": "2022-09-21 01:38:30",
          "score": 3,
          "num_children": 0,
          "author": 251911,
          "replies": []
        }
      ]
    },
    {
      "id": "ip7gyqz",
      "text": "no forgiveness of sins here. you're getting punished till you die. there's no hate like x-tian love.",
      "timestamp": "2022-09-20 15:45:28",
      "score": 15,
      "num_children": 1,
      "author": 210541,
      "replies": [
        {
          "id": "ipcswqs",
          "text": "Suffering brings you closer to god.\n\nDying during childbirth is god’s will.\n\nDying young is a bonus because you get the shortcut to Heaven.\n\nMen on earth get to enjoy watching you suffer.\n\nSeems like a win all around! /s",
          "timestamp": "2022-09-21 17:14:05",
          "score": 1,
          "num_children": 0,
          "author": 259813,
          "replies": []
        }
      ]
    },
    {
      "id": "ip7l6c3",
      "text": "It’s not about beliefs it’s about harming women.",
      "timestamp": "2022-09-20 16:12:25",
      "score": 12,
      "num_children": 2,
      "author": 384029,
      "replies": [
        {
          "id": "ip8k1kx",
          "text": "Actually I’d say it’s about protecting bad actors and dismissing the harm it does to anyone it doesn’t protect. I don’t think they care enough about women as a group to try to actively harm them. It’s just that they couldn’t care less about anyone who’s not themselves, so the fact that women and others get hurt is only part of the agenda insofar as it’s a byproduct of their self-interest. They’re running on a single-issue platform of “me wantee.”",
          "timestamp": "2022-09-20 19:53:56",
          "score": 3,
          "num_children": 0,
          "author": 196146,
          "replies": []
        },
        {
          "id": "ip8stnv",
          "text": "Is it even legal to have a law that targets one sex?",
          "timestamp": "2022-09-20 20:50:03",
          "score": 1,
          "num_children": 1,
          "author": 147843,
          "replies": [
            {
              "id": "ip8v3z1",
              "text": "You think law makers care what is legal?",
              "timestamp": "2022-09-20 21:04:53",
              "score": 2,
              "num_children": 0,
              "author": 407948,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip6uoyv",
      "text": "It just makes me feel warm and fuzzy all over that these committed faux lifers are sending their mistresses and daughters across state lines to get abortions",
      "timestamp": "2022-09-20 13:12:55",
      "score": 36,
      "num_children": 1,
      "author": 256053,
      "replies": [
        {
          "id": "ip6v0y5",
          "text": "It doesn't make me feel warm and fuzzy because they can afford to do that. They can afford to fly their mistresses to Canada if they make abortion illegal nationwide.\n\nThis will not affect them one bit because they're all wealthy.",
          "timestamp": "2022-09-20 13:15:28",
          "score": 27,
          "num_children": 2,
          "author": 286151,
          "replies": [
            {
              "id": "ip6vefg",
              "text": "I hope you understand the concept of sarcasm",
              "timestamp": "2022-09-20 13:18:20",
              "score": 12,
              "num_children": 2,
              "author": 256053,
              "replies": [
                {
                  "id": "ip6vglg",
                  "text": "It wasn't clear to me that you were being sarcastic.",
                  "timestamp": "2022-09-20 13:18:49",
                  "score": 5,
                  "num_children": 2,
                  "author": 286151,
                  "replies": [
                    {
                      "id": "ip6vx29",
                      "text": "Sarcasm has never translated well on the internet, but the last decade has well and truly broken my ability to spot it as well.",
                      "timestamp": "2022-09-20 13:22:10",
                      "score": 15,
                      "num_children": 2,
                      "author": 402932,
                      "replies": [
                        {
                          "id": "ip6wvmf",
                          "text": "Yea shits really gotten bizarre over the last few years.Right up there with gay guys espousing n passing virulent \nanti gay legislation or Republicons defending Orange Jesus  for stealing top secrets and selling them to our adversaries.........",
                          "timestamp": "2022-09-20 13:29:22",
                          "score": 7,
                          "num_children": 0,
                          "author": 256053,
                          "replies": []
                        },
                        {
                          "id": "ip6w33v",
                          "text": "Poe's Law has only become more relevant as the years go on, unfortunately.",
                          "timestamp": "2022-09-20 13:23:26",
                          "score": 5,
                          "num_children": 0,
                          "author": 286151,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ip6vyvw",
                      "text": "The term faux lifers didn't clue you in?",
                      "timestamp": "2022-09-20 13:22:33",
                      "score": 8,
                      "num_children": 0,
                      "author": 256053,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ip7ircd",
                  "text": "except that there's truth to what you are saying, which makes it not so sarcastic.",
                  "timestamp": "2022-09-20 15:56:58",
                  "score": 0,
                  "num_children": 0,
                  "author": 210541,
                  "replies": []
                }
              ]
            },
            {
              "id": "ip80qtw",
              "text": "Rules for thee but not for me",
              "timestamp": "2022-09-20 17:49:39",
              "score": 4,
              "num_children": 1,
              "author": 186350,
              "replies": [
                {
                  "id": "ip9xylj",
                  "text": "The Republican Motto",
                  "timestamp": "2022-09-21 01:49:54",
                  "score": 3,
                  "num_children": 0,
                  "author": 401271,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip7nz2h",
      "text": "I was talking to my cousin last year, and he said that he thinks that his religious beliefs should be the law of the land. I literally don’t understand how someone can have that idea. I didn’t even think that when I was religious.",
      "timestamp": "2022-09-20 16:30:02",
      "score": 12,
      "num_children": 3,
      "author": 367438,
      "replies": [
        {
          "id": "ip7zoqo",
          "text": "It’s because half the populace are simpletons who cannot think past the idea that whatever they feel must be right and by extension must be forced on everybody else. The only chance we had to escape this was through universal public education of extremely high quality. This means no homeschooling, no religious schools no private schools. Instead everybody learns the same fact-based curriculum",
          "timestamp": "2022-09-20 17:43:02",
          "score": 8,
          "num_children": 0,
          "author": 80995,
          "replies": []
        },
        {
          "id": "ip82hg9",
          "text": "If I'm a Muslim, why does his religion get to decide and not my own religion?",
          "timestamp": "2022-09-20 18:00:31",
          "score": 6,
          "num_children": 2,
          "author": 186350,
          "replies": [
            {
              "id": "ip82udk",
              "text": "Because his is the one true church, according to him and other followers. Obviously /s",
              "timestamp": "2022-09-20 18:02:50",
              "score": 5,
              "num_children": 0,
              "author": 367438,
              "replies": []
            },
            {
              "id": "ip850vj",
              "text": "They believe that if he’s Christian he’s in a religion and if you’re Muslim you’re in a cult.",
              "timestamp": "2022-09-20 18:17:01",
              "score": 3,
              "num_children": 0,
              "author": 185877,
              "replies": []
            }
          ]
        },
        {
          "id": "ip9wrqw",
          "text": "It’s called indoctrination, zealotry, brainwashed. Many terms can be used to describe it but it boils down to their entire way of thinking has been molded by falsities and an evil agenda. They’re not free-thinking people.",
          "timestamp": "2022-09-21 01:40:41",
          "score": 2,
          "num_children": 0,
          "author": 251911,
          "replies": []
        }
      ]
    },
    {
      "id": "ip7p82o",
      "text": "What about women who could die from not having abortions?\n\n“Pro life” my ass",
      "timestamp": "2022-09-20 16:37:52",
      "score": 9,
      "num_children": 1,
      "author": 323605,
      "replies": [
        {
          "id": "ip81xwj",
          "text": "Pro-control",
          "timestamp": "2022-09-20 17:57:05",
          "score": 7,
          "num_children": 1,
          "author": 186350,
          "replies": [
            {
              "id": "ip82mnl",
              "text": "R'amen",
              "timestamp": "2022-09-20 18:01:26",
              "score": 6,
              "num_children": 0,
              "author": 323605,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip86cgr",
      "text": "They are also trying to ban abortion in all cases, stating that women should get back to their \"sacrificial\" natures and be willing to die for their fetus. The people proposing refusing dying women necessary healthcare would be shocked to be called murderers, yet here we are.",
      "timestamp": "2022-09-20 18:25:35",
      "score": 11,
      "num_children": 1,
      "author": 278912,
      "replies": [
        {
          "id": "ip9wykx",
          "text": ">\t“sacrificial”\n\nOh but that’s such an ugly word. “*Traditional*” is so much more marketable!",
          "timestamp": "2022-09-21 01:42:10",
          "score": 1,
          "num_children": 0,
          "author": 251911,
          "replies": []
        }
      ]
    },
    {
      "id": "ip7p3gp",
      "text": "It's a ploy to make women felons thus removing their ability to vote in many states. Rs play the long game. Without those pesky minority and women votes their plan for supremacy will go forward.",
      "timestamp": "2022-09-20 16:37:05",
      "score": 7,
      "num_children": 0,
      "author": 56816,
      "replies": []
    },
    {
      "id": "ip7igzq",
      "text": "All conservatives.",
      "timestamp": "2022-09-20 15:55:08",
      "score": 7,
      "num_children": 0,
      "author": 287695,
      "replies": []
    },
    {
      "id": "ip7o5lb",
      "text": "*Misinterpreted christian beliefs. \n\nNothing against abortion in the Bible. And if you suspect your wife is pregnant with another man's baby, you can do a ritual where god will snuff that out. That doesn't imply that fetuses have a soul that's more valuable than the man's property (the wife and children or fetuses) there are other passages. \n\nThe only reason Christians align to this is through right wing propaganda (and most Christians don't read their Bible and or depend on someone to tell them what a 'true christian' is.",
      "timestamp": "2022-09-20 16:31:09",
      "score": 7,
      "num_children": 2,
      "author": 340507,
      "replies": [
        {
          "id": "ip82u5u",
          "text": "I've read MULTIPLE comments from xtians saying, \"if a woman is raped her body will expel the child\" \nWhat?",
          "timestamp": "2022-09-20 18:02:47",
          "score": 5,
          "num_children": 1,
          "author": 186350,
          "replies": [
            {
              "id": "ip83cfd",
              "text": "What is the origin of this I wonder? Outside motivated reasoning to fabricate some coherency in their value system?\n\nRape unfortunately is very much a part of nature and there are fascinating and disturbing evidences of the sexual arms race (see duck genitalia).",
              "timestamp": "2022-09-20 18:06:02",
              "score": 4,
              "num_children": 1,
              "author": 340507,
              "replies": [
                {
                  "id": "ip8n6n3",
                  "text": "> What is the origin of this I wonder?\n\nIt's probably being preached in Christian churches.",
                  "timestamp": "2022-09-20 20:14:03",
                  "score": 3,
                  "num_children": 1,
                  "author": 178902,
                  "replies": [
                    {
                      "id": "ip8ncie",
                      "text": "I'm sure but I'm just wondering if there's something that they are twisting this from, like the whole \"illegitimate rape' idea.",
                      "timestamp": "2022-09-20 20:15:06",
                      "score": 1,
                      "num_children": 0,
                      "author": 340507,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ip9x38m",
          "text": ">\tChristians don’t read their Bible\n\nOf course not. Then they’d be atheists.",
          "timestamp": "2022-09-21 01:43:09",
          "score": 1,
          "num_children": 0,
          "author": 251911,
          "replies": []
        }
      ]
    },
    {
      "id": "ip819jq",
      "text": "> \"The taking of a life is murder, and it is illegal,\" state Rep. Danny McCormick told a committee of state lawmakers\n\nSo, a conscientious objection to military service? \n\nHow does he feel about capital punishment?\n\nAh.. he only said it's ilLEGAL, not imMORAL.",
      "timestamp": "2022-09-20 17:52:52",
      "score": 5,
      "num_children": 0,
      "author": 126417,
      "replies": []
    },
    {
      "id": "ip852za",
      "text": "What part of the bible is anti abortion?",
      "timestamp": "2022-09-20 18:17:23",
      "score": 6,
      "num_children": 1,
      "author": 34819,
      "replies": [
        {
          "id": "ip9xlsq",
          "text": "That’s irrelevant. Please don’t move the argument to their field. It wouldn’t matter if the Bible was nothing more than a hundred chapters on the evils of abortion: we are not (yet) a theocracy. We have an establishment clause that prohibits religious influence in legislature or policy. \n\nDon’t argue that the Bible doesn’t prohibit abortion, argue that their Bible is irrelevant.",
          "timestamp": "2022-09-21 01:47:11",
          "score": 0,
          "num_children": 1,
          "author": 251911,
          "replies": [
            {
              "id": "ipb5jmj",
              "text": "I mean... you can argue both...",
              "timestamp": "2022-09-21 09:27:21",
              "score": 1,
              "num_children": 1,
              "author": 286151,
              "replies": [
                {
                  "id": "ipbn0ej",
                  "text": "Arguing the biblical issue legitimizes it. Who cares what an ancient text says?",
                  "timestamp": "2022-09-21 12:35:12",
                  "score": 1,
                  "num_children": 1,
                  "author": 251911,
                  "replies": [
                    {
                      "id": "ipbn402",
                      "text": "How does pointing out all the falsehoods, inconsistencies, contradictions and horrors in the Bible legitimize it? If I show all the things that are terrible in Mein Kampf, do I legitimize it?",
                      "timestamp": "2022-09-21 12:35:59",
                      "score": 1,
                      "num_children": 1,
                      "author": 286151,
                      "replies": [
                        {
                          "id": "ipbqrs7",
                          "text": "No, it’s nothing to do with that. Im talking about bringing it into the conversation about legality, U.S. policy. Arguing bible doesn’t belong in a conversation about why something should be illegal or not in the U.S. because we have a constitutional amendment prohibiting the establishment of law based on religious rules. Therefore, when I say “legitimizes” I mean that it brings the subject to the table as though it has any relevance or right to be there.",
                          "timestamp": "2022-09-21 13:05:07",
                          "score": 1,
                          "num_children": 0,
                          "author": 251911,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip7mdg9",
      "text": "Okay! Let’s do the Christian thing and jail the man who did not control his property “the woman”. This is a clear case of negligent homicide. Jail the father, the rapist-soon to be husband or the husband.\n\nIf he raped her then he should have married her after buying her from her father. Deuteronomy 22:28–29\n\nIf she committed adultry then the Bible is explicit about performing an abortion ritual. Numbers 5:11-31",
      "timestamp": "2022-09-20 16:20:02",
      "score": 4,
      "num_children": 0,
      "author": 371687,
      "replies": []
    },
    {
      "id": "ip83pgw",
      "text": "I was given the option for a second trimester abortion because at 16 weeks it was obvious his intestines were on the outside of his stomach, floating in my amniotic fluid.\nI lived in Arkansas children's hospital for 3 years. He died right after he made it home. I wish I had gotten the abortion. The trauma my baby went through was not justified.\nLast advice I ever took from a \"pro-life\" xtian.",
      "timestamp": "2022-09-20 18:08:24",
      "score": 6,
      "num_children": 0,
      "author": 186350,
      "replies": []
    },
    {
      "id": "ip7eulb",
      "text": "Please volunteer for phone or text banking with your local democrats. Seriously. Call the state reps and ask what you can do to turn the vote out. It’s so easy and honestly, kinda fun. \n\nThey organize in churches, we need to organize everywhere else",
      "timestamp": "2022-09-20 15:32:20",
      "score": 14,
      "num_children": 1,
      "author": 38834,
      "replies": [
        {
          "id": "ip7vqx3",
          "text": "[removed]",
          "timestamp": "2022-09-20 17:18:24",
          "score": -3,
          "num_children": 1,
          "replies": [
            {
              "id": "ip874v8",
              "text": "At a time when the alternative is women and minorities continuing to lose rights, VOTE DEMOCRATIC. I’m talking school boards all the way up to POTUS. We need Dems in charge and Dems that we can push and hold accountable. Replace DEMS with progressives. Don’t split the vote. This is how republicans win. Every time an R wins its because Dems split the vote. \n\nWe need more AOC in the Democratic Party. Not AOC in a competing party. Seriously, Dems are progressive. We need the boomers and older OUT, so we can fucking lead.",
              "timestamp": "2022-09-20 18:30:44",
              "score": 3,
              "num_children": 0,
              "author": 38834,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip72ulx",
      "text": "And under that?\n\nMisogyny.",
      "timestamp": "2022-09-20 14:12:22",
      "score": 11,
      "num_children": 0,
      "author": 186683,
      "replies": []
    },
    {
      "id": "ip82p4r",
      "text": "Christianity is just another cult among many.",
      "timestamp": "2022-09-20 18:01:52",
      "score": 4,
      "num_children": 0,
      "author": 383714,
      "replies": []
    },
    {
      "id": "ip85ufc",
      "text": "The Bible endorses abortion in some situations  (adultery,  annoying God in some way)",
      "timestamp": "2022-09-20 18:22:19",
      "score": 5,
      "num_children": 0,
      "author": 334705,
      "replies": []
    },
    {
      "id": "ip868z9",
      "text": "Oh you mean the Christian Taliban",
      "timestamp": "2022-09-20 18:24:57",
      "score": 4,
      "num_children": 0,
      "author": 402959,
      "replies": []
    },
    {
      "id": "ip8aymm",
      "text": "I’m immediately reminded of stories of far right extremist conservative Christian women who get abortions and immediately turn on the doctor. You know, the ones who think their abortion is a special exception.\n\nThey’re about to have an interesting time.",
      "timestamp": "2022-09-20 18:55:55",
      "score": 3,
      "num_children": 0,
      "author": 234015,
      "replies": []
    },
    {
      "id": "ip71ujk",
      "text": "America is fragile country",
      "timestamp": "2022-09-20 14:05:19",
      "score": 9,
      "num_children": 1,
      "replies": [
        {
          "id": "ip7iuvm",
          "text": "we do have all these snowflakes on the right side of the political aisle.",
          "timestamp": "2022-09-20 15:57:36",
          "score": 7,
          "num_children": 0,
          "author": 210541,
          "replies": []
        }
      ]
    },
    {
      "id": "ip7qnlu",
      "text": "They obviously don’t realize how fucking insane they sound…",
      "timestamp": "2022-09-20 16:46:42",
      "score": 3,
      "num_children": 0,
      "author": 112609,
      "replies": []
    },
    {
      "id": "ip7xqky",
      "text": "It doesn't hurt that american prisons are money makers.",
      "timestamp": "2022-09-20 17:30:52",
      "score": 3,
      "num_children": 0,
      "author": 316480,
      "replies": []
    },
    {
      "id": "ip7yd5s",
      "text": "Any law at all that is purely based on religion without any attempt to make a rational case on secular grounds should be completely invalidated on first amendment grounds.",
      "timestamp": "2022-09-20 17:34:49",
      "score": 3,
      "num_children": 0,
      "author": 80995,
      "replies": []
    },
    {
      "id": "ip802gz",
      "text": "A rider should be added to makes it illegal to use any medication or devices to achieve an erection. If it's limp, it is god's will.",
      "timestamp": "2022-09-20 17:45:25",
      "score": 3,
      "num_children": 0,
      "author": 98960,
      "replies": []
    },
    {
      "id": "ip835qn",
      "text": "okay you got me yanks, i admit it: All lives are not sacred.\n\nanyone would be willing to throw anyone under the bus to protect themselves and theirs. it's biology. it's an animal instinct. it's a law of nature. at any given time on a moments notice your brain will produce a hierarchy pyramid of whose life is more important than whose. (whom? who's? idk nm) and act on it before you even realize it. \n\npretending to say otherwise is the essence of hypocrisy. and using this as a blanket argument to put your cult's opinion over others is exactly the same thing we bombed ISIS to the ground.",
      "timestamp": "2022-09-20 18:04:50",
      "score": 3,
      "num_children": 0,
      "author": 13386,
      "replies": []
    },
    {
      "id": "ip8mx87",
      "text": "Not an atheist myself, but AGREED. \n\nNo religion/ or non-religion practices should NOT be forced on people. Public sphere decisions should be personal. I whole heartedly believe abortion is a decision women must make themselves to maintain basic human rights over their body.\n\nI am of the opinion that even if you are religious and disagree with abortion, that should be something you would think god would be able to punish if it was truly bad. I hate when people try to play god and enforce themselves.",
      "timestamp": "2022-09-20 20:12:23",
      "score": 3,
      "num_children": 0,
      "author": 260130,
      "replies": []
    },
    {
      "id": "ip8n38l",
      "text": "The bible states several times it is pro-choice, and instructions are clearly given on how to perform abortions.\n\nThese aren't Christian beliefs, just ignorance protected on the ignorant.\n\nPro-choice has never been pro-abortion.",
      "timestamp": "2022-09-20 20:13:27",
      "score": 3,
      "num_children": 0,
      "author": 110117,
      "replies": []
    },
    {
      "id": "ip8pbl2",
      "text": "Politicians aren't Christians. They pretend for votes.",
      "timestamp": "2022-09-20 20:27:40",
      "score": 3,
      "num_children": 0,
      "author": 330705,
      "replies": []
    },
    {
      "id": "ip8ui91",
      "text": "How about jailing the chap that got them pregnant instead? You can't blame the biblically subservient, foolish women that have to be controlled and told what to do.",
      "timestamp": "2022-09-20 21:00:53",
      "score": 3,
      "num_children": 0,
      "author": 2891,
      "replies": []
    },
    {
      "id": "ip8undk",
      "text": "It's all about keeping the pedophile orphanages packed with fresh virgins.",
      "timestamp": "2022-09-20 21:01:50",
      "score": 3,
      "num_children": 0,
      "author": 298438,
      "replies": []
    },
    {
      "id": "ip8wpg2",
      "text": "When news footage of women being arrested for seeking abortions (along with health care providers/enablers), this will lead to backlash & major civil unrest, pitting red states against blue.",
      "timestamp": "2022-09-20 21:15:35",
      "score": 3,
      "num_children": 0,
      "author": 72776,
      "replies": []
    },
    {
      "id": "ip8xg42",
      "text": "It's the natural progression to suppress voting rights as felons can't vote in certain states.",
      "timestamp": "2022-09-20 21:20:37",
      "score": 3,
      "num_children": 0,
      "author": 209951,
      "replies": []
    },
    {
      "id": "ip89vsu",
      "text": "Everybody, get out and vote.",
      "timestamp": "2022-09-20 18:48:56",
      "score": 5,
      "num_children": 0,
      "author": 178073,
      "replies": []
    },
    {
      "id": "ip8ov4l",
      "text": "How about we jail all the priests molesting kids.    That's prohibited.\n\nBut does the bible prohibit abortion...\n\nOh that's right, the Bible doesn't prohibit abortion....there's actually instructions on how to do it \n\nGuess christians should read their own book more",
      "timestamp": "2022-09-20 20:24:44",
      "score": 4,
      "num_children": 0,
      "author": 225648,
      "replies": []
    },
    {
      "id": "ip81uim",
      "text": "This is a weak sauce. When religious people argued against slavery because they believed all human beings were children of God should we have just told them to keep the religious views to themselves?\n\nThe argument that life begins at conception is hardly religious in nature. It’s basic science.  Sure the argument that all human lives have value and dignity is religious/philosophical in nature, but so is the counter argument that some human lives don’t have value and dignity.",
      "timestamp": "2022-09-20 17:56:30",
      "score": 2,
      "num_children": 1,
      "author": 136091,
      "replies": [
        {
          "id": "ip9adld",
          "text": "> When religious people argued against slavery because they believed all human beings were children of God should we have just told them to keep the religious views to themselves?\n\nLook at US history before the Civil War.  The Sothern Baptist church was created entirely because it the national Baptist church was not pro-slavery enough for it.  A lot of northern Christians recognized that the Bible endorses slavery.",
          "timestamp": "2022-09-20 22:51:20",
          "score": 1,
          "num_children": 1,
          "author": 122319,
          "replies": [
            {
              "id": "ipka1b0",
              "text": "The antislavery movement was almost entirely Christian. Should they have all just shut up and kept their religious views to themselves?",
              "timestamp": "2022-09-23 04:46:38",
              "score": 0,
              "num_children": 1,
              "author": 136091,
              "replies": [
                {
                  "id": "ipkahvb",
                  "text": "The pro-slavery movement was entirely Christian as well.\n\nThat is the marvelous thing about the Bible.  It has so many different messages that people can pick and choose whatever they want.  Although the case of slavery makes it a lot easier to support slavery than to oppose it.  It is a credit to the altislavery Christians because they did what was morally right no matter what the Bible actually says about slavery.",
                  "timestamp": "2022-09-23 04:51:57",
                  "score": 2,
                  "num_children": 0,
                  "author": 122319,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip8zmcj",
      "text": "Abortions are discussed in the Bible though. Try harder",
      "timestamp": "2022-09-20 21:35:26",
      "score": 2,
      "num_children": 0,
      "author": 195467,
      "replies": []
    },
    {
      "id": "ip90jce",
      "text": "No, they want to push their narrative. That book has abortion on its pages in numbers, and such things were not to be abolished in Mathew. They're pushing nonsense with 8 billion currently living breathing humans, endorsing slavery to maybe.",
      "timestamp": "2022-09-20 21:41:37",
      "score": 2,
      "num_children": 0,
      "author": 82076,
      "replies": []
    },
    {
      "id": "ip92fub",
      "text": "It’s beginning to sound like they want to rape, force women to keep their children, or they go to jail if they don’t. That’s exactly what is being laid out. This is fucking terrifying…",
      "timestamp": "2022-09-20 21:54:43",
      "score": 2,
      "num_children": 0,
      "author": 144433,
      "replies": []
    },
    {
      "id": "ip92lxo",
      "text": "this kind of shit is the purest expression of the white anglo saxon male. This is his \"old country\" ideology...  how he could burn witches, slaughter ingigenous peoples across the planet and enslave africans with a smirk on his face and then sleep like a baby.",
      "timestamp": "2022-09-20 21:55:55",
      "score": 2,
      "num_children": 0,
      "author": 399665,
      "replies": []
    },
    {
      "id": "ip98128",
      "text": "Women who are convicted of felonies also cannot vote. Guess who will win in every election if women can no longer vote? They haven't been able to win without voter suppression, so they're doubling down.",
      "timestamp": "2022-09-20 22:34:32",
      "score": 2,
      "num_children": 0,
      "author": 141442,
      "replies": []
    },
    {
      "id": "ip9f6km",
      "text": "It's not even in their Bible. They just made shit up and decided it was sincere belief.",
      "timestamp": "2022-09-20 23:26:40",
      "score": 2,
      "num_children": 0,
      "author": 213886,
      "replies": []
    },
    {
      "id": "ip9ngvq",
      "text": "A couple of years ago one person I saw on Reddit pointed out that women would be jailed if abortions were made illegal. Everyone thought they were crazy for saying that and downvoted them.",
      "timestamp": "2022-09-21 00:29:43",
      "score": 2,
      "num_children": 0,
      "author": 185877,
      "replies": []
    },
    {
      "id": "ipb3jo9",
      "text": "Here's my counteroffer: instead of jailing women for seeking healthcare-related issues, let's start incarcerating politicians who have extramarital affairs. That should take care of about 95% of the Republican Party.",
      "timestamp": "2022-09-21 09:00:03",
      "score": 2,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ipb4q69",
      "text": "Abbott and Desantis just sent all those supposed illegal immigrants to all the sanctuary cities and top Democrats. Women should just start leaving unwanted babies at Republican lawmakers doorsteps.",
      "timestamp": "2022-09-21 09:16:20",
      "score": 2,
      "num_children": 0,
      "author": 269972,
      "replies": []
    },
    {
      "id": "ipb87q4",
      "text": "I'm quite certain that somewhere there is a still sensible centrist who says oh, this is just an example of the extremism on both sides. And if Chuck Todd can find them they'll be on meet the press next week.",
      "timestamp": "2022-09-21 10:03:32",
      "score": 2,
      "num_children": 0,
      "author": 49663,
      "replies": []
    },
    {
      "id": "ipblqrq",
      "text": "They should also punish the men that made them pregnant. No? Why not?",
      "timestamp": "2022-09-21 12:24:35",
      "score": 2,
      "num_children": 0,
      "author": 119956,
      "replies": []
    },
    {
      "id": "ip7vtzo",
      "text": "It’s not about religion, it’s about control!",
      "timestamp": "2022-09-20 17:18:57",
      "score": 4,
      "num_children": 1,
      "author": 289246,
      "replies": [
        {
          "id": "ip7vxzl",
          "text": "What do you think religion is for?",
          "timestamp": "2022-09-20 17:19:38",
          "score": 7,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "ip80879",
              "text": "Of course it’s a form of control but my point is that those people would try to do the same even if religion didn’t exist. Religion is just the means to an end.",
              "timestamp": "2022-09-20 17:46:25",
              "score": 1,
              "num_children": 0,
              "author": 289246,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip7pjiw",
      "text": "I hope this comment is not misunderstood: the only pro-forced birthers I’ve had “respect” for over the years are these guys. “Respect” for not being hypocrites. If you truly believe abortion is murder then it’s *always* murder and should be treated as such. Let’s take their assumption that from conception forward a zygote/fetus is a human life murdered by abortion. I’m going to speak next like I’m one of these asshole zealots.\n\nIt follows that *all abortions or actions that purposefully cause abortions are murder and should be treated as such.* Anyone involved in a murder should be tried and punished: the mother, doctors, nurses, drivers to the crime scene…just like for any other murder. Trial and jail.\n\nPregnant by rape or incest? No abortion. Why should you be allowed to murder a baby based on the manner of conception? Your fetus is malformed and perhaps cannot survive outside the womb? No abortion. It’s murder and that baby deserves every chance of trying to survive after birth. It doesn’t matter if they’d suffer for years with disabilities because we can’t go murdering people just for being disabled. IVF culling? Murder. Those babies should all have a chance to survive. Mother could die? Oh well, not an excuse to murder a baby. Your religion says it’s okay? Well, we don’t let your religion tell you you can beat or rob people so it can’t tell you to murder a baby. Etc. If willful murder is wrong then it’s a crime. Can I bomb an empty abortion clinic? Yes! It’s a location where people gather to murder.\n\nAn old boyfriend and I got into an argument before I left FB. He said abortion clinic medical staff should go to jail for murder. I asked about the mothers. Oh, he says, not them! They were just led astray. All of them. The hypocrisy was ugly. His infantilizing of women was appalling and I told him so. I guess us women who want abortions are too stupid to understand the consequences of our actions. I dated him - he knows I’m a smart woman with a college education but suddenly I’m too stupid to recognize murder when I see it.\n\nI say let ‘em talk like this. It’s logical.",
      "timestamp": "2022-09-20 16:39:51",
      "score": 1,
      "num_children": 2,
      "author": 239214,
      "replies": [
        {
          "id": "ip7z96m",
          "text": "The only possible rationale for believing that a fertilized egg is a human being is the whack job religious concept of God infusing a soul into it. Passing laws holy based on religious belief is leading us down a very miserable path",
          "timestamp": "2022-09-20 17:40:22",
          "score": 6,
          "num_children": 0,
          "author": 80995,
          "replies": []
        },
        {
          "id": "ipa86p3",
          "text": "I totally get what you are saying.  These people at least have a consistent (albeit wrong) moral theory.  Similarly, evangelicals who believe in literal hell are at least consistent when they try to \"save\" people.\n\nBut the counterargument is that nobody has the right to use your body for their own purposes.  Even if you originally consented, you should be able to withdraw consent.  That's part of why I think the original *Roe v Wade* court arrived at the correct conclusion:  Life begins at viability, i.e. the moment when it is possible (however unlikely) for a fetus to survive outside the womb. \n\nA woman has absolute rights over her own body, but there is a point where the person/possible person within her can survive without her.  If it's possible to remove the fetus/baby while giving both the mother and child a reasonable chance of living, then that should be the standard of care.  Any abortion before the point that the fetus has a reasonable chance of living outside the womb is entirely within the discretion of the host/\"mother\".",
          "timestamp": "2022-09-21 03:09:42",
          "score": 1,
          "num_children": 0,
          "author": 73190,
          "replies": []
        }
      ]
    },
    {
      "id": "ip7ku3t",
      "text": "I'm an atheist. I'm pro choice. I think this headline is counterproductive to the cause. \n\nBelieving the pro-life movement merely base their position on religious beliefs is inaccurate. \n\nThey think abortion is murder and murder is wrong no matter what your religious beliefs are. \n\nI think if we are going to change people's minds or address their arguments we need to change the way we talk about this issue.",
      "timestamp": "2022-09-20 16:10:14",
      "score": -11,
      "num_children": 8,
      "author": 167066,
      "replies": [
        {
          "id": "ip8sb9y",
          "text": "Right, because no Pro-lifers are also full on rabid Pro State Murder as in Capital Punishment and there favourite Just and Righteous War.",
          "timestamp": "2022-09-20 20:46:47",
          "score": 3,
          "num_children": 1,
          "author": 90838,
          "replies": [
            {
              "id": "ip8viq4",
              "text": "Doesn't this prove my point? Thou shalt not murder",
              "timestamp": "2022-09-20 21:07:34",
              "score": 1,
              "num_children": 1,
              "author": 167066,
              "replies": [
                {
                  "id": "ip8vtw9",
                  "text": "[deleted]",
                  "timestamp": "2022-09-20 21:09:39",
                  "score": 1,
                  "num_children": 1,
                  "replies": [
                    {
                      "id": "ip8w0qe",
                      "text": "🌿🌿♥️",
                      "timestamp": "2022-09-20 21:10:56",
                      "score": 1,
                      "num_children": 0,
                      "author": 167066,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ip80bzp",
          "text": "Wrong. They only think that abortion is murder because of religious beliefs. There is no rational secular argument that could be made that a fertilized egg is a human being. There are no advanced secular countries where this is an issue.",
          "timestamp": "2022-09-20 17:47:04",
          "score": 12,
          "num_children": 1,
          "author": 80995,
          "replies": [
            {
              "id": "ip82c15",
              "text": "I know many pro life atheists actually. Is there not a rational secular argument that we shouldn't abort a healthy fetus in the third trimester? There's biological evidence that fetuses are capable of some level of consciousness between week 24-28",
              "timestamp": "2022-09-20 17:59:33",
              "score": -1,
              "num_children": 1,
              "author": 167066,
              "replies": [
                {
                  "id": "ip8kyr4",
                  "text": "I cannot remember ever seeing anybody, atheist or religious, proposing that a healthy fetus in the third trimester could be aborted. You’re descending into right wing talking points. Otherwise point me to some political party or some evidence of an organization advocating third trimester abortions of a healthy fetus unless there is severe risk of death to the mother",
                  "timestamp": "2022-09-20 19:59:50",
                  "score": 10,
                  "num_children": 2,
                  "author": 80995,
                  "replies": [
                    {
                      "id": "ip8ojep",
                      "text": "I agree, no organization wants that, but I'm saying that this is what the right accuses the left of wanting",
                      "timestamp": "2022-09-20 20:22:40",
                      "score": -2,
                      "num_children": 0,
                      "author": 167066,
                      "replies": []
                    },
                    {
                      "id": "ip8oduh",
                      "text": ">You’re descending into right wing talking points.\n\nI think you're missing my point. I agree it's a red herring. My whole argument is that this is how the right wing engages with the issue. They don't go around quoting Bible verses. I don't think the Bible even says anything about abortion",
                      "timestamp": "2022-09-20 20:21:41",
                      "score": -1,
                      "num_children": 0,
                      "author": 167066,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ip8frlq",
          "text": "> Believing the pro-life movement merely base their position on religious beliefs is inaccurate.\n> \n\nThe arguments are all ultimately based on a religious viewpoint, as far as the justification for the state to control what a citizen does with their body.",
          "timestamp": "2022-09-20 19:26:50",
          "score": 4,
          "num_children": 1,
          "author": 204801,
          "replies": [
            {
              "id": "ip8mwz2",
              "text": "Ultimately yes, they are based on religion, but I think it's a lot easier to convince someone that abortions can be ethical in spite of those reasons instead of trying to deconvert them",
              "timestamp": "2022-09-20 20:12:20",
              "score": 2,
              "num_children": 1,
              "author": 167066,
              "replies": [
                {
                  "id": "ip9af2r",
                  "text": "I'm not even trying to deconvert them, I'm trying to emphasize that a religious opinion isn't the same thing as a Constitutional one. The difference being that yeah, I recognize the issues one may have with abortion and the questions it raises about when human life starts, but questions and opinions aren't actually enough to make a call on what the State is allowed to govern about citizens.",
                  "timestamp": "2022-09-20 22:51:38",
                  "score": 3,
                  "num_children": 1,
                  "author": 204801,
                  "replies": [
                    {
                      "id": "ip9c08b",
                      "text": "You know what, fair enough",
                      "timestamp": "2022-09-20 23:03:13",
                      "score": 2,
                      "num_children": 0,
                      "author": 167066,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ip8ye4a",
          "text": "They only think OTHER PEOPLE'S abortion is murder",
          "timestamp": "2022-09-20 21:27:02",
          "score": 2,
          "num_children": 0,
          "author": 24162,
          "replies": []
        },
        {
          "id": "ip8z8uf",
          "text": "The conversation and words used have been addressed multiple times. It doesn't matter to them and honestly it doesn't matter to me. If abortion is murder, ok. If it's a fetus or a baby or a precious sparkle of human, ok. The point is that putting the right of it over the rights of the mother effectively enslaves her, and that will never be ok. No one is chained to a patient in a hospital bed and forced to provide blood and marrow until that person is healed. Even corpses have to have consented to their organs being donated. If it's murder if they don't consent, I don't care. They need to consent. Women need to consent to donate their body to the incubation of new life. If they choose not to, I don't care what it's termed. It's their right.",
          "timestamp": "2022-09-20 21:32:52",
          "score": 2,
          "num_children": 0,
          "author": 11769,
          "replies": []
        },
        {
          "id": "ip8enxk",
          "text": "That's a bit reductive considering the reason the believe it is murder is due to their religious beliefs: namely, that life begins at conception. Only when you hold that belief will you believe that abortion is murder.",
          "timestamp": "2022-09-20 19:19:53",
          "score": 5,
          "num_children": 1,
          "author": 392923,
          "replies": [
            {
              "id": "ip8niqm",
              "text": "Life definitely begins at conception though. Just because it's a tiny blip of cells doesn't mean it's not alive. Find me a single scientist that doesn't say fetuses are alive. The entire argument about what week to draw the line at \"life\" is incredibly absurd and stupid. The discussion is about how valuable that life is and whether or not pregnant people are allowed to protect themselves from blood sucking parasites",
              "timestamp": "2022-09-20 20:16:13",
              "score": -3,
              "num_children": 1,
              "author": 167066,
              "replies": [
                {
                  "id": "ip8pium",
                  "text": "You're right, it is living: much like the nails growing on your hands and feet or the cow grazing in the field are living. The question isn't about how valuable the life is, the question is: is it moral to terminate a pregnancy? To answer that question, you first have to ask yourself, is the fetus a person.\n\nYou could make the argument that the fetus is a person, however actually going about and proving it will probably drive you crazy (and is probably impossible to say, considering how many years and millions of dollars pro life people have tried to prove it). You could claim that the fetus has the *potential* to be a person and should be allowed to come to term, however what about in cases of rape or in instances where the mother's health would be jeopardized if she carried the baby to term? Should the mother's lives, already fulfilled, be secondary to the chance of life?\n\nYou say trying to draw the line for when life starts is stupid, but it is a very real question we have to ask ourselves as a society because, up until a certain point, the fetus can't survive outside of the mother's womb. Would you call a \"tiny blip of cells\" a person if it was sitting in a petri dish?",
                  "timestamp": "2022-09-20 20:28:58",
                  "score": 8,
                  "num_children": 1,
                  "author": 392923,
                  "replies": [
                    {
                      "id": "ip8v626",
                      "text": "No. I think this is far too philosophical for the conservative mind. Life, personhood, these are both philosophical concepts irrelevant to the discussion, because conservatives don't really care about that. Honestly not sure if conservatives are smart enough to have this kind of discussion or hold an opinion on the matter.\n\nRight wing often accuses us of \"killing babies out of convenience\".\n\nWhy do you think they say that?\n\nIn the conservative mind they want to punish women who are impure, and promiscuous. \nThey believe the left is motivated only by hedonism. Condoning abortion will destroy traditional families (which is true to a certain extent, but who gives a shit about traditional families). I don't think this type of conservatism comes from religion though (even though conservati toves often say this is their prime motivator). I think this type of thought along with religion and misogyny stems from some deeper reptilian fear",
                      "timestamp": "2022-09-20 21:05:15",
                      "score": -2,
                      "num_children": 1,
                      "author": 167066,
                      "replies": [
                        {
                          "id": "ip90io2",
                          "text": "Ok, sure, but where does that leave you with the debate? The only way we will ever be able to come to some sort of amicable decision regarding abortion is if we have thoughtful and meaningful conversations with the opposition. Saying a philosophical question is \"too philosophical for a conservative mind\" is disingenuous and gives them a reason to be hateful and spiteful back. You say life and personhood are irrelevant to the topic of abortion. If that is true, then how would you propose the topic be handled?",
                          "timestamp": "2022-09-20 21:41:30",
                          "score": 7,
                          "num_children": 1,
                          "author": 392923,
                          "replies": [
                            {
                              "id": "ip9bhnk",
                              "text": "My argument for abortion is, \"parasites have no rights\".\n\nNo matter how small or innocent someone is, nobody has the right to literally suck life force from someone else. Nobody should be required to risk their life or limb so that someone else should live. Nobody should even be required to go through a process which causes trauma, scarring or even permanent bodily changes so that someone else can live.\n\nAs long as giving birth is more dangerous than having an abortion, abortions are necessary. Some conservatives, I think could reasonably be convinced of this regardless of they think that fetuses are persons",
                              "timestamp": "2022-09-20 22:59:25",
                              "score": 4,
                              "num_children": 1,
                              "author": 167066,
                              "replies": [
                                {
                                  "id": "ipa4yyu",
                                  "text": "Not really sure you would win very many even average pro-lifers if you start the conversation off but saying that \"parasites have no rights\". That inference creates such a wide chasm between you and the other person that all that will happen is they will check out and not pay attention or give credence to the substance of what you are saying. \n\nAlso, by comparing the fetus to a parasite is fundamentally making your point about personhood since \"parasites have no rights\", so really you are trying to argue my point but doing it in a way that is actually potentially harmful to the overall discourse.",
                                  "timestamp": "2022-09-21 02:44:05",
                                  "score": 1,
                                  "num_children": 0,
                                  "author": 392923,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ip8i4dl",
          "text": "> murder is wrong no matter what your religious beliefs are\n\nWhy they don't shout at soldiers then? At doctors, who unplug brain-dead from life-support machines? They target women alone. This is hardly about murder - or they're hypocrites, who go into \"it's different murder\" mode.",
          "timestamp": "2022-09-20 19:41:44",
          "score": 6,
          "num_children": 2,
          "author": 252541,
          "replies": [
            {
              "id": "ip8nlqt",
              "text": "\n>Why they don't shout at soldiers then? At doctors, who unplug brain-dead from life-support machines?\n\nWar and violence has plenty of opposition, and assisted suicide/mercy killing has been a debate on philosophical grounds for decades.",
              "timestamp": "2022-09-20 20:16:45",
              "score": 5,
              "num_children": 0,
              "author": 410909,
              "replies": []
            },
            {
              "id": "ip8moy2",
              "text": "In short 2 things, the conservative mindset is fundamentally emotionally immature and misogynistic.\n\nConservatives in general believe that only good things happen to good people and only bad things happen to bad people. This is also why conservatives think poor people deserve to be poor, and why criminals deserve the death penalty.\n\nThis deontological mindset sees fetuses as inherently innocent. Because fetuses are the product of sex, and sex is the fault of the woman, then they think abortions are really just liberals, punishing a fetus for the mistakes of the woman.\n\nI honestly think modern day pro life movement has more to do with misogyny and this kind of purity culture than religion. Now you can argue that misogyny and purity culture *comes from*  religion, but I think that connection is incidental.\n\nHere's my point though, if I want to change someone's mind on abortion, it's easier for me to convince them that abortions are for the purpose of bodily autonomy and self defense rather than trying to deconvert them",
              "timestamp": "2022-09-20 20:10:54",
              "score": 2,
              "num_children": 0,
              "author": 167066,
              "replies": []
            }
          ]
        },
        {
          "id": "ip7uds6",
          "text": "best comment",
          "timestamp": "2022-09-20 17:09:48",
          "score": -4,
          "num_children": 0,
          "author": 167358,
          "replies": []
        }
      ]
    },
    {
      "id": "ip8wdn4",
      "text": "We need to vote blue and get theses asses out.",
      "timestamp": "2022-09-20 21:13:22",
      "score": 1,
      "num_children": 0,
      "author": 178252,
      "replies": []
    },
    {
      "id": "ip8yfjv",
      "text": "Once again, these aren't \"Christian\" beliefs.  The Bible expressly allows a husband to demand his wife to undergo an ordeal designed to abort a bastard child.  The aborted fetus is treated as a piece of evidence of infidelity, no more.\n\nIf the Bible had anything anti-abortion in it we would have heard about it.  But nowhere in the Bible do we get these four simple words: \"Don't get an abortion\".  Instead, we get Leviticus 19:27 “Do not trim off the hair on your temples or trim your beards.\"  Pretty sure God just prioritized the type of haircut men can get over specifically proscribing abortion.  Maybe God decided there wasn't enough room in the Bible and decided to keep the thing about haircuts because that seemed really, really important?  Seems like a poor choice for God to demand a type of haircut that men everywhere will ignore and not get (except for Hasidic Jews), and leave out something as important as the four words all Christians are hot to force into God's mouth: \"Don't get an abortion\".\n\nThe Christianity claim is a flat-out lie, and only used as a shield against accusations of abject Republican misogyny and fascism.",
      "timestamp": "2022-09-20 21:27:19",
      "score": 1,
      "num_children": 0,
      "author": 123845,
      "replies": []
    },
    {
      "id": "ip9xx7z",
      "text": "To any people who put up the argument that the Bible does not prohibit abortion: that is irrelevant. You’re letting the argument get placed on their field. It doesn’t fucking matter what the stupid book says. Separation of church and state dictates that no religious issue is relevant whatsoever. \n\nIf they don’t want abortions they don’t have to have them. \n\nDon’t let the argument become one of theology when it is a constitutional issue.",
      "timestamp": "2022-09-21 01:49:37",
      "score": 1,
      "num_children": 0,
      "author": 251911,
      "replies": []
    },
    {
      "id": "ip7i5av",
      "text": "You’re feeding into the argument. It has NOTHING to do with religion. It’s forced birth specifically white birth. And suppression of women’s rights",
      "timestamp": "2022-09-20 15:53:03",
      "score": -3,
      "num_children": 1,
      "author": 166331,
      "replies": [
        {
          "id": "ip8yilu",
          "text": "Then why is it just religious people doing it....",
          "timestamp": "2022-09-20 21:27:53",
          "score": 5,
          "num_children": 1,
          "author": 24162,
          "replies": [
            {
              "id": "ip939xg",
              "text": "That’s just the excuse they use. “Sky daddy says so”. These people are the least religious people I’ve ever witnessed",
              "timestamp": "2022-09-20 22:00:33",
              "score": -1,
              "num_children": 1,
              "author": 166331,
              "replies": [
                {
                  "id": "ipa3xay",
                  "text": "And yet....",
                  "timestamp": "2022-09-21 02:36:03",
                  "score": 2,
                  "num_children": 1,
                  "author": 24162,
                  "replies": [
                    {
                      "id": "ipa43q9",
                      "text": "Let them try kill the pagans and burn the witches. It won’t be the same for them this time",
                      "timestamp": "2022-09-21 02:37:24",
                      "score": 1,
                      "num_children": 0,
                      "author": 166331,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip7cn6j",
      "text": "what else they likely have in common, wives, daughters, and mistresses that have had abortions.",
      "timestamp": "2022-09-20 15:17:56",
      "score": 1,
      "num_children": 0,
      "author": 105905,
      "replies": []
    },
    {
      "id": "ip7jka1",
      "text": "Over. My. Dead. Body.",
      "timestamp": "2022-09-20 16:02:05",
      "score": 1,
      "num_children": 0,
      "author": 338799,
      "replies": []
    },
    {
      "id": "ip7lxd9",
      "text": "If you're not pro-life for the whole life, then you're lying.",
      "timestamp": "2022-09-20 16:17:12",
      "score": 1,
      "num_children": 0,
      "author": 376584,
      "replies": []
    },
    {
      "id": "ip7obdp",
      "text": "Someone remind me what Jesus said about abortions....",
      "timestamp": "2022-09-20 16:32:11",
      "score": 1,
      "num_children": 0,
      "author": 179567,
      "replies": []
    },
    {
      "id": "ip7ugyf",
      "text": "How does what Biden did federally for abortion change anything?",
      "timestamp": "2022-09-20 17:10:22",
      "score": 1,
      "num_children": 0,
      "author": 186350,
      "replies": []
    },
    {
      "id": "ip7v36o",
      "text": "Yeah until it’s their wife or daughter.",
      "timestamp": "2022-09-20 17:14:15",
      "score": 1,
      "num_children": 0,
      "author": 288273,
      "replies": []
    },
    {
      "id": "ip7vrlh",
      "text": "That link was scary.  The worst part was when that asshole said that women should embrace their self-sacrificial instincts and reject (be denied) life-saving treatment that could harm a fetus.",
      "timestamp": "2022-09-20 17:18:31",
      "score": 1,
      "num_children": 0,
      "author": 373422,
      "replies": []
    },
    {
      "id": "ip7w91c",
      "text": "And stake in the for-profit prison industry.",
      "timestamp": "2022-09-20 17:21:30",
      "score": 1,
      "num_children": 0,
      "author": 46649,
      "replies": []
    },
    {
      "id": "ip7xig8",
      "text": "Saying “tried to warn ya” far too often these day",
      "timestamp": "2022-09-20 17:29:29",
      "score": 1,
      "num_children": 0,
      "author": 207177,
      "replies": []
    },
    {
      "id": "ip7xq5w",
      "text": "So what are you going to do about it?, /r/atheism?",
      "timestamp": "2022-09-20 17:30:48",
      "score": 1,
      "num_children": 2,
      "author": 357772,
      "replies": [
        {
          "id": "ip81ldy",
          "text": "There's not much we *can* do about it. Vote and get others to vote. That's about it.",
          "timestamp": "2022-09-20 17:54:54",
          "score": 1,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "ip9y6m3",
              "text": "Bingo!\n\n\\- Vote  \n\\- Donate  \n\\- Volunteer  \nfor Democrats.",
              "timestamp": "2022-09-21 01:51:37",
              "score": 2,
              "num_children": 0,
              "author": 357772,
              "replies": []
            }
          ]
        },
        {
          "id": "ip88dle",
          "text": "I've already stopped having sex, and I have armed myself.  Any rapist will wind up in the morgue.  That's all I can do.",
          "timestamp": "2022-09-20 18:39:01",
          "score": 1,
          "num_children": 1,
          "author": 244330,
          "replies": [
            {
              "id": "ip9y52a",
              "text": "* Vote\n* Donate\n* Volunteer\n\nfor Democrats.",
              "timestamp": "2022-09-21 01:51:17",
              "score": 1,
              "num_children": 0,
              "author": 357772,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ip81y8i",
      "text": "The “personal Christian beliefs” is misleading. These aren’t Christian beliefs. Any real Christian believes life begins at first breath. That’s clearly in the Bible. These idiots beliefs are due to decades of right wing propaganda.",
      "timestamp": "2022-09-20 17:57:08",
      "score": 1,
      "num_children": 0,
      "author": 281175,
      "replies": []
    },
    {
      "id": "ip85eay",
      "text": "Yep, crazy is as crazy does. This is all about the $$$$$$.\nThe billionaires that buy the politicians are upset that the next generation of consumers and slaves are not being born. So, forced births and living in hell as punishment is what is being done.",
      "timestamp": "2022-09-20 18:19:26",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ip86krw",
      "text": "America, the land of freedom, and by freedom what they really mean is freedom to impose their 'Judeo-Christian values' onto everyone and oppress people who aren't like them. Oh, and also the place where freedom to carry a lethal weapon that could potentially kill someone is prioritized over the freedom to not fricking die.",
      "timestamp": "2022-09-20 18:27:04",
      "score": 1,
      "num_children": 0,
      "author": 260384,
      "replies": []
    },
    {
      "id": "ip86ser",
      "text": "Honestly don’t understand how they’re just able to do this without any repercussions.",
      "timestamp": "2022-09-20 18:28:27",
      "score": 1,
      "num_children": 0,
      "author": 404219,
      "replies": []
    },
    {
      "id": "ip8afk7",
      "text": "Said this in another thread about the same thing, but have fun imprisoning a quarter of women.",
      "timestamp": "2022-09-20 18:52:27",
      "score": 1,
      "num_children": 0,
      "author": 92076,
      "replies": []
    },
    {
      "id": "ip8fbei",
      "text": "I'm so glad there are 0 female politicians who believe this. I'm glad it has nothing to do with the religion of the politicians and only based on their sex.",
      "timestamp": "2022-09-20 19:23:59",
      "score": 1,
      "num_children": 0,
      "author": 338687,
      "replies": []
    },
    {
      "id": "ip8gzix",
      "text": "It's not even a Christian belief.  It's just a right wing astroturf job",
      "timestamp": "2022-09-20 19:34:33",
      "score": 1,
      "num_children": 0,
      "author": 196526,
      "replies": []
    },
    {
      "id": "ip8h9pj",
      "text": "pushing their beliefs on others is all that christians do",
      "timestamp": "2022-09-20 19:36:20",
      "score": 1,
      "num_children": 0,
      "author": 313942,
      "replies": []
    },
    {
      "id": "ip8hiit",
      "text": "pushing their beliefs on others is all that christians do",
      "timestamp": "2022-09-20 19:37:54",
      "score": 1,
      "num_children": 0,
      "author": 313942,
      "replies": []
    },
    {
      "id": "ip8kdls",
      "text": "Toxic Christianity is the biggest threat to American democracy.",
      "timestamp": "2022-09-20 19:56:04",
      "score": 1,
      "num_children": 0,
      "author": 206281,
      "replies": []
    },
    {
      "id": "ip8kgr9",
      "text": "Abortion is illegal in my very catholic 3rd world country but it was never this draconian. The worst our women can have is risky unlicensed abortion practice. Even licensed doctors do abortions in confidentiality if the life of the mother is in danger but the law does not chase them and it is just shushed as an unspeakable reality. Mostly our law is more on chasing the underground clinics and abortionists but never to the woman who had the abortion. Then you have this in America, seriously? A supposed country of power, wealth, and freedom.",
      "timestamp": "2022-09-20 19:56:38",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ip8kjjh",
      "text": "You can bet your bottom dollar that if men got pregnant this would have a different narrative.",
      "timestamp": "2022-09-20 19:57:07",
      "score": 1,
      "num_children": 0,
      "author": 348259,
      "replies": []
    },
    {
      "id": "ip8l596",
      "text": "And how many of them have secret mistresses that they've forced to have abortions?",
      "timestamp": "2022-09-20 20:00:57",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ip8lb9y",
      "text": "Tbh I don't think it's about religion. That's just an excuse to be an asshole.",
      "timestamp": "2022-09-20 20:02:02",
      "score": 1,
      "num_children": 0,
      "author": 206425,
      "replies": []
    },
    {
      "id": "ip8nfkq",
      "text": "They have no idea of the coming shitstorm if they imprison a woman for that. Their lies about being 'a poor, persecuted minority' will become more true than they ever imagined.\n\nAs always, they **wildly** overestimate their level of support in America.\n\nThen again, they're Republican krazy kristians, so incapable of any form of critical thought. They only know how to double down and make things much worse for themselves.\n\nYou just know some brave woman is going to push to be the test case.",
      "timestamp": "2022-09-20 20:15:39",
      "score": 1,
      "num_children": 0,
      "author": 114177,
      "replies": []
    },
    {
      "id": "ip8nyit",
      "text": "Jury nullification is a powerful tool in the face of unjust laws.\n\nJust never mention to the judge or council that you know what it is...",
      "timestamp": "2022-09-20 20:19:02",
      "score": 1,
      "num_children": 0,
      "author": 341113,
      "replies": []
    },
    {
      "id": "ip8ov6c",
      "text": "I think they're going about this wrong. it should be like I told him twice to leave and then I stood my ground.",
      "timestamp": "2022-09-20 20:24:44",
      "score": 1,
      "num_children": 0,
      "author": 155122,
      "replies": []
    },
    {
      "id": "ip8ph50",
      "text": "The problem, imo, is that the people who put them in power lack any sense of objectivity. They don't see it as \"christian\" values. They don't even believe christianity is a religion. They think it's human default state. I honestly don't know what we can do, my dad was like that and you cannot reason with them. You cannot get them to see that they are acting like fascists trying to get everyone to obey their ideas, they literally think other people know they are killing babies but are fine with it. They can't fathom the idea that abortion is healthcare or that other people have genuine different beliefs about it.",
      "timestamp": "2022-09-20 20:28:39",
      "score": 1,
      "num_children": 0,
      "author": 68776,
      "replies": []
    },
    {
      "id": "ip8s5hd",
      "text": "What they ALSO all have in common: a vengeful desire to punish and criminalize women",
      "timestamp": "2022-09-20 20:45:45",
      "score": 1,
      "num_children": 0,
      "author": 34954,
      "replies": []
    },
    {
      "id": "ip8t47a",
      "text": "Fucking Christian jihadist the Taliban and al queda little sisters",
      "timestamp": "2022-09-20 20:51:54",
      "score": 1,
      "num_children": 0,
      "author": 354036,
      "replies": []
    },
    {
      "id": "ip8z5fv",
      "text": "Hey this sounds just like Iran…hmm don’t they dislike the Middle East supposedly? Weird.",
      "timestamp": "2022-09-20 21:32:13",
      "score": 1,
      "num_children": 0,
      "author": 221116,
      "replies": []
    },
    {
      "id": "ip9000e",
      "text": "We should not have helped rebuild the confederate states...should have just wiped them all out and started fresh.",
      "timestamp": "2022-09-20 21:38:00",
      "score": 1,
      "num_children": 0,
      "author": 231727,
      "replies": []
    },
    {
      "id": "ip939g9",
      "text": "Religion is like a dick. It's OK to be proud of yours, but keep it out of my face.",
      "timestamp": "2022-09-20 22:00:28",
      "score": 1,
      "num_children": 0,
      "author": 58096,
      "replies": []
    },
    {
      "id": "ip94j5f",
      "text": "What they have in common is probably far more simple:\n\nThey’re abusers who found sanctuary in religion. They use religion to justify abusive behaviors and policies. \n\nAbusive men, and blindly loyal women, have gained positions of power and authority because Americans fail to recognize—collectively—what abuse looks, sounds, and what it feels like.",
      "timestamp": "2022-09-20 22:09:33",
      "score": 1,
      "num_children": 0,
      "author": 1125,
      "replies": []
    },
    {
      "id": "ip94o3l",
      "text": "It's not an issue of welfare, morality or religion. The abortion bill is a way of passing legislation that will help their political party drive liberal voters out of their states to consolidate their voter bases and stand a better chance in future elections. Sure, they'll use religion to achieve that.",
      "timestamp": "2022-09-20 22:10:32",
      "score": 1,
      "num_children": 0,
      "author": 223275,
      "replies": []
    },
    {
      "id": "ip958pa",
      "text": "They are trying to keep white people as the majority.",
      "timestamp": "2022-09-20 22:14:35",
      "score": 1,
      "num_children": 0,
      "author": 284989,
      "replies": []
    },
    {
      "id": "ip959k8",
      "text": "I love how these Christian figures all boast about how they fear the Iranian theocrazy, wanting to attack Iran for being evil whilst at the very same time they want to do the exact same thing in America, only with their version of god. \n\nThey don't fear Muslims, they fear competition.",
      "timestamp": "2022-09-20 22:14:46",
      "score": 1,
      "num_children": 0,
      "author": 132266,
      "replies": []
    },
    {
      "id": "ip95teb",
      "text": "Midterms will tell if Americans are sufficiently irritated.",
      "timestamp": "2022-09-20 22:18:41",
      "score": 1,
      "num_children": 0,
      "author": 220910,
      "replies": []
    },
    {
      "id": "ip9a6az",
      "text": "We are already having record numbers of young people opting to not have children go ahead give women more reasons not to trust or deal with men by threatening them with jail. I'm sure this will create a population boom",
      "timestamp": "2022-09-20 22:49:53",
      "score": 1,
      "num_children": 0,
      "author": 374955,
      "replies": []
    },
    {
      "id": "ip9a6m2",
      "text": "They should ban male masturbation in states that take a religious stance on *anything*.",
      "timestamp": "2022-09-20 22:49:56",
      "score": 1,
      "num_children": 0,
      "author": 298168,
      "replies": []
    },
    {
      "id": "ip9csun",
      "text": "They want a theocracy",
      "timestamp": "2022-09-20 23:09:05",
      "score": 1,
      "num_children": 0,
      "author": 199584,
      "replies": []
    },
    {
      "id": "ip9dkvh",
      "text": "We the people need to stop anyone who tries to punish someone for having or providing an abortion. Community defense and mutual aid networks will be critical to this effort. Biden says he wants to hire another 100K cops (unless it's a campaign gimmick, but I doubt that), and the fascists in the GOP are eager to press those new boots onto the population.",
      "timestamp": "2022-09-20 23:14:53",
      "score": 1,
      "num_children": 0,
      "author": 93124,
      "replies": []
    },
    {
      "id": "ip9ewmy",
      "text": "Some people read the handmaidens tale and think wow that sounds awesome let's make this real.",
      "timestamp": "2022-09-20 23:24:39",
      "score": 1,
      "num_children": 0,
      "author": 239613,
      "replies": []
    },
    {
      "id": "ip9j4wr",
      "text": "Blessed are the meek\n\nBut seriously, am I the only getting Handmaid's Tale vibes from this s**t?",
      "timestamp": "2022-09-20 23:56:28",
      "score": 1,
      "num_children": 0,
      "author": 56004,
      "replies": []
    },
    {
      "id": "ip9l1kw",
      "text": "If you need or are interested in supporting reproductive rights, [I made a master post of pro-choice resources](https://docdro.id/s3OwS8u). Please comment if you would like to add a resource and spread this information on whatever social media you use.",
      "timestamp": "2022-09-21 00:11:10",
      "score": 1,
      "num_children": 0,
      "author": 168329,
      "replies": []
    },
    {
      "id": "ip9m2nm",
      "text": "A version of the hijab. If you get pregnant it’s your fault for being such a sloot.\n\nYa’ll Queda is alive and well in the US.",
      "timestamp": "2022-09-21 00:19:03",
      "score": 1,
      "num_children": 0,
      "author": 268202,
      "replies": []
    },
    {
      "id": "ip9o37f",
      "text": "They also want to get felonies on these women's records so that they can't vote. You know how uppity us women folk are getting these days. /S",
      "timestamp": "2022-09-21 00:34:24",
      "score": 1,
      "num_children": 0,
      "author": 68589,
      "replies": []
    },
    {
      "id": "ip9of0f",
      "text": "Shouldn’t the men who impregnated them go to prison too then?",
      "timestamp": "2022-09-21 00:36:56",
      "score": 1,
      "num_children": 0,
      "author": 14891,
      "replies": []
    },
    {
      "id": "ip9qx1p",
      "text": "There are plenty of female Christians saying the same.",
      "timestamp": "2022-09-21 00:56:19",
      "score": 1,
      "num_children": 0,
      "author": 49308,
      "replies": []
    },
    {
      "id": "ip9rdtx",
      "text": "It’s how the democratic system works.",
      "timestamp": "2022-09-21 00:59:52",
      "score": 1,
      "num_children": 0,
      "author": 285827,
      "replies": []
    },
    {
      "id": "ip9x24h",
      "text": "There is literally no other circumstance where we demand, under threat of imprisonment, the use of a person's organs. Even if it is to save a life. It's biological slavery.",
      "timestamp": "2022-09-21 01:42:55",
      "score": 1,
      "num_children": 0,
      "author": 259198,
      "replies": []
    },
    {
      "id": "ip9yu7o",
      "text": "If they really didn't want people to get abortions, they would punish the doctor.",
      "timestamp": "2022-09-21 01:56:46",
      "score": 1,
      "num_children": 1,
      "author": 257661,
      "replies": [
        {
          "id": "ipaphaq",
          "text": "If if would be about something else than their desire to strip women of rights they would be pro sex education and widely available contraceptives.",
          "timestamp": "2022-09-21 05:56:16",
          "score": 1,
          "num_children": 0,
          "author": 196038,
          "replies": []
        }
      ]
    },
    {
      "id": "ipa28na",
      "text": "No. They want to feel powerful.",
      "timestamp": "2022-09-21 02:22:59",
      "score": 1,
      "num_children": 0,
      "author": 98214,
      "replies": []
    },
    {
      "id": "ipa2qnw",
      "text": "The morality police.",
      "timestamp": "2022-09-21 02:26:54",
      "score": 1,
      "num_children": 0,
      "author": 112787,
      "replies": []
    },
    {
      "id": "ipa3x7h",
      "text": "It’s not religion. It’s control over women under the guise of religion.",
      "timestamp": "2022-09-21 02:36:02",
      "score": 1,
      "num_children": 0,
      "author": 17016,
      "replies": []
    },
    {
      "id": "ipa5sr9",
      "text": "Do they want to push their religious beliefs on every one or are they just using religion as a reason to take away a woman’s right to control her body?",
      "timestamp": "2022-09-21 02:50:32",
      "score": 1,
      "num_children": 0,
      "author": 344797,
      "replies": []
    },
    {
      "id": "ipa9psb",
      "text": "The Daily (NYT podcast) had an interview with \"abolitionists\" which is the rising faction of the Pro-Life movement that want total abortion bans and for the women to be charged with murder for seeking an abortion. One woman admitted to having had an abortion in her past, so the interviewer asked her how she reconciled that with her beliefs. She called herself a murder who would probably burn in hell and supported incredibly extreme abortion laws including ones that could result in her own execution. There is no reasoning with them.",
      "timestamp": "2022-09-21 03:22:20",
      "score": 1,
      "num_children": 0,
      "author": 220169,
      "replies": []
    },
    {
      "id": "ipaa2rr",
      "text": "And they are winning......",
      "timestamp": "2022-09-21 03:25:22",
      "score": 1,
      "num_children": 0,
      "author": 170225,
      "replies": []
    },
    {
      "id": "ipab9te",
      "text": "shouldnt punishment be doled out where the whole unwanted pregnancy started? with the spermicidal maniacs who impregnated the woman?\n\nPretty sure opinions and ideas would change in a hurry.",
      "timestamp": "2022-09-21 03:35:35",
      "score": 1,
      "num_children": 0,
      "author": 78477,
      "replies": []
    },
    {
      "id": "ipabwxq",
      "text": "There are not words for how angry reading that made me. Their main profiled misogynist is pro-guns for killing people and anti-vaccines that would save people. So it's fair to assume he's some sort of antinatalist who worries about human overpopulation... Except he's a forced birther who wants to make people have children they don't want... I can't see any logic to this argument (unless it's \"we hate women and want to make them suffer\" hmmm...)",
      "timestamp": "2022-09-21 03:41:11",
      "score": 1,
      "num_children": 0,
      "author": 193959,
      "replies": []
    },
    {
      "id": "ipacmpe",
      "text": "They are not even doing it out of religious belief, which could be, arguably, more ethical,  but just for social status inside their community and influence that can later translate into benefits for themselves. These people don't care 2 flying f**** about anything that is not them.",
      "timestamp": "2022-09-21 03:47:29",
      "score": 1,
      "num_children": 0,
      "author": 14761,
      "replies": []
    },
    {
      "id": "ipad8gf",
      "text": "Then the men who knocked them can go too.",
      "timestamp": "2022-09-21 03:52:42",
      "score": 1,
      "num_children": 0,
      "author": 386202,
      "replies": []
    },
    {
      "id": "ipadj6x",
      "text": "Nah what they have in common is being rich enough to ship their mistress abroad to get an abortion",
      "timestamp": "2022-09-21 03:55:27",
      "score": 1,
      "num_children": 0,
      "author": 163609,
      "replies": []
    },
    {
      "id": "ipadrw8",
      "text": "In their cult, women are considered to be unpure and demented beings. We are just here to produce babies and lure in men. I mean...are you shocked?",
      "timestamp": "2022-09-21 03:57:40",
      "score": 1,
      "num_children": 0,
      "author": 129744,
      "replies": []
    },
    {
      "id": "ipaiznq",
      "text": "I’ve noticed they aren’t real keen on punishing the man in the scenario, hmmmm.",
      "timestamp": "2022-09-21 04:46:42",
      "score": 1,
      "num_children": 0,
      "author": 13286,
      "replies": []
    },
    {
      "id": "ipamwtb",
      "text": "I’ve wondered about states that make exceptions for rape or incest cases. Are they going to put resources towards investigating, arresting and prosecuting these cases? Yeah right?!!?!",
      "timestamp": "2022-09-21 05:27:11",
      "score": 1,
      "num_children": 1,
      "author": 236777,
      "replies": [
        {
          "id": "ipaq3rj",
          "text": "It's actually just whitewashing. The exception only works if the rape survivor files a complaint and it's well known the statistics of reported rapes are miniscule as compared to the actual number of rape occurrences.",
          "timestamp": "2022-09-21 06:03:37",
          "score": 2,
          "num_children": 1,
          "author": 188199,
          "replies": [
            {
              "id": "ipnb61b",
              "text": "Agree. Pisses me off that some groups try to make these complicated issues so linear for their narrow mindedness. Must be nice livin your privileged life with your self-created blinders.",
              "timestamp": "2022-09-23 22:00:12",
              "score": 2,
              "num_children": 0,
              "author": 236777,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ipapu0w",
      "text": "I always like to see the reactions when I point out that their book says Jesus hung around with tons of prostitutes, which at the time was also a position that provided abortions, as they were just part of the job, as well as providing primitive birth control... but okay sure, ignore that he was besties with these women in the same book they say they want to uphold, why don't we?",
      "timestamp": "2022-09-21 06:00:24",
      "score": 1,
      "num_children": 0,
      "author": 345353,
      "replies": []
    },
    {
      "id": "ipaq7u9",
      "text": "and I want wiccans to be arrested because they corrupt our young ones.",
      "timestamp": "2022-09-21 06:04:58",
      "score": 1,
      "num_children": 0,
      "author": 321649,
      "replies": []
    },
    {
      "id": "ipaq8uw",
      "text": "It's all about domestic supply of American (white) infants.",
      "timestamp": "2022-09-21 06:05:18",
      "score": 1,
      "num_children": 0,
      "author": 188199,
      "replies": []
    },
    {
      "id": "ipauoq8",
      "text": "I mean, what did you think felony means? Of course they were going to make abortion a felony as soon as they could. Was there ever any doubt? It's not a parking ticket to these people.",
      "timestamp": "2022-09-21 06:58:52",
      "score": 1,
      "num_children": 0,
      "author": 252040,
      "replies": []
    },
    {
      "id": "ipbf1xx",
      "text": "They're running out of followers and their ability to indoctrinate children isn't taking anymore thanks to peer support and the internet. They're desperate and just trying to breed more Christians.",
      "timestamp": "2022-09-21 11:22:12",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ipbqahm",
      "text": "How is that christian",
      "timestamp": "2022-09-21 13:01:21",
      "score": 1,
      "num_children": 0,
      "author": 322841,
      "replies": []
    },
    {
      "id": "ipc586r",
      "text": "Anything less than complete submission is religious persecution.",
      "timestamp": "2022-09-21 14:45:55",
      "score": 1,
      "num_children": 0,
      "author": 146982,
      "replies": []
    },
    {
      "id": "ipcltzu",
      "text": "Because the religitards are pieces of shit. 😅",
      "timestamp": "2022-09-21 16:30:18",
      "score": 1,
      "num_children": 0,
      "author": 267967,
      "replies": []
    },
    {
      "id": "ipcus1q",
      "text": "I see this and think at first: Political Stunt. No one could be this concrete thinking and have such a lack of empathy and insight into themselves and others around them that they....\n\n...And then I remembered they're christian; The indoctrination process that creates unsympathetic sociopaths all over the United States is uniquely behind this. \n\nIf one non-religious person were to stand up and take a hard stance like this, I would at least hear them out. Are they speaking from an ethical standpoint? Do they have a rational point to make? But that isn't what happens and that isn't where this comes from. \n\nSome day I hope that the people can identify the absolute abuse we suffer at the hands of these people.",
      "timestamp": "2022-09-21 17:25:37",
      "score": 1,
      "num_children": 0,
      "author": 53435,
      "replies": []
    },
    {
      "id": "ipd5alr",
      "text": "I agree with the sentiment, but I think it's actually the politicians are pushing what they think their constituents want. If enough people want hangin' in the streets, they'll call for it with conviction.",
      "timestamp": "2022-09-21 18:30:34",
      "score": 1,
      "num_children": 0,
      "author": 158190,
      "replies": []
    },
    {
      "id": "iq25bqz",
      "text": "I don't think Islam, or Judaism or any Abrahamic religion is ok with abortion lol if its for religious reasthe",
      "timestamp": "2022-09-27 03:07:07",
      "score": 1,
      "num_children": 0,
      "author": 67821,
      "replies": []
    },
    {
      "id": "ip7qde6",
      "text": "[removed]",
      "timestamp": "2022-09-20 16:44:57",
      "score": -33,
      "num_children": 5,
      "replies": [
        {
          "id": "ip89bo2",
          "text": "Meaningless platitudes like this are why America is in the situation it's in. Simple minds thinking simple thoughts and thinking they're brilliant.",
          "timestamp": "2022-09-20 18:45:15",
          "score": 14,
          "num_children": 0,
          "author": 367660,
          "replies": []
        },
        {
          "id": "ip8f6aa",
          "text": "And? That's not relevant to the conversation of what the state can and cannot control about citizens.",
          "timestamp": "2022-09-20 19:23:05",
          "score": 6,
          "num_children": 0,
          "author": 204801,
          "replies": []
        },
        {
          "id": "ip818kg",
          "text": "So does war but conservatives didn’t have a problem with brown innocent people getting bombed in both Middle East wars that they started.",
          "timestamp": "2022-09-20 17:52:42",
          "score": 14,
          "num_children": 0,
          "author": 79690,
          "replies": []
        },
        {
          "id": "ip8yfqs",
          "text": "Republicans end more.",
          "timestamp": "2022-09-20 21:27:21",
          "score": 4,
          "num_children": 0,
          "author": 24162,
          "replies": []
        },
        {
          "id": "ip7w33t",
          "text": "How many unwanted children have you adopted?",
          "timestamp": "2022-09-20 17:20:30",
          "score": 18,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "ip7xmwv",
      "text": "[removed]",
      "timestamp": "2022-09-20 17:30:14",
      "score": -11,
      "num_children": 1,
      "replies": [
        {
          "id": "ip89dbc",
          "text": "[removed]",
          "timestamp": "2022-09-20 18:45:32",
          "score": 5,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ip9k3gc",
      "text": "Maybe, just maybe some of us think that killing a baby is just wrong.\n\nI'm pretty sure every religion is against killing babies.",
      "timestamp": "2022-09-21 00:03:51",
      "score": -17,
      "num_children": 2,
      "author": 305227,
      "replies": [
        {
          "id": "ip9miaj",
          "text": "But a 10 yr old victim of rape having to give birth to her rapist baby is totally fine?",
          "timestamp": "2022-09-21 00:22:22",
          "score": 10,
          "num_children": 0,
          "author": 247263,
          "replies": []
        },
        {
          "id": "ipb5fud",
          "text": "How many unwanted children have you adopted? How many have special needs?",
          "timestamp": "2022-09-21 09:25:53",
          "score": 1,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "ip81zr2",
      "text": "Based.",
      "timestamp": "2022-09-20 17:57:24",
      "score": -15,
      "num_children": 0,
      "author": 105698,
      "replies": []
    },
    {
      "id": "ip9p1zc",
      "text": "[removed]",
      "timestamp": "2022-09-21 00:41:53",
      "score": -12,
      "num_children": 1,
      "replies": [
        {
          "id": "ipb5few",
          "text": "How many unwanted children have you adopted? How many have special needs?",
          "timestamp": "2022-09-21 09:25:43",
          "score": 2,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "ipad0uu",
      "text": "There is an easy solution to this problem.   But no one wants to act responsibly.   There are hundreds of birth control methods.  Use them.   Problem solved.   Abortion has nothing to do with religion.   I hav Es plenty of atheist friends that oppose it.",
      "timestamp": "2022-09-21 03:50:52",
      "score": -10,
      "num_children": 1,
      "author": 8895,
      "replies": [
        {
          "id": "ipb5cjc",
          "text": "Name the birth control method that is 100% effective.",
          "timestamp": "2022-09-21 09:24:36",
          "score": 4,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "ipch2kp",
              "text": "Thats not the point.  The point is that they don't use it.",
              "timestamp": "2022-09-21 16:00:41",
              "score": 1,
              "num_children": 1,
              "author": 8895,
              "replies": [
                {
                  "id": "ipch4kl",
                  "text": "How do you know \"they\" don't use it?",
                  "timestamp": "2022-09-21 16:01:01",
                  "score": 2,
                  "num_children": 1,
                  "author": 286151,
                  "replies": [
                    {
                      "id": "ipcjcij",
                      "text": "Im a retired MD.  treated  a lot of them for STDs too.",
                      "timestamp": "2022-09-21 16:14:57",
                      "score": 1,
                      "num_children": 1,
                      "author": 8895,
                      "replies": [
                        {
                          "id": "ipcjp3f",
                          "text": "So because you're a retired MD you know what people use in the privacy of their own bedroom?\n\nAlso, please tell me who 'them' are.",
                          "timestamp": "2022-09-21 16:17:09",
                          "score": 1,
                          "num_children": 1,
                          "author": 286151,
                          "replies": [
                            {
                              "id": "ipckjro",
                              "text": "YES!!!!! And stop being so ignorant!!!",
                              "timestamp": "2022-09-21 16:22:22",
                              "score": 1,
                              "num_children": 1,
                              "author": 8895,
                              "replies": [
                                {
                                  "id": "ipckqap",
                                  "text": "I guess you're going to insult me rather than tell me who 'them' are.",
                                  "timestamp": "2022-09-21 16:23:28",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 286151,
                                  "replies": [
                                    {
                                      "id": "ipclpve",
                                      "text": "Grow up 😉",
                                      "timestamp": "2022-09-21 16:29:35",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 8895,
                                      "replies": [
                                        {
                                          "id": "ipclumt",
                                          "text": "Come on, who are 'them?' Is it black people? It's black people, isn't it?",
                                          "timestamp": "2022-09-21 16:30:24",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 286151,
                                          "replies": [
                                            {
                                              "id": "ipcm65l",
                                              "text": "That is a very racist thing to say.",
                                              "timestamp": "2022-09-21 16:32:24",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 8895,
                                              "replies": [
                                                {
                                                  "id": "ipcmamk",
                                                  "text": "It *would* be racist of you if that's what you meant, yes. Is that what you meant? I'm assuming it was. Feel free to disabuse me of the notion that you're a racist.",
                                                  "timestamp": "2022-09-21 16:33:10",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 286151,
                                                  "replies": [
                                                    {
                                                      "id": "ipcmtl6",
                                                      "text": "Please don't reproduce",
                                                      "timestamp": "2022-09-21 16:36:25",
                                                      "score": 1,
                                                      "num_children": 1,
                                                      "author": 8895,
                                                      "replies": [
                                                        {
                                                          "id": "ipcmxzi",
                                                          "text": "So you did mean black people. Why do you hate black people?",
                                                          "timestamp": "2022-09-21 16:37:10",
                                                          "score": 1,
                                                          "num_children": 0,
                                                          "author": 286151,
                                                          "replies": []
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ip9zmw9",
      "text": "That unborn human beings should have a right to life is not a sectarian belief. Just as the belief that born human beings shouldn't be killed and have a right to life is not a sectarian religious belief. This is so obviously dishonest.",
      "timestamp": "2022-09-21 02:02:56",
      "score": -8,
      "num_children": 1,
      "author": 379575,
      "replies": [
        {
          "id": "ipb5ejy",
          "text": "How many unwanted children have you adopted? How many have special needs?",
          "timestamp": "2022-09-21 09:25:23",
          "score": 1,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "ip8arly",
      "text": "[removed]",
      "timestamp": "2022-09-20 18:54:40",
      "score": -2,
      "num_children": 1,
      "replies": [
        {
          "id": "ip8hgzy",
          "text": "Difference is that if child was born, men and women are equal: both will pay (depending on who is actually stays with child). And if laws will change, they will, again, work both ways. Right now women have prolonged period of deciding, true, but purely for anatomical reasons which cannot be resolved easily. Although baby-trapping do exist, honestly I have little idea how to solve this problem with so little contraception methods available for men.",
          "timestamp": "2022-09-20 19:37:38",
          "score": 6,
          "num_children": 1,
          "author": 252541,
          "replies": [
            {
              "id": "ip9ncs8",
              "text": ">men and women are equal: both will pay (depending on who is actually stays with child).\n\nWhat you have described in no way resembles US civil court outcomes.",
              "timestamp": "2022-09-21 00:28:51",
              "score": -3,
              "num_children": 0,
              "author": 147341,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ipanin6",
      "text": "Don't call them Christian.   So many of their political beliefs are against what appears in the Bible.  And I'm not talking about the Old Testament.  I'm talking about the New Testament.  The Jesus parts.\n\nHelp the poor, the sick, the foreigners.  Nope, no way that works in the QOP.\n\nEven their extreme position on abortion isn't supported by their holy book.  So many verses about the breath of life.  Verses that detail the punishment for injuring a pregnant woman.  Centuries of religious and legal traditions go against their position that life begins at conception.  Not only that, but the Bible goes into detail outlining a procedure that can only be described as an abortion. \n\nThey are Christian in name only.",
      "timestamp": "2022-09-21 05:33:44",
      "score": -1,
      "num_children": 1,
      "author": 60552,
      "replies": [
        {
          "id": "ipb5box",
          "text": "https://yourlogicalfallacyis.com/no-true-scotsman",
          "timestamp": "2022-09-21 09:24:17",
          "score": 1,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "ip8eunb",
      "text": "Christianity is pro abortion, even detailing how to perform them in the bible itself.\n\nCall it what it is; \"christians\" who dont even understand their own religion upset at others because some rich fuck told them god said they need a new jet.",
      "timestamp": "2022-09-20 19:21:02",
      "score": 0,
      "num_children": 0,
      "author": 328529,
      "replies": []
    },
    {
      "id": "ip8geob",
      "text": "Men ☕️",
      "timestamp": "2022-09-20 19:30:53",
      "score": 0,
      "num_children": 0,
      "author": 314239,
      "replies": []
    },
    {
      "id": "ip8lgeb",
      "text": "It has nothing to do with Christianity it has everything to do with these assholes owning the prison system.",
      "timestamp": "2022-09-20 20:02:57",
      "score": 0,
      "num_children": 0,
      "author": 366034,
      "replies": []
    },
    {
      "id": "ip90xcc",
      "text": "[removed]",
      "timestamp": "2022-09-20 21:44:17",
      "score": 0,
      "num_children": 1,
      "replies": [
        {
          "id": "ip94mck",
          "text": "Nobody contests that, but it's a very simplistic and disingenuous way of describing the issue. \n\nThe mother is a living creature, too, and the government shouldn't have the authority to deny her authority over her own body.",
          "timestamp": "2022-09-20 22:10:11",
          "score": 2,
          "num_children": 0,
          "author": 318636,
          "replies": []
        }
      ]
    },
    {
      "id": "ip98xgx",
      "text": "To be clear:  Those ain't \"Christian\" beliefs. It's christofascism. But then, that's all we got these days.",
      "timestamp": "2022-09-20 22:40:55",
      "score": 0,
      "num_children": 0,
      "author": 112136,
      "replies": []
    },
    {
      "id": "ipa4xsm",
      "text": "As a Christian, these politicians are crazy assholes that resemble pharisees far more than Christ, although I believe they're probably not religious at all but recognize it's a guaranteed voter base if they just identify as Christian. I'd love to see them all lose their next election, get recalled, or get jailed for whatever crazy shit they've done (and let's be honest, a number of them have done something worthy of jail time).",
      "timestamp": "2022-09-21 02:43:49",
      "score": 0,
      "num_children": 0,
      "author": 235474,
      "replies": []
    },
    {
      "id": "ipbhs65",
      "text": "[removed]",
      "timestamp": "2022-09-21 11:48:58",
      "score": 0,
      "num_children": 1,
      "replies": [
        {
          "id": "ipbpz9d",
          "text": "[This is a baby?](https://upload.wikimedia.org/wikipedia/commons/7/7b/Human_blastocyst.jpg) It doesn't look like a baby.",
          "timestamp": "2022-09-21 12:58:54",
          "score": 1,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "ipbr5kr",
              "text": "[removed]",
              "timestamp": "2022-09-21 13:08:05",
              "score": 1,
              "num_children": 1,
              "replies": [
                {
                  "id": "ipbr7jh",
                  "text": "[removed]",
                  "timestamp": "2022-09-21 13:08:30",
                  "score": 1,
                  "num_children": 0,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ipbmpna",
      "text": "> Emboldened by the overturning of Roe v. Wade, they say they will not be satisfied until fetuses are given the same protections as all US citizens \n\nWell we shouldn’t stop there. Let’s extend these protections to animals. They have the ability to suffer and feel pain much, much more than human fetuses can; in fact, human fetuses are a joke compared to the pleasure senses animals feel. Oh wait, these people don’t follow their logic and give no fucks about killing animals. Remember, Republicans only care about a child’s “life” when they’re not born yet.",
      "timestamp": "2022-09-21 12:32:42",
      "score": 0,
      "num_children": 0,
      "author": 258808,
      "replies": []
    }
  ]
}