{
  "id": "xm03pg",
  "text": "Georgia Gov. Brian kemp signals he is open to banning plan B contraception. We told you this would happen. The only way to stop this is to ensure that Stacey Abrams defeats this fool in Nov. Register to vote. Give what you can to her campaign. Phone bank. Fuck this theocracy bullshit! #NoYallQaeda\n[link about his comments](https://jezebel.com/gov-brian-kemp-signals-hes-open-to-banning-plan-b-cont-1849542606/amp)\n\nGet involved with Stacey’s campaign. \n\nThis election will determine, across the nation, whether the Christian taliban wins or whether freedom is still alive in this country. \n\nDo not sit on the sidelines.",
  "timestamp": "2022-09-23 15:07:58",
  "score": 13548,
  "subreddit": "t5_2qh2p",
  "num_children": 87,
  "author": 255450,
  "replies": [
    {
      "id": "ipluvrv",
      "text": "Fuck your religion. It’s YOURS, not mine",
      "timestamp": "2022-09-23 15:33:58",
      "score": 980,
      "num_children": 6,
      "author": 406025,
      "replies": [
        {
          "id": "ipm0b6j",
          "text": "This!\n\nImagine if Jews or Muslims tried to ban the sale of bacon in super markets, lol.",
          "timestamp": "2022-09-23 16:14:30",
          "score": 454,
          "num_children": 4,
          "author": 134027,
          "replies": [
            {
              "id": "ipm43b0",
              "text": "ooo, imagine if Muslims tried to ban alcohol.",
              "timestamp": "2022-09-23 16:42:15",
              "score": 291,
              "num_children": 11,
              "author": 349079,
              "replies": [
                {
                  "id": "ipmbhjt",
                  "text": "In college, I had a Palestinian roommate who wanted that very thing. I had to explain to him that we already tried that and it was a miserable failure.",
                  "timestamp": "2022-09-23 17:36:03",
                  "score": 197,
                  "num_children": 3,
                  "author": 241094,
                  "replies": [
                    {
                      "id": "ipmk3jb",
                      "text": "Not just a miserable failure, but an OPEN one. There was so much open drinking going on in most cities that the mayor of Berlin, visiting New York City in 1929, [innocently asked his hosts when prohibition was going into effect.](https://www.pbs.org/kenburns/prohibition/unintended-consequences) He was understandably surprised to learn it had been the law for nearly ten years at that point.",
                      "timestamp": "2022-09-23 18:39:20",
                      "score": 174,
                      "num_children": 5,
                      "author": 150369,
                      "replies": [
                        {
                          "id": "ipmmrif",
                          "text": "And don’t forget how we added poison commercial alcohols so people would die if they made alcohol from it.",
                          "timestamp": "2022-09-23 18:59:05",
                          "score": 73,
                          "num_children": 1,
                          "author": 278242,
                          "replies": [
                            {
                              "id": "ipmn60j",
                              "text": "Yep. They called it 'denaturing,' which sounds a lot more scientific/medical than just saying, \"Government sponsored mass poisoning.\"",
                              "timestamp": "2022-09-23 19:02:05",
                              "score": 55,
                              "num_children": 1,
                              "author": 150369,
                              "replies": [
                                {
                                  "id": "ipmuncq",
                                  "text": "Well we denatured alcohol before prohibition and we still do it today, but that's mainly to avoid the tariffs and taxes on consumable alcohol.  During prohibition the government activly worked to find poisons that couldn't be distilled out by chemists knowing full well that they where actively killing people.  Kinda disturbing how easily some of these people justified murdering the \"undesirable\" members of the population.",
                                  "timestamp": "2022-09-23 19:57:54",
                                  "score": 46,
                                  "num_children": 2,
                                  "author": 23484,
                                  "replies": [
                                    {
                                      "id": "ipn7ryz",
                                      "text": ">Well we denatured alcohol before prohibition and we still do it today, but that's mainly to avoid the tariffs and taxes on consumable alcohol.  \n\nAnd it's really fucking annoying. I have to go to a liquor store to get bottles of grain because I refuse to use denatured alcohol in my shop. The heavy metals in that shit leech through your skin.",
                                      "timestamp": "2022-09-23 21:35:04",
                                      "score": 8,
                                      "num_children": 2,
                                      "author": 324293,
                                      "replies": [
                                        {
                                          "id": "ipnah09",
                                          "text": "I've started doing the same around the house.  I don't use it frequently though so it's not as annoying to have a bottle on hand.",
                                          "timestamp": "2022-09-23 21:54:56",
                                          "score": 4,
                                          "num_children": 0,
                                          "author": 23484,
                                          "replies": []
                                        },
                                        {
                                          "id": "ipnbetm",
                                          "text": "What kind of shop puts alcohol on people's skin? I'm sure there's a normal explanation, it's just beyond me at the moment.",
                                          "timestamp": "2022-09-23 22:02:04",
                                          "score": 2,
                                          "num_children": 3,
                                          "author": 244360,
                                          "replies": [
                                            {
                                              "id": "ipnxiuw",
                                              "text": "You don't want to be wearing a hazmat suit respirator and gloves when doing basic jobs and the alcohol evaporates, or drips, or soaks through rags, or makes puddles. There's so many ways it can get on your skin or in to your lungs that full protection is the only way to be 100% sure it won't get on you.\n\nFortunately the country I'm in doesn't hate workers as much or have as many bonkers laws like the USA does so the methyl alcohol and acetone just have their own hazards and aren't doped up with extra poisons.",
                                              "timestamp": "2022-09-24 01:03:16",
                                              "score": 3,
                                              "num_children": 1,
                                              "author": 185891,
                                              "replies": [
                                                {
                                                  "id": "ipp7rkj",
                                                  "text": "I never knew alcohol had stuff like that in it. We talking like the rubbing alcohol we use on wounds and stuff or something else??",
                                                  "timestamp": "2022-09-24 09:50:14",
                                                  "score": 3,
                                                  "num_children": 1,
                                                  "author": 160464,
                                                  "replies": [
                                                    {
                                                      "id": "iq13xy5",
                                                      "text": "ETOH for industrial use. Like as a solvent. They put poison in it so it can't be sold for human consumption.\n\nThis means that the taxes on its sale will be lower since it is sold as as an industrial solvent (industrial good/low tax) instead of as hard liquor (luxury good/high tax).\n\nDuring Prohibition it would have been an even bigger deal, as 1,000 gallons of grain liquor would send you to prison for a long, long time, whereas the equivalent in denatured (poisoned) alcohol would be perfectly legal.",
                                                      "timestamp": "2022-09-26 22:24:41",
                                                      "score": 2,
                                                      "num_children": 0,
                                                      "author": 9653,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "ipnzam5",
                                              "text": "I should have written woodshop. I most often use it when mixing up shellac. But it's a solvent and general purpose cleaner. \n\nI can wear gloves of course (and still do sometimes), but I prefer non-toxic materials regardless.",
                                              "timestamp": "2022-09-24 01:18:18",
                                              "score": 3,
                                              "num_children": 2,
                                              "author": 324293,
                                              "replies": [
                                                {
                                                  "id": "ipo7t8i",
                                                  "text": "That makes sense, I've learned something today. Thanks for the reply.",
                                                  "timestamp": "2022-09-24 02:32:39",
                                                  "score": 2,
                                                  "num_children": 0,
                                                  "author": 244360,
                                                  "replies": []
                                                },
                                                {
                                                  "id": "ipp7cg2",
                                                  "text": "wood working novice in another country here, you telling me commercial alcohol containing methanol has added chemicals? that sounds insane, what about rubbing alcohol in medicine?",
                                                  "timestamp": "2022-09-24 09:44:05",
                                                  "score": 2,
                                                  "num_children": 1,
                                                  "author": 163956,
                                                  "replies": [
                                                    {
                                                      "id": "ipqsjy4",
                                                      "text": "It depends on what you mean by commercial. \n\nDenatured alcohol alcohol from a hardware store has had agents added to it to make it unpalatable. It's cheap though. \n\nRubbing alcohol is also denatured as well but at a much lower proof. It's in the 140 range (so unsuitable for mixing with shellac) and can be made from a couple different alcohols. The amount used and the dilution... And hopefully the denaturing agent used... Make it safe-ish for skin use. I use it in my shop to wet endgrain for smoother paring sometimes. \n\nGrain alcohol is pure with no additives and can be bought at 190 proof. It costs a little more but is non-toxic (to the extent that any alcohol is non-toxic). \n\nSo they're all commercial but sold for different purposes.\n\nI keep all my finishing materials non-toxic so I don't mind paying more for grain. In theory it'll make a smoother finish but I can't say that I saw a real difference once I switched.",
                                                      "timestamp": "2022-09-24 18:10:39",
                                                      "score": 1,
                                                      "num_children": 0,
                                                      "author": 324293,
                                                      "replies": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            },
                                            {
                                              "id": "ipoao33",
                                              "text": "You need to take a lot of precautions to not get it on your skin or to not breathe fumes, and accidents happen. The stuff is unnecessarily dangerous because of stupid antiquated bullshit.",
                                              "timestamp": "2022-09-24 02:58:54",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 65151,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "id": "ipn75li",
                                      "text": "Gentrification is a hell of a process and everyone thinks its as innocent as fads, reeducation through media, or building neutral/bland neighborhood suburbs. They always overlook the ***killing of undesirables*** that is also part of the process. They will go through any lengths to make it 'the perfect world'. If you dont fit the mold you can either move '*away',* pay the penalty, or convert.",
                                      "timestamp": "2022-09-23 21:30:21",
                                      "score": 15,
                                      "num_children": 0,
                                      "author": 310899,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ipmqeo5",
                          "text": "Tbf, prohibition prohibited the manufacture, sale, or transportation of alcohol, not the possession or consumption of it.  Presumably, if you purchased 1,000 bottles of booze before prohibition and kept them in your basement, you could get legally liquored up the rest of your life without issue.",
                          "timestamp": "2022-09-23 19:26:09",
                          "score": 9,
                          "num_children": 1,
                          "author": 380200,
                          "replies": [
                            {
                              "id": "ipn7u1g",
                              "text": "That isnt 100% accurate as one of the loopholes some places tried was 'giving away' alcohol with purchase of XXX item or donations to the local establishment. It didnt work as many busts were related to those 'charitable events'. Part of prohibition was confiscating and destroying the alcoholic drinks. A moon shiner who makes his own spirits just for himself was just as criminal as any other, no more than someone who had their own private storage. You were expected to report it and turn it into the police as it was now contraband.\n\nMoonshine has only recently become legal in the turn of the century for your own consumption and production, and you can legally sell it assuming you have the proper licensing and pay taxes on said sold products. Most moonshiners still break the law under the current standings still as they say fuck taxes, but the argument of the FDA is its for saftey and not about taxes due to possible health risks due to moonshiner's 'creative' methods of distillery. Its not uncommon for moonshiners to use an old car radiator as part of the process, among other makeshift components that are lying around.",
                              "timestamp": "2022-09-23 21:35:28",
                              "score": 5,
                              "num_children": 1,
                              "author": 310899,
                              "replies": [
                                {
                                  "id": "ipnmca8",
                                  "text": "The away things for alcohol totally worked. In fact the idea worked so well its exactly what places like Wadhington DC do to thus day for marijuana purchases. Here is a t-shirt and the free weed you didn't \"buy\"",
                                  "timestamp": "2022-09-23 23:29:06",
                                  "score": 0,
                                  "num_children": 0,
                                  "author": 99496,
                                  "replies": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ipoy7ko",
                          "text": "Even if you didn't want to break the law there were a ton of loopholes. You could get a doctor to prescribe you alcohol, sacramental wine was exempt and you were allowed to own whatever you had before it went into effect so if you had the money you just horded a shit ton of alcohol in the months before that happened. You also could buy the supplies to make your own stuff at home. You weren't supposed to be fermenting anything but it's not like anybody would know. They used to sell bricks of grape juice with explicit instructions about what NOT to do if you didn't want it to turn to wine.",
                          "timestamp": "2022-09-24 07:31:08",
                          "score": 4,
                          "num_children": 1,
                          "author": 66763,
                          "replies": [
                            {
                              "id": "ipp0sgm",
                              "text": "The grape extract bricks is one of the funniest and most cartoonishly obvious attempts to circumvent prohibition. Hands down one of the best stories to come out of that era.",
                              "timestamp": "2022-09-24 08:07:35",
                              "score": 2,
                              "num_children": 0,
                              "author": 150369,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ipn13z6",
                          "text": "That is my new favourite random story about prohibition. It’s up there with:\n\nhttps://www.reddit.com/r/todayilearned/comments/3pxrjc/til_after_getting_into_a_taxi_prohibition_agent/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
                          "timestamp": "2022-09-23 20:45:34",
                          "score": 3,
                          "num_children": 1,
                          "author": 10479,
                          "replies": [
                            {
                              "id": "ipn66hg",
                              "text": "I was going to post about that one too! They're both tied for first place as far as I'm concerned. 😂",
                              "timestamp": "2022-09-23 21:22:58",
                              "score": 2,
                              "num_children": 0,
                              "author": 150369,
                              "replies": []
                            }
                          ]
                        },
                        {
                          "id": "ipov4d4",
                          "text": "Moreover, it encouraged drinking spirits over beer which worsened the drinking problem considerably.",
                          "timestamp": "2022-09-24 06:49:10",
                          "score": 1,
                          "num_children": 0,
                          "author": 133896,
                          "replies": []
                        }
                      ]
                    },
                    {
                      "id": "ipmxe9z",
                      "text": "How dare you tempt my weak resolve by making it legal to purchase alcohol!",
                      "timestamp": "2022-09-23 20:18:35",
                      "score": 9,
                      "num_children": 0,
                      "author": 260820,
                      "replies": []
                    },
                    {
                      "id": "ipoainn",
                      "text": "Oh, but *this* time it will be different! /s",
                      "timestamp": "2022-09-24 02:57:29",
                      "score": 0,
                      "num_children": 0,
                      "author": 65151,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ipmd3sx",
                  "text": "What'd be really funny to see is a muslim politician wanting to ban alcohol in a county that's directly next to an already-dry county...where the alcohol ban was instituted by christian politicians.\n\nWatch people's heads explode when a muslim wants the same thing for the same reason next door.",
                  "timestamp": "2022-09-23 17:47:49",
                  "score": 60,
                  "num_children": 1,
                  "author": 59601,
                  "replies": [
                    {
                      "id": "ipmjwbf",
                      "text": "I'd pay good money to watch that all play out.",
                      "timestamp": "2022-09-23 18:37:48",
                      "score": 18,
                      "num_children": 1,
                      "author": 390240,
                      "replies": [
                        {
                          "id": "ipmrons",
                          "text": "I've heard that is how school choice has been defeated in a number of places. Just have Muslims try to set up their own taxpayer funded school, claim freedom of religion, the Christians REEEEEEEE until they are informed that \"religious freedom applies to ALL religions, morons,\" and then school choice is quietly canceled. \n\nSame for prayer or giving out religious literature in schools, the second other religions start putting out their own stuff, \"suddenly,\" it is imperative to protect children from religious exploitation, and the Christian stuff is quietly removed.",
                          "timestamp": "2022-09-23 19:35:38",
                          "score": 26,
                          "num_children": 1,
                          "author": 408587,
                          "replies": [
                            {
                              "id": "ipmsxxd",
                              "text": "That's basically what the Satanic temple is doing. Suing for fair representation of religions in state/county/city/etc and watching the crazy religious nuts head explode.",
                              "timestamp": "2022-09-23 19:45:02",
                              "score": 30,
                              "num_children": 0,
                              "author": 185449,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ipmf72r",
                  "text": "Or like when black people start buying/carrying guns magically repugnicans seem to think gun control is ok.",
                  "timestamp": "2022-09-23 18:03:15",
                  "score": 46,
                  "num_children": 2,
                  "author": 287297,
                  "replies": [
                    {
                      "id": "ipml4b7",
                      "text": "Just ask Ronald Reagan!",
                      "timestamp": "2022-09-23 18:46:53",
                      "score": 20,
                      "num_children": 0,
                      "author": 280120,
                      "replies": []
                    },
                    {
                      "id": "ipmosbr",
                      "text": "https://youtu.be/yJqfNroFp8U",
                      "timestamp": "2022-09-23 19:14:09",
                      "score": 1,
                      "num_children": 0,
                      "author": 301284,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ipo9k2h",
                  "text": "I mean they do in their countries.",
                  "timestamp": "2022-09-24 02:48:27",
                  "score": 3,
                  "num_children": 0,
                  "author": 64101,
                  "replies": []
                },
                {
                  "id": "ipn77d1",
                  "text": "LMFAO that would never fly in the South.",
                  "timestamp": "2022-09-23 21:30:43",
                  "score": 1,
                  "num_children": 0,
                  "author": 330709,
                  "replies": []
                },
                {
                  "id": "ipnh4lj",
                  "text": "Imagine if Christians tried to ban alcohol.",
                  "timestamp": "2022-09-23 22:46:54",
                  "score": 1,
                  "num_children": 0,
                  "author": 412827,
                  "replies": []
                },
                {
                  "id": "ipnl0ko",
                  "text": "Well Christians did successfully do this in the US not too long ago…",
                  "timestamp": "2022-09-23 23:18:22",
                  "score": 1,
                  "num_children": 0,
                  "author": 410959,
                  "replies": []
                },
                {
                  "id": "ipnmpe3",
                  "text": "Imagine if they start enforcing proper female attire...",
                  "timestamp": "2022-09-23 23:32:05",
                  "score": 1,
                  "num_children": 0,
                  "author": 161742,
                  "replies": []
                },
                {
                  "id": "ipnpl6u",
                  "text": "Imagine if Mormons banned alcohol, nicotine, and caffeine.",
                  "timestamp": "2022-09-23 23:56:29",
                  "score": 1,
                  "num_children": 0,
                  "author": 129879,
                  "replies": []
                },
                {
                  "id": "ipo2g9z",
                  "text": "Pretty sure the Christians already did that once upon a time..",
                  "timestamp": "2022-09-24 01:45:36",
                  "score": 1,
                  "num_children": 0,
                  "author": 292905,
                  "replies": []
                },
                {
                  "id": "ipmskfl",
                  "text": "Imagine if Muslims tried to do anything.",
                  "timestamp": "2022-09-23 19:42:15",
                  "score": 0,
                  "num_children": 0,
                  "author": 52800,
                  "replies": []
                }
              ]
            },
            {
              "id": "ipm4i5v",
              "text": "technically Christians shouldn't either if they are going to use Leviticus for other things.",
              "timestamp": "2022-09-23 16:45:12",
              "score": 22,
              "num_children": 0,
              "author": 162187,
              "replies": []
            },
            {
              "id": "ipni7je",
              "text": "Like the Bible clearly does!",
              "timestamp": "2022-09-23 22:55:31",
              "score": 1,
              "num_children": 0,
              "author": 121844,
              "replies": []
            },
            {
              "id": "ipo7ged",
              "text": "See you make a good comment, but it kind of derails the whole thread off its point. Here I am 5 minutes later reading about 1930's prohibition having completely forgotten the post itself ready to exit and move on.",
              "timestamp": "2022-09-24 02:29:29",
              "score": 1,
              "num_children": 0,
              "author": 109880,
              "replies": []
            }
          ]
        },
        {
          "id": "iplz4s4",
          "text": "oh they would love nothing more than to be allowed to force their religion on everyone else. they fucking fantasize about it.",
          "timestamp": "2022-09-23 16:05:42",
          "score": 55,
          "num_children": 1,
          "author": 9087,
          "replies": [
            {
              "id": "ipmru7a",
              "text": "They already own the deep south and somehow that's not enough for them.",
              "timestamp": "2022-09-23 19:36:46",
              "score": 7,
              "num_children": 1,
              "author": 408587,
              "replies": [
                {
                  "id": "ipms3x8",
                  "text": "They won't stop until they have the legal authority to just murder anyone who doesn't follow what they say.",
                  "timestamp": "2022-09-23 19:38:48",
                  "score": 14,
                  "num_children": 1,
                  "author": 9087,
                  "replies": [
                    {
                      "id": "ipmubkq",
                      "text": "Conservative men will be given a free pass for anything and everything though.",
                      "timestamp": "2022-09-23 19:55:22",
                      "score": 9,
                      "num_children": 1,
                      "author": 408587,
                      "replies": [
                        {
                          "id": "ipmwse3",
                          "text": "oh of course. they're men and should rule everything and everyone.  \n/s",
                          "timestamp": "2022-09-23 20:14:03",
                          "score": 8,
                          "num_children": 0,
                          "author": 9087,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ipmilhw",
          "text": "Obligatory. \n\nhttps://www.youtube.com/shorts/yQOyx0k6YG8",
          "timestamp": "2022-09-23 18:28:11",
          "score": 11,
          "num_children": 1,
          "author": 376584,
          "replies": [
            {
              "id": "ipo512c",
              "text": "Saved because I love this clip so much.",
              "timestamp": "2022-09-24 02:08:04",
              "score": 1,
              "num_children": 0,
              "author": 302964,
              "replies": []
            }
          ]
        },
        {
          "id": "ipmynb7",
          "text": "The problem is that a lot (probably most) don't see that it's their religion that is causing them to do this. They think that any kind of abortion is straight up murder, full stop, and think that they have science on their side.\n\nThis is what happens when you are indoctrinated from birth, it clouds your judgement because you interpret EVERYTHING through the lens of your religion and can't look at things objectively.",
          "timestamp": "2022-09-23 20:27:44",
          "score": 18,
          "num_children": 1,
          "author": 229997,
          "replies": [
            {
              "id": "ipn9on5",
              "text": "I’m a non-religious gay man and think abortion is murder. It’s not my religion that makes me think this.",
              "timestamp": "2022-09-23 21:49:00",
              "score": -11,
              "num_children": 4,
              "author": 309243,
              "replies": [
                {
                  "id": "ipnoboi",
                  "text": "Being religious isn't the only reason people are scientifically illiterate and wrong.",
                  "timestamp": "2022-09-23 23:45:37",
                  "score": 13,
                  "num_children": 0,
                  "author": 239652,
                  "replies": []
                },
                {
                  "id": "ipob4c5",
                  "text": "You're a man, your argument is invalid. I don't even know what the gay part is supposed to prove, nor do I even believe you. This is the internet, anyone can claim to be anything. For all you know I could be a prince or princess of some European nation.",
                  "timestamp": "2022-09-24 03:03:07",
                  "score": 7,
                  "num_children": 1,
                  "author": 65151,
                  "replies": [
                    {
                      "id": "ipokczm",
                      "text": "Well, I'm a Nigerian prince...",
                      "timestamp": "2022-09-24 04:36:33",
                      "score": 3,
                      "num_children": 0,
                      "author": 370262,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ipo99oq",
                  "text": ">-48 karma\n\nBegone troll.",
                  "timestamp": "2022-09-24 02:45:42",
                  "score": 5,
                  "num_children": 0,
                  "author": 126168,
                  "replies": []
                },
                {
                  "id": "ipvavd6",
                  "text": "So let me ask you this: do you think that a fertilized egg that hasn't implanted into the uterine wall is a person and destroying it is murder? So the plan B pill is murder?\n\nAnd if that's the case, then IVF treatments that attempt to implant multiple embryos (fertilized eggs), in the hopes that one attaches and becomes viable is also multiple counts of murder.",
                  "timestamp": "2022-09-25 18:17:09",
                  "score": 1,
                  "num_children": 1,
                  "author": 229997,
                  "replies": [
                    {
                      "id": "ipvdkoc",
                      "text": "Yes, I would say plan B is the same as an abortion. I would also be opposed to IVF, as the logical conclusion has to be either conception makes a person or it doesn’t, and if you agree that it does then IVF would be knowingly destroying human life in the hopes that one might survive.",
                      "timestamp": "2022-09-25 18:33:14",
                      "score": 0,
                      "num_children": 0,
                      "author": 309243,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ipns7iq",
          "text": "Christian taliban, get it?",
          "timestamp": "2022-09-24 00:18:38",
          "score": 5,
          "num_children": 0,
          "author": 80058,
          "replies": []
        },
        {
          "id": "ippvlke",
          "text": "If only locals had the guts of the Iranian folk and started chasing these vermin out of our town and lives. Yeah right.",
          "timestamp": "2022-09-24 14:10:15",
          "score": 1,
          "num_children": 0,
          "author": 276651,
          "replies": []
        }
      ]
    },
    {
      "id": "iplyz00",
      "text": "The people of Georgia won't get this chance to save their freedoms again for a VERY LONG TIME if they don't choose Abrams and let KKKemp and the GOP continue running the people into the ground.",
      "timestamp": "2022-09-23 16:04:30",
      "score": 178,
      "num_children": 0,
      "author": 8100,
      "replies": []
    },
    {
      "id": "ipm4iwr",
      "text": "Half of these dopes probably don't even believe any of the garbage they spew, they are simply using it as political leverage.",
      "timestamp": "2022-09-23 16:45:21",
      "score": 145,
      "num_children": 3,
      "author": 95820,
      "replies": [
        {
          "id": "ipmb1kg",
          "text": "Exactly. When their mistresses need an abortion, they will receive an abortion. It’s as simple as that.",
          "timestamp": "2022-09-23 17:32:54",
          "score": 79,
          "num_children": 3,
          "author": 241094,
          "replies": [
            {
              "id": "ipmsh3r",
              "text": "But their situation is special, their wife doesn't put out anymore you see, and they need an exception, they're not like those \"sluts\" who use abortion as birth control!",
              "timestamp": "2022-09-23 19:41:34",
              "score": 25,
              "num_children": 1,
              "author": 408587,
              "replies": [
                {
                  "id": "ipmv8ol",
                  "text": "The only moral abortion is my abortion.",
                  "timestamp": "2022-09-23 20:02:20",
                  "score": 20,
                  "num_children": 0,
                  "author": 57136,
                  "replies": []
                }
              ]
            },
            {
              "id": "ipmy4nu",
              "text": "Saw a bumper sticker:\n\n\"we'll see how 'pro life' you are when I fuck your husband.\"",
              "timestamp": "2022-09-23 20:23:53",
              "score": 14,
              "num_children": 0,
              "author": 158727,
              "replies": []
            },
            {
              "id": "ipp3cp3",
              "text": "For example, congressman of TN, Scott Dejarlais, and his mistress/patient from his medical practice. He urged her to get an abortion, yet holds strongly to being pro-life. \n\nWe do not have to imagine this scenario. He’s been in office for about a decade since this happened.",
              "timestamp": "2022-09-24 08:44:51",
              "score": 2,
              "num_children": 0,
              "author": 24884,
              "replies": []
            }
          ]
        },
        {
          "id": "ipm97mi",
          "text": "This is a very relevant comment, I truly believe this is the case",
          "timestamp": "2022-09-23 17:19:43",
          "score": 10,
          "num_children": 0,
          "author": 172390,
          "replies": []
        },
        {
          "id": "ipmisjn",
          "text": "of course. I'm sure Kemp's mistresses have had plenty of abortions.",
          "timestamp": "2022-09-23 18:29:37",
          "score": 6,
          "num_children": 0,
          "author": 225170,
          "replies": []
        }
      ]
    },
    {
      "id": "iplyipm",
      "text": "Reminder that Plan B (“the morning after pill”) does not cause an abortion. It prevents pregnancy by preventing or delaying ovulation.",
      "timestamp": "2022-09-23 16:01:06",
      "score": 490,
      "num_children": 10,
      "author": 34130,
      "replies": [
        {
          "id": "ipmak0z",
          "text": "Guaranteed Kemp has no clue what any of those big words mean",
          "timestamp": "2022-09-23 17:29:25",
          "score": 223,
          "num_children": 3,
          "author": 83592,
          "replies": [
            {
              "id": "ipmkgdi",
              "text": "He probably thinks 'ovulation' is that chocolate milk powder they used to advertise on the Orphan Annie radio show.",
              "timestamp": "2022-09-23 18:41:58",
              "score": 86,
              "num_children": 4,
              "author": 150369,
              "replies": [
                {
                  "id": "ipn4msr",
                  "text": "A nice warm mug of ovulation sends me to sleep at night like nothing else",
                  "timestamp": "2022-09-23 21:11:28",
                  "score": 10,
                  "num_children": 1,
                  "author": 35452,
                  "replies": [
                    {
                      "id": "ipn518k",
                      "text": "B E  S U R E  T O  D R I N K  Y O U R  O V U L A T I O N",
                      "timestamp": "2022-09-23 21:14:29",
                      "score": 20,
                      "num_children": 0,
                      "author": 163932,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ipol14n",
                  "text": "They are really that ignorant. You say to them \"ovulation\" and they'll start talking about how we don't descend from monkeys and all creatures were created in our current form by their almighty deity.",
                  "timestamp": "2022-09-24 04:44:12",
                  "score": 6,
                  "num_children": 1,
                  "author": 370262,
                  "replies": [
                    {
                      "id": "ipor22o",
                      "text": "It's always really fun to use scientific terms that SOUNDS like something they'd object to, but in a way that doesn't give many clues as to what it means. Then watch them try to express their self righteous moral outrage without giving away the fact that they have absolutely no fucking idea what they're even objecting to.\n\nIt's good for the soul.",
                      "timestamp": "2022-09-24 05:56:03",
                      "score": 5,
                      "num_children": 0,
                      "author": 150369,
                      "replies": []
                    }
                  ]
                },
                {
                  "id": "ipo31h5",
                  "text": "Ovaltine?",
                  "timestamp": "2022-09-24 01:50:43",
                  "score": 5,
                  "num_children": 0,
                  "author": 290014,
                  "replies": []
                },
                {
                  "id": "ipo1qpq",
                  "text": "Haha, why don't they call it Roundulation, right Jerry?",
                  "timestamp": "2022-09-24 01:39:27",
                  "score": 2,
                  "num_children": 0,
                  "author": 283835,
                  "replies": []
                }
              ]
            },
            {
              "id": "ipn7wgp",
              "text": "Right.  Republicans aren't big on education; they often wallow in, or even worse, rejoice in ignorance. --- Dogbite Williams",
              "timestamp": "2022-09-23 21:35:59",
              "score": 5,
              "num_children": 0,
              "author": 207075,
              "replies": []
            },
            {
              "id": "ipnrj4f",
              "text": "No, he's smart enough to know the big words, he's just evil and power-hungry.",
              "timestamp": "2022-09-24 00:12:59",
              "score": 2,
              "num_children": 0,
              "author": 265660,
              "replies": []
            }
          ]
        },
        {
          "id": "ipmiq6g",
          "text": "So what if it was an abortion pill. The bibul is 100% pro-abortion, mostly forced. There is literally no valid argument against abortion even if you do allow for religious ones.",
          "timestamp": "2022-09-23 18:29:08",
          "score": 41,
          "num_children": 1,
          "author": 199255,
          "replies": [
            {
              "id": "ipmmlw0",
              "text": "Well it was never for moral reasons , it's all about control . They want to control women and shame them for having sex without marriage and just want to keep them in control so that like old times they would invest their whole life in catring children .",
              "timestamp": "2022-09-23 18:57:55",
              "score": 28,
              "num_children": 1,
              "replies": [
                {
                  "id": "ipms99t",
                  "text": "Exactly, conservative religious men are not in ANY manner, \"purer\" than liberal men, they have sex at and demand sex at the same exact rates as their pro-feminist counterparts. They just miss their \"sex on tap\" with anyone-wife, mistress, schoolgirl, secretary, concubine, slave, hooker, servant-and the woman would ALWAYS be blamed in the case of unplanned pregnancy. Conservative, religious men could beat their women, cheat on them, peace out and leave them destitute, and society never wagged a finger at them. And pregnancy was a GREAT way to control women on top of it. It kept women out of the political sphere, schoolhouse, and workplace. Reproductive rights for women took a LOT of that control away and they are itching for it BACK.",
                  "timestamp": "2022-09-23 19:39:56",
                  "score": 23,
                  "num_children": 1,
                  "author": 408587,
                  "replies": [
                    {
                      "id": "ipmvitq",
                      "text": "Yeah exactly, to those who are accustomed to privileged  equality feels like oppression. There leaders don't care much about God's will because if you actually read Bible, God is a cruel piece of shit who kills kids without mercy and the only women who are atleast seen as valuable objects were virgin women. Just look back at all the war stories, they just didn't consider them even a useful object if a women wasn't virgin and will mercilessly kill kids too. God doesn't care about children like how he orders to bash infants against rocks and gives constant threats on killing little children who have no involved with the matter .           \nYou are right they just want a virgin wife at home which will completely obey them while they fuck around as much as they won't. This hatred against women is quite clearly stated in Bible also and how they should be slave to their husband and I guess this line from Genesis summaries it all -\n\"I will greatly multiply thy sorrow and thy conception; in sorrow thou shalt bring forth children; and thy desire shall be to thy husband, and he shall rule over thee.\"--Genesis 3:16.           \nMajorly any women who has control over her body and is independent won't ever agree with it and the hate it .",
                      "timestamp": "2022-09-23 20:04:28",
                      "score": 10,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ipndvkt",
                          "text": "As a Christian myself, 100% agree. I am a proud psychopath and sociopath myself, and can perfectly justify it with the Bible. I LOVE being super fucked up.",
                          "timestamp": "2022-09-23 22:21:13",
                          "score": -1,
                          "num_children": 0,
                          "author": 408587,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ipmmhrb",
          "text": "I got into an argument with my sister in law about this several years back.  She got mad and left because I wouldn't put up with her calling it an abortion pill.",
          "timestamp": "2022-09-23 18:57:04",
          "score": 17,
          "num_children": 0,
          "author": 140461,
          "replies": []
        },
        {
          "id": "ipm20l8",
          "text": "Not to be that guy, but reminder that it doesn’t matter if it was an abortion pill because women have bodily autonomy. Forcing decisions on their bodies that they have no say is wrong. \n\nHonestly I wish there was a pill that caused the body to treat the fetus or embryo as an infection or foreign substance and therefore the body stops sending it anything. It’s not aborting the fetus. It’s simply stopping the body from supporting the fetus. If the fetus can’t survive without being a parasite on a woman’s body then that’s it’s own problem. Should’ve thought about that before deciding to implant yourself in someone else’s body.",
          "timestamp": "2022-09-23 16:27:09",
          "score": 120,
          "num_children": 2,
          "author": 4226,
          "replies": [
            {
              "id": "ipm2c6y",
              "text": "My point is they’ve already crossed the line from banning abortion to banning birth control.",
              "timestamp": "2022-09-23 16:29:31",
              "score": 88,
              "num_children": 3,
              "author": 34130,
              "replies": [
                {
                  "id": "ipm32zx",
                  "text": "No, I know that, but it shifts the Overton window to the right by saying that. They will keep pushing and taking shit away because people become complacent. Think about all the prior abortion laws before Dobbs. They all started to chip away. We should have done/should do NOW is stand our ground with our rights. A woman has a right to an abortion: PERIOD. A law is introduced banning abortions in the third trimester? Nope! That’s a violation of a woman’s right to an abortion full stop. \n\nI’m not trying to start shit with you by the way. I just think they’re trying ANYTHING to distract from abortion itself.",
                  "timestamp": "2022-09-23 16:35:00",
                  "score": 52,
                  "num_children": 0,
                  "author": 4226,
                  "replies": []
                },
                {
                  "id": "ipnd7sl",
                  "text": "Because it never was about abortion. It was about women being able to have \"consequence free sex\". Always and forever.\n\nThis is why they won't teach sex ed, or make condoms available, or anything actually *proven* to reduce abortions - because it was never about reducing abortions, it was about those \"nasty, loose women\" getting away with sex without \"the consequences God intended\" \n\nEducation on reproduction? Why that sounds like \"being able to have sex without pregnancy because you learned about how it works\". Can't have that. If you're educated on sex you might have it without consequences! \n\nSo of course banning contraceptives is on the table. Because it wasn't about anything except controlling women's sexuality top to bottom.",
                  "timestamp": "2022-09-23 22:16:03",
                  "score": 16,
                  "num_children": 0,
                  "author": 292084,
                  "replies": []
                },
                {
                  "id": "ipo2mhc",
                  "text": "Adultery will be next, obviously. And by adultery, obviously that's any unmarried woman having sex.",
                  "timestamp": "2022-09-24 01:47:07",
                  "score": 3,
                  "num_children": 0,
                  "author": 292905,
                  "replies": []
                }
              ]
            },
            {
              "id": "ipn1u8j",
              "text": "The ‘ abortion pill’ is actually two different types of pills. The first one Mifepristone blocks progesterone's action on the uterus, making it incapable of supporting a pregnancy. \n\nThe second causes the uterus to contract expelling the embryo\n\nhttps://www.scientificamerican.com/article/how-medication-abortion-with-ru-486-mifepristone-works/?amp=true",
              "timestamp": "2022-09-23 20:50:50",
              "score": 5,
              "num_children": 1,
              "author": 230452,
              "replies": [
                {
                  "id": "iporat7",
                  "text": "You don‘t even need both. Misoprostol alone is enough to end a pregnancy. \n\n\nAlso in the first 8 weeks methotrexate is also perfectly capable of stopping the growth of a fetus and thus causing a miscarriage.\n\n\nAnd much easier to get in the wild. Cause it‘s a frequently prescribed drug against rheumatoid arthritis and similar autoimmune conditions as well as chemotherapy for cancer.\n\n\nWhich is exactly why women of child bearing age are now denied their methotrexate prescriptions for RE…\n\n\n\nAnd if you want to go the not used routinely route: any of the eye drops ending in prostol can also be used. Like Lanoprostol etc.\n\nBecause they have the exact same effect as Misoprostol. And literature is full of case reports of accidental miscarriages caused by confusing the once a day -prostol eye drops with artificial tears that will be used every couple of minutes.\n\n\n\n\n\nAlso you can thank Edouard Sakiz for mifepristone even being on the market. \n\nChristofascists did a major campaign again Roussel Uclaf or Hoechst AG as the majority owner for daring to bring it to market, which caused their fearful owners to withdraw it from market a very short while later.\n\nThe guy that developed mifepristone then begged Hoechst to transfer the patent to him, which allowed the drug to be brought to market again.",
                  "timestamp": "2022-09-24 05:59:10",
                  "score": 3,
                  "num_children": 0,
                  "author": 108033,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ipmtf1o",
          "text": "I wonder what the actual reason for banning it would be then.",
          "timestamp": "2022-09-23 19:48:36",
          "score": 5,
          "num_children": 2,
          "author": 175673,
          "replies": [
            {
              "id": "ipn2fcm",
              "text": "Two large anti choice orgs think it’s an ‘ abortifacient’ . They think that all hormonal contraception is . They will go after them next .\n\n\nhttps://studentsforlife.org/learn/contraception/\n\nReally it’s because their Catholics",
              "timestamp": "2022-09-23 20:55:08",
              "score": 6,
              "num_children": 0,
              "author": 230452,
              "replies": []
            },
            {
              "id": "ipo9hkv",
              "text": "The politicians want control, the masses are ignorant and hate consequence free sex.",
              "timestamp": "2022-09-24 02:47:48",
              "score": 1,
              "num_children": 0,
              "author": 126168,
              "replies": []
            }
          ]
        },
        {
          "id": "ipn51zg",
          "text": "But it prevents God's will brother! \n\nWhich is right wing christian for \"We need to force people to carry their pregnancies, our numbers have flatlined.\"",
          "timestamp": "2022-09-23 21:14:38",
          "score": 3,
          "num_children": 0,
          "author": 68776,
          "replies": []
        },
        {
          "id": "ipocw9f",
          "text": "Conservatives just see “female self-autonomy” and go “yeah, ban that.”",
          "timestamp": "2022-09-24 03:20:14",
          "score": 3,
          "num_children": 0,
          "author": 200321,
          "replies": []
        },
        {
          "id": "ipnrem4",
          "text": "\"It may also prevent fertilization of a released egg (joining of sperm and egg) or attachment of a fertilized egg to the uterus (implantation).\" So in rarer cases it can also prevent implantation of a fertilized egg, so I see how if you believe life begins at point when egg meets sperm this could be considered abortion.",
          "timestamp": "2022-09-24 00:11:55",
          "score": 2,
          "num_children": 1,
          "author": 215089,
          "replies": [
            {
              "id": "ipnrzsq",
              "text": "If you believe life begins when sperm fertilizes egg, then God kills untold millions of “babies” every year. What a monster!",
              "timestamp": "2022-09-24 00:16:51",
              "score": 4,
              "num_children": 1,
              "author": 34130,
              "replies": [
                {
                  "id": "ipnt00i",
                  "text": "lol yep thats why its a dumb belief, something like 20% of all pregnancys get miscarried, often before they even realize they are pregnant.",
                  "timestamp": "2022-09-24 00:25:20",
                  "score": 5,
                  "num_children": 0,
                  "author": 215089,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ipo6is2",
          "text": "Guy can’t find the clitoris.  No chance he knows about this.",
          "timestamp": "2022-09-24 02:21:14",
          "score": 2,
          "num_children": 0,
          "author": 11791,
          "replies": []
        },
        {
          "id": "ipp067t",
          "text": "Conception begins at the orgasm",
          "timestamp": "2022-09-24 07:58:53",
          "score": 1,
          "num_children": 0,
          "author": 40691,
          "replies": []
        }
      ]
    },
    {
      "id": "ipmefn4",
      "text": "The anti-abortion timeline:\n\nStep 1: \"We would never do that.\"\n\nStep 2: \"We promise, we don't even care about that.\"\n\nStep 3: \"You're paranoid and over-reacting for accusing us of wanting to do that.\"\n\nStep 4: \"LOL we did it fuck you.\"",
      "timestamp": "2022-09-23 17:57:35",
      "score": 96,
      "num_children": 2,
      "author": 326529,
      "replies": [
        {
          "id": "ipoa7t5",
          "text": "They all said we were hysterical when we suggested roe would get overturned yet here we are. Don't let conservatives gaslight us.",
          "timestamp": "2022-09-24 02:54:41",
          "score": 20,
          "num_children": 0,
          "replies": []
        },
        {
          "id": "ipoaafj",
          "text": "I thought you were talking about recent supreme Court justices...",
          "timestamp": "2022-09-24 02:55:22",
          "score": 2,
          "num_children": 0,
          "author": 246581,
          "replies": []
        }
      ]
    },
    {
      "id": "ipm6y3y",
      "text": "This is why fighting voter apathy is a huge concern. Politics affects our daily lives, not just when contraception is on the chopping block, but *now* everyone wants to do something about it.",
      "timestamp": "2022-09-23 17:03:04",
      "score": 51,
      "num_children": 0,
      "author": 306585,
      "replies": []
    },
    {
      "id": "ipmliu2",
      "text": "Making plan B is illegal is only the start if the master plan for Christian Taliban\n\nThey are all in for banning ALL BIRTH CONTROL,  even for people who aren't using it to prevent pregnancies\n\nComing soon with @GOP Taliban fanatics in power will be criminalizing  miscarriages.   Fall down a set of stairs, and lose your fetus?   Next stop is prison\n\nNext up, they are going after Obergfell v Hodges, which legalized gay marriage in all 50 states\n\n\nhttps://en.wikipedia.org/wiki/Obergefell_v._Hodges\n\n\nIn the entire history of the USA, there's NOTHING that can't be justified by \"SINCERELY HELD RELIGIOUS BELIEF\" including burning \"witches\" alive, killing people for their skin color, slavery, preventing women from voting, and  banning inter-racial marriages\n\nThat's the way it was in 1860, and these TrumpVangelical  monsters are all in for a  bible based society ruled by a militant Christian Jihad",
      "timestamp": "2022-09-23 18:49:54",
      "score": 49,
      "num_children": 2,
      "author": 344477,
      "replies": [
        {
          "id": "ipw7j3j",
          "text": "They'll ban condoms again.",
          "timestamp": "2022-09-25 21:45:36",
          "score": 2,
          "num_children": 0,
          "author": 250497,
          "replies": []
        },
        {
          "id": "ipmu06y",
          "text": ">They are all in for banning ALL BIRTH CONTROL,  even for people who aren't using it to prevent pregnancies\n\nBRUH, do you really think they will go after condoms and vasectomies? That would infringe on men's rights to choose and their bodily autonomy, I don't think they would like that too much. \n\nAnd not so sure about 1860 since prostitution and abortion were legal then.",
          "timestamp": "2022-09-23 19:52:59",
          "score": -10,
          "num_children": 4,
          "author": 408587,
          "replies": [
            {
              "id": "ipmyzxb",
              "text": "They will absolutely go after condoms and vasectomies, they'll just further skew the law so men aren't accountable for pregnancies.",
              "timestamp": "2022-09-23 20:30:19",
              "score": 22,
              "num_children": 1,
              "author": 22500,
              "replies": [
                {
                  "id": "ipndnv1",
                  "text": "Ah that makes sense. How do you think they will make condoms and vasectomies illegal though without sounding like they are taking \"options\" away from men?",
                  "timestamp": "2022-09-23 22:19:35",
                  "score": 6,
                  "num_children": 0,
                  "author": 408587,
                  "replies": []
                }
              ]
            },
            {
              "id": "ipmuekg",
              "text": "Yes they will. They're scared about the fact that no one can afford to / wants to have children anymore. They need more human capital stock and they will do anything except provide a society and economy in which people can and want to have babies.",
              "timestamp": "2022-09-23 19:56:00",
              "score": 18,
              "num_children": 0,
              "author": 100432,
              "replies": []
            },
            {
              "id": "ipocbon",
              "text": "Half those assholes are the ones who stealth women or complain about how they can't get off with condoms. They don't care, they have already openly said they will go after contraception.",
              "timestamp": "2022-09-24 03:14:41",
              "score": 4,
              "num_children": 1,
              "author": 65151,
              "replies": [
                {
                  "id": "ipomi85",
                  "text": "But what if men complain (I mean, if the government bans condoms and vasectomies)? I wonder what will happen then?",
                  "timestamp": "2022-09-24 05:01:08",
                  "score": 2,
                  "num_children": 0,
                  "author": 408587,
                  "replies": []
                }
              ]
            },
            {
              "id": "ipod6o9",
              "text": "You should look up the Comstock Act. Or the forced sterilizations that were a few decades later. Or what happened to Margaret Sanger with her multiple arrests.",
              "timestamp": "2022-09-24 03:23:00",
              "score": 4,
              "num_children": 1,
              "author": 304381,
              "replies": [
                {
                  "id": "ipomg31",
                  "text": "Ah, yeah, no doubt we had protesting Christians then too talking about the \"good ol days\" when \"people did the RIGHT thing...\" I have heard rumors of forced sterilizations at the border today but I don't know if there's any solid evidence. I do forget that the Comstock Act did go after condoms to a certain extent.",
                  "timestamp": "2022-09-24 05:00:26",
                  "score": 1,
                  "num_children": 1,
                  "author": 408587,
                  "replies": [
                    {
                      "id": "ipoqft1",
                      "text": "Well, [I remember when ICE was accused by many of forced sterilizations during the Trump Administration](https://lawblogs.uc.edu/ihrlr/2021/05/28/not-just-ice-forced-sterilization-in-the-united-states/) But that article shows that forced sterilization was more common than one might think in our history.",
                      "timestamp": "2022-09-24 05:48:17",
                      "score": 2,
                      "num_children": 1,
                      "author": 304381,
                      "replies": [
                        {
                          "id": "ipoqyl6",
                          "text": "For sure, and we forcefully tested our birth control on Puerto Rican women as well.",
                          "timestamp": "2022-09-24 05:54:50",
                          "score": 2,
                          "num_children": 0,
                          "author": 408587,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ipm0rwl",
      "text": "thanks for the shoutout.  we're working on it, but goddamn, there're a lot of racists and misogynists in this state.  \n\nAbram's website:  [https://staceyabrams.com/](https://staceyabrams.com/)\n\nMy Voter Page Georgia: [https://mvp.sos.ga.gov/s/](https://mvp.sos.ga.gov/s/)  register to vote, confirm your registration, find your polling place, get a sample ballot, etc.",
      "timestamp": "2022-09-23 16:17:59",
      "score": 129,
      "num_children": 2,
      "author": 69293,
      "replies": [
        {
          "id": "ipmxv42",
          "text": "You can also request an absentee ballot so you can vote on your own time. No excuse needed or asked for.",
          "timestamp": "2022-09-23 20:21:57",
          "score": 12,
          "num_children": 1,
          "author": 292058,
          "replies": [
            {
              "id": "ipmz2m7",
              "text": "true, but they did make it more difficult, so check the rules and track your ballot to make sure it gets counted.",
              "timestamp": "2022-09-23 20:30:52",
              "score": 12,
              "num_children": 0,
              "author": 69293,
              "replies": []
            }
          ]
        },
        {
          "id": "ipnfn3z",
          "text": "I’m literally sitting at the kitchen table with my wife addressing postcards to encourage registered voters to get out and VOTE! I really feel this might be the last chance we get to turn the tide in the country and save democracy.",
          "timestamp": "2022-09-23 22:35:07",
          "score": 4,
          "num_children": 0,
          "author": 2215,
          "replies": []
        }
      ]
    },
    {
      "id": "ipm3t2g",
      "text": "This is all very important to be aware of and terrifying. \n\nBut also, why is the banner picture of Tula skincare products? I accidentally thought this was a different sub for a minute.",
      "timestamp": "2022-09-23 16:40:14",
      "score": 19,
      "num_children": 1,
      "author": 17120,
      "replies": [
        {
          "id": "ippdpa5",
          "text": "Theres an ad in the article and a couple pics before it but the pic it chose as this posts banner pic is the ad.",
          "timestamp": "2022-09-24 11:12:26",
          "score": 1,
          "num_children": 1,
          "author": 225211,
          "replies": [
            {
              "id": "ippvkpu",
              "text": "Ah, makes sense!",
              "timestamp": "2022-09-24 14:10:03",
              "score": 1,
              "num_children": 0,
              "author": 17120,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ipmbpj2",
      "text": "Imagine if Christian Taliban actually cared about even ONE of the things Jesus is said to have cared about, and not micromanaging everyone’s sexuality.",
      "timestamp": "2022-09-23 17:37:40",
      "score": 16,
      "num_children": 0,
      "author": 241094,
      "replies": []
    },
    {
      "id": "ipmgghw",
      "text": "You can't make these people happy.\n\nLess unwanted babies = less burden on every part of society\n\nYet, they are brainwashed into forcing women into being baby making machines for their imaginary racist leader in the sky.",
      "timestamp": "2022-09-23 18:12:36",
      "score": 16,
      "num_children": 1,
      "author": 2810,
      "replies": [
        {
          "id": "ipmu3vm",
          "text": "Hey, if the real Jesus showed up, they would shoot him as a evil brown illegal \"Muslim Arab\" man haha.",
          "timestamp": "2022-09-23 19:53:45",
          "score": 5,
          "num_children": 1,
          "author": 408587,
          "replies": [
            {
              "id": "ipnw0si",
              "text": "No, they would shoot him, as a dead Jesus is much more beneficial to them than a live one.",
              "timestamp": "2022-09-24 00:50:51",
              "score": 4,
              "num_children": 1,
              "author": 306879,
              "replies": [
                {
                  "id": "ipw7q7a",
                  "text": "Don't want him preaching tolerance or something liberal.",
                  "timestamp": "2022-09-25 21:47:01",
                  "score": 1,
                  "num_children": 0,
                  "author": 250497,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ipmj2yu",
      "text": "The Yuzpe method comes in handy here... it's more or less the same as taking multiple birth control pills, but there are some calculations that would required to make it effective.\n\nWe need to share this far and wide, so women can prepare themselves.\n\nI'm a married woman with kids, and I've needed Plan B. This ban is fucking bullshit.\n\nEDIT: not that I'm slut shaming anyone - all women need access to Plan B; married, single, sex-workers, it doesn't matter. ALL WOMEN need access to emergency contraceptives.",
      "timestamp": "2022-09-23 18:31:45",
      "score": 16,
      "num_children": 1,
      "author": 327449,
      "replies": [
        {
          "id": "ipn03aq",
          "text": "With this method, you can take the doses of your birth control pills required 2 times spread out over as close to 12 hours apart as you can get them. They even have a chart with exactly how many pills you would need to take of just about all the current brands. It's usually about 4 pills each time, but please Google the Yuzpe Method to check the dose for your specific brand because I only gave an amount so it won't surprise you if you ever have to look it up. I'd hate for someone to be expecting to only need to put aside an extra 2 or so pills when they need almost a third of a pack!",
          "timestamp": "2022-09-23 20:38:17",
          "score": 3,
          "num_children": 0,
          "author": 212781,
          "replies": []
        }
      ]
    },
    {
      "id": "ipn78t3",
      "text": "Next is all forms of contraception. Then banning possession of it. Then banning traveling out of state to get any of these services. Fucking monsters.",
      "timestamp": "2022-09-23 21:31:01",
      "score": 14,
      "num_children": 1,
      "author": 118472,
      "replies": [
        {
          "id": "ippilmk",
          "text": "And out of the country. Everyone is welcome where I live for a visit, but I bet the second they have a chance, they make it really difficult and scary to return.",
          "timestamp": "2022-09-24 12:09:12",
          "score": 2,
          "num_children": 1,
          "author": 207635,
          "replies": [
            {
              "id": "ipw7wjp",
              "text": "I wonder if they'll force women who get pregnant visiting America to stay until they give birth.",
              "timestamp": "2022-09-25 21:48:15",
              "score": 1,
              "num_children": 0,
              "author": 250497,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ipm2qmc",
      "text": "You don't need to win the lottery if you can legislate an entire other group to lose it. \n\nControl of women's bodies, or any other group of peoples bodies will lead to fewer opportunities for pursuit of higher education and family planning on a timeline that benefits the individual.  \n\nA legally oppressed class of people leads to lower wages for that group.  If they have to work for lower wages,  because they can no longer use their bodies how they see fit, they have lost the lottery.  \n\nAs a man, my wages dont need to go up if I can ensure yours always remain low. Removing choices, controlling your body does that.  \n\nAn entire group of women in republican states will have to choose abstinence, be beholden to whatever man chooses to be her baby daddy, or a lifetime of part-time flexible low paying jobs to support the family they didn't plan for or were not ready for.",
      "timestamp": "2022-09-23 16:32:28",
      "score": 39,
      "num_children": 2,
      "author": 358926,
      "replies": [
        {
          "id": "ipmtshe",
          "text": ">A legally oppressed class of people leads to lower wages for that group.  If they have to work for lower wages,  because they can no longer use their bodies how they see fit, they have lost the lottery.\n\nTHIS. Poorer men will celebrate their ability to \"put women in their place again.\" They will celebrate their access to \"sex on tap\" and \"consequence free sex\" that they've always had. They will think their access to employment and better wages will increase since they \"don't have to compete with affirmative action WAHMYN anymore.\" They will be thankful to have pregnancy as a means to control their women again. They will be happy that conservatives will never hold THEM accountable for unplanned pregnancy per the usual (notice how almost NO anti-choice legislation targets the men who cause 100% of unplanned pregnancies? That's by design.) Beat their women, cheat on them, leave them-IT'S ALL GOOD, MAN!\n\nBut these men have NO idea just how much society as a whole will SUFFER because of lack of reproductive freedom for women. And that includes their own quality of life.",
          "timestamp": "2022-09-23 19:51:22",
          "score": 9,
          "num_children": 0,
          "author": 408587,
          "replies": []
        },
        {
          "id": "ipnlh9q",
          "text": "or a new political power of Liliths rises up...",
          "timestamp": "2022-09-23 23:22:06",
          "score": 1,
          "num_children": 0,
          "author": 341719,
          "replies": []
        }
      ]
    },
    {
      "id": "ipm872v",
      "text": "So when are they going to start introducing the Morality Police and Social Scoring systems in the States. Any more of this bullshit and next thing you know, you've got a bad case of The Handmaid's Tale in real live, no one wants that, well, anyone who thinks for themselves wouldn't want that.\n\nGood luck to anyone having to live under this complete religious bullshit.",
      "timestamp": "2022-09-23 17:12:20",
      "score": 35,
      "num_children": 2,
      "author": 183323,
      "replies": [
        {
          "id": "ipmiyzw",
          "text": "Aren’t Texas police already hunting down people for abortions and helping their children?",
          "timestamp": "2022-09-23 18:30:56",
          "score": 18,
          "num_children": 1,
          "author": 242458,
          "replies": [
            {
              "id": "ipmnjvt",
              "text": "Yeah they probably are, scary thought isn't it?",
              "timestamp": "2022-09-23 19:04:59",
              "score": 5,
              "num_children": 0,
              "author": 183323,
              "replies": []
            }
          ]
        },
        {
          "id": "ipmsyyh",
          "text": "They cry incessantly about the evil Atheist Communist Chinese surveillance state while being jealous that THEY don't have a way of enacting it here yet. \n\n\"You know, like THAT, but with JEBUS! AH YEAHHHHH!\"",
          "timestamp": "2022-09-23 19:45:15",
          "score": 8,
          "num_children": 1,
          "author": 408587,
          "replies": [
            {
              "id": "ipmxopz",
              "text": "They'd love to have that kinda surveillance.",
              "timestamp": "2022-09-23 20:20:41",
              "score": 4,
              "num_children": 0,
              "author": 183323,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ipmvdfn",
      "text": "As a leftist the democrats suck, but they don't suck nearly as much as the Republicunts. \n\nChristo-fascists has no place on this planet and needs to be extinguished.",
      "timestamp": "2022-09-23 20:03:20",
      "score": 12,
      "num_children": 1,
      "author": 102552,
      "replies": [
        {
          "id": "ipw8dps",
          "text": "The choice is neoliberal plutocracy with the veneer of democracy, giving lip service to Christianity, or a fascist theocratic dictatorship. I know which evil I will choose.",
          "timestamp": "2022-09-25 21:51:35",
          "score": 1,
          "num_children": 1,
          "author": 250497,
          "replies": [
            {
              "id": "ipwcjlc",
              "text": "As they would day: Amen",
              "timestamp": "2022-09-25 22:21:50",
              "score": 1,
              "num_children": 0,
              "author": 102552,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ipmhfb6",
      "text": "Vinings Ga. here. Gee, motherfucker I guess you really want me to vote against this barbaric, dark-age agenda. Shit, I'll take the entire day off and help bus people to the polls.",
      "timestamp": "2022-09-23 18:19:39",
      "score": 10,
      "num_children": 2,
      "author": 90838,
      "replies": [
        {
          "id": "ipmke81",
          "text": "This. This right here is how you're going to get rid of these antiquated fuckholes. I am astonished that this is happening in this day and age. I swear I thought this was a joke...then I read the article and nearly barfed. Wtf, USA?",
          "timestamp": "2022-09-23 18:41:31",
          "score": 5,
          "num_children": 0,
          "author": 382174,
          "replies": []
        },
        {
          "id": "ipms5hu",
          "text": "with what they're doing to mail-in voting, there will be more of a need for that.",
          "timestamp": "2022-09-23 19:39:09",
          "score": 2,
          "num_children": 0,
          "author": 69293,
          "replies": []
        }
      ]
    },
    {
      "id": "ipnnrza",
      "text": "For fucks sake, we knew that they wouldn't stop at Roe, that they would want to go after Griswold next. The logic would be merely frustrating for the deep stupidity of it wasn't so consequential.\n\nThey falsely claim that many forms of birth control, from plan B to the pill to IUDs cause abortion rather than prevent pregnancy. And they use a strained definition of abortion where a fertilized egg not implanting counts as an abortion.\n\nBut none of the methods act by preventing implantation anyway! Take Plan B. It is a progestin. Read the fucking name. Progestin. It is pro gestation. It is a hormone that makes your body think it's pregnant and to keep that pregnancy going. Therefore, don't ovulate another egg and risk messing up the pregnancy. How stupid do these fucks have to be to think that the hormone that keeps you pregnant is going to cause an abortion?",
      "timestamp": "2022-09-23 23:41:01",
      "score": 9,
      "num_children": 1,
      "author": 33396,
      "replies": [
        {
          "id": "ipo1vv9",
          "text": "I've heard multiple conservatives talk about wanting to ban *any* medication that could be used for or result in abortion or miscarriage. Their \"thought\" process is to head off any attempt at \"Oh, this isn't an abortion pill, it's this other thing!\" Problem is that that would get rid of a litany of medications. Got arthritis? Too bad. Psoriasis? Deal with it. Lupus? It's never Lupus. Crohn's? Fuck off. Cancer? When you get there fuck off again.\n\nThinking things through isn't their strong suit.",
          "timestamp": "2022-09-24 01:40:42",
          "score": 8,
          "num_children": 2,
          "author": 9290,
          "replies": [
            {
              "id": "ipo8gya",
              "text": "I've got the same fear. You already see anecdotes about women not being able to get legitimate prescriptions filled because there is also a use for the drug on abortions. For many of the birth control methods they target as \"abortifacients\" it would only be a side effect if they did prevent implantation and not the normal means of action. If you are going to ban birth control over theoretical side effects, the next logical step is to just start banning ALL medicine that could possibly have a side effect of preventing implantation or causing a miscarriage.",
              "timestamp": "2022-09-24 02:38:31",
              "score": 3,
              "num_children": 0,
              "author": 33396,
              "replies": []
            },
            {
              "id": "ipw8l4z",
              "text": "So basically a woman is there to make babies and if she can't do that it doesn't matter if she dies.",
              "timestamp": "2022-09-25 21:53:05",
              "score": 1,
              "num_children": 0,
              "author": 250497,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ipn8at0",
      "text": "And I'm open to his castration.",
      "timestamp": "2022-09-23 21:38:56",
      "score": 6,
      "num_children": 0,
      "author": 96570,
      "replies": []
    },
    {
      "id": "ipnckq4",
      "text": "How is this any worse than islamic theocracies in the middle east?\n\n(It isn't, just a different flavour)\n\nAlso, if we look at history, nothing good has ever come from involving religion in politics.",
      "timestamp": "2022-09-23 22:11:01",
      "score": 7,
      "num_children": 1,
      "author": 14375,
      "replies": [
        {
          "id": "ipopy8c",
          "text": "This is different. They're white, instead of brown!",
          "timestamp": "2022-09-24 05:42:07",
          "score": 1,
          "num_children": 0,
          "author": 257007,
          "replies": []
        }
      ]
    },
    {
      "id": "iplyg09",
      "text": "Guess it is time to order 100 plan b's. What's the exp date btw?",
      "timestamp": "2022-09-23 16:00:32",
      "score": 16,
      "num_children": 3,
      "author": 65057,
      "replies": [
        {
          "id": "ipmu37l",
          "text": "Please don't panic buy them, it will remove stocks for women who need them right now. Buy a couple, sure. Then wait and buy a couple more, but please, please don't buy hundreds. In the meantime, get your contraception sorted, including vasectomy for men.",
          "timestamp": "2022-09-23 19:53:37",
          "score": 12,
          "num_children": 0,
          "author": 100432,
          "replies": []
        },
        {
          "id": "iplz8nn",
          "text": "4 years IIRC.",
          "timestamp": "2022-09-23 16:06:31",
          "score": 8,
          "num_children": 0,
          "author": 286151,
          "replies": []
        },
        {
          "id": "ipo4j95",
          "text": "Drug expiration dates are largely a meme. They get slightly less effective as they get older, but they still work. It’s more so a liability thing for medications that require incredibly precise dosages. \n\nYour allergy meds would still work fine if they were made in 1995, just a tad weaker. Obviously there are exceptions to this, but I’ve seen/heard far too many people throw out old meds because they think they’re dangerous or something. Pharmaceutical drugs have a better shelf life than we do haha.",
          "timestamp": "2022-09-24 02:03:43",
          "score": 4,
          "num_children": 1,
          "author": 120962,
          "replies": [
            {
              "id": "ipo6e65",
              "text": "My son is a hospital pharmacist.  He isn't mainly a retail pill counter; he actually researches pharmaceuticals.\n\nHe says that for most medicines the number of heat-cold cycles the medicines go through is actually more important than the age.  Some medicines are also vulnerable to humidity levels.  In an ideal world, many medicines would not have an expiration date.  They would have an indicator on the bottle that changed as the medicine aged and went through periods of fluctuating heat and humidity levels.",
              "timestamp": "2022-09-24 02:20:08",
              "score": 5,
              "num_children": 1,
              "author": 122319,
              "replies": [
                {
                  "id": "ipo6l5d",
                  "text": "Yeah I was going to mention this in the comment but I forgot to. How you store the medication also matters a lot more than purely the age. Factors like humidity, light exposure, temperature etc can definitely break down medication. Having your aspirin in a dry, dark, cool cabinet for a decade will likely do close to nothing",
                  "timestamp": "2022-09-24 02:21:49",
                  "score": 2,
                  "num_children": 1,
                  "author": 120962,
                  "replies": [
                    {
                      "id": "ipo6x6x",
                      "text": "Yeah I was going to mention this in the comment but I forgot to. How you store the medication also matters a lot more than purely the age. Factors like humidity, light exposure, temperature etc can definitely break down medication. Having your aspirin in a dry, dark, cool cabinet for a decade will likely do close to nothing\n\nWhat’s really funny is any sort of injectable medication, as well as BAC water. BAC water is literally isoprop alcohol + water, you add it to a vial of powdered medication so that you actually have something to inject. The expiration date on basically *anything* in a vial? 30 days. BAC water? 30 days. You’re telling me that water+alcohol “goes bad” 30 days after you open it lmfao? Everyone I’ve known who’s ever used BAC water, including myself, has a vial that literally years old. It’s such bullshit, just an umbrella blanket amount to cover their ass.",
                      "timestamp": "2022-09-24 02:24:45",
                      "score": 2,
                      "num_children": 1,
                      "author": 120962,
                      "replies": [
                        {
                          "id": "ippakw3",
                          "text": "I have heard the excuse that the date is actually on the integrity of the seal on the vial.\n\nIn a similar manner, bottled water typically has an expiration date of a year. The date is on the bottle, not the water. Bottled water bottles are incredibly thin plastic.  But like medicine, time is not the real factor. The kryptonite for water bottles is exposure to UV light.",
                          "timestamp": "2022-09-24 10:31:05",
                          "score": 1,
                          "num_children": 0,
                          "author": 122319,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ipm953f",
      "text": "That's cool and all but  \nWhy the fuck is georgias state flag \\*THAT\\*",
      "timestamp": "2022-09-23 17:19:13",
      "score": 5,
      "num_children": 1,
      "author": 126156,
      "replies": [
        {
          "id": "ipmsb6x",
          "text": "it's actually an improvement over the one with the actual stars-and-bars.  though it's confederate enough for them what know history.",
          "timestamp": "2022-09-23 19:40:21",
          "score": 1,
          "num_children": 1,
          "author": 69293,
          "replies": [
            {
              "id": "ipmsqwe",
              "text": "I don't understand your comment, their flag HAS the actuall stars and bars  \nThey just added something inside the stars",
              "timestamp": "2022-09-23 19:43:36",
              "score": 1,
              "num_children": 1,
              "author": 126156,
              "replies": [
                {
                  "id": "ipmt1to",
                  "text": "look up the state flag from 1956-2001.  that's the one i was referring to.",
                  "timestamp": "2022-09-23 19:45:52",
                  "score": 1,
                  "num_children": 1,
                  "author": 69293,
                  "replies": [
                    {
                      "id": "ipmt9cp",
                      "text": "And, once again, I repeat, that they have the stars and bars as their state flag right nowWhat is your point, I'm so confusedThey have the flag of the Confederate States of Americe, the stars and bars, as their state flag, since 2003, they didn't have one before",
                      "timestamp": "2022-09-23 19:47:25",
                      "score": 1,
                      "num_children": 1,
                      "author": 126156,
                      "replies": [
                        {
                          "id": "ipmtzqr",
                          "text": "did you look up the flag with the \"battle flag?\"  (ignore my stars-and-bars misnomer.)  the \"battle flag\" became popular during the civil rights movement, and was added to the georgia flag then.\n\nthe current flag was a *compromise* to get that even more racially motivated symbol off the flag.  \n\nand to answer your original question: because there are a fuck-ton of white supremacists in this state.",
                          "timestamp": "2022-09-23 19:52:53",
                          "score": 2,
                          "num_children": 1,
                          "author": 69293,
                          "replies": [
                            {
                              "id": "ipmutjc",
                              "text": "This is a compromise? If you ask me that's a step in a worse direction but I suppose America is weird",
                              "timestamp": "2022-09-23 19:59:12",
                              "score": 1,
                              "num_children": 1,
                              "author": 126156,
                              "replies": [
                                {
                                  "id": "ipn1rvf",
                                  "text": "> America is weird\n\nJust wait until you find out how the South is even weirder.  FYI, the confederate battle flag is the one mostly used as a racist symbol in America.  Even the idiots that claim it's just a symbol of their Southern heritage know that (strange how nobody in Germany flies a Third Reich flag or wants to erect staues of Hitler and Goebbels to honor their heritage, but I digress).  Your average stupid racist redneck thinks the battle flag was actually the real flag of the confederacy.  Most of them have no idea that the stars and bars was actually the flag of the traitor nation.",
                                  "timestamp": "2022-09-23 20:50:21",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 388774,
                                  "replies": [
                                    {
                                      "id": "ipp0216",
                                      "text": "Oh, I know about that, unfortunately",
                                      "timestamp": "2022-09-24 07:57:14",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 126156,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ipmlpgw",
      "text": "Does kemp remember he won by a pretty small margin last time?  And that was with him actively interfering as secretary of state.  Riling up the left seems ill advised.",
      "timestamp": "2022-09-23 18:51:14",
      "score": 4,
      "num_children": 0,
      "author": 74641,
      "replies": []
    },
    {
      "id": "ipn15av",
      "text": "I'm signaling that I'm 100% open to removing tax exemptions for all religious organizations.",
      "timestamp": "2022-09-23 20:45:50",
      "score": 5,
      "num_children": 0,
      "author": 76788,
      "replies": []
    },
    {
      "id": "ipng5bh",
      "text": "How would this even do any good for *anyone*? I have a hard time seeing how even republicans would justify this one.",
      "timestamp": "2022-09-23 22:39:08",
      "score": 5,
      "num_children": 1,
      "replies": [
        {
          "id": "ipw8vai",
          "text": "Moar wHite babies!! Moarrrrrrr!",
          "timestamp": "2022-09-25 21:55:06",
          "score": 1,
          "num_children": 0,
          "author": 250497,
          "replies": []
        }
      ]
    },
    {
      "id": "ipmmwia",
      "text": "Hey just a reminder!- you can buy 'fuck brian kemp' merchandise from online. I got a candle.",
      "timestamp": "2022-09-23 19:00:07",
      "score": 4,
      "num_children": 0,
      "author": 169096,
      "replies": []
    },
    {
      "id": "ipmskzp",
      "text": "Also please check out r/votedem for ways and campaigns to help!",
      "timestamp": "2022-09-23 19:42:22",
      "score": 4,
      "num_children": 0,
      "author": 186150,
      "replies": []
    },
    {
      "id": "ipmbj7y",
      "text": "Too bad they don’t try to ban dick pills and surgically enhancing your penis, wasn’t part of god’s plans. This past year I’ve hoped for more women in office to get elected so they can start banning shit against men, particularly the old men.\n\nFucking ridiculous, next up is condoms I guess? Nothing else left. The whole republican platform has been an onslaught onto the lgqbt+ community and women, nothing for the communities/country/people they’re supposed to serve.",
      "timestamp": "2022-09-23 17:36:23",
      "score": 22,
      "num_children": 4,
      "author": 8572,
      "replies": [
        {
          "id": "ipmsqgh",
          "text": "Or STD meds.\n\nAIDS is somehow \"righteous judgement\" from God if a gay man gets it, but the hetero man who also gets it is entitled to medicine and \"grace.\"",
          "timestamp": "2022-09-23 19:43:31",
          "score": 5,
          "num_children": 1,
          "author": 408587,
          "replies": [
            {
              "id": "ipodxxa",
              "text": "More money into the \"healthcare system\"",
              "timestamp": "2022-09-24 03:30:08",
              "score": 1,
              "num_children": 0,
              "author": 244540,
              "replies": []
            }
          ]
        },
        {
          "id": "ipmpcjk",
          "text": "I mean these are the people that extended the death and health toll of the pandemic with their sheer idiocy and selfish childishness. They are a plague and they don't deserve anything they have",
          "timestamp": "2022-09-23 19:18:21",
          "score": 5,
          "num_children": 0,
          "author": 253646,
          "replies": []
        },
        {
          "id": "ipmifwe",
          "text": "More random banning to fight the banning isn’t, imho, the way. We should ban anything medical due to medical reasons. I.e. unsafe medication or medical procedures. Ban conversion therapy, because that’s just torture dressed up as psychology for the illiterate.\n\nDick pills, contraceptives, and abortion should be legal. They are medically sound things. Only ban if we have newer and safer versions.\n\nLet’s not get down to their level. Equality for all, even the shit humans. They can change, sometimes.",
          "timestamp": "2022-09-23 18:27:02",
          "score": 10,
          "num_children": 0,
          "author": 242458,
          "replies": []
        },
        {
          "id": "ipmnwsc",
          "text": ">  This past year I’ve hoped for more women in office to get elected so they can start banning shit against men\n\nThere are a lot of women out there that are just fine with it and want to help",
          "timestamp": "2022-09-23 19:07:37",
          "score": 6,
          "num_children": 1,
          "author": 390774,
          "replies": [
            {
              "id": "ipmp8o7",
              "text": "Marjorie Taylor Greene and Lauren Boebert have entered the chat.",
              "timestamp": "2022-09-23 19:17:32",
              "score": 5,
              "num_children": 0,
              "author": 173270,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ipmjfom",
      "text": "Waaaaait a minute here. So you're saying that not only is America denying basic women's healthcare ie: abortions but now they're trying to make it so that you can't protect yourself from pregnancy either? Is your country fucked or what? Seriously USA...how can you call yourselves the greatest nation in the world when you literally treat your women like this? What in the lifting fuck is wrong with you people? No, I don't want to hear that \"it's only a small fringe that's trying to enforce this insanity\" because enough of your countrymen voted these stupid fucks into office. And you call China corrupt. Get fucked.",
      "timestamp": "2022-09-23 18:34:22",
      "score": 15,
      "num_children": 3,
      "author": 382174,
      "replies": [
        {
          "id": "ipmp3nc",
          "text": "We are the greatest nation on Earth when it comes to bombing people. Especially brown people.\n\n> “Can’t build a decent car, can’t make a TV set or a VCR worth a fuck, got no steel industry left, can’t educate our young people, can’t get health care to our old people, but we can bomb the shit out of your country all right! Huh? Especially if your country is full of brown people—oh we like that don’t we? That’s our hobby! That’s our new job in the world: bombing brown people. Iraq, Panama, Grenada, Libya, you got some brown people in your country, tell them to watch the fuck out or we’ll goddamn bomb them!”\n\n-George Carlin",
          "timestamp": "2022-09-23 19:16:30",
          "score": 11,
          "num_children": 0,
          "author": 390774,
          "replies": []
        },
        {
          "id": "ipp7zx1",
          "text": "> they're trying to make it so that you can't protect yourself from pregnancy either?\n\nThis. What has been the greatest liberator of women in history? A: The ability to regulate their own fertility through effective contraception. They want to return women back to at least the 1950s (though back to before 1920 and women's right to vote would be even better in their view). They want to get [white] wimmin (sic) back to being barefoot, pregnant and chained to the kitchen sink asap.",
          "timestamp": "2022-09-24 09:53:41",
          "score": 1,
          "num_children": 0,
          "author": 404371,
          "replies": []
        },
        {
          "id": "ipw926c",
          "text": "I think it's mainly nationalists who still call us the greatest nation in the world. Everyone else is pretty much worried about us becoming a dictatorship and has their eyes wide open. It's about 30% of our country who would vote for Trump no matter what.",
          "timestamp": "2022-09-25 21:56:30",
          "score": 1,
          "num_children": 0,
          "author": 250497,
          "replies": []
        }
      ]
    },
    {
      "id": "ipmbu1h",
      "text": "[removed]",
      "timestamp": "2022-09-23 17:38:35",
      "score": 13,
      "num_children": 2,
      "replies": [
        {
          "id": "ipmgn1m",
          "text": "How are Democrats supposed to pass that without 60 votes in the Senate?",
          "timestamp": "2022-09-23 18:13:56",
          "score": 13,
          "num_children": 2,
          "author": 286151,
          "replies": [
            {
              "id": "ipmivdz",
              "text": "Did they at some point have 60 votes? I think the general argument is that they should never have leaned on the Supreme Court and at the first chance they got should have legislated it.\n\n(I genuinely do not know the number of seats in the last 50 years, nor if there was a political time there was 60 willing to do the right thing. It’s a big subject.)",
              "timestamp": "2022-09-23 18:30:12",
              "score": 3,
              "num_children": 1,
              "author": 242458,
              "replies": [
                {
                  "id": "ipmiylw",
                  "text": "They did and they should have, but the person who I was replying to said they could still do it now. I'm not sure how.",
                  "timestamp": "2022-09-23 18:30:51",
                  "score": 3,
                  "num_children": 2,
                  "author": 286151,
                  "replies": [
                    {
                      "id": "ipmkngl",
                      "text": "They did and they had multiple anti abortion senators in that supermajority so they couldn't have done anything because they didn't have the votes.\n\nWhenever people bring up Obama's supermajority for roevwade they are 100% trying to convince people to stop voting.",
                      "timestamp": "2022-09-23 18:43:25",
                      "score": 8,
                      "num_children": 0,
                      "author": 46451,
                      "replies": []
                    },
                    {
                      "id": "ipmwf65",
                      "text": "They can’t even get 50 votes due to the pseudo-GOP senator(s) under D flag at this point. Afaik they tried. So you are most correct.\n\nThe one thing, unless I’m crazy here, that can be done is winning more seats to create a super majority in the future. But for that to happen we need insanely charismatic people that can get people to vote for them. Let’s face it, it’s a popularity contest.",
                      "timestamp": "2022-09-23 20:11:18",
                      "score": 2,
                      "num_children": 0,
                      "author": 242458,
                      "replies": []
                    }
                  ]
                }
              ]
            },
            {
              "id": "ipmhszo",
              "text": "[removed]",
              "timestamp": "2022-09-23 18:22:21",
              "score": -1,
              "num_children": 4,
              "replies": [
                {
                  "id": "ipmnbpo",
                  "text": ">Democrats FAILED to protect abortion rights, and they need to be held accountable for that failure before they can be given the power and responsibility to fix it\n\nI'm done with this line of thinking. I'm not buying it anymore. If Republicans weren't so busy ripping everything apart, we wouldn't need anyone to pass legislation. I'm not going to focus my anger on Democrats because Republicans are racists, homophobic, misogynistic assholes. \n\nWhile you are busy ranting about holding Democrats accountable, Republicans will happily go about the business of making shit 10 times worse because your anger isn't focused on them. \n\nYou can cut your nose off to spite your face if you want, but I'm not coming along for the ride.",
                  "timestamp": "2022-09-23 19:03:18",
                  "score": 11,
                  "num_children": 0,
                  "author": 225788,
                  "replies": []
                },
                {
                  "id": "ipmok4a",
                  "text": "The Senate is where accountability goes to die.",
                  "timestamp": "2022-09-23 19:12:26",
                  "score": 4,
                  "num_children": 0,
                  "author": 390774,
                  "replies": []
                },
                {
                  "id": "ipmhyoj",
                  "text": "Here is what you said:\n\n> What Democrats should have done, **and absolutely still COULD do**, is actually pass federal legislation that protects the rights of women, specifically about their bodily autonomy including their right to abortions.\n\nHow could they still do that? By what method?",
                  "timestamp": "2022-09-23 18:23:30",
                  "score": 10,
                  "num_children": 0,
                  "author": 286151,
                  "replies": []
                },
                {
                  "id": "ipmkhxd",
                  "text": "There were multiple anti abortion senators.",
                  "timestamp": "2022-09-23 18:42:17",
                  "score": 2,
                  "num_children": 1,
                  "author": 46451,
                  "replies": [
                    {
                      "id": "ipmp0mb",
                      "text": "[removed]",
                      "timestamp": "2022-09-23 19:15:52",
                      "score": 0,
                      "num_children": 1,
                      "replies": [
                        {
                          "id": "ipmpr9x",
                          "text": "1. Apologies, I'm sick and tired of seeing this nonsense which is so easily debunked.\n2. If you can't see the contradiction then I don't know what to say. Please explain how a supermajority is going to pass a bill when members of that supermajority vocally and historically vote against the passing of similar bills. Do you suppose that \"supermajority\" just means that the president can write a bill and it pops into existence because he has more teammates? Do you think that somehow punishing the players on his team that don't agree with the bill would do any good beyond making it impossible to push any other bill during the majority?\n3. Republicans are already against abortion rights. What purpose does putting forth a bill to get shot down immediately as expected serve, especially given that every single time a bill shows up that should be supported (like the most recent money to disclose dark money in politics), people like you immediately say DEMOCRATS DONT ACTUALLY WANT THIS PASSED THIS IS ALL POLITICAL POSTURING, as they are quite literally right now doing.",
                          "timestamp": "2022-09-23 19:21:21",
                          "score": 3,
                          "num_children": 0,
                          "author": 46451,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ipmdbl8",
          "text": "Can’t scare the base if you actually fix the problems permanently.\n\nSame reason the GOP screams about protecting gun rights and does nothing when they can.",
          "timestamp": "2022-09-23 17:49:23",
          "score": 4,
          "num_children": 0,
          "author": 182154,
          "replies": []
        }
      ]
    },
    {
      "id": "ipmv7ud",
      "text": "God these fucking fascists really hate people having sex, as if actual well-rounded intelligent human beings give a shit about the prohibitions listed in their fairy tale. If you want to torment yourself with a laundry list of silly rules to live your life by please do it in fucking peace and keep it to yourself.",
      "timestamp": "2022-09-23 20:02:10",
      "score": 3,
      "num_children": 0,
      "author": 163936,
      "replies": []
    },
    {
      "id": "ipmzi2s",
      "text": "Religion really is a plague for many",
      "timestamp": "2022-09-23 20:34:02",
      "score": 3,
      "num_children": 0,
      "author": 185965,
      "replies": []
    },
    {
      "id": "ipn1usw",
      "text": "Religion ruins everything.",
      "timestamp": "2022-09-23 20:50:57",
      "score": 3,
      "num_children": 0,
      "author": 229770,
      "replies": []
    },
    {
      "id": "ipn6tpi",
      "text": "They sell them cheap on Amazon. Anyone in that state better stock up! If I were to ever pray, it would be for a fucking asteroid. This country is going to shit.",
      "timestamp": "2022-09-23 21:27:48",
      "score": 3,
      "num_children": 0,
      "author": 345643,
      "replies": []
    },
    {
      "id": "ipnfvvr",
      "text": "Everybody knows what has to happen to stop these people but it's impossible to talk about on most subs",
      "timestamp": "2022-09-23 22:37:01",
      "score": 3,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ipo1vlz",
      "text": "The Bible is the pedophiles manifesto since it promotes incest inbreeding cannibalism human sacrifice to prove your loyalty adultery rape having children out of wedlock",
      "timestamp": "2022-09-24 01:40:38",
      "score": 3,
      "num_children": 0,
      "author": 354036,
      "replies": []
    },
    {
      "id": "ipo2orz",
      "text": "Why is circumcision legal.\n\n&#x200B;\n\nNo consent.",
      "timestamp": "2022-09-24 01:47:41",
      "score": 3,
      "num_children": 1,
      "author": 161054,
      "replies": [
        {
          "id": "ipw9mnv",
          "text": "Babies are property to be given to God through a covenant adults decide to enter them into which they can't consent to.",
          "timestamp": "2022-09-25 22:00:40",
          "score": 1,
          "num_children": 0,
          "author": 250497,
          "replies": []
        }
      ]
    },
    {
      "id": "ipmvpk4",
      "text": "They're trying to make it so sex is only for making babies and not for enjoyment. They're literally trying to outlaw sexuality.",
      "timestamp": "2022-09-23 20:05:54",
      "score": 3,
      "num_children": 1,
      "author": 413206,
      "replies": [
        {
          "id": "ipw9fyi",
          "text": "And love. Gay and interracial marriage are next up on the chopping block.",
          "timestamp": "2022-09-25 21:59:20",
          "score": 1,
          "num_children": 1,
          "author": 250497,
          "replies": [
            {
              "id": "ipw9nhh",
              "text": "Oh absolutely. They are trying to control sexuality and relationships because the indoctrinated family unit is crucial to their survival",
              "timestamp": "2022-09-25 22:00:50",
              "score": 1,
              "num_children": 0,
              "author": 413206,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ipnt1oo",
      "text": "if voting isn’t enough, take the steps into your own hands. buy a pollen press and buy mifepristone and misoprostal powders yourself. google Four Thieves Vinegar Collective for more info. \n\nfree women don’t ask.",
      "timestamp": "2022-09-24 00:25:44",
      "score": 4,
      "num_children": 0,
      "author": 132247,
      "replies": []
    },
    {
      "id": "ipmv7d8",
      "text": "Yeah anyone in these states still voting republican is insane or just as shitty as kemp is.",
      "timestamp": "2022-09-23 20:02:04",
      "score": 2,
      "num_children": 0,
      "author": 97083,
      "replies": []
    },
    {
      "id": "ipn6biu",
      "text": "Abraham’s would do wonders for us fellow Georgians if she wins, it will also bring out the closet racist in numbers !",
      "timestamp": "2022-09-23 21:24:01",
      "score": 2,
      "num_children": 0,
      "author": 391418,
      "replies": []
    },
    {
      "id": "ipn9lum",
      "text": "Last I heard she trailed Kemp by 6 points,  critically among African American men. \n\nWe're fucked here in Georgia.",
      "timestamp": "2022-09-23 21:48:27",
      "score": 2,
      "num_children": 1,
      "author": 371072,
      "replies": [
        {
          "id": "ipna2ze",
          "text": "Misogynistic men? Tell me more about this unknown thing.",
          "timestamp": "2022-09-23 21:51:57",
          "score": 3,
          "num_children": 0,
          "author": 302818,
          "replies": []
        }
      ]
    },
    {
      "id": "ipnhhpc",
      "text": "An Abrams victory would not ensure reproductive rights. If she wins but GOP takes control of Congress watch what happens. They have the court now. Very little can stop them.",
      "timestamp": "2022-09-23 22:49:51",
      "score": 2,
      "num_children": 0,
      "author": 46637,
      "replies": []
    },
    {
      "id": "ipp75pu",
      "text": "He'll just steal the election... again",
      "timestamp": "2022-09-24 09:41:19",
      "score": 2,
      "num_children": 0,
      "author": 261488,
      "replies": []
    },
    {
      "id": "ippveai",
      "text": "They’ll still vote for him, most of the women in Georgia will vote for who their husband tells them to. I am really the only freedom lover in my friend group and when I suggest when they’re alone in the voting booth voting their conscience they won’t do it",
      "timestamp": "2022-09-24 14:08:35",
      "score": 2,
      "num_children": 1,
      "author": 12018,
      "replies": [
        {
          "id": "ipw9ok9",
          "text": "Or they won't say they do it.",
          "timestamp": "2022-09-25 22:01:02",
          "score": 1,
          "num_children": 0,
          "author": 250497,
          "replies": []
        }
      ]
    },
    {
      "id": "ipq1rbr",
      "text": "The people who support this probably have no idea what plan B even is… Fox News lumps it in with Mifeprestone, which is the pill you take for medical abortions. \n\nThey all get called “the abortion pill”",
      "timestamp": "2022-09-24 14:58:11",
      "score": 2,
      "num_children": 0,
      "author": 310475,
      "replies": []
    },
    {
      "id": "ipmrl3v",
      "text": ">When asked about the governor's stance on Plan B and contraception, a   \nspokesperson with Kemp's campaign said, \"The Governor has never opposed   \naccess to contraception.\"\n\nhttps://www.11alive.com/article/news/politics/gov-kemp-plan-b-contraception-stance/85-f82e7445-8762-4fe9-8006-e1dc491b6920",
      "timestamp": "2022-09-23 19:34:54",
      "score": 2,
      "num_children": 1,
      "author": 244462,
      "replies": [
        {
          "id": "ipn0fy1",
          "text": "They lied before and they are lying again. They lie. He lied. It's not the truth. They said they wouldn't make it a states rights thing, and now look.",
          "timestamp": "2022-09-23 20:40:49",
          "score": 5,
          "num_children": 0,
          "author": 180188,
          "replies": []
        }
      ]
    },
    {
      "id": "ipnexxu",
      "text": "Can't vote for her but,  GO STACEY!!!!",
      "timestamp": "2022-09-23 22:29:35",
      "score": 2,
      "num_children": 0,
      "author": 219630,
      "replies": []
    },
    {
      "id": "ipnsklm",
      "text": "Vote and get friends to register",
      "timestamp": "2022-09-24 00:21:41",
      "score": 2,
      "num_children": 0,
      "author": 111281,
      "replies": []
    },
    {
      "id": "ipp0kpc",
      "text": "Well it took some time but the \"both sides\" \"don't vote to stick it to the man\" clowns are finally out in force to do the Republican's work for them. I suppose the election denialists won't be far behind.",
      "timestamp": "2022-09-24 08:04:30",
      "score": 2,
      "num_children": 0,
      "author": 230389,
      "replies": []
    },
    {
      "id": "ipmk58h",
      "text": "I agree with overall sentiment but this story has been misrepresented.\n\nFor the record, Kemp’s official response is that he has “never opposed access to contraceptives.” People assumed he was supportive of banning them because a UGA student grilled him at a football tailgate about whether the power to impose additional abortion restrictions, such as contraception, would now be up to state legislatures in the wake of the Dobbs decision. Kemp said he believed those decisions were indeed now up to the states but never said he’d personally support a ban. So, there’s a bit of exaggeration and hysteria on that narrow point.\n\nThat said, he signed and proudly defends the fetal heartbeat law which, even with a strong GOP majority,  passed by only 1 vote. So, a change in Governors and a slight change in the state legislature might lead to a repeal.",
      "timestamp": "2022-09-23 18:39:41",
      "score": -3,
      "num_children": 3,
      "author": 352554,
      "replies": [
        {
          "id": "ipmpmu6",
          "text": "I can unfortunately imagine a world where Abortion legal or not legal is flip-flopped depending on which party holds power in that state.",
          "timestamp": "2022-09-23 19:20:27",
          "score": 3,
          "num_children": 1,
          "author": 390774,
          "replies": [
            {
              "id": "ippus49",
              "text": "Yeah, that’s a real possibility, unless of course the Dems gain enough seats in the US Senate to create a filibuster “carveout” so they can pass federal legislation to protect abortion and voting rights nationally via simple majority. \n\nI’d argue they need to make that a bigger part of the midterm messaging - basically say “we’ll fix it” rather than just fostering resentment over Roe being overturned.",
              "timestamp": "2022-09-24 14:03:31",
              "score": 1,
              "num_children": 0,
              "author": 352554,
              "replies": []
            }
          ]
        },
        {
          "id": "ipmso80",
          "text": "so he used a dog-whistle instead of a bullhorn?  big deal.  \"if this bill was on my desk i'd sign it\" is what his comments amount to.  \n\nyour last paragraph is accurate.",
          "timestamp": "2022-09-23 19:43:03",
          "score": 13,
          "num_children": 1,
          "author": 69293,
          "replies": [
            {
              "id": "ippx1gq",
              "text": "To be clear, I’m pro choice and do not support the fetal heartbeat bill (I live in GA by the way). But Kemp has specifically said he has “Never opposed access to contraception” and offered that response immediately after this controversy. Plus, he has not proposed a contraception ban or said he would sign one. \n\nSo, although I think his stance on abortion sucks and I absolutely want the law he signed to either be repealed at the state level or invalidated by federal legislation, I’m just noting that the claim that Kemp wants to ban contraception is actually not supported by his statements or actions so far. \n\nFinally, I’m pointing out how close we actually are (1 vote at the state level or 2 votes in the US senate) to getting this changed either via a state-level repeal or federal legislation codifying Roe.\n\nBasically, we can win this battle without being dishonest.",
              "timestamp": "2022-09-24 14:21:45",
              "score": 1,
              "num_children": 0,
              "author": 352554,
              "replies": []
            }
          ]
        },
        {
          "id": "ippv08z",
          "text": "Clarification for the downvoters…\n\nI’m pro-choice and do NOT support the fetal heartbeat law. Just offering some context for what Kemp actually said and what can be done about it.",
          "timestamp": "2022-09-24 14:05:22",
          "score": 2,
          "num_children": 0,
          "author": 352554,
          "replies": []
        }
      ]
    },
    {
      "id": "ipncwa2",
      "text": "Georgian here.  I dispise Kemp, his inaction during covid cost us thousands of lives, but read the article.  \n\nThe dude was asked if he'd ban plan b and he basically said 'that's up to the legislators'.  He's right.  Literally any govenor asked about a potentially controversial piece of legislation that could theoretically be supported by their own party would say the same thing.  He's simply saying he wouldn't veto it.\n\nThis man has enough blood on his hands to be voted out of office.  I sincerely hope Stacy Abrams wins, but this sort of hyperbole does nothing but give conservatives ammunition to sit back and say 'see!  dems are unhinged!' and independents nod along.",
      "timestamp": "2022-09-23 22:13:31",
      "score": -1,
      "num_children": 2,
      "author": 317223,
      "replies": [
        {
          "id": "ipp8f55",
          "text": "> He's simply saying he wouldn't veto it.\n\nIsn't that bad enough? Isn't the right response, \"of course I would veto a contraception ban!\"",
          "timestamp": "2022-09-24 09:59:59",
          "score": 3,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "ipptzop",
              "text": "As a human? Absolutely. As a ~~reptile~~ republican? It's his way of passing the buck",
              "timestamp": "2022-09-24 13:56:55",
              "score": 2,
              "num_children": 0,
              "author": 317223,
              "replies": []
            }
          ]
        },
        {
          "id": "ipp00a8",
          "text": "Which part is hyperbolic - apart from maybe the hashtag?",
          "timestamp": "2022-09-24 07:56:31",
          "score": 2,
          "num_children": 0,
          "author": 230389,
          "replies": []
        }
      ]
    },
    {
      "id": "ipmxwwm",
      "text": "No, it's not the **only** way.  That's what your masters of the status quo want you to believe, because the actual *other* means are rather unpalatable for them.  \n\nHere's the reality of the past 50 years: The state of affairs in this country is shitty, and you're told in every election cycle that your choices are between:  \n* An asshole from Capitalist Faction \"A\" who wants to make things worse (for you), or  \n* An asshole from Capitalist Faction \"B\" who says he'll stop Faction \"A\" from making things worse (*i.e.*, things stay shitty)  \n\nInsert histrionic screaming from idiots who actually believe one of these two factions represents their interests, repeat every 2 years.  \n\n*bUt tHiS iSsUe iS s0 iMp0rTanT, y0u jUsT hAvE t0 v0tE f0R fAcTi0n B!*  \n\nYeah, this is the same back-against-the-wall ultimatum repeated every cycle since at least the 1960 election.  It's not incidental, it's by design.  Keep the voters constantly thinking in crisis mode, disregarding long-term consideration.  \n\nTime to burn it all down.",
      "timestamp": "2022-09-23 20:22:18",
      "score": -6,
      "num_children": 1,
      "author": 357430,
      "replies": [
        {
          "id": "ipmz7fa",
          "text": "Interesting. Tell me is it democrats in majority blue states working to get rid of abortion or is it the republicans in red states doing so. Like it’s weird how republicans do something bad and some of y’all’s first instincts is “how do we blame the democrats for this.”",
          "timestamp": "2022-09-23 20:31:52",
          "score": 8,
          "num_children": 2,
          "author": 236559,
          "replies": [
            {
              "id": "ipn33hy",
              "text": "They blamed capitalism.",
              "timestamp": "2022-09-23 21:00:04",
              "score": -5,
              "num_children": 1,
              "author": 211544,
              "replies": [
                {
                  "id": "ipn38c7",
                  "text": "They falsely equivocated both parties.",
                  "timestamp": "2022-09-23 21:01:02",
                  "score": 6,
                  "num_children": 2,
                  "author": 236559,
                  "replies": [
                    {
                      "id": "ipnnup6",
                      "text": "> equivocated\n\n*You keep using that word.  I do not think it means what you think it means.*",
                      "timestamp": "2022-09-23 23:41:39",
                      "score": 1,
                      "num_children": 1,
                      "author": 357430,
                      "replies": [
                        {
                          "id": "ipno3rb",
                          "text": "“False equivalence is an informal fallacy in which an equivalence is drawn between two subjects based on flawed or false reasoning. “",
                          "timestamp": "2022-09-23 23:43:45",
                          "score": 1,
                          "num_children": 1,
                          "author": 236559,
                          "replies": [
                            {
                              "id": "ipnpl61",
                              "text": "You didn't say *equivalence*, you said *equivocated.*  \n\nJust one indication that you're uneducated but attempting to project erudition.",
                              "timestamp": "2022-09-23 23:56:28",
                              "score": 1,
                              "num_children": 1,
                              "author": 357430,
                              "replies": [
                                {
                                  "id": "ipnpqna",
                                  "text": "Oh ad hominem attacks, how nice. Definitely the marker of a truly educated person.",
                                  "timestamp": "2022-09-23 23:57:48",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 236559,
                                  "replies": [
                                    {
                                      "id": "ipnq488",
                                      "text": "> ad hominem\n\nYou really should stop using terminology that you don't understand.  At this point, I'm actually feeling embarrassed for you.",
                                      "timestamp": "2022-09-24 00:01:01",
                                      "score": 2,
                                      "num_children": 1,
                                      "author": 357430,
                                      "replies": [
                                        {
                                          "id": "ipnq9n9",
                                          "text": "You attacked me by calling me an uneducated person which is a direct attack against me and not my argument. At this rate what you are is a troll. Go fuck yourself.",
                                          "timestamp": "2022-09-24 00:02:18",
                                          "score": 0,
                                          "num_children": 1,
                                          "author": 236559,
                                          "replies": [
                                            {
                                              "id": "ipnqueo",
                                              "text": "That's not *ad hominem.*  \n\nHere's a freebie to save yourself some humiliation in the future: *ad hominem* is when someone rebuts **your argument** by impugning your person in some way.  \n\nMy pointing out that you're uneducated wasn't a rebuttal of any argument you'd attempted to make, it was an observation based on your demonstrated lack of education.",
                                              "timestamp": "2022-09-24 00:07:09",
                                              "score": 1,
                                              "num_children": 1,
                                              "author": 357430,
                                              "replies": [
                                                {
                                                  "id": "ipnqzv0",
                                                  "text": "“marked by or being an attack on an opponent's character rather than by an answer to the contentions made” straight from merriam Webster. Argue with the wall.",
                                                  "timestamp": "2022-09-24 00:08:26",
                                                  "score": 1,
                                                  "num_children": 1,
                                                  "author": 236559,
                                                  "replies": [
                                                    {
                                                      "id": "ipnrgxt",
                                                      "text": "Had that been my first or only response, you might have a leg to stand on.  It wasn't.  \n\nThe fact that you've hung your entire interaction on this diversion is evidence enough that you had nothing of substance in the first place...just like the Democrats for whom you're on here lapdogging like an absolute clown.",
                                                      "timestamp": "2022-09-24 00:12:28",
                                                      "score": 0,
                                                      "num_children": 1,
                                                      "author": 357430,
                                                      "replies": [
                                                        {
                                                          "id": "ipnrohv",
                                                          "text": "Don’t you have a revolution to throw? Like I asked you before since you know so much, what is stopping you? It’s easy to come on the internet and point fingers. You know what? Be the change you want to see. Overthrow the government, overthrow capitalism. I believe in you :)",
                                                          "timestamp": "2022-09-24 00:14:16",
                                                          "score": 1,
                                                          "num_children": 1,
                                                          "author": 236559,
                                                          "replies": [
                                                            {
                                                              "id": "ipnshf0",
                                                              "text": "Weren't you \"done going back and forth\" with me?  \n\nHaven't you figured out yet that I'm using the same innate gullibility that your political heroes do?  Just yanking your incredibly simple chain and watching you hop exactly as I want.",
                                                              "timestamp": "2022-09-24 00:20:56",
                                                              "score": 1,
                                                              "num_children": 1,
                                                              "author": 357430,
                                                              "replies": [
                                                                {
                                                                  "id": "ipnsqv3",
                                                                  "text": "Don't you have a revolution to throw? Like I\nasked you before since you know so much,\nwhat is stopping you? It's easy to come on the\ninternet and point fingers. You know what? Be\nthe change you want to see. Overthrow the\ngovernment, overthrow capitalism. I believe in\nyou :)",
                                                                  "timestamp": "2022-09-24 00:23:10",
                                                                  "score": 1,
                                                                  "num_children": 0,
                                                                  "author": 236559,
                                                                  "replies": []
                                                                }
                                                              ]
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "id": "ipn46r9",
                      "text": "No they didn't. They said one is doing a shitty thing, and the other is trying to stop the shitty thing, and that this is the pattern that has existed for decades.\n\nThat's as far as you can reasonably reduce the comparison.\n\nTheir point wasn't \"dems are bad too\" their point was the actual solution to capitalism isn't voting, it's something you can't talk about on most public platforms.\n\nWhether or not you agree with that is another matter entirely.",
                      "timestamp": "2022-09-23 21:08:06",
                      "score": -4,
                      "num_children": 2,
                      "author": 211544,
                      "replies": [
                        {
                          "id": "ipn4pot",
                          "text": "“bUt tHiS iSsUe iS sO iMpOrTanT, yOu jUsT hAvE to\nvOtE fOR fAcTiOn B!” \n\nFalsely equivocating both parties here. By acting as if those who encourage voters to vote for democrats are being played or whatever because both parties are the same. Nonetheless they are wrong. Abortion is not being denied because of capitalism. It’s literally misogyny so I’m not even sure why capitalism was being mentioned in the first place.",
                          "timestamp": "2022-09-23 21:12:03",
                          "score": 2,
                          "num_children": 1,
                          "author": 236559,
                          "replies": [
                            {
                              "id": "ipn5mwz",
                              "text": "Can you tell me with a straight face that the majority leadership of both parties aren't in fact firmly capitalist in their ideology?\n\nThis is the criticism being levied. That the problem isn't whatever the current crisis is. That the problem is capitalism, which *is* a core ideology shared by both parties.\n\nThe message here is that, while you can (and in my opinion should) still vote for the option that isn't actively a threat to democracy and human rights, it won't change the conditions that led us here in the first place.",
                              "timestamp": "2022-09-23 21:19:00",
                              "score": -2,
                              "num_children": 1,
                              "author": 211544,
                              "replies": [
                                {
                                  "id": "ipn62bb",
                                  "text": "I am telling you op was entirely off topic and actively derailing with statements such as “time to burn it all down.” What does that even mean. Yes capitalism sucks. Now what? What does that have to do with the discussion on abortion that this post is about. What is the purpose of bringing it up other than to discourage others from doing something about the issue that was being discussed.",
                                  "timestamp": "2022-09-23 21:22:07",
                                  "score": 6,
                                  "num_children": 2,
                                  "author": 236559,
                                  "replies": [
                                    {
                                      "id": "ipnbukx",
                                      "text": "Then say that instead.\n\nIt's a better argument.",
                                      "timestamp": "2022-09-23 22:05:26",
                                      "score": 1,
                                      "num_children": 0,
                                      "author": 211544,
                                      "replies": []
                                    },
                                    {
                                      "id": "ipno1gl",
                                      "text": "> What does that even mean.\n\n*whistles \"Le Marseillaise\"*",
                                      "timestamp": "2022-09-23 23:43:13",
                                      "score": 0,
                                      "num_children": 1,
                                      "author": 357430,
                                      "replies": [
                                        {
                                          "id": "ipno8c3",
                                          "text": "Oh please. If you lot were going to be throwing any revolutions you would have done so by now. Crying revolution left and right and yet what are you doing to actually make that a reality?",
                                          "timestamp": "2022-09-23 23:44:50",
                                          "score": 2,
                                          "num_children": 1,
                                          "author": 236559,
                                          "replies": [
                                            {
                                              "id": "ipnpymb",
                                              "text": "*\"It always seems impossible, until it's done.\"*",
                                              "timestamp": "2022-09-23 23:59:42",
                                              "score": 0,
                                              "num_children": 1,
                                              "author": 357430,
                                              "replies": [
                                                {
                                                  "id": "ipnq0us",
                                                  "text": "LMFAO THEN DO IT. What is stopping you? Go for it.",
                                                  "timestamp": "2022-09-24 00:00:13",
                                                  "score": 3,
                                                  "num_children": 0,
                                                  "author": 236559,
                                                  "replies": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "id": "ipp8m72",
                          "text": "> it's something you can't talk about on most public platforms.\n\nBy which you mean violent revolution. When are one of you revolutionaries going to start this glorious revolution to end capitalism?",
                          "timestamp": "2022-09-24 10:02:48",
                          "score": -1,
                          "num_children": 1,
                          "author": 286151,
                          "replies": [
                            {
                              "id": "ipr3dst",
                              "text": "Who said I was a revolutionary? I'm not. Clarifying or agreeing with a part of someone's position is not the same as agreeing with them wholesale.\n\nI think we can get there gradually by organizing and empowering labor, investing in education and critical thinking, and making room for nuance in political discourse.\n\nWe are making some slow progress with the first, but the latter two are rapidly backsliding (which sadly is evidenced, in part, by reactions within this comment thread).",
                              "timestamp": "2022-09-24 19:27:46",
                              "score": 1,
                              "num_children": 0,
                              "author": 211544,
                              "replies": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "id": "ipnnpm8",
              "text": "It's Democrats in every state who campaigned for decades on promises to protect abortion by codifying Roe into law, then completely abandoned those promises once the elections were over.  \n\nThey were never serious about actually protecting rights.  It's always been just lip service to whip votes.  \n\nEven now, their attempts to salvage this fiasco are half-assed.",
              "timestamp": "2022-09-23 23:40:28",
              "score": -5,
              "num_children": 2,
              "author": 357430,
              "replies": [
                {
                  "id": "ipnnyu5",
                  "text": "That’s bull by the simple fact blue states protect abortion rights. That tells you states where democrats are elected, they did in fact protect the rights of women to make decisions about their own bodies.",
                  "timestamp": "2022-09-23 23:42:37",
                  "score": 7,
                  "num_children": 1,
                  "author": 236559,
                  "replies": [
                    {
                      "id": "ipnpdep",
                      "text": "Why keep carrying water for these ghouls who couldn't give less of a care about you?  \n\nJust in your lifetime, the record is replete with examples of Democrats being utterly useless backstabbers of the people.",
                      "timestamp": "2022-09-23 23:54:36",
                      "score": -6,
                      "num_children": 1,
                      "author": 357430,
                      "replies": [
                        {
                          "id": "ipnpoxi",
                          "text": "We’re talking about abortion. And like I said, it’s not some lucky accident or coincidence that democrat states have better laws guaranteeing a woman’s right to choose. It’s republicans who put conservatives on the Supreme Court to get rid of abortion. I live in a red state. My life would become instantly better if I moved to a blue state because then if I were to get pregnant I would have access to an abortion. I appreciate the dems in my state who are doing what they can to fight against republicans. Why are you so eager to pretend like both parties are the same? That only helps republicans.",
                          "timestamp": "2022-09-23 23:57:24",
                          "score": 8,
                          "num_children": 1,
                          "author": 236559,
                          "replies": [
                            {
                              "id": "ipnqau3",
                              "text": "> It’s republicans who put conservatives on the Supreme Court\n\nAnd how did that happen, hmmm?",
                              "timestamp": "2022-09-24 00:02:34",
                              "score": 1,
                              "num_children": 2,
                              "author": 357430,
                              "replies": [
                                {
                                  "id": "ipp8pj8",
                                  "text": "Trump lost the popular vote but was put into office by an archaic system in our Constitution and there was nothing those who opposed him could do about that.\n\nThat's how it happened.\n\nHow do you think it happened?",
                                  "timestamp": "2022-09-24 10:04:08",
                                  "score": 2,
                                  "num_children": 1,
                                  "author": 286151,
                                  "replies": [
                                    {
                                      "id": "ippxos6",
                                      "text": "An archaic system that's been in place our entire lives, which professional political strategists have known about and planned around?  What a piss-poor lame excuse.  \n\nIt happened because the Democrats handed their party's nomination to literally the only candidate who could've lost to that clown, and they chose to do so for the purpose of continuing the status quo.  So, yeah...capitalism.",
                                      "timestamp": "2022-09-24 14:26:51",
                                      "score": 1,
                                      "num_children": 1,
                                      "author": 357430,
                                      "replies": [
                                        {
                                          "id": "ipr2v2p",
                                          "text": "The candidate who won the popular vote by millions?",
                                          "timestamp": "2022-09-24 19:23:58",
                                          "score": 1,
                                          "num_children": 1,
                                          "author": 286151,
                                          "replies": [
                                            {
                                              "id": "ipwq5hk",
                                              "text": "Lot of unnecessary verbiage to say \"the one who lost.\"",
                                              "timestamp": "2022-09-26 00:05:29",
                                              "score": 1,
                                              "num_children": 0,
                                              "author": 357430,
                                              "replies": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "id": "ipnqgpv",
                                  "text": "I’m done going back and forth with you.",
                                  "timestamp": "2022-09-24 00:03:57",
                                  "score": 1,
                                  "num_children": 1,
                                  "author": 236559,
                                  "replies": [
                                    {
                                      "id": "ipnqwye",
                                      "text": "Sure, guy.  Prove me wrong.",
                                      "timestamp": "2022-09-24 00:07:45",
                                      "score": 0,
                                      "num_children": 0,
                                      "author": 357430,
                                      "replies": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "id": "ipqhx8h",
                  "text": "Any codification of Roe would have been overturned with a Republican legislature and president.",
                  "timestamp": "2022-09-24 16:55:59",
                  "score": 0,
                  "num_children": 1,
                  "author": 81881,
                  "replies": [
                    {
                      "id": "ipwpzi9",
                      "text": "Maybe.  But codify the protection and make them UNdo it!  Don't concede without trying.  \n\nBut that's the feckless Democrats' MO.",
                      "timestamp": "2022-09-26 00:04:09",
                      "score": 1,
                      "num_children": 0,
                      "author": 357430,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ipn86m7",
      "text": "Anarchy ftw",
      "timestamp": "2022-09-23 21:38:03",
      "score": 1,
      "num_children": 0,
      "author": 319256,
      "replies": []
    },
    {
      "id": "ipncch4",
      "text": "Yallqaeda is the best thing I've ever heard.",
      "timestamp": "2022-09-23 22:09:14",
      "score": 1,
      "num_children": 0,
      "author": 45161,
      "replies": []
    },
    {
      "id": "ipo3xij",
      "text": "Omg!  Republicans really do want to take a woman's rights away from them the moment a man pulls out of her!!",
      "timestamp": "2022-09-24 01:58:28",
      "score": 1,
      "num_children": 0,
      "author": 411137,
      "replies": []
    },
    {
      "id": "ippbn0v",
      "text": "[removed]",
      "timestamp": "2022-09-24 10:45:33",
      "score": 0,
      "num_children": 1,
      "replies": [
        {
          "id": "ippfv7o",
          "text": "[removed]",
          "timestamp": "2022-09-24 11:38:25",
          "score": 1,
          "num_children": 0,
          "replies": []
        }
      ]
    },
    {
      "id": "ipmjsg2",
      "text": "Jesus fucking CHRIST! You guys don't have to always bring up Islam to call out and disavow Christian nationalists/fascism. They are NOT the Christian Taliban. The Taliban is the Taliban. These Christian losers are simply THE SAME puritanical and tyrannical Christian fundamentalists and authoritarians that they have always been!!! They're bad, not because they resemble the Taliban, but because they are forcing their bullshit religion on us all and using violent, deadly means of doing so. This is also why the Taliban is bad. These Christian tyrants are not using the Quran or Hadith like the Taliban to justify their religious violence, they are using the Bible. \n\nPlease stop this shit. You're making it seem like Christianity would be a beacon of peace if only \"they didnt act like those damn muslims.\"",
      "timestamp": "2022-09-23 18:37:00",
      "score": -10,
      "num_children": 3,
      "author": 28722,
      "replies": [
        {
          "id": "ipmshww",
          "text": "i call 'em Nationalist Christians.  Nat-Cs, for short.",
          "timestamp": "2022-09-23 19:41:44",
          "score": 9,
          "num_children": 1,
          "author": 69293,
          "replies": [
            {
              "id": "ipmujx2",
              "text": ">i call 'em Nationalist Christians. Nat-Cs\n\nHaha I'm totally stealing this!",
              "timestamp": "2022-09-23 19:57:09",
              "score": 2,
              "num_children": 1,
              "author": 28722,
              "replies": [
                {
                  "id": "ipn07el",
                  "text": "Its been a fairly popular lingo for like a year now",
                  "timestamp": "2022-09-23 20:39:08",
                  "score": 2,
                  "num_children": 1,
                  "author": 180188,
                  "replies": [
                    {
                      "id": "ipn2g5b",
                      "text": "It's a word that's a lot more accurate to Christian nationalist politics than whatever this psychologically-compulsive need is for Americans to invoke Islamic terrorist tropes in order to categorize Christian tyranny as evil.",
                      "timestamp": "2022-09-23 20:55:17",
                      "score": 2,
                      "num_children": 0,
                      "author": 28722,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ipoxaeg",
          "text": "Using taliban gets the message across since saying “fundamentalists” neither rolls off the tongue well nor has the same urgency it should have.",
          "timestamp": "2022-09-24 07:18:25",
          "score": 3,
          "num_children": 1,
          "author": 133896,
          "replies": [
            {
              "id": "iprid7p",
              "text": ">Using taliban gets the message across since saying “fundamentalists” neither rolls off the tongue well nor has the same urgency it should have.\n\nCorrect. That is the problematic part. Americans feel no sense of urgency about the term \"Christian fundamentalists\" because they are **not** taught to actively hate christian fundamentalism, like they are taught to hate the Taliban and Islamic fundamentalism. Why is that? Especially if both groups espouse the same regressive beliefs?  \n\nIt's for the same reason that white mass shooters are **not** labeled as thugs, but black gang members are, or even why white crime is not seen as dangerous as black crime. It's for the same reasons that athiests/satanists/pagans are seen as inherently immoral, while Christians/nonPagan-theists are automatically seen as inherently good and virtuous by sole virtue of believing in a popular god(s).  \n\nWhen we use certain \"identities\" and \"communities\" to represent the ***standard*** for a particular type of evil, this causes us to subconsciously associate all members of those particular identities/communities with that particular evil, AND it causes us to ignore and downplay other types of evil that represent immediate threats to us, but because these other types of evil don't share the same identity/community with the aforementioned \"standard evil group,\" they get away with their violent bullshit and we treat them as less of a threat, until oneday they suddenly become an uncontrollable problem that we are now forced to recognize as an immediate danger to our lives. \n\nThis leaves us trying to figure out how these monsters snuck up on us like this? They snuck up on us because our attention was firmly on the identities/communities that represent our standards of evil, thereby allowing the [non-standard] evil that lives right next to us to rise up and take over our country without us being aware. I call this the \"trojan horse of biased propaganda.\"  \n\nAsk yourself this. How is it that Americans have spent so much intellectual, economic, political, and legal resources trying to stop Islamic fundamentalism for 20 years, but instead ended up with a growing Christian theocratic/fascist America? Were Americans fighting religious fundamentalism in general for the past 20 years, or just **Islamic** fundamentalism? And if the latter, then why just the latter? And more importantly, did us focusing primarily on Islamic fundamentalism cause us to ignore the signs of a rising Christian nationalist movement in America? \n\nMy point is that, by using specific communities to represent a particular standard of evil, it allows other malevolent groups to swoop in while our collective attention is diverted elsewhere, to establish power for their own brand of evil. To avoid this, we can simply refuse to use specific identities/communities as representatives for a particular standard of evil, and instead focus exclusively on *demonizing* the \"evil\" itself, which allows us to equally recognize and stamp it out regardless of the identities/communities engaging in it. \n\nTo achieve this in the context of religious tyranny, we cannot only label religious fundamentalism as bad or dangerous when we can associate it with Islamic fundamentalism (which represents our BIASED standard for fundamentalist evil),  but instead we should label ALL forms of religious fundamentalism as inherently bad and dangerous regardless of whether or not it mimics the Taliban or Iran. \n\nThe decades long assumption that American Christian fundamentalism was not as bad as those \"Islamic extremists\" is exactly why christian nationalists were able to grow their power base under the radar with neither public awareness nor serious political resistance.",
              "timestamp": "2022-09-24 21:17:48",
              "score": 2,
              "num_children": 1,
              "author": 28722,
              "replies": [
                {
                  "id": "ips10pv",
                  "text": "I appreciate the effort but that’s obscenely long. Ironically a bit like with using taliban instead of fundamentalists, you gotta go shorter if you want to hold peoples attention. Upvote for effort tho.",
                  "timestamp": "2022-09-24 23:43:14",
                  "score": 2,
                  "num_children": 1,
                  "author": 133896,
                  "replies": [
                    {
                      "id": "ipsb34p",
                      "text": "Read it later, if you have time. I think it offers insight into why Christian nationalism arose in America during the exact moments when we were focusing on Islamic tyranny. Thanks for responding!",
                      "timestamp": "2022-09-25 01:06:32",
                      "score": 2,
                      "num_children": 0,
                      "author": 28722,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ipmqa76",
          "text": "I call them Branch Trumpidians. To my mind, it more accurately identifies them as the whackadoodle cult they are.",
          "timestamp": "2022-09-23 19:25:13",
          "score": 9,
          "num_children": 1,
          "author": 173270,
          "replies": [
            {
              "id": "ipmu8as",
              "text": "That would at least be more accurate lol! But honestly, these people haven't changed. They're still the same Christian assholes who would burn witches, religiously enslave women, murder scientists for being \"blasphemers,\" forcibly convert us all, kill the gays, and use the bible to justify slavery, if they could legally get away with it all! They've literally been following the same script for thousands of years.\n\nYeah, they have a lot in common with the Taliban, but they have been oppressing people throughout the world longer than the Taliban has even existed, and thus deserve their own fucking category of \"evil.\" I do not understand why Western atheists don't see how problematic it is that they must always dress up Christian fascism in \"Islamic face\" just to showcase how evil Christian fundies are???",
              "timestamp": "2022-09-23 19:54:41",
              "score": 1,
              "num_children": 1,
              "author": 28722,
              "replies": [
                {
                  "id": "ipo639y",
                  "text": "Couldn't agree more. This is what Christianity has always been. They've just stopped pretending that they care what Jesus would do.",
                  "timestamp": "2022-09-24 02:17:28",
                  "score": 2,
                  "num_children": 0,
                  "author": 173270,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ipo8nfb",
      "text": "While I support this message, when was the exact moment the sub lost the ability to write a short title? If brevity is the soul of wit then this is the dumbest subreddit on the planet right now.",
      "timestamp": "2022-09-24 02:40:08",
      "score": -5,
      "num_children": 0,
      "author": 225213,
      "replies": []
    },
    {
      "id": "ipno77d",
      "text": "A simple google search shows this is NOT what he said, but has been misconstrued to make him look bad.",
      "timestamp": "2022-09-23 23:44:34",
      "score": -8,
      "num_children": 1,
      "author": 357483,
      "replies": [
        {
          "id": "ipnrzad",
          "text": "I'm pretty sure any variation on this theme would also be bad.",
          "timestamp": "2022-09-24 00:16:44",
          "score": 7,
          "num_children": 0,
          "author": 245331,
          "replies": []
        }
      ]
    },
    {
      "id": "ipomvrd",
      "text": "abrams is pretty shitty also.  It's almost like picking from two sides of the same coin over and over again doesn't do anything good. but hey let's get the other side of the coin this time.",
      "timestamp": "2022-09-24 05:05:25",
      "score": -9,
      "num_children": 2,
      "author": 52315,
      "replies": [
        {
          "id": "ipp8cqc",
          "text": "\"Ban contraception\" pretty shitty? Because otherwise I'm thinking she's the one to vote for.",
          "timestamp": "2022-09-24 09:59:02",
          "score": 2,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "ipp9o40",
              "text": "Also there is a more detailed response already. she really isn't any better.",
              "timestamp": "2022-09-24 10:18:07",
              "score": 1,
              "num_children": 1,
              "author": 52315,
              "replies": [
                {
                  "id": "ipr35xx",
                  "text": "I'd say not wanting people to only have sex for procreative purposes makes her better.",
                  "timestamp": "2022-09-24 19:26:09",
                  "score": 1,
                  "num_children": 0,
                  "author": 286151,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ipotnn8",
          "text": "your opinion is irrelevant, you need to provide an argument supporting your position.",
          "timestamp": "2022-09-24 06:29:52",
          "score": 2,
          "num_children": 0,
          "author": 308732,
          "replies": []
        }
      ]
    },
    {
      "id": "ipn2yqj",
      "text": "Lol, hard pass.",
      "timestamp": "2022-09-23 20:59:05",
      "score": -10,
      "num_children": 1,
      "author": 260670,
      "replies": [
        {
          "id": "ipp8ih2",
          "text": "Because you want women to be baby factories?",
          "timestamp": "2022-09-24 10:01:19",
          "score": 3,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "ipztuos",
              "text": "I want women to do whatever they want to do under the law(law sucks, many places I would like to see \"under the law\" expanded but w/e.\" Stacy Abrams has failed before, she will again(probably). No love for Brian Kemp, but you gotta be able to do better than Stacy Abrams...",
              "timestamp": "2022-09-26 17:24:15",
              "score": 1,
              "num_children": 0,
              "author": 260670,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ipmrlas",
      "text": "Come on, Georgia! \n\nYou can do it! Slough off the chains of this Conservative oppression against ~~women~~ us all.",
      "timestamp": "2022-09-23 19:34:56",
      "score": 1,
      "num_children": 0,
      "author": 72619,
      "replies": []
    },
    {
      "id": "ipno443",
      "text": "*Nolite te bastardes carborundorum*",
      "timestamp": "2022-09-23 23:43:50",
      "score": 1,
      "num_children": 0,
      "author": 72828,
      "replies": []
    },
    {
      "id": "ipnrg1w",
      "text": "Anybody know why Abrams is polling worse than last cycle? I thought she’d be likely to win from the momentum in 2018 and helping secure those senate seats in 2020.",
      "timestamp": "2022-09-24 00:12:15",
      "score": 1,
      "num_children": 0,
      "author": 87416,
      "replies": []
    },
    {
      "id": "ipnur3w",
      "text": "If You guys can't vote for your rights what hope do you have",
      "timestamp": "2022-09-24 00:40:16",
      "score": 1,
      "num_children": 0,
      "author": 347682,
      "replies": []
    },
    {
      "id": "ipo091c",
      "text": "So question, what's stopping a large company like the one that's behind plan B from suing the state over something like this?",
      "timestamp": "2022-09-24 01:26:37",
      "score": 1,
      "num_children": 0,
      "author": 336461,
      "replies": []
    },
    {
      "id": "ipofqff",
      "text": "Or just leave America for somewhere civilized.",
      "timestamp": "2022-09-24 03:47:31",
      "score": 1,
      "num_children": 0,
      "author": 132127,
      "replies": []
    },
    {
      "id": "ipokd6y",
      "text": "Unfortunately, all churches are intoxicated with power!!!!  If we allow them a foot hold we will regret it for many years!!!👊🏾",
      "timestamp": "2022-09-24 04:36:37",
      "score": 1,
      "num_children": 0,
      "author": 108579,
      "replies": []
    },
    {
      "id": "ipot0gr",
      "text": "[removed]",
      "timestamp": "2022-09-24 06:21:29",
      "score": 1,
      "num_children": 0,
      "replies": []
    },
    {
      "id": "ippd2b7",
      "text": "When SCOTUS rules on Moore v Harper in a few months, conservatives will have a permanent win condition in the U.S. The midterms really will be our last democratic election. This is not hyperbole. \n\nWhether you plan to fight, flee or submit, the time to prepare for permanent conservative rule is now.",
      "timestamp": "2022-09-24 11:04:24",
      "score": 1,
      "num_children": 0,
      "author": 60505,
      "replies": []
    },
    {
      "id": "ipphui9",
      "text": "Oh fuck this!",
      "timestamp": "2022-09-24 12:00:55",
      "score": 1,
      "num_children": 0,
      "author": 407228,
      "replies": []
    },
    {
      "id": "ippi1qw",
      "text": "You are fighting a terrorist group with voting?\n\nDon't make me laugh.\n\nWhat will it take for you guys to finally see that sometimes violence is the only answer?",
      "timestamp": "2022-09-24 12:03:09",
      "score": 1,
      "num_children": 1,
      "author": 265068,
      "replies": [
        {
          "id": "ippifc1",
          "text": "So when are you going to start being violent?",
          "timestamp": "2022-09-24 12:07:15",
          "score": 1,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "ippiq1i",
              "text": "You know the answer to that.\nWhen you guys stop spouting this pacifist bullshit.\n\nI'm sure as hell not going charging anywhere alone.",
              "timestamp": "2022-09-24 12:10:32",
              "score": 1,
              "num_children": 1,
              "author": 265068,
              "replies": [
                {
                  "id": "ippiupx",
                  "text": "No I do not know the answer to that. Do not make such presumptions. Please answer my question.",
                  "timestamp": "2022-09-24 12:11:56",
                  "score": 1,
                  "num_children": 1,
                  "author": 286151,
                  "replies": [
                    {
                      "id": "ipt0g7x",
                      "text": "I did",
                      "timestamp": "2022-09-25 05:07:01",
                      "score": 1,
                      "num_children": 1,
                      "author": 265068,
                      "replies": [
                        {
                          "id": "iptf8sp",
                          "text": "Your answer is you won't do it alone? Well why aren't you raising an army? It's very easy to call for revolution on Reddit. You don't seem to be interested in doing anything about it.",
                          "timestamp": "2022-09-25 08:19:42",
                          "score": 1,
                          "num_children": 0,
                          "author": 286151,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ippkabg",
      "text": "What an idiot",
      "timestamp": "2022-09-24 12:27:12",
      "score": 1,
      "num_children": 0,
      "author": 173556,
      "replies": []
    },
    {
      "id": "ippqaxm",
      "text": "Can we fly in some Iranian protestors?  We need help.",
      "timestamp": "2022-09-24 13:24:55",
      "score": 1,
      "num_children": 0,
      "author": 30161,
      "replies": []
    },
    {
      "id": "ipprkxc",
      "text": "If you really want Stacy Abrams to win, the better move is to push her to drop her anti-gun policy proposals. GA is very pro-2A and her being an anti-gun politician hurts her chances.",
      "timestamp": "2022-09-24 13:36:20",
      "score": 1,
      "num_children": 0,
      "author": 126838,
      "replies": []
    },
    {
      "id": "ippsn9d",
      "text": "Cripes, I'm glad I moved. Good luck and have fun, Georgians!",
      "timestamp": "2022-09-24 13:45:30",
      "score": 1,
      "num_children": 0,
      "author": 210831,
      "replies": []
    },
    {
      "id": "ippuwoy",
      "text": "\"We told you\"\n\nYeah you did, but also so did the republicans doing this. \nThis is what they want. They haven't been shy about it. The people that vote for them want it too. \nIt's not as simple as \"just vote\" when the other side is actively stopping people from voting and enacting laws to overturn elections with no evidence.",
      "timestamp": "2022-09-24 14:04:33",
      "score": 1,
      "num_children": 0,
      "author": 95242,
      "replies": []
    },
    {
      "id": "ipn667f",
      "text": "I didn't realize this was a politics subreddit.",
      "timestamp": "2022-09-23 21:22:55",
      "score": -16,
      "num_children": 3,
      "author": 259457,
      "replies": [
        {
          "id": "ipn9rqa",
          "text": "It’s not, but the Christian terrorists are trying to shove their beliefs down everyone’s throats.",
          "timestamp": "2022-09-23 21:49:37",
          "score": 8,
          "num_children": 0,
          "author": 200407,
          "replies": []
        },
        {
          "id": "ipndi7z",
          "text": "When theists use political power to enforce their religion on others it is",
          "timestamp": "2022-09-23 22:18:21",
          "score": 8,
          "num_children": 0,
          "author": 322365,
          "replies": []
        },
        {
          "id": "ipp8hnk",
          "text": "That's because [you didn't read the FAQ.](https://www.reddit.com/r/atheism/wiki/faq#wiki_topics_that_belong_on_.2Fr.2Fatheism)\n\nRead it next time.",
          "timestamp": "2022-09-24 10:00:59",
          "score": 3,
          "num_children": 1,
          "author": 286151,
          "replies": [
            {
              "id": "ippf51m",
              "text": "So, because you assume he wants to make a law based on his religious beliefs, that makes it appropriate to come on here, cal him \"Christian taliban\" and demand everyone vote for his opponent?\n\nKind of stretching the \"what's appropriate\" section.",
              "timestamp": "2022-09-24 11:29:57",
              "score": 0,
              "num_children": 1,
              "author": 259457,
              "replies": [
                {
                  "id": "ipr312f",
                  "text": "Now you're changing the subject. You said \"I didn't realize this was a politics subreddit\" and I showed you where political discussion was deemed appropriate for this subreddit.",
                  "timestamp": "2022-09-24 19:25:10",
                  "score": 1,
                  "num_children": 1,
                  "author": 286151,
                  "replies": [
                    {
                      "id": "ipr38i5",
                      "text": "In some cases.  But it isn't a discussion.  This is a political statement at best, and an attack at worst.",
                      "timestamp": "2022-09-24 19:26:41",
                      "score": 1,
                      "num_children": 0,
                      "author": 259457,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ipmowb8",
      "text": "Voting is nowhere near good enough. We need to mobilize, to go to the streets! Check up riseup4abortionrights. The democrats have had multiple opportunities to codify abortion into law and decided not to.",
      "timestamp": "2022-09-23 19:14:59",
      "score": -14,
      "num_children": 3,
      "author": 75864,
      "replies": [
        {
          "id": "ipmzuib",
          "text": ">The democrats have had multiple opportunities to codify abortion into law and decided not to.\n\nThis tells me that you have not read and certainly never understood the Supreme Court's opinion in Roe v Wade. There was nothing to codify because the 4th 9th and 14th amendments are already codified and that is what the decision was based upon.",
          "timestamp": "2022-09-23 20:36:32",
          "score": 11,
          "num_children": 0,
          "author": 341254,
          "replies": []
        },
        {
          "id": "ipmvm5z",
          "text": "No they haven’t. Misinformation like this is what demoralizes people from doing anything.",
          "timestamp": "2022-09-23 20:05:11",
          "score": 9,
          "num_children": 1,
          "author": 236559,
          "replies": [
            {
              "id": "ipmxuko",
              "text": "They had majorities during Obama and didn't happened. Why trusting them again? Lying to people and wasting precious time is not a way out.",
              "timestamp": "2022-09-23 20:21:50",
              "score": -10,
              "num_children": 1,
              "author": 75864,
              "replies": [
                {
                  "id": "ipmy6zk",
                  "text": "…no they didn’t. At least ten dems in the senate when Obama came into power were Dixiecrats, meaning they weren’t pro-choice. Not only that other dems in the senate like Ted Kennedy died shortly after his inauguration. So no, Obama didn’t have a majority in reality. Second, idk if you remember but there was this thing known as a housing recession that was also going on and required more immediate attention compared to other issues. Can you imagine if Obama rolled up and instead of making the economy his primary focus he decided to use his lame-duck legislature on other issues?",
                  "timestamp": "2022-09-23 20:24:22",
                  "score": 11,
                  "num_children": 1,
                  "author": 236559,
                  "replies": [
                    {
                      "id": "ipojdod",
                      "text": "> Not only that other dems in the senate like Ted Kennedy died shortly after his inauguration. \n\nAnd it was also months before Al Franken was seated due to interminable recounts.  \n\nActual, in session time with 58 dems and two independents that tended to caucus with the dems was 3 weeks. And that is before we factor in Blue dogs (the better term for what you called Dixiecrats) and Joe Lieberman.",
                      "timestamp": "2022-09-24 04:25:38",
                      "score": 3,
                      "num_children": 0,
                      "author": 96335,
                      "replies": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ipmxs1g",
          "text": "The Dems have never had the support to codify Roe vs. Wade.",
          "timestamp": "2022-09-23 20:21:21",
          "score": 7,
          "num_children": 0,
          "author": 342708,
          "replies": []
        }
      ]
    },
    {
      "id": "ipmibep",
      "text": "Sucks that Stacy Abrams of all people needs to save the people of Georgia\n\nGeorgia deserves better choices\n\nAmerica deserves better",
      "timestamp": "2022-09-23 18:26:06",
      "score": -18,
      "num_children": 1,
      "author": 326565,
      "replies": [
        {
          "id": "ipmvcqr",
          "text": "Democrats are so incredibly out of touch that they'll keep throwing garbage like her at people over and over again.",
          "timestamp": "2022-09-23 20:03:11",
          "score": -15,
          "num_children": 1,
          "author": 231574,
          "replies": [
            {
              "id": "ipmvqrq",
              "text": "Garbage like her is what got Georgia to turn blue in 2020.",
              "timestamp": "2022-09-23 20:06:09",
              "score": 13,
              "num_children": 0,
              "author": 236559,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "ipm4i7i",
      "text": "[removed]",
      "timestamp": "2022-09-23 16:45:13",
      "score": -26,
      "num_children": 2,
      "replies": [
        {
          "id": "ipm7t3i",
          "text": "Republican presidents tend to increase the deficit with exorbitant military spending and tax breaks for the ultra-rich. Democrats decrease it with more responsible spending and reasonable taxes. There is no reason to be conflicted.",
          "timestamp": "2022-09-23 17:09:27",
          "score": 27,
          "num_children": 1,
          "author": 134055,
          "replies": [
            {
              "id": "ipm8829",
              "text": "But democrats tend to increase the deficit with social programs. And regulations and taxes to the economy which slows growth. Don't try to deny that both parties aren't fiscally responsible. They're both big spending.",
              "timestamp": "2022-09-23 17:12:33",
              "score": -30,
              "num_children": 5,
              "author": 190910,
              "replies": [
                {
                  "id": "ipmavnm",
                  "text": "One party is actively working against the fundamental rights of Americans and the other is the same to you because they use taxes to... Help others?",
                  "timestamp": "2022-09-23 17:31:44",
                  "score": 25,
                  "num_children": 0,
                  "author": 69014,
                  "replies": []
                },
                {
                  "id": "ipmb8z3",
                  "text": ">They're both big spending.\n\nOk. Then there's still no reason to be conflicted. One party does half of what you want and one party does none of what you want.",
                  "timestamp": "2022-09-23 17:34:23",
                  "score": 17,
                  "num_children": 0,
                  "author": 134055,
                  "replies": []
                },
                {
                  "id": "ipmbotk",
                  "text": "Yea, but you clearly haven't seen that simple chart of RvD fed deficit by president. It's super obvious.\nAlso, it's common knowledge that money \"handouts\" to the lowest class get spent into the local economy immediately, because, unfortunately, they don't have other options, leading to a feedback loop of growth.",
                  "timestamp": "2022-09-23 17:37:31",
                  "score": 15,
                  "num_children": 0,
                  "author": 390656,
                  "replies": []
                },
                {
                  "id": "ipmmdsy",
                  "text": "Is growth always a good thing?\nTaxes are just as instrumental as any discussion on spending to reduce inflation.\nRegulations are how we keep the air and water clean, workers safe, and maybe, just maybe, do at least our nation's part in curbing global catastrophe.",
                  "timestamp": "2022-09-23 18:56:15",
                  "score": 4,
                  "num_children": 0,
                  "author": 189619,
                  "replies": []
                },
                {
                  "id": "ipmcysi",
                  "text": "[Here's the best graph I was able to find on the topic] (https://imageio.forbes.com/specials-images/imageserve/5f3aae8bcb484ca497e0ae95/National-Debt--Percentage-Increase-by-President-Carter-to-Trump/960x0.jpg?format=jpg&width=960). It looks like the deficit does a little better under democratic presidents on average, though the difference isn't categorical.",
                  "timestamp": "2022-09-23 17:46:48",
                  "score": 6,
                  "num_children": 1,
                  "author": 52350,
                  "replies": [
                    {
                      "id": "ipme79r",
                      "text": "Though I'm curious to see the statistics for economic growth. And oftentimes economic growth is offset by some time compared to the implementation of policy. \n\nI identify as libertarian. Everyone should be free to do whatever they'd like, and we should have a mostly free market with low taxation.",
                      "timestamp": "2022-09-23 17:55:51",
                      "score": -6,
                      "num_children": 1,
                      "author": 190910,
                      "replies": [
                        {
                          "id": "ipnpyra",
                          "text": "If you are curious about economic growth, the only Republican to not hand off a recession to his democratic replacement in the past hundred years has been Eisenhower.\n\nEvery other republican has handed economic downturn to the Democratic replacement.\n\nDemocratic policies get just enough time to massively reduce the deficit and correct the course from the damage that republicans do every single time they take office.  Then the Republicans come in, wreck the place.\n\nAnd people like you act as if the Democrats have an equal chance to show what their policies would do if allowed to proceed in a stable environment.",
                          "timestamp": "2022-09-23 23:59:44",
                          "score": 2,
                          "num_children": 0,
                          "author": 96335,
                          "replies": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "ipmenn5",
          "text": "Condoms and sexual education are cheap. Plan b is more expensive. Abortions are more expensive. Daycare is more expensive. Programs to keep teens off the streets are more expensive. The prison system is more expensive. Society will have to pay somewhere, where on this list do you want it to be if you are fiscally conservative?",
          "timestamp": "2022-09-23 17:59:14",
          "score": 12,
          "num_children": 0,
          "author": 86779,
          "replies": []
        }
      ]
    },
    {
      "id": "ipmfgru",
      "text": "Too late to stop them at this point. Not enough people care.",
      "timestamp": "2022-09-23 18:05:15",
      "score": -17,
      "num_children": 2,
      "author": 334603,
      "replies": [
        {
          "id": "ipmgky4",
          "text": "They cared in Kansas.",
          "timestamp": "2022-09-23 18:13:31",
          "score": 19,
          "num_children": 0,
          "author": 286151,
          "replies": []
        },
        {
          "id": "ipmhumh",
          "text": "What are you, one of those cowardly, defeatist Russians I keep hearing about spreading their poisonous disinformation?",
          "timestamp": "2022-09-23 18:22:41",
          "score": 11,
          "num_children": 1,
          "author": 90838,
          "replies": [
            {
              "id": "ipmq2kn",
              "text": "No, just realistic.  They've been telling people what they were going to do for decades, and nobody cared.  I don't see that changing now.",
              "timestamp": "2022-09-23 19:23:41",
              "score": -11,
              "num_children": 1,
              "author": 334603,
              "replies": [
                {
                  "id": "ipmqp0w",
                  "text": "\"Nobody cared\". This seems an improbable and statistically impossible factoid. Millions and millions of people cared and continue to do so. All of your black and white thinking not withstanding.",
                  "timestamp": "2022-09-23 19:28:16",
                  "score": 11,
                  "num_children": 0,
                  "author": 90838,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "ippn1fm",
      "text": "Brain kemp 2022 Who cares about abortion all the other issues are more important and Stacey Abrams is a disgusting cow.",
      "timestamp": "2022-09-24 12:54:35",
      "score": -4,
      "num_children": 1,
      "author": 84151,
      "replies": [
        {
          "id": "ippnf0t",
          "text": "This is about contraception, not abortion. Hope you enjoy only having sex for procreation.",
          "timestamp": "2022-09-24 12:58:15",
          "score": 2,
          "num_children": 0,
          "author": 286151,
          "replies": []
        }
      ]
    },
    {
      "id": "ipnaqa8",
      "text": "I would love to see her win, but the odds are slim to none and slim just left town.",
      "timestamp": "2022-09-23 21:56:54",
      "score": -4,
      "num_children": 0,
      "author": 81550,
      "replies": []
    },
    {
      "id": "ipoj531",
      "text": "Pls. Fight for the right to cream pie. 🤷🏻‍♂️",
      "timestamp": "2022-09-24 04:23:01",
      "score": -2,
      "num_children": 0,
      "author": 13469,
      "replies": []
    },
    {
      "id": "ipp6bwq",
      "text": "Nah. Voting won't do anything. What we need, are **General Strikes everywhere** ***nationwide.***",
      "timestamp": "2022-09-24 09:29:06",
      "score": -2,
      "num_children": 0,
      "author": 200819,
      "replies": []
    }
  ]
}